{
  "stories": [
    {
      "by": "kalev",
      "descendants": 0,
      "id": 28095961,
      "score": 1,
      "time": 1628313820,
      "title": "Replacing EAV with Jsonb in PostgreSQL (2016)",
      "type": "story",
      "url": "https://coussej.github.io/2016/01/14/Replacing-EAV-with-JSONB-in-PostgreSQL/"
    },
    null,
    {
      "by": "TriNetra",
      "descendants": 0,
      "id": 28095924,
      "score": 1,
      "time": 1628313434,
      "title": "The Four Noble Truths",
      "type": "story",
      "url": "https://os.me/the-four-noble-truths/"
    },
    {
      "by": "camjohnson26",
      "descendants": 0,
      "id": 28095914,
      "score": 1,
      "time": 1628313269,
      "title": "Librem 5",
      "type": "story",
      "url": "https://puri.sm/products/librem-5-usa/"
    },
    {
      "by": "tjhill",
      "descendants": 0,
      "id": 28095913,
      "score": 1,
      "time": 1628313268,
      "title": "Divergent Association Task",
      "type": "story",
      "url": "https://www.datcreativity.com/"
    },
    {
      "by": "laurex",
      "descendants": 0,
      "id": 28095912,
      "score": 1,
      "time": 1628313246,
      "title": "To advance human rights, consult neuroscience",
      "type": "story",
      "url": "https://www.brown.edu/news/2021-08-05/dignity"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28095880,
      "score": 1,
      "time": 1628312853,
      "title": "Go Rod – A DevTools driver for web automation and scraping",
      "type": "story",
      "url": "https://go-rod.github.io/#/"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 28095829,
      "score": 1,
      "time": 1628312293,
      "title": "Inside The Reddit Forum That Wants to See Bitcoin Die",
      "type": "story",
      "url": "https://www.forbes.com/sites/abrambrown/2021/06/26/reddit-cryptocurrency-bitcoin-social-media/"
    },
    {
      "by": "lafernando7717",
      "descendants": 0,
      "id": 28095825,
      "score": 1,
      "time": 1628312265,
      "title": "Ask HN: What are the best cloud-based low-code development tools?",
      "type": "story"
    },
    {
      "by": "ThinkBeat",
      "descendants": 0,
      "id": 28095801,
      "score": 1,
      "text": "Given the rather fragile existence of any content on Facebook it would be nice to have the ability to preserve the content on a Facebook Group I have led for many years now.<p>There are lots of gems and goodies hidden in there.<p>The search system for Facebook Groups is dismal.<p>I have so far found no solution that works.<p>This is not just a wish for me or the other admins but a big wish from the community as well.<p>a) Various products &#x2F; systems based on scraping groups but only to (maliciously) scrape names, emails and whatever other contact information can be had.<p>That does not help me at all.<p>I do need to know the nick of the user, but I want is the actual content of discussions.<p>Further these products seem somewhat shady to me.<p>I dont really want some 3rd party to run it from their end either.<p>b) I have not been able to find enough of a an example of writing one.  I have found useful content on Python but I am missing some crucial pieces.<p>Like how do I run it in the context of my logged in browser (?)<p>I would like to do this as close a regular person browsing as possible to avoid FB taking offense.<p>c) I have tried some Macro plug ins for Firefox\nbut I cant get it to understand the recursive nature of threads.<p>Find the next thread is not hard, getting the first content is not hard,. but telling it to &quot;keep clicking&quot; all the way down is not something I have mastered yet.<p>d) I have tried doing it myself, little by little, copy and pasting, but it is soul crushing work and the body of content is huge.<p>I would prefer something I can run myself.\nI would prefer it to be slow. \nPresumably robot fast descent into every thread my wakeup FB bots?<p>I really wish FB would allow admins (with users voting for it) to download the content of their group to keep as a backup.<p>Are there any seasoned scrapers out there who can help me?",
      "time": 1628311986,
      "title": "Ask HN: Are there any web/text scrapers that work with Facebook Groups?",
      "type": "story"
    }
  ]
}