{
  "stories": [
    {
      "by": "throwaway47292",
      "descendants": 1,
      "id": 28683731,
      "kids": [
        28683733
      ],
      "score": 1,
      "time": 1632841884,
      "title": "Show HN: RFC) PUNK – 2 player strategy programming game for education (Python)",
      "type": "story",
      "url": "https://punkjazz.org/punk/"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 28683720,
      "score": 1,
      "time": 1632841848,
      "title": "Investing in Angle",
      "type": "story",
      "url": "https://a16z.com/2021/09/28/investing-in-angle/"
    },
    {
      "by": "taf2",
      "descendants": 0,
      "id": 28683694,
      "score": 1,
      "text": "I hear it a lot in news stories.  &quot;Scientists, say x or y...&quot;  But who are they?  I know plenty of engineers, doctors, lawyers... and even researchers... but who has a title that is scientist... or is it more of just a general term used when a news articles needs to sound smart?",
      "time": 1632841753,
      "title": "Ask HN: Who are all these scientists?",
      "type": "story"
    },
    {
      "by": "szczys",
      "descendants": 0,
      "id": 28683686,
      "score": 1,
      "time": 1632841726,
      "title": "Gopher, the Competing Standard to WWW in the ’90s Is Still Worth Checking Out",
      "type": "story",
      "url": "https://hackaday.com/2021/09/28/gopher-the-competing-standard-to-www-in-the-90s-is-still-worth-checking-out/"
    },
    {
      "by": "tchalla",
      "descendants": 0,
      "id": 28683684,
      "score": 1,
      "time": 1632841725,
      "title": "Why So Many People Are Unhappy in Retirement",
      "type": "story",
      "url": "https://www.theatlantic.com/family/archive/2020/05/what-the-heros-journey-teaches-about-happy-retirement/611194/"
    },
    {
      "by": "artpi",
      "descendants": 0,
      "id": 28683681,
      "score": 1,
      "time": 1632841720,
      "title": "Alexander von Humboldt: the first Solarpunk",
      "type": "story",
      "url": "https://piszek.com/2021/09/28/humboldt-the-first-solarpunk/"
    },
    {
      "by": "lottamus",
      "descendants": 0,
      "id": 28683673,
      "score": 1,
      "time": 1632841682,
      "title": "API-first vs. API design-first",
      "type": "story",
      "url": "https://blog.stoplight.io/api-first-vs.-api-design-first-a-comprehensive-guide"
    },
    {
      "by": "Datenstrom",
      "descendants": 0,
      "id": 28683643,
      "score": 1,
      "text": "Long time Firefox user but wondering if there is any even remotely usable option besides it that is not evil, not Brave, and not chrome based. Anyone following the development of a new browser? Is there an open source one I have missed?<p>Currently having a big issue with a site that will probably take a long time to get support for and I can&#x27;t even fire up a different browser for basic troubleshooting to see if it is firefox induced. Would be nice to have at least one alternative.",
      "time": 1632841539,
      "title": "Ask HN: Any alternative browsers that are not evil?",
      "type": "story"
    },
    {
      "by": "lapitopi",
      "descendants": 0,
      "id": 28683635,
      "score": 1,
      "time": 1632841468,
      "title": "How We Build Micro Front Ends with Lattice",
      "type": "story",
      "url": "https://netflixtechblog.medium.com/how-we-build-micro-frontends-with-lattice-22b8635f77ea"
    },
    {
      "by": "bfioca",
      "descendants": 0,
      "id": 28683597,
      "score": 2,
      "text": "My name is Brian Fioca and I’m the founder of RescueTime (<a href=\"https:&#x2F;&#x2F;www.rescuetime.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rescuetime.com</a>).  We help people who work on computers understand their time, be more focused, and feel less overwhelmed. Although we got started back in W08, we’ve entirely rewritten our product to focus on wellness and balance in this new age of working from home, and it’s this new version I want to tell you about today.<p>In 2008, we set out to answer the question, &quot;where did my time go?&quot; Those were the years of Web 2.0, and applications like Mint and Google Analytics were our inspiration. We spent years perfecting the ability to help people understand where their time goes, but people often told us to help them work smarter, not harder. Over the years, we switched to fully remote work ourselves, and found it&#x27;s more important to build good habits and set healthy boundaries than to measure where your time goes—we’ve seen how that can be counterproductive when it leads to lack of balance. So although we started in the productivity&#x2F;quantified-self space, we no longer think in terms of maximizing productivity.<p>When most people started working remotely or from home, and with the world unlikely to revert to exactly the way it was before, we decided to rewrite RescueTime to reflect this new thinking. Unlike our original version, the new RescueTime is designed to be used every day. Instead of weekly reports we give you daily forecasts, progress meters, nudges, and report cards. Our goal is to solve the pain that knowledge workers have about feeling overwhelmed, distracted, and unable to set healthy boundaries while working from their computers.<p>There&#x27;s no one-size-fits-all way to achieve work&#x2F;life balance.  We have over a decade of experience analyzing millions of (anonymous and aggregated) users&#x27; work habits and the use patterns of applications and websites for work purposes. This has given us a vast and unique historical knowledge engine backed by statistics which we rely on to identify individual needs and give useful, personalized help. You fill out a survey that asks you questions like, “are you a manager or an individual contributor?” and, “how many hours are in your target work day?” and we match your answers against historical data to give you a personalized “Focus Goal”, taking into consideration meetings and your work week schedule. We then help you navigate each day, alerting you when you&#x27;re distracted, helping you protect focused work time, and letting you know when you can stop working for the day.<p>Some of this is counterintuitive. For example, our decade’s worth of data has taught us quite consistently that the average knowledge worker spends 2-3 hours a day in focused work activities on their computer. Most people believe that the average is a lot higher, and therefore assume it should be a lot higher for them, leading to stressful feelings of inadequacy. Our data even shows if you spend too much time on focused work without sufficient recharge time, you will burn yourself out. We also know that it&#x27;s normal for knowledge workers to spend 2 hours per work day on personal tasks or away from their computer. It&#x27;s just as important to have space to be able to think creatively as it is to have focused time.<p>While building our new version, we decided that if our product really could do what we said it could do, we as a company should be able to switch to a 4-day (32 hour) work week. We even designed our personalization flow to support this. Using the new RescueTime, we&#x27;ve continued to be able to accomplish the same (or more) amount of work as we had when we were working 5 days a week!<p>Unlike simple Pomodoro timers, website blockers, or time trackers, we combine technologies into a holistic solution that, more like a fitness or mindfulness app, guides you into setting good habits and boundaries for every work day. Unlike other productivity tools, we understand the habits of all types of knowledge workers and can provide contextual advice about how to make the best use of your time, instead of just letting you know that you&#x27;ve spent more or less in different areas. We’re less &quot;Get Things Done&quot; and more &quot;Get to do More of What You Love.&quot;<p>RescueTime is a small application that runs in your Menu Bar or Task Tray that keeps an eye on the applications and websites you&#x27;re using throughout the day. It knows when you&#x27;re in work mode, what you consider focused work, meetings, and personal activities, and gives you advice on how to make the most out of your day. When it recognizes you&#x27;re in a good zone for focused work, it lets you shield yourself from distractions (like social media or news). When you&#x27;ve hit your goal of focused work, it lets you know that you can probably stop working for the day. It&#x27;s even smart enough to know that if you have a lot of meetings in a given day, your chances of meeting your focused work goal are lessened, and that&#x27;s ok.<p>RescueTime is best for people who feel overwhelmed with their workload but want to be more efficient, value their free time and want to have more of it, struggle with staying focused and avoiding distractions, or struggle with separating work time from personal time. It’s especially good for knowledge workers who want to work less in their free time, especially remote workers. If that sounds like you, we’d love for you to give it a try — we have a free 2 week trial.<p>Here’s a quick walkthrough video if you want to see it in action: <a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;606883007\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;606883007</a> and we’d love to hear from you about your thoughts on productivity and wellness in this new world of new ways most of us find ourselves working.",
      "time": 1632841279,
      "title": "Launch HN: RescueTime (YC W08) – Redesigned for wellness, balance, remote work",
      "type": "story"
    }
  ]
}