{
  "stories": [
    {
      "by": "chrisabraham",
      "descendants": 0,
      "id": 27958640,
      "score": 1,
      "time": 1627303173,
      "title": "We all want play dates, we all want a nice chat",
      "type": "story",
      "url": "https://www.listennotes.com/e/e1586a5b25264b788d4a7c833f9eb75f/"
    },
    {
      "by": "perfunctory",
      "descendants": 0,
      "id": 27958637,
      "score": 1,
      "time": 1627303142,
      "title": "Emissions will hit record high by 2023",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/jul/20/emissions-record-high-by-2023-if-green-recovery-fails-says-iea"
    },
    {
      "by": "ptc",
      "descendants": 0,
      "id": 27958620,
      "score": 1,
      "time": 1627303015,
      "title": "Understanding Systems: Facebook's Tectonic Filesystem",
      "type": "story",
      "url": "https://paulcavallaro.com/blog/facebook-tectonic-filesystem/"
    },
    {
      "by": "yshirazi",
      "descendants": 0,
      "id": 27958605,
      "score": 1,
      "text": "Hi HN, we’re Yasir and Zain introducing (<a href=\"https:&#x2F;&#x2F;instakin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;instakin.com</a> to you. We’re a platform to help immigrant communities manage tasks in their home countries.<p>Zain and I are originally from Pakistan and have been living in the US and Europe for 12 years. Personally, we have regularly sent funds back home to pay for tasks for ourselves and family members. Whether it is for paying home bills or a home renovation, we have done it all – just like millions of other migrants in the US – and experienced all the problems: funds getting misused, vendors pushing for advance payments and then disappearing…you name it and we have seen it. This got us thinking about a platform where we could connect migrants with vendors back home — something to reduce misuse of funds and ensure that vendors perform tasks as agreed.<p>Every year, 250M migrants send $550BN back home to pay for tasks for themselves and their families. Migrants far away from their native countries are dependent on family friends or unknown vendors to make decisions on their behalf. What many folks don’t know is that it is common for these funds to get misused, or for migrants to send funds to a vendor back home and receive poor service or get cheated.<p>We talked to hundreds of migrants from India, Bangladesh, Philippines, Uganda, and more, and found that lack of access to reliable vendors and misuse of remittance funds back home are common ‘migrant’ problems. Just last week, we came across a migrant from Senegal living in the USA who mentioned the same challenge.<p>Initially we operated on WhatsApp to receive orders from migrant customers and also get their feedback. Thousands of migrants contacted us within the first few months of launching our startup. That validation convinced us to build a full product—a solution for migrants built by migrants.  We have focused on two key features: (1) provide migrants with access to services back home, and (2) pay vendors based on milestones to eliminate payments fraud.<p>Historically, companies focusing on the migrant community have pushed for making it easier to send remittances back home easily though even today it can cost between 2-8% just to remit funds. Our key insight, though, is that money transfer is not enough. It is only transactional. What’s needed is to ensure last-mile fulfillment. With InstaKin, migrants don’t send funds back home ‘blindly’ hoping that things will get done — you pay for fulfillment directly.<p>Migrants use us to do things like: hiring a ‘runner’ to manage last-mile tasks for their aging parents back home; connecting to a vendor for verification and attestation of educational documents; ordering personalized gifts and having them delivered; paying contractors for home renovation project.<p>We started off with helping Pakistani migrants but our goal is to become the platform of choice for migrants globally. The best part is that while we were reaching out to Pakistani migrants, we started getting requests from other communities (Indian and Bangladeshi migrants).<p>We’ve been surprised at how strong immigrant networks are globally. When we launched, we thought we would receive orders from migrants in a specific city or location only. Turns out that is not true. We have had referrals from all over the world (example: a migrant customer living in London referred us to a migrant living in Chicago who referred us to a migrant living in Singapore). We hope what we are building will help migrants not just from one country but from everywhere in days to come.<p>We would love to hear back from the community. If you are a migrant yourself, please share your experiences with us and feel free to reach out.",
      "time": 1627302863,
      "title": "Launch HN: InstaKin (YC S21) - Help immigrants to manage tasks in home countries",
      "type": "story"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 27958603,
      "score": 1,
      "time": 1627302856,
      "title": "Development of a novel technology to check body temperature with smartphones",
      "type": "story",
      "url": "https://www.eurekalert.org/pub_releases/2021-07/nrco-doa072321.php"
    },
    {
      "by": "duddo",
      "descendants": 0,
      "id": 27958587,
      "score": 1,
      "time": 1627302732,
      "title": "CovidPass: Add EU Digital Covid Certificates to Wallet Apps",
      "type": "story",
      "url": "https://covidpass.marvinsextro.de"
    },
    {
      "by": "Quanttek",
      "descendants": 0,
      "id": 27958565,
      "score": 1,
      "time": 1627302529,
      "title": "AstraZeneca and the EU probably ruined Africa’s best chance out of the pandemic",
      "type": "story",
      "url": "https://www.politico.eu/article/how-astrazeneca-threw-away-its-shot/"
    },
    {
      "by": "imadr",
      "descendants": 0,
      "id": 27958542,
      "score": 1,
      "time": 1627302331,
      "title": "Seraphs: Procedurally Generated Voynich Manuscript",
      "type": "story",
      "url": "https://github.com/lizadaly/nanogenmo2014"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 27958524,
      "score": 1,
      "time": 1627302243,
      "title": "Global EV battery industry will be 'sold out' by 2025: BofA",
      "type": "story",
      "url": "https://finance.yahoo.com/news/global-ev-battery-industry-will-be-sold-out-by-2025-bof-a-201302540.html"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 27958517,
      "kids": [
        27958518
      ],
      "score": 1,
      "time": 1627302167,
      "title": "An Analysis of Speculative Type Confusion Vulnerabilities in the Wild",
      "type": "story",
      "url": "https://arxiv.org/abs/2106.15601"
    }
  ]
}