{
  "stories": [
    {
      "by": "docdeek",
      "descendants": 0,
      "id": 29001127,
      "score": 1,
      "time": 1635259861,
      "title": "Why Is This Cargo Container Emitting So Much Radiation?",
      "type": "story",
      "url": "https://www.wired.com/2011/10/ff-radioactivecargo/"
    },
    {
      "by": "thinkmassive",
      "descendants": 0,
      "id": 29001109,
      "score": 1,
      "time": 1635259777,
      "title": "New Oura Ring Generation 3",
      "type": "story",
      "url": "https://ouraring.com/product/heritage-black"
    },
    {
      "by": "schaeferlynch",
      "descendants": 1,
      "id": 29001099,
      "kids": [
        29001100
      ],
      "score": 1,
      "time": 1635259748,
      "title": "Circonus/Golang Engineer/Fully Remote/Full Time",
      "type": "story",
      "url": "https://www.linkedin.com/jobs/view/2748514449/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29001093,
      "score": 1,
      "time": 1635259714,
      "title": "Photoshop's Journey to the Web",
      "type": "story",
      "url": "https://web.dev/ps-on-the-web/"
    },
    {
      "by": "gojiberries",
      "descendants": 0,
      "id": 29001083,
      "score": 1,
      "time": 1635259658,
      "title": "Gofire: A command line interface generator tool for Go",
      "type": "story",
      "url": "https://github.com/1pkg/gofire"
    },
    {
      "by": "matthewsinclair",
      "descendants": 0,
      "id": 29001078,
      "score": 1,
      "time": 1635259644,
      "title": "Taiwan's Foxconn shows off three electric vehicle prototypes",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/taiwans-foxconn-shows-off-three-electric-vehicle-prototypes-2021-10-18/"
    },
    {
      "by": "steveshreeve",
      "descendants": 0,
      "id": 29001063,
      "score": 1,
      "text": "Hi Steve,<p>Thanks for reaching out, I hope this email finds you well. I have thoughtfully checked the information you provided to provide you a comprehensive answer. I completely understand your concern regarding the reserve placed in your account since you don&#x27;t see any dispute on it. I know how important it is for you so I am here to provide you with the best information possible about this issue.<p>First of all, I understand how handy a phone call could be, however, while we would love to call you to discuss this issue, I’m afraid we currently do not support phone calls in my department due to the nature of the types of emails we deal with. We are often required to investigate a wide range of topics to resolve issues for our users, and as such, would be quite difficult to deal with via a phone call. I do apologize for any inconvenience this may cause you but I am more than glad to assist you via email.<p>As regards to the status of your reserve, I want to apologize for the misunderstanding in the information provided, we completely understand that your dispute rate is under 1% since there is only one dispute in your account that occured on 2020, however, we are sharing with you that it is difficult for us to support businesses with dispute rates above 1% (by volume or count) on an ongoing basis. Based on that information, we&#x27;re concerned about the risk your disputes might reach 1%, not that you&#x27;re already reached that threshold.<p>Let me share with you that Stripe takes really serious risks in businesses, it’s the reason why we continue to do periodic reviews of each account over its lifetime, during a standard review of your account, we perceived there is a high likelihood for future chargebacks that exceed the rate we&#x27;re able to support without a reserve based on those policies, and so we&#x27;re required to hold onto some or all of your funds for this period of time. This hold on funds helps protect Stripe and your customers from potential fraud or disputes.<p>We completely understand that at this moment you just have one dispute, however, this reserve is set up to cover future disputes, chargebacks and refunds. I&#x27;m afraid we can&#x27;t offer much in the way of specifics regarding our review process for the sake of security. You can review your reserve balance within your Dashboard at any time:<p>https:&#x2F;&#x2F;dashboard.stripe.com&#x2F;balance<p>The earliest we may be able to release these funds is 45 days from the date the reserve began on October 26th. If you write in again after those 45 days has passed, I’ll be happy to submit your request for early release. To clarify, we can&#x27;t guarantee your funds will be released prior to the original noted 90 day mark, though we will review your account for potential exemption. We&#x27;re sorry that we couldn&#x27;t get your funds to you earlier, unfortunately our hands are tied here and I wish I could provide you with better news. Please rest assured that we do this as a precaution to help make sure your customers can get their refunds on time. If you’d like to know more about our guidelines, here’s a very handy link:<p>https:&#x2F;&#x2F;stripe.com&#x2F;legal<p>We completely understand if you feel this isn’t right for your business and we’re very sorry that this creates an inconvenience for you at the moment. We’d love to continue working with you and if there’s anything else we can do to assist you, please feel free to let us know.<p>My warmest regards,\nRose",
      "time": 1635259596,
      "title": "Stripe pre-emptively places holds on accounts, warmest regards",
      "type": "story"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 29001050,
      "score": 1,
      "time": 1635259564,
      "title": "Right to Internet Access",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Right_to_Internet_access"
    },
    {
      "by": "lukaszmtw",
      "descendants": 1,
      "id": 29001046,
      "kids": [
        29001092
      ],
      "score": 2,
      "time": 1635259539,
      "title": "Show HN: TopNotch.app – Hide the notch on your new MacBook",
      "type": "story",
      "url": "https://topnotch.app"
    },
    {
      "by": "dustintrex",
      "descendants": 0,
      "id": 29001045,
      "score": 1,
      "time": 1635259509,
      "title": "Mars the Arrival: an ode to the slowest game in the world",
      "type": "story",
      "url": "https://gyrovague.com/2021/10/27/mars-the-arrival-an-ode-to-the-slowest-game-in-the-world/"
    }
  ]
}