{
  "stories": [
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31834449,
      "score": 2,
      "time": 1655896226,
      "title": "Reducing Android Build Times on Azure by 80% Using a Virtual Machine Scale Set",
      "type": "story",
      "url": "https://cekrem.github.io/posts/reducing-android-build-times-on-azure-by-80/"
    },
    {
      "by": "dominuskelvin",
      "descendants": 0,
      "id": 31834433,
      "score": 1,
      "time": 1655896128,
      "title": "Sailsconf 2022 kicks off today with Mike McNeil's Keynote",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=OME5lQUJ4q4"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31834425,
      "score": 1,
      "time": 1655896058,
      "title": "State of Open Source Security 2022",
      "type": "story",
      "url": "https://snyk.io/reports/open-source-security/"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 31834418,
      "score": 1,
      "time": 1655896007,
      "title": "State Machines in Ruby: An Introduction",
      "type": "story",
      "url": "https://blog.appsignal.com/2022/06/22/state-machines-in-ruby-an-introduction.html"
    },
    {
      "by": "jaumaff",
      "descendants": 0,
      "id": 31834416,
      "score": 1,
      "time": 1655895986,
      "title": "Tracking Ethereum blockchain attackers: Measuring sandwich attacks",
      "type": "story",
      "url": "https://www.tarlogic.com/blog/tracking-ethereum-blockchain-attackers-measuring-sandwich-attacks/"
    },
    {
      "by": "monkeydust",
      "descendants": 0,
      "id": 31834411,
      "score": 1,
      "time": 1655895961,
      "title": "Even your boss wants to quit",
      "type": "story",
      "url": "https://www.axios.com/2022/06/22/ceo-csuite-burnout-pandemic-great-resignation"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 31834408,
      "score": 1,
      "time": 1655895947,
      "title": "The Go Netpoller",
      "type": "story",
      "url": "https://morsmachine.dk/netpoller"
    },
    {
      "by": "uturantekin",
      "descendants": 0,
      "id": 31834401,
      "score": 1,
      "text": "https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;launchese-for-entrepreneurs<p>Hello Guys<p>I’m Uygar, co-founder of Launchese. We’re FINALLY very excited to share with you what the Launchese team is working on.<p>We need your support and feedback on ProductHunt!<p>https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;launchese-for-entrepreneurs<p>-- My background!<p>I have always loved e-commerce and the internet. Since 2000, I have focused on doing something online. I have tried many things and failed many times. I have shared all my experiences. Without realising it, we built an online family.<p>-- What was the problem?<p>Being in this online family gave me a great chance to learn about what challenges entrepreneurs could face when they start their journey. Especially if they are not living in the UK, USA or Europe, their options are extremely limited. Setting up a company for their startup, getting bank accounts and payment gateways, finding the right financial tools, bookkeeping, accounting, regulations, KYC and AML checks. Those boring but essential setups are not that easy if you are not living in the UK.<p>-- How did we start?<p>Then we decided to help them with my partner Yousef Khalidi. We launched the beta version of Launchese in March 2019. Our main goal was to help online entrepreneurs start their eCommerce business in the UK, so they do not need to struggle to find the right tools to run their business. When we started, that was a side hustle for us and we kept it that way for a long long time. -<p>- How do we help Entrepreneurs?<p>First of all, we are not a company formation solution. We are far more than that! We are here to help startups and online entrepreneurs AS ONLINE ENTREPRENEURS. We are trying to provide the easiest way for anyone to launch and run a UK business.<p>* Incorporate your company * Set up a payment gateway, * Get a business bank account, * Have your cross-border payment tools * Access growth tools and new marketplaces * Stay compliant * Sort out your bookkeeping and accountancy And manage everything your business needs, all online, from anywhere. And most importantly, get help from people who know online business and problems you are facing with. With real people, not an AI.<p>-- Who do we work with?<p>We are working with industry leaders in e-commerce. Payoneer, Tide Bank, Wise, Stripe, ClearBanc, Xero, Jeeves, Juni, Shopify, BigCommerce and more. When we say we work with those people, we mean it. We talk to those companies, share your feedback, and chase them to find a solution.<p>-- Why now for Product Hunt?<p>Product Hunt is a special place for us and we wanted to start from here. I believe we are ready to be more visible and introduce ourselves more to the community. We want you to try and review our services, and we are always here to hear from you.<p>We hope that you find Launchese valuable for your e-commerce project. And excited to hear everyone&#x27;s thoughts and reactions!<p>Thank you all Uygar, Yousef, Mounir, Jennifer, Chony, Paulina, Daniel, Vicky, Mehmet, Samuel, Vikas!",
      "time": 1655895860,
      "title": "Launchese for Entrepreneurs is live on ProductHunt Please support us",
      "type": "story"
    },
    {
      "by": "alainchabat",
      "descendants": 0,
      "id": 31834390,
      "score": 1,
      "time": 1655895789,
      "title": "Who killed my pod – Whodunit?",
      "type": "story",
      "url": "https://suneeta-mall.github.io/2021/03/14/wth-who-killed-my-pod.html"
    },
    {
      "by": "lycopodiopsida",
      "descendants": 0,
      "id": 31834387,
      "score": 1,
      "time": 1655895759,
      "title": "The Business Impact of Code Quality",
      "type": "story",
      "url": "https://arxiv-export1.library.cornell.edu/pdf/2203.04374"
    }
  ]
}