{
  "stories": [
    {
      "by": "exikyut",
      "descendants": 0,
      "id": 28340101,
      "score": 1,
      "time": 1630173899,
      "title": "Watch Windows 95 crash live as it exceeds 49.7 days uptime [livestream]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tdrRoSdBM5M"
    },
    {
      "by": "recursivedoubts",
      "descendants": 0,
      "id": 28340080,
      "score": 1,
      "time": 1630173758,
      "title": "Locality of Behavior (Lob)",
      "type": "story",
      "url": "https://htmx.org/essays/locality-of-behaviour/"
    },
    {
      "by": "KLFaraaz",
      "descendants": 0,
      "id": 28339991,
      "score": 1,
      "text": "Hi HN, we&#x27;re Ahmad, Sashakt, and Harshit of Kalam Labs (<a href=\"https:&#x2F;&#x2F;www.kalamlabs.in&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kalamlabs.in&#x2F;</a>). Kalam Labs lets 6 to 14 year old kids learn their favourite science topics by watching live game streams and playing science games. It&#x27;s like Twitch for science, except you also get to play :)<p>Here&#x27;s a sample video of our live stream: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QGMmUg0N0HE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QGMmUg0N0HE</a><p>High curiosity in kids is directly linked to better academic performance and better outcomes when they grow up. However, school leads to a drop in curiosity as they discourage asking questions and encourage “focussing on the blackboard.” Parents don’t have a solution, as internet resources are unstructured and unreliable and encyclopedias are static and boring for the kids.<p>We were batchmates at our undergraduate degrees and worked together at India&#x27;s largest educational body, NCERT. There we interacted with hundreds of kids, and they were really curious about science. Their heads were filled with questions like: Why is the sky blue? What is inside a black hole? etc. But the conventional teaching mediums were just too boring for them. So we started searching what do they want?<p>Turns out almost every kid was on Roblox and Minecraft. There were entire communities there hanging out, hosting live streams chatting with each other. Digging deeper, we saw that Roblox and Minecraft are being extensively used as educational media. Microsoft has launched Minecraft for Education and Roblox has launched Roblox Education, and this was prompting teachers to migrate from Zoom to these multiplayer games. So we got it: we will use live game streaming to help kids learn science. We launched our MVP and saw phenomenal results. Generating $1k USD revenue in just a couple of days, we saw a market potential of scaling it and hence decided to start a startup around it.<p>At Kalam Labs we host daily live game streams on kids&#x27; favourite science topics like space, black holes, and dinosaurs. During the live stream, an instructor takes the kids around a virtual world where they learn new topics by playing game-based exercises. The cool parts are: unlike a typical live game-stream on Twitch&#x2F;YT where only the video of instructor playing a game is shared, at Kalam Labs kids can play the game with the instructor. This helps the instructor to give short fun activities for kids to solve for explaining any topic. In addition, our Live Chat has a tag-feature, which is really loved by kids. Instead of typing the entire chat, kids can just tap on the different recommendations and convey their thoughts. This leads to very high-engagement with sometimes kids liking the tapping feature more than the game itself.<p>We are seeing cool metrics pop out due to this: Our average watch time of a live stream is 40 minutes - 5x higher than Youtube. Further, just launched in Mid-June our product has amassed thousands of paying customers growing 50% week-over-week.<p>Please share your thoughts and feedback!",
      "time": 1630173077,
      "title": "Launch HN: Kalam Labs (YC S21) – Science Games and live game streaming for kids",
      "type": "story"
    },
    {
      "by": "mrpf1ster",
      "descendants": 0,
      "id": 28339983,
      "score": 2,
      "time": 1630172990,
      "title": "David Foster Wallce – This Is Water",
      "type": "story",
      "url": "https://fs.blog/2012/04/david-foster-wallace-this-is-water/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28339965,
      "score": 2,
      "time": 1630172897,
      "title": "Blue Origin suit keeps causing DOJ's Adobe software to crash",
      "type": "story",
      "url": "https://twitter.com/joroulette/status/1431299991142809602"
    },
    {
      "by": "rukshn",
      "descendants": 0,
      "id": 28339957,
      "score": 1,
      "time": 1630172849,
      "title": "Trying to Be a Project Manager",
      "type": "story",
      "url": "https://ruky.me/2021/08/28/trying-to-be-a-project-manager/"
    },
    {
      "by": "smitty1e",
      "descendants": 0,
      "id": 28339929,
      "score": 3,
      "time": 1630172635,
      "title": "Why Are People Apple Users?",
      "type": "story",
      "url": "https://irreal.org/blog/?p=9937"
    },
    {
      "by": "afrcnc",
      "descendants": 0,
      "id": 28339919,
      "score": 2,
      "time": 1630172575,
      "title": "Amazon urges FCC to reject SpaceX proposals for next-generation Starlink",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/08/amazon-and-spacex-fight-over-starlink-plan-for-30000-more-satellites/"
    },
    {
      "by": "testing_1_2_3_4",
      "descendants": 0,
      "id": 28339907,
      "score": 2,
      "text": "Hey HN!<p>I&#x27;ve been working on this idea off and on for a few weeks now and I figured it was time to show it to folks before continuing to build it out any further (hence the terrible UI).<p>The idea is this: A smart contract that allows players to win the tokens in the contract in proportion to the number of tokens they&#x27;ve depositing into the smart contract.  For example, if you and another player enter a round with 1 token each, you both have a 50&#x2F;50 shot of winning the other&#x27;s token.  Here&#x27;s the catch.  Anyone can end the round at any moment, even people who haven&#x27;t deposited any tokens.<p>The contract is currently deployed to Rinkeby and I currently hold all of the Degen Raffle Tokens (DRT) needed to enter the raffle.  If you&#x27;re interested in playing, let me know and I&#x27;ll send you a few million.<p>https:&#x2F;&#x2F;d19h3r5ramsh27.cloudfront.net&#x2F;",
      "time": 1630172496,
      "title": "Show HN: Degen Raffle – A raffle built on Ethereum",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28339897,
      "score": 1,
      "time": 1630172454,
      "title": "We Explored the World’s Largest Doomsday Community (575 Bunkers) [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=QW6DIchOpnc"
    }
  ]
}