{
  "stories": [
    {
      "by": "notoriousarun",
      "descendants": 0,
      "id": 27760154,
      "score": 1,
      "time": 1625659647,
      "title": "SQL Join Types Explained in Visuals",
      "type": "story",
      "url": "https://dataschool.com/how-to-teach-people-sql/sql-join-types-explained-visually/"
    },
    {
      "by": "ardabulut",
      "descendants": 0,
      "id": 27760153,
      "score": 2,
      "time": 1625659643,
      "title": "How We Built a Free Survey Tool In 48 Hours",
      "type": "story",
      "url": "https://hockeystack.com/blog/survey-tool-challenge"
    },
    {
      "by": "meowster",
      "descendants": 0,
      "id": 27760131,
      "score": 1,
      "time": 1625659475,
      "title": "Debit Card Apps for Kids Are Collecting a Shocking Amount of Personal Data",
      "type": "story",
      "url": "https://www.vice.com/en/article/4avqx3/debit-card-apps-for-kids-are-collecting-a-shocking-amount-of-personal-data"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 27760113,
      "score": 1,
      "time": 1625659370,
      "title": "Google Chat review: Terrible as Slack clone, but good as a consumer chat app",
      "type": "story",
      "url": "https://arstechnica.com/?p=1773681"
    },
    {
      "by": "gccs",
      "descendants": 1,
      "id": 27760090,
      "kids": [
        27760152
      ],
      "score": 1,
      "text": "Not all projects can afford the hundreds of dollars per month that the popular paid tools cost. We have no revenue and no funds to spend. But, we would benefit from being able to improve out landing page and app functionality.",
      "time": 1625659266,
      "title": "Ask HN: Are there any open source A/B testing tools?",
      "type": "story"
    },
    {
      "by": "HiroProtagonist",
      "descendants": 0,
      "id": 27760076,
      "score": 1,
      "time": 1625659200,
      "title": "BMW leads US luxury market with better access to chips",
      "type": "story",
      "url": "https://www.explica.co/bmw-leads-us-luxury-market-with-better-access-to-chips.html"
    },
    {
      "by": "rkrzr",
      "descendants": 0,
      "id": 27760073,
      "score": 10,
      "time": 1625659180,
      "title": "Dbcritic: Constructively criticizing your Postgres schema (using Idris)",
      "type": "story",
      "url": "https://www.channable.com/tech/dbcritic-constructively-criticizing-your-postgres-schema"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 27760071,
      "score": 1,
      "time": 1625659169,
      "title": "Why a more feminist internet would be better for everyone",
      "type": "story",
      "url": "https://www.technologyreview.com/2021/04/01/1020478/feminist-internet-culture-activist-harassment-herd-signal/"
    },
    {
      "by": "alezozov",
      "descendants": 0,
      "id": 27760067,
      "score": 1,
      "text": "link:https:&#x2F;&#x2F;mindgifts.org&#x2F;#&#x2F;shop&#x2F;p&#x2F;60587d6444b23535a7ab1292<p>Can you agree that nothing can compare with a feeling when you successfully control your life, achieve your wildest dreams, and have time for everything you want?<p>It is possible when you hacked your time and made a Quantum Time Leap...<p>Hi. My name is Alex Zozovsky. In the beginning, I was not planning to become a productivity and effectiveness expert. Even if others call me so now ... I am an engineer and computer scientist who creates complex software solutions.<p>Years ago, I faced a situation when I was overworked, overwhelmed, busy, but not productive. I juggled 9+ responsibilities and constantly had no time to be free and do what I love.<p>As a result, I had a low energy level and lacked motivation. My goals were literally tanking, and I could not make my dreams a reality...<p>I tried numerous time management and productivity systems and tricks… they worked for a bit and then stopped.<p>I even traveled to India to get answers to my questions!<p>And just as the bridge builder was going under his newly built bridge to prove it is secure and works. I tested and refined the system in my own life first…<p>Before presenting the Time Hacking Formula to others.<p>The same secrets pushed me to:<p>- Win national competitions in programming and robotics.\n- Do what I love and realize my dreams.\n- Help other people build projects and create products that change lives.<p>That&#x27;s why I decided to document top effectiveness knowledge into an e-book course of 10 modules and 3 bonus chapters (236 pages).<p>10 Deep Modules Will Give You Access To:<p>- 10 KNOWLEDGE SECTIONS (It is jam-packed with only essential “meat” information required for your insights and will prepare you for Time Hacker transformation)\n-10 PRACTICE SECTIONS (74 exercises and tasks in total will help you to internalize and practice gems you learned in the knowledge sections)\n- 10 QUIZZES will help you to challenge your knowledge of each module material\n- 10+ PERSONAL STORIES AND EXAMPLES inside the training from the lives of famous time hackers will give you inspiration and know-how\n- SHORT FORMAT: each knowledge and practice sections are precise + concise and have a length of around 20-30 minutes long to absorb - so you will not waste time on unimportant fluff\n- E-BOOK PDF FORMAT: easy navigation through lessons on any device will help you to learn and apply information fast and convenient<p>Here are 11 Things Having Time Hacking Formula Does For You In Your Life:<p>- Leverages opportunities using Time Leaps where others don’t see them and makes your road to success shorter and more accessible!\n- Increases effectiveness and speed of achieving your goals (hint: establishes special pacts with your subconscious mind)!\n- Saves time by doing more with less and doing only necessary!\n- Provides a philosophy to protect you from losing a minute of your time anymore!\n- Turns you into a Decisive Machine for making decisions fast and without procrastination!\n- Transform you into a Master Prioritizer and Planer to leverage Domino Effect to make the most significant achievements!\n- Gives you focus and indestructibility from your way!\n- Fuels your energy tanks for peak productivity!\n- Produces your meaningful work and creates maximum output from every minute of your life!\n- Shows you how to accomplish what you love almost in an autopilot state!\n- Makes you centered and manages your attention, body, emotions, and will for top productivity!<p>It&#x27;s taken me a decade of in-the-trenches improving my own effectiveness to discover and develop what you&#x27;ll find in this training.<p>Not to mention thousands of $ invested in mentors, courses, research, reading top 100 books on productivity, years of personal successes and mistakes ...<p>- Get the first module For Free now.\n- Try It Risk-Free For 30 Days!\n- Looking for your feedback ideas<p>https:&#x2F;&#x2F;mindgifts.org&#x2F;#&#x2F;shop&#x2F;p&#x2F;60587d6444b23535a7ab1292",
      "time": 1625659147,
      "title": "Created My First Digital Product: Time Hacking Formula [E-Book]",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27760065,
      "score": 1,
      "time": 1625659133,
      "title": "Intel Hybrid CPU Starts 'End of Life' Process",
      "type": "story",
      "url": "https://www.anandtech.com/show/16808/intel-hybrid-cpu-starts-end-of-life-process"
    }
  ]
}