{
  "stories": [
    {
      "by": "limoce",
      "descendants": 0,
      "id": 30612728,
      "score": 1,
      "time": 1646819619,
      "title": "China to provide 5 mln yuan worth of humanitarian assistance to Ukraine",
      "type": "story",
      "url": "https://www.reuters.com/world/china-provide-5-mln-yuan-worth-humanitarian-assistance-ukraine-2022-03-09/"
    },
    {
      "by": "seobriansmith",
      "descendants": 0,
      "id": 30612718,
      "score": 1,
      "time": 1646819510,
      "title": "10 Best PDF Electronic Document Signing Software in 2022",
      "type": "story",
      "url": "https://www.linkedin.com/pulse/best-pdf-electronic-document-signing-software-growth-hacker"
    },
    {
      "by": "rchachra",
      "descendants": 0,
      "id": 30612691,
      "score": 3,
      "text": "Hey HN! We are Ravi and Vijay from 8vdX! We are building a founder-friendly venture debt marketplace for early stage startups. We also provide seed-extension debt to breakout companies to extend their runway to get to a better Series A raise. Our mission is to be the preferred debt partner for high growth startups and scale with them as they grow from seed stage to Series A and beyond.<p>Vijay and I were both working at Eight Capital, a high yield fund that I cofounded, when we gave a bridge loan to Kodo (a startup from YC W21) to support their high growth rate while they were getting their YC funding. Kodo is an Indian company and had to complete some standard processes for that to happen, but they needed money right away. Our loan allowed them to accelerate their growth and they ended up having an amazing Demo Day result.<p>We wondered, could this be repeated with other startups or was it a one and done investment? We looked at publicly available data and quickly came to the conclusion that we could indeed underwrite venture debt to seed to early stage startups. That was the genesis of the 8vdX venture debt marketplace.<p>We launched 3 months ago and have already provided venture debt to 16 startups. In good YC fashion, we’ve been focused on our batchmates to begin with :) But we believe this model can scale beyond the YC ecosystem and we’re very interested in that.<p>Why do we think this makes sense right now? Seed rounds today are the same size as Series A used to be a decade ago. But there are no existing players who provide venture debt to early stage startups. Last year, seed and early stage and Series A startups raised ~$100B from equity investors. Venture debt can be up to 25% of the balance sheet of these rapidly growing companies, making this a $25B annual opportunity in this underserved market.<p>Our loans are founder friendly. We do not force founders to open captive bank accounts, cash flow sweeps, take personal guarantees of the founders, or force the startup into bankruptcy if the startup is unable to repay. We have a simple and transparent application process to receive funds through the 8vdX digital platform.<p>Currently, startups can apply digitally for up to $150k of debt by visiting our startup portal at 8vdx.com, and upon approval, the funds are wired to their account on the same day. 8vdX has a capital-light business model as the venture debt to the startups are entirely funded by angels and institutional investors through the marketplace. We have a deep product pipeline which includes multi-currency venture debt that can be extended on day zero to international companies. We will be supporting local currency venture debt for startups in India, Australia, United Kingdom, Mexico and Indonesia for the YC S22 batch and our goal is to support even more countries in the future. We are also inviting platform partnerships from online investment apps to distribute the 8vdX venture debt offering to their clients.<p>Vijay and I look forward to hearing your ideas, questions and feedback. Thank you!",
      "time": 1646819230,
      "title": "Launch HN: 8vdX (YC W22) – Venture debt to complement a seed round",
      "type": "story"
    },
    {
      "by": "newswasboring",
      "descendants": 0,
      "id": 30612662,
      "score": 1,
      "time": 1646819002,
      "title": "Researchers build neural networks with actual neurons",
      "type": "story",
      "url": "https://hackaday.com/2022/03/01/researchers-build-neural-networks-with-actual-neurons/"
    },
    {
      "by": "Aspose_Cloud",
      "descendants": 0,
      "id": 30612646,
      "score": 1,
      "text": "Aspose.Total Cloud offers REST based SDKs providing the capabilities for document generation, conversion &amp; automation platform.  The SDKs can be called from any platform: .NET, Java, Ruby, Salesforce, &amp; Amazon etc. It makes easier for the Web &amp; Mobile application developers to use our award winning SDKs to work with MS Word documents, Excel spreadsheets, PowerPoint presentations, Adobe PDFs, OpenDocument formats, Barcodes, OCR, Microsoft Visio Diagrams &amp; Email formats &amp; protocols in their apps.",
      "time": 1646818909,
      "title": "Cloud APIs and SDKs to Create, Edit and Manage Word, Excel, PDF and More",
      "type": "story"
    },
    {
      "by": "lichtenberger",
      "descendants": 0,
      "id": 30612623,
      "score": 1,
      "time": 1646818677,
      "title": "Query Execution in MonetDB – Martin Kersten",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=h5BqtPDV7E8"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30612572,
      "score": 1,
      "time": 1646818296,
      "title": "Info Stealer in a Batch File",
      "type": "story",
      "url": "https://isc.sans.edu/forums/diary/Infostealer+in+a+Batch+File/28422"
    },
    {
      "by": "jasenhudson",
      "descendants": 0,
      "id": 30612541,
      "score": 1,
      "time": 1646818038,
      "title": "How to Create Push Notification for WordPress Websites?",
      "type": "story",
      "url": "https://wonderpushblogs.blogspot.com/2022/03/how-to-create-push-notification-for.html"
    },
    {
      "by": "codewiz",
      "descendants": 0,
      "id": 30612532,
      "score": 2,
      "time": 1646817944,
      "title": "I have recorded over 300 Amiga demos. Here they are",
      "type": "story",
      "url": "https://old.reddit.com/r/amiga/comments/t9hyg8/i_have_recorded_over_300_amiga_demos_here_they_are/"
    },
    {
      "by": "kapil-arwin",
      "descendants": 0,
      "id": 30612453,
      "score": 2,
      "time": 1646817096,
      "title": "Google Summer of Code 2022 with SeaQL",
      "type": "story",
      "url": "https://www.sea-ql.org/SeaORM/blog/gsoc-2022/"
    }
  ]
}