{
  "stories": [
    {
      "by": "myth_drannon",
      "descendants": 0,
      "id": 30610676,
      "score": 1,
      "time": 1646797420,
      "title": "The Waning of Ruby and Rails",
      "type": "story",
      "url": "https://berk.es/2022/03/08/the-waning-of-ruby-and-rails/"
    },
    {
      "by": "popcornylu",
      "descendants": 0,
      "id": 30610670,
      "score": 1,
      "text": "Just tar your data and put it in s3? use a shared folder in NFS? or use git-like solutions, like DVC, Git LFS?<p>Undoubtedly, putting large files in s3 (or similar object store) or NFS is the most common solution. However, when it comes to version control, Git is the defacto solution. But Git is not designed for versioning large files. If we want to put large files on S3, why don’t we just use a tool that does the data versioning just on top of S3? This is the motivation why we develop the ArtiV(Artifact Versions), a version control tool for large files.<p>For more detail, I recommend you to read this blog post \nhttps:&#x2F;&#x2F;blog.infuseai.io&#x2F;a-modern-approach-to-versioning-large-datasets-for-machine-learning-fca2f541dd85<p>Or check out our git repository https:&#x2F;&#x2F;github.com&#x2F;InfuseAI&#x2F;artiv",
      "time": 1646797378,
      "title": "How do you version your large files for machine learning?",
      "type": "story"
    },
    {
      "by": "gicoco",
      "descendants": 0,
      "id": 30610666,
      "score": 1,
      "time": 1646797358,
      "title": "IK Pharmacy",
      "type": "story",
      "url": "https://www.ikpharmacy.net/buy-2c-b-powder-online/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30610665,
      "score": 1,
      "time": 1646797357,
      "title": "Tor Browser – 11.0.7 – Release 2022-03-08 (Windows, macOS, Linux)",
      "type": "story",
      "url": "https://blog.torproject.org/new-release-tor-browser-1107/"
    },
    {
      "by": "cutler",
      "descendants": 0,
      "id": 30610656,
      "score": 1,
      "text": "We&#x27;ve all heard the tech industry&#x27;s lament that there are not enough software engineers to meet demand but you wouldn&#x27;t know it judging by some of the brain-dead hiring processes I come across routinely after 20 years as a software engineer. Typically experience in solving business problems with code gets lost in a fog of buzzword devops criteria in the initial stage interview before the candidate has had a chance to display any proficiency as a software developer. It&#x27;s not that Agile isn&#x27;t important but prioritising it above the ability to solve business problems is just plain wrong. So I have resolved to present all future interviewers with my own set of criteria before a minute of my time is wasted and I hope this may be of use to some of you who find yourself in a similar situation.<p>Hi &lt;interviewer name&gt;<p>I understand that I am applying for a Ruby developer role and I am happy to be interviewed based on my ability to solve business problems with Ruby. If your selection process prioritises other criteria, however, such as proficiency with:<p><pre><code>    - Agile methodology \n    - Continuous Integration&#x2F;Delivery\n    - Containerisation (Docker, Kubernetes)  \n    - Deployment (AWS, Azure, GCP)\n    - Message queues\n    - Caching strategies\n</code></pre>\n... then I will not be applying for the role as I consider these to be skills which a developer should be given the chance to acquire on the job.<p>I am happy to participate in a single-stage code interview according to the following criteria:<p><pre><code>    - It shall not exceed 2 hours.\n    - No-one will be looking over my shoulder.\n    - The subject matter of the code test be representative of your business domain.\n    - No abstract algorithm quizzes.\n</code></pre>\nIf &quot;cultural fit&quot; is more important to you than my ability to solve business problems with code then let&#x27;s not waste each other&#x27;s time as I have found this to be a convenient smokescreen for ageism and other forms of discrimination. Otherwise, if your interview process can be conducted within these guidelines I think you will find that I have a lot of experience which could add value to your business.<p>Regards<p>&lt;name&gt;",
      "time": 1646797274,
      "title": "A Manifesto for Tech Interviewees",
      "type": "story"
    },
    {
      "by": "vimy",
      "descendants": 0,
      "id": 30610651,
      "score": 1,
      "time": 1646797201,
      "title": "My next main browser: a review of Orion",
      "type": "story",
      "url": "http://morrick.me/archives/9500"
    },
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 30610648,
      "score": 1,
      "time": 1646797129,
      "title": "The Lynchpin Contest (2021)",
      "type": "story",
      "url": "https://www.terryslynchpins.com/contest"
    },
    {
      "by": "ikreymer",
      "descendants": 0,
      "id": 30610623,
      "score": 1,
      "time": 1646796960,
      "title": "Show HN: AWP Express: Instant, distributed browser-based web archiving",
      "type": "story",
      "url": "https://express.archiveweb.page/"
    },
    {
      "by": "durmonski",
      "descendants": 0,
      "id": 30610606,
      "score": 1,
      "time": 1646796840,
      "title": "The Psychological Benefits of Reading",
      "type": "story",
      "url": "https://baos.pub/the-psychological-benefits-of-reading-85bce6b769da"
    },
    {
      "by": "syrusakbary",
      "descendants": 0,
      "id": 30610595,
      "score": 1,
      "time": 1646796745,
      "title": "China urges the US to disclose details on US-financed biological labs in Ukraine",
      "type": "story",
      "url": "https://twitter.com/CGTNOfficial/status/1501100790433587201"
    }
  ]
}