{
  "stories": [
    {
      "by": "hrpharoscion",
      "descendants": 0,
      "id": 30891517,
      "score": 1,
      "text": "On January 11, 2018, out of the blue, Pharoscion (pharoscion.com) got a call from Noble Park, Australia. The call came from the owner of an e-commerce portal, seeking assistance for his online business. The agency accepted the offer without hesitation and with the assistance of a web developer, delivered the solution flawlessly. As we know, if you complete a project neatly and long before the deadline, it creates the necessary buzz leading to more and more projects in the pipeline from different clients. And that’s exactly how Pharoscion Global became a modern-era digital transformation agency with a global presence—a bootstrapped agency profitably running the business. Without taking any funding from any investor, the agency has been able to make its footmarks in Australia, Nepal, India, the UK, and the USA and is now trying to embark on its journey in other countries as well.<p>Pharoscion Global is a cloud and analytics-based digital transformation agency that focuses on the modern-era needs of businesses and startups. With a team comprising minds from IITs, IIMs and other experienced scholars, Pharoscion is your partner in areas (not limited to) like Cloud-based IT Products and Services, Digital Marketing, Branding, Data Analytics, SEO&#x2F;SEM, as well as in Creative and Ads. Since January 2018, the agency has been following the &quot;4Cs&quot; strategy: curiosity, curation, commercial, and commencement, which has helped ventures achieve 10x growth. Just like any other business enthusiast, we too are passionate about changing the world for the better.<p>Just the way Pharos, &quot;The Lighthouse of Alexandria City,&quot; was built to help guide ships into port and Julius Caesar, in his Civil Wars (Part III, 111-112), describes the strategic importance as, &quot;Now because of the narrowness of the strait, there can be no access by ship to the harbor without the consent of those who hold the Pharos.&quot; Likewise, in the 21st century, every Pharoscion has pledged to help businesses globally.<p>This journey has started with just INR 4000. Yes, that is the exact amount the agency spent on its very first project, bestowed by the Australian company – Everstore Australia Pty Ltd. This success is the result of the combined efforts of every Pharoscion. After helping Everstore Australia with its other portals (Evertyres.com.au, Everstore.com.au, Everracer.com.au), one of its Pharoscion co-founded The Pizza Central, a franchised based pizzeria chain. Pharoscion Global provides services in the areas of Digital Marketing, Branding, Software for Cafe Management, Business Development and Sales, Content and Copywriting, Website and App Development for The Pizza Central. When the winning streak continued for The Pizza Central, the agency expanded its business deliverables to the next level by launching multiple cloud-based apps like Food Khazaana, King Mechanic, PharoAssist, PharoBill, Branding and Digital Marketing, and tech products like ERP and CRM Solutions for big companies, which are running in multiple countries successfully.<p>With a vision of being the Pharos of the 21st century for to-be and existing brands, Pharoscion Global also geared up to team up with various prestigious institutes of India like IIMs and IITs with its flagship internship program, &quot;Get Hands Dirty.&quot;\nBy collaborating with Dadheech International Trade Foundation, Brahmani Welfare Foundation, Sounds of Nidra, and many schools, it is doing its part in uplifting society and humanity.<p>With a hybrid work culture since inception, the agency is helping as many ideas as possible to become successful start-ups and businesses with its state-of-the-art solutions in areas like cloud computing, data analytics, software and web development, marketing, branding, and artist management. In this pursuit of excellence, it has also collaborated with its global partners – NxtGen, HostingRaja, and 3dotcommunication – and firmly believes in making Pharoscion Global a brand that people around the world trust.",
      "time": 1648932224,
      "title": "Can you start a modern-era digital transformation business from just INR 4000?",
      "type": "story"
    },
    {
      "by": "maxwell",
      "descendants": 0,
      "id": 30891502,
      "score": 2,
      "time": 1648932140,
      "title": "Beijing court rules Nike pirated stickman character (2004)",
      "type": "story",
      "url": "http://www.chinadaily.com.cn/english/doc/2004-12/30/content_404675.htm"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 30891501,
      "score": 2,
      "time": 1648932139,
      "title": "Down on the body farm: Unlocking the forensic secrets of decaying corpses",
      "type": "story",
      "url": "https://undark.org/2019/11/11/how-microbes-could-aid-forensic-detectives/"
    },
    {
      "by": "lioeters",
      "descendants": 0,
      "id": 30891494,
      "score": 1,
      "time": 1648932077,
      "title": "Roll your own Ngrok with Nginx, Letsencrypt, and SSH reverse tunnelling",
      "type": "story",
      "url": "https://jerrington.me/posts/2019-01-29-self-hosted-ngrok.html"
    },
    {
      "by": "mwattsun",
      "descendants": 1,
      "id": 30891493,
      "kids": [
        30891496
      ],
      "score": 1,
      "time": 1648932069,
      "title": "“Russia cannot afford to lose, so we need a kind of a victory”: Sergey Karaganov",
      "type": "story",
      "url": "https://www.newstatesman.com/world/europe/ukraine/2022/04/russia-cannot-afford-to-lose-so-we-need-a-kind-of-a-victory-sergey-karaganov-on-what-putin-wants"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 30891490,
      "score": 2,
      "time": 1648932048,
      "title": "Life’s preference for symmetry is like ‘a new law of nature’",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/24/science/symmetry-biology-evolution.html"
    },
    {
      "by": "neverminder",
      "descendants": 0,
      "id": 30891488,
      "score": 1,
      "time": 1648932043,
      "title": "Ed Force One: The Story of the Iron Maiden Boeing 747",
      "type": "story",
      "url": "https://simpleflying.com/iron-maiden-747-now/"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 30891460,
      "score": 1,
      "time": 1648931773,
      "title": "Cartoons Kill: Casualties in animated recreational theater (2014)",
      "type": "story",
      "url": "https://www.bmj.com/content/349/bmj.g7184"
    },
    {
      "by": "altdataseller",
      "descendants": 0,
      "id": 30891449,
      "score": 1,
      "text": "Other than the main Apple and Android app stores, what are other popular “app stores” to develop for?<p>For example, Slack has an App Store as does Shopify (they call it integrations)",
      "time": 1648931716,
      "title": "Ask HN: What are other app stores to develop for?",
      "type": "story"
    },
    {
      "by": "amar-laksh",
      "descendants": 0,
      "id": 30891431,
      "score": 1,
      "time": 1648931582,
      "title": "Duplicate highlighter one-liner [Vim]",
      "type": "story",
      "url": "https://stackoverflow.com/a/1270689"
    }
  ]
}