{
  "stories": [
    {
      "by": "pyb",
      "descendants": 0,
      "id": 31691530,
      "score": 1,
      "time": 1654849993,
      "title": "Tinypilot Month 23 – Oh Boy, the Redesign",
      "type": "story",
      "url": "https://mtlynch.io/retrospectives/2022/06/"
    },
    {
      "by": "nastyaz",
      "descendants": 0,
      "id": 31691524,
      "kids": [
        31691525
      ],
      "score": 1,
      "time": 1654849939,
      "title": "How to Organize the Localization Process and Improve Quality",
      "type": "story",
      "url": "https://alconost.medium.com/how-to-organize-the-localization-process-and-improve-quality-73b3ab162aee"
    },
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 31691520,
      "score": 1,
      "time": 1654849906,
      "title": "Crev – Socially scalable Code REView and recommendation system",
      "type": "story",
      "url": "https://github.com/crev-dev/crev"
    },
    {
      "by": "SwimSwimHungry",
      "descendants": 0,
      "id": 31691506,
      "score": 1,
      "text": "I want to start off with saying I generally enjoy this site. It’s a great place to find links to news, blogs, and other interesting technology-centric websites.<p>To that end, and I believe there are quite a few that may agree with me, it would be nice to be able to hide or remove certain types of entries from the list, such as <i>cough</i> cryptocurrency, NFTs, any-fly-by-night project, what have you.<p>It would be cool if this site could offer a feature like Reddit where you can actively subscribe to the types of things that interest you, and ignore everything else.<p>If other folks want to discuss the topics, so be it. But let me opt out going forward, please. I used to really get involved in the discussions around cryptocurrency, but frankly it hasn’t been good for my sanity and I’d rather just go about my life not hearing about it anymore.<p>It’s exhausting to hear how someone thinks they are gonna make it, or how fiat is filthy and I’m an idiot for not just following the bandwagon. At this point, I have no more energy to expend on the topic and want to go back to a pre-2012 Internet, before the snake oil ruined everything.",
      "time": 1654849818,
      "title": "A Suggestion for Hacker News – Feed Filtering",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31691500,
      "score": 1,
      "time": 1654849758,
      "title": "China's Pacific island-hopping reveals new front line of geopolitics",
      "type": "story",
      "url": "https://asia.nikkei.com/Politics/International-relations/Indo-Pacific/China-s-Pacific-island-hopping-reveals-new-front-line-of-geopolitics"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31691498,
      "score": 1,
      "time": 1654849742,
      "title": "U.S. and China likely to trade blows at Asian security meeting",
      "type": "story",
      "url": "https://www.reuters.com/world/china/shadow-ukraine-war-us-china-set-clash-asian-security-meeting-2022-06-09/"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 31691490,
      "score": 1,
      "time": 1654849647,
      "title": "Procedural Tree Generator",
      "type": "story",
      "url": "https://simblob.blogspot.com/2022/06/procedural-tree-generator.html"
    },
    {
      "by": "emreb",
      "descendants": 1,
      "id": 31691484,
      "kids": [
        31691493
      ],
      "score": 1,
      "time": 1654849624,
      "title": "Default Alive or Default Dead? (2015)",
      "type": "story",
      "url": "http://www.paulgraham.com/aord.html"
    },
    {
      "by": "LoveMortuus",
      "descendants": 0,
      "id": 31691480,
      "score": 2,
      "text": "If we ignore the &quot;crypto is a scam&quot;, &quot;crypto doesn&#x27;t work&quot;, etc. questions and assume all good faith.<p>Could we replace all internet ads with on-site crypto miners that are working at low enough power to not hinder the user experience?<p>Since in today&#x27;s world the majority of people are using computers that are way stronger then what they actually need or use.<p>And even you&#x27;re on &lt;insert social media website here&gt; you&#x27;re usually not doing anything CPU&#x2F;GPU intensive except the website and video rendering.<p>Could such a solution to internet ads exist?\nAre there some obvious things In missing?<p>Or would this work for a year and we would have a nice time without ads until websites realise that adding ads doesn&#x27;t affect the performance but does increase the profits and then we would end up having both on-site crypto miners and ads?<p>If it was functional we could also have &quot;Donate by mining for X time&#x2F;by mining until it reaches X money&quot; buttons, which could help support open source stuff.<p>I guess the biggest question would be profitability.",
      "time": 1654849609,
      "title": "Ask HN: Could website based crypto miners replace all internet ads?",
      "type": "story"
    },
    {
      "by": "peter_retief",
      "descendants": 0,
      "id": 31691448,
      "score": 1,
      "time": 1654849320,
      "title": "Integral Calculus",
      "type": "story",
      "url": "https://www.britannica.com/science/integral-calculus"
    }
  ]
}