{
  "stories": [
    null,
    {
      "by": "the_monocle",
      "descendants": 0,
      "id": 31587573,
      "score": 1,
      "time": 1654115125,
      "title": "Show HN: Display famous paintings on your Terminal",
      "type": "story",
      "url": "https://github.com/EdinCitaku/TerminalMuseum"
    },
    {
      "by": "firstSpeaker",
      "descendants": 0,
      "id": 31587569,
      "score": 2,
      "time": 1654115122,
      "title": "Former OpenSea employee charged in first case of digital asset insider trading",
      "type": "story",
      "url": "https://www.engadget.com/opensea-nft-insider-trading-184637250.html"
    },
    {
      "by": "monkey_monkey",
      "descendants": 0,
      "id": 31587542,
      "score": 1,
      "time": 1654115002,
      "title": "New Dell UltraSharp matches Studio Display at $1,600",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/06/dell-ultrasharp-4k-webcam-monitor-challenges-apple-studio-display-at-1600/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31587534,
      "score": 1,
      "time": 1654114962,
      "title": "Consumers embrace milk carton QR codes, may cut food waste",
      "type": "story",
      "url": "https://phys.org/news/2022-06-consumers-embrace-carton-qr-codes.html"
    },
    {
      "by": "pan_cogito",
      "descendants": 0,
      "id": 31587501,
      "score": 2,
      "time": 1654114807,
      "title": "An Honest Look at the Consequences of Overturning Roe vs. Wade",
      "type": "story",
      "url": "https://churchlifejournal.nd.edu/articles/a-realistic-look-at-the-consequences-of-overturning-roe-v-wade/"
    },
    {
      "by": "drcode",
      "descendants": 0,
      "id": 31587496,
      "score": 1,
      "time": 1654114794,
      "title": "Ezbitmap.com: Create beautiful images in JavaScript from inline ASCII art",
      "type": "story",
      "url": "https://ezbitmap.com/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 1,
      "id": 31587488,
      "kids": [
        31587502
      ],
      "score": 1,
      "time": 1654114759,
      "title": "Klarna Affected Employees",
      "type": "story",
      "url": "https://docs.google.com/spreadsheets/d/e/2PACX-1vSsm-8CVBoTJgMniMroW_Yph4R46P_YWHikUbyVJRueg-GhiKGldtD7_yUGmLujarHgdsyr-Wvw6ZyM/pubhtml"
    },
    {
      "by": "honksillet",
      "descendants": 1,
      "id": 31587477,
      "kids": [
        31587627
      ],
      "score": 2,
      "text": "I have been watching Tether ever since the Terra implosion. As you know, shortly thereafter tether flash crashed to 95 cents. It has since recovered but it seems to me that it hasn’t recovered all the way. Disclaimer, I have just been checking in on tether on coinmarketcap.com. I have no doubt this isn’t the best way to get an accurate reading of the state of tether.<p>That being said, since the flash crash it looks like tether has been averaging just below $1. Somewhere around 0.9995. That might seem like close enough, but prior to the flash crash tether would regularly fluctuate above $1 by minuscule amounts. It doesn’t seem to every go above $1 now. Does this represent constant slow downward pressure on tether, maybe even traders take advantage of small arbitrage opportunities when the currency fluctuates lower?<p>I’ve also notice that in coinmarketcap there have multiple step-like movements, always downward, in tether’s market cap. These step down movements are roughly in increments of $1B. In total it has lost about $10B. I realize that this is superimposed on the background of the broader crypto ecosystem losing a large amount of market cap. But I guess the worry with tether is that some of it is probably well back with actual USD and some of it is probably backed with sketchy corporate paper. If they have to redeem to cover market cap loses, won’t they have to redeem the high quality backing first, meaning over time the percentage of tether that is sketchily back will increase?<p>Again, I realize the coinmarketcap probable isn’t the best way to be tracking this. What does anyone thing is going on?",
      "time": 1654114700,
      "title": "Ask HN: Is Tether Under Attack?",
      "type": "story"
    },
    {
      "by": "OliverA",
      "descendants": 1,
      "id": 31587474,
      "kids": [
        31587476
      ],
      "score": 1,
      "time": 1654114691,
      "title": "I built a website to track monkeypox case data from around the world",
      "type": "story",
      "url": "https://www.monkeypoxtracer.com/"
    }
  ]
}