{
  "stories": [
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31377847,
      "score": 1,
      "time": 1652535783,
      "title": "From time series to complex networks: The visibility graph",
      "type": "story",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0709247105"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31377827,
      "score": 1,
      "time": 1652535659,
      "title": "US prepares to release US$45B for nationwide high-speed internet",
      "type": "story",
      "url": "https://www.scmp.com/tech/policy/article/3177737/us-prepares-release-us45-billion-nationwide-high-speed-internet-under"
    },
    {
      "by": "pHollda",
      "descendants": 3,
      "id": 31377826,
      "kids": [
        31377900,
        31377859
      ],
      "score": 1,
      "text": "It&#x27;s commonplace to mock Big Tech for being slow-moving and lacking an innovation ability with several examples of new companies that competed with, and defeated products from Big Tech. There are tons of examples of this (YouTube Vs Google Video as one). What are examples of the reverse? Like Pebble (smartwatches) losing to Apple Watch, Clubhouse (Kindda pending) losing to Twitter Spaces, Slack (??? had to sell to Big Tech) losing to Big Tech &#x27;Work&#x27;.<p>Sure, there are also examples where the indie coys did not exactly die Dropbox&#x2F;Box Vs Big Tech storage.",
      "time": 1652535656,
      "title": "Ask HN: What are examples of companies that died by the hands of Big Tech?",
      "type": "story"
    },
    {
      "by": "nnx",
      "descendants": 0,
      "id": 31377824,
      "score": 1,
      "time": 1652535646,
      "title": "The strange detention of EU diplomats returning from Tehran",
      "type": "story",
      "url": "https://responsiblestatecraft.org/2022/05/14/the-strange-detention-of-eu-diplomats-returning-from-tehran/"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 31377806,
      "score": 1,
      "time": 1652535512,
      "title": "Finding it hard to get a new job? Robot recruiters might be to blame",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2022/may/11/artitifical-intelligence-job-applications-screen-robot-recruiters"
    },
    {
      "by": "xqcgrek2",
      "descendants": 0,
      "id": 31377802,
      "score": 3,
      "time": 1652535485,
      "title": "Matt Damon Under Fire Again for ‘Fortune Favors the Brave’ Crypto Ad",
      "type": "story",
      "url": "https://www.yahoo.com/entertainment/matt-damon-under-fire-again-211424480.html"
    },
    {
      "by": "ruph123",
      "descendants": 0,
      "id": 31377797,
      "score": 1,
      "time": 1652535470,
      "title": "Synthstrom Deluge",
      "type": "story",
      "url": "https://synthstrom.com/product/deluge/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31377788,
      "score": 1,
      "time": 1652535390,
      "title": "My story of joining the Great Resignation",
      "type": "story",
      "url": "https://old.reddit.com/r/ExperiencedDevs/comments/up0fsa/my_story_of_joining_the_great_resignation/"
    },
    {
      "by": "githaxs",
      "descendants": 0,
      "id": 31377769,
      "score": 1,
      "text": "Hello Everyone,<p>I&#x27;v been working on a CI platform (https:&#x2F;&#x2F;githaxs.com) that is easier to use and provides more value.<p>Here are the problems I want to solve:<p>1. Wasted effort setting up the same tools at different companies on different platforms.<p>I am a DevOps Engineer and I quickly realized I was automating the same CI tools at different companies and on different platforms. Most companies want their code linted before merging and they use same tools. As a DevOps engineer I had to spend time setting up the same tooling across many repos and platforms (i.e. Circle, Jenkins, GitHub actions, etc) - which seemed like wasted effort. I wanted an easy way to select commonly used CI tools use them.<p>2. Make it easy to add new tools to your toolchain.<p>I recently went through the process of getting HITRUST certified at a company and we needed to add SAST to our CI tool chain. Adding a new tool required us to &quot;take a lap&quot; and update config files in hundreds of repos. I wanted a way to run tools on all or a subset of repos easily.<p>3. Lack of data in code review process<p>When I became a manager I wanted some insights into the code review process of my team. How long does it take for PRs to get their first review? last review? merge? There are other tools out there but they cost hundreds of dollars per seat.<p>4. Spend less time groking CI platform documentation.<p>I&#x27;ve spent many hours reading documentation&#x2F;troubleshooting on CircleCI to understand their syntax and the best way to do things. Often times I found myself in situations where I would do the equivalent of throwing spaghetti against the wall - create a commit that I think will work, wait for the job to run X minutes later and rinse and repeat if it doesn&#x27;t.<p>I would appreciate any feedback on the website, product idea, other problems you have faced that I haven&#x27;t addressed.<p>Cheers!",
      "time": 1652535287,
      "title": "Ask HN: Fully Managed CI Platform",
      "type": "story"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 31377765,
      "score": 1,
      "time": 1652535217,
      "title": "Johnny English",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Johnny_English"
    }
  ]
}