{
  "stories": [
    {
      "by": "ani_obsessive",
      "descendants": 0,
      "id": 31404890,
      "score": 1,
      "time": 1652750049,
      "title": "When Is a Storyboard Good Enough?",
      "type": "story",
      "url": "https://animationobsessive.substack.com/p/when-is-a-storyboard-good-enough"
    },
    {
      "by": "DevopsQuestions",
      "descendants": 0,
      "id": 31404881,
      "score": 1,
      "time": 1652749971,
      "title": "Ask HN: What languages are you using for systems and infra scripting?",
      "type": "story"
    },
    {
      "by": "aard",
      "descendants": 0,
      "id": 31404864,
      "score": 1,
      "time": 1652749755,
      "title": "The biggest problem with capitalism? Not enough capitalists",
      "type": "story",
      "url": "https://fortune.com/2020/11/21/capitalism-entrepreneurship-economic-inequality-us-bureaucracy/"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 31404858,
      "score": 1,
      "time": 1652749662,
      "title": "OpenSSF, Linux Foundation Want to Replace C, C++",
      "type": "story",
      "url": "https://www.sdxcentral.com/articles/news/openssf-linux-foundation-want-to-replace-c-c/2022/05/"
    },
    {
      "by": "reluctantly",
      "descendants": 0,
      "id": 31404845,
      "score": 3,
      "text": "I&#x27;ve always worked at growth stage startups since transitioning to tech about 10 years ago. I started as an IC and built the technical foundations and when a team was needed, I declined the offer to manage. Well, eventually they didn&#x27;t succeed at hiring a manager and designated me. I grew to own a large team of teams and function. I decided I was right the first time and really dislike most aspects of being a manager, and I left that company&#x2F;role with the goal to become an IC again. When I was hired at latest company, I was extremely clear that I was not interested in anything on the management track and was hired as a senior IC. A few months ago, the functional lead ( my manager) was fired and I was forced to take over despite my being abundantly clear I did not want to and it would make me unhappy. It was promised to be interim until they could hire. After 2 months, there isn&#x27;t even an open rec.<p>This has happened more than once now. I&#x27;ve been very clear about the type of growth I want, and don&#x27;t want to manage peoples work and growth and be the shit umbrella of organizational politics. It drains me, I like solving technical problems and systems. I enjoy that and I&#x27;m good at it. Just because I&#x27;m a decent manager too doesn&#x27;t mean I want to do it.<p>Do I just threaten to quit if I&#x27;m continued to be forced to manage a team instead of the IC role I was hired for? How can I avoid being put in this situation again? I made it very clear I was not interested and wasn&#x27;t really given any choice not to.",
      "time": 1652749571,
      "title": "Ask HN: Bullied into managing (again), how to stay on the IC technical track?",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31404838,
      "score": 1,
      "time": 1652749490,
      "title": "Contents Twenty Years Later: The Surprising Greater Implications of a New Kind",
      "type": "story",
      "url": "https://writings.stephenwolfram.com/2022/05/twenty-years-later-the-surprising-greater-implications-of-a-new-kind-of-science/"
    },
    {
      "by": "nemz44",
      "descendants": 0,
      "id": 31404837,
      "score": 2,
      "text": "I built a service based on Amazon CloudFront&#x27;s global edge network of points of presence. This distributed architecture affords the user:<p>- Protection against network and application layer attacks\n- Robust and reliable links that will never go down\n- Instant links with low latency no matter where your visitors are in the world\n- Unlimited tracked clicks (no cap on clicks&#x2F;month)<p>The service has support for teams and custom domains, and auto-generates an SSL cert for every custom domain added, for HTTPS-secure links.<p>It&#x27;s largely free and can be found at https:&#x2F;&#x2F;www.pxl.to<p>I&#x27;d love any feedback... no matter how brutal :)",
      "time": 1652749467,
      "title": "Show HN: Pxl.to – A serverless link shortener with no limits and no downtime",
      "type": "story"
    },
    {
      "by": "matthewtovbin",
      "descendants": 0,
      "id": 31404812,
      "score": 1,
      "time": 1652749167,
      "title": "Show HN: Open-Source Dora and Space Metrics for GitHub, Gitlab and Jira",
      "type": "story",
      "url": "https://github.com/faros-ai/faros-community-edition"
    },
    {
      "by": "rchaudhary",
      "descendants": 0,
      "id": 31404810,
      "score": 1,
      "time": 1652749147,
      "title": "Scientists Claim to Bring Dead Human Eye Cells Back to Life",
      "type": "story",
      "url": "https://scitechdaily.com/life-after-death-for-the-human-eye-reviving-light-sensing-cells/"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 31404809,
      "score": 3,
      "time": 1652749130,
      "title": "Bank of England warns of 'apocalyptic' global food shortage",
      "type": "story",
      "url": "https://www.telegraph.co.uk/business/2022/05/16/bank-england-warns-apocalyptic-global-food-shortage/"
    }
  ]
}