{
  "stories": [
    {
      "by": "atan2",
      "descendants": 0,
      "id": 29744749,
      "score": 1,
      "time": 1640923405,
      "title": "History of Retro Game Consoles (For Programmers)",
      "type": "story",
      "url": "https://pikuma.com/blog/game-console-history-for-programmers"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 29744735,
      "score": 1,
      "time": 1640923311,
      "title": "Counterfactual Theory of Value",
      "type": "story",
      "url": "https://perell.com/note/the-counterfactual-theory-of-value/"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 29744727,
      "score": 1,
      "time": 1640923236,
      "title": "Camera view of JWST separating from Ariane 5 upper stage",
      "type": "story",
      "url": "https://dlmultimedia.esa.int/download/public/videos/2021/12/050/orig-2112_050_AR_EN.mp4"
    },
    {
      "by": "joshxyz",
      "descendants": 0,
      "id": 29744726,
      "score": 1,
      "time": 1640923231,
      "title": "Dev Blueprints: User Sign-Up Flow",
      "type": "story",
      "url": "https://devblueprints.substack.com/p/user-sign-up-flow"
    },
    {
      "by": "vinayiyengar",
      "descendants": 0,
      "id": 29744716,
      "score": 1,
      "time": 1640923072,
      "title": "The Ultimate Guide to Finding a Startup Job",
      "type": "story",
      "url": "https://www.vinayiyengar.com/job-guide/"
    },
    {
      "by": "latchkey",
      "descendants": 0,
      "id": 29744711,
      "score": 1,
      "time": 1640922979,
      "title": "We Sent Garlic Bread to the Edge of Space, Then Ate It",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=c8W-auqg024"
    },
    {
      "by": "sjg007",
      "descendants": 0,
      "id": 29744699,
      "score": 2,
      "text": "What do people think is the extent of disinformation on HN?  The admins clearly have access to HTTP logs which could filter responses by IP address.  Is there a reasonable metric to assess that the community is honest or not?",
      "time": 1640922855,
      "title": "Disinformation on HN?",
      "type": "story"
    },
    {
      "by": "artdeco",
      "descendants": 0,
      "id": 29744643,
      "score": 1,
      "text": "Hello.<p>I was looking through my rebel domains because i wanted a .sucks domain to tell technation.io that they really sucked (because they engage in outright left-wing extremist attacks on candidates and terrorise young vulnerable people who have no means of defending themselves, by providing absolutely blatant lies because they know that they&#x27;re cameron&#x27;s cronies and won&#x27;t be touched by law and they will be proven wrong you just wait and see a little, very little i promise you) for 30 bucks but the offer is a-djourned. and realised I worked on a website called https:&#x2F;&#x2F;jsdoc.dev in 2021 but never really published it in the end therefore i thought i should do that before the new years even though i didn&#x27;t finish it so it&#x27;s kind of like a first chapter of a book as per hackernews rules for the show category or something. The website is<p>please be advised (warning, warning - Kevin Malone) that this is supposed to be a landing page for a product however there&#x27;s no info yet or an option to buy the software or even its description i just mean that what you find there isn&#x27;t the full thing as the paper have not been properly structured and concluded. despite that when i read it now i thought it&#x27;s actually very useful and you won&#x27;t find me trying to sell you anything you could just comment on the design and what you think ) i even used custom-shape masking for yall you know please say something nice although i didn&#x27;t install the polyfill for ie11 i think yet it&#x27;s possible.<p>please don&#x27;t judge strictly i hope the website about JSDoc 2.0 here https:&#x2F;&#x2F;jsdoc.dev&#x2F; with its tutorial be useful to some also i coin jsdoc 2.0 term coz now it includes module support. There&#x27;s somebody using a similar technique for import you can find online yet mine is more full as there&#x27;s an important bit that you shouldn&#x27;t miss because even if you love typescript you won&#x27;t deny the fact that it is deficient in a manner that I outline in the article and provide a solution in its pure form ie in JS.",
      "time": 1640922226,
      "title": "JSDoc.dev Landing page from 2021 I never finished",
      "type": "story"
    },
    {
      "by": "notpopcorn",
      "descendants": 1,
      "id": 29744641,
      "kids": [
        29744668
      ],
      "score": 2,
      "time": 1640922214,
      "title": "Portal 2 crashes if you have 128 cores, due to 15 year old assumptions",
      "type": "story",
      "url": "https://twitter.com/m_ou_se/status/1476165843369312258"
    },
    {
      "by": "pretentious7",
      "descendants": 0,
      "id": 29744592,
      "score": 1,
      "time": 1640921705,
      "title": "Donors to the FreeBSD Foundation",
      "type": "story",
      "url": "https://freebsdfoundation.org/our-donors/donors/"
    }
  ]
}