{
  "stories": [
    {
      "by": "nanis",
      "descendants": 0,
      "id": 28300740,
      "score": 1,
      "time": 1629894224,
      "title": "I Commanded Afghan Troops This Year. We Were Betrayed",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/25/opinion/afghanistan-taliban-army.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28300721,
      "score": 1,
      "time": 1629894086,
      "title": "Regulatory Capture",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Regulatory_capture"
    },
    {
      "by": "infruset",
      "descendants": 0,
      "id": 28300711,
      "score": 1,
      "time": 1629894027,
      "title": "Zk-SNARKs, FreeTON and OCamlPro",
      "type": "story",
      "url": "https://medium.com/ocamlpro/zk-snarks-freeton-and-ocamlpro-eaaa1849ffd1"
    },
    {
      "by": "fromthewildblue",
      "descendants": 0,
      "id": 28300679,
      "score": 1,
      "text": "Hey guys. I&#x27;ve been lurking for a while. It seems to me there&#x27;s a few different demographics that post to HN. A significant minority seems to be FAAMG employees.<p>With all the controversy surrounding these companies (TPM for W11, Apple&#x27;s CSAM, Google&#x27;s everything), I often wonder what recourse anyone has. The arguments made by these companies seems to be that they collect information consensually given to them in exchange for access to their services.<p>My question is, would it be ethical to scour HN and collect a list of profiles which have (of their own volition) claimed employment at FAAMG? I don&#x27;t think a FAAMG employee could claim otherwise, but I would love to see everyone&#x27;s opinions.<p>If the explicit aggregation of this data was ethical, at what point would acting on that data become unethical?",
      "time": 1629893850,
      "title": "Ask HN: Ethical Sousveillance?",
      "type": "story"
    },
    {
      "by": "elenaturner",
      "descendants": 0,
      "id": 28300671,
      "score": 1,
      "time": 1629893799,
      "title": "Fastest Growing Jobs in the US",
      "type": "story",
      "url": "https://www.careerslinked.com/15-fastest-growing-jobs-careers-in-the-united-states/"
    },
    {
      "by": "kshivendu",
      "descendants": 0,
      "id": 28300662,
      "score": 2,
      "text": "Hi, I&#x27;m curious to know what are the tools that agencies&#x2F;freelancers&#x2F;startups use to measure the billable working hours.",
      "time": 1629893779,
      "title": "Ask HN: How do you track your billable working hours?",
      "type": "story"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28300660,
      "score": 1,
      "time": 1629893769,
      "title": "CDC Downplayed Finding That Masking Children Not Effective in Schools",
      "type": "story",
      "url": "https://tallahasseereports.com/2021/08/22/report-cdc-downplayed-scientific-finding-that-masks-are-not-effective-in-schools/"
    },
    {
      "by": "Anisa_Mirza",
      "descendants": 0,
      "id": 28300640,
      "score": 6,
      "text": "Hi HN, my name is Anisa and I am the founder of Litnerd (<a href=\"https:&#x2F;&#x2F;litnerd.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;litnerd.com&#x2F;</a>), an online reading program designed to teach elementary school students in America how to read.<p>There are 37M elementary school students in America. Schools spend $20B on reading and supplemental education programs. Yet 42% of 4th grade students are reading at a 1st or 2nd grade proficiency level! The #1 reason students aren’t reading? They say it’s boring. We change that by bringing books to life. Think your favorite book turned into a tv-show style episode-by-episode reenactment, coupled with a complete curriculum and lesson plans.<p>1 in 8 Americans is functionally illiterate. Like any skill, reading is a habit. If you grew up in a household where you did not see your parents reading, you likely do not develop the habit.This correlates to the socio-economic divide. Two thirds of American students who lack reading skills by the end of fourth grade will rely on welfare as adults. To impact this, research suggests that we need to start at the earliest years.<p>I am passionate about the research in support of art and theatre as well as story-telling to improve childhood learning. Litnerd is the marriage of these interests. The inspiration comes from Sesame Street and Hamilton The Musical.<p>In the late 60s, Joan Cooney decided to produce a children’s TV show that would influence children across America to learn to read. She called her show Sesame Street. Cooney researched her idea extensively, consulting with sociologists and scientists, and found that TV’s stickiness can be an important tool for education.<p>Lin-Manuel Miranda took the story of Alexander Hamilton and brought it to life as a musical. Kids have learned more about Hamilton’s historical context, facts, figures etc thanks to Hamilton the Musical than any of their textbooks. In fact, this was the case so much that a program called EduHam is used to teach history in middle schools across the nation. When I heard that, the lightbulb went off and I decided to go all in on starting Litnerd.<p>We hire art and theatre professionals to recreate scenes directly from books in episode style format to bring the book to life, in a similar fashion to watching your favorite TV shows. The format of our program is such that if you don&#x27;t complete the assigned reading and worksheets, you will feel like you are missing out on what is happening in proceeding episodes. In this way, reading is layered in as a fundamental core to the program. Our program is part of scheduled classroom time.<p>A big part of our business involves curating content and materials that capture the interest and coolness-factor for elementary school students. We’ve found that students love choose-your-own-adventure style stories, especially ones involving mythical creatures—something about being able to have autonomy on the outcomes. So far, it seems to be working. We&#x27;ve even received fan mail from students! But we are obsessed with staying cool&#x2F;relevant in our content.<p>Teachers like our product because it eases the burden placed on them. US teachers typically spend 4 to 10 hours a week (unpaid) planning their curriculum and $400-800 of their own money for classroom supplies. That&#x27;s outrageous! When designing Litnerd, we wanted to ensure our product was not adding more work to their plate. Our programs are led by our own Resident Teaching Artists, who are live streamed into the classroom and remain in character to the episode as they teach the Litnerd curriculum built on top of the books. Our programs come with lesson plans, activity packets, curriculum correlations, educator resources, and complete ebooks.<p>Traditional K-12 education has extremely long sale cycles and is hard to break into. It can take years to become a contracted vendor, especially with large districts like NYC Department of Education. Because of my experience with my first YC backed startup that sold to government and nonprofits, coupled with my experience working at a large edtech company that built content for Higher Ed, I understand this sector and how to navigate the budget line item process.<p>Since launching in January, we have become contracted vendors with the New York City Department of Education (the largest education district in America). As a result, we’ve been growing at 60% MoM, are currently used by over 14k students in their classrooms and hit $110K in ARR. Our program is part of scheduled classroom time for elementary schools—not homework, and not extracurricular. Here’s a walkthrough video from a teacher’s perspective: <a href=\"https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;9ffc59f0d7ed4a66964003703bba7b94\" rel=\"nofollow\">https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;9ffc59f0d7ed4a66964003703bba7b94</a>.<p>I am so grateful for the opportunity to share our story and mission with you. If you loved or struggled with reading as a kid, what factors do you think contributed? Also, if you have experience teachIng Elementary School or if you are a parent, I would love to hear your thoughts and ideas on how you foster reading amongst your students&#x2F;children! I am excited to hear your feedback and ideas to help us inspire the next generation of readers.",
      "time": 1629893632,
      "title": "Launch HN: Litnerd (YC S21) – Sesame Street Inspired Reading Program for Schools",
      "type": "story"
    },
    {
      "by": "hdjjhhvvhga",
      "descendants": 0,
      "id": 28300602,
      "score": 2,
      "time": 1629893371,
      "title": "Open Hardware Clusterboard for Hobbyists",
      "type": "story",
      "url": "https://wiki.pine64.org/wiki/Clusterboard"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 28300588,
      "score": 2,
      "time": 1629893253,
      "title": "The Science of Underground Kingdoms",
      "type": "story",
      "url": "https://www.caltech.edu/about/news/the-science-of-underground-kingdoms"
    }
  ]
}