{
  "stories": [
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31524052,
      "score": 1,
      "time": 1653603974,
      "title": "Perhaps the Barriers to Entry for Creative Work Have Become Too Low",
      "type": "story",
      "url": "https://freddiedeboer.substack.com/p/perhaps-the-barriers-to-entry-for"
    },
    {
      "by": "Tozen",
      "descendants": 0,
      "id": 31524039,
      "score": 1,
      "time": 1653603881,
      "title": "FTC fines Twitter $150M for using 2FA info",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/technology/ftc-fines-twitter-150m-for-using-2fa-info-for-targeted-advertising/"
    },
    {
      "by": "nemoniac",
      "descendants": 0,
      "id": 31523990,
      "score": 2,
      "time": 1653603490,
      "title": "IT glitch creates turmoil for easyJet passengers across Europe",
      "type": "story",
      "url": "https://www.theguardian.com/business/2022/may/26/it-glitch-creates-turmoil-for-easyjet-passengers-across-europe"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31523965,
      "score": 1,
      "time": 1653603307,
      "title": "Linuxfx: Revenge of the Skids",
      "type": "story",
      "url": "https://kernal.gitlab.io/posts/linuxfx-part-2/"
    },
    {
      "by": "s-xyz",
      "descendants": 0,
      "id": 31523930,
      "score": 3,
      "text": "I bought into Luna after the crash, and was holding some on Binance.<p>Now it seems that there is a revival plan that got triggered on the 27th, which will include an Airdrop. See: https:&#x2F;&#x2F;agora.terra.money&#x2F;t&#x2F;terra-ecosystem-revival-plan-2-passed-gov&#x2F;18498<p>I do not understand however what this will imply for my holdings on Binance (which are frozen now btw).<p>Will I still have the new Luna and at what price?",
      "time": 1653603044,
      "title": "Ask HN: What will happen to my Binance Luna after the Airdrop?",
      "type": "story"
    },
    {
      "by": "donsupreme",
      "descendants": 2,
      "id": 31523916,
      "kids": [
        31524057,
        31524022
      ],
      "score": 7,
      "time": 1653602937,
      "title": "Twitter shareholders sue Elon Musk and Twitter over chaotic deal",
      "type": "story",
      "url": "https://www.cnbc.com/2022/05/26/twitter-shareholders-sue-elon-musk-and-twitter-over-chaotic-deal.html"
    },
    {
      "by": "Thystler",
      "descendants": 0,
      "id": 31523915,
      "score": 1,
      "text": "Hi,<p>I am looking to team up with other indie hackers to build some cool projects. I am currently creating a community of tech professionals who can support each other in creating self-standing projects and investing in each other. I have built an MVP that allows for easy collaboration where value added to a project rewards with stake. This stake pays out to all stakeholders when the project makes money. This means no more equity discussions. You get proportionately to what you contribute.<p>The value I can provide coding services for your project, and am currently learning sales.<p>The projects currently under the collaboration tool are making 1 - 2k&#x2F;mo. (starting 1 month ago)<p>If you are interested send me a DM or post a comment!",
      "time": 1653602935,
      "title": "Looking for Cool Hacker",
      "type": "story"
    },
    {
      "by": "andrewshatnyy",
      "descendants": 0,
      "id": 31523914,
      "score": 2,
      "time": 1653602924,
      "title": "A New App to Make Sure VCs Are Being Helpful",
      "type": "story",
      "url": "https://www.forbes.com/sites/kenrickcai/2022/05/26/cabal-new-app-to-make-sure-vcs-are-being-helpful-craft-ventures/"
    },
    {
      "by": "marcusjramsey",
      "descendants": 0,
      "id": 31523912,
      "score": 3,
      "time": 1653602905,
      "title": "What Everyone Is Missing from Amazon’s Shareholder Meeting",
      "type": "story",
      "url": "https://upstarted.co/what-everyone-is-missing-from-amazons-shareholder-meeting/"
    },
    {
      "by": "MrWiffles",
      "descendants": 0,
      "id": 31523911,
      "score": 2,
      "text": "Since we&#x27;re working from home more often than ever these days, many of us have started to take our day-to-day workflow&#x2F;experience more seriously, and have improved our personal workspaces as a result.<p>What are some of your favorite hacks for improving your day-to-day ease and comfort?<p>For example, in my case, I finally invested in a real DESK, with drawers and everything, as opposed to just having a simple manufactured rectangle table from Walmart. And to improve storage so everything&#x27;s within arm&#x27;s reach most of the time, I bought some adhesive-mounted hooks from the office supply store and mounted them on the inside facing plane, under the desk where my knees and feet are. Now I can keep my BT headphones on a hook, my scissors are there, and a hat for when I don&#x27;t feel like combing my hair but need to be on a webcam :)<p>I fully admit that&#x27;s underwhelming at best, and that&#x27;s why I&#x27;m asking. I&#x27;m just looking for ideas to improve my workspace beyond the obvious like &quot;buy a nice chair&quot;, &quot;new monitor&quot;, &quot;input switch&quot;, etc. That stuff&#x27;s all well and good but having already done that, I&#x27;m curious to see what others have come up with. Things that didn&#x27;t even occur to me, that I didn&#x27;t know <i>could</i> be improved, that sorta stuff.<p>So, what are your favorite hacks for your personal workspace? What&#x27;s made your day-to-day more enjoyable?",
      "time": 1653602904,
      "title": "Ask HN: What are your favorite home workspace hacks?",
      "type": "story"
    }
  ]
}