{
  "stories": [
    {
      "by": "anderspitman",
      "descendants": 0,
      "id": 30535291,
      "score": 1,
      "time": 1646265867,
      "title": "Efficient IO with Io_uring [pdf]",
      "type": "story",
      "url": "https://kernel.dk/io_uring.pdf"
    },
    {
      "by": "dchuk",
      "descendants": 0,
      "id": 30535230,
      "score": 2,
      "time": 1646265319,
      "title": "Modern Front-End Magic with Rails 7: A Visual Editor for Markdown (No SPA)",
      "type": "story",
      "url": "https://kuy.io/blog/posts/modern-front-end-magic-with-rails-7-a-visual-editor-for-markdown-part-1"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30535225,
      "score": 3,
      "time": 1646265297,
      "title": "Moving Money Internationally",
      "type": "story",
      "url": "https://bam.kalzumeus.com/archive/moving-money-internationally/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30535218,
      "score": 1,
      "time": 1646265261,
      "title": "Climate Change threatens nearly one-third of U.S. hazardous Chemical facilities",
      "type": "story",
      "url": "https://text.npr.org/1083943889"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30535213,
      "score": 1,
      "text": "Making phone calls from trolley cars on the New York and Brooklyn Bridge in 1896.<p>Some interesting experiments have recently been tried by Mr. Kingsley l. Martin, assistant engineer on the New York and Brooklyn Bridge, in the line of establishing telephonic communication between moving trains and between trains and the train dispatcher&#x27;s and bridge offices.<p>The necessity of some adequate method of train\ncommunication and signaling in cases of fog or some emergency has been felt, but there have been difficulties in the way of establishing telephonic communication with moving trains that have prevented it from being put into practice.<p>Mr. Martin has overcome these difficulties and has succeeded in communicating with moving trains with the same facility as between fixed points.<p>The bridge is provided with a trolley wire for electrically lighting the trains. This wire, which was used in the telephone experiment, was connected with the train dispatcher&#x27;s office and with the bridge offices, and upon the cars were placed arms provided with compound brushes which touched the trolley wire.<p>The circuit was completed through the car truck and track rail, the connection between the circuit wires and truck being completed by a brush resting on one of the car wheels.<p>The compound brush consisted of a number of brushes of brush copper fastened together with intermediate pieces of soft rubber. The brushes being electrically connected with each other and with the telephone wire, arranged in this way, unbroken conversations could be carried on while the trains moved along.<p>The electrical contact of the compound brush with the trolley wire was so perfect that the sliding of the brush on the wire produced no noticeable effect.<p>It is proposed to permanently equip the cars with telephones and to provide a suitable electric  conductor on the bridge in convenient position for contact with the brushes carried by the cars.<p>Scientific American article and engraving, April 4, 1896",
      "time": 1646265223,
      "title": "Phoning from a Trolley Car in 1896",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30535200,
      "score": 1,
      "time": 1646265163,
      "title": "Researchers are using machine learning to understand how brain cells work",
      "type": "story",
      "url": "https://news.wisc.edu/researchers-are-using-machine-learning-to-understand-how-brain-cells-work/"
    },
    {
      "by": "rbanffy",
      "descendants": 1,
      "id": 30535199,
      "kids": [
        30535269
      ],
      "score": 1,
      "time": 1646265152,
      "title": "Amazon EcoVistas to guide sustainable dam siting",
      "type": "story",
      "url": "https://www.theengineer.co.uk/new-computational-tool-dam-siting-amazon-ecovistas-ai/"
    },
    {
      "by": "tokyopanda",
      "descendants": 0,
      "id": 30535188,
      "score": 1,
      "time": 1646265084,
      "title": "Company Catches the AI Wave(s)",
      "type": "story",
      "url": "https://cloud.google.com/blog/topics/transformation/follow-these-3-stages-to-ai-transformation"
    },
    {
      "by": "chriscarrig",
      "descendants": 1,
      "id": 30535183,
      "kids": [
        30535184
      ],
      "score": 1,
      "time": 1646265069,
      "title": "Eulogy of Continuous Integration",
      "type": "story",
      "url": "https://roost.ai/blog/obituary-of-continuous-integration"
    },
    {
      "by": "NoCharging",
      "descendants": 2,
      "id": 30535181,
      "kids": [
        30535286,
        30535271,
        30535293
      ],
      "score": 2,
      "text": "Hi, I&#x27;ve been struggling with an unusual technology&#x2F;medical issue for some months, and I&#x27;m wondering if anyone here has gone through anything like it and possibly found success dealing with it.<p>I assume most people here are heavy users of technology, which these days means many devices with rechargeable batteries. I&#x27;ve noticed that I get terrible headaches when I&#x27;m in the same room with a device while it&#x27;s charging. It could be a phone, tablet, laptop, or even a battery for power tools. I would describe the feeling as a kind of clenching in my brain. I&#x27;ve gone so far as to request a desktop rather than a laptop for work in order to cope with this.<p>I&#x27;ve talked to my doctor, but he was baffled. We did a standard screening for epilepsy but found nothing.<p>Needless to say, this is very distressing. I realize no one here will be able to offer medical advice, but I guess I&#x27;m hoping someone out there might be experiencing the same thing. I&#x27;m also interested to know if anyone knows of any relevant research into the health effects of charging batteries.<p>Thanks.",
      "time": 1646265063,
      "title": "Ask HN: Headaches from Charging Batteries?",
      "type": "story"
    }
  ]
}