{
  "stories": [
    {
      "by": "mplabelspace",
      "descendants": 0,
      "id": 30305999,
      "score": 1,
      "time": 1644608079,
      "title": "Senior Engineer Opens P1 TAC Case",
      "type": "story",
      "url": "https://www.jumboframeinternet.com/post/12/"
    },
    {
      "by": "taf2",
      "descendants": 0,
      "id": 30305987,
      "score": 1,
      "text": "It&#x27;s a bitch to hire people right now.  But you know why.   Because we&#x27;re all doing fucking awesome things.   We&#x27;re selling shit to each other.  It&#x27;s not easy.  If it was everyone would be doing it.   Hack on friends",
      "time": 1644607978,
      "title": "Tell HN: Good Energy",
      "type": "story"
    },
    {
      "by": "pkukp9",
      "descendants": 0,
      "id": 30305959,
      "score": 2,
      "text": "Hi HN, My name is Kathryn Cross, and I’m the founder of Anja Health (<a href=\"https:&#x2F;&#x2F;anjahealth.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;anjahealth.com&#x2F;</a>). We help pregnant parents freeze their baby’s umbilical cord and placenta at birth, in order to save stem cells in case they&#x27;re needed in the future.<p>“Anja” refers to my brother Andrew. When I was 3 and Andrew was 1, he was in a near-drowning accident that gave him cerebral palsy. My parents immediately began searching for a way to help his condition, and the most promising thing they could find was umbilical cord blood stem cells, which have been shown to improve motor and social skills in children with cerebral palsy. However, we couldn&#x27;t find a match because matching happens via ethnicity (at a high level), and my brother and I are mixed race. So, lack of access to cord blood stem cells is a pain point that my family knows deeply, and I felt it the most this past year when my brother passed away. I knew I had to solve this issue for others.<p>I want everyone to have access to their own umbilical cord blood stem cells, especially since more powerful uses will likely be found for these cells in the future. Also, since banked cells can be used by relatives (the closer the better),  this process is really for families, not just individuals. Donated cord blood can save a life, but chances of survival have proven to be much higher with stem cells that you are genetically matched to.<p>Cord blood stem cells have been used for heart disease, liver disease, cancer, IBS, type 1 diabetes, neurological disease, and more. Selma Blair, for instance, has even used them to help her multiple sclerosis. They’ve also been used to help children with neuroblastomas, lymphomas, and leukemia specifically.<p>We are one of the few cord blood banks with an advanced lab—advanced enough to offer placenta banking and manual stem cell processing, which maximizes stem cell count and collection at birth.<p>How it works: we ship our stem cell collection kit to you. You keep it in your bag to bring to the birth, and a nurse or midwife uses the kit (a cord blood bag with a needle and 2 containers for the placenta and cord) to collect. This takes 5-10 minutes. (Delayed cord clamping and cord blood banking are compatible—you can delay cord clamping and bank the rest.) You call us a few hours after birth, and a courier will meet you anywhere in the US within 12 hours to bring the kit to our lab in New Jersey, where it&#x27;s cryopreserved at around -190 degrees C in vapor nitrogen. You will then have stem cells for injury, disease, and other treatment purposes that you can always access upon request.<p>We are more user friendly and more technically inclined than other solutions. Lower costs and tech operations allow us to be the most affordable option. For as low as $35&#x2F;month, parents can store their baby’s once-in-a-lifetime stem cells (our price plans are here: <a href=\"https:&#x2F;&#x2F;anjahealth.com&#x2F;shop&#x2F;#pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;anjahealth.com&#x2F;shop&#x2F;#pricing</a>).  While we realize that our price points are still an investment, we are currently the most affordable and we think it’s worth it because it could potentially save a life. Our hope is to bring costs down over time, so more people can access this potentially life-saving process.<p>Cord blood banking is a surprisingly little-known option for birth, so a big part of our effort is in education and outreach. Most umbilical cords and placentas are thrown away. (Side note: plancentas are so valuable that physicians - especially in Europe - sometimes prefer to take them for themselves to sell to cosmetics research for ~$50k.)<p>We have a medical advisory board with 2 OB&#x2F;GYNs (Dr. Jay Chang and Dr. Allison Rodgers). Our lab has over 40 years of experience in the blood processing space, and our lab director is a former AABB accreditor. Our lab is AABB accredited and FDA approved.<p>To conclude, if you had a baby recently and banked cord blood, I’d be curious to know what your experiences were. If you didn’t, what prevented you from doing so? If you haven’t had children, what are your current perceptions of stem cells?  Looking forward to your comments!",
      "time": 1644607788,
      "title": "Launch HN: Anja Health (YC W22) – Freezing stem cells at birth for future health",
      "type": "story",
      "url": "https://anjahealth.com"
    },
    {
      "by": "pesfandiar",
      "descendants": 1,
      "id": 30305957,
      "kids": [
        30305997
      ],
      "score": 2,
      "time": 1644607785,
      "title": "Antihistamines show promise in treating long Covid-19 symptoms",
      "type": "story",
      "url": "https://news.uci.edu/2022/02/08/antihistamines-show-promise-in-treating-long-covid-19-symptoms-uci-case-report-says/"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 30305923,
      "score": 2,
      "time": 1644607625,
      "title": "Sustainability with Rust",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/opensource/sustainability-with-rust/"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 30305919,
      "score": 1,
      "time": 1644607612,
      "title": "Friends, come warm yourselves by the flaming wreckage of my micro-SaaS",
      "type": "story",
      "url": "https://www.indiehackers.com/post/friends-come-warm-yourselves-by-the-flaming-wreckage-of-my-micro-saas-93d393b07f"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 30305885,
      "score": 1,
      "time": 1644607386,
      "title": "The trees grown from space-faring seeds",
      "type": "story",
      "url": "https://www.bbc.com/future/article/20220210-the-trees-grown-from-space-faring-seeds"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30305884,
      "score": 2,
      "time": 1644607381,
      "title": "Cloud, Load, and Modular Code: What 2022 Looks Like for Shopify",
      "type": "story",
      "url": "https://shopify.engineering/cloud-load-modular-code-shopify-2022"
    },
    {
      "by": "kitkat_new",
      "descendants": 1,
      "id": 30305864,
      "kids": [
        30305945
      ],
      "score": 4,
      "time": 1644607304,
      "title": "UK exports to EU fell by £20bn last year, new ONS data shows",
      "type": "story",
      "url": "https://www.theguardian.com/politics/2022/feb/11/uk-exports-to-eu-fell-by-20bn-last-year-new-ons-data-shows"
    },
    {
      "by": "MartijnBraam",
      "descendants": 0,
      "id": 30305862,
      "score": 2,
      "time": 1644607302,
      "title": "PostmarketOS // v21.12 Service Pack 2",
      "type": "story",
      "url": "https://postmarketos.org/blog/2022/02/11/v21.12.2-release/"
    }
  ]
}