{
  "stories": [
    {
      "by": "tchiotludo",
      "descendants": 0,
      "id": 31271529,
      "score": 1,
      "text": "We have launched Kestra (https:&#x2F;&#x2F;github.com&#x2F;kestra-io&#x2F;kestra), an open source data scheduling and orchestration platform that features high scalability and availability.\nTo achieve this, we rely on Kafka as our core database.<p>We have received feedback that Kafka can be difficult to manage and is a no go on the project. The project did not pass the architecture team for this reason. \nWhile you can use Kafka without creating a full cluster (using a single node setup), it seems that Kafka is synonymous with complexity and problems.<p>We&#x27;re asking for your thoughts on this. We are thinking of making it easier to onboard the project. \nSo my question is this:<p>- Is Kafka really a scary technology, and do you feel like it can be a pain to manage and no go technologies? \n- We also depend on ElasticSearch, do you have the same point of view? \n- We have plans to add another option that will replace both dependencies with jdbc (https:&#x2F;&#x2F;github.com&#x2F;kestra-io&#x2F;kestra&#x2F;pull&#x2F;368), is theses dependencies more comfortable for you? \n- If yes, what type of database is required? (mysql, postgres, others) \n- We also see that Redis could have all the query interface needed for Kestra, what do you think about this one?<p>We&#x27;ve done some research and haven&#x27;t found a cloud database at the moment that could meet all the needs (especially full text search and transaction support), if you have an idea it&#x27;s welcome.<p>Thanks for your time, there&#x27;s a lot of work to build this part, so your feedback is really important to avoid going in the wrong direction.",
      "time": 1651745730,
      "title": "Ask HN: Open-source with Kafka as dependencies, is this a instant turn off?",
      "type": "story"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 31271519,
      "score": 1,
      "time": 1651745578,
      "title": "A Very Long Look at a Cancelled Half-Life Game",
      "type": "story",
      "url": "https://kotaku.com/half-life-2-ravenholm-valve-arkane-dishonored-deathloop-1848882829"
    },
    {
      "by": "Techbotch",
      "descendants": 0,
      "id": 31271511,
      "score": 1,
      "time": 1651745464,
      "title": "Debian images for remote/headless installation",
      "type": "story",
      "url": "https://github.com/philpagel/debian-headless"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 31271500,
      "kids": [
        31271506
      ],
      "score": 1,
      "time": 1651745371,
      "title": "Tbx2 is a master regulator of inner versus outer hair cell differentiation",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-022-04668-3"
    },
    {
      "by": "fsflover",
      "descendants": 0,
      "id": 31271499,
      "score": 1,
      "time": 1651745353,
      "title": "One week Librem 5 field trial",
      "type": "story",
      "url": "http://janvlug.org/blog/one-week-librem-5-field-trial-day-1/"
    },
    {
      "by": "tokai",
      "descendants": 0,
      "id": 31271477,
      "score": 1,
      "time": 1651745034,
      "title": "OpenAlex: The Promising Alternative to Microsoft Academic Graph",
      "type": "story",
      "url": "https://library.smu.edu.sg/topics-insights/openalex-promising-alternative-microsoft-academic-graph"
    },
    {
      "by": "miguelrochefort",
      "descendants": 0,
      "id": 31271459,
      "score": 1,
      "text": "Let&#x27;s imagine you&#x27;re building a company that intends to compete with FAANG.<p>Your company will be expected to have most of these:<p>* AI Research Lab (FAIR, Brain, MLR, Research)<p>* ML Framework (PyTorch, TensorFlow, CNTK, Core ML)<p>* Web Framework (React, Angular, Blazor)<p>* Browser (Chrome, Safari, Edge)<p>* Smart Speaker (Nest, HomePod, Echo)<p>* Smartphone (iPhone, Pixel, Galaxy, Fire Phone, Lumia)<p>* VC Fund (GV, M12, Apple, Alexa Fund)<p>* Virtual Assistant (Siri, Alexa, Assistant, Bixsby, Cortana)<p>* Personal Cloud Storage (iCloud, Drive, OneDrive)<p>* Typeface (Roboto, San Francisco, Segoe)<p>* Personal Video Chat (FaceTime, Duo, Skype, Messenger)<p>* Work Video Chat (Meet, Teams, Chime)<p>* Personal Chat (iMessage, Hangouts, Skype, Messenger, WhatsApp)<p>* Chip (Silicon, Tensor, Pluton, Graviton)<p>* App Store (App Store, Play Store, Microsoft Store)<p>* IDE (Visual Studio, Android Studio, Xcode, Cloud9, Nuclide)<p>* Search (Google, Bing)<p>* True Wireless Earbuds (AirPods, Pixel Buds, Galaxy Buds, Echo Buds, Surface Buds)<p>* Email (Gmail, Outlook)<p>* Programming Language (C#, Swift, Go, Hack)<p>* In-Car Entertainment (CarPlay, Android Auto)<p>* Design (Human Interface Guidelines, Material, Fluent)<p>* Maps (Google Maps, Bing Maps, Apple Maps)<p>* Notebook Hardware (MacBook, Surface, Pixel Book, Galaxy Book)<p>* Desktop OS (Windows, macOS, Chrome OS, DeX)<p>* Wearable (Apple Watch, Pixel Watch, Samsung Watch, Halo, Band)<p>* Health (Apple Health, Google Fit, Samsung Health, HealthVault, Halo)<p>* Smart TV (Apple TV, Chromecast, Fire TV)<p>* Office Productivity (Office, Docs, iWork)<p>* and much more...<p>Some of these are easy to reproduce, through licensing, partnerships, acquisitions, reverse-engineering, or open source forking. For example, it is possible for small companies to design their own typeface, white-label their brand of true wireless earbuds, or develop a basic chat application.<p>On the other hand, some are incredibly difficult to reproduce, due to network effect, lack of data, or R&amp;D costs. For example, designing your own chip, developing your own office productivity suite, obtaining movie streaming rights from all major film producers, or building a digital map of all the streets in the world, might only be achievable by a handful of tech giants. As such, these would be considered to be some of tech&#x27;s largest moats.<p>What are some of the largest moats in tech? Are there technologies out there that a company with 5 billion dollar and 5 years would struggle to replicate?",
      "time": 1651744881,
      "title": "Ask HN: What are tech's largest moats?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31271457,
      "score": 1,
      "time": 1651744875,
      "title": "Safari _img_ tag solving the wrong problem",
      "type": "story",
      "url": "https://lapcatsoftware.com/articles/img1.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31271455,
      "score": 1,
      "time": 1651744867,
      "title": "Own Your Identity (2011)",
      "type": "story",
      "url": "https://marco.org/2011/07/11/own-your-identity"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31271454,
      "score": 1,
      "time": 1651744851,
      "title": "One Tiny German Town, Seven Big Michelin Stars (2013)",
      "type": "story",
      "url": "https://www.nytimes.com/2013/04/07/magazine/one-tiny-german-town-seven-big-michelin-stars.html"
    }
  ]
}