{
  "stories": [
    {
      "by": "andyjohnson0",
      "descendants": 0,
      "id": 30371097,
      "score": 1,
      "time": 1645089534,
      "title": "Space Invaders: Property Rights on the Moon",
      "type": "story",
      "url": "https://www.adamsmith.org/research/space-invaders"
    },
    {
      "by": "elseqq",
      "descendants": 0,
      "id": 30371086,
      "score": 1,
      "time": 1645089390,
      "title": "Trudeau accuses Conservatives of standing with ‘people who wave swastikas’",
      "type": "story",
      "url": "https://www.theglobeandmail.com/politics/article-trudeau-accuses-conservatives-of-standing-with-people-who-wave/"
    },
    {
      "by": "richardfey",
      "descendants": 0,
      "id": 30371076,
      "score": 1,
      "time": 1645089330,
      "title": "A diagram of WW2 German luftwaffe “survival buoys”",
      "type": "story",
      "url": "https://old.reddit.com/r/Damnthatsinteresting/comments/cwvzuh/a_diagram_of_ww2_german_luftwaffe_survival_buoys/"
    },
    {
      "by": "ManOfLand",
      "descendants": 1,
      "id": 30371064,
      "kids": [
        30371073
      ],
      "score": 1,
      "text": "The best ROI I find in programming, or dealing with computers in general, lies in learning shortcuts.<p>Ctrl-V Ctrl-C takes a couple seconds to learn, and saves you hours or days of clicking around, copying, and then pasting.  Same with learning emacs or vim.<p>Learn them once and you&#x27;re set for life.<p>What are some of the best ROIS in life, aside from the obvious (learning personal finance, working out and nutrition, or basic arithmetic) ?",
      "time": 1645089211,
      "title": "Life Shortcuts",
      "type": "story"
    },
    {
      "by": "littlestymaar",
      "descendants": 0,
      "id": 30371050,
      "score": 1,
      "time": 1645089083,
      "title": "Rasputitsa",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Rasputitsa"
    },
    {
      "by": "daniel-cussen",
      "descendants": 2,
      "id": 30371006,
      "kids": [
        30371032,
        30371027
      ],
      "score": 1,
      "text": "I was thinking over the accusations leveled against Facebook--including, among my social circles, by myself--claiming that Facebook is spying on Whatsapp.  It just hit me they are actually not.  It just looks like they are because people consistently reveal personal information they reveal on Whatsapp, on other applications (on phones and ordinary personal computers).  And secondly, on occasion, they don&#x27;t make these tells but there is a coincidence--and Facebook shows an ad for what was only sought for on Whatsapp.<p>It hit me that the pressure on Facebook to stop this from happening is paradoxically forcing them to actually spy on people in a way they currently are not.  What I mean by this is that in order to rule out any recommendations based on a coincidence or double reveal, they actually would YES have to spy on their users.  Yes spy on users, in order to avoid the supposed creepiness.  So that then they can see, oh this user claimed on Whatsapp he enjoys eating cat food (this is my go-to example for Whatsapp alleged creepiness), let&#x27;s make sure not to show any ads for cat food so he doesn&#x27;t freak out.  And for those purposes double reveals and coincidences are identical, they both require mining the Whatsapp messages to identify them because they both appear on Whatsapp messages.<p>Forget completely about the impact on ads of showing users ads about anything <i>except</i> what they want, which is a real concern for Facebook.  It&#x27;s a for-profit company after all, it is meant to care about that.<p>But no matter, focus only on how public pressure affects them:  the public is basically forcing them to do precisely the misdeed they are not doing, that they are accused of doing, in order to appease its accusers.<p>Food for thought.",
      "time": 1645088672,
      "title": "Facebook Is Not Spying on WhatsApp. Is Not",
      "type": "story"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30370983,
      "score": 2,
      "time": 1645088426,
      "title": "Encoding and Decoding Images in Rust",
      "type": "story",
      "url": "https://github.com/image-rs/image"
    },
    {
      "by": "DamonHD",
      "descendants": 0,
      "id": 30370978,
      "score": 1,
      "time": 1645088362,
      "title": "Miriam Violet Griffith (Wikipedia Draft)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Draft:Miriam_Violet_Griffith"
    },
    {
      "by": "shusaku",
      "descendants": 0,
      "id": 30370968,
      "score": 1,
      "time": 1645088271,
      "title": "River (Typography)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/River_(typography)"
    },
    {
      "by": "kkordi",
      "descendants": 0,
      "id": 30370951,
      "score": 4,
      "time": 1645088122,
      "title": "101 AWS Lambda Tutorial for Go Developers – API Gateway (Part 2)",
      "type": "story",
      "url": "https://blog.mantil.com/101-aws-lambda-tutorial-for-go-developers-api-gateway-part-2-7008d2b64a4e?gi=f328329cc368"
    }
  ]
}