{
  "stories": [
    {
      "by": "ardel95",
      "descendants": 0,
      "id": 30132565,
      "score": 1,
      "time": 1643504960,
      "title": "LVars: Lattice-Based Data Structures for Deterministic Parallelism [pdf]",
      "type": "story",
      "url": "https://users.soe.ucsc.edu/~lkuper/papers/lvars-fhpc13.pdf"
    },
    {
      "by": "tenonyx",
      "descendants": 0,
      "id": 30132560,
      "score": 1,
      "text": "As I write this post, my neighbors from above, probably college students, are having a party of their lifetime, laughing, kicking and screaming. I&#x27;m not even mad at them, just full of envy.<p>The last time I had fun like this was in college. I was broke, renting a big flat with a bunch of roommates, but young, healthy, and full of enthusiasm (and booze). Finding friends in my teens and 20s was as easy as going out literally anywhere.<p>When I went to work work, I thought my life would only get better. I worked from home, and I was paid so well, that I kept pushing overtime because if felt too good to last. I made a good career, but in the process, quickly drifted off into a complete isolation.<p>These days I still either work from home, or at best with a bunch of other devs in a mostly empty office. I tried to meet new people at hobbies and dance lessons, but guess what - they&#x27;re all full of lonely developers and other socially awkward people - short guys looking for girlfriends, unattractive&#x2F;aging women looking for husbands, etc.<p>All the &quot;normal&quot; people I knew in the past are now changing diapers and working to pay off their mortgages, which I guess is a kind of consolation. Still, I&#x27;m only in my 30s, and it feels like my life is pretty much done. Doing things by myself is boring and depressing, and a getting into a group of &quot;normal&quot; friends, of both genders, to hang out and laugh with, seems like an impossible goal.<p>Nevertheless, in case someone has any advice beyond finding a hobby and going to therapy, it would be appreciated. Otherwise, maybe someone will at least take this as a cautionary tale to cultivate your social groups while you&#x27;re young. Later it just gets exponentially harder to find them.",
      "time": 1643504913,
      "title": "Ask HN: At a peak of my dev career, I hate my life",
      "type": "story"
    },
    {
      "by": "MarkMc",
      "descendants": 0,
      "id": 30132553,
      "score": 1,
      "time": 1643504870,
      "title": "Show HN: A Hacker News mobile app with crowdsourced images and subtitles",
      "type": "story",
      "url": "https://mclarentimes.com/"
    },
    {
      "by": "bruceb",
      "descendants": 0,
      "id": 30132493,
      "score": 1,
      "time": 1643504436,
      "title": "SoftBank COO Marcelo Claure leaving over $2B pay dispute: reports",
      "type": "story",
      "url": "https://www.kansascity.com/news/business/article257779518.html"
    },
    {
      "by": "exdsq",
      "descendants": 1,
      "id": 30132492,
      "kids": [
        30132501
      ],
      "score": 1,
      "time": 1643504430,
      "title": "Changes in USDA food composition data for 43 garden crops, 1950 to 1999",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/15637215/"
    },
    {
      "by": "ketanmaheshwari",
      "descendants": 0,
      "id": 30132487,
      "score": 1,
      "time": 1643504382,
      "title": "Postcrossing",
      "type": "story",
      "url": "https://www.postcrossing.com/"
    },
    {
      "by": "eeegnu",
      "descendants": 1,
      "id": 30132432,
      "kids": [
        30132468
      ],
      "score": 1,
      "text": "I&#x27;m working on a project and i&#x27;m at a step where there are several options for accomplishing the task, any of them working will do. And because I really don&#x27;t care which of them I use, I try to find which of them will take the least effort&#x2F;time to get working. But i&#x27;ve found myself trapped in a cycle: Every time I dig a little deeper into one solution, I find something that looks like it&#x27;d be unpleasant to deal with and I switch over to inspecting a different solution (e.g. browsing through a different library.) I&#x27;ve looped a few times now between three reasonable routes, getting a little deeper in each one each time. Does anyone else ever get caught in this kind of cycle?",
      "time": 1643504060,
      "title": "Ask HN: Is there a name for this behavioral phenomenon?",
      "type": "story"
    },
    {
      "by": "ericmay",
      "descendants": 0,
      "id": 30132415,
      "score": 1,
      "time": 1643503959,
      "title": "Naval shipyards, thousands of jobs could be coming to Lorain and Lordstown",
      "type": "story",
      "url": "https://www.news5cleveland.com/news/local-news/oh-lorain/naval-shipyards-thousands-of-jobs-could-be-coming-to-lorain-and-lordstown"
    },
    {
      "by": "kev_dot_dev",
      "descendants": 0,
      "id": 30132410,
      "score": 1,
      "text": "Hello fellow hackers,<p>I recently watched the oft-referenced Line Goes Up video[1] and basically ate it up. That being said, I know that that HN leans anti-Crypto and I want to make an effort to not be in an echo chamber. I saw some critical comments on other threads[2][3], but I was hoping to start this thread with the explicit goal of discussing the limitations and oversights of the video.<p>All input and perspectives are welcome, thank you!<p>[1] https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YQ_xWvX1n9g&amp;t=5455s\n[2] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30120437\n[3] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30049130",
      "time": 1643503933,
      "title": "Ask HN: Criticisms of Line Goes Up?",
      "type": "story"
    },
    {
      "by": "dangle1",
      "descendants": 0,
      "id": 30132395,
      "score": 1,
      "time": 1643503820,
      "title": "Gallery: Our Moon's lovely lava channels",
      "type": "story",
      "url": "https://blog.jatan.space/p/gallery-of-lunar-lava-channels"
    }
  ]
}