{
  "stories": [
    {
      "by": "Huhty",
      "descendants": 0,
      "id": 28487533,
      "score": 1,
      "time": 1631312251,
      "title": "How I wrote this 1000 word blog post using speech-to-text on my smartphone",
      "type": "story",
      "url": "https://medium.com/the-blogging-life/how-i-wrote-this-1000-word-blog-post-using-speech-to-text-on-my-smartphone-and-in-under-an-hour-f1f126ce7d45"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 28487530,
      "score": 2,
      "time": 1631312237,
      "title": "Did a U.S. Drone Strike in Afghanistan Kill the Wrong Person?",
      "type": "story",
      "url": "https://www.nytimes.com/video/world/asia/100000007963596/us-drone-attack-kabul-investigation.html"
    },
    {
      "by": "justinzollars",
      "descendants": 0,
      "id": 28487526,
      "score": 1,
      "time": 1631312204,
      "title": "Liberland",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Liberland"
    },
    {
      "by": "SenHeng",
      "descendants": 0,
      "id": 28487472,
      "score": 1,
      "time": 1631311814,
      "title": "Corepack Bundled in Node.js 16.9.1",
      "type": "story",
      "url": "https://nodejs.org/dist/latest-v16.x/docs/api/corepack.html"
    },
    {
      "by": "e2e4",
      "descendants": 0,
      "id": 28487455,
      "score": 1,
      "time": 1631311703,
      "title": "Apple dealt major blow in Epic Games trial",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-58522588"
    },
    {
      "by": "xqcgrek2",
      "descendants": 0,
      "id": 28487450,
      "score": 1,
      "time": 1631311678,
      "title": "Bill Gates Takes Control of Four Seasons Hotels in $10B Deal",
      "type": "story",
      "url": "https://www.wsj.com/articles/bill-gatess-investment-firm-buys-controlling-stake-in-four-seasons-11631109822"
    },
    {
      "by": "zanmat0",
      "descendants": 0,
      "id": 28487444,
      "score": 1,
      "time": 1631311624,
      "title": "Evergrande’s collapse would have ‘profound consequences’ for China’s economy",
      "type": "story",
      "url": "https://www.france24.com/en/asia-pacific/20210910-evergrande-s-collapse-would-have-profound-consequences-for-china-s-economy"
    },
    {
      "by": "Lammy",
      "descendants": 0,
      "id": 28487427,
      "score": 1,
      "time": 1631311499,
      "title": "How the CIA Helped Disney Conquer Florida (2017)",
      "type": "story",
      "url": "https://www.thedailybeast.com/how-the-cia-helped-disney-conquer-florida"
    },
    {
      "by": "rufus_foreman",
      "descendants": 0,
      "id": 28487387,
      "score": 1,
      "time": 1631311272,
      "title": "Howard Stern 9/11 Broadcast [audio]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=w3ebpD-ojxg"
    },
    {
      "by": "throwaway_16180",
      "descendants": 0,
      "id": 28487380,
      "score": 1,
      "text": "Hey HN. This is a throwaway account for obvious reasons.\nI&#x27;ve come to seek advice from you because you know so much and lived so much.\nHere&#x27;s the thing - I graduated in comp. eng. 10 years ago. \nAfter college there weren&#x27;t many jobs in my area and I had to stay near my family (lost a parent + had to take care after the other) so I started in marketing research&#x2F;analytics while many friends went over to tech companies &#x2F; FAANGs at other places. I liked the subject (quantitative, qualitative analysis) and stayed and here I am - at 30 I work as a manager for a big marketing research firm (think Nielsen&#x2F;IRI&#x2F;Kantar&#x2F;IQVIA). I lead a small team and we run analysis with our data - which is collected from &quot;offline&quot; sources such as phone interviews, &quot;online&quot; such as respondents forms from apps or &quot;transactional&quot; such as bills&#x2F;receipts. We even pay people to scan their emails. \nSo far I&#x27;m happily employed, have a good relationship with the team, a good work-life balance and reasonable pay.<p>So what&#x27;s not to like? Well, for starters, the company is &quot;old&quot; and mostly offline: when I have to code, I&#x27;ll do it in R, locally - and each project is just a bunch of sequential scripts applying some method we agreed on. Methods are mostly old school stats. We don&#x27;t have a cloud account, only physical servers, so I have no real cloud skills. We use an on-prem SQL Server and we can get by because it&#x27;s small scale, small data - our research is based on tens of housands of people who agreed to give data on their purchases, media consumption and preferences&#x2F;lifestyle choices (which we collect weekly) to us and this won&#x27;t grow (it&#x27;s an unbiased sample in terms of age&#x2F;gender&#x2F;annual revenue&#x2F;family size from the populations of the countries we work on). Our clients - the big names in S&amp;P 500 - hire us for specific questions and some continuous deliverables. Sometimes FAANGs and other techies will hire us for answering specific questions, but that happens when they either don&#x27;t have the data we do, want to verify something they have little data or when they want to publish something with our name on it - right now, I&#x27;m working with Tiktok. Delivery is not a product, but a pretty report - we have a &quot;self service platform&quot; but if you added a custom, animated cursor and an autoplay MIDI file you&#x27;d make it look newer.<p>Some time ago an ambitious, talented coworker moved to this hot company in the gaming industry. Billions of downloads, millions of users globally. He asked me if I wanted to be contacted by them for some positions and after a few technical&#x2F;behavioral rounds, they offered me a &quot;Data Product Manager&quot; role. I&#x27;d work in a small team helping build internal data products. They seem to have some great people there, including VPs from other hot companies.<p>I&#x27;m willing to go to get exposed to a pure digital company, get in touch with technical things I only read about here on HN, change to a &quot;product&quot; company that operates in another scale and sales are direct to consumers and not B2B with execs shaking hands. This seems like the good strategy for the long term, leave an old industry to a newer one. The position also gets stock options, which is something I don&#x27;t have and could possibly make a difference down the road.<p>Finally, my question is: what am I missing? What sorts of risks are there? In my position, would you do the same (make the move)? I don&#x27;t know a thing about the gaming industry, I just play Pokemon Go with my wife lol.<p>Apologies for the long text and thanks for reading.",
      "time": 1631311195,
      "title": "Ask HN: Should I jump to this new role?",
      "type": "story"
    }
  ]
}