{
  "stories": [
    {
      "by": "pcrh",
      "descendants": 0,
      "id": 32149455,
      "score": 1,
      "time": 1658224426,
      "title": "Aerospace charts a future without jet fuel",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-62120130"
    },
    {
      "by": "ashwwwin",
      "descendants": 0,
      "id": 32149441,
      "score": 1,
      "text": "Hey HN, I believe that easy proof of ownership is an unsolved problem that is one of the blockers towards mass adoption of NFTs. Walletsy is an exploration of my beliefs.<p>Walletsy makes proof of ownership easy and risk free. Get instantly verified in all your servers (that have Walletsy set up) in just a few seconds.<p>Server managers use Walletsy in order to gate their community and run raffles with just a few clicks.<p>Users just connect their Wallet and Discord to Walletsy once, and then no more headaches. They can also link their Twitter, add multiple Wallets and remove them.<p>Looking forward to the feedback.",
      "time": 1658224311,
      "title": "Show HN: Walletsy – Proof of ownership made easy",
      "type": "story",
      "url": "https://walletsy.io"
    },
    {
      "by": "xzen",
      "descendants": 0,
      "id": 32149420,
      "score": 1,
      "text": "Google is one of the big search engine. In Google.com you can find vulenrable websites. The most famous of which is the SQL bug. Most of the malicious hackers use this bug to seriously damage 13,000 websites every day, nearly a hundred of them are big and famous sites, including movie streaming sites that have subscriptions, bypassed with this method, or some of the websites that They store the data of the people of the world, they suffer from this bug. Hackers use these bugs to sell important data in the deep web, which is close to several million dollars, data that are vital and personal privacy of big people. Unfortunately, these websites do not have experimental penetration tests that will be hacked in the future and their vital information will be sold or given to people for free. No, I don&#x27;t know where our data goes, neither do you, we just know that they are not being used properly.",
      "time": 1658224072,
      "title": "1M website has SQL bug",
      "type": "story"
    },
    {
      "by": "marcobehler",
      "descendants": 0,
      "id": 32149391,
      "score": 1,
      "time": 1658223681,
      "title": "Load Testing – Unorthodox Guide",
      "type": "story",
      "url": "https://www.marcobehler.com/guides/load-testing"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 32149389,
      "score": 1,
      "time": 1658223631,
      "title": "Sheep Gets 3 Years in Prison for Killing Woman Under Bizarre South Sudan Law",
      "type": "story",
      "url": "https://www.ibtimes.sg/sheep-sentenced-3-years-prison-head-butting-killing-woman-under-bizarre-south-sudan-law-64798"
    },
    {
      "by": "sgfgross",
      "descendants": 0,
      "id": 32149381,
      "score": 1,
      "time": 1658223592,
      "title": "Study finds solar exposure induces appetite in men, but not in women",
      "type": "story",
      "url": "https://oa.mg/blog/sunlight-may-trigger-hormone-that-makes-men-hungrier-study-suggests/"
    },
    {
      "by": "rob_c",
      "descendants": 0,
      "id": 32149355,
      "score": 1,
      "time": 1658223259,
      "title": "Loot boxes not to be govt regulated in the UK",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-62177616"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 32149352,
      "score": 2,
      "time": 1658223230,
      "title": "Reconstruction of the Shinzo Abe assasination with videos and expert analysis",
      "type": "story",
      "url": "https://graphics.reuters.com/JAPAN-ABE/ASSASSINATION/zgpomxaygpd/index.html/"
    },
    {
      "by": "monsieurpng",
      "descendants": 2,
      "id": 32149341,
      "kids": [
        32149434,
        32149380
      ],
      "score": 5,
      "time": 1658223100,
      "title": "Nearly half of Gen Z is using TikTok and Instagram for search instead of Google",
      "type": "story",
      "url": "https://www.businessinsider.com/nearly-half-genz-use-tiktok-instagram-over-google-search-2022-7"
    },
    {
      "by": "prasenjit_pro",
      "descendants": 0,
      "id": 32149323,
      "score": 1,
      "text": "I have read every productivity book out there. GTD, the Rapid planning method by Tony Robbins, The seven habits of highly successful whatever… all of them, and I have benefitted a lot from each of them. But all of them aim at getting your projects done.<p>That’s a bad idea. Your projects get done, and now what? As a productive individual, with what are you left? With my recent approach to things that took my first startup Proxies API to profitability, I realized that aiming productivity tools at projects were not helping me.<p>Instead, I aim to build habits.<p>Because mastery of productivity tools and methods don’t build your confidence, habits develop your confidence. You are only as confident as your habits. Tweet that!<p>I, in my psyche, don’t see that I have to build a successful startup in Proxies API. It appears like that to other people. For me, I have built two habits, which, in turn, create a successful startup. The habits are:<p>a) Make the product better every day<p>b) Write every day<p>I have never really missed a day; that’s where my confidence comes. Even if Proxies API fails for some reason, it is not a huge setback, because I got my boys, which is this relentless chugging away at making the product better and writing about it every single day.<p>I feel this is the proper application of all productivity techniques. If you subscribe to this view, here is a check that you can do at the end of every month to see if you are on the right track.<p>What habit have you built in the last 30 days? Which you have done every single day?<p>What pattern are you planning to develop in the next 30 days?<p>The answers to these questions can be quite telling because they predict the success or failure of your projects or startups. Also, they anticipate your confidence level.<p>The author is the founder of Proxies API (https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;), a proxy rotation api service.<p>This article originally appeared here: https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;blog&#x2F;Throw-Away-Your-Productivity-Techniques.php",
      "time": 1658222961,
      "title": "Throw Away Your Productivity Techniques",
      "type": "story"
    }
  ]
}