{
  "stories": [
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 31584826,
      "score": 1,
      "time": 1654103064,
      "title": "How Walmart Is Betting Big on Stores to Catch Amazon in E-Commerce [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=vAL2YtZRiIY"
    },
    {
      "by": "mirrormaster",
      "descendants": 0,
      "id": 31584819,
      "score": 1,
      "time": 1654103037,
      "title": "Ask HN: How do you backup your laptop?",
      "type": "story"
    },
    {
      "by": "hownottowrite",
      "descendants": 0,
      "id": 31584818,
      "score": 1,
      "text": "I took some offense at Elon&#x27;s comments about the products other companies may or may not ship while teams are working remote. To be honest, I&#x27;m not really sure what qualifies as a great product at Tesla these days. Automotive editorial aside, I thought I&#x27;d throw it out to HN to talk about the cool things they&#x27;re shipping while working remote. No doubt there are TONS of actual products that people release while working remote.<p>What have you released recently? Why is it awesome?<p>Ref: https:&#x2F;&#x2F;electrek.co&#x2F;2022&#x2F;06&#x2F;01&#x2F;elon-musk-tesla-employees-come-back-office-or-quit&#x2F;",
      "time": 1654103030,
      "title": "Ask HN: When was the last time you shipped a great product while working remote?",
      "type": "story"
    },
    {
      "by": "edsimpson",
      "descendants": 0,
      "id": 31584816,
      "score": 1,
      "time": 1654103019,
      "title": "Bitwarden Adds Email Alias Support",
      "type": "story",
      "url": "https://bitwarden.com/blog/add-privacy-and-security-using-email-aliases-with-bitwarden/"
    },
    {
      "by": "felipemocruha",
      "descendants": 0,
      "id": 31584814,
      "score": 1,
      "time": 1654103012,
      "title": "Polymath Engineer Weekly #9",
      "type": "story",
      "url": "https://polymathengineer.substack.com/p/issue-9"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 31584812,
      "score": 1,
      "time": 1654103003,
      "title": "Data Science in Context: Foundations, Challenges, Opportunities",
      "type": "story",
      "url": "https://datascience.columbia.edu/news/2022/data-science-in-context-foundations-challenges-opportunities/"
    },
    {
      "by": "toledocavani",
      "descendants": 0,
      "id": 31584806,
      "score": 1,
      "text": "We are a small (~50 persons, mostly juniors) 4 years old software shop that do outsourcing mostly. The senior team have development and QA background with good skill and experience, done &gt;20 finished projects for both start-ups and enterprises. Those are to say that we do have the skills and experience on getting things done and get the bucks.<p>I did most of the DevOps for the company, and I did get the job done, as in, project A requires an AWS setup with K8s, Lambda, CI&#x2F;CD,... , I can setup that, no big problem with help from Google. So, in the middle of last year, I got promoted from Senior Full-Stack Engineer to Senior DevOps Engineer, Head of Operations (with operations are everything outside of dev and test).<p>I&#x27;ve been struggling since then, as the only DevOps guy in the company and no experience&#x2F;mentor in this role, I don&#x27;t really know what to do. So, after 1 year, I have almost no progress and nothing to promise, leader understood the situation and didn&#x27;t push me much but I still feel pretty bad.<p>Some of the areas that I&#x27;m stuck:<p>- Direction: as we invest more in our own SaaS, I don&#x27;t know what need to be done outside of getting the thing running on production and watch out for error and outage and SSL expire.<p>- Certifications: I heard about ISO 27000s, NIST xxx, ... but what certificate is the most important for organization&#x2F;product, what need to get first, roadmap,...<p>- Training: I need to train new DevOps, but I realized that I&#x27;m doing it really inefficiently, asking the juniors to watch Udemy courses and practice by themselves get to nowhere now.<p>- Conformity: when working with enterprises, you usually get those big questionnaires and request for documents of network&#x2F;asset&#x2F;data&#x2F;... security&#x2F;policy, we got over by asking for example documents and fill it in. Now I know I need to write those anew for our organization, I don&#x27;t know what is needed.<p>- Adaptation: most of my new tech knowledges came from Hacker News, reading the articles. Is it an efficient way to know the latest trends, newest vulnerabilites,... ?<p>- Management: I wrote my first yearly report in only 1 page, team and I expected more information but had no clue what else should be in there. I&#x27;m also not sure all the areas I listed out here are all there is, could have missed something big.<p>So, what are some good, important resources to learn in this new position that can help me overcome those issues?",
      "time": 1654102962,
      "title": "Ask HN: What are the most important resources to learn as lead of operations?",
      "type": "story"
    },
    {
      "by": "awooo",
      "descendants": 0,
      "id": 31584791,
      "score": 2,
      "time": 1654102896,
      "title": "Kagi Search – Public Beta",
      "type": "story",
      "url": "https://blog.kagi.com/kagi-orion-public-beta"
    },
    {
      "by": "conductrics",
      "descendants": 0,
      "id": 31584789,
      "score": 1,
      "time": 1654102892,
      "title": "Explaining Concepts Behind AB Testing Without Math",
      "type": "story",
      "url": "https://conductrics.com/ab-testing-ruling-out-to-conclude/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31584788,
      "score": 1,
      "time": 1654102890,
      "title": "Researcher goes public with WordPress CSP bypass hack",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/researcher-goes-public-with-wordpress-csp-bypass-hack"
    }
  ]
}