{
  "stories": [
    {
      "by": "croes",
      "descendants": 0,
      "id": 31621769,
      "score": 1,
      "time": 1654357790,
      "title": "Reports show scammers cashing in on crypto craze",
      "type": "story",
      "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/06/reports-show-scammers-cashing-crypto-craze"
    },
    {
      "by": "hsnewman",
      "descendants": 0,
      "id": 31621717,
      "score": 1,
      "time": 1654357541,
      "title": "Doom Port Released as BIOS Payload",
      "type": "story",
      "url": "https://www.tomshardware.com/news/doom-port-released-as-bios-payload"
    },
    {
      "by": "rdpintqogeogsaa",
      "descendants": 0,
      "id": 31621702,
      "score": 1,
      "time": 1654357481,
      "title": "Boot drive encryption security on Windows",
      "type": "story",
      "url": "https://threedots.ovh/blog/2022/06/boot-drive-encryption-security-on-windows/"
    },
    {
      "by": "matthewtoast",
      "descendants": 0,
      "id": 31621689,
      "score": 1,
      "text": "Lorblets is a little puzzle game I made: https:&#x2F;&#x2F;www.lorblets.com&#x2F;<p>Lorblets is a variation on Lights Out. The goal of Lorblets is to turn ON all the lights. Unlike Lights Out (typically a grid of black and white squares), Lorblets puzzles have complex shapes (and bright colors!). The puzzles in Lorblets are generated at random from a seed, and they grow in size as you progress.<p>The code quality is...not great? The design leaves something to be desired. And the game itself is a bit derivative. So why am I sharing this? Because I want to celebrate having shipped a complete game - modest though it may be.<p>I&#x27;m a 39yo who has long dreamt of one day making a game. And yet I&#x27;ve tended to put my software engineering skills to work doing everything except that. I&#x27;ve devised complicated game mechanics on paper. I&#x27;ve written multiple overly complicated game &quot;engines&quot; in JavaScript. I&#x27;ve daydreamed for countless hours about my magnum opus: a 3D simulated open world with a natural language interface, narrative generation, character customization, scene building tools, a modding system... Long story short, that magnum opus has been fun to tinker on, but has not amounted to much beyond the spinning of wheels and the occupation of my free time.<p>So over the Memorial Day holiday I decided to force myself to complete one game before the weekend was over. I would conceive the simplest possible game mechanic and UI. I would not worry if it was unoriginal. I would resist the urge to add complexity. I would not get bogged down standing up a framework. I would not build an &quot;engine.&quot; I would not worry about clean code, or maintainability, or even performance. I would use the tech stack that I could work fastest in: web tech. And I would not worry that the astral projection of Jonathan Blow would visit me at night and chide me for having made a badly performing web browser game.<p>So, Lorblets is the result. Whatever one might say about it, it IS a game, and that&#x27;s something. Feedback is welcome of course - but I mostly just wanted to share my story with y&#x27;all.",
      "time": 1654357425,
      "title": "Show HN: Lorblets, a Little Puzzle Game",
      "type": "story"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 31621565,
      "score": 2,
      "time": 1654356955,
      "title": "ARM64 *is* the Apple ISA, it was designed for Apple's microarchitecture plans",
      "type": "story",
      "url": "https://twitter.com/stuntpants/status/1346470705446092811"
    },
    {
      "by": "abdouls",
      "descendants": 0,
      "id": 31621546,
      "score": 1,
      "time": 1654356889,
      "title": "The Race to Hide Your Voice",
      "type": "story",
      "url": "https://www.wired.com/story/voice-recognition-privacy-speech-changer/"
    },
    {
      "by": "wazbug",
      "descendants": 0,
      "id": 31621532,
      "score": 1,
      "time": 1654356825,
      "title": "Cockroaches mutate to beat humans' traps by losing their taste for sugar (2013)",
      "type": "story",
      "url": "https://www.mirror.co.uk/news/technology-science/science/cockroaches-mutate-beat-humans-traps-1909259"
    },
    {
      "by": "morpheos137",
      "descendants": 1,
      "id": 31621500,
      "kids": [
        31621762
      ],
      "score": 2,
      "text": "Seems to me the idea that Putin wants to resurrect the Russian Empire is a red herring excuse to funnel money to the MIC. It would be more logical for the USA and Europe to be friends with Russia even if the price to pay is a neutral, non-EU ukraine. The current situation makes about as much sense as if we sacrificed our friendship with the UK to support Ireland in a violent take over of Northern Ireland. What does Ukraine bring to the table that is worth destablizing Europe for?",
      "time": 1654356691,
      "title": "How is it in the EU/USA interest to supply weapons to Ukraine?",
      "type": "story"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31621474,
      "score": 1,
      "time": 1654356608,
      "title": "WSJ Ends Google Users' Free Ride, Then Fades in Search Results (2017)",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2017-06-05/wsj-ends-google-users-free-ride-then-fades-in-search-results"
    },
    {
      "by": "firstSpeaker",
      "descendants": 0,
      "id": 31621443,
      "score": 1,
      "text": "I see some really nice presentations here and there with amazing clip arts, pictures, etc.<p>I wonder if there is a source to get such clip arts, public domain or paid, as a bundle. Or those presenters are drawing and making the presentations themselves.<p>Long ago, when I was young and more into presenting there were the bundles that one could buy and add to MS PowerPoint and use freely. I do not know if that is still the case or if it has changed since then.<p>If the presenters are mostly drawing their own clip arts, what hardware and software are the most commonly used?",
      "time": 1654356461,
      "title": "Ask HN: Where do you get clip arts for presentations?",
      "type": "story"
    }
  ]
}