{
  "stories": [
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31061212,
      "score": 1,
      "time": 1650206883,
      "title": "The Pandemic Was Supposed to Push All Shopping Online. It Didn’t",
      "type": "story",
      "url": "https://www.wsj.com/articles/the-pandemic-was-supposed-to-push-all-shopping-online-it-didnt-11650081652"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31061204,
      "score": 1,
      "time": 1650206854,
      "title": "Iron in Cereal [Elements, Mixtures, and Compounds] [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=NHqN-Be5nlU"
    },
    {
      "by": "JamesAdir",
      "descendants": 0,
      "id": 31061192,
      "score": 1,
      "time": 1650206768,
      "title": "Monday review. It's almost ruined my business. Avoid this software at all costs",
      "type": "story",
      "url": "https://old.reddit.com/r/productivity/comments/t2n12k/mondaycom_review_its_almost_ruined_my_business/"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 31061171,
      "score": 2,
      "time": 1650206626,
      "title": "Musk's tweet about taking Tesla private was false, U.S. judge rules",
      "type": "story",
      "url": "https://www.autonews.com/executives/elon-musks-tweet-about-taking-tesla-private-was-false-us-judge-rules"
    },
    {
      "by": "JosephPitt",
      "descendants": 0,
      "id": 31061164,
      "score": 1,
      "text": "Hi there,<p>I developed my business myself &amp; spent ~$3k of my own funds. When my website was 95% complete, I got one of my friends, Zake* to create my logos about a month before we went live. We agreed that I’d pay Zake $300 for the logos. Zake changed their mind &amp; said I should rather give them 5% of my business, co-founder title &amp; a “seat at the table”. This was 1.5 years ago &amp; it was their initial offer, I didn’t negotiate with them.<p>We didn’t sign any type of contract at all (bad idea, I know). We verbally agreed that Zake would a) post on social media 5 days a week b) do our SEO c) update the website images once a month, minor things like changing the website banner d) make any misc documents look good (no content just aesthetics) ie our pitch deck e) attend our weekly team meetings. I pay for everything, which I think is fair.<p>On our website Zake is listed as a co-founder, but we have no signed contract&#x2F; paperwork whatsoever, their shares are sweat shares &amp; they haven’t invested any money into the business.<p>We’ve had a lot of “almosts” but as of today we have don’t have any investors &amp; the company is not worth much. YTD, we make about $2k - $5k in monthly revenue. Last year, we were making $0 - $1k a month. We live in a developing country, cost of living is a lot lower here.<p>Zake does close to nothing &amp; I have proof of me repeatedly asking them to do their tasks. For the past 1.5 years this has been an ongoing issue with us. I have emails of Zake admitting that they don’t pull their weight &amp; they’ll change, but they haven’t.<p>I want Zake to leave my business. About a week ago I sent Zake a kind email stating that it may be “best for both of us” if they leave the business. I offered Zake $750 as a severance package of sorts. They have not responded. I texted &amp; dm’d too &amp; no response either.<p>Honestly, I don’t mind negotiating with them &amp; giving them a bit more money, I just want them gone. They don’t even attend our team meetings anymore. This whole year they’ve worked on the business for max 2 hours (team meetings included), it’s almost May.<p>Although they were supposed to do the SEO in September 2020, they still haven’t done it. I paid a freelancer to do the SEO instead. Other than the SEO, I’m doing all of Zake’s tasks. Literally 100%. It’s honestly not that tough. I spend max 2 hours a week doing it &amp; I know that Zake just doesn’t care about the business, which is okay but they should just  leave then.<p>Since I’ve been gaining popularity on my personal social media (my followers are in the 6 figures, last year it was 5 figures) our sales have been rapidly increasing &amp; I sense that Zake is keeping one foot in the door in case we blow up, but they aren’t willing to do any of the work to help us get there. I also have a great opportunity that will make my business more money &amp; I want to be sure that Zake is no longer part of the business before that happens, or least we should have a signed contract. This opportunity is time sensitive &amp; I haven’t told anyone about it.<p>I’m thinking about sending Zake a Founder’s agreement, with cliff vesting + termination info. But I doubt they’ll respond to it, never mind sign it.<p>Do you all have any advice on how I can get Zake out completely &amp; quickly? Or any general proposed next steps, especially because we don’t have a contract &amp; they do not respond to any of my messages.<p>They are also one of my oldest &amp; closet friends &amp; I think they think I’ll never get rid of them because of that. I will though.<p>Thanks in advance!",
      "time": 1650206509,
      "title": "How Do I get my Co-Founder to Leave?",
      "type": "story"
    },
    {
      "by": "ikt",
      "descendants": 0,
      "id": 31061163,
      "score": 1,
      "time": 1650206494,
      "title": "“YouTube-dl” and “Pirate Bay” back on DDG",
      "type": "story",
      "url": "https://fosstodon.org/@rudolf/108147439615842718"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 31061154,
      "score": 1,
      "time": 1650206449,
      "title": "The games Nintendo didn't want you to play: Tengen",
      "type": "story",
      "url": "https://nicole.express/2022/the-center-point-can-not-hold.html"
    },
    {
      "by": "hn-0001",
      "descendants": 0,
      "id": 31061138,
      "score": 1,
      "time": 1650206329,
      "title": "What Does “Shitty Job” Mean in the Low-Skill, Low-Pay World?",
      "type": "story",
      "url": "https://www.residentcontrarian.com/p/what-does-shitty-job-mean-in-the"
    },
    {
      "by": "mrtedbear",
      "descendants": 0,
      "id": 31061134,
      "score": 2,
      "time": 1650206286,
      "title": "A Stanford Psychologist Says He’s Cracked the Code of One-Hit Wonders",
      "type": "story",
      "url": "https://www.theatlantic.com/newsletters/archive/2022/04/shania-twain-creativity-one-hit-wonder/629569/"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 31061132,
      "score": 1,
      "time": 1650206279,
      "title": "Evenmoreutils – a collection of command line tools",
      "type": "story",
      "url": "https://github.com/rudymatela/evenmoreutils"
    }
  ]
}