{
  "stories": [
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30610456,
      "score": 1,
      "time": 1646795013,
      "title": "Rivian is sued for allegedly misleading investors about electric vehicle prices",
      "type": "story",
      "url": "https://finance.yahoo.com/news/rivian-sued-shareholder-rolling-back-141032186.html"
    },
    {
      "by": "vaghetti",
      "descendants": 0,
      "id": 30610454,
      "score": 1,
      "time": 1646794995,
      "title": "I live in the country with the most expensive Apple products on the planet",
      "type": "story",
      "url": "https://vaghetti.dev/posts/macs/"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30610453,
      "score": 1,
      "time": 1646794990,
      "title": "A crypto investor lost $120k from clicking on one bad link",
      "type": "story",
      "url": "https://fortune.com/2022/03/08/crypto-scam-risk-and-how-to-stay-safe/"
    },
    {
      "by": "aaronlevin",
      "descendants": 0,
      "id": 30610440,
      "score": 1,
      "time": 1646794788,
      "title": "Show HN: An album art-based Wordle clone called UNCVR",
      "type": "story",
      "url": "https://uncvr.it/"
    },
    {
      "by": "dtx1",
      "descendants": 0,
      "id": 30610434,
      "score": 1,
      "time": 1646794721,
      "title": "Play Half-Life in the Browser",
      "type": "story",
      "url": "https://icrazyblaze.github.io/Xash3D-Emscripten/xash-intro.html"
    },
    {
      "by": "marinesebastian",
      "descendants": 0,
      "id": 30610396,
      "score": 1,
      "time": 1646794393,
      "title": "Mobile Raspberry Pi Setup with iPad Pro [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=A3qn1nqw-Gw"
    },
    {
      "by": "redstarpa",
      "descendants": 2,
      "id": 30610392,
      "kids": [
        30610428,
        30610418
      ],
      "score": 1,
      "text": "Hello Hacker News! We’re Rudy &amp; Roby we are the founders of FURE (https:&#x2F;&#x2F;fure.cab&#x2F;). We are full-stack rideshare advertising agency that provides real-time data on free rides, for feedback on ads shown while enroute. A new solution for advertisers to analyze live feedback of ads from 10 riders to 1 billion riders in 10 seconds.<p>Since its inception, the rideshare industry has become a problem for two primary groups. First, the security one of its primary stakeholder – the rider. The rider at all financial levels has become a victim of surge pricing, in-cab assaults, long waits, and the lack of standardized protection for the community. Second is the welfare of the human capital involved– the driver. The driver became a number, to the cost of being assaulted by a rider, to  market fuel costs and the cost of not having benefits to service by choice, or voice.<p>Today, people and media are constantly talking about the problems facing our industry. We believe the industry wasn’t built for the way it stands now, and the public will move to the best available option. And what we’re building is a new future of rideshare without the drama and complexities of the old. But build on new systems and services that benefits the public in ways that’s long term for every community to provide for its families and neighbors. A better future so we can move more, travel there, and be here.<p>The idea is simple, give the riders the options like to - pay or ride fure, identify their ride, and access to security. The same idea is applied to our drivers, give them the options to choose their status, their benefits, and their right to provide for their families. These aren’t just ideas but the fabric of who we are, our culture to support you, us, and everyone to create their futures. So, we built the features and benefits that helps both riders and drivers move them along the way.<p>Features born out of necessity.\nIdentification - CABeacon™ | Our dashboard display riders and the public can clearly see in any weather; have it wave to you by remote control or track &amp; match the PIN code in a sea of cars. (Industry 1st)<p>Security - CABvue™ | Our eyes on the road and in the cab, to help keep the peace and entertain your friends while you’re getting there. (Industry 1st)<p>Benefits born out of necessity.\n-Compensation - Cash or Crypto \n-Indie or Employee | Take home 90% or 80% of the fare or get paid based on your vehicle. \n-Opt In or Out – Health, Insurance, and Maintenance Plans\n__<p>How our toy works\nJust like any other rideshare user experience, pick a pickup and drop off, select a payment – fure ride or pay, picked fure ride, watch your chariot arrive, confirm and id each other, buckle up, and watch a few ads and answer the questions at the end of each one, once the ride is over, exit, leave a comment or tip and that’s it or try again. Note: If it didn’t work the second time, the third time is a charm.<p>Want to make toys\nBuilding the future is something you want to do, we’re here ready with a mission from home or from a remote office or here at HQ. Apply when you’re ready, we are. resume@fure.cab<p>How we got here\nCyan Banister put out a tweet to Reno, we took a massive chance to fly during a pandemic, meet her and pitch, and landed an offer from her on the spot.\n__<p>Rudy Ferraz – founder&#x2F;biz dev, deaf family man, who likes cars, tech, dance, music, and the stars.\nlinkedin.com&#x2F;in&#x2F;rudyferraz, Rudyferraz.com, @rudyferraz<p>Roby Devassy – founder&#x2F;tech, family man who likes tech, sports and quiet time.\nlinkedin.com&#x2F;in&#x2F;robertdevassy<p>https:&#x2F;&#x2F;fure.cab&#x2F;\nDriver Wait list -http:&#x2F;&#x2F;bit.ly&#x2F;FUREDriversSignupWaitList\nRiders Wait list -http:&#x2F;&#x2F;bit.ly&#x2F;FURERidersWaitList\nYCombinator - https:&#x2F;&#x2F;www.startupschool.org&#x2F;users&#x2F;A5GA-06GE9h4Qw\nTwitter - https:&#x2F;&#x2F;twitter.com&#x2F;furecab\nAngel - https:&#x2F;&#x2F;angel.co&#x2F;company&#x2F;fure-cab (RUV info DM us)\nr&#x2F; - https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;fure_rideshare&#x2F;\nCrunchBase - https:&#x2F;&#x2F;www.crunchbase.com&#x2F;organization&#x2F;fure",
      "time": 1646794351,
      "title": "What's Next for Rideshare",
      "type": "story"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 30610391,
      "score": 1,
      "time": 1646794345,
      "title": "Global Oil Reserves in Barrels",
      "type": "story",
      "url": "https://twitter.com/AFP/status/1501366837065359368"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30610390,
      "score": 1,
      "time": 1646794295,
      "title": "The high-tech sex parties and S&M dungeons of Silicon Valley",
      "type": "story",
      "url": "https://nypost.com/article/inside-the-high-tech-sex-parties-and-sm-dungeons-of-silicon-valley/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30610356,
      "score": 2,
      "time": 1646793730,
      "title": "Bitcoin May Serve Many Masters in the War in Ukraine",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-03-08/bitcoin-may-well-serve-many-masters-in-war-in-ukraine"
    }
  ]
}