{
  "stories": [
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 32103332,
      "score": 1,
      "time": 1657846757,
      "title": "Is It a Bird? Is It a Plane? No, It’s a Flying Ferry",
      "type": "story",
      "url": "https://www.wired.com/story/flying-ferry-stockholm/"
    },
    {
      "by": "AnhTho_FR",
      "descendants": 0,
      "id": 32103323,
      "score": 1,
      "text": "Why are Nespresso machines everywhere in Europe, vs nowhere in the US, where Keurig coffee makers are thee most popular? \nWhy didn’t Nespresso take off in the US, and conversely?",
      "time": 1657846700,
      "title": "Coffee: Why Keurig in vs Nespresso In?",
      "type": "story"
    },
    {
      "by": "jameshskelton",
      "descendants": 1,
      "id": 32103319,
      "kids": [
        32103320
      ],
      "score": 1,
      "time": 1657846683,
      "title": "Padding in Convolutional Neural Networks with PyTorch",
      "type": "story",
      "url": "https://blog.paperspace.com/padding-in-convolutional-neural-networks/"
    },
    {
      "by": "jbonniwell",
      "descendants": 0,
      "id": 32103268,
      "score": 2,
      "time": 1657846371,
      "title": "Circle discloses full breakdown of $55.7B USDC reserves",
      "type": "story",
      "url": "https://cointelegraph.com/news/circle-discloses-full-breakdown-of-55-7b-usdc-reserves"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 32103257,
      "score": 1,
      "time": 1657846312,
      "title": "The New Numbers on Music Consumption Are Ugly",
      "type": "story",
      "url": "https://tedgioia.substack.com/p/the-new-numbers-on-music-consumption"
    },
    {
      "by": "aidepast",
      "descendants": 1,
      "id": 32103238,
      "kids": [
        32103305
      ],
      "score": 2,
      "text": "I value my intellect, but I&#x27;ve been rendered non-functional by OCD, anxiety et al. Strongly considering a medication, I now have a prescription for escitalopram 20mg.<p>I&#x27;m 27. For over four years, I&#x27;ve been in bed for 22+ hours of my day, browsing the internet from a smartphone, planning &amp; daydreaming how I&#x27;d like my life to be. I went almost 3 years without bathing. I have not brushed my teeth in over 4 years. I feel like an old man when I get out of bed. I cannot perform the smallest &amp; most basic of actions without my OCD &amp; anxiety regulating &amp; controlling me.<p>With all of that, I still hesitate to try this psychiatric medication as I fear it will lead to some sort of permanent degeneration or alteration to my cognitive ability, which I hold highly without any good empirical reason. As a layman, I understand serotonin to, in general, bring relaxation and contentment with your situation, perhaps carelessness.<p>I know that you must have a balance, but I don&#x27;t want to feel content with my horrible situation, and these do not seem like qualities that endow a personality which is motivated to and succeeds in solving hard problems and thinking critically through life, but more of the stereotyped apathetic, careless, and blunted &quot;zombie&quot; effect that echos with experiences I&#x27;ve already read.<p>I&#x27;m not sure that I could forgive myself if this medication neutered or sterilized my brain. It&#x27;s all that I have.",
      "time": 1657846158,
      "title": "Ask HN: What is your experience with SSRIs?",
      "type": "story"
    },
    {
      "by": "nostromo177",
      "descendants": 0,
      "id": 32103218,
      "score": 1,
      "text": "Why?",
      "time": 1657846006,
      "title": "Why do so many web news articles not have a date in title?",
      "type": "story"
    },
    {
      "by": "zenia_penny",
      "descendants": 0,
      "id": 32103216,
      "score": 1,
      "text": "[I’m a ~20yo male]<p>I’m mostly looking for a remote position and I have a relatively strong (Junior) background in programming but can’t communicate orally properly, especially at interviews, especially behind the phone…<p>Because of the fact that we travel a lot with my family (and I’m required to be with them) I can’t find a job at Walmart&#x2F;Costco&#x2F;… cuz they all take time to be applied and the moment I get applied we have to move…<p>So I went on Kijiji&#x2F;Craigslist and similar websites to find a instant cash job.<p>TL;DR:\nI (a wannabe dev) ended up working as a construction worker (no experience, instant, cash job).<p>I got my iPhone, MacBook and some other accessories through this way (cuz I’m an Apple obsessed user).<p>Tired of this much work, my body hurts ;)<p>Any advice??",
      "time": 1657845983,
      "title": "Tell HN: I’m a wannabe developer, who works as a construction worker",
      "type": "story"
    },
    {
      "by": "whacked_new",
      "descendants": 0,
      "id": 32103198,
      "score": 1,
      "time": 1657845850,
      "title": "Learning Braille",
      "type": "story",
      "url": "https://hippocanvas.com/posts/learning%20braille.md"
    },
    {
      "by": "cercatrova",
      "descendants": 0,
      "id": 32103128,
      "score": 1,
      "time": 1657845373,
      "title": "FizzBuzz in TensorFlow",
      "type": "story",
      "url": "https://joelgrus.com/2016/05/23/fizz-buzz-in-tensorflow/"
    }
  ]
}