{
  "stories": [
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 28448966,
      "score": 1,
      "time": 1631043826,
      "title": "Create slide deck written in Marp Markdown on VS Code",
      "type": "story",
      "url": "https://github.com/marp-team/marp-vscode"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28448962,
      "score": 1,
      "time": 1631043792,
      "title": "‘Panic made us vulnerable’: how 9/11 made the US surveillance state",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/sep/04/surveillance-state-september-11-panic-made-us-vulnerable"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 28448953,
      "score": 1,
      "time": 1631043683,
      "title": "My Personal Quest to Study Supernovae on Mars",
      "type": "story",
      "url": "https://nautil.us/issue/104/harmony/my-personal-quest-to-study-supernovae-on-mars"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 28448948,
      "score": 1,
      "time": 1631043646,
      "title": "Bourbon 101: An Intro to Bourbon for Beginners",
      "type": "story",
      "url": "https://www.eatupnewyork.com/bourbon-101-an-intro-to-bourbon/"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 28448927,
      "score": 1,
      "time": 1631043528,
      "title": "Supporting Pollinators, You, and Your Ecological Community with Anise Hyssop",
      "type": "story",
      "url": "https://worldsensorium.com/supporting-pollinators-yourself-and-your-ecological-community/"
    },
    {
      "by": "fspacef",
      "descendants": 0,
      "id": 28448924,
      "score": 1,
      "time": 1631043514,
      "title": "Levels.fyi – Salaries and Tools to Level Up Your Career",
      "type": "story",
      "url": "https://www.levels.fyi/"
    },
    {
      "by": "monkmartinez",
      "descendants": 0,
      "id": 28448917,
      "score": 1,
      "text": "Hello Everyone - I have long considered buying into a franchise of some kind as a way to diversify my assets, find another source of income, and&#x2F;or securing a tax shelter. Some of the pushback I have heard is that its akin to &quot;buying yourself a job&quot; and &quot;if you believe in that kind of business, you should just use your capital to start from scratch.&quot;<p>I have tried to start several small businesses and quickly found myself overwhelmed with the day to day, eventually losing interest altogether. I am naturally risk averse so when it comes down to making a decision to deploy my capital, I freeze and &quot;find something else to focus on&quot;, leaving the thing I built to wither on the vine.<p>I have built websites since I was 16 as part-time thing, and made really good side money. I didn&#x27;t really have a way to grow that into something more as I lack that foresight. I had a laser cutter and CNC machine where I made designed with CAD and made stuff for friends, family and eventually started making items for other people. It was decent side money, but there is a definite limit on my throughput without more investment and basically going all in. Also, I have written scripts in python for folks on Fiverr and other freelance sites... again, I didn&#x27;t really see a path for my programming skills going forward as I am a mediocre programmer at best.<p>It should be mentioned that I am a full time professional firefighter. Most of my friends work in the trades as side gigs, but I hesitate with that because my job takes a toll on my body already. I have 8 years until I am eligible to retire (I will be 53) and would like to start something that will pay for medical insurance and give me something to do into my 60&#x27;s and hopefully 70&#x27;s.<p>I am interested in hearing anything at this point from this community regarding becoming a franchisee. Pitfalls, horror stories, successes, failures and big wins... all of it. My current job is 90% EMS and 10% firefighting and I think I am pretty good at handling stress. My current job has trained me to be very algorithmic in my thinking, following guidelines and deviating when necessary where lives often hang in the balance. However, without a solid footing in taking business based risks, I am lost when it comes to actionable insight in that arena. The idea of following a &quot;plan&quot; as a franchisee is very appealing for a simpleton like myself due to that perceived or real limitation.",
      "time": 1631043470,
      "title": "Ask HN: Have any of you considered buying into or starting a franchise business?",
      "type": "story"
    },
    {
      "by": "faramarz",
      "descendants": 0,
      "id": 28448906,
      "score": 1,
      "text": "Lately I&#x27;ve found that creating voice notes for myself better encapsulates and is faster at creating to-do&#x27;s and reminders.. however I still have to parse them when I sit behind my computer.<p>Wondering how others are creating lists and checking them off. The ultimate experience for me would be to have the voice notes auto parsed into an ever expanding todo-list",
      "time": 1631043414,
      "title": "Ask HN: What is your workflow for creating personal tasks and tracking them?",
      "type": "story"
    },
    {
      "by": "alemelis",
      "descendants": 0,
      "id": 28448895,
      "score": 1,
      "time": 1631043346,
      "title": "Viganella",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Viganella"
    },
    {
      "by": "protomyth",
      "descendants": 0,
      "id": 28448892,
      "score": 1,
      "time": 1631043327,
      "title": "Australia’s Exporters Continue to Face Increased Shipping Delays and Costs",
      "type": "story",
      "url": "https://gcaptain.com/australias-exporters-continue-face-increased-shipping-delays-costs/"
    }
  ]
}