{
  "stories": [
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31967621,
      "score": 1,
      "time": 1656855585,
      "title": "How to Fix Quantum Computing Bugs",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/how-to-fix-quantum-computing-bugs/"
    },
    {
      "by": "Borkdude",
      "descendants": 0,
      "id": 31967618,
      "score": 1,
      "text": "Made this little thing: https:&#x2F;&#x2F;github.com&#x2F;borkdude&#x2F;bebo<p>In the spirit of deno it allows you to install a script from a https location. I posted this project yesterday but forgot to add &quot;Show HN&quot;...",
      "time": 1656855567,
      "title": "Show HN: Bebo – run Clojure scripts on Deno",
      "type": "story"
    },
    {
      "by": "karfai42",
      "descendants": 0,
      "id": 31967586,
      "score": 1,
      "time": 1656855179,
      "title": "The Journey to Cloud Development: How Shopify Went All-In on Spin",
      "type": "story",
      "url": "https://shopify.engineering/shopifys-cloud-development-journey"
    },
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 31967583,
      "score": 1,
      "time": 1656855156,
      "title": "IPv4 Transfer Pricing",
      "type": "story",
      "url": "https://ipv4marketgroup.com/ipv4-pricing/"
    },
    {
      "by": "disadvantage",
      "descendants": 0,
      "id": 31967582,
      "score": 1,
      "time": 1656855135,
      "title": "Create Elegant Data Visualisations Using the Grammar of Graphics",
      "type": "story",
      "url": "https://ggplot2.tidyverse.org/index.html"
    },
    {
      "by": "disadvantage",
      "descendants": 0,
      "id": 31967576,
      "score": 1,
      "time": 1656855065,
      "title": "GooFonts: Your Favorite Google Fonts Tagged for You",
      "type": "story",
      "url": "https://goofonts.com/"
    },
    {
      "by": "hnnngwdlch",
      "descendants": 0,
      "id": 31967569,
      "score": 1,
      "text": "As a Flutter fan since 2019, the number of mobile and web apps I developed with Flutter grew over the years. A nice side effect was that over time, a library of reusable widgets emerged that were often useful in my future projects.<p>For example, there&#x27;s the DashedPathPainter, which converts any path to a dashed path. Similarly, there&#x27;s the AnimatedBorderPainter, which adds an animated border to its child, similar to the Trim Path feature from Adobe AfterEffects. Or the ChatBubble, inspired by WhatsApp and Telegram, which might be useful in an app with a chat function.<p>I built many of these widgets from scratch because I didn&#x27;t want to add another package to my pubspec.yaml for a single function. Of course, I also use packages for dependency injection, state management, or as an add-on for functional programming. But I&#x27;ve never been a fan of adding another dependency to my project, just for a few helper functions or a single widget.<p>I thought that maybe I&#x27;m not the only Flutter developer in this situation. So I came up with the idea for Flutter Code Snippets: a simple code library for Flutter widgets, entire screens, as well as all kinds of helper functions. You can search for the right component, copy the code and paste it into your project. Done! At least that&#x27;s how simple I imagine it to be ;)<p>Since I had already built a small library from my existing projects, I still had to build the frontend (a web app built with Flutter), add authentication and a database (Firestore), integrate a payment flow (Stripe) and write some backend logic (Google Cloud Functions).<p>The result can be seen at https:&#x2F;&#x2F;flutter-code-snippets.web.app.<p>I&#x27;m now at a point where I&#x27;ve completed all the basic work I wanted to do, and I&#x27;m looking for another round of feedback. I&#x27;d love for you guys to check it out and let me know what you think.<p>Thanks!",
      "time": 1656855012,
      "title": "Show HN: I have built a code library for Flutter projects",
      "type": "story"
    },
    {
      "by": "generichuman",
      "descendants": 0,
      "id": 31967551,
      "score": 1,
      "time": 1656854765,
      "title": "The D Programming Language Vision Document",
      "type": "story",
      "url": "https://github.com/dlang/vision-document"
    },
    {
      "by": "freemint",
      "descendants": 0,
      "id": 31967550,
      "score": 1,
      "time": 1656854765,
      "title": "The Petrie Multiplier",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Petrie_multiplier"
    },
    {
      "by": "uberdru",
      "descendants": 0,
      "id": 31967547,
      "score": 1,
      "time": 1656854737,
      "title": "Temporal analysis of Wikipedia changes with Redpanda and Materialize and dbt",
      "type": "story",
      "url": "https://medium.com/@danthelion/temporal-analysis-of-wikipedia-changes-with-redpanda-materialize-dbt-e372186fb951"
    }
  ]
}