{
  "stories": [
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30226902,
      "score": 1,
      "time": 1644099984,
      "title": "A Fight over the Right to Repair Cars Turns Ugly",
      "type": "story",
      "url": "https://www.wired.com/story/fight-right-repair-cars-turns-ugly/"
    },
    {
      "by": "pshc",
      "descendants": 0,
      "id": 30226830,
      "score": 4,
      "time": 1644099511,
      "title": "Vitalik Buterin on shape rotators vs. wordcels",
      "type": "story",
      "url": "https://twitter.com/VitalikButerin/status/1489998900438077441"
    },
    {
      "by": "magicjosh",
      "descendants": 0,
      "id": 30226777,
      "score": 2,
      "time": 1644099229,
      "title": "Trezor ditches controversial KYC features",
      "type": "story",
      "url": "https://blog.trezor.io/a-decision-on-aopp-789540c2930b?gi=1e8e70e3874b"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30226754,
      "score": 2,
      "time": 1644099105,
      "title": "The Right-Wing Conspiracy Theorists and the Butterflies",
      "type": "story",
      "url": "https://www.sierraclub.org/sierra/right-wing-conspiracy-theorists-and-butterflies-marianna-wright-national-butterfly-center"
    },
    {
      "by": "nixass",
      "descendants": 0,
      "id": 30226712,
      "score": 1,
      "time": 1644098895,
      "title": "Meta threatens to pull Facebook and Instagram from the European market",
      "type": "story",
      "url": "https://archive.ph/kv0Ew#selection-360.0-360.1"
    },
    {
      "by": "choletentent",
      "descendants": 2,
      "id": 30226690,
      "kids": [
        30226750,
        30226760
      ],
      "score": 3,
      "text": "Forgive me for the ignorance of my question.<p>I&#x27;m tired creating backups, or loosing data. Let&#x27;s be honest, sometimes it happens. Does a filesystem that never deletes&#x2F;overwrites anything exist?<p>I envision something like an append only filesystem where you all files in your hard drive are under some OS level &#x27;version control&#x27; and you can rollback to any version you want. Only files in my home dir would be enough. Obviously once space runs out it would start overwriting the oldest versions.",
      "time": 1644098736,
      "title": "Ask HN: I'd like an OS/FileSystem that Never Deletes Anything. Does it exist?",
      "type": "story"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 30226667,
      "score": 1,
      "time": 1644098587,
      "title": "Parallel Algebraic Effect Handlers",
      "type": "story",
      "url": "https://arxiv.org/abs/2110.07493"
    },
    {
      "by": "burnedout008",
      "descendants": 1,
      "id": 30226663,
      "kids": [
        30226857
      ],
      "score": 2,
      "text": "Not trolling. I am a regular HN&#x27;er but throwaway account. I the solo founder of a SAAS company and personally I made $400K from the business for myself last year. I have a million dollar home. I have paid off cars. I have a great life on paper BUT lately I am miserable as hell. I have been trying to figure out what went wrong because I thought I am living my dream (running my own business which I do)<p>I am so lonely. I am strong enough that I don&#x27;t consider killing myself or anything like that but I feel so lost right now.<p>I am considering selling EVERYTHING (including the business and my home) and going really minimal. I have not lived minimally since 2006 (started making 100K plus since then). I am worth  2 Million dollars but feel like a failure. I know  you will say 1st world problem and all but I have worked my ass off to get here and nothing came to me handed. I had to earn every bit of it. I work 60-70 hours per week on the business.<p>I am just so tired of this race. Trying to grow the business (solo founder), customers bullshit, employees bullshit and what not. My wife and I fight about doing upgrades in the house which is never enough. The more money we make, the more we are trying to keep up with in this rat race of materialistic things.<p>Looking for advice from people like me who went minimal since I think that may be a possible option for me. Live a simpler life and then focus on doing things that may bring back that sense of happiness I used to have when I was in college. I know I cannot be caged in corporate jobs. What do I do ? I do have 2 kids and a wife so I am not sure what do but I feel stuck in this life style.",
      "time": 1644098565,
      "title": "Ask HN: Burned out SaaS founder: how to go minimal",
      "type": "story"
    },
    {
      "by": "lornajane",
      "descendants": 0,
      "id": 30226662,
      "score": 1,
      "time": 1644098544,
      "title": "Productivity for Entrepreneurs",
      "type": "story",
      "url": "https://www.karllhughes.com/posts/productivity"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 30226656,
      "score": 1,
      "time": 1644098499,
      "title": "Applying Formal Verification to Microkernel IPC at Meta [pdf]",
      "type": "story",
      "url": "https://scontent-lax3-2.xx.fbcdn.net/v/t39.8562-6/269780870_3156093434714373_7161251617308190287_n.pdf?_nc_cat=102&ccb=1-5&_nc_sid=ad8a9d&_nc_ohc=EPcR_UiMJf0AX83GZrE&_nc_ht=scontent-lax3-2.xx&oh=00_AT_xli6eJ-rrBTJ10JOtvAfxv6GGg0GM8MpFMgQ9A76VdQ&oe=6204556B"
    }
  ]
}