{
  "stories": [
    {
      "by": "codewiz",
      "descendants": 0,
      "id": 28310218,
      "score": 1,
      "time": 1629947877,
      "title": "GTK 4.4",
      "type": "story",
      "url": "https://blog.gtk.org/2021/08/23/gtk-4-4/"
    },
    {
      "by": "smackeyacky",
      "descendants": 0,
      "id": 28310215,
      "score": 1,
      "time": 1629947833,
      "title": "ElectronNET: Cross platform GUI for .NET 5",
      "type": "story",
      "url": "https://smackeyacky.blogspot.com/2021/08/electronnet-cross-platform-gui-for-net-5.html"
    },
    {
      "by": "throwaway-oak",
      "descendants": 0,
      "id": 28310209,
      "score": 1,
      "text": "I took a remote job 8 weeks ago at a high-growth startup as an engineer (no junior &#x2F; senior modifier). I was fairly aggressively recruited by the CEO. I&#x27;ve only ever worked remotely because of COVID, and this is the first large(r) company I&#x27;ve worked for.<p>I had felt the job was going pretty well -- the tech stack is somewhat unfamiliar so I&#x27;ve been getting up to speed and not as productive as some of my team members, and I&#x27;d missed a couple morning standups due to timezone differences and insomnia, but I&#x27;d been talking to my coworkers often, video calling, etc., and we seemed to have a good rapport, and they&#x27;d complimented me on my work multiple times.<p>I saw a meeting with a person I didn&#x27;t recognize suddenly appear on my calendar in the morning without any notice. I thought it was weird, but figured they were a new person and we&#x27;d just be getting to know each other. They were instead an engineering manager I&#x27;d never met before -- not my immediate manager or the CTO.<p>He started talking about my performance being an issue: that I&#x27;d been missing lots of meetings, and not completing enough points per sprint. I was taken aback, it was early in the morning, so I mostly just &quot;uh-huh&quot;&#x27;d and agreed with what he was saying, which may have been a mistake. The meeting was also only 30 minutes before I had to demo a feature to the engineering team, which ended up being pretty scattershot as a result.<p>After the meeting, he sent an email, cc&#x27;d to the CTO, my manager, and HR, basically saying the same things: that I needed to have better attendance at meetings and make a certain number of points per sprint, or my employment would be at risk.<p>I totally understand why those things are important and I&#x27;ve been working on improving both and trying to get up to speed faster, but I was really taken aback by the suddenness: I hadn&#x27;t heard anything from my manager that there was an issue beforehand (I went back through Teams to check and didn&#x27;t see anything).<p>Am I misunderstanding the situation, and this is just how large companies work? What should I say to my immediate manager &#x2F; other people in this story?",
      "time": 1629947728,
      "title": "Ask HN: PIP'd 8 weeks into a new job",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28310205,
      "score": 1,
      "time": 1629947692,
      "title": "From Teaching to Turing to Silicon Valley",
      "type": "story",
      "url": "https://writing.turing.edu/from-teaching-to-turing-to-silicon-valley/"
    },
    {
      "by": "rouli",
      "descendants": 0,
      "id": 28310204,
      "score": 1,
      "time": 1629947688,
      "title": "Data Science Pinpointed the Creepiest Word in “Macbeth”",
      "type": "story",
      "url": "https://onezero.medium.com/how-data-science-pinpointed-the-creepiest-word-in-macbeth-3150995d3808"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 28310192,
      "score": 1,
      "time": 1629947627,
      "title": "Dozens of California students, parents stranded in Afghanistan after summer trip",
      "type": "story",
      "url": "https://thehill.com/policy/international/middle-east-north-africa/569307-dozens-of-california-students-parents-stranded?rl=1"
    },
    {
      "by": "freediver",
      "descendants": 0,
      "id": 28310189,
      "score": 1,
      "time": 1629947622,
      "title": "Welcome to the Firefox Suckfest (2013)",
      "type": "story",
      "url": "https://www.dedoimedo.com/computers/firefox-suckfest.html"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 28310150,
      "score": 2,
      "time": 1629947153,
      "title": "SpaceX president Gwynne Shotwell said the company was low on liquid oxygen",
      "type": "story",
      "url": "https://markets.businessinsider.com/news/stocks/liquid-oxygen-shortage-covid-spacex-gwynne-shotwell-impact-rocket-launches-2021-8"
    },
    {
      "by": "bkohlmann",
      "descendants": 0,
      "id": 28310147,
      "score": 1,
      "time": 1629947094,
      "title": "Portrait of a Professional Baby Maker",
      "type": "story",
      "url": "https://neo.life/2021/07/portrait-of-a-professional-baby-maker/"
    },
    {
      "by": "mpnagle",
      "descendants": 0,
      "id": 28310110,
      "score": 2,
      "text": "Hi HN!<p>Way back in ~2011 I advised a startup, Ginger.io, and got a contract for a small portion of equity in exchanging for advising them. I did some r&amp;d work for them and completed the contract.<p>They moved to SF, I moved to SF, we had a conversation: hey the contract is done, but please keep coming by, after all this only has value if there’s an exit. I did off and on for maybe 1-2 years after end of contract.<p>THE DUMB THING I DID: I misread the contract. I needed to execute the contract right at the end of the 2y advising window. It had a clause, options would be good for ~7 years. I misread that as time to execute. I was wrong. The big moral: get legal advice.<p>Ginger is about to merge with Headspace for a $3bn valuation. I don’t think there’s any recourse at this point (I had a talk with a founder two years ago who was apologetic but said there was nothing to be done,) and I wonder - is there any recourse at this point? Or can I just write up the story and share it so that someone else new to advising doesn’t get f**ed the way I did?<p>Clearly the mistake is mine. Curious if there any avenues I am missing.<p>Thanks!",
      "time": 1629946727,
      "title": "Ask HN: Any recourse for a f***ed contract?",
      "type": "story"
    }
  ]
}