{
  "stories": [
    {
      "by": "ghking",
      "descendants": 0,
      "id": 29350459,
      "kids": [
        29350460
      ],
      "score": 1,
      "time": 1637936958,
      "title": "Who will eventually get the ownership of the Mars? Musk Bezos or Branson?",
      "type": "story",
      "url": "https://twitter.com/ghking6/status/1464236420688936961"
    },
    {
      "by": "THIRDiii",
      "descendants": 0,
      "id": 29350455,
      "score": 1,
      "time": 1637936930,
      "title": "Ask HN: What are the features of C/C++ programming language",
      "type": "story"
    },
    {
      "by": "jgrahamc",
      "descendants": 0,
      "id": 29350447,
      "score": 1,
      "time": 1637936893,
      "title": "Heard in the halls of Web Summit 2021",
      "type": "story",
      "url": "https://blog.cloudflare.com/web-summit-2021-internet/"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29350424,
      "score": 1,
      "time": 1637936754,
      "title": "Saving History with Sandbags: Climate Change Threatens the Smithsonian",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/25/climate/smithsonian-museum-flooding.html"
    },
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 29350423,
      "score": 1,
      "time": 1637936752,
      "title": "Scapegoat Tree",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Scapegoat_tree"
    },
    {
      "by": "osivertsson",
      "descendants": 0,
      "id": 29350391,
      "score": 1,
      "time": 1637936546,
      "title": "Raster2Mesh",
      "type": "story",
      "url": "https://github.com/sylefeb/raster2mesh"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 29350390,
      "score": 1,
      "time": 1637936544,
      "title": "New Covid variant: How worried should we be?",
      "type": "story",
      "url": "https://www.bbc.com/news/health-59418127"
    },
    {
      "by": "SteveChurch",
      "descendants": 0,
      "id": 29350375,
      "score": 2,
      "text": "Hey all,<p>So I have never actually posted on HN however I have been a reader for many years. My time, however, has come to ask a question and potentially some advice or support.<p>I&#x27;m a bit of a project addict, although I have always been in employment my whole career I am constantly coming up with ideas and trying my hardest to push them out there into real business models. It&#x27;s a passion and a hobby of mine, my current employer is fully aware of my &quot;side hustles&quot; and most managers I have worked with in my career have always been welcoming as these side projects tend to really stretch our knowledge. I am sure I am not alone.<p>Now, the problem I currently face is about one of my projects under the guise of The Night Project (https:&#x2F;&#x2F;www.thenightproject.com)<p>Like all projects, I tend to stumble at the point of financials (funding) or resources (people) - And sadly this project I am about to share with you is no exception.<p>Crypto Dip is something I started earlier in the year and have been working on and off to get to a nice live and steady state to really push. It has been welcomed in all of the channels I have shared it, however, there is some farce competition. Sadly, I am starting to fall behind and the competitors who clearly have thousands of users already are starting to implement the same features I have endeavoured to push.<p>Crypto Dip, does not exactly bring anything unique, a lot of platforms offer the same. But the focus was always on education and simplicity. Bringing new people into the crypto world.<p>Anyway, I waffle (as always) - Please check out the website (WIP) and also the WhitePaper:<p>- Website: https:&#x2F;&#x2F;cryptodip.net\n- WhitePaper: https:&#x2F;&#x2F;cryptodip.net&#x2F;static&#x2F;CryptoDip%20-%20WhitePaper.pdf<p>What I really need for CryptoDip to really be something is help, actual physical engineering help from people who want to have a slice of the cake. And I mean an even share in the project and it&#x27;s Token holdings to help me push this over the finishing line.<p>What I am looking for from the community is the following:<p>- Should I sunset this and focus on personal life and other matters I have at hand.\n- Should I look to diversify the project and take on some other engineers, sadly I can not pay, but I can offer token share and project equity share. \n- Should I sunset the project and cut my losses, I&#x27;ve put a few thousand into this project thus far not to mention the engineering time.<p>This project came up mid way through working on a game and sadly I think if I didn&#x27;t do this project I would have the Game live, which to me is a much more exciting thing to be working on.<p>If anyone is interested please reach out to me, Discord is probably the best place (https:&#x2F;&#x2F;discord.gg&#x2F;aQrPxfF2)<p>I am looking for any experience or budding Python Engineers with some micro service experience who would really like to help take this to the next level. If I am unable to find the help then I think the time will have come to sunset the project and archive the codebase.<p>Thank you :bow:",
      "time": 1637936457,
      "title": "Ask HN: To Sunset or Not to Sunset..?",
      "type": "story"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29350359,
      "score": 2,
      "time": 1637936317,
      "title": "The 'Cannamoms' Parenting with Cannabis",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20211116-the-cannamoms-parenting-with-cannabis"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 29350336,
      "score": 3,
      "time": 1637936121,
      "title": "Greek Alphabet",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Greek_alphabet"
    }
  ]
}