{
  "stories": [
    {
      "by": "KathrynDownie",
      "descendants": 0,
      "id": 29623193,
      "score": 1,
      "text": "This is a fantastic opportunity for a senior software developer to join an innovative company and contribute to rFpro’s industry-leading products and cutting-edge development projects. This role is flexible in terms of location.<p>ABOUT RFPRO<p>rFpro is a member of the AB Dynamics plc group of companies. We provide engineering-grade driving simulation software, enabling our customers to develop vehicles, systems and components safely and efficiently. We serve the motorsports and automotive industries, playing a key role in the latter’s highly challenging progression towards automated driving.<p>Our automotive customers are the world’s largest car manufacturers, tier one suppliers and sensor developers. In motorsport we are the market leader of professional driver-in-the-loop simulator software. The champions of every leading professional motorsport category are our customers – in the USA, Europe, UK, Japan &amp; Australia.<p>rFpro’s global teams are passionate about their work. They are motivated to share their expertise across the business, contributing to this dynamic industry. Supported by a friendly, progressive and inclusive culture, individuals benefit from true flexible working, combining remote and office-based locations to enhance work-life balance as well as productivity.<p>ABOUT THE ROLE\nAs a developer in a small, dynamic and expert team you will be working across many varied programs and tasks including migrating our existing desktop product to a cloud&#x2F;software as a service (Saas) application. You will be expected to work independently and proactively as well as part of the team. We are an agile organisation, employing techniques such as TDD, pair programming and continuous integration. You will enjoy the challenge of working directly with customers to solve their problems and provide new solutions or bug fixes. The location of this role is flexible.<p>Principal Responsibilities:<p>Work as part of a team developing our industry-standard vehicle simulation software package\nProduce high-quality software for customers\nDesign and implement new product features\nMaintain and improve existing products\nAdvocate good software engineering practices and continuous professional development\nWork to delivery deadlines<p>QUALIFICATIONS, KNOWLEDGE AND EXPERIENCE<p>Essential:<p>Significant software development experience using C&#x2F;C++\nSelf-motivated, quality-focused, and able to work independently\n5+ years professional experience\nSolid understanding of 3D geometry (vectors, matrices, transforms etc.)<p>Desirable:<p>Knowledge of C#\nDeployment of performance critical software on Linux (e.g. Docker)\nKnowledge of cloud based infrastructure\nExperience in HMI and UX\nExperience in real-time system development\nSoftware development experience using Python\nKnowledge of UDP and&#x2F;or real-time communications systems\nApplied mathematics, particularly rigid body dynamics\nAbility to work directly with customers\nUnderstanding of vehicle dynamics and automotive technology<p>JOIN US!\nThis role is flexible in terms of location. We have offices in Hampshire (Romsey) and Wiltshire (Bradford-on-Avon) in the UK as well as in Germany, USA and Japan. We are also happy for staff to work remotely or to blend home and office-working. We offer a highly competitive benefits package.<p>We are committed to promoting equality of opportunity for all staff and job applicants. We do not discriminate against staff based on age, disability, gender reassignment, marital or civil partner status, pregnancy or maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.<p>To apply for this vacancy, please email your CV and a cover letter to careers@rfpro.com",
      "time": 1639996175,
      "title": "Senior Software Developer Position",
      "type": "story"
    },
    {
      "by": "sochix",
      "descendants": 0,
      "id": 29623184,
      "score": 1,
      "time": 1639996125,
      "title": "Show HN: Christmas Backgrounds for Zoom",
      "type": "story",
      "url": "https://perfectwikiforteams.com/blog/zoom-christmas-backgrounds-2022/"
    },
    {
      "by": "gulbrandr",
      "descendants": 0,
      "id": 29623172,
      "score": 1,
      "time": 1639996045,
      "title": "The Non-Productive Programmer",
      "type": "story",
      "url": "https://gerlacdt.github.io/posts/nonproductive-programmer/"
    },
    {
      "by": "KingCobragum",
      "descendants": 0,
      "id": 29623142,
      "kids": [
        29623143
      ],
      "score": 1,
      "time": 1639995853,
      "title": "King Cobra Male Enhancement Gummies Review",
      "type": "story",
      "url": "https://www.alpha-malesecret.com/kco/v1/network/index2.php?AFID=148&SID=5517-4172&C1=&C2=&cnv=1&click_id=1028f5fae633bb4341443d15fb9c0c"
    },
    {
      "by": "as6127449",
      "descendants": 0,
      "id": 29623127,
      "score": 1,
      "text": "HCTI&#x27;s EHR consultants help you plan and implement MEDITECH inpatient, outpatient, long-term care, home health, ambulatory, and financial systems.<p>https:&#x2F;&#x2F;www.healthcaretriangle.com&#x2F;ehr-consulting&#x2F;",
      "time": 1639995715,
      "title": "Epic Consulting Services",
      "type": "story"
    },
    {
      "by": "eandre",
      "descendants": 0,
      "id": 29623120,
      "score": 1,
      "time": 1639995629,
      "title": "Improving Bug Triage with User Pain",
      "type": "story",
      "url": "https://lostgarden.home.blog/2008/05/20/improving-bug-triage-with-user-pain/"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 29623116,
      "score": 1,
      "time": 1639995583,
      "title": "Neanderthals changed ecosystems 125,000 years ago",
      "type": "story",
      "url": "https://www.universiteitleiden.nl/en/news/2021/12/neanderthals-changed-ecosystems-125000-years-ago"
    },
    {
      "by": "LucasAndrew",
      "descendants": 0,
      "id": 29623090,
      "score": 1,
      "text": "NFT Marketplace\nNFT marketplace is the platform where a person is allowed to sell, buy or bid all digital assets in exchange for the cryptos. The NFT Marketplace can be built on various blockchain networks like Ethereum, Binance smart chain, Solana, Polygon, etc. The NFT marketplace has non-fungible tokens like arts, videos, music and more.<p>How to create an NFT marketplace?\n1. Select the blockchain in which you want to build your NFT marketplace.\n2. Determine the token type specification.\n3. Note down the Features you want on your NFT Marketplace.\n4. Approach the best NFT Marketplace development Company.\n5. Release your platform for beta testing to specific users.\n6. Get the feedback to solve any issue and launch your NFT Marketplace.<p>Get in touch with Maticz to create an NFT marketplace\nWhatsapp : +919384587998\nTelegram : @maticzofficial\nMail : sales@maticz.com",
      "time": 1639995277,
      "title": "Create an NFT Marketplace",
      "type": "story"
    },
    {
      "by": "NithurM",
      "descendants": 0,
      "id": 29623077,
      "score": 1,
      "text": "If yes, how much do you enjoy it? how do you discuss them? and who do you enjoy discussing the books most?",
      "time": 1639995172,
      "title": "Do you discuss the books you read?",
      "type": "story"
    },
    {
      "by": "andruby",
      "descendants": 0,
      "id": 29623069,
      "score": 1,
      "time": 1639995100,
      "title": "Russian 48-core ARM processor Baikal-S release slides",
      "type": "story",
      "url": "https://twitter.com/torgeek/status/1472571292360626186"
    }
  ]
}