{
  "stories": [
    {
      "by": "crystaldecanter",
      "descendants": 0,
      "id": 29307003,
      "score": 1,
      "time": 1637593440,
      "title": "Matchbox Sign",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Matchbox_sign"
    },
    {
      "by": "fsflover",
      "descendants": 0,
      "id": 29306975,
      "score": 2,
      "time": 1637593329,
      "title": "True Convergence is Here: PureOS 10 is Released for all Librem Products",
      "type": "story",
      "url": "https://puri.sm/posts/true-convergence-is-here-pureos-10-is-released-for-all-librem-products/"
    },
    {
      "by": "qwertyuiop_",
      "descendants": 0,
      "id": 29306962,
      "score": 1,
      "time": 1637593267,
      "title": "Dozens of looters rush California Nordstrom store",
      "type": "story",
      "url": "https://www.nbcnews.com/news/us-news/dozens-looters-target-nordstrom-store-walnut-creek-california-rcna6265"
    },
    {
      "by": "robodobo",
      "descendants": 0,
      "id": 29306958,
      "score": 1,
      "time": 1637593257,
      "title": "Idea Legos",
      "type": "story",
      "url": "https://www.notboring.co/p/idea-legos"
    },
    {
      "by": "aleksiloytynoja",
      "descendants": 0,
      "id": 29306954,
      "score": 1,
      "text": "DAOs are arguably the hottest organizations out there at the moment. A new exciting DAO seems to pop up every day, creating massive viral hits like LootDAO or ConstitutionDAO from time to time. It feels like everything that can be formed as a DAO is currently formed as a DAO – which is mostly a great thing, if you ask me.<p>Hype is one thing, the long-term value that lies in the emerging ecosystem is another. Reasonably, many of my friends are asking whether they should start exploring the DAO space further – what are both the short and long term gains and career opportunities?<p>I personally believe DAOs are here to stay. Don&#x27;t get me wrong, all companies won&#x27;t be replaced by DAOs – I am not a maxi and, hence, believe that especially young and rapidly growing, product-driven companies benefit from a certain level of centralization.<p>Yet, I think all community-driven organizations could benefit from a more bottom-up approach. The most excited about the potential of the DAO model I&#x27;m related to:<p>- Protocols\n- Large social platforms\n- Non-profits and co-ops\n- Investment orgs\n- Clubs<p>In all these organizations, value is created when users, members or participants interact with each other in the context of the respective platform. Today, the value they create is captured by centralized platforms and their owners. DAOs change the rules – they offer a native way to capture and share the value with the users themselves, so that interacting with an organization benefits them economically. Think about the resulting network effects...<p>If you share my excitement, I see three main reasons why you should consider working with DAOs:<p>- Mission-drivenness: Since DAOs are community-led organizations, the only way for them to thrive is to ensure their communities are fully vetted to their mission. A single DAO is rarely any member&#x27;s main source of income, meaning that a strong and formative mission is needed to motivate them. However, from an individual&#x27;s point-of-view, when you find a DAO that resonates with you, you enter to a group of like-minded people pushing their shared cause forward. Try to find that in corporates...<p>- Freedom: Internet-native world offers superior freedom for an individual compared to any other form of working. Feel free to work for any org you want to, whenever and wherever you want to. You decide how many hours you are willing to clock in for any certain org, and working for multiple DAOs is accepted, even assumed!<p>- Ownership: Most DAOs compensate their contributors with their proprietary tokens. In other words, you get paid with monetarily denominated assets that enable you to participate in the org&#x27;s governance. As a result, you&#x27;ll have a say on anything the DAO decides to do, either by voting with your tokens or crafting proposals by yourself! What&#x27;s more, tokens of successful DAOs accumulate value in the long run – for the first time, your salary enables compounding wealth creation!<p>It&#x27;s the best to start by experimenting with a few different organizations – it gives you a broad overview of different DAOs&#x27; cultures, working opportunities, and value props. Once you&#x27;ve found a community whose mission you fully align with and vibe you really enjoy from, you can start looking for a deeper contribution. Remember that in Web3 you can always work for multiple orgs – it&#x27;s actually better to do so in order to ensure composability and compounding of the ecosystem!<p>I strongly believe in the future of DAOs and, therefore, recently founded Kleoverse (https:&#x2F;&#x2F;www.kleoverse.com). We make it frictionless to discover DAOs with the most relevant working opportunities, giving step-by-step instructions on how to get involved in and, eventually, become a core contributor of the organizations you believe in the most.<p>If you find it interesting, ensure your early access by signing up today!",
      "time": 1637593226,
      "title": "Why should you work for a DAO – or should you?",
      "type": "story"
    },
    {
      "by": "jlpcsl",
      "descendants": 0,
      "id": 29306944,
      "score": 1,
      "time": 1637593179,
      "title": "Digital Markets Act – The FSFE Calls for Device Neutrality",
      "type": "story",
      "url": "https://fsfe.org/news/2021/news-20211122-01.html"
    },
    {
      "by": "silent_cal",
      "descendants": 0,
      "id": 29306872,
      "score": 1,
      "time": 1637592806,
      "title": "Covid Charts Quiz",
      "type": "story",
      "url": "https://www.covidchartsquiz.com/"
    },
    {
      "by": "dillonraphael",
      "descendants": 0,
      "id": 29306850,
      "score": 1,
      "text": "1UpBlitz is having it&#x27;s first black friday sale. Get 20% off with lifetime updates. Up to 30 people can redeem. Sale ends Friday night.<p>1UpBlitz is the first SaaS start for blitzjs that will save you 60+ hours of work.<p>Head to https:&#x2F;&#x2F;1upblitz.com and use discount code &quot;1upblackfriday&quot; during checkout.",
      "time": 1637592692,
      "title": "1UpBlitz – Black Friday Sale",
      "type": "story"
    },
    {
      "by": "hasheddan",
      "descendants": 2,
      "id": 29306845,
      "kids": [
        29307015,
        29307008
      ],
      "score": 36,
      "time": 1637592679,
      "title": "Rust Moderation Team Resigns",
      "type": "story",
      "url": "https://github.com/rust-lang/team/pull/671"
    },
    {
      "by": "pkilgore",
      "descendants": 2,
      "id": 29306837,
      "kids": [
        29306876,
        29306996
      ],
      "score": 1,
      "time": 1637592661,
      "title": "Facebook’s hate speech policies came at the expense of Black users",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2021/11/21/facebook-algorithm-biased-race/"
    }
  ]
}