{
  "stories": [
    {
      "by": "lapser",
      "descendants": 0,
      "id": 31571390,
      "score": 2,
      "time": 1654013940,
      "title": "Vodafone plans carrier-level user tracking for targeted ads",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/vodafone-plans-carrier-level-user-tracking-for-targeted-ads/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31571373,
      "score": 1,
      "time": 1654013846,
      "title": "Connecticut becomes fifth US state to enact comprehensive consumer privacy law",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/connecticut-becomes-fifth-us-state-to-enact-comprehensive-consumer-privacy-law"
    },
    {
      "by": "nickt",
      "descendants": 0,
      "id": 31571325,
      "score": 1,
      "time": 1654013634,
      "title": "How to wire a Belling-Lee connector",
      "type": "story",
      "url": "http://www.megalithia.com/elect/bellinglee/"
    },
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 31571324,
      "score": 2,
      "text": "Alright, HN. I&#x27;ve seen it here, and in many other places. There is a major outcry about some actor (a country, an institution in a country) doing bad thing X to people. &quot;This cannot stand, we must all do something about it, and that something must be what we say it is.&quot; If you are not with us, you are against us.<p>If someone points out that X is not unprecedented, and in fact, the very countries whose people are shocked and outraged did 5X or 10X regularly, this used to be considered exposing <i>hypocrisy</i> or <i>double standards</i>, and welcomed as intellectual integrity. But in the last 10-20 years, it has come to be derided as &quot;whataboutism&quot;.<p>The most obvious example, but by no means the only one, is that the USA invaded and occupied tons of countries. Just in the last 20 years, I&#x27;ve personally seen news of US forces invade and occupy Iraq (leading to 500K - 1 million excess deaths), Afghanistan (for 20 years), destroy Libya (it is now a failed state).<p>Bush just had a gaffe where he said &quot;one man&#x27;s brutal invasion of Iraq, er excuse me, Ukraine&quot;. And everyone laughed. &quot;I&#x27;m 75&quot;, he said.<p>Trump, when asked whether he will still send weapons to Saudis after the brutal reports out of Yemen, one of the largest humanitarian crises in the world, said &quot;well it&#x27;s billions of dollars and creates a lot of jobs.&quot; Trump says the quiet part out loud due to some mild psychopathy, while Biden might do it out of some mild dementia. Bush might accidentally blurt it out. But the problem remains.<p>Similarly, anti-zionists for example look past the actions of Israel&#x27;s neighbors (Assad bombing Yarmouk, for instance, or Lebanon keeping Lebanese-born people stateless for generations, unable to even hold property, if they had a grandfather from the Nakba, etc.) but navel-gaze at Israel only.<p>The thing is, that we should work as an international society, to PREVENT wars, to RESOLVE refugee crises, with everyone listening to the others&#x27; security concerns, and pitching in. Instead, we get a game of telephone about whether Russia ever applied to NATO, whether NATO ever promised not to expand. There are war hawks everywhere, who call for no-fly zones over Syria (Hillary) or a war of Ukraine vs Russia (Arestovich prediction in 2019) in order to achieve broader geopolitical aims (usually involving some empire or other). But regular people don&#x27;t want war or killing each other. They want citizenship in a country with a good economy.<p>Whataboutism shuts down the real conversation about cooperation to prevent wars and de-escalate conflicts, and instead identifies populations with leaders, and an us-vs-them mentality. And worst of all, it is a one-word shutdown of anyone pointing out hypocrisy, while at the same time appealing for action, NOW, on the basis of that hypocrisy. It simply leads to bullying of people (by BDS supporters, for instance, or Israel supporters on the other hand). Whataboutism itself is <i>valuable</i> because we need to clean up our double standards and solve the core of systemic issues, together and <i>everywhere</i>.",
      "time": 1654013630,
      "title": "The word “whaboutism” considered harmful",
      "type": "story"
    },
    {
      "by": "joe8756438",
      "descendants": 0,
      "id": 31571318,
      "score": 1,
      "text": "Over the last ~five years my wife and I transitioned from city to rural life. Since leaving the city our priorities changed; we&#x27;ve become more focused on caring for our bodies and the environment and participating in activities that support those things (growing food, foraging, hunting, caring for the forest).<p>I have a software development practice: I build Tap [0] and do generalist web development consulting. Over time I see the farm and the software activity supporting each other. I&#x27;m curious, if there&#x27;s anyone on HN that&#x27;s further down this road than I am. How&#x27;s it going? What does your practice look like? Do you continue to enjoy farming and development? Has one or the other taken over?<p>Thanks!<p>[0] https:&#x2F;&#x2F;www.tatatap.com",
      "time": 1654013620,
      "title": "Ask HN: Does anybody balance farming activity with software development?",
      "type": "story"
    },
    {
      "by": "docmechanic",
      "descendants": 0,
      "id": 31571311,
      "score": 1,
      "time": 1654013602,
      "title": "Groundwater: Depleting reserves must be protected around the world",
      "type": "story",
      "url": "https://blogs.egu.eu/network/water-underground/2022/05/20/groundwater-depleting-reserves-must-be-protected-around-the-world/"
    },
    {
      "by": "Rayterex",
      "descendants": 0,
      "id": 31571304,
      "score": 1,
      "time": 1654013574,
      "title": "Show HN: My Python 2D/3D Graphics Engine",
      "type": "story",
      "url": "https://rayterex.gumroad.com/l/mijAE"
    },
    {
      "by": "janpot",
      "descendants": 0,
      "id": 31571301,
      "score": 1,
      "time": 1654013545,
      "title": "The former Spanish monk who built a cathedral on his own",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Justo_Gallego_Mart%C3%ADnez"
    },
    {
      "by": "garritfra",
      "descendants": 0,
      "id": 31571285,
      "score": 2,
      "time": 1654013465,
      "title": "Postgres Docker Container Migration Cheat Sheet",
      "type": "story",
      "url": "https://garrit.xyz/posts/2022-05-31-database-server-migration-cheat-sheet"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 31571253,
      "score": 2,
      "time": 1654013304,
      "title": "Urban street tree biodiversity and antidepressant prescriptions",
      "type": "story",
      "url": "https://www.nature.com/articles/s41598-020-79924-5"
    }
  ]
}