{
  "stories": [
    {
      "by": "twakefield",
      "descendants": 0,
      "id": 29630866,
      "score": 1,
      "time": 1640037438,
      "title": "Why we chose HTTPS instead of RDP for remote windows access",
      "type": "story",
      "url": "https://goteleport.com/blog/passwordless-remote-access-to-windows-servers/"
    },
    {
      "by": "KamaluddinKhan",
      "descendants": 0,
      "id": 29630835,
      "score": 1,
      "time": 1640037314,
      "title": "What is the difference between LoRa and LoRaWAN?",
      "type": "story",
      "url": "https://shopmakergenix.blogspot.com/2021/12/what-is-difference-between-lora-and.html"
    },
    {
      "by": "titusblair",
      "descendants": 0,
      "id": 29630810,
      "score": 1,
      "time": 1640037193,
      "title": "How Much Can Creators Earn Monthly?",
      "type": "story",
      "url": "https://creatorscalculator.com/"
    },
    {
      "by": "miluge",
      "descendants": 0,
      "id": 29630797,
      "score": 1,
      "text": "I’m a junior dev ( &lt; 1 year ) and I was doing some work for a company, I vibe with the team and mostly do CSS ( which I love and they badly need it ), today they offered me a work contract for a year...the problem is I never thought they would give me a contract and started interviewing for another gig.<p>Despite the red flag of the junior profile the guys from the new gig chose me ( but no contract was signed ).<p>Problem is I signed today with the team I currently work with as I feel I need more stability and take my time to grow. But I can’t stop to think that I let the others down ( even if we speaking about a big 400 people company ).<p>I know it is just business and I shouldnt feel bad about it but how do you guys usually deal with situations like this ?",
      "time": 1640037146,
      "title": "Ask HN: Rejecting client work at last minute",
      "type": "story"
    },
    {
      "by": "janandonly",
      "descendants": 0,
      "id": 29630790,
      "score": 1,
      "time": 1640037121,
      "title": "The Maya's ingenious secret to survival",
      "type": "story",
      "url": "https://www.bbc.com/travel/article/20210808-the-mayas-ingenious-secret-to-survival"
    },
    {
      "by": "donsupreme",
      "descendants": 0,
      "id": 29630781,
      "score": 1,
      "time": 1640037089,
      "title": "Home flipping is getting more competitive – and less profitable",
      "type": "story",
      "url": "https://www.cnbc.com/2021/12/20/home-flipping-more-competitive-less-profitable.html"
    },
    {
      "by": "KamaluddinKhan",
      "descendants": 0,
      "id": 29630772,
      "score": 1,
      "time": 1640037033,
      "title": "BME280 Interfacing with Raspberry Pi Pico RP2040",
      "type": "story",
      "url": "https://www.theelectronics.co.in/2021/10/bme280-interfacing-raspberry-pi-pico-rp2040.html"
    },
    {
      "by": "fire_thrwaway",
      "descendants": 3,
      "id": 29630657,
      "kids": [
        29630874,
        29630746,
        29630712
      ],
      "score": 3,
      "text": "Like many others during the pandemic I began speculating on various cryptocurrencies in the past year. I had some modest success earlier in the year but the past few months of have been a whirlwind thanks to a lucky trade where I was able to turn a $5000 NFT purchase into $1.5mm. I have also had good success running various bots to profit from arbitrage opportunities across various blockchains and exchanges, and after scaling up the volume of this activity have made around $500,000 from this in the last half of the year.<p>I am a software developer in a mid-size, medium cost of living city in the US making ~$150k&#x2F;yr with around 6 years of experience. I&#x27;m in my early thirties and recently got engaged to be married in the next year. I own my home outright, have saved 20-30% of my income for my entire career but do have ~$100,000 student loan debt between myself and my future husband. Since I live in a high tax state I can expect to take home maybe a bit over $1mm after taxes, with a net worth of around $1.3-1.8mm at that point. Most of the money I&#x27;ve made in crypto last year is held in stable coins (USDC, DAI, USDT etc.) but I also hold low six figures of ETH and various other tokens. I&#x27;ve pulled out around $200k to my traditional bank account.<p>I&#x27;ve been making an effort to not change my lifestyle despite this new wealth, aside from updating my personal office, computer etc. since I will be able to take those expenses as tax deductions. At this point I feel like I am almost losing money by keeping my day job, since I haven&#x27;t been able to optimize my bots&#x2F;capitalize on opportunities that I would have otherwise. On the other hand, I have no idea how long I will be able to continue to make money from my bots as it continues to become more competitive. I&#x27;m working to find tax and legal professionals but I&#x27;m not sure where to start really and it&#x27;s hard to find someone who will work with me given the nature of my income. My current job has begun to feel like a bit of a dead end, and I get along fine with my co-workers but don&#x27;t feel a strong connection to anyone. On the other hand my current job is very flexible and I can do many of my responsibilities on &quot;autopilot&quot; giving me the bandwidth to to pursue my side projects while holding down my day job. At this point it feels like my options are:<p>- stay at current job but reduce hours\n- find a new job, maybe in crypto\n- quit job and go full time into crypto<p>Is there anything I&#x27;m not thinking of or advice that folks who have been at a similar crossroads can impart? Thanks in advance, I apologize for the length of this post and I hope I distilled all the relevant details here.",
      "time": 1640036363,
      "title": "Ask HN: My side hustle made $2mm in the last 4 months, what should I do now?",
      "type": "story"
    },
    {
      "by": "nabla9",
      "descendants": 0,
      "id": 29630649,
      "score": 1,
      "time": 1640036274,
      "title": "Hundreds of Statistical/Machine Learning models for univariate time series",
      "type": "story",
      "url": "https://www.r-bloggers.com/2021/12/hundreds-of-statistical-machine-learning-models-for-univariate-time-series-using-ahead-ranger-xgboost-and-caret/"
    },
    {
      "by": "joeythegreat",
      "descendants": 1,
      "id": 29630638,
      "kids": [
        29630639
      ],
      "score": 1,
      "time": 1640036234,
      "title": "Cisco Developer Relations in 2021, and What’s Ahead in 2022",
      "type": "story",
      "url": "https://blogs.cisco.com/developer/devrel2021and2022"
    }
  ]
}