{
  "stories": [
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 31295906,
      "kids": [
        31295914
      ],
      "score": 1,
      "time": 1651940176,
      "title": "Growing a New Future for Farming",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/02/science/farming-donald-wyse.html"
    },
    {
      "by": "jtsymonds",
      "descendants": 0,
      "id": 31295858,
      "score": 1,
      "time": 1651939976,
      "title": "Small File Optimization for Object Storage",
      "type": "story",
      "url": "https://blog.min.io/challenge-big-data-small-files/"
    },
    {
      "by": "SteveHM",
      "descendants": 1,
      "id": 31295773,
      "kids": [
        31295774
      ],
      "score": 1,
      "time": 1651939649,
      "title": "A Bridge Between Some Daikin HVAC Units and MQTT – Rewritten in Ada",
      "type": "story",
      "url": "https://github.com/SMerrony/daikin2mqtt"
    },
    {
      "by": "blopeur",
      "descendants": 0,
      "id": 31295749,
      "score": 1,
      "time": 1651939541,
      "title": "The State of U.S. Early-Stage Venture and Startups: 1Q22",
      "type": "story",
      "url": "https://www.angellist.com/blog/the-state-of-us-early-stage-venture-startups-1q22"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 31295737,
      "score": 2,
      "text": "I became interested in the old 8-bit computers like Commodore 64, Apple II, ZX Spectrum, etc. And also on 16&#x2F;32 bit machines like the Amiga line. There are some offers for such machines on eBay but I&#x27;m not sure in what condition they will arrive if I purchase from there. Do you know some place online specialized in reselling such old machines and accessories for them where I can be sure that what I purchase will be in a good working condition?",
      "time": 1651939478,
      "title": "Ask HN: Where to buy old 8-bit computers?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31295730,
      "score": 1,
      "time": 1651939447,
      "title": "Network Cartographs for Interpretable Visualizations",
      "type": "story",
      "url": "https://www.nature.com/articles/s43588-022-00199-z"
    },
    {
      "by": "miguelrochefort",
      "descendants": 0,
      "id": 31295711,
      "score": 1,
      "text": "Apps are skeuomorphic. They typically represent real-world objects or concepts.<p>For example, these are all the apps pre-installed on iOS:<p>- App Store: Software retailer<p>- Books: Book<p>- Calculator: Calculator<p>- Calendar: Calendar<p>- Camera: Camera<p>- Clock: Clock<p>- Compass: Compass<p>- Contacts: Rolodex<p>- FaceTime: Face-to-face interaction<p>- Files: Filing cabinet<p>- Find My: ?<p>- Fitness: Workout log<p>- Flashlight: Flashlight<p>- Health: Health record<p>- Home: Home<p>- iTunes Store: Music retailer<p>- Mail: Mail<p>- Maps: Maps<p>- Measure: Tape measure<p>- Messages: SMS<p>- Music: Music player<p>- News: Newspaper<p>- Notes: Notebook<p>- Phone: Telephone<p>- Photos: Picture<p>- Podcasts: Radio<p>- Reminders: To-do list<p>- Safari: ?<p>- Settings: Buttons, switches, sliders, knobs<p>- Shortcuts: ?<p>- Stocks: Newspaper<p>- Tips: User guide<p>- Translate: Bilingual dictionary<p>- TV: Television<p>- Voice Memos: Tape recorder<p>- Wallet: Wallet<p>Although the one-to-one equivalence between real-world concepts and apps may seem intuitive to those who have experienced the former (older generations), they appear completely arbitrary to those who haven&#x27;t (newer generations). Keep in mind that most kids have no idea that the save symbol represents a floppy disk.<p>Unfortunately, such short-sighted design decisions often remain unchallenged. For instance, most people never asked themselves why we ended up with the arguably inferior QWERTY keyboard layout. Likewise, most of us have accepted the arbitrary boundaries we set between apps.<p>What if this skeuomorphic way of thinking had wider implications than simply facilitating the transition from the analog to the digital world? What if the very idea of apps was the single biggest mistake in the field of software design? How powerful would software be if we directly interacted with data in a general purpose way, rather than being constrained by the limitations of real-world objects in a domain specific way?",
      "time": 1651939382,
      "title": "Ask HN: Why do we still use apps?",
      "type": "story"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 31295679,
      "kids": [
        31295685
      ],
      "score": 1,
      "time": 1651939250,
      "title": "SoulCycle Without the Bike: Here Comes Peoplehood",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/07/style/self-care/soulcycle-peoplehood.html"
    },
    {
      "by": "notlukesky",
      "descendants": 0,
      "id": 31295655,
      "score": 1,
      "time": 1651939136,
      "title": "US Treasury sanctions cryptocurrency mixer for first time, citing Ronin hack",
      "type": "story",
      "url": "https://therecord.media/cryptocurrency-mixer-sanctions-ofac-blendrio-lazarus-group/"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31295627,
      "score": 1,
      "time": 1651939056,
      "title": "Moats: Durable Competitive Advantage",
      "type": "story",
      "url": "https://longform.asmartbear.com/posts/moats/"
    }
  ]
}