{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27987531,
      "score": 1,
      "time": 1627496617,
      "title": "European Data Protection Board adopts Art 65 decision regarding WhatsApp Ireland",
      "type": "story",
      "url": "https://edpb.europa.eu/news/news/2021/edpb-adopts-art-65-decision-regarding-whatsapp-ireland_en"
    },
    {
      "by": "JoeDaDude",
      "descendants": 0,
      "id": 27987525,
      "score": 1,
      "time": 1627496591,
      "title": "Virtual Reality Is the Rich White Kid of Technology",
      "type": "story",
      "url": "https://www.wired.com/story/virtual-reality-rich-white-kid-of-technology/"
    },
    {
      "by": "riantogo",
      "descendants": 0,
      "id": 27987511,
      "score": 1,
      "time": 1627496543,
      "title": "Show HN: Build and monetize your online community",
      "type": "story",
      "url": "https://discoflip.com"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 27987501,
      "score": 1,
      "time": 1627496499,
      "title": "The ₿ Word. Cathie Wood, Jack Dorsey, & Elon Musk",
      "type": "story",
      "url": "https://youtube.com/watch?v=Zwx_7XAJ3p0"
    },
    {
      "by": "kaashmonee",
      "descendants": 0,
      "id": 27987495,
      "score": 1,
      "time": 1627496461,
      "title": "Dorsolateral Prefrontal Cortex",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Dorsolateral_prefrontal_cortex"
    },
    {
      "by": "toomuchtodo",
      "descendants": 0,
      "id": 27987478,
      "score": 1,
      "time": 1627496400,
      "title": "Washington state county is first in US to ban new fossil fuel infrastructure",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2021/jul/28/washington-state-whatcom-county-ban-fossil-fuel-infrastructure"
    },
    {
      "by": "singularity2",
      "descendants": 0,
      "id": 27987470,
      "score": 1,
      "text": "We are setting up a series of zoom call to prepare for SWE interview. On this call, we practice problems as a group. We have been doing this for over 2 months now. Sessions this week are on thursday (29th July), friday (30th July) and Sunday (1st august).<p>We would love to have more people join us.<p>If you are interested in finding more about this or want to sign up use the link below<p>https:&#x2F;&#x2F;www.codewith.group&#x2F;",
      "time": 1627496365,
      "title": "SWE interview preparation zoom call",
      "type": "story"
    },
    {
      "by": "Kluny",
      "descendants": 2,
      "id": 27987460,
      "kids": [
        27987464,
        27987486
      ],
      "score": 1,
      "text": "In light of recent events, I think I am going to propose a motion, probably at our next upcoming meeting, about council communication expectations.<p>This thing where people say &quot;Please don&#x27;t speak to me again except through Renee&quot; is hampering our ability to do business. As elected councilmembers, it is our responsibility to be available to communication from both residents, owners, and other councilmembers. If we&#x27;re not, it becomes impossible to do our jobs.<p>Cooling off periods are necessary sometimes. Having a third party witness for a conversation that might get heated is also a good idea. Having emotionally loaded conversations via email or text is nearly always a bad idea. Acknowledging all these realities, I suggest the following, which is of course open to amendments.<p>First, the private emails chiding someone for their conduct in a meeting should not happen, ever. Such complaints should be added to the agenda and aired in front of everyone. The emails that I saw last night, reprimanding Alexa and Sarah, were inappropriate.<p>There was a strong implication that the author was speaking on behalf of council, or at least on behalf of Karin, when that was definitely not the case.<p>Second, the emails where someone publicly asks another councilmember not to speak to them again except through a third party are very confrontational. I understand the shock of finding an angry email in your inbox and the desire to prevent that from happening. But these &quot;don&#x27;t talk to me again&quot; broadcast emails seem to be weaponized. I don&#x27;t think we should do that anymore. We don&#x27;t have a higher authority to appeal to. Renee is not our mom, she is our employee.<p>Instead, I suggest this phrasing.<p>&quot;The current conversation is becoming too heated for email. Can we meet in person with another councilmember present?&quot;<p>I suggest ending the email at the point, and resisting the temptation to add more personal attacks or digs.<p>If each party cannot, in good faith, meet face to face and have a genuine conversation to work through their problems, then I respectfully suggest that they are not temperamentally suited to this role, and should withdraw from council. I don&#x27;t say this lightly - council is a lot of work and it&#x27;s hard to get volunteers, and we all worry that no one else will step up if one of us steps down.<p>Even so, it&#x27;s not worth it to anyone&#x27;s mental health to stay in a relationship or role where they can&#x27;t function and communicate with their team.",
      "time": 1627496333,
      "title": "Submitted here because I can't email from my work computer",
      "type": "story"
    },
    {
      "by": "jakewins",
      "descendants": 0,
      "id": 27987448,
      "score": 1,
      "time": 1627496275,
      "title": "The Senate is a stack machine, the filibuster a halting problem",
      "type": "story",
      "url": "https://tech.davis-hansson.com/p/congress-is-a-vm/"
    },
    {
      "by": "tosh",
      "descendants": 1,
      "id": 27987437,
      "kids": [
        27987494
      ],
      "score": 1,
      "time": 1627496207,
      "title": "My Brilliant Brain",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2wzs33wvr9E"
    }
  ]
}