{
  "stories": [
    {
      "by": "pinewurst",
      "descendants": 0,
      "id": 29487070,
      "score": 1,
      "time": 1638982182,
      "title": "Elon Musk is learning a hard lesson: never date a musician",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2021/dec/08/elon-musk-is-learning-a-hard-lesson-never-date-a-musician"
    },
    {
      "by": "flerovium",
      "descendants": 0,
      "id": 29487065,
      "score": 1,
      "time": 1638982141,
      "title": "Does the placebo effect apply to dogs?",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/19912522/"
    },
    {
      "by": "rp1",
      "descendants": 0,
      "id": 29487050,
      "score": 1,
      "time": 1638982077,
      "title": "As chancellor of Germany, he phased out nuclear. Now he manages Nord Stream 2",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Gerhard_Schr%C3%B6der"
    },
    {
      "by": "scwoodal",
      "descendants": 0,
      "id": 29487011,
      "score": 1,
      "text": "I was given an 11GB zip file that contains the static HTML output from a CMS system. Edits to content were made in the CMS and then it would output static files to be copied to a web server.<p>Due to cost, that CMS will no longer be used. A replacement CMS has been identified but until that system can be procured and brought online there needs to be a temporary (6-12 months) solution that manages the existing content.<p>What tools&#x2F;solutions would you recommend to manage this?",
      "time": 1638981914,
      "title": "Ask HN: How to manage a large static HTML site?",
      "type": "story"
    },
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 29487009,
      "score": 2,
      "time": 1638981908,
      "title": "Human Image Synthesis from Reflected Radio Waves",
      "type": "story",
      "url": "https://www.unite.ai/human-image-synthesis-from-reflected-radio-waves/"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 29486964,
      "score": 3,
      "time": 1638981734,
      "title": "‘We’re losing IQ points’: the lead poisoning crisis unfolding among US children",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2021/dec/08/lead-poisoning-crisis-us-children"
    },
    {
      "by": "loh",
      "descendants": 0,
      "id": 29486959,
      "score": 2,
      "text": "I&#x27;m curious about what most professional developers are using these days, from languages to deployment, and what they&#x27;re building with it.<p>There&#x27;s a lot to choose from and it seems like a few are really taking the lead. Maybe I&#x27;m biased but I prefer TypeScript, React w&#x2F; Styled Components, and PostgreSQL, all of which seem to be pretty dominant. TypeDoc is also really nice for generating clean documentation from type definitions and comments, and Jest for both front-end and back-end unit tests. I usually deploy (static) progressive web apps to Netlify and APIs to Heroku, but I&#x27;ll probably try Render next.<p>If you&#x27;re like me, you probably like to keep things to a minimum, optimized for a specific purpose without any bloat or unnecessary loose ends. I&#x27;ve built many different apps over the years and found myself repeating the same core functionality for each of them, each with their own slightly different stack and implementation as tools and ecosystems have evolved. I&#x27;d imagine this is the case for most experienced developers who enjoy building things from the ground up, without becoming dependent on an elaborate framework.<p>Last Friday I launched a project called Molecule.dev which aims to provide developers (and professional teams especially) with the most solid foundation possible for full-stack apps, skipping all of the most common tedious core functionality. It was originally built for my own purposes, but I&#x27;ve decided to provide it as a sort of &quot;Foundation as a Service&quot;. Maybe there&#x27;s a better way to classify it, but it isn&#x27;t really a framework. It&#x27;s a highly specialized codebase designed for the task at hand, complete with thorough documentation, tests, and guides, something I wish I had readily available when building apps over the years, as it would have saved me thousands of hours and tens of thousands of dollars.<p>Sorry for the (not so) thinly veiled advertisement, but I absolutely need feedback to turn Molecule.dev into something people actually want, and HN is probably the best place to get it. I think there is a lot of potential here.",
      "time": 1638981717,
      "title": "Ask HN: What is your preferred stack and why?",
      "type": "story"
    },
    {
      "by": "sbt567",
      "descendants": 1,
      "id": 29486902,
      "kids": [
        29487062,
        29487041,
        29487025
      ],
      "score": 14,
      "time": 1638981489,
      "title": "Bjarne Stroustrup: “I Did It for You All ”",
      "type": "story",
      "url": "http://harmful.cat-v.org/software/c++/I_did_it_for_you_all"
    },
    {
      "by": "jesuslop",
      "descendants": 0,
      "id": 29486895,
      "score": 2,
      "time": 1638981463,
      "title": "‘The Character of Physical Law’: Richard Feynman’s Legendary Course, 1964",
      "type": "story",
      "url": "https://www.openculture.com/2021/12/the-character-of-physical-law-richard-feynmans-legendary-course-presented-at-cornell-1964.html"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 29486890,
      "score": 2,
      "time": 1638981436,
      "title": "Pre-highlighted – custom element that extends pre with syntax highlighting",
      "type": "story",
      "url": "https://github.com/mishushakov/pre-highlighted"
    }
  ]
}