{
  "stories": [
    {
      "by": "nishantmodi",
      "descendants": 1,
      "id": 30619439,
      "kids": [
        30619440
      ],
      "score": 1,
      "time": 1646857080,
      "title": "Kindness needs its own economy",
      "type": "story",
      "url": "https://www.greetsapp.com/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30619433,
      "score": 2,
      "time": 1646857023,
      "title": "Ukraine's first-lady, says Russia is waging mass-Murder of Civilians",
      "type": "story",
      "url": "https://text.npr.org/1085420036"
    },
    {
      "by": "hyfen",
      "descendants": 0,
      "id": 30619426,
      "score": 1,
      "time": 1646856925,
      "title": "Prepare Three Envelopes",
      "type": "story",
      "url": "http://braythwayt.com/2022/03/09/prepare-three-envelopes.html"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30619423,
      "score": 1,
      "text": "Is there a users guide available? I am well versed in Social Media Sites, but even so I find the lack of intuitivity cumbersome. A flow chart would be helpful as would a video presentation of how to use the site.<p>So far this site has been “All sizzle and no steak” and by that, to me it seems to have all the intimacy of being one of many at a virtual rally instead of mirroring the experience of attending one live where you can share information with people that you can make soft contact with. I am following 1000 people, strangers all, because there is no way to search for and find any of my contacts. As for it not being censored I understand that it is in fear that Apple will remove their APP.<p>Would reproraming it be an option?",
      "time": 1646856911,
      "title": "Ask HN: Has anyone else had a problem navigating TRUTH SOCIAL?",
      "type": "story"
    },
    {
      "by": "clgistam",
      "descendants": 0,
      "id": 30619412,
      "score": 1,
      "text": "WTF Instagram!<p>Earlier this week something unusual greeted me. I got logged out of my Instagram account. It appeared strange so I attempted to log back in and it displayed user not found. I was confused, was it a hack, was my account compromised. nothing appeared to work.<p>I quickly hopped on google and after a number of searches got a link to send a message to Instagram or meta support inquiring WTF is happening. After a day or so I got a response my account was disabled, and a link to their terms of use.<p>Now the account in question is my personal account. it is private I only share or post personal stuff with close family and friends why will I be in violation?<p>When I attempted to reset my account I noticed it directed me to a page but the email and phone number were not mine.<p>And this just got me thinking Instagram needs users, and users should also have rights. A vague email with terms and service violations is shameful. If I violated your terms let me know the terms I violated. If my account was compromised and you are punishing me I don&#x27;t think that is right.<p>I will love to get input from others who have experienced similar experiences with Instagram.<p>One love.",
      "time": 1646856844,
      "title": "WTF Instagram",
      "type": "story"
    },
    {
      "by": "sandebert",
      "descendants": 0,
      "id": 30619411,
      "score": 1,
      "time": 1646856827,
      "title": "Python script to generate SVG crosswords from a text file",
      "type": "story",
      "url": "https://github.com/jvns/svg_crossworder"
    },
    {
      "by": "lemcoe9",
      "descendants": 0,
      "id": 30619409,
      "score": 1,
      "time": 1646856819,
      "title": "Flowroute Assets Sold to BCM One from Intrado Corporation",
      "type": "story",
      "url": "https://www.globenewswire.com/news-release/2022/03/09/2400309/0/en/BCM-One-Acquires-the-Assets-of-Flowroute-From-Intrado-Corporation.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30619390,
      "score": 1,
      "time": 1646856681,
      "title": "Filtering and transforming relational and tree data with XPath",
      "type": "story",
      "url": "https://relational-pipes.globalcode.info/v_0/examples-xpath-filtering-transforming.xhtml"
    },
    {
      "by": "funOtter",
      "descendants": 0,
      "id": 30619386,
      "score": 1,
      "time": 1646856661,
      "title": "How do I customize the color of the Windows blue screen?",
      "type": "story",
      "url": "https://devblogs.microsoft.com/oldnewthing/20220201-00/?p=106209"
    },
    {
      "by": "smitty1e",
      "descendants": 0,
      "id": 30619380,
      "score": 1,
      "time": 1646856649,
      "title": "My Grudge with the Redmond Racketeer",
      "type": "story",
      "url": "https://www.twobraids.com/2022/03/my-grudge-with-redmond-racketeer.html"
    }
  ]
}