{
  "stories": [
    {
      "by": "anyfoo",
      "descendants": 0,
      "id": 30952760,
      "score": 1,
      "time": 1649385579,
      "title": "Unlambda: Functional Programming Language Nightmares Come True (1999)",
      "type": "story",
      "url": "http://www.madore.org/~david/programs/unlambda/"
    },
    {
      "by": "cato_the_elder",
      "descendants": 0,
      "id": 30952757,
      "score": 1,
      "time": 1649385565,
      "title": "Peter Thiel claims ‘finance gerontocracy’ is holding back Bitcoin",
      "type": "story",
      "url": "https://www.ft.com/content/8d832dac-c0da-4c2b-a43f-f98a4aad1a40"
    },
    {
      "by": "Vladimof",
      "descendants": 1,
      "id": 30952735,
      "kids": [
        30952739
      ],
      "score": 2,
      "time": 1649385371,
      "title": "Sky succeeded at taking down CucoTV from GitHub",
      "type": "story",
      "url": "https://cucotv.github.io/"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 30952723,
      "score": 1,
      "time": 1649385218,
      "title": "‘Housing in ‘07 wasn’t a bubble” is a true statement that almost no one believes",
      "type": "story",
      "url": "https://fullstackeconomics.com/the-2000s-housing-bubble-was-greatly-exaggerated/"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 30952701,
      "score": 2,
      "time": 1649385030,
      "title": "How to Play Trivia Quest, Netflix's New Interactive Show",
      "type": "story",
      "url": "https://www.cnet.com/culture/heres-how-to-play-trivia-quest-netflixs-new-interactive-show/"
    },
    {
      "by": "Vladimof",
      "descendants": 0,
      "id": 30952693,
      "score": 2,
      "time": 1649384988,
      "title": "FreeWater “The First Free Beverage Company”",
      "type": "story",
      "url": "https://www.freewater.io"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 30952689,
      "score": 4,
      "time": 1649384929,
      "title": "Barclays Puts in Sensors to See Which Bankers Are at Their Desks",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2017-08-18/barclays-puts-in-sensors-to-see-which-bankers-are-at-their-desks"
    },
    {
      "by": "barry-cotter",
      "descendants": 1,
      "id": 30952666,
      "kids": [
        30952682
      ],
      "score": 1,
      "time": 1649384650,
      "title": "Be on Substack",
      "type": "story",
      "url": "https://richardhanania.substack.com/p/why-you-should-be-on-substack"
    },
    {
      "by": "samh748",
      "descendants": 2,
      "id": 30952648,
      "kids": [
        30952708,
        30952709
      ],
      "score": 1,
      "text": "I have to be honest that this is a repost[0], but I really would like more perspectives on this.<p>My mind is a mess and I&#x27;m wondering if HN has any tips, experiences, advice, etc. to share.<p>My mental health has improved significantly over the past 10 years, but as the depression lifted and as I gained more mental clarity, I&#x27;m finding myself still struggling with some persistent patterns of thought and behaviour (potentially neurodivergent ones) that are hindering my ability to progress further in life.<p>I&#x27;ll give some examples, though it&#x27;s quite complicated to describe as a lot of these patterns are very paradoxical.<p>- I&#x27;m reliant on routines and predictability to feel calm and settled, while at the same time desire personal freedom and autonomy, in that I really dislike following someone else&#x27;s structure&#x2F;rules and don&#x27;t like being controlled, micromanaged, watched.<p>- I have a strong aversion to discipline, and can never get any productivity&#x2F;organizational methods to work. The act of trying gives me anxiety, makes me feel very detached from myself, and zaps all creativity&#x2F;authenticity&#x2F;enthusiasm out of me.<p>- I work very slowly, both at home and at work. It takes me longer to do the same tasks compared to others at work, and at home I can only accomplish just a few mundane things that take up most of my day. I think it&#x27;s because I&#x27;m paying a lot of attention and being careful with everything I&#x27;m doing, and&#x2F;or I&#x27;m thinking about stuff. No matter how hard I try I can&#x27;t do them any faster (plus rushing = stress and still just as slow).<p>- I think what bothers me most is how all these things lead to my inability to get enough quality self-care. I struggle immensely with 1) finding enough time to do things I enjoy, and 2) when I get some free time I get anxious about having to use this time wisely and productively and end up not doing anything. I just want to sit down and read my books and write my essays but I can&#x27;t :&#x27;(<p>I&#x27;m sure there&#x27;s more but these are the prominant ones that really get to me.<p>Anyway, I&#x27;ve watched this youtube video on ADHD [1] and can definitely identify with several of the descriptions, though I don&#x27;t believe mine is that &quot;severe&quot;? (I&#x27;ve talked to doctors and they just dismiss me as usual.) Generally, I am much happier than I used to be and things are really not that bad, but I think many of these low-lying symptoms are starting to take a toll. I really don&#x27;t want to take any kind of medication for fear of side-effects and because I, again, don&#x27;t think my case is that bad to require medication. I would much rather try more holistic approaches etc. That said, all suggestions and advice etc are welcome! And feel free to ask me anything and I&#x27;ll try my best to answer during the little bit of time that I have.<p>If you want more context: I&#x27;ve matured a lot mentally and am more self-aware than most people around me (though I have to admit my social skills are still well below average). I&#x27;ve gotten to know my own thought patterns and personality tendencies inside and out, and have developed them as well (eg I can often catch my own blindspots, at least in retrospect). I&#x27;ve grown significantly in many directions, both personally and in my relationships. I&#x27;ve dealt with at least some of my past traumas and am no longer tormented by them.<p>[0]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30951494\n[1]: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ouZrZa5pLXk",
      "time": 1649384525,
      "title": "Ask HN: What can I do about my messy/neurodivergent brain?",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30952630,
      "score": 1,
      "time": 1649384363,
      "title": "Shock result in particle experiment could spark physics revolution",
      "type": "story",
      "url": "https://news.yahoo.com/shock-result-particle-experiment-could-182625179.html"
    }
  ]
}