{
  "stories": [
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31439385,
      "score": 1,
      "time": 1652990325,
      "title": "Ukraine planning for post-war nuclear power plants",
      "type": "story",
      "url": "https://www.world-nuclear-news.org/Articles/Ukraine-planning-for-post-war-nuclear-power-plants"
    },
    {
      "by": "kkoning",
      "descendants": 0,
      "id": 31439378,
      "score": 1,
      "text": "Like many of you, I suspect, my early professional development was heavily influenced by open source and free software.  The freedom as in both free speech and free beer was definitely preferable to always being at the mercy of rigid and opaque proprietary software controlled by a profit-maximizing firm.  It was even worse when there was no real competition (e.g., 90s Microsoft).<p>However, after I left tech and went to graduate school (law, economics, and antitrust, roughly...), I&#x27;ve found my perspective has changed quite a bit--to the point that RMS came to give a guest lecture and I&#x27;d cringe a little... OK, a lot.  The thing is, his central critique still isn&#x27;t wrong--proprietary software does constrain people to advance the interests of its owner.  It&#x27;s just that his views on free software are... sufficiently myopic that they&#x27;re ultimately self-defeating.<p>The thing is, free software CAN work, economically, but it only works well where there&#x27;s some cross-subsidy.  There could be an adjacent market for professional services, huge corporate users that don&#x27;t want to be beholden to a single external supplier, developers working cooperatively on their own tools, academics working towards publications, etc...  Open source works great for Linux, Apache, Python, Postgres, etc..., and is preferable if and when it does.<p>But it doesn&#x27;t seem to work as well outside of these situations--where there aren&#x27;t strong cross-subsidies.  For example, most people prefer to pay for Photoshop and QuickBooks, even though GIMP and GnuCash are free.  The developers of those systems are probably great people sacrificing their own time and energy to contribute something to the world--it&#x27;s just that there&#x27;s only so much you can do when you have very limited resources.<p>The consequence, I think, it that free software can&#x27;t really be successful outside of its cross-subsidized niches.  And that&#x27;s not a great situation, because the alternative in those cases seems to be fully proprietary software.<p>So... that got me thinking about some hybrid between the fully proprietary software model and the fully open source software model.  Could there be an economic model for creating software that maximizes the interests of its users (as opposed to having a fiduciary duty to maximize shareholder value) but isn&#x27;t starved for resources by the strict open-source requirement that its price must be zero?<p>The obvious answer would seem to be some form of non-profit organization, and an extremely permissive (but not completely open source) license, but I can&#x27;t think of any examples.  E.g., a license that says things like &quot;here&#x27;s the source, you can publish modifications for other paid users&quot; or &quot;this license reverts to MIT after 10 years&quot;, etc...  A non-profit that sets the license price sufficient to pay developers, but not to line the pockets of management and shareholders?  Sure, there are plenty of open-source projects with attached foundations, but being open source means their only economic support comes from either cross-subsidies (see above) or charity, and not the one that makes the most sense in market economies--license fees.<p>I can&#x27;t be the first person to have thought along these lines, but I&#x27;m having a hard time finding anything to read on the subject. There&#x27;s the &quot;open source&quot; vs. &quot;free software&quot; debate, of course, but neither camp seems to favor licenses requiring payment for use.  What say you, HN?  Is there a whole literature on this and I just missed it somehow?  Is it just such a dumb idea that nobody talks about it?  Is it somehow more novel than I assume?",
      "time": 1652990304,
      "title": "Ask HN: Cooperative or Non-Profit Software Development vs. Open Source",
      "type": "story"
    },
    {
      "by": "epberry",
      "descendants": 0,
      "id": 31439375,
      "score": 1,
      "time": 1652990288,
      "title": "Terraform Cloud Run Tasks GA",
      "type": "story",
      "url": "https://www.hashicorp.com/blog/terraform-cloud-run-tasks-are-now-generally-available"
    },
    {
      "by": "Sincere",
      "descendants": 0,
      "id": 31439373,
      "score": 1,
      "time": 1652990278,
      "title": "Ask HN: Advice for a software engineer intern at a big Silicon Valley company?",
      "type": "story"
    },
    {
      "by": "boredemployee",
      "descendants": 0,
      "id": 31439367,
      "score": 1,
      "text": "In the last 4 years, I have had at least five times a problem where my heart had an irregular beat followed by a drop in blood pressure (not sure if because of a panic attack or a real heart problem).<p>I decided to look for a cardiologist, who asked me for several tests (doppler echocardiogram, electrocardiogram, exercise stress test, blood tests, holter test, etc.).<p>I&#x27;m still waiting for the holter test result, but all the others are within the normal range.\nLooking at what might have caused this, one thing I remember that happened in common in all these episodes was, perhaps, I took too much coffee (6+ cups).<p>I read that some people are more sensitive to coffee than others, so my question is:\nDoes that make any sense? Has anyone else here had a similar experience?",
      "time": 1652990237,
      "title": "Ask HN: Coffee drinkers, did you have any heart problem associated to coffee?",
      "type": "story"
    },
    {
      "by": "themikesanto",
      "descendants": 0,
      "id": 31439352,
      "score": 1,
      "time": 1652990199,
      "title": "When the virtual city of Cybertown went dark, its citizens rebuilt it",
      "type": "story",
      "url": "https://www.theverge.com/23032658/cybertown-revival-blaxxun-virtual-community-rebuilding-project"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 31439336,
      "score": 1,
      "time": 1652990099,
      "title": "Host a Ghost Blog for Free on Fly.io – In 1 Minute",
      "type": "story",
      "url": "https://www.autodidacts.io/host-a-ghost-blog-free-on-fly-io/"
    },
    {
      "by": "defenestration",
      "descendants": 0,
      "id": 31439311,
      "score": 1,
      "time": 1652989976,
      "title": "Google splits Web and App Activity to Workspace search history",
      "type": "story",
      "url": "https://9to5google.com/2022/05/19/google-workspace-search-history/"
    },
    {
      "by": "CrazedGeek",
      "descendants": 0,
      "id": 31439276,
      "score": 1,
      "time": 1652989777,
      "title": "The proof: six Eurovision juries cheated and voted for each other",
      "type": "story",
      "url": "https://eurovisionworld.com/esc/here-is-the-proof-of-the-eurovision-voting-scandal-six-juries-cheated-and-voted-for-each-other"
    },
    {
      "by": "jcastro",
      "descendants": 0,
      "id": 31439266,
      "score": 1,
      "time": 1652989746,
      "title": "Continuous Verification of the Ostree Content",
      "type": "story",
      "url": "https://github.com/alexlarsson/ostreefs"
    }
  ]
}