{
  "stories": [
    {
      "by": "kahon65",
      "descendants": 0,
      "id": 28709808,
      "score": 1,
      "text": "Hi all, Hi, dear 2021 folks.<p>You know what?\nI actually find that 2021 front-end development has a problem of productivity.<p>A. Big. F*<i>ing. Sh*ty. Problem of productivity.<p>Read below, my dudes.<p>Front-end development is better than back-end to making deadlines fly away like gulls. ;-)\n-&gt; Front-end choose their techs by thinking about speeds. But not the good ones. i. Speed of frontend execution at client-side. ii. Speed of transfer of the frontend from the server to the client. iii. Even speed of execution of the frontend... backside (NextJS).\n-&gt; BUT F*</i> MY GUYS. YOU KNOW THE F*<i>ING WHAT? Nowadays, Internet taken as a whole is so fast, servers are so fast, clients are so fast, all is so fast that looking for fast front-end fetching queries to the server and&#x2F;or for execution gains of the frontend is shallow, overengineering, USELESS. So why are you thinking about those speeds again and again and again. You would have better to throw your watermelon to the trash.<p>What would be welcome and ACTUALLY USEFUL?\nI answer you in two words, 7 letters ;-).\nFAST. DEV.\nFAST DEVELOPMENT, fucking JESUS.\n(Well the whole list would be: fast dev + super UX-design).\nThe other speeds? Don&#x27;t care. Blablabla. Don&#x27;t. F*</i>ing. Care.<p>Trust me. Trust the speed of dev. It&#x27;s the FUTURE.<p>1. What would be very useful: a kind of WYSIWYG to create responsive and UX-designed GUI for webapps and websites. You would be able to bind your WYSIWYG widgets to some logic (NodeJS Nest.JS or PHP Laravel) and both frontend and logic would be bound to some model (Strapi). You would choose the good techs in order to maximize speed of development. Should this WYSIWYG tech be open-source, proprietary, self-hosted, cloud-hosted, should it output dependent webapp&#x2F;websites or actual, i.e. self-sufficiently executing webapp&#x2F;websites, should this WYSIWYG be subject to versioning, all of these questions = I have my own opinion but yeah;<p>2. What would be useful if this tech doesn&#x27;t yet exist in 2021: a fast dev frontend framework (or more exactly I should rather say: a fast dev frontend widgets&amp;design library).<p>NOW MY GUYS. Read again bellow AND TRY IT.<p>1. Open HackerNews. Or Google. Type &quot;low code frontend&quot;, &quot;low-code frontend&quot;, &quot;lowcode front-end&quot; and whatever the syntax you want. What you will find are only 2 or 3 solutions. All except one cost the ass and are proprietary (not even open-source wtf). The last one, AppSmith, is for internal projects only (don&#x27;t allow us to do responsive designs&#x2F;widgets).<p>2. Open HackerNews....... Google.... Type &quot;frontend&quot; and read 10 first pages like I did. You will mostly find Next.JS + Ant design or Svelte. But are they really fast dev? Nooope my dude, nope nope nope, they just have a learning curve faster than React ;-).<p>You guys, I actually find that 2021 front-end development has a problem of productivity.<p>A. Big. F*<i>ing. Sh*ty. Problem of productivity.</i>",
      "time": 1633028025,
      "title": "Ask HN: F***ing 2021 Front-End Dev: How to dev faster?",
      "type": "story"
    },
    {
      "by": "HiroProtagonist",
      "descendants": 0,
      "id": 28709783,
      "score": 1,
      "time": 1633027957,
      "title": "Blue Origin is a ‘toxic’ workplace, some current and ex-workers claim in essay",
      "type": "story",
      "url": "https://www.cnbc.com/2021/09/30/jeff-bezos-blue-origin-essay-claims-toxic-workplace.html"
    },
    {
      "by": "freediver",
      "descendants": 0,
      "id": 28709781,
      "score": 1,
      "time": 1633027944,
      "title": "Our Social Dilemma by Aza Raskin [video]",
      "type": "story",
      "url": "https://vimeo.com/506396828"
    },
    {
      "by": "braum",
      "descendants": 0,
      "id": 28709778,
      "score": 1,
      "time": 1633027939,
      "title": "Stripe Atlas Misrepresenting She Leads Africa Founders",
      "type": "story",
      "url": "https://imgur.com/a/lw0Yhic"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28709746,
      "score": 1,
      "time": 1633027800,
      "title": "Samsung to make Tesla’s HW 4.0 self-driving auto chip",
      "type": "story",
      "url": "https://www.kedglobal.com/newsView/ked202109230009"
    },
    {
      "by": "Radim",
      "descendants": 0,
      "id": 28709694,
      "score": 1,
      "time": 1633027614,
      "title": "The unthinking application of this regex-efficiency check wasted our attention",
      "type": "story",
      "url": "https://github.com/RaRe-Technologies/gensim/issues/3240"
    },
    {
      "by": "1cvmask",
      "descendants": 1,
      "id": 28709673,
      "kids": [
        28709685
      ],
      "score": 1,
      "time": 1633027555,
      "title": "Apple now lets you share how much you love built-in apps via App Store reviews",
      "type": "story",
      "url": "https://9to5mac.com/2021/09/29/rate-and-review-apple-iphone-built-in-apps/"
    },
    {
      "by": "aj3",
      "descendants": 0,
      "id": 28709662,
      "score": 2,
      "time": 1633027495,
      "title": "NASA Says Blue Origin 'Gambled' Its Chance to Build a Lunar Lander Away",
      "type": "story",
      "url": "https://interestingengineering.com/nasa-says-blue-origin-gambled-its-chance-to-build-a-lunar-lander-away"
    },
    {
      "by": "yahyatur",
      "descendants": 0,
      "id": 28709656,
      "score": 1,
      "time": 1633027477,
      "title": "Show HN:The easiest way to create courses for marketing",
      "type": "story",
      "url": "https://minicoursegenerator.com/"
    },
    {
      "by": "joveian",
      "descendants": 0,
      "id": 28709647,
      "score": 3,
      "time": 1633027424,
      "title": "Low oxygen levels along Pacific Northwest coast a ‘silent’ climate change crisis",
      "type": "story",
      "url": "https://www.oregonlive.com/environment/2021/09/low-oxygen-levels-along-pacific-northwest-coast-a-silent-climate-change-crisis.html"
    }
  ]
}