{
  "stories": [
    {
      "by": "EnlightenedBro",
      "descendants": 0,
      "id": 30375259,
      "score": 1,
      "time": 1645116490,
      "title": "aws-auth",
      "type": "story",
      "url": "https://aws-auth.js.org/"
    },
    {
      "by": "fengjiabo2400",
      "descendants": 0,
      "id": 30375206,
      "score": 2,
      "text": "Hi HN, I’m Kai from 1Flow (<a href=\"https:&#x2F;&#x2F;1flow.app\" rel=\"nofollow\">https:&#x2F;&#x2F;1flow.app</a>). 1Flow is an easy way to create in-app surveys for web &#x2F; mobile apps.<p>It’s really hard to get reliable feedback from users. We solve that problem. Our surveys have a 50-70% response rate on average, compared to 5-10% for traditional surveys.<p>I studied product design at college and then joined a mobile gaming company. It was painful to see how far removed product teams are from their users in the real world. We didn’t talk to users directly, as my design program had taught me. Instead, we relied on monthly reports from customer support and made top down decisions on what to build.<p>Then I started a mobile app company of my own and also experienced this problem—it is actually very hard to reach users and hear their thoughts. We didn’t have a good way of contacting them, or often even know who was downloading our app. And when we did manage to contact them, they wouldn’t respond. I tried showing a pop-up in my app that led users to a Google form. I was surprised &#x2F; frustrated when after 2 weeks of waiting, I received zero responses.<p>But then when I was doing ASO (aka SEO for the App Store), I got a lot of users to write me good reviews after I had implemented a bottom-drawer UI that asked them to please leave a review if they liked us. This UI was only a half-page in size, showing from the bottom edge of the screen (close to the thumb) and the rest of the screen was only darkened, not fully blocked. This worked like a charm! I was able to get consistent reviews from my users on a daily basis (when before I was getting 1-2 reviews per month).<p>I connected the dots and realized, what if I could do user surveys effectively by giving people a user experience that they actually like? And went to work.<p>1Flow embeds a JS code snippet in websites &#x2F; web apps, and a native mobile library in mobile apps. After this initial 5min setup, anyone—technical or not—can use our cloud dashboard to create and launch new in-app surveys that ask users about feedback, satisfaction, and opinions. No app updates or code changes are required beyond the initial installation.<p>Our in-app surveys can easily be designed to match the branding of the client application, so app makers can engage users for feedback in key moments of the user flow without compromising their user experience. Results from the surveys are available on our dashboard in real-time. We also have filters that allow app makers to view results by cohorts, location, and answers to a particular question.<p>We provide webhooks and csv download for teams to easily feed data into other tools they are using (Amplitude, Slack, GA, Intercom, Hubspot) - so they have a single source of truth for qualitative and quantitative data.<p>I&#x27;ve met developers who desperately needed a solution like this, went into code and hacked together a question flow inside of their apps. But then they are stuck with this hardcoded questionnaire in their code base. Every time they need to update it they need to spend engineering hours to go inside the code and update it, then for mobile apps they&#x27;ll have to submit the new version to the App Store &#x2F; Play Store and wait until the updates are approved. Also, it gets complicated to target certain users only (e.g. users in France who completed 3 transactions recently) and automatically stop collecting responses, e.g. after 500 people have given their answers. Visualizing the data and filtering&#x2F;slicing it is also really hard if you don&#x27;t have a dedicated tool.<p>There are other embeddable survey tools, but we’re different in three ways. First, most of these tools have poor UI&#x2F;UX, so much that it&#x27;s painful for developers to put them inside their beautifully crafted apps. Second, they tend to offer static forms that can&#x27;t be used to target certain users based on their app behaviors, and can&#x27;t be used to enrich your CRM &#x2F; analytics easily. They are also a pain to manage. Third, the newer solutions that sort of solve these problems are focused on enterprise customers, not startups. They have extra features that many developers don’t want (such as video calling your users), and non-transparent pricing that imposes limits on surveys &#x2F; seats. 1Flow solves all of this.<p>We are currently open to the public as self-serve mode. Anyone can visit <a href=\"https:&#x2F;&#x2F;1flow.app\" rel=\"nofollow\">https:&#x2F;&#x2F;1flow.app</a> and create a free account to start using it. We use Intercom to engage with users if they have any questions while using us, but you can also ping me in the comments here.<p>We’d love to hear about your experiences and ideas on collecting better feedback. If you’ve done any cool hacks that got great results, we’d love to hear that too!",
      "time": 1645116335,
      "title": "Launch HN: 1Flow (YC W22) – In-product user feedback for web/mobile apps",
      "type": "story",
      "url": "https://1flow.app"
    },
    {
      "by": "akbarnama",
      "descendants": 0,
      "id": 30375204,
      "score": 1,
      "time": 1645116329,
      "title": "In World Sport, the Hijab Stands for Welcome",
      "type": "story",
      "url": "https://mojostory.com/pov/in-sports-hijab-stands-for-welcome/"
    },
    {
      "by": "brightball",
      "descendants": 0,
      "id": 30375194,
      "score": 1,
      "text": "I’ve been reading a lot of pen testing stories lately and it got me wondering if Framework would be the ideal design? Customizeable for the job, small form factor, etc. Seemed like an ideal use case.",
      "time": 1645116297,
      "title": "Ask HN: Would the Framework laptop be ideal for pen testing?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30375178,
      "score": 1,
      "time": 1645116218,
      "title": "Finding One's Own in Cyberspace (1996) [pdf]",
      "type": "story",
      "url": "https://faculty.cc.gatech.edu/~asb/papers/trade/tr-finding-ones-own.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30375173,
      "score": 1,
      "time": 1645116208,
      "title": "USDA Pomological Watercolor Collection",
      "type": "story",
      "url": "https://naldc.nal.usda.gov/usda_pomological_watercolor"
    },
    {
      "by": "elcomet",
      "descendants": 1,
      "id": 30375162,
      "kids": [
        30375185
      ],
      "score": 5,
      "time": 1645116156,
      "title": "Twitter Is Down",
      "type": "story",
      "url": "https://downdetector.fr/statut/twitter/"
    },
    {
      "by": "rebeccaskinner",
      "descendants": 0,
      "id": 30375152,
      "score": 2,
      "time": 1645116111,
      "title": "The Unreasonable Effectiveness of Haskell",
      "type": "story",
      "url": "https://medium.com/pragmatic-programmers/the-unreasonable-effectiveness-of-haskell-48d92c2fe266"
    },
    {
      "by": "josephcsible",
      "descendants": 1,
      "id": 30375139,
      "kids": [
        30375157
      ],
      "score": 1,
      "time": 1645116072,
      "title": "New Dymo LabelWriter printers force you to use Dymo Labels",
      "type": "story",
      "url": "https://old.reddit.com/r/assholedesign/comments/qpiotb/new_dymo_labelwriter_printers_force_you_to_use/"
    },
    {
      "by": "blakedouglas",
      "descendants": 0,
      "id": 30375126,
      "score": 1,
      "time": 1645116027,
      "title": "New Brands Spotted 2/17/22",
      "type": "story",
      "url": "https://thingtesting.com/stories/new-brands-spotted-2-17-2022"
    }
  ]
}