{
  "stories": [
    {
      "by": "tomsonj",
      "descendants": 0,
      "id": 30096116,
      "score": 1,
      "time": 1643256846,
      "title": "A Clockwork Rover for Venus",
      "type": "story",
      "url": "https://www.nasa.gov/feature/jpl/a-clockwork-rover-for-venus/"
    },
    {
      "by": "nhumrich",
      "descendants": 0,
      "id": 30096114,
      "score": 1,
      "time": 1643256841,
      "title": "Python Soon to Support WebAssembly",
      "type": "story",
      "url": "https://twitter.com/treyhunner/status/1486505965402787843"
    },
    {
      "by": "rjp293",
      "descendants": 0,
      "id": 30096110,
      "score": 1,
      "text": "I seem to have enough skill to make it to a on-site, and even had some spectacular interviews performances by using some esoteric data structures: Trie and Union Find. Still, I will have one mediocre interview where I look mediocre or just bad that renders the other 5 interviews useless. It’s like I have to look like a 10x developer for 5 interviews in a row while my interviewer looks for a tiny reason to disqualify me. The company recruiter will say the interviewer is looking to see how I think, but often interviewers will fail me for the code not compiling that I wrote on a white board. I had interviews where I write the best solution, and the interviewer will fail me because I missed a opportunity to optimize the algorithm for a edge case. I have seen interviewers add extra requirements to try and trick me at the end of a long on-site. I understand why big companies try not to give feedback because the reasons that interviewers fail candidates sound so absurd that one can only imagine if being same race&#x2F;gender as the interviewer would have change the outcome. Does anyone find the current interviewing landscape ridiculous? After someone spends the sufficient amount of time on leetcode, is it just a lottery for programmers who are not competitive programming. I have read or used the CLR, Cracking the Coding interview, leetcode, interview.io, pramp, 1 on 1 coaching from Google engineers. Do I have to devote my free time to competitive coding competitions over side projects. What does it take to pass on site at a name brand tech company?",
      "time": 1643256810,
      "title": "Ask HN: Is it unusual to consistently fail on sites interviews for years",
      "type": "story"
    },
    {
      "by": "Swathyk",
      "descendants": 0,
      "id": 30096097,
      "score": 1,
      "time": 1643256658,
      "title": "Show HN: Static IP for Serverless Apps",
      "type": "story",
      "url": "https://serverlessip.com"
    },
    {
      "by": "jevoten",
      "descendants": 0,
      "id": 30096093,
      "score": 1,
      "time": 1643256654,
      "title": "By 2050, 1/4 of the world’s people will be African – this will shape our future",
      "type": "story",
      "url": "https://www.theguardian.com/global-development/2022/jan/20/by-2050-a-quarter-of-the-worlds-people-will-be-african-this-will-shape-our-future"
    },
    {
      "by": "justinzollars",
      "descendants": 0,
      "id": 30096046,
      "score": 1,
      "time": 1643256139,
      "title": "Peter Robbins, original voice of Peanuts' Charlie Brown character, dies at 65",
      "type": "story",
      "url": "https://news.yahoo.com/peter-robbins-original-voice-peanuts-192149551.html"
    },
    {
      "by": "mindcrime",
      "descendants": 0,
      "id": 30096011,
      "kids": [
        30096045
      ],
      "score": 1,
      "time": 1643255761,
      "title": "DNA Doe Project: an initiative that uses genetics to identify John and Jane Does",
      "type": "story",
      "url": "https://dnadoeproject.org/"
    },
    {
      "by": "mark_mcnally_je",
      "descendants": 1,
      "id": 30096010,
      "kids": [
        30096049
      ],
      "score": 1,
      "time": 1643255758,
      "title": "Show HN: I made a simple flag guessing game",
      "type": "story",
      "url": "https://peepopoll.com/flags.html"
    },
    {
      "by": "throw0101a",
      "descendants": 0,
      "id": 30096007,
      "score": 1,
      "time": 1643255740,
      "title": "What is the quantum apocalypse and should we be scared?",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-60144498"
    },
    {
      "by": "timetosleep",
      "descendants": 0,
      "id": 30096005,
      "score": 1,
      "text": "I always tend to listen to lot of music&#x2F;watch videos while working, wondering if it&#x27;s a common thing! Most of my colleagues and co-workers usually frown upon that. Wondering if anyone doing something had any issues with that?<p>Thanks for your time and advice!",
      "time": 1643255733,
      "title": "Ask HN: Do you listen to music/watch videos while working?",
      "type": "story"
    }
  ]
}