{
  "stories": [
    {
      "by": "meemoo",
      "descendants": 0,
      "id": 27882375,
      "score": 1,
      "time": 1626701038,
      "title": "Cuttle.xyz – Parametric design tool for digital cutting machines",
      "type": "story",
      "url": "https://cuttle.xyz/"
    },
    {
      "by": "jimmy2020",
      "descendants": 0,
      "id": 27882372,
      "score": 1,
      "time": 1626701024,
      "title": "CNN is hiring hundreds of people for a subscription streaming service",
      "type": "story",
      "url": "https://edition.cnn.com/2021/07/19/media/cnn-plus-launch/index.html"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 27882362,
      "score": 1,
      "time": 1626700969,
      "title": "U.S. vs. Microsoft: Court's Findings of Fact (1999)",
      "type": "story",
      "url": "https://www.justice.gov/atr/us-v-microsoft-courts-findings-fact"
    },
    {
      "by": "alach11",
      "descendants": 1,
      "id": 27882355,
      "kids": [
        27882358
      ],
      "score": 1,
      "time": 1626700929,
      "title": "Show HN: Should I Get a House? (a better rent vs. buy calculator)",
      "type": "story",
      "url": "https://shouldigetahouse.com/"
    },
    {
      "by": "brennanm",
      "descendants": 1,
      "id": 27882350,
      "kids": [
        27882376
      ],
      "score": 2,
      "text": "Hi HN, we’re Brennan and Graham founders of Hypercontext (<a href=\"https:&#x2F;&#x2F;hypercontext.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hypercontext.com</a>). We make an app that helps managers run their 1:1 &amp; team meetings with action items, feedback, and OKRs(Goals) in one workflow.<p>Most managers get promoted into their role with no training. “Oh you’re a good engineer? Great! Now manage a team of engineers and stop coding”. They’re largely leading with trial-and-error tactics. The good ones are reflective and learn, and many eventually read books on best practices and frameworks that can help them. Our insight is that it’s possible to build some of these good  frameworks into a workflow so every manager can get them by default, similarly to how a good software framework lets you not have to hand-roll all the boilerplate code, so you can focus on the business logic. We think it’s time managers stop winging it (worst case) or hand rolling their management frameworks (best case) in Google Docs and Moleskin notebooks and start importing frameworks that solve the basics for them.<p>Previously, Graham and I have been co-founders for 10 years together. Our last startup grew to ~40 employees. When we became full-time managers we were shocked at the lack of tooling that existed for general management work. This was where the idea for Hypercontext came from. We started building tools and systems to help us fill the gaps(mainly in google sheets&#x2F;docs&#x2F;forms). We shared them with friends and they were loved.<p>Personally, I stumbled through management in my first startup. I didn’t talk about goals. I didn’t share candid feedback. I wasn’t clear or consistent. I thought I knew how to do other people’s jobs. I learned the hard way every single time. And so did all of my peers. The only way to save a fellow manager from that pain was by sharing tips 1:1 or recommending books. We thought there must be a better way.<p>Hypercontext starts before the meeting: connecting to your existing meetings and helping you and your team build a collaborative agenda and show up prepared.<p>During the meeting, often overlayed on a google meet: we help you take notes and action items, and email them out automatically for you.<p>After: ML runs over your notes and generates insights about management blindspots. We then suggest questions&#x2F;conversation starters for your next meeting to help to resolve them.<p>Finally, we’ve built a powerful goaling tool, complete with the largest library of goal&#x2F;okr examples on the internet (free here, broken up by role: <a href=\"https:&#x2F;&#x2F;hypercontext.com&#x2F;goal-examples\" rel=\"nofollow\">https:&#x2F;&#x2F;hypercontext.com&#x2F;goal-examples</a>), that helps you collaborate, document, and discuss long term goals every meeting before the urgent agenda topic.<p>Founders, CEOs, execs use our app all week to manage their job -- mainly through their 1:1 and team meetings. We’re specifically helpful for folks who are doing a lot of context switching throughout their day and need to offload the “remember to talk to people about this” part of their brain.",
      "time": 1626700891,
      "title": "Launch HN: Hypercontext (YC S21) – Meeting notes+actions+feedback+okrs, one app",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 27882343,
      "score": 1,
      "time": 1626700829,
      "title": "Microsoft Exchange email hack was caused by China, US says",
      "type": "story",
      "url": "https://apnews.com/article/microsoft-exchange-hack-biden-china-d533f5361cbc3374fdea58d3fb059f35"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 27882320,
      "score": 1,
      "time": 1626700645,
      "title": "What Is OpenSLO?",
      "type": "story",
      "url": "https://openslo.com/"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 27882303,
      "score": 1,
      "time": 1626700555,
      "title": "Ocado shares plunge as it cancels orders after robot fire",
      "type": "story",
      "url": "https://www.theguardian.com/business/2021/jul/19/ocado-shares-cancels-orders-robot-fire-cancellations"
    },
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 27882284,
      "score": 1,
      "time": 1626700459,
      "title": "Quick Morning Rant: China vs America",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=HryiadpkssQ"
    },
    {
      "by": "notoriousarun",
      "descendants": 0,
      "id": 27882272,
      "score": 1,
      "time": 1626700385,
      "title": "I Miss Rails",
      "type": "story",
      "url": "https://chanind.github.io/rails/2019/03/28/why-i-miss-rails.html"
    }
  ]
}