{
  "stories": [
    {
      "by": "abbbi",
      "descendants": 0,
      "id": 31923942,
      "score": 1,
      "time": 1656527288,
      "title": "Backup and (instant)recover libvirt/QEMU domains using virtnbdbackup",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=dOE0iB-CEGM"
    },
    {
      "by": "gnicholas",
      "descendants": 0,
      "id": 31923938,
      "score": 1,
      "text": "Whenever I click a link on my computer (e.g, from email or Messages), it opens by default in my browser of choice, but never in an Incognito window.<p>Nearly 100% of the time, I want it to open in Incognito, which I use whenever I&#x27;m visiting a site that I don&#x27;t need to be logged into. My current workaround is to right-click the link, copy link, switch to my browser, open a new Incognito window, paste in the link and hit return. While this doesn&#x27;t seem like that big a deal, it&#x27;s actually a lot of clicks (11 key presses) — compared to just one click to open a link normally. Additionally, it puts the pasted link into my pasteboard manager, which is unnecessary and annoying when I go to retrieve a snippet that is now further down in the stack.<p>What&#x27;s the best way to handle this? I&#x27;ve considered switching my default browser to a different browser that completely blocks cookies and forgets history all the time, but it seems like there should be a better solution.",
      "time": 1656527260,
      "title": "Ask HN: How can I make links open in Incognito by default?",
      "type": "story"
    },
    {
      "by": "grogu88",
      "descendants": 0,
      "id": 31923937,
      "score": 1,
      "time": 1656527259,
      "title": "Chinese spacecraft acquires images of entire planet of Mars",
      "type": "story",
      "url": "https://www.reuters.com/world/china/chinese-spacecraft-acquires-images-entire-planet-mars-2022-06-29/"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 31923936,
      "score": 1,
      "time": 1656527259,
      "title": "NCERT Exemplar Problems (For In-Depth Learning) with Solved Examples and Answers",
      "type": "story",
      "url": "https://ncert.nic.in/exemplar-problems.php?ln="
    },
    {
      "by": "assemblylang",
      "descendants": 0,
      "id": 31923920,
      "score": 1,
      "text": "Hello HN, who here doesn&#x27;t use a phone and what do you use as a replacement?<p>I&#x27;ve been using my phone less and less these days, and it feels like a chore to use a modern phone now. Touch interface is slow and imprecise, apps and webapps are slow, bloated, and keep removing useful features, adblock on some systems are clunky or non-existent, VoIP and SMS are basically dead, the interface changes nearly every year (on android at least), and many other small grievances. I can get things done so much quicker on a computer with a keyboard compared to the touch interface on a phone, using a keyboard and a full desktop environment is so precise, quick, and just enjoyable to use.<p>However, I am still hanging onto my phone for a few legacy uses, what are some good replacements for these:<p>* Mobile wifi\n* VoIP\n* SMS<p>Also, I am still interested in mobile computing as a concept, I&#x27;ve looked into the pinephone and that may be a good replacement for me in the future (keyboard attachment, linux apps), but am fine completely ditching mobile computing and just carrying around a small, light laptop if I can&#x27;t find an ergonomic mobile replacement.<p>Anyone ditch their phone, how do you get by without it?",
      "time": 1656527219,
      "title": "Ask HN: Who has ditched their phone and what is your replacement?",
      "type": "story"
    },
    {
      "by": "reckel",
      "descendants": 0,
      "id": 31923906,
      "score": 1,
      "time": 1656527126,
      "title": "Bringing the power of deep learning to data in tables",
      "type": "story",
      "url": "https://www.amazon.science/blog/bringing-the-power-of-deep-learning-to-data-in-tables"
    },
    {
      "by": "nabla9",
      "descendants": 0,
      "id": 31923890,
      "score": 1,
      "time": 1656527081,
      "title": "Monopsony in the US Labor Market",
      "type": "story",
      "url": "https://www.aeaweb.org/articles?id=10.1257/aer.20200025"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31923864,
      "score": 3,
      "time": 1656526913,
      "title": "Nvidia in the Hot Seat?",
      "type": "story",
      "url": "https://semianalysis.substack.com/p/nvidia-in-the-hot-seat"
    },
    {
      "by": "skitout",
      "descendants": 3,
      "id": 31923836,
      "kids": [
        31923925,
        31923914,
        31923924
      ],
      "score": 3,
      "time": 1656526767,
      "title": "Bitcoin is more energy efficient than the classical system",
      "type": "story",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4125499027017110008069100123095&EXT=pdf&INDEX=TRUE"
    },
    {
      "by": "allenleein",
      "descendants": 0,
      "id": 31923812,
      "score": 1,
      "time": 1656526647,
      "title": "How to Choose a Digital Notes App as Your Second Brain",
      "type": "story",
      "url": "https://fortelabs.co/blog/the-4-notetaking-styles-how-to-choose-a-digital-notes-app-as-your-second-brain/"
    }
  ]
}