{
  "stories": [
    {
      "by": "podiki",
      "descendants": 0,
      "id": 29327424,
      "score": 1,
      "time": 1637735476,
      "title": "Tree Sitter and the Complications of Parsing Languages",
      "type": "story",
      "url": "https://www.masteringemacs.org/article/tree-sitter-complications-of-parsing-languages"
    },
    {
      "by": "pcr910303",
      "descendants": 1,
      "id": 29327349,
      "kids": [
        29327441
      ],
      "score": 1,
      "time": 1637734408,
      "title": "The unexpected return of JavaScript for Automation",
      "type": "story",
      "url": "https://scriptingosx.com/2021/11/the-unexpected-return-of-javascript-for-automation/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29327322,
      "score": 1,
      "time": 1637733914,
      "title": "Golden Age of Detective Fiction",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Golden_Age_of_Detective_Fiction"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 29327301,
      "score": 2,
      "time": 1637733529,
      "title": "The Oxide Rack Switch",
      "type": "story",
      "url": "https://twitter.com/arjenroodselaar/status/1463370051679973377"
    },
    {
      "by": "techsin101",
      "descendants": 5,
      "id": 29327288,
      "kids": [
        29327418,
        29327344,
        29327391,
        29327371,
        29327445,
        29327431
      ],
      "score": 13,
      "text": "I&#x27;ve been watching lot of videos of shoplifting in California, and I do think it&#x27;s due to recent laws, but it&#x27;s more of a case of good intentions and bad outcomes. However, similarly where I lived before the laws didn&#x27;t matter because when you called police they came an hour late if ever, and if they did come they&#x27;d find something wrong with your business and leave only if you paid bribe. So you were better off NOT calling cops. Unless they were already happen to be passing through and saw robbery in action.<p>But over time norms had developed that prevented robberies....<p>1. Don&#x27;t have aisle system. A typical shop would have cashiers standing and when you reached to cashier, you&#x27;d tell them what you want and guys in back would start to pack your order. Then meanwhile you are screaming items you want, or asking to see alternatives, cashier would handle other customers behind you. Once your order is ready, the back guy would bring it to cashier who would call out your name and you can come to front. (Don&#x27;t be shy or care about personal space, probably be improved with apps&#x2F;internet)... no shop lifting if there is nothing to lift and you can&#x27;t enter a shop.<p>2. When there is lawlessness and incentive then criminals consolidate into gangs, and then gangs into the gang. Simply pay the biggest gang in your area. Once you are a paying member of their territory, none of their members will ever hurt you and other gangs will not dare hurt their customers. This &quot;protection&quot; feel is not always optional. You either pay or incidents keep happening. But once you pay, they stop.<p>3. Retailers that sell expensive stuff consolidate into areas, which they all pay to make security top notch. Imagine jewelry stores with diamonds and gold, all decide to be located next to each other in a single street. This whole street has probably 50 armed guards, cameras, road blockers, and no one passing through who doesn&#x27;t work there or trying to buy something. Amazing display of weird relationship, where you are competing with all of your neighbors but also benefiting from their existence. Or even if not armed, if someone shouts thieves, all merchants come out to beat the thief. Thief doesn&#x27;t shoot because too many people to matter and will probably be killed brutally, vs just getting beat up and handed over to cops. (laws need to allow this, not like walgreens getting sued because their security guard tried to stop a shoplifter...)<p>Or don&#x27;t pass stupid laws",
      "time": 1637733386,
      "title": "Tell HN: Ideas from a developing country to curb shoplifting in Bay Area",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29327281,
      "score": 3,
      "time": 1637733225,
      "title": "In Kashmir the critical articles' digital archives on India's gov are vanishing",
      "type": "story",
      "url": "https://www.codastory.com/disinformation/kashmir-vanishing-newspaper/"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 29327240,
      "score": 3,
      "time": 1637732601,
      "title": "I wish systemd logged information about the source of “transactions”",
      "type": "story",
      "url": "https://utcc.utoronto.ca/~cks/space/blog/linux/SystemdTransactionSourceWish"
    },
    {
      "by": "gabea",
      "descendants": 0,
      "id": 29327234,
      "score": 2,
      "time": 1637732567,
      "title": "NASA's Going to Shove an Asteroid",
      "type": "story",
      "url": "https://www.npr.org/2021/11/22/1056995884/in-a-first-test-of-its-planetary-defense-efforts-nasas-going-to-shove-an-asteroi"
    },
    {
      "by": "rainaajeet",
      "descendants": 0,
      "id": 29327204,
      "score": 1,
      "time": 1637732178,
      "title": "Redis Enterprise Observability with Datadog",
      "type": "story",
      "url": "https://developer.redis.com/explore/datadog/"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 29327191,
      "score": 2,
      "time": 1637731978,
      "title": "How to implement and use .noinit RAM",
      "type": "story",
      "url": "https://interrupt.memfault.com/blog/noinit-memory"
    }
  ]
}