{
  "stories": [
    {
      "by": "amesdemarbre",
      "descendants": 0,
      "id": 31834062,
      "score": 1,
      "time": 1655893344,
      "title": "Elon Musk's Starlink granted Guernsey licence",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-guernsey-61894328"
    },
    {
      "by": "itaygabb",
      "descendants": 0,
      "id": 31834049,
      "score": 1,
      "time": 1655893284,
      "title": "Wordalle – Guess the prompt used to generate a set of images from DalleMini",
      "type": "story",
      "url": "https://huggingface.co/spaces/huggingface-projects/wordalle"
    },
    {
      "by": "revorad",
      "descendants": 0,
      "id": 31833987,
      "score": 2,
      "time": 1655892770,
      "title": "Servant",
      "type": "story",
      "url": "https://jdnoc.com/servant/"
    },
    {
      "by": "parth79",
      "descendants": 1,
      "id": 31833983,
      "kids": [
        31833984
      ],
      "score": 1,
      "time": 1655892760,
      "title": "A concept polling app that feeds the poor",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=HxJ-xoHEoBk"
    },
    {
      "by": "thinkingemote",
      "descendants": 0,
      "id": 31833956,
      "score": 2,
      "time": 1655892561,
      "title": "California Is Poised to Ban Prostitution-Related Loitering Arrests",
      "type": "story",
      "url": "https://www.lamag.com/citythinkblog/california-is-poised-to-ban-prostitution-related-loitering-arrests/"
    },
    {
      "by": "nonrandomstring",
      "descendants": 0,
      "id": 31833915,
      "score": 4,
      "text": "Accessibility and availability should be important for public\nservices.<p>As a regular sea swimmer I read this HN submission with interest [1]\nand after a deep dig into the document and links I decided to take\nsome action. Some nasty rip currents have appeared at my local beach,\npopular with tourists with children. Due to reduced maintenance, sand\nbars have built up during the past two pandemic years which people\nseem unaware of. There are no waring signs.<p>So I decided to contact my local council.<p>I compiled some detailed information with the GPS coordinates of\ndanger spots and a simple explanation to suggest temporary warning\nsigns this summer.  Each week they send me a local news letter, so I\ndecided to reply to that with my concerns.<p>&quot;This is a no reply address and is not monitored&quot;<p>Fair enough? Not really. In my opinion that&#x27;s just bloody rude and\nlazy. But nevertheless, on to their web page...<p>They have a &quot;Beach Safety&quot; page. Hoorah. But without JavaScript their\npages render almost nothing. Okay, so this is important, time to put\nmy own cybersecurity at risk for the greater good and switch on\nscripts.  Still, the page will not load due to external fonts\netc. Okay, time to throw my own privacy and dignity to the wind and\nunblock all the tracking crap. There is a web link but it is obscured\nby some bad style sheets that makes it disappear under another element.<p>I give up. Instead I will raise my concerns with the lifeguards, who\nare probably aware but don&#x27;t have temporary signs to put up.<p>Visiting the RNLI site I am immediately thrown out.<p><pre><code>   &quot;Access denied Error code 1020\n    You do not have access to rnli.org.\n    ...\n    Performance &amp; security by Cloudflare&quot;\n</code></pre>\nHey thanks Cloudflare for helping save lives.<p>Let&#x27;s disable all privacy and security settings, change my web proxy,\nand try again.<p>Beneath the stock images of smiling staff I eventually find a well\nburied web form that wants, my name, location, daytime telephone,\nmobile telephone...<p>How very dare you! I am going out of my way, spending my own time to\nhelp others, and you want to data-rape me as our first encounter. I\ncould fill it out with stubs and false info, but then risk some\nregular-expression dropping my important message. And besides, why\nshould I feel forced to act like a criminal while attempting to help\nothers?<p>I give up on that line.<p>Not defeated, I look up their phone number in the plain old phone\nbook.  I call and speak to someone who takes my concerns seriously and\nwe manually note the locations of concern. She tells me all guards on\nthose beaches will be informed.<p>Lately I&#x27;ve spoken to people who cannot book doctors appointments or\nspeak to the police because they are deflected and re-routed to web\nservices that do not work.<p>Is the WWW finished as an informational format?<p>Is it being used as a way to dodge responsibility?<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31814221",
      "time": 1655892215,
      "title": "Ask HN: Is the Broken Web Costing Lives?",
      "type": "story"
    },
    {
      "by": "stevenjgarner",
      "descendants": 1,
      "id": 31833909,
      "kids": [
        31833952
      ],
      "score": 2,
      "time": 1655892176,
      "title": "Exposure to any light during sleep linked to obesity, serious health issues",
      "type": "story",
      "url": "https://www.cnn.com/2022/06/22/health/light-exposure-sleep-study-wellness/index.html"
    },
    {
      "by": "pplonski86",
      "descendants": 0,
      "id": 31833905,
      "score": 1,
      "time": 1655892128,
      "title": "Share Jupyter Notebook with non-programmers",
      "type": "story",
      "url": "https://mljar.com/blog/share-jupyter-notebook/"
    },
    {
      "by": "nickdrozd",
      "descendants": 0,
      "id": 31833904,
      "score": 1,
      "time": 1655892127,
      "title": "Latest Busy Beaver champion has too many digits to count",
      "type": "story",
      "url": "https://www.sligocki.com//2022/06/21/bb-6-2-t15.html"
    },
    {
      "by": "pplonski86",
      "descendants": 0,
      "id": 31833900,
      "score": 1,
      "time": 1655892099,
      "title": "Dashboard for Data Drift Detection in Python",
      "type": "story",
      "url": "https://mljar.com/blog/data-drift-detection-python/"
    }
  ]
}