{
  "stories": [
    null,
    {
      "by": "mmazzarolo",
      "descendants": 0,
      "id": 30359640,
      "score": 2,
      "time": 1645017985,
      "title": "Track down the JavaScript code responsible for polluting the global scope",
      "type": "story",
      "url": "https://mmazzarolo.com/blog/2022-02-16-track-down-the-javascript-code-responsible-for-polluting-the-global-scope/"
    },
    {
      "by": "FridayoLeary",
      "descendants": 0,
      "id": 30359637,
      "score": 1,
      "time": 1645017968,
      "title": "A walk through Project Zero metrics",
      "type": "story",
      "url": "https://googleprojectzero.blogspot.com/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30359630,
      "score": 1,
      "time": 1645017916,
      "title": "Russia is trying to build its own great firewall",
      "type": "story",
      "url": "https://www.economist.com/business/russia-is-trying-to-build-its-own-great-firewall/21807706"
    },
    {
      "by": "hardcorenobody",
      "descendants": 0,
      "id": 30359627,
      "score": 1,
      "text": "Long story short, I&#x27;m a junior taking CS, I hate it (sorry to everyone who loves it. Also, to clarify, my university isn&#x27;t very theoretical in its approach), and because of my circumstances it&#x27;s too late for me to switch majors.<p>I originally wanted to be a physicist, but I switched midway into my first year because CS has got more financial security, physics isn&#x27;t as glamorous as pop science would have you believe, academia might be a bad fit, etc etc, and I thought I&#x27;d like it. Hell, everyone thought I was in love with CS until I started complaining their ears off, because I SEEM like I&#x27;d like it. It&#x27;s to the point that it affects my work. I do submit my work on time unless life gets in the way, and I do pretty decently actually, but getting through the thick wall of &quot;fuck fuck fuck i signed up for this&quot; and boredom takes a lot of effort — more than I thought, and I don&#x27;t have any side projects because I&#x27;m not interested in anything. My resume would probably look like a big wall of entry-level skills because I&#x27;ve tried so many things hoping I&#x27;d find something bearable. Finding this tolerable would really be the best-case scenario for me, but it&#x27;s simply not happening. I wish I was having a bad time because I&#x27;m frustrated or burnt out, or I&#x27;m having a very very hard time, but I&#x27;m not. I just hate this.<p>My question is: do you know anyone who ended up with a non-coding job with a CS degree? If so, how did that work out for them? Also, were they able to get a job that didn&#x27;t glue them to a desk all the time?<p>Right now I&#x27;m only interested in my electronics, math, and 3d modelling&#x2F;animation (an elective) classes (which shouldn&#x27;t be surprising - I love physics), and I wonder if I should&#x27;ve gone with engineering instead, but it&#x27;s too late for that. I&#x27;m looking into embedded systems since it&#x27;s &quot;closer to the metal,&quot; I have some arduino parts lying around, and I do like C and assembly better than high-level languages, but if even that is too much software for me... I don&#x27;t know anymore. I like managing and organizing projects (&quot;Type A&quot; apparently), and they say I&#x27;m a decent talker, so I&#x27;m also considering minoring in something business related and getting business experience since my family is full of businessmen, and they all say it&#x27;s about the skills and a degree in management is useless, so I might be able to get into it. International business, maybe? I&#x27;m fond of learning languages.<p>Well, if nothing works out, I&#x27;m going to choose something random from the things I&#x27;ve tried (web dev, android dev, malware analysis, whatever) and run with it. It&#x27;s about time I do something I hate for my resume so that I can get that 9-5 job I&#x27;ll hate. Sue me, I need to eat. I&#x27;ll just simmer in the irony that someone like me, who is passionate about so many things, some of which are practical, ended up in something I don&#x27;t like.<p>If I sound desperate, I am.<p>Any advice?",
      "time": 1645017889,
      "title": "Ask HN: Stuck as a CS Major. Is there a way out?",
      "type": "story"
    },
    {
      "by": "josefslerka",
      "descendants": 0,
      "id": 30359624,
      "score": 1,
      "time": 1645017885,
      "title": "Researcher fully recovers text from pixels: how to reverse redaction",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/researcher-fully-recovers-text-from-pixels-how-to-reverse-redaction/"
    },
    {
      "by": "asim",
      "descendants": 0,
      "id": 30359609,
      "score": 1,
      "time": 1645017810,
      "title": "Show HN: M3O – A new serverless cloud platform",
      "type": "story",
      "url": "https://m3o.com?hn=serverless"
    },
    {
      "by": "0066cc",
      "descendants": 0,
      "id": 30359595,
      "score": 1,
      "time": 1645017683,
      "title": "I Can’t Stop Thinking About This",
      "type": "story",
      "url": "https://www.newyorker.com/culture/infinite-scroll/i-cant-stop-thinking-about-this"
    },
    {
      "by": "BaldricksGhost",
      "descendants": 0,
      "id": 30359593,
      "score": 1,
      "time": 1645017680,
      "title": "Ars Technica: Here’s How the New York Times Changed Wordle",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2022/02/heres-how-the-new-york-times-changed-wordle/"
    },
    {
      "by": "FridayoLeary",
      "descendants": 0,
      "id": 30359568,
      "score": 3,
      "time": 1645017474,
      "title": "US approves new headlights that won’t blind oncoming drivers",
      "type": "story",
      "url": "https://apnews.com/article/coronavirus-pandemic-technology-business-health-congress-761cac7ae30a03ab6a399b9676ae44bb"
    }
  ]
}