{
  "stories": [
    {
      "by": "rivert",
      "descendants": 0,
      "id": 28034382,
      "score": 1,
      "text": "Any suggestions&#x2F;software to keep multiple calendars from multiple clients in sync?\nCurrently i&#x27;ve three clients, two with Office365, one with Gsuite plus my private one. I find myself constantly going through three web views, making or accepting one appointment and creating a blocker in the other two.\nRunning on Linux, a big plus would be that the credentials won&#x27;t leave my system. I won&#x27;t mind using e.g. a private google account as &quot;master&quot; to merge and distribute the calendars as long as the others would only see &quot;blocker&quot; and not the details of the actual appointment.",
      "time": 1627894465,
      "title": "Ask HN: Software recommendation to keep multiple calendars in sync as freelancer",
      "type": "story"
    },
    {
      "by": "lbriner",
      "descendants": 0,
      "id": 28034360,
      "score": 1,
      "time": 1627894331,
      "title": "Turning a former coal plant into a gas-fired Bitcoin mine",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/av/technology-58020010"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28034356,
      "score": 1,
      "time": 1627894274,
      "title": "Dealing with Out-of-Memory Conditions in Rust",
      "type": "story",
      "url": "https://www.crowdstrike.com/blog/dealing-with-out-of-memory-conditions-in-rust/"
    },
    {
      "by": "bubblehack3r",
      "descendants": 0,
      "id": 28034355,
      "score": 1,
      "time": 1627894273,
      "title": "Frontwork Component Marketplace – Buy and Sell Front End Components",
      "type": "story",
      "url": "https://frontwork.dev/component-marketplace"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 28034343,
      "score": 2,
      "time": 1627894209,
      "title": "Clues to healthy aging found in the gut bacteria of centenarians",
      "type": "story",
      "url": "https://newatlas.com/health-wellbeing/gut-bacteria-microbiome-centenarians-healthy-aging/"
    },
    {
      "by": "globalneighbor",
      "descendants": 1,
      "id": 28034321,
      "kids": [
        28034322
      ],
      "score": 3,
      "time": 1627893991,
      "title": "Social network making you spend less time on phone",
      "type": "story",
      "url": "https://thejoynapp.com/download"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 28034291,
      "score": 1,
      "time": 1627893713,
      "title": "SOAP And REST At Odds (2017)",
      "type": "story",
      "url": "https://thehistoryoftheweb.com/soap-rest-odds/"
    },
    {
      "by": "mdp2021",
      "descendants": 0,
      "id": 28034269,
      "score": 1,
      "text": "Premise: this is a sensitive topic, but of strong intellectual and practical interest, and I see this community as one of the best to fruitfully tackle the matter.<p>I would be grateful for help in assessing the risks, in amount (probability, conditions&#x2F;demographics) and details (what may happen, for how long), of the vaccines (foremostly of the vaccines, then of COVID-19) against the current in-focus epidemic. Any &quot;Cost&#x2F;Risk&#x2F;Benefit&quot; analysis is supposed to be based on numbers - these numbers may not be immediately available.<p>The consequences of interest are those of mid-long duration - what lasts only a few days is assumed as &quot;endurable&quot;. What may instead last for many weeks, months etc. is relevant.<p>I have for now only directly checked the data from the USA VAERS system: it seems fairly reliable in terms of the data contained (it is reported to be mostly compiled by medical practitioners), but is very probably less reliable in terms of real amounts - reporting is voluntary. It would be useful to compare it to systems with &quot;active monitoring&quot; in which the compilation from practitioners is mandated. For the moment, I could only access the data from VAERS and could not enter other sources (e.g. the European and the Australian one). Already in the VAERS it does not seem immediate to discriminate the expected first-days side effects from the long duration ones.<p>I also do not know which repository about the consequences (condition, probability, duration, demographics...) of actual infection could be the most reliable. In fact, even calculating the odds of infection does not seem trivial.<p>Thank you.",
      "time": 1627893480,
      "title": "Ask HN: Finding data about vaccine vs. infection risks, and making sense of it",
      "type": "story"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28034259,
      "score": 1,
      "time": 1627893399,
      "title": "A Tour in the Wonderland of Math with Python",
      "type": "story",
      "url": "https://github.com/neozhaoliang/pywonderland"
    },
    {
      "by": "ismaildonmez",
      "descendants": 0,
      "id": 28034226,
      "score": 2,
      "time": 1627893015,
      "title": "Pensées by Bryan Magee",
      "type": "story",
      "url": "https://www.newstatesman.com/2021/07/pens-es-bryan-magee"
    }
  ]
}