{
  "stories": [
    {
      "by": "MBCook",
      "descendants": 0,
      "id": 29170124,
      "score": 1,
      "time": 1636508384,
      "title": "It's Time to Fire Every Manager",
      "type": "story",
      "url": "https://ez.substack.com/p/its-time-to-fire-every-manager"
    },
    {
      "by": "connectsnk",
      "descendants": 0,
      "id": 29170122,
      "score": 1,
      "text": "Hi HN Community. I used to be a developer and I am currently a member of a support team for a biggish company.<p>I have recently been getting a lot of exposure to admin level security work like dealing with Active Directory&#x2F; SSL etc. I am not sure if becoming an expert in this field would pay off long term. I have read from other posts on HN that security field pays well but its a vast field with many diverse roles and it is not clear what these roles do and what they get paid.<p>I will be extremely grateful if someone can throw some light on which security related roles &#x2F; skills are desirable to have and would make one attractive to FAANG companies.",
      "time": 1636508363,
      "title": "Ask HN: Which type of security focused roles pay FAANG level salaries",
      "type": "story"
    },
    {
      "by": "cucumberladybug",
      "descendants": 0,
      "id": 29170108,
      "score": 1,
      "text": "Senior developer here. This is kind of a weird question, hopefully somebody has experienced something like that and has any suggestion.<p>I realized that on my daily workflow I make a lot of simple mistakes, sometimes syntax errors, or entering the wrong value of a constant,...  the kind of problems I cannot just catch by running a linter. That&#x27;s never been a huge deal as I usually can test things locally and fail fast before sharing my work with other people, so I just got used to work in a tight trial and error loop.<p>Recently I started a new position at an organization where even deploying to dev environments requires an approval process and I can&#x27;t test or reproduce things locally. In this scenario my silly mistakes are costly in terms of time and reputation, as I have to frequently resubmit the PR and start the process again.<p>So basically I&#x27;m looking at some ideas or tips for &quot;getting things right at the first time&quot;.",
      "time": 1636508233,
      "title": "Ask HN: Trial&Error vs. Getting things right the first time",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29170093,
      "score": 2,
      "time": 1636508038,
      "title": "Why Python needs to be paused during profiling – but Ruby doesn't always",
      "type": "story",
      "url": "https://www.benfrederickson.com/why-python-needs-paused-during-profiling/"
    },
    {
      "by": "the2ndfloorguy",
      "descendants": 0,
      "id": 29170062,
      "score": 1,
      "time": 1636507633,
      "title": "Should I store JWT tokens in IndexedDB?",
      "type": "story",
      "url": "https://stackoverflow.com/questions/62360200/should-i-store-jwt-tokens-in-indexeddb"
    },
    {
      "by": "mcrwfrd",
      "descendants": 1,
      "id": 29170056,
      "kids": [
        29170070
      ],
      "score": 1,
      "text": "I recently started refreshing my knowledge of data structures and algorithms and discovered that I actually really enjoy the subject. Studying the Union-Find data structure, for example, has really helped me rediscover the joy of programming.<p>After a few years in the industry, I have mostly accepted that most programming jobs these days are &quot;lego programming&quot;, in the sense that we don&#x27;t really use &quot;computer science&quot; knowledge in our day jobs, we mostly just connect API&#x27;s and write business logic. I&#x27;ve mostly come to terms with this. But a couple of times a year, I start to wonder if there are any jobs these days that are more than just &quot;lego programming&quot;.<p>So the question: does anyone here have a job in which the code they write is more &quot;computer science&quot; and less &quot;lego programming&quot;?<p>My hope with this question is to have a few modern examples of interesting computer science roles in industry, rather than reignite the old &quot;all we do is CRUD&quot; pity party.",
      "time": 1636507576,
      "title": "Ask HN: Which industry roles actually require daily use of CS knowledge?",
      "type": "story"
    },
    {
      "by": "sam345",
      "descendants": 0,
      "id": 29170051,
      "score": 1,
      "time": 1636507523,
      "title": "Satellite images appear to show mock-up US warships in China desert",
      "type": "story",
      "url": "https://www.bbc.com/news/world-asia-china-59210417"
    },
    {
      "by": "sam345",
      "descendants": 0,
      "id": 29170046,
      "score": 1,
      "time": 1636507460,
      "title": "How promising are Bill Gates' nuclear plans?",
      "type": "story",
      "url": "https://www.dw.com/en/scientists-pour-cold-water-on-bill-gates-nuclear-plans/a-59751405"
    },
    {
      "by": "thesecretceo",
      "descendants": 0,
      "id": 29170035,
      "score": 1,
      "time": 1636507410,
      "title": "Who Regulates Privacy in the U.S.",
      "type": "story",
      "url": "https://www.linkedin.com/posts/jozian_privacy-privacyregulators-dataprivacylaw-activity-6862400392576208896-h_YH"
    },
    {
      "by": "mmphosis",
      "descendants": 0,
      "id": 29170002,
      "score": 1,
      "time": 1636507205,
      "title": "Pop-up from Hell: On the growing opacity of web programs",
      "type": "story",
      "url": "http://tomasp.net/blog/2021/popup-from-hell/"
    }
  ]
}