{
  "stories": [
    {
      "by": "eberbtc",
      "descendants": 0,
      "id": 31289307,
      "score": 1,
      "time": 1651868806,
      "title": "Gosh launches as the first ever Git blockchain",
      "type": "story",
      "url": "https://accounts.google.com/ServiceLogin?service=wise&passive=1209600&continue=https://docs.google.com/document/d/1yn8Ptu4kvxXIEsnflPKdqXlyeS2TIIY2jinmrLN3f8I/edit?usp%3Dsharing&followup=https://docs.google.com/document/d/1yn8Ptu4kvxXIEsnflPKdqXlyeS2TIIY2jinmrLN3f8I/edit?usp%3Dsharing&ltmpl=docs"
    },
    {
      "by": "Victerius",
      "descendants": 0,
      "id": 31289271,
      "score": 1,
      "time": 1651868548,
      "title": "Stop Telling Me to Buy Bitcoin",
      "type": "story",
      "url": "https://newsletters.theatlantic.com/unsettled-territory/62752cd033833200211d7882/cryptocurrency-bitcoin-appeal-black-americans/"
    },
    {
      "by": "berkeleyjunk",
      "descendants": 0,
      "id": 31289254,
      "score": 1,
      "time": 1651868458,
      "title": "Australian Bartender Found an ATM Glitch and Blew $1.6M",
      "type": "story",
      "url": "https://www.vice.com/en/article/pa5kgg/this-australian-bartender-dan-saunders-found-an-atm-bank-glitch-hack-and-blew-16-million-dollars"
    },
    {
      "by": "nimbius",
      "descendants": 0,
      "id": 31289238,
      "score": 2,
      "text": "Im looking to consolidate some of my old pi&#x27;s into a low power home server, something powerful enough to run KVM&#x2F;QEMU&#x2F;dockerless pods.  it should be quiet as well maybe?  does anyone have a recommendation for the HW spec? or maybe a product?",
      "time": 1651868355,
      "title": "Ask HN: Low power home server hardware?",
      "type": "story"
    },
    {
      "by": "car_analogy",
      "descendants": 0,
      "id": 31289203,
      "score": 1,
      "time": 1651868057,
      "title": "St. John's Park – New York City, same view, 1830s – 2019",
      "type": "story",
      "url": "https://twitter.com/i/status/1463174302124158977"
    },
    {
      "by": "poodlehair",
      "descendants": 0,
      "id": 31289198,
      "score": 2,
      "text": "The problem with the loose investment mechanics of silicon valley venture capital is that spray and pray eventually if not immediately leads to investing in crapware.<p>But worse now we have the last stage of crapware.<p>Which is crapware platforms.<p>The metaverse, crypto, mobile os and social media are crapware platforms",
      "time": 1651868019,
      "title": "Web3,metaverse,mobile, social media is crapware",
      "type": "story"
    },
    {
      "by": "laurex",
      "descendants": 0,
      "id": 31289194,
      "score": 2,
      "time": 1651867983,
      "title": "A Landlord ‘Underestimated’ His Tenants. Now They Could Own the Building",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/06/realestate/tenants-eviction-port-morris-bronx.html"
    },
    {
      "by": "ortusdux",
      "descendants": 0,
      "id": 31289189,
      "score": 1,
      "time": 1651867917,
      "title": "Adam Savage's Rant on Laser Printers",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=m9lFcduaZPU"
    },
    {
      "by": "ketzu",
      "descendants": 1,
      "id": 31289176,
      "kids": [
        31289269
      ],
      "score": 1,
      "text": "Hey everyone,<p>recently I have been thinking of how to manage risks (and improve my communication skills) when interviewing with foreign companies.<p>Is there anything you would recommend to do, improve or look out for?<p>Risks I see are changes in schedule due to country policies and cross-cultural communication, especially in a corporate setting, which can be challenging. Examples can be the target country closing due to corona on short notice, necessitating a new apartment locally or flight cancellations.<p>------<p>Long story motivating this question, as this is born from my frustration around my own naivety:<p>I wanted to move abroad for (at least) some years for quite some time, and last summer when finishing up my PhD I started interviewing all around the world. I got an offer from a company in Tokyo via relocate.me which was good enough for me at the time. The recruiter was upfront: Due to the pandemic, I should not cancel my job or lease, as the process would take quite some time and that last time it took them ~6 months.<p>After getting the necessary documents and certificate of eligibility and a lot of back and forth with new required documents by japan&#x27;s government, I got somewhat lucky: In November the country opened up. The company instructed me to find a flight and book it for January. So I did. I also cancelled my lease as there is a 3 month cancellation period - although I didn&#x27;t communicate this with the company at the time and I did not book travel insurance for flight cancellations, only a flight that can be changed to another day.<p>Unfortunately, omicron hit right after this and japan closed down, the communication from the company seemed to slow down and become more one-sided, but finally, I got the info that there was nothing going to change before the end of January - no new date for the flight in sight.<p>As I didn&#x27;t want to end up homeless and reduce further losses from missed wages and flight tickets I decided to find a different job and a new apartment, cancel on the company and ask if they&#x27;d be willing to refund the ticket anyways. They told me they would look into it and I got in contact with a representative of the company. After some back and forth they stopped responding to me and I asked the recruiter if anything went wrong communication-wise. I was told the representative (who also received and responded to my cancellation email earlier) thought I got a different job and therefore stopped responding and that the managers decided the company was not responsible for my lost 1k$ of the flight, but they&#x27;ll look over it again.",
      "time": 1651867821,
      "title": "Ask HN: How to manage risk when interviewing with foreign companies?",
      "type": "story"
    },
    {
      "by": "lproven",
      "descendants": 0,
      "id": 31289157,
      "score": 2,
      "time": 1651867677,
      "title": "The reason that the first version of Windows NT was called 3.1",
      "type": "story",
      "url": "https://liam-on-linux.dreamwidth.org/83538.html"
    }
  ]
}