{
  "stories": [
    {
      "by": "dgul2tor",
      "descendants": 1,
      "id": 29639503,
      "kids": [
        29639504
      ],
      "score": 1,
      "time": 1640106907,
      "title": "Data privacy back end infrastructure for the future",
      "type": "story",
      "url": "https://cipherflow.co"
    },
    {
      "by": "Sodman",
      "descendants": 0,
      "id": 29639491,
      "score": 1,
      "time": 1640106832,
      "title": "Meta AI – Animate your kids' drawings",
      "type": "story",
      "url": "https://sketch.metademolab.com/canvas"
    },
    {
      "by": "lopkeny12ko",
      "descendants": 0,
      "id": 29639486,
      "score": 1,
      "text": "I work at a startup with ~50 employees (and have always worked at startups). Love the work and the people. Recently we were acquired by $LARGE_CORPORATION and the experience has been a living hell for all of us. Things that should take a few days take a few weeks. Things that should take a few weeks take a few quarters. It&#x27;s slowly driving me insane.<p>The experience is best shared as a story.<p>I&#x27;m working on migrating our apps to the parent company&#x27;s VM launching and deploy platform. Should be fairly straightforward, I think. Unfortunately, the deploy tooling isn&#x27;t entirely compatible with our app so I ask the team if they can implement $X feature to support our app.<p>The first engineer I talk to doesn&#x27;t even attempt to answer my question but redirects me to their manager. Ok, that&#x27;s odd, I think, but whatever.<p>Manager says sure, just fill out this feature request doc. It&#x27;s a Google Docs template with 4 (!) pages of required documentation to just explain why I want this feature implemented. It asks for my team name, the motivation, why I can&#x27;t solve the problem some other way, yada yada...ok, I guess it&#x27;s good to document your work, so sure. I fill it out and submit it.<p>No response after two days. Then I get an automated email that their <i>skip</i> level manager has approved the work. Huh? This is followed by an email that the team&#x27;s eng manager approved the work. Why do two layers of management need to approve work on something they have no knowledge about?<p>Finally, after many rounds of arguing about why this needs to be done in the first place (ahem: you told us to migrate to your platform, and it literally does not work for our app), they quote us a delivery timeline of <i>end of Q1 in 2022</i>.<p>At this point I am in absolute shock. This should take no more than a few days to implement.<p>So I reach out to the manager and ask what is going on. This is a simple task, I said. Why does it take an entire quarter for your team to deliver? He doesn&#x27;t have an answer.<p>I tell him I&#x27;m happy to fix the issue myself, if they link me to the relevant codebase. &quot;It shouldn&#x27;t be too hard to dig in and submit a patch,&quot; I think to myself. He says he cannot give me access to the codebase for compliance reasons, and that only members of his team have R&#x2F;W on that repo. What???<p>This is insane. And this entire time I was only alllowed to interact with managers and have not spoken to a single engineer about the actual technical details. It is impossible to get anything <i>done</i> here now.<p>Is this how it&#x27;s like at all large companies? What should I do?",
      "time": 1640106813,
      "title": "Ask HN: Startup acquired by a large company and it sucks. What to do?",
      "type": "story"
    },
    {
      "by": "23pointsNorth",
      "descendants": 0,
      "id": 29639473,
      "score": 1,
      "time": 1640106737,
      "title": "From Amazon to Zoom: What Happens in an Internet Minute in 2021?",
      "type": "story",
      "url": "https://www.visualcapitalist.com/from-amazon-to-zoom-what-happens-in-an-internet-minute-in-2021/"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 29639469,
      "score": 1,
      "time": 1640106719,
      "title": "3D printed nanomagnets unveil a world of patterns in the magnetic field",
      "type": "story",
      "url": "https://phys.org/news/2021-12-3d-nanomagnets-unveil-world-patterns.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29639464,
      "score": 1,
      "time": 1640106695,
      "title": "What the EPA's new vehicle emissions requirements look like",
      "type": "story",
      "url": "https://www.autonews.com/regulation-safety/heres-what-epas-new-vehicle-emissions-requirements-look-under-biden"
    },
    {
      "by": "23pointsNorth",
      "descendants": 0,
      "id": 29639462,
      "score": 1,
      "time": 1640106680,
      "title": "Influencer with investment tips often not independent, warns Dutch regulator",
      "type": "story",
      "url": "https://nltimes.nl/2021/12/21/influencer-investment-tips-often-independent-warns-dutch-regulator"
    },
    {
      "by": "harrisreynolds",
      "descendants": 0,
      "id": 29639445,
      "score": 2,
      "text": "I&#x27;ve been looking through a legacy code base recently and have observed a perennial question come into my mind:<p>What makes software great?<p>Of course it needs to work for it intended purpose.  But that alone does not make great software.  That is merely table stakes.<p>The more I work in this industry the more I think the main thing that defines greatness is:<p>Is the code easy to understand?<p>Of courses there is subjectivity in even this, but could a reasonably intelligent developer easy see what is going on in a codebase, even as it grows sufficiently large.<p>Empathy is a superpower here.  How much are you thinking about the poor souls that will follow in your footsteps and be asked to build upon your foundation?<p>I know this is a complex topic with plenty of subjectivity.  But I am curious what your thoughts are here.<p>What makes software great?",
      "time": 1640106559,
      "title": "Ask HN: What Makes Software Great?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29639421,
      "score": 1,
      "time": 1640106455,
      "title": "Julia Zhao, a developer and video game creator",
      "type": "story",
      "url": "https://blog.google/technology/developers/meet-julia-zhao-developer-and-video-game-creator/"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 29639420,
      "score": 1,
      "time": 1640106451,
      "title": "Checker Plus for Gmail displays new emails and the sender's contact photo",
      "type": "story",
      "url": "https://jasonsavard.com/Checker-Plus-for-Gmail"
    }
  ]
}