{
  "stories": [
    {
      "by": "philonoist",
      "descendants": 0,
      "id": 29529391,
      "score": 1,
      "time": 1639315200,
      "title": "KeyNav – Rapid pointer movement with keyboard",
      "type": "story",
      "url": "https://www.semicomplete.com/projects/keynav/"
    },
    {
      "by": "arcturus17",
      "descendants": 0,
      "id": 29529375,
      "score": 1,
      "text": "I have noticed in the last couple of years that search results on Amazon have become horrendous.<p>Often I am looking for highly specific items, and Amazon will recommend many items that have nothing to do with them in the first ten results.<p>For example, I have just looked into &quot;weightlifting shoes&quot; and the THIRD result was a cycling shoe.<p>This is in the Spanish store. After checking the American store, results are slightly better (the Spanish store is truly atrocious), but there are many bad results within the first twenty or so results.<p>Does anyone know why this is happening?",
      "time": 1639315025,
      "title": "Ask HN: Why is search on Amazon so bad?",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29529351,
      "score": 1,
      "time": 1639314816,
      "title": "Workers Are Using ‘Mouse Movers’ So They Can Use the Bathroom in Peace",
      "type": "story",
      "url": "https://www.vice.com/en/article/88gqgp/mouse-mover-jiggler-app-keep-screen-on-active"
    },
    {
      "by": "vixalien",
      "descendants": 0,
      "id": 29529317,
      "score": 1,
      "time": 1639314528,
      "title": "Rabbet",
      "type": "story",
      "url": "https://dash.rabbet.me/account"
    },
    {
      "by": "dcanelhas",
      "descendants": 0,
      "id": 29529312,
      "kids": [
        29529321
      ],
      "score": 4,
      "text": "Post that got taken down for violating community guidelines was simply the following:<p>&quot;Det finns många bra alternativ förutom ubuntu. Kolla på distrowatch.com och titta runt lite, kolla på screenshots och besök hemsidorna se om det är något verkar passa dig. Många distros satsar just på att vara &quot;lightweight&quot; och vissa har ett &quot;live medium&quot; vilket innebär att installationsmediumet är så att du kan starta operativsystemet direkt från ett USB minne och testa det utan att ens installera det till en början.&quot;<p>in english:<p>&quot;There are many good options besides ubuntu. Check out distrowatch.com and look around a bit, look at the screenshots and visit the websites to see if there is something that seems to suit you. Many distros focus on being &quot;lightweight&quot; and some have a &quot;live medium&quot; which means that the installation medium is so that you can boot the operating system directly from a USB memory and test it without even installing it in the first place.&quot;",
      "time": 1639314469,
      "title": "Linking to distrowatch.com from Facebook is a community violation",
      "type": "story"
    },
    {
      "by": "mmiliauskas",
      "descendants": 0,
      "id": 29529288,
      "score": 1,
      "time": 1639314316,
      "title": "Metaverse might just solve climate change",
      "type": "story",
      "url": "https://marti-1.io/2021/12/09/metaverse-might-just-solve-climate-change.html"
    },
    {
      "by": "vixalien",
      "descendants": 0,
      "id": 29529267,
      "score": 1,
      "text": "So I decide to build a windows 11 app. I already know some .NET and C&#x2F;family from school and look through the source of C# and it doesn&#x27;t seem too complicated.<p>However, building Windows apps is very complicated even when you know C++ or C#.<p>1. I wanted to build  Windows 11 apps and I had to choose between Windows Forms, WinUI3, Win32 and WPF I think. I don&#x27;t really know the difference between the 3 and no one really explains that (unless Win32 which is obvious).<p>2. Apparently, WUP is no longer recommended. A few years they were pushing it to the max. Bummer.<p>3. I installed Visual Studio overnight (it comes with all the tools that building apps need). It downloaded 6GB of data and used 20GB of storage. All i want to build is a hello world app.<p>4. I create a project following a guide from Microsoft.<p>5. The app is extremely resource heavy and way too over-featured. I build the boilerplate app and Run it and it takes minutes to build (most of the time is downloading dependencies so not such a big deal).<p>6. I open the newly created app in Sublime Text (my editor) and I can&#x27;t find a way to build the app anymore.<p>7. Because Visual Studio is so bloated, I download Visual Studio Code, which is far more simple but I can still not figure out how to build my app even with the various extensions VS code boasts.<p>8. After hours of googling, I formulate a script that can build the app from the command-line.<p>9. But I stil don&#x27;t know how to build the app as the .exe file created does not execute.<p>10. I&#x27;m very disappointed.<p>The worst of all is that there is not even one good guide on the whole clearnet on how to do develop a Hello World windows app from scratch.",
      "time": 1639314139,
      "title": "Ask HN: Why is building Windows apps so complicated",
      "type": "story"
    },
    {
      "by": "playpause",
      "descendants": 0,
      "id": 29529266,
      "score": 1,
      "time": 1639314138,
      "title": "I was told the 12 steps would cure my addiction",
      "type": "story",
      "url": "https://www.theguardian.com/society/2021/dec/04/12-steps-addiction-cure-quasi-religious"
    },
    {
      "by": "carmenapostu",
      "descendants": 0,
      "id": 29529265,
      "score": 1,
      "time": 1639314135,
      "title": "Zanshin: Learning the Art of Attention and Focus from a Legendary Samurai Archer",
      "type": "story",
      "url": "https://jamesclear.com/zanshin"
    },
    {
      "by": "ourmandave",
      "descendants": 0,
      "id": 29529249,
      "score": 1,
      "time": 1639314029,
      "title": "Dark Matter Radio Could Tune into New Physics",
      "type": "story",
      "url": "https://gizmodo.com/this-dark-matter-radio-could-tune-into-new-physics-1847947224"
    }
  ]
}