{
  "stories": [
    {
      "by": "SunirKM",
      "descendants": 0,
      "id": 32185778,
      "score": 1,
      "text": "Please Me By Sharing me your Experience if you have applied for this Immigration Status. How long did it take? How much did it cost? What questions did they ask you?<p>Thank You",
      "time": 1658441060,
      "title": "Anyone here who has Experienced International Entrepreneur Parole?",
      "type": "story"
    },
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 32185763,
      "score": 2,
      "time": 1658440890,
      "title": "Religion and Nothingness Summary (2016)",
      "type": "story",
      "url": "https://antilogicalism.com/2016/05/06/religion-nothingness/"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 32185752,
      "score": 2,
      "time": 1658440828,
      "title": "Why Kids Want Things (2018)",
      "type": "story",
      "url": "https://www.theatlantic.com/family/archive/2018/08/kids-materialism/568987/"
    },
    {
      "by": "jacquesm",
      "descendants": 0,
      "id": 32185748,
      "score": 2,
      "time": 1658440811,
      "title": "Tesla has dumped 75% of its Bitcoin a year after touting long-term potential",
      "type": "story",
      "url": "https://www.cnbc.com/2022/07/20/tesla-converted-75percent-of-bitcoin-purchases-to-fiat-currency-in-q2-2022.html"
    },
    {
      "by": "SunirKM",
      "descendants": 0,
      "id": 32185747,
      "score": 1,
      "text": "Please Help me by Sharing me Your Experience. What Visa did you choose and how long did it take? and Did you do it yourself or did you too help from lawyer?<p>Thank You",
      "time": 1658440796,
      "title": "Anyone Here with Immigration Experience as Founder",
      "type": "story"
    },
    {
      "by": "altdataseller",
      "descendants": 0,
      "id": 32185736,
      "score": 3,
      "text": "I just got this email from Slack:<p>&quot;Hello,<p>We are writing to inform you of an issue we recently discovered. A number of members of your workspace were inadvertently included on the same email. This means that you&#x27;re able to see each other&#x27;s email addresses in the “To” line. You are receiving this notice because you were sent this email on July 19 or July 20, 2022.<p>What happened and when?\nSlack emailed members of your workspace about the upcoming changes to Slack’s free plan with the subject line “New features coming to your Slack workspace.” Instead of sending each workspace member individual emails as intended, the email recipients on your team were visible in the same email message.<p>Slack identified this problem and immediately took steps to stop additional emails from being sent in this way. We&#x27;re also reaching out to inform all users who received the email. All of the content of the email is still accurate for your team.<p>How was I impacted?\nSince you received one of these emails, this means that other people on your workspace who received the email may have inadvertently seen your email address.<p>What should I do?\nWe ask that you delete and not share, store, print, or in any way retain the original email with email addresses. If you have additional questions about this, you can reply to this email, or reach out to us at feedback@slack.com.<p>We know that the security and privacy of your data is important. We are very sorry for the inconvenience and concern this issue may have caused.<p>Sincerely,\nThe team at Slack&quot;<p>Guess they&#x27;ll be dealing with some class action lawsuit soon.",
      "time": 1658440757,
      "title": "Tell HN: Slack revealed email addresses of users to others in same workspace",
      "type": "story"
    },
    {
      "by": "kminehart",
      "descendants": 0,
      "id": 32185728,
      "score": 2,
      "text": "Hi there. This is a passion project of mine I started after spending many painful hours working on CI pipelines. The general idea is that I wanted to stop making flimsy scripts in build &amp; release pipelines and start writing software.<p>I&#x27;m happy to answer any questions. Please let me know what you think of the idea and if there&#x27;s anything you&#x27;d like to see.",
      "time": 1658440729,
      "title": "Show HN: Scribe, a Go library for writing, running, and generating CI pipelines",
      "type": "story",
      "url": "https://github.com/grafana/scribe"
    },
    {
      "by": "juniperplant",
      "descendants": 0,
      "id": 32185691,
      "score": 1,
      "time": 1658440514,
      "title": "Random wallpaper with just bash and systemd",
      "type": "story",
      "url": "https://randthoughts.github.io/random-wallpaper-with-just-bash-and-systemd/"
    },
    {
      "by": "onemoresoop",
      "descendants": 0,
      "id": 32185679,
      "score": 4,
      "time": 1658440460,
      "title": "Analysis: Starbucks can't be America's public bathroom",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/21/business/starbucks-bathrooms-stores-closing/index.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32185678,
      "score": 2,
      "time": 1658440455,
      "title": "Debugging Methodologies",
      "type": "story",
      "url": "https://oxide-and-friends.transistor.fm/episodes/debugging-methodologies"
    }
  ]
}