{
  "stories": [
    {
      "by": "hnthrowaway0315",
      "descendants": 0,
      "id": 30389609,
      "score": 1,
      "time": 1645210455,
      "title": "Project Defending Digital Democracy",
      "type": "story",
      "url": "https://www.belfercenter.org/project/defending-digital-democracy"
    },
    {
      "by": "throwoutway",
      "descendants": 0,
      "id": 30389606,
      "score": 1,
      "time": 1645210442,
      "title": "Delete Facebook. Permanent Account Deletion",
      "type": "story",
      "url": "https://deletefacebook.com"
    },
    {
      "by": "tofac",
      "descendants": 0,
      "id": 30389598,
      "score": 1,
      "text": "Hi HN,<p>I ve been in this community for a while now and have a huge amount of respect for the people and the forum so I wanted to post this here.<p>This is a pretty random one and I wish to emphasise from the very beginning this is not medical advice and is only based on what I saw in myself. It is therefore entirely up to anyone kind enough to have a read to decide whether they think what I describe makes any sense for them.\nIf people have comments or thoughts I think it would be quite cool to use the GitHub issues as a forum for discussion and collecting peoples’ feedback.<p>TLDR<p>When I  was diagnosed with an anxiety condition I thought about the specifics of what was going on in my mind probably an unhealthy amount. I wrote it down, then rewrote it many many times and it then sat in my draw for a few years, and I ve finally decided I should put it online just in case it helps someone else.<p>I believe we have largely overlooked the possibility of using introspection of one’s own consciousness to gain scientific understanding and theories of the casual mechanism involved in anxiety conditions. I propose that when I study my own consciousness there appear to be useful abstractions (many of which we already allude to in common language) and that formalising the system described by these abstractions appears to be useful for understanding the casual mechanism underlying the anxiety conditions I experienced.<p>At it’s most basic the casual mechanism I propose relates to the existence (under certain conditions &#x2F; beliefs) of a feedback loop between those feelings that are partially endogenous and our thoughts (under the definitions of these terms laid out in the essay). Whilst I can only analyse myself, this casual mechanism also appears to be consistent with and explain many of the clinical characteristics of the anxiety conditions described in the DSM. I believe it also sheds light on the current successful therapeutic approaches as well as their failings. \nHowever, as emphasised throughout, this is, and can only ever be a theory about me, and can only ever be falsified on an individual basis. Therefore, I would love to hear other peoples’ opinions on whether this description of my conscious experience and the theory I propose is also true for them.<p>Github issues - <a href=\"https:&#x2F;&#x2F;github.com&#x2F;A-Theory-Of-Anxiety-Conditions&#x2F;A-Theory-Of-Anxiety-Conditions.github.io&#x2F;issues\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;A-Theory-Of-Anxiety-Conditions&#x2F;A-Theory-O...</a><p>PS apologies for the website I m no web developer",
      "time": 1645210395,
      "title": "Show HN: A Theory of Anxiety Conditions",
      "type": "story",
      "url": "https://a-theory-of-anxiety-conditions.github.io/"
    },
    {
      "by": "lord_sudo",
      "descendants": 0,
      "id": 30389591,
      "score": 2,
      "time": 1645210352,
      "title": "Choose Boring Technology (2015)",
      "type": "story",
      "url": "https://mcfunley.com/choose-boring-technology"
    },
    {
      "by": "headalgorithm",
      "descendants": 0,
      "id": 30389586,
      "score": 1,
      "time": 1645210343,
      "title": "What the history of AI tells us about its future",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/02/18/1044709/ibm-deep-blue-ai-history/"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30389517,
      "score": 1,
      "time": 1645210046,
      "title": "A Recipe to Study Graph Neural Networks (GNNs",
      "type": "story",
      "url": "https://github.com/dair-ai/GNNs-Recipe"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30389496,
      "score": 1,
      "time": 1645209928,
      "title": "Chaining Atoms Together Yields Quantum Storage",
      "type": "story",
      "url": "https://www.caltech.edu/about/news/chaining-atoms-together-yields-quantum-storage"
    },
    {
      "by": "n_plus_1",
      "descendants": 0,
      "id": 30389491,
      "score": 1,
      "time": 1645209913,
      "title": "Ottawa police push to clear convoy blockades now underway",
      "type": "story",
      "url": "https://globalnews.ca/news/8630014/ottawa-final-showdown-police-freedom-convoy/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30389481,
      "score": 1,
      "time": 1645209853,
      "title": "The Browser",
      "type": "story",
      "url": "https://thebrowser.com/"
    },
    {
      "by": "orf",
      "descendants": 0,
      "id": 30389474,
      "score": 1,
      "time": 1645209842,
      "title": "WinFS",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/WinFS"
    }
  ]
}