{
  "stories": [
    {
      "by": "geocrasher",
      "descendants": 0,
      "id": 28290961,
      "score": 1,
      "time": 1629822224,
      "title": "A Static Electricity Disease?",
      "type": "story",
      "url": "http://amasci.com/static/e-disease.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28290942,
      "score": 1,
      "time": 1629822161,
      "title": "A man third in presidential succession has been in five 'Batman' movies",
      "type": "story",
      "url": "https://edition.cnn.com/2021/01/23/us/senator-patrick-leahy-batman-trnd/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28290935,
      "score": 1,
      "time": 1629822140,
      "title": "Wok Racing",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Wok_racing"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28290931,
      "score": 2,
      "time": 1629822127,
      "title": "Apache Arrow Ballista 0.5.0 release with support for complex distributed queries",
      "type": "story",
      "url": "https://arrow.apache.org/blog/2021/08/18/ballista-0.5.0/"
    },
    {
      "by": "samstave",
      "descendants": 0,
      "id": 28290874,
      "score": 1,
      "text": "What considerations have companies been making once we have autonomous taxis&#x2F;ubers&#x2F;lyft where its only the passenger and the vehicle - where If the vehicle gets a flat - gets into an accident, or if the vehicle has no passengers and it gets vandalized?<p>What if the scenario is that the passengers inside take off their seatbelt? Or are being unruly? Or vomit?<p>There just seems to be wreck&#x2F;damage scenarios that will be dealt with - but what infra is being setup along side with these rollouts to handle such situations?<p>Are&#x2F;have companies such as Waymo already done dry-runs with their vehicles to test how they will handle these?<p>I believe that every model-year car currently has to go under crash-tests, and it would seem that many different crash-scenario tests would need to be tested by autonomous cars?<p>It would be interesting to hear about how they have already been addressing such...",
      "time": 1629821905,
      "title": "Ask HN: Autonomous cars and breakdowns/accidents/vandalism?",
      "type": "story"
    },
    {
      "by": "shtubi",
      "descendants": 0,
      "id": 28290862,
      "score": 4,
      "text": "Hey, I am a DevOps engineer at a medium-sized company.<p>Our team is super busy and we have a lot on our plate. \nRecently we decided to see where we can improve our productivity.<p>One of our main responsibilities is to provide dev teams with different services they require (usually they open a ticket, sending a slack msg, etc…).<p>As part of our efforts to improve productivity, we recently decided to assemble the most common popular “services” provided to devs and automate them using Jenkins.<p>In addition, we allow devs to access Jenkin’s UI to spin up all kinds of jobs.<p>On one hand, it does allow devs to act on their own, on the other hand, I get a lot of backfires from different personas...<p>*Devs<p>* Why did this job fail?<p>* Devs send me messages on slack that they got lost between all the Jenkins jobs, and they don&#x27;t know which Jenkins Job is relevant for them. \n&quot;I forgot the identifier of the machine I created&quot;<p>* Devs make mistakes and deploy to the wrong environment.\n* Why did my dev environment get terminated?\n* &quot;Update me if you modify parameters&quot;\n* etc...<p>*Team lead<p>* Let’s add a manual approval for these jobs\n* Make sure we have an audit log for every dev operation\n* Make sure we are not hogging cloud resources thus going beyond the budget\n* The developer team leader asked BI about these Jenkins Jobs because it became critical for developers&#x27; day-to-day.\n* etc…<p>Jenkins seems pretty limited to allow these capabilities and I am afraid to create a tech debt and put too much pressure on Jenkins :)<p>Do you have any suggestions? How do you manage it within your company?<p>Thanks!",
      "time": 1629821867,
      "title": "What challenges did you face once you gave devs access to Jenkins jobs?",
      "type": "story"
    },
    {
      "by": "prirun",
      "descendants": 0,
      "id": 28290856,
      "score": 2,
      "text": "Last week I ordered some shoe insoles on Amazon.  I usually get these at the Dollar Store, and tried to buy them there, but there were out, as they often are.  They&#x27;re $2&#x2F;pair at DS.<p>I found some on Amazon, 3 pair for $6, so did a Subscribe &amp; Save for every 3 months.  It setup the delivery for November, which I didn&#x27;t notice.<p>Today I did notice that it was setup for November and changed it to September.  The price was $9+ but changed to $10+.  When I changed the delivery back to September, it was still $10+.  WTF?  I looked at the original order and it said $6.<p>IMO, if someone sets up a S&amp;S order and the price changes, the S&amp;S should automatically be suspended, an email sent, and the buyer has to re-enable the S&amp;S at the new price.<p>I don&#x27;t have many S&amp;S items, but I&#x27;ll be scrutinizing them more closely from now on.",
      "time": 1629821810,
      "title": "Amazon Subscribe and Save Price Change Gimmick",
      "type": "story"
    },
    {
      "by": "mikhael",
      "descendants": 0,
      "id": 28290850,
      "score": 1,
      "time": 1629821795,
      "title": "The Coming Collapse of the Taliban",
      "type": "story",
      "url": "https://thehill.com/opinion/international/569078-the-coming-collapse-of-the-taliban"
    },
    {
      "by": "dinesh1873",
      "descendants": 0,
      "id": 28290827,
      "score": 2,
      "time": 1629821726,
      "title": "Show HN: Go parser that converts(YAML,TOML,CSV,Excel) to JSON and creates a Gist",
      "type": "story",
      "url": "https://github.com/dineshsonachalam/gistify"
    },
    {
      "by": "RababYousuf",
      "descendants": 0,
      "id": 28290825,
      "score": 1,
      "time": 1629821721,
      "title": "Top Vulnerabilities Exploited to Hack Linux Systems",
      "type": "story",
      "url": "https://voiceofciso.com/top-vulnerabilities-exploited-to-hack-linux-systems/"
    }
  ]
}