{
  "stories": [
    {
      "by": "kome",
      "descendants": 0,
      "id": 32149548,
      "score": 1,
      "time": 1658225380,
      "title": "What Orbán Knows and His Enemies Don’t",
      "type": "story",
      "url": "https://jacobin.com/2018/03/viktor-orban-hungary-fidesz-authoritarian-opposition"
    },
    {
      "by": "iamnotarobotman",
      "descendants": 0,
      "id": 32149535,
      "score": 1,
      "time": 1658225239,
      "title": "Removed Apple Arcade Games Won't Be Playable Soon",
      "type": "story",
      "url": "https://9to5mac.com/2022/07/18/apple-arcade-leaving-soon-games/"
    },
    {
      "by": "mcp_",
      "descendants": 0,
      "id": 32149513,
      "score": 1,
      "time": 1658225036,
      "title": "Collection of Code for Flipper Zero",
      "type": "story",
      "url": "https://github.com/UberGuidoZ/Flipper"
    },
    {
      "by": "lyset",
      "descendants": 2,
      "id": 32149503,
      "kids": [
        32149536,
        32149571
      ],
      "score": 1,
      "time": 1658224941,
      "title": "Free as Beer Domains and DNS",
      "type": "story",
      "url": "https://notat.mataroa.blog/blog/free-as-beer-domains-and-dns-for-your-blog/"
    },
    {
      "by": "licedey",
      "descendants": 0,
      "id": 32149502,
      "score": 1,
      "text": "This app was born out of my own needs. I prepared for Microsoft Azure certification, but usually, it was on the go. I wanted to find an app that will help me to prepare for exams via my smartphone, but I didn&#x27;t find what I need in 2020. Then I decided to develop it myself and it looks like I am not alone with such a problem. Currently, Learn Azure has 50,000+ downloads for iOS and Android together and good feedback from users.<p>The app is absolutely free and without ads. I&#x27;ve added donation option only when I decided to fully dedicate myself for Learn Azure project. More about this compelled decision is here - <a href=\"https:&#x2F;&#x2F;learnazure.app&#x2F;supportus\" rel=\"nofollow\">https:&#x2F;&#x2F;learnazure.app&#x2F;supportus</a><p>There are a lot of to tell about this project. Will be glad to do this in thread.",
      "time": 1658224939,
      "title": "Show HN: LearnAzure.app: improve Azure skills and become certified professional",
      "type": "story",
      "url": "https://learnazure.app"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 32149475,
      "score": 1,
      "time": 1658224632,
      "title": "50 years later, the truth behind American Pie",
      "type": "story",
      "url": "https://www.theguardian.com/music/2022/jul/19/don-mclean-american-pie-documentary-the-day-the-music-died"
    },
    {
      "by": "wsgeorge",
      "descendants": 1,
      "id": 32149464,
      "kids": [
        32149542
      ],
      "score": 1,
      "text": "You can now follow and be followed, and there&#x27;s a default feed of suggested accounts with updates from places they&#x27;ve been, etc.<p>I just got notified that a review I left 5 years ago reached a high number of views. I took a little while to (finally) explore the other tabs on the app, and it seems they&#x27;ve been upping the social features of Google Maps.",
      "time": 1658224525,
      "title": "Ask HN: Is Google Maps Google's most successful social media app?",
      "type": "story"
    },
    {
      "by": "pcrh",
      "descendants": 0,
      "id": 32149455,
      "score": 1,
      "time": 1658224426,
      "title": "Aerospace charts a future without jet fuel",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-62120130"
    },
    {
      "by": "ashwwwin",
      "descendants": 0,
      "id": 32149441,
      "score": 1,
      "text": "Hey HN, I believe that easy proof of ownership is an unsolved problem that is one of the blockers towards mass adoption of NFTs. Walletsy is an exploration of my beliefs.<p>Walletsy makes proof of ownership easy and risk free. Get instantly verified in all your servers (that have Walletsy set up) in just a few seconds.<p>Server managers use Walletsy in order to gate their community and run raffles with just a few clicks.<p>Users just connect their Wallet and Discord to Walletsy once, and then no more headaches. They can also link their Twitter, add multiple Wallets and remove them.<p>Looking forward to the feedback.",
      "time": 1658224311,
      "title": "Show HN: Walletsy – Proof of ownership made easy",
      "type": "story",
      "url": "https://walletsy.io"
    },
    {
      "by": "xzen",
      "descendants": 0,
      "id": 32149420,
      "score": 1,
      "text": "Google is one of the big search engine. In Google.com you can find vulenrable websites. The most famous of which is the SQL bug. Most of the malicious hackers use this bug to seriously damage 13,000 websites every day, nearly a hundred of them are big and famous sites, including movie streaming sites that have subscriptions, bypassed with this method, or some of the websites that They store the data of the people of the world, they suffer from this bug. Hackers use these bugs to sell important data in the deep web, which is close to several million dollars, data that are vital and personal privacy of big people. Unfortunately, these websites do not have experimental penetration tests that will be hacked in the future and their vital information will be sold or given to people for free. No, I don&#x27;t know where our data goes, neither do you, we just know that they are not being used properly.",
      "time": 1658224072,
      "title": "1M website has SQL bug",
      "type": "story"
    }
  ]
}