{
  "stories": [
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 31565595,
      "score": 1,
      "time": 1653964654,
      "title": "How to Improve the Search for Aliens",
      "type": "story",
      "url": "https://www.economist.com/science-and-technology/2022/05/25/how-to-improve-the-search-for-aliens"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31565585,
      "score": 1,
      "time": 1653964509,
      "title": "New Solar Panel Design Uses Wasted Energy to Make Water from Air",
      "type": "story",
      "url": "https://www.cnet.com/home/energy-and-utilities/new-solar-panel-design-uses-wasted-energy-to-make-water-from-air/"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 31565584,
      "score": 1,
      "time": 1653964501,
      "title": "Docker Containers on the Desktop",
      "type": "story",
      "url": "https://blog.jessfraz.com/post/docker-containers-on-the-desktop/"
    },
    {
      "by": "teddykoker",
      "descendants": 0,
      "id": 31565575,
      "score": 1,
      "time": 1653964370,
      "title": "Optimism Shapes Reality",
      "type": "story",
      "url": "https://alexw.substack.com/p/optimism-shapes-reality"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 31565563,
      "score": 1,
      "time": 1653964242,
      "title": "Water and Power: A California Heist",
      "type": "story",
      "url": "https://www.imdb.com/title/tt6290202/"
    },
    {
      "by": "oneiric",
      "descendants": 0,
      "id": 31565529,
      "score": 1,
      "time": 1653963682,
      "title": "Con Feratu",
      "type": "story",
      "url": "https://cf.me/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31565527,
      "score": 1,
      "time": 1653963676,
      "title": "In the Cockpit of “Top Gun: Maverick” with Blue Angel Pilot, Frank Weisser",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=SOWw_ZFweAk"
    },
    {
      "by": "RoseBuckler",
      "descendants": 0,
      "id": 31565514,
      "score": 3,
      "text": "I&#x27;ve been programming on and off since the age of 16. Unfortunately, I have never been a rockstar programmer. I&#x27;ve always pieced code together from multiple sources to create programs but I&#x27;ve always failed to come up with a solution from scratch of my own and provide any value. I&#x27;ve always wondered how other smart people are able to come up with libraries, services and various solutions from scratch. I&#x27;ve devised countless ideas only to never execute them for various reasons or get started with them only to never fully complete them and see it all the way through.<p>I&#x27;ve already wasted my entire teens and 20s, current 28 years old, working as a software engineer (Full-Stack) at a startup for ~4 years. I&#x27;ve been feeling like a loser and not good enough for this career even though I am a sole developer for Mobile and Web platforms at this startup in a very small team. I&#x27;ve put in countless hours of work every day (70-90 hrs), being on-call almost 24&#x2F;7, sometimes for straight 7 days for months despite only getting paid on a salary basis on 40 hr work weeks; being a loner helps with working long hours. My salary also hasn&#x27;t increased much, and feel like I&#x27;m severely underpaid based on the # of years of experience but I struggle with evaluating my value in the market to determine my worth. I assumed working hard would pay off but that hasn&#x27;t been the case at all; I truly believe I&#x27;ve been doing the opposite of &quot;Work Smart, Not Hard&quot;. I&#x27;ve been trying to get back to learning DS and Algos so I can apply to places but I struggle with LeetCode, which is making me feel like even a bigger loser for not being able to solve problems.<p>I&#x27;m stuck in a rut, wanting to better my skills and earn a good amount of money but unable to concentrate, riddled with brain fog, and unsure of my future. My self-confidence and self-esteem are taking a hit. I am terrible at networking, so I don&#x27;t have others to reach out to for tips and advice, hence I&#x27;m turning to HN. I apologize if this isn&#x27;t the place for a post like this. How can I turn my directionless life around and find satisfaction with my career?",
      "time": 1653963528,
      "title": "I'm a loser, burnt-out, directionless but want to turn it around",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31565513,
      "score": 1,
      "time": 1653963498,
      "title": "China’s top court calls for blockchain to record vast number of transactions",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/31/china_supreme_court_blockchain_opinion/"
    },
    {
      "by": "goindeep",
      "descendants": 1,
      "id": 31565443,
      "kids": [
        31565530
      ],
      "score": 4,
      "time": 1653962396,
      "title": "Satoshi Nakamoto Is the Deep State",
      "type": "story",
      "url": "https://cryptofireside.com/satoshi-nakamoto-is-the-deep-state-78cc2a38f90d?gi=183492c0ac68"
    }
  ]
}