{
  "stories": [
    {
      "by": "swamp40",
      "descendants": 0,
      "id": 30677645,
      "score": 1,
      "time": 1647288878,
      "title": "Ukraine halts half of world's neon output for chips, clouding outlook",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/11/tech/ukraine-neon-chips/index.html"
    },
    {
      "by": "gnicholas",
      "descendants": 0,
      "id": 30677623,
      "score": 1,
      "text": "Like many HNers, I run a software business with a recurring subscription. The vast majority of my B2C customers are on my monthly plan, and only a small percent are on my annual plan, which is discounted.<p>What should I be thinking about when considering the annual discount? Is there a &#x27;right&#x27; number that I should be targeting?<p>So far, I&#x27;ve considered that the fees I pay are lower for annual customers, and the risk of mid-year churn is somewhat lower. Are there other relevant considerations?<p>I understand why new customers would sign up for a monthly plan, to try it out (there&#x27;s also a 2-week free trial, before having to pay). Should I be contacting customers who are still with me after a couple months and encouraging them to switch to annual subscriptions? Or should I not really care?",
      "time": 1647288791,
      "title": "Ask HN: What percent of my subscribers should be monthly vs. annual?",
      "type": "story"
    },
    {
      "by": "doomlaser",
      "descendants": 0,
      "id": 30677605,
      "score": 1,
      "time": 1647288706,
      "title": "Oliver Stone watched Dr. Strangelove with Putin in 2017, gifted him the DVD",
      "type": "story",
      "url": "https://twitter.com/Doomlaser/status/1503455755227258895"
    },
    {
      "by": "Ambolia",
      "descendants": 0,
      "id": 30677602,
      "score": 1,
      "time": 1647288687,
      "title": "Fears three British ex-special forces troops killed by Russian attack in Ukraine",
      "type": "story",
      "url": "https://www.independent.co.uk/news/world/europe/russia-attack-british-troops-feared-dead-b2035555.html"
    },
    {
      "by": "marc__1",
      "descendants": 0,
      "id": 30677588,
      "score": 1,
      "time": 1647288647,
      "title": "Gitlab Reports FY 2022 Results",
      "type": "story",
      "url": "https://ir.gitlab.com/news-releases/news-release-details/gitlab-reports-fourth-quarter-and-full-year-fiscal-2022"
    },
    {
      "by": "unilynx",
      "descendants": 0,
      "id": 30677586,
      "score": 1,
      "time": 1647288639,
      "title": "Curl User Survey 2021",
      "type": "story",
      "url": "https://daniel.haxx.se/blog/2021/07/05/curl-user-survey-2021/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30677560,
      "kids": [
        30677648
      ],
      "score": 4,
      "time": 1647288531,
      "title": "Russia is trying to Install pro-Kremlin Officials into occupied-Cities",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_7094bf11b48adf42b7dcb6f4726f7760"
    },
    {
      "by": "Ajs1",
      "descendants": 1,
      "id": 30677556,
      "kids": [
        30677561
      ],
      "score": 2,
      "text": "https:&#x2F;&#x2F;www.zebrium.com&#x2F;blog&#x2F;how-cisco-uses-zebrium-ml-to-analyze-logs-for-root-cause<p>Disclosure: I’m one of the co-founders behind the ML mentioned here. However the results in the link above were generated independently by Cisco.<p>There have been a number of write-ups and papers evaluating ML for logs over the last few years – by academics, engineers, and observability vendors. But these results have typically been limited to synthetic data sets (lab generated), or very limited in scope (a handful of real world data sets).<p>The Automation and Innovation team at Cisco just published test results from a study applying ML to a large corpus of actual software incidents. The goal was to test the efficacy of the ML in picking out root cause indicators from logs that spanned the duration of the problems.<p>Each problem’s log data set was run through the Zebrium ML engine, AND was also independently root caused by an engineer with expertise in that software. To be counted as a success, the summary ML output had to contain the same log event(s) as those that were picked out by the engineer during the manual analysis. Further, each report had to be concise and clear enough that the evaluating engineer found it to be a net advantage (as compared with their familiar workflow of searching through logs).<p>The underlying software products were diverse in nature – Webex client (collaboration), DNA Center (networking), ISE (security), and UCS (infrastructure).<p>Each data set was a few GB in size (10s of millions of log events), spanned anywhere from a dozen to hundreds of log types (hence the challenge of correlating across logs), and typically contained a few days of logs. An engineer troubleshooting a software problem typically uses this history to understand the baseline of normal events, as well as spot any outlier events that might be clues to the root cause. The unsupervised ML was not pretrained – it used the same history to train on as was available in the log datasets.<p>Given the sensitivity of the data sets, the raw data is not published, but more details are expected in a follow up white paper. In any case, the results showed an accuracy rate of 95.8% for using ML for logs.",
      "time": 1647288518,
      "title": "ML for logs – results from a large scale, real world study",
      "type": "story"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 30677553,
      "score": 2,
      "time": 1647288507,
      "title": "WikiLeaks Founder Julian Assange Denied Permission To Appeal Extradition",
      "type": "story",
      "url": "https://news.slashdot.org/story/22/03/14/203232/wikileaks-founder-julian-assange-denied-permission-to-appeal-extradition"
    },
    {
      "by": "agronaut",
      "descendants": 0,
      "id": 30677537,
      "score": 2,
      "time": 1647288437,
      "title": "Vibe, Mood, Energy",
      "type": "story",
      "url": "https://www.thedriftmag.com/vibe-mood-energy/"
    }
  ]
}