{
  "stories": [
    {
      "by": "Misiek_k",
      "descendants": 0,
      "id": 31532592,
      "score": 1,
      "time": 1653674031,
      "title": "How the MVPs of the billion dollar businesses got their first 1k customers",
      "type": "story",
      "url": "https://kickstartsidehustle.com/a-billion-dollar-mvp/"
    },
    {
      "by": "lolpython",
      "descendants": 0,
      "id": 31532498,
      "score": 1,
      "time": 1653673638,
      "title": "On removing APIs – Linux status bar, GNOME system tray and ElementaryOS",
      "type": "story",
      "url": "https://blog.console.dev/on-removing-apis-status-appindicators-in-gnome/"
    },
    {
      "by": "outworlder",
      "descendants": 0,
      "id": 31532493,
      "score": 1,
      "text": "Amazon is sending the following message to cloudcam owners.<p>To our valued Cloud Cam customer,<p>With your help over the last five years, Cloud Cam has served as a reliable indoor security camera and a hub for Amazon Key-compatible smart locks that work with Alexa. As the number of Alexa smart home devices continues to grow, we are focusing efforts on Ring, Blink, and other technologies that make your home smarter and simplify your everyday routines. Therefore, we have decided to no longer continue support for Amazon Cloud Cam and its companion apps.<p>What this means for you: \nOn December 2, 2022, you will no longer be able to use your Cloud Cam device or its companion apps. Until then, you will be able to download any video recordings if available. All video history will be deleted on December 2, 2022.<p>What’s next:\nTo thank you for your continuous support and feedback, we would like to offer you a complimentary Blink Mini and one-year Blink Subscription Plus Plan. Blink Mini offers customers an easy-to-use, indoor security camera experience with 1080p HD video, 2.4 GHz Wifi connectivity, night vision, motion detection, two-way audio, and works with Alexa. The Blink Subscription Plus Plan provides extra features and benefits for Blink devices – learn more https:&#x2F;&#x2F;support.blinkforhome.com&#x2F;en_US&#x2F;subscriptions&#x2F;purchasing-a-blink-subscription-plan-through-amazon#plans.<p>Prior to December 2, 2022, you will receive detailed instructions on how to redeem your free Blink Mini and Blink Subscription Plus Plan via email.<p>Downloading and deleting your video recordings:\nTo back up your videos from Cloud Cam app, go to Recorded Clips in the top right menu. Click on each individual video and click on the Download icon on the right side to save the video or click on the Trash icon next to it to delete the video. You could also delete all videos on Amazon Manage Your Content and Devices at any time.<p>If you have any questions about this, please reach out to customer service for additional information.<p>Sincerely,\nThe Amazon Cloud Cam team",
      "time": 1653673632,
      "title": "Amazon Cloud Cam end of service",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31532489,
      "score": 2,
      "time": 1653673582,
      "title": "A City Fights Back Against Heavyweight Cars",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-05-26/a-new-way-to-curb-the-rise-of-oversized-pickups-and-suvs"
    },
    {
      "by": "ckardat123",
      "descendants": 0,
      "id": 31532461,
      "score": 1,
      "time": 1653673414,
      "title": "Show HN: Python package which allows easy access to alternative investment data",
      "type": "story",
      "url": "https://github.com/Quiver-Quantitative/python-api"
    },
    {
      "by": "AlanZucconi",
      "descendants": 0,
      "id": 31532413,
      "score": 1,
      "time": 1653673182,
      "title": "A Detailed Explanation of the World Generation in Minecraft",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=YyVAaJqYAfE"
    },
    {
      "by": "RobertRoberts",
      "descendants": 1,
      "id": 31532410,
      "kids": [
        31532470
      ],
      "score": 1,
      "text": "Where I work there are discussions and planning starting for some spaces to change from cubicles to &quot;something modern&quot; for the work space.<p>But is there a benefit to having cubicles that an open workspaces loses out on?<p>Has anyone changed from a cubicle space to something else and there were regrets?<p>Any suggestions on updating office floor&#x2F;work space?",
      "time": 1653673170,
      "title": "Ask HN: Are there any benefits to cubicles?",
      "type": "story"
    },
    {
      "by": "silentsea90",
      "descendants": 0,
      "id": 31532391,
      "score": 1,
      "text": "Hi! I am a long time backend engineer (~7 years now). I recently joined a startup where I have come to work on heavy frontend changes. I am a noob at frontend changes and my state switches from despondency to regret at having left my big tech job, and at times brief hope when I make some progress before I inevitably get stuck.<p>For people who have dabbled in both, is it smart to endure and gain competency in frontend (react, redux etc) or should I try to stick with backend with the occasional frontend task that keeps me growing but not despondent hopefully. Ultimately, I want to grow in the management track whenever I get there.",
      "time": 1653673118,
      "title": "Stay in backend or build some frontend competency?",
      "type": "story"
    },
    {
      "by": "tomcam",
      "descendants": 0,
      "id": 31532369,
      "score": 1,
      "time": 1653673005,
      "title": "IV infusions with lidocaine may relieve chronic migraines",
      "type": "story",
      "url": "https://www.upi.com/Health_News/2022/05/26/lidocaine-infusion-migraine/7131653580460/"
    },
    {
      "by": "kwent",
      "descendants": 0,
      "id": 31532316,
      "score": 2,
      "time": 1653672714,
      "title": "Tips If You’re the First SRE Hire by Instacart's First SRE",
      "type": "story",
      "url": "https://rootly.com/blog/5-tips-if-you-re-the-1st-sre-hire-by-instacart-s-first-sre"
    }
  ]
}