{
  "stories": [
    {
      "by": "boa00",
      "descendants": 0,
      "id": 30513030,
      "score": 1,
      "text": "I am a fourth year student in Eastern Europe, studying Math and Economics. This is the final year, and I have 3-4 months till graduation. At the same time, I&#x27;ve been working full time as a Data Scientist at a big telecom company for the last several months. And I think it&#x27;s not for me<p>The project here is interesting, but I realize that I do not like any of the &quot;real&quot; DS tasks, e.g. anything that involves actually building a model from the statistical standpoint. Now, I write a lot of SQL: the company has hundreds of billions of calling records, so you have to really think about the queries you write, and even if they are quite optimized I still sit here for a long time waiting for the response. And even that is more exciting than any of the statistical tasks I face<p>Little background: I started coding when I was 16, back then I built an iOS app using Swift to help me learn English vocabulary. After that, I&#x27;ve been coding as a hobby on the side during my studies. I liked mathematics and statistics as a freshman, and during my second year found out about Data Science. Given my background, I thought it would be a perfect fit for me. I built a few pet-projects using ML during my third year, and started applying. They impressed one of the employers (big bank), so these projects basically landed me my first internship, which led me to the current job<p>The thing I like the most is actually building stuff with my hands, and I think SWE is a better fit here. I guess this is the reason I never liked Kaggle. Also, most of my internship I spent building a simple web interface for the existing model (mostly back, like connecting to DB, transforming data, deploying to Linux, etc), which was 100% SWE task and I liked it. So there were hints along the way...<p>How would you recommend me to switch to SWE the fastest way possible?<p>I&#x27;m quite depressed now because I&#x27;ve put enormous effort into switching to DS: I applied to 80 job postings before I got my first internship, and I feel this is for nothing now. Also, my university and faculty considered to be really difficult, so studying DS on the side was brutal.<p>Besides, I live in Russia and want to relocate (for obv reasons), and feel like it&#x27;s easier with SWE skills (especially given that I know English and in the process of receiving EU passport). This puts an enormous time pressure on me given how the things are playing out now...<p>I would appreciate any opinion&#x2F;advice!",
      "time": 1646135609,
      "title": "Ask HN: I realise Data Science is not for me and feel depressed",
      "type": "story"
    },
    {
      "by": "janedoegrrr",
      "descendants": 0,
      "id": 30513010,
      "score": 2,
      "time": 1646135455,
      "title": "Best GPU for Deep Learning in 2022 (so far)",
      "type": "story",
      "url": "https://lambdalabs.com/blog/best-gpu-2022-sofar/"
    },
    {
      "by": "eimrine",
      "descendants": 0,
      "id": 30513005,
      "score": 2,
      "text": "I have a strong opinion that this war has an aim to set a border between Russia and NATO on Carpathian Mountains. The only way to do this is to wipe down all the Ukrainian nation (except women, children and maybe some unarmed men). The fastest and the most bloodless way to do so is to drop some bombs on Kyiv and capture it ASAP with infantry from the Chornobyl direction. So, what do you think happens next after the atomic explosion in the capital of Ukraine?<p>Sorry for asking this here on IT website, just I can not ask this question on any Ukrainian website without getting banned in order to flag-waving censorship.",
      "time": 1646135427,
      "title": "Any consequences for Russians after atomic bombing of Kyiv?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30512964,
      "score": 1,
      "time": 1646135137,
      "title": "Snapdragon X70",
      "type": "story",
      "url": "https://www.qualcomm.com/news/releases/2022/02/28/new-snapdragon-x70-modem-rf-harnesses-worlds-first-5g-ai-processor-industry"
    },
    {
      "by": "pat-jay",
      "descendants": 0,
      "id": 30512958,
      "score": 1,
      "time": 1646135109,
      "title": "Injecting fairness into machine-learning models",
      "type": "story",
      "url": "https://news.mit.edu/2022/unbias-machine-learning-0301"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 30512943,
      "score": 1,
      "time": 1646134977,
      "title": "Arrest Made, Thanks to a Goat",
      "type": "story",
      "url": "https://martinsvillebulletin.com/news/local/arrest-made-thanks-to-a-goat/article_37bb4e88-932d-11ec-b143-3fdc39287e52.html"
    },
    {
      "by": "netmonk",
      "descendants": 0,
      "id": 30512916,
      "score": 2,
      "time": 1646134819,
      "title": "How NATO is promoting democratia all over the world",
      "type": "story",
      "url": "https://medium.com/insurge-intelligence/former-turkish-counter-terror-chief-exposes-governments-support-for-isis-d12238698f52"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30512888,
      "score": 1,
      "time": 1646134606,
      "title": "Huawei gets into the e-reader game with a combo note-taking device",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/28/huawei-gets-into-the-e-reader-game-with-a-combo-note-taking-device/"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 30512873,
      "score": 1,
      "time": 1646134526,
      "title": "Russia still denies the Holodomor was ‘genocide’",
      "type": "story",
      "url": "https://www.acton.org/publications/transatlantic/2017/11/27/russia-still-denies-holodomor-was-genocide"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30512864,
      "score": 1,
      "time": 1646134433,
      "title": "Swim Without Getting Tired",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=F7yP2bcoRgM"
    }
  ]
}