{
  "stories": [
    {
      "by": "andsoitis",
      "descendants": 0,
      "id": 32208211,
      "score": 1,
      "time": 1658615551,
      "title": "Favorite Quotes and Excerpts",
      "type": "story",
      "url": "https://shuvomoy.github.io/blogs/posts/Quotes-and-excerpts/"
    },
    {
      "by": "liberia",
      "descendants": 0,
      "id": 32208204,
      "score": 1,
      "time": 1658615509,
      "title": "Twitter Vulnerability Exposes Data from 5.4M Accounts",
      "type": "story",
      "url": "https://restoreprivacy.com/twitter-vulnerability-exposes-5-million-accounts/"
    },
    {
      "by": "atombender",
      "descendants": 0,
      "id": 32208191,
      "score": 1,
      "time": 1658615430,
      "title": "Puter, a Desktop Environment in the Browser",
      "type": "story",
      "url": "https://puter.com/"
    },
    {
      "by": "hui-zheng",
      "descendants": 0,
      "id": 32208170,
      "score": 1,
      "text": "Both Facebook and Craigslist automatically censors any rental listing with a gender&#x2F;sex keyword.<p>I am not even allowed to describe the sex of the other tenant who is already living in the suite.  It&#x27;s a machine algorithm block, they don&#x27;t even need other users to flag the posting. It&#x27;s an automatically ban.<p>Does any person think the wording below is prohibitive or discriminating?<p>&gt; We are renting out one room in a 2-bedroom basement suite. The suite has two rooms. One room is already rented by a university <i>male</i> student.\nWe are looking for a responsible and respectful tenant to rent the other room. This is ideal for a student or a young professional individual.<p>I confirm that the offensive word above is <i>male</i>. Once I remove it. the posting is ok.<p>My question is what algorithm Facebook and Craigslist use to flag and block posting. what&#x27;s the reason that they would flag a posting like this?",
      "time": 1658615253,
      "title": "What algorithm Facebook and Craigslist use to flag posting?",
      "type": "story"
    },
    {
      "by": "bmare",
      "descendants": 0,
      "id": 32208147,
      "score": 1,
      "text": "I&#x27;m working on a small SaaS site, both as an earnest attempt to create some income for myself and as an attempt to teach myself programming. At it&#x27;s core it involves scraping data from various places on the web, combining it, cleaning it, and laying it out in a useful way. I have made progress on my own, but I know I would make more progress if I had someone with experience helping me out. I don&#x27;t have the capital to hire someone to do it, nor do I want to just hire someone. The point is that even if this business doesn&#x27;t succeed, I will come away with a lot more knowledge on web development, site administration, and scraping and cleaning data. As an alternative to hiring someone to build the site, I&#x27;m wondering about hiring a tutor to help me move forward faster. It seems to me that there would be ethical and business problems that arise from this. Wouldn&#x27;t my tutor in a way be an employee? How could I protect the business idea while getting help from the tutor? I suppose one alternative would be signing a non-disclosure agreement and offering a certain amount of equity or revenue sharing. I am not out here to exploit someone else&#x27;s work and pass it off as my own. I want to build the service, run it, and maintain it, but I know that I would benefit from having more experienced eyes guiding me in my work. I&#x27;m hoping someone on here could offer some advice, ideas, or alternatives.",
      "time": 1658615073,
      "title": "Receiving Tutoring on a For-Profit Project",
      "type": "story"
    },
    {
      "by": "jgamman",
      "descendants": 0,
      "id": 32208146,
      "score": 1,
      "time": 1658615072,
      "title": "MecanoChemistry: H2 Gas Storage in Solids",
      "type": "story",
      "url": "https://newatlas.com/energy/mechanochemical-breakthrough-unlocks-cheap-safe-powdered-hydrogen/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32208144,
      "score": 1,
      "time": 1658615055,
      "title": "Solaris Linkers and Libraries Guide",
      "type": "story",
      "url": "https://docs.oracle.com/cd/E37838_01/html/E36783/index.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32208130,
      "score": 1,
      "time": 1658614903,
      "title": "Industrialization, Health and Human Welfare",
      "type": "story",
      "url": "https://blogs.lse.ac.uk/economichistory/2022/01/18/industrialization-health-and-human-welfare/"
    },
    {
      "by": "tusslewake",
      "descendants": 0,
      "id": 32208127,
      "score": 1,
      "text": "Here&#x27;s an idea for a site&#x2F;service that I would love to use. This must have been tried before, but I can&#x27;t find a lot of examples:<p>A matching&#x2F;partnering service for intellectuals, or people with those interests. For example, let&#x27;s say I want to read a big&#x2F;hard&#x2F;long book, on any topic, with someone else. I could create a pitch for some reading project or course of study: create a post where I discuss what I want to get out of it, disclose any prior knowledge or training, etc..--then let anyone who&#x27;s interested propose to read&#x2F;study&#x2F;research with me.<p>I know book clubs are a thing. I found https:&#x2F;&#x2F;bookworm.club, a reader matching service posted here[1] less than a year ago, but what I am thinking about is a little different. It would be broader matchmaking service than just book reading, applicable to any project involving committed study or research. Maybe I&#x27;m good at math, and I&#x27;m looking for someone who&#x27;s interested in doing a self-guided intro to quantum mechanics. Or I&#x27;m interested in learning more about early US colonial history, and I want someone to help me pick the five most important books on King Philip&#x27;s War to skim and synthesize. Or I have an idea for a robotics hobby project, and I want to find someone with a technical background that&#x27;s complementary to my own. Or I&#x27;ve always gotten stuck on the fourth book of Proust&#x27;s <i>In Search of Lost Time</i>, and I want to find someone to go through it with me and discuss every two weeks. Anything--you define the terms.<p>I know formal classes and education are an approximate solution here, but I think that a person&#x27;s commitment and interest are often higher in cases of self-study, because your motivation comes from being clear with yourself about what you want to get out of your efforts. Self-studiers are a special group. There are also a lot more niche interests than formal classes.<p>My guess is there are actually a good number of smart people who want to do these things, but they give up because the chance of finding a suitable partner is low. The people with the same interests are often irregularly distributed. and feel isolated. A service that would work at internet scale, especially with more people willing to do this over Zoom, would help to match a lot of these ardent intellectual loners on the long tail of interests.<p>My initial sense is that a good match between prospective partners would be hard to discern algorithmically, since so much about intellectual fit depends on the nuances of what they want to do. So the actual matching would involve pitching, conversation back and forth, negotiation, etc.<p>Anyways, can someone point me to previous efforts in this area? General thoughts are of course welcome too.<p>[1]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29230283",
      "time": 1658614857,
      "title": "Ask HN: A matching site for intellectual/study partners?",
      "type": "story"
    },
    {
      "by": "krn",
      "descendants": 0,
      "id": 32208120,
      "score": 1,
      "time": 1658614778,
      "title": "OCR in the Browser Using Tensorflow.js",
      "type": "story",
      "url": "https://blog.tensorflow.org/2022/06/ocr-in-browser-using-tensorflowjs.html"
    }
  ]
}