{
  "stories": [
    {
      "by": "ystad",
      "descendants": 0,
      "id": 30071978,
      "score": 1,
      "time": 1643120054,
      "title": "Meta Aims to Build the World’s Fastest AI SupercomputerThe",
      "type": "story",
      "url": "https://spectrum.ieee.org/meta-ai-supercomputer"
    },
    {
      "by": "ArtWomb",
      "descendants": 0,
      "id": 30071971,
      "score": 1,
      "time": 1643120026,
      "title": "Shader Tips and Tricks",
      "type": "story",
      "url": "https://interplayoflight.wordpress.com/2022/01/22/shader-tips-and-tricks/"
    },
    {
      "by": "snowman-yelling",
      "descendants": 0,
      "id": 30071956,
      "score": 1,
      "text": "Hi,<p>I have a coworker who I have been finding increasingly difficult to work with.<p>I will give some more details to try to explain the difficulties, but I&#x27;m trying to avoid being too specific. My coworker is clearly a skilled engineer, but many of his solutions just come across as too complex for no good reason. It&#x27;s things like taking object-oriented programming to an extreme by adding excessive abstraction. It goes against the grain of what abstraction is trying to achieve because so much work goes into making an implementation fit a desired pattern that it&#x27;s actually more difficult to expand the feature set in the future. Additionally, there are many layers of abstraction with interfaces requiring multiple generics to get a working implementation. It makes for an inter-tangled web that is hard to grok, especially for junior engineers.<p>I&#x27;ve tried to point these things out when reviewing the code, but it usually just turns into an argument where it is explained to me that there simply isn&#x27;t a better way to implement it.<p>It even happens when the code I or my coworkers write is reviewed by my colleague. There are very nitty comments about how the solution we present strays from how they would have done it and there is extreme inflexibility on compromising before we can get the change approved by them.<p>I&#x27;ve discussed with some coworkers and they all feel the same way and it&#x27;s basically a common pattern on our team that we approve code my coworker writes without being too critical because we know the argument that will follow if we push back. Team members are also getting anyone but my coworker to review their code because they don&#x27;t want to deal with addressing comments that don&#x27;t add any actual value to the code.<p>This is hurting the engineering quality of my team and it&#x27;s something that I know makes my coworkers and I strongly consider opportunities elsewhere because we just don&#x27;t want to deal with it.<p>What suggestions do HN users have for addressing issues like this in the workplace?",
      "time": 1643119949,
      "title": "How to Work with a Difficult Coworker?",
      "type": "story"
    },
    {
      "by": "nmehra11",
      "descendants": 1,
      "id": 30071942,
      "kids": [
        30071965
      ],
      "score": 1,
      "time": 1643119872,
      "title": "Quality Questions – Get Life Changing Questions in Your Inbox Every Week",
      "type": "story",
      "url": "https://qualityquestions.co/"
    },
    {
      "by": "plemaster",
      "descendants": 1,
      "id": 30071936,
      "kids": [
        30071937
      ],
      "score": 1,
      "time": 1643119854,
      "title": "I took a 90% pay cut, here’s why you should too",
      "type": "story",
      "url": "https://lemaster.io/i-took-a-90-pay-cut-heres-why-you-should-too/"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 30071919,
      "score": 1,
      "time": 1643119769,
      "title": "Reimagining Chess with AlphaZero",
      "type": "story",
      "url": "https://cacm.acm.org/magazines/2022/2/258230-reimagining-chess-with-alphazero/fulltext"
    },
    {
      "by": "rognjen",
      "descendants": 0,
      "id": 30071915,
      "score": 1,
      "time": 1643119740,
      "title": "Replacing Google Analytics with Just GoAccess",
      "type": "story",
      "url": "https://ognjen.io/replacing-google-analytics-with-goaccess/"
    },
    {
      "by": "tristan-rhodes",
      "descendants": 0,
      "id": 30071891,
      "score": 1,
      "time": 1643119579,
      "title": "Show HN: Building a basic multi language parser from scratch in C#",
      "type": "story",
      "url": "https://github.com/TristanRhodes/TextProcessing"
    },
    {
      "by": "throw1234651234",
      "descendants": 0,
      "id": 30071875,
      "score": 1,
      "text": "For a while, we had news of Thiel, De Gray, Alphabet etc looking at blood swaps, cryonic preservation, free radicals, etc. There were also trends around ice baths, low calorie diets, etc. Did anything ever pan out? Is anyone still doing serious research?",
      "time": 1643119470,
      "title": "Ask HN: How Are Life Extension Efforts Going?",
      "type": "story"
    },
    {
      "by": "derekni",
      "descendants": 0,
      "id": 30071874,
      "score": 1,
      "text": "Hey HN!<p>As a CS student who has trouble staying focused while working, I made a Chrome extension that gamifies productivity by the minute, using a Pomodoro-like timer.<p>- Earn a mint for every minute worked (and block sites like Facebook, Youtube, and&#x2F;or Hacker News(?) while working)\n- Earn mints for completing todos from a personal todo list\n- Spend mints on rewards like watching TV or treating yourself to dining out<p>I hope this can help others stay productive and would love feedback!",
      "time": 1643119465,
      "title": "Show HN: Chrome extension that gamifies productivity by the minute",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/minto/hcgkjlalkeaekjkelpilagbjcengeebl"
    }
  ]
}