{
  "stories": [
    {
      "by": "raimue",
      "descendants": 0,
      "id": 28353313,
      "score": 1,
      "time": 1630306445,
      "title": "OpenSSH: After years of forewarning, disable RSA/SHA-1",
      "type": "story",
      "url": "https://github.com/openssh/openssh-portable/commit/234475025"
    },
    {
      "by": "bornelsewhere",
      "descendants": 0,
      "id": 28353289,
      "score": 1,
      "time": 1630306004,
      "title": "Stanford researchers make rechargeable batteries that store 6x more charge",
      "type": "story",
      "url": "https://news.stanford.edu/2021/08/25/researchers-make-alkali-metal-chlorine-batteries-rechargeable/"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 28353286,
      "score": 1,
      "time": 1630305981,
      "title": "Sodium over lithium: The low-cost alternative to Li-ion",
      "type": "story",
      "url": "https://www.electrive.com/2021/08/23/sodium-over-lithium-the-low-cost-alternative-to-li-ion-batteries/"
    },
    {
      "by": "ref1234",
      "descendants": 1,
      "id": 28353261,
      "kids": [
        28353304
      ],
      "score": 3,
      "text": "Hell HN,<p>This is so uncomfortable to me so I decided to do two things: The first is to create a new account so no shame in the future. The second is to accept the problem that I have.<p>I&#x27;ve been in a state of denial the entire decade. That was almost ten years ago when I made a decision to flee my country because of the civil war. Since then, things have changed so much and so deep. I am not going to explain the psychological effect. It&#x27;s enough to see the news to know what Afghans are going through. It&#x27;s ugly. Some of us - the nation of refugees -  are lucky to start a new life. Others, like me, are stuck between two worlds. You are not settled in a new country, you can&#x27;t go back and you can&#x27;t establish a new life. So you become clearly, undocumented in a third country. An undocumented person has no right. Not even the right to work. You are allowed to make a living basically in the black market. You can live, you can&#x27;t grow and you cant build a career. With a lot of what can you do and what can&#x27;t, I had several jobs. A teacher, a ghostwriter, an interpreter, along with the thing that I love: programming. Since March 2020 I&#x27;ve been unemployed. Covid came and hit me hard, financially.<p>Job hunting is good until you reveal who you are. I got rejected multiple times because of my nationality. And then the US decided to impose sanctions that affect the whole nation regardless of your status.<p>Of course, I have another plan. I was working hard on JavaScript, so hard that I decided to launch my own product. And I did it, two months ago I launched a software product. What a nice thing to do, except, you need a marketing plan, some kind of fund (obviously), and time to make your product usable in the production. The bottom line is I feel I am living in a world of illusion, I know my limitations now. Working hard is not enough, make your bed in the morning wouldn&#x27;t improve my life.<p>I am not sorry though, I did what I did. But I have come to the point where I have to make a decision. What should I do? I can&#x27;t work normally since I am undocumented. My resume is not fit (admit it no no one hires people like me). And I feel like I have to be patient and wait, maybe my product will improve and boom becomes a success story but the clock is ticking and I have to make a decision.<p>If you are 34, do you wait? Or change your path and accept your destiny and find anything that generates income and stop chasing the clouds. If you are in a situation like this, what would you do?",
      "time": 1630305404,
      "title": "Ask HN: I am 34 years old refugee how Can I find a job",
      "type": "story"
    },
    {
      "by": "robin_reala",
      "descendants": 0,
      "id": 28353232,
      "score": 1,
      "time": 1630304759,
      "title": "Sustainable scotch: Hebridean distillery aims for net zero whisky",
      "type": "story",
      "url": "https://www.theguardian.com/uk-news/2021/aug/30/sustainable-scotch-hebridean-distillery-aims-for-net-zero-whisky"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 28353227,
      "score": 1,
      "time": 1630304686,
      "title": "Experimental Confirmation of the Fundamental Principle of Wave-Particle Duality",
      "type": "story",
      "url": "https://scitechdaily.com/experimental-confirmation-of-the-fundamental-principle-of-wave-particle-duality/"
    },
    {
      "by": "chegra",
      "descendants": 0,
      "id": 28353190,
      "score": 3,
      "time": 1630304129,
      "title": "Summary: Take a nap Change your life by Sara C. Mednick, PhD",
      "type": "story",
      "url": "https://www.chestergrant.com/summary-take-a-nap-change-your-life-by-sara-c-mednick-ph-dot-d"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28353178,
      "score": 1,
      "time": 1630303861,
      "title": "Into the Indies – Spiderweb Software",
      "type": "story",
      "url": "https://indiegamepicks.wordpress.com/2021/08/28/into-the-indies-spiderweb-software/"
    },
    {
      "by": "tekkertje",
      "descendants": 0,
      "id": 28353173,
      "score": 1,
      "time": 1630303828,
      "title": "Developing a North Star product experience (2020)",
      "type": "story",
      "url": "https://dropbox.design/article/developing-a-north-star-product-experience"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 28353162,
      "score": 1,
      "time": 1630303737,
      "title": "Changes in BMI Among Children and Adolescents During COVID-19 Pandemic",
      "type": "story",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/2783690"
    }
  ]
}