{
  "stories": [
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31290072,
      "score": 1,
      "time": 1651874895,
      "title": "Top Best Programming Languages",
      "type": "story",
      "url": "https://catonmat.net/5-best-programming-languages"
    },
    {
      "by": "zoltano",
      "descendants": 0,
      "id": 31290067,
      "score": 1,
      "time": 1651874853,
      "title": "Temporal UI v2 Is Now in Public Beta",
      "type": "story",
      "url": "https://docs.temporal.io/blog/temporal-ui-beta/"
    },
    {
      "by": "dane-pgp",
      "descendants": 0,
      "id": 31290056,
      "parts": [
        31290057,
        31290058,
        31290059,
        31290060
      ],
      "score": 2,
      "text": "With the US supreme court struggling to keep a consistent view of which constitutional rights really exist, perhaps it is time for the people to clarify what the constitution means (or what it should say).<p>I know that in the current political climate, getting the major parties to agree to anything seems impossible, let alone something as important as the foundational law of the whole country, but sometimes it takes a jolt to get a system out of a local minimum towards a lower energy state.<p>So, with historic understandings of the right to privacy and personal liberty seemingly under threat, an obvious focus for an amendment would be to enumerate some of the unenumerated rights that courts have acknowledged.  However, in order to make the resultant set of rights acceptable to as many people as possible, there would have to be some compromises.<p>As a first approximation, then, consider the following principles that could form the basis for such an amendment:<p>* There is a <i>federal</i> right to privacy, which protects the people from intrusion into their private lives by the federal government.<p>* This does not preclude <i>state</i> governments from regulating private activities, where the state has a compelling interest and doesn&#x27;t infringe on long-standing unenumerated rights.<p>* In particular, states can (within their jurisdiction) ban prostitution, regulate drug consumption, and define when life begins.<p>* However, states must recognize marriages that are recognized by other states, and cannot regulate acts in the bedroom of consenting adults (unless prostitution is involved).<p>Obviously this is an awkward set of compromises to make, and I don&#x27;t claim that these are the exact set that should be adopted, just that there could be some give-and-take like this, leading to a deal being made where almost everyone walks away feeling like they benefited.<p>The reason why a conservative might agree to it is that allows their state to ban abortion, without the risk that the leaked SCOTUS decision ends up backfiring and undermining the Republicans&#x27; electoral chances (leading to Congress either passing the WHPA or packing the court), and it supports the principle of states&#x27; rights.<p>The reason why a liberal might agree to it is that they might not be able to rely on SCOTUS precedent on abortion any more, and by allowing states to preserve access to it they can still help women to obtain them for the cost of a bus ticket.  They would also be able to properly legalize any drugs they thought were safe, and not have to worry about SCOTUS reversing other decisions about marriage or sexuality.<p>Moreover, though, I think everyone would benefit from turning down the temperature and lowering the stakes of presidential and congressional elections.  Rather than having two big (to fail) parties locked into an eternal war over wedge issues, it would make these become local issues that could be dealt with on a state by state basis.  As an extra safety valve, though, I would propose that the amendment contains a sunset clause, saying that it expires after 50 years, at which point the culture will have moved on and a new set of compromises might be needed.",
      "time": 1651874821,
      "title": "Poll: Would you support an Enumerated Rights amendment?",
      "type": "poll"
    },
    {
      "by": "astlouis44",
      "descendants": 0,
      "id": 31290049,
      "score": 1,
      "time": 1651874747,
      "title": "Unreal Engine metaverse platform cloud streamed to the web browser",
      "type": "story",
      "url": "https://detroitlab.surrealevents.com/"
    },
    {
      "by": "amar-laksh",
      "descendants": 0,
      "id": 31290034,
      "score": 1,
      "time": 1651874659,
      "title": "Oberon (Operating System)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Oberon_(operating_system)"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31290013,
      "score": 1,
      "time": 1651874532,
      "title": "Reconstructing venture capital to save humankind",
      "type": "story",
      "url": "https://www.ted.com/talks/danijel_visevic_reconstructing_venture_capital_to_save_humankind"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31290007,
      "score": 1,
      "time": 1651874477,
      "title": "Password-protected Excel spreadsheet pushes Remcos RAT",
      "type": "story",
      "url": "https://isc.sans.edu/forums/diary/Passwordprotected+Excel+spreadsheet+pushes+Remcos+RAT/28616"
    },
    {
      "by": "davidbarker",
      "descendants": 0,
      "id": 31289997,
      "score": 1,
      "time": 1651874411,
      "title": "Zag: UI components powered by Finite State Machines",
      "type": "story",
      "url": "https://zagjs.com"
    },
    {
      "by": "tr1ll10nb1ll",
      "descendants": 0,
      "id": 31289990,
      "score": 1,
      "text": "This is a work in progress.<p>At ConnectDome, we host our blog using Notion and Next.js on Vercel (to have a custom domain without paying a premium for it).<p>And, instead of manually notifying users of a new blog, we decided to build a simple service using Rust to notify everyone on our Discord whenever there&#x27;s a new blog.<p>Plus, since we would be sending emails only to our users (there&#x27;s no direct way to subscribe to the blog apart from being invited to our platform. hence, only users), we realized we could just couple the email mechanism in the same service as well.<p>We are still working on the &quot;email&quot; part (using SendGrid for it since it offers startup credits). This should be done in a couple of days tho.<p>Overall, this is an open-source and a free modifiable service if you run a self-hosted blog (or render Notion on your own front-end and self-host it) and want to notify your Discord server and&#x2F;or email list (initially we&#x27;d be supporting SendGrid but you can change it).",
      "time": 1651874367,
      "title": "Show HN: Rust-Notify – Announce blogs and send emails",
      "type": "story",
      "url": "https://github.com/ConnectDome/rust-notify"
    },
    {
      "by": "tysone",
      "descendants": 0,
      "id": 31289980,
      "score": 2,
      "time": 1651874254,
      "title": "Elon Musk’s Big Plans for Twitter",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/06/technology/elon-musk-twitter-pitch-deck.html"
    }
  ]
}