{
  "stories": [
    {
      "by": "DisjointedHunt",
      "descendants": 1,
      "id": 29552782,
      "kids": [
        29552787
      ],
      "score": 1,
      "text": "This is a contentious issue in the industry. The following is highly opinionated. If you have a strong opinion on it, please engage constructively in the comments. Don&#x27;t downvote others who may have a different view.<p>tl;dr:\n- One of the benefits of open source code is that large companies can share in the benefits of transferable knowledge\n- Compensation is not influenced as much by individual skills or replacement costs as popular knowledge suggests, it is set at a macro level\n- College towns and industry hotspots get higher wages so as to attract the expert competition as well as apply move pressure from outside nations so the local talent there doesn&#x27;t create the next big thing\n- Improving the funding prospects for large successful projects creates power centers outside of the traditional commercial software industry which creates the &quot;wrong&quot; incentive&quot; for high performing talent to work outside the FAANG+ structure and potentially undermine them.<p>The longer form:-&gt;<p>*The Industry reaction to Log4j* : I&#x27;ve been watching a lot of really intelligent senior people at large firms in the Bay Area react rather strangely to the ongoing Log4j bug. The developers behind the logging library themselves were sadly under the pump and receiving some pretty bad &quot;feedback&quot; on twitter and elsewhere while trying to figure out a fix for the issue.<p>The general tone of people who are director level or above in the industry seems to be that this is &quot;Not an open source funding issue at all&quot; and that &quot;This issue could not have been prevented if the devs maintaining the code were paid&quot;. . .well, hang on a minute.<p>This reduces the argument to a rather foolish strawman where we&#x27;re supposed to debate the benefits of paying a salary to one or more devs. This is not what anyone means by Open Source Funding. A significant portion of software developers&#x27; compensation in the industry is tied to variable financial products such as restricted stock units or profit sharing&#x2F;ownership agreements in the case of firms not listed on the public markets yet.<p>The large firms also make available to their devs, armies of lawyers, PR professionals, QA, testing and operations folk to help manage situations such as the one we&#x27;re witnessing playing out with Log4j. All of constitutes compensation &quot;In Kind&quot; . .. the free food, the insurance, the laundry, everything that acts as a safety net backstop to allow the developers at these large firms the luxury of not having to sweat the trivial and instead focus on what they do best.<p>*Compensation as a mechanism to exert move pressure* : Compensation in the industry is decided more at a &quot;Macro&quot; level rather than something that&#x27;s directly a factor of an individuals contribution or skills. What this means is, it is a mechanism the industry uses to  price the value they place on a combination of : Location, desire to reinforce competitive concentrations of skill levels next to each other, desire to reduce the incentives to directly compete through an entrepreneurial undertaking instead of employment and others.<p>In short, there is very little leverage a regular individual developer who is not an outlier can exert on compensation ranges. These decisions are made strategically by multi national corporations to make it a desirable career move to move to the Bay Area or other such locations that these companies continue to have a strong presence in.<p>*How Open Source is placed if this scenario were true* : Clearly, companies that have invested in making sure that the talent that can build things that can compete with them are not going to make it easier for that talent to do so while paying their bills and luxuries, allowing them the same worry free experience they may expect as employees. Using open source libraries is necessary to avoid closed kingdoms that devs would not want to work in as it may kill their careers.",
      "time": 1639496579,
      "title": "The issue of Open Source Funding and why large companies don't pay their rent",
      "type": "story"
    },
    {
      "by": "thinkingkong",
      "descendants": 0,
      "id": 29552776,
      "score": 1,
      "time": 1639496567,
      "title": "Moore's Second Law",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Moore%27s_second_law"
    },
    {
      "by": "JacobDesigns",
      "descendants": 0,
      "id": 29552750,
      "score": 2,
      "time": 1639496437,
      "title": "Software architecture diagramming and design tools",
      "type": "story",
      "url": "https://softwarearchitecture.tools/"
    },
    {
      "by": "SleekEagle",
      "descendants": 0,
      "id": 29552665,
      "score": 5,
      "time": 1639496126,
      "title": "PyTorch vs. TensorFlow in 2022",
      "type": "story",
      "url": "https://www.assemblyai.com/blog/pytorch-vs-tensorflow-in-2022/"
    },
    {
      "by": "hypernormie1",
      "descendants": 0,
      "id": 29552663,
      "score": 1,
      "time": 1639496114,
      "title": "Elizabeth Holmes vs. Marcus Aurelius",
      "type": "story",
      "url": "https://thecarousel.substack.com/p/elizabeth-holmes-vs-marcus-aurelius"
    },
    {
      "by": "tilt",
      "descendants": 0,
      "id": 29552635,
      "score": 1,
      "time": 1639496027,
      "title": "Database of Databases",
      "type": "story",
      "url": "https://dbdb.io/"
    },
    {
      "by": "romanzubenko",
      "descendants": 0,
      "id": 29552601,
      "score": 1,
      "time": 1639495820,
      "title": "What Is Transfer Pricing?",
      "type": "story",
      "url": "https://www.rebanknow.com/post/what-is-transfer-pricing"
    },
    {
      "by": "cableshaft",
      "descendants": 0,
      "id": 29552599,
      "score": 2,
      "text": "The past month I&#x27;ve been dealing with the joints in three of my fingers on one of my hands giving me pain when I bend them, and it kind of feels like maybe the edges of the bones are rubbing against each other (especially painful when I try to pinch or close things, like ziploc bags).<p>Actually first noticed when I was playing games with the fingers on WASD keys (for movement) and now I&#x27;ve switched to a controller, possibly for good, but now typing for extended periods when programming is bothering them.<p>I haven&#x27;t confirmed that it&#x27;s arthritis yet, maybe it&#x27;ll still get better on its own, but assuming it isn&#x27;t, is there a way I can continue to write code (and write comments on HN and whatnot :) and yet protect them and let them heal? Should I look into some ergonomic keyboards? Try typing one-handed for a while?<p>For those who definitely do have arthritis, how do you manage it as well as work?",
      "time": 1639495813,
      "title": "Ask HN: Anyone have arthritis in their fingers? How to keep working with it?",
      "type": "story"
    },
    {
      "by": "writerJames",
      "descendants": 0,
      "id": 29552597,
      "score": 1,
      "time": 1639495812,
      "title": "Air travel is good and we should want more of it",
      "type": "story",
      "url": "https://jamesomalley.substack.com/p/air-travel-is-good-and-we-should"
    },
    {
      "by": "giantrobot",
      "descendants": 0,
      "id": 29552566,
      "score": 1,
      "time": 1639495660,
      "title": "The Definitive Database of Old Time Radio Shows",
      "type": "story",
      "url": "https://radiogoldin.library.umkc.edu/"
    }
  ]
}