{
  "stories": [
    {
      "by": "ctummons",
      "descendants": 1,
      "id": 29265695,
      "kids": [
        29265698
      ],
      "score": 1,
      "time": 1637245450,
      "title": "Show HN: We want to make sharing to-do lists with groups frictionless",
      "type": "story",
      "url": "https://www.hellolist.com/"
    },
    {
      "by": "rpastuszak",
      "descendants": 0,
      "id": 29265694,
      "score": 1,
      "time": 1637245448,
      "title": "UseRainbow() – a quick intro to CSS colour theory, a11ty and vampires",
      "type": "story",
      "url": "https://sonnet.io/posts/use-rainbow/"
    },
    {
      "by": "t23",
      "descendants": 0,
      "id": 29265641,
      "score": 1,
      "time": 1637245179,
      "title": "Ford Steps into the Chips Business",
      "type": "story",
      "url": "https://www.wsj.com/articles/ford-enters-semiconductor-business-amid-chip-shortage-impact-11637242202"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29265640,
      "score": 2,
      "time": 1637245176,
      "title": "OpenAI’s API Now Available with No Waitlist",
      "type": "story",
      "url": "https://openai.com/blog/api-no-waitlist/"
    },
    {
      "by": "AndrewLiptak",
      "descendants": 0,
      "id": 29265627,
      "score": 1,
      "time": 1637245141,
      "title": "A good lesson on the value of failing, throwing something out and starting over",
      "type": "story",
      "url": "https://transfer-orbit.ghost.io/brian-staveley-empires-ruin-fantasy-interview/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29265621,
      "score": 1,
      "time": 1637245131,
      "title": "Hackers backed by Iran are targeting US critical infrastructure, US warns",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/11/beware-of-iranian-government-backed-hackers-waging-ransomware-us-warns/"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 29265595,
      "score": 1,
      "time": 1637244972,
      "title": "We Are Less Educated Than We Think",
      "type": "story",
      "url": "https://thedispatch.com/p/we-are-less-educated-than-we-think"
    },
    {
      "by": "rossrich",
      "descendants": 0,
      "id": 29265591,
      "score": 2,
      "text": "Hello HN! I’m Ross, and alongside my brother &#x2F; co-founder Ryan, we’re building Accord (https:&#x2F;&#x2F;inaccord.com) with the goal of making B2B sales suck less for buyers and sellers.<p>Yep, sales... sometimes a dirty word in the startup community, but read on—it’s not what you think!<p>I helped Stripe’s sales org go from a couple of us trying to find potential users, to scaling a 450-person global revenue machine. That rollercoaster of a learning curve turned all my ideas about sales on their head. At first I assumed that success in sales was based on someone’s ability to be a smooth talker, applying ad-hoc tricks, improvising each deal. Thousands of conversations and hundreds of deals at Stripe taught me the opposite: the key to personal success in winning deals, as well as the success of the entire sales org, is in building repeatable processes and iterating on them each day. What works best is not a cowboy operation with people winging it—it’s orderly, iterative, and actually more reminiscent of building great products.<p>Jumping ahead a bit: the idea behind Accord is to take all those lessons and build them into a platform that sellers and buyers can immediately use, so you don’t have to learn the hard way like we did. A well-oiled B2B sales machine is surprisingly well-suited for software, so we built that software. We let you easily create a repeatable, collaborative sales process (even if you don’t have a background in sales), and that is really what helps you hit your revenue goals.<p>Ok, so back to the wild world of startup sales and why I decided to leave Stripe after 4 amazing years. Well, similar to a lot of you, I truly felt the bar for B2B sales today sucked and wanted to use the tough lessons learned to level-up the experience, making sales more collaborative, transparent, and genuinely helpful. Every startup needs to sell, but very few do a decent job at it, and I think this is because many founders feel like they need to be born with amazing interpersonal skills. In reality, sales is more of a science than an art, and is much more accessible than founders think.<p>For example: Customers don’t want to talk to sales reps. One of our wildest learnings is that 95% of the buying process is NOT spent with a seller. You get only 5% of the entire process to engage, so you’d better get it right. How? By partnering with customers to actually solve their problems.<p>Not only that, but the average B2B sale involves 14+ people, and that’s only on the buyer’s side! You can imagine the inefficiency and crossed signals here.<p>Even if you have the above all figured out, you need a system to reinforce this collaborative, buyer-first approach. You need to structure your sales the way you can structure engineering (Github), design (Figma), product (Jira). No matter what you try, you’re never going to see a real transformation in sales until you bring the buyer into the process.<p>Accord provides a radically collaborative workspace that makes you look like seasoned sellers. We give you collaborative, customer-facing workspaces to drive alignment throughout the process; templated sales &amp; onboarding playbooks; a Resource Hub for managing key deal documents, images, etc.; Engagement Insights (see how prospects are interacting with your process); Contextual Conversations— commenting system contextually attached to particular key parts in the sales process; integration with Slack &amp; Salesforce plus integrations through Zapier - like Hubspot; and Smart Notifications(keep stakeholders informed by sending the right message or reminder at the right time).<p>If you’re curious to try it out we offer free trials (https:&#x2F;&#x2F;inaccord.com&#x2F;free-trial&#x2F;hacker-news) and free sales consulting sessions from our founding team (Seed&#x2F;Series A startups + Stripe, Shopify, Google Cloud).<p>I&#x27;d love to hear if this resonates with your experience as either a seller or buyer of tech!",
      "time": 1637244958,
      "title": "Accord (YC W20) – Repeatable sales and onboarding for B2B startups",
      "type": "story"
    },
    {
      "by": "catern",
      "descendants": 0,
      "id": 29265590,
      "score": 1,
      "time": 1637244942,
      "title": "“Introduction”, the most common systems concept you've never heard of",
      "type": "story",
      "url": "https://catern.com/introduction.html"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 29265576,
      "score": 1,
      "time": 1637244837,
      "title": "SymbiFlow: Open-source toolchain for the development of FPGAs",
      "type": "story",
      "url": "https://symbiflow.github.io/"
    }
  ]
}