{
  "stories": [
    {
      "by": "blueflow",
      "descendants": 0,
      "id": 29328628,
      "score": 1,
      "time": 1637749807,
      "title": "Systemd killing units each minute at second 27 (German)",
      "type": "story",
      "url": "https://blog.uberspace.de/systemd-anzuenden/"
    },
    {
      "by": "electic",
      "descendants": 0,
      "id": 29328618,
      "score": 1,
      "time": 1637749721,
      "title": "China bars celebrities from showing off wealth and 'extravagant pleasure'",
      "type": "story",
      "url": "https://www.businessinsider.com/china-bans-celebs-from-showing-off-wealth-on-social-media-2021-11"
    },
    {
      "by": "cunidev",
      "descendants": 0,
      "id": 29328574,
      "score": 1,
      "time": 1637749260,
      "title": "Sechs Kleine Klavierstücke",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Sechs_kleine_Klavierst%C3%BCcke"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29328571,
      "score": 1,
      "time": 1637749219,
      "title": "Accumulation of microplastics in mouse brain after oral treatment",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0048969721058952"
    },
    {
      "by": "dorianmariefr",
      "descendants": 0,
      "id": 29328551,
      "score": 1,
      "time": 1637749003,
      "title": "You can now reset your password",
      "type": "story",
      "url": "https://news.ycombinator.com/forgot"
    },
    {
      "by": "harias",
      "descendants": 0,
      "id": 29328543,
      "score": 1,
      "time": 1637748924,
      "title": "Model Ensembles Are Faster Than You Think",
      "type": "story",
      "url": "https://ai.googleblog.com/2021/11/model-ensembles-are-faster-than-you.html"
    },
    {
      "by": "yagiznizipli",
      "descendants": 0,
      "id": 29328534,
      "score": 3,
      "time": 1637748821,
      "title": "iCloud Private Relay can be turned off by your ISP",
      "type": "story",
      "url": "https://twitter.com/oskar/status/1463421809240510468"
    },
    {
      "by": "madspindel",
      "descendants": 0,
      "id": 29328518,
      "score": 3,
      "time": 1637748682,
      "title": "Pentagon Forms a Group to Examine Unexplained Aerial Sightings",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/24/us/politics/pentagon-ufos.html"
    },
    {
      "by": "questiondev",
      "descendants": 0,
      "id": 29328509,
      "score": 1,
      "text": "i’ve code my whole lot, it’s one of my few talents where it comes a lot easier than most things i do. i’ve been told my whole life i was gifted, i shrugged it off thinking it was just flattery, later on in life decided to talk to other more experienced devs, i was shocked that i was not only able to keep up but confuse them with things that i thought was how every coder was able to do. i have somewhat low self worth because of being raised in extreme poverty and having little to no guidance when it came to career advice. i am able to understand code, even if i haven’t read a document on it after like a week of studying and tinkering around with things, i assume this is somewhat normal, my question is, how can i get past the whole intimidation during an interview, i know i can give them what they want but, i feel somewhat unorthodox, i don’t think it’s an issue all the time but i am def not 100% tech bro, any advice would be helpful. thanks!",
      "time": 1637748533,
      "title": "What is the best advice for a cowboy coder interviewing for a senior position",
      "type": "story"
    },
    {
      "by": "mehdix",
      "descendants": 0,
      "id": 29328503,
      "score": 1,
      "text": "I work for a small VC-funded hardware startup in Germany and would like to help them&#x2F;founders make good decsions going forward regarding adding a SaaS product on top of their industrial hardware offerings (which are already doing great). Currently, I run and maintain a very cost-effective semi-automated data-aquisition and ETL pipeline for them.<p>However, mutual understanding proved to be difficult between me as a unix-minded software engineer and the hardware&#x2F;business people running the company.<p>Often the founders&#x2F;CEO hear from investors about new technologies such as Kubernetes or cloud offerings from the big fishes such as AWS and Azure or some cathy term and believe just using them will immediately contribute to their success (it will immediately contribute to their costs with no clear gains, investores like it however).<p>How could I best support the founders and CEO in making a software product and let them focus on &quot;what&quot; needs to be done, instead of &quot;how&quot; to do it in your opinion? Or perhaps I need to change my expectations? Either way, I appreciate your input.<p>Thanks.",
      "time": 1637748475,
      "title": "Ask HN: How to advice a HW startup with building a SaaS product?",
      "type": "story"
    }
  ]
}