{
  "stories": [
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 27844784,
      "score": 1,
      "time": 1626357558,
      "title": "Firefox 89 delivered more speed–today’s Firefox 90 adds SmartBlock 2.0",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/07/firefox-90-ramps-up-private-browsing-with-new-smartblock-2-0/"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 27844773,
      "score": 1,
      "time": 1626357530,
      "title": "Germany floods: At least 42 dead and dozens missing after record rain",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-57846200"
    },
    {
      "by": "vladmk",
      "descendants": 0,
      "id": 27844743,
      "score": 1,
      "time": 1626357358,
      "title": "Genes and Aging Are Still",
      "type": "story",
      "url": "https://www.nytimes.com/2006/08/31/health/31age.html"
    },
    {
      "by": "amitsy",
      "descendants": 0,
      "id": 27844728,
      "score": 4,
      "text": "Hey HN. We are Amit, Chetan, Anubhav and Hari, the cofounders of Weekday (<a href=\"https:&#x2F;&#x2F;www.weekday.works\" rel=\"nofollow\">https:&#x2F;&#x2F;www.weekday.works</a>) . We are building a recruitment platform centered around recommendations. We help companies hire engineers who are vouched for by other engineers.<p>Discovering top talent is challenging. It&#x27;s easy to check for great credentials, but that&#x27;s not the same thing as on-ground reality and achievement. It works the other way, too: someone with credentials may not be a great contributor, and screening for credentials eliminates many contributors who are.<p>Our company is based on the insight that great contributors tend to know other great contributors and are in a position to recommend them. We believe that a network-driven approach can help to discover high-caliber candidates.<p>We chanced upon this idea when we were doing our previous startup where we found it excruciatingly difficult to hire our first engineer. We tried all job boards and tech hiring marketplaces but nothing worked. We asked 50 of our friends if they knew a good engineer for us. Many said that they would recommend someone, but few actually did. We realized that it was because the friction to recommend is too high. Instead, we asked those friends to do a screen-share call and scroll their LinkedIn connections and just tell us which ones they would recommend (it didn&#x27;t matter if they thought they were looking out). This ended up increasing our pipeline multifold and is what gave us the idea to productize the same approach and try to make it work for a global network.<p>In an attempt to productise the same approach of hiring via recommendations, we have built a Chrome extension which removes the friction of coming up with names to refer. We give people a shortlist of people to choose from (based on a matching of roles we have available and your connections’ profiles) and they can recommend anyone they like out of them. They get financial rewards if the people they recommend end up getting interviewed by companies or get hired. Our business model works on a success fee model, we take 15% of annual salary from the company’s side. We pass on a percentage of that finder’s fee to the engineer who recommended them, while also paying if any of your recommended friends get interviews (as we have seen on avg companies take 20 interviews to hire 1 person).<p>We have experienced that in hiring, neither a fully automated nor completely human-driven approach works. Having to only interact with software can be a dehumanizing experience. A fully human-led approach leads to a lot of recruiter spam as every recruiter in their silo tries to reach out to every possible engineer. We believe our approach of hiring based on recommendations leads to a much more targeted matching and gives opportunities to people who otherwise would find it difficult in the current credential-driven job market.<p>We would love to get your feedback on our approach and hear about the problems you have faced while hiring, looking to switch jobs or interacting with recruiters.",
      "time": 1626357263,
      "title": "Launch HN: Weekday (YC W21) – Hire engineers vouched for by other engineers",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 27844718,
      "kids": [
        27844762
      ],
      "score": 1,
      "time": 1626357235,
      "title": "Facebook asks for removal of FTC Chair Khan from antitrust cases against it",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/14/facebook-is-shook-asks-for-removal-of-ftc-chair-khan-from-antitrust-cases-against-it/"
    },
    {
      "by": "steelstraw",
      "descendants": 0,
      "id": 27844706,
      "score": 1,
      "time": 1626357188,
      "title": "A personal note on Cuba and what it can teach Americans now",
      "type": "story",
      "url": "https://www.thepullrequest.com/p/the-invisible-boot"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 27844686,
      "score": 1,
      "time": 1626357087,
      "title": "Preserving Worlds: a travelogue through aging but beloved virtual worlds",
      "type": "story",
      "url": "https://preservingworlds.net/"
    },
    {
      "by": "lsllc",
      "descendants": 0,
      "id": 27844677,
      "score": 1,
      "time": 1626357019,
      "title": "'Jackpotting' ATM Hack Comes to the United States",
      "type": "story",
      "url": "https://www.wired.com/story/jackpotting-atm-hacks/"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 27844676,
      "score": 1,
      "time": 1626357002,
      "title": "YouTube’s TikTok competitor YouTube Shorts is rolling out globally",
      "type": "story",
      "url": "https://www.theverge.com/2021/7/13/22575063/youtube-shorts-global-roll-out-tiktok-short-form-video"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 27844670,
      "score": 3,
      "time": 1626356967,
      "title": "Unlocking Efficient Light-Energy Conversion with Stable Coordination Nanosheets",
      "type": "story",
      "url": "https://www.tus.ac.jp/en/mediarelations/archive/20210715_9271.html"
    }
  ]
}