{
  "stories": [
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30974598,
      "score": 2,
      "time": 1649566915,
      "title": "What is the Eurodollar System? (2020) [pdf]",
      "type": "story",
      "url": "https://research.rabobank.com/markets/en/documents/279278_2475340_yourollover-dollar.pdf"
    },
    {
      "by": "timoteostewart",
      "descendants": 0,
      "id": 30974597,
      "score": 1,
      "time": 1649566914,
      "title": "Graphic with escape codes for 256-color terminals (for colorful shell prompts)",
      "type": "story",
      "url": "https://i.imgur.com/FmM2blI.png"
    },
    {
      "by": "sub3suite",
      "descendants": 1,
      "id": 30974594,
      "kids": [
        30974595
      ],
      "score": 1,
      "time": 1649566898,
      "title": "A free, research-grade Intelligence gathering tool",
      "type": "story",
      "url": "https://github.com/3nock/sub3suite"
    },
    {
      "by": "daenz",
      "descendants": 0,
      "id": 30974585,
      "score": 1,
      "text": "Doesn&#x27;t this break the purpose of MFA, which is that the thing you know (password) is separate from the thing you have (MFA device)? If so, then why do all of the reputable password managers include TOTP functionality?",
      "time": 1649566801,
      "title": "Ask HN: Why do password managers have TOTP?",
      "type": "story"
    },
    {
      "by": "knlam",
      "descendants": 0,
      "id": 30974581,
      "score": 1,
      "time": 1649566764,
      "title": "How the TypeScript Complier Compiles",
      "type": "story",
      "url": "https://www.huy.rocks/everyday/04-01-2022-typescript-how-the-compiler-compiles"
    },
    {
      "by": "Walter_pier",
      "descendants": 0,
      "id": 30974572,
      "score": 1,
      "time": 1649566557,
      "title": "Information+for+Translators",
      "type": "story",
      "url": "https://fsfe.org/contribute/translators/translators.html"
    },
    {
      "by": "smaddock",
      "descendants": 0,
      "id": 30974564,
      "score": 1,
      "time": 1649566368,
      "title": "Fixing the entire Super Mario 64 source code",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=t_rzYnXEQlE"
    },
    {
      "by": "3a2d29",
      "descendants": 0,
      "id": 30974544,
      "kids": [
        30974590
      ],
      "score": 1,
      "text": "Hello all,<p>I got my first swe job this past August and it honestly has not gone well. I&#x27;ve enjoyed it, but it is clear that I am not seen as reliable and definitely not known for completing things fast.<p>I know this sounds like a normal junior dev, but I mean more than a normal beginner. Example: I have now been on this team for 8 months, and I made 2 costly mistake back-to-back that is pushing back the release of a production feature by a while month at this point.<p>Long story short, screwed up a step I had done before in the fall without realizing. Then when it was fixed I submitted a ticket for a prod systems account rather than a QA one not realizing there would be a difference. (Just so many mistakes all in a row).<p>The struggles came way before this though. When I first joined I struggled to even know how to start things. I was sometimes assigned stories no one else on the team had done anything like before, so at times I couldn&#x27;t even ask the senior devs for help.<p>This gets down to the issue. I don&#x27;t think my team is necessarily the most ideal to learn on (my manager has been gone since December). The senior engineers also seem to assume I know more than I do (like the credentials above, it seems obvious there would be an account for QA and one for Prod, but I didn&#x27;t know to assume that). But, the thing is though, this team isn&#x27;t a bad one. I can make excuses all I want, but an experienced engineer joined the same time I did and is doing great.<p>I have identified some issues. I certainly didn&#x27;t ask enough questions when I started and I definitely will wait around for people to get back to me sometimes rather then be proactive. I also tend to spend too long tackling an issue or trying to fix something I think I messed up rather than raise it to the team that I am having an issue. The problem is at this point I have been on the team too long to ask any basic questions, one of the senior engineers even pointed out they shouldn&#x27;t be helping me with certain processes at this point.<p>Honestly, I am a little deflated. I know imposter syndrome is a thing, but that doesn&#x27;t count when I am actively slowing the team down or causing problems. I take a really long time when finishing stories unless one of the seniors is giving input. It just sucks because I did well in my CS classes and worked hard, and I feel kinda like a disappointment. Its hard to imagine anyone who is good at engineering delaying a teams release and causing problems. I don&#x27;t know anything about performance (again cause manager is gone) but if I get put on PIP because of this, I feel like I can&#x27;t help but see it as a statement on my potential and ability.<p>I know I should just focus on improvement, but I am not sure how. Should I be writing reminders to myself to always double check everything? Should I write down the steps to every process? Its hard for me to know whats a junior engineer error and whats an error I shouldn&#x27;t be making at all.",
      "time": 1649565972,
      "title": "Ask HN: How to improve as a struggling junior swe?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30974500,
      "score": 1,
      "time": 1649565319,
      "title": "What Bias Lighting Is and Why You Should Be Using It (2017)",
      "type": "story",
      "url": "https://www.howtogeek.com/213464/how-to-decrease-eye-fatigue-while-watching-tv-and-gaming-with-bias-lighting/"
    },
    {
      "by": "vic_nyc",
      "descendants": 1,
      "id": 30974486,
      "kids": [
        30974576
      ],
      "score": 1,
      "time": 1649565034,
      "title": "NFTs Are a Privacy and Security Nightmare",
      "type": "story",
      "url": "https://www.wired.com/story/nfts-privacy-security-nightmare/"
    }
  ]
}