{
  "stories": [
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28379564,
      "score": 1,
      "time": 1630503059,
      "title": "Lockdown was based on faith, not evidence",
      "type": "story",
      "url": "https://www.telegraph.co.uk/news/2021/08/13/lockdown-based-faith-not-evidence/"
    },
    {
      "by": "imartin2k",
      "descendants": 0,
      "id": 28379557,
      "score": 1,
      "time": 1630503022,
      "title": "Billionaire-Backed Stock Picker Says Bubble Talk Is for Boomers",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-27/billionaire-backed-stock-picker-says-bubble-talk-is-for-boomers"
    },
    {
      "by": "rckrd",
      "descendants": 0,
      "id": 28379556,
      "score": 1,
      "time": 1630503020,
      "title": "An Overview of Docker Desktop Alternatives",
      "type": "story",
      "url": "https://matt-rickard.com/docker-desktop-alternatives/"
    },
    {
      "by": "karimtr",
      "descendants": 0,
      "id": 28379555,
      "score": 1,
      "time": 1630503019,
      "title": "What improved your quality of life so much, you wish you did it sooner?",
      "type": "story",
      "url": "https://www.reddit.com/r/AskReddit/comments/pbzt5b/what_improved_your_quality_of_life_so_much_you"
    },
    {
      "by": "Liriel",
      "descendants": 0,
      "id": 28379549,
      "score": 1,
      "time": 1630502986,
      "title": "Best Practices for Logging in Node.js",
      "type": "story",
      "url": "https://blog.appsignal.com/2021/09/01/best-practices-for-logging-in-nodejs.html"
    },
    {
      "by": "midnightcity",
      "descendants": 0,
      "id": 28379541,
      "score": 2,
      "time": 1630502938,
      "title": "SpaceX will use ‘robot chopsticks’ to catch rocket, Elon Musk says",
      "type": "story",
      "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/spacex-launch-elon-musk-starship-b1911138.html"
    },
    {
      "by": "midnightcity",
      "descendants": 0,
      "id": 28379527,
      "score": 2,
      "time": 1630502836,
      "title": "Japanese scientists use 3D printing to create Wagyu steaks",
      "type": "story",
      "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/steak-3d-print-meat-japan-b1911716.html"
    },
    {
      "by": "malloryerik",
      "descendants": 0,
      "id": 28379526,
      "score": 1,
      "time": 1630502833,
      "title": "Exercism v3",
      "type": "story",
      "url": "http://exercism.io"
    },
    {
      "by": "lifthrasiir",
      "descendants": 0,
      "id": 28379518,
      "score": 2,
      "time": 1630502778,
      "title": "Show HN: Roadroller, a heavyweight packer for large JavaScript demos",
      "type": "story",
      "url": "https://lifthrasiir.github.io/roadroller/"
    },
    {
      "by": "t3e",
      "descendants": 0,
      "id": 28379517,
      "score": 2,
      "text": "Hi, we’re Seth and Andrew (Aalk4308), co-founders of Constructor (https:&#x2F;&#x2F;constructor.dev), based in NYC. We’re building a tracking tool as lightweight as Trello for all the small dev teams out there with basic needs, and we’d love your feedback. You can try it out by clicking “Try the demo” on our website. You’ll get your own private, mutable workspace prepopulated with dummy data (no email or signup required).<p>We started building Constructor about a year ago after talking to lots of CTOs&#x2F;VPEs and product leaders about their frustrations with this space and frequently hearing “Trello’s a great tool to start with, but we know in six months we’ll want something more tailored to software dev”. Some of them had in fact used Trello all the way to exit with teams of 30+, but they’re the minority.<p>Trello’s great in a bunch of ways: it’s quick to set up, there’s not much to figure out, and the whole team can use it, not just the developers. It also strongly biases teams away from process complexity. But since it isn’t purpose-built for software developers, it lacks a first-class GitHub integration, backlog management is painful, and discussions are onerous. This all adds up to wasted time. But for many teams this is still preferable to heavier-weight alternatives.<p>So we built Constructor for small dev teams with basic needs who just need to get up and running with a tool that stays out of their way – but also understands how software is built. We aim to retain what’s great about Trello while redesigning it from the ground up for software dev teams.<p>We’ve been in private beta since January with teams ranging from two to more than 10 people. There’s clearly a lot left for us to improve here, but we wanted to share what we’ve built and get feedback from a broader audience.<p>We realize there are lots of tools in this space besides Jira and Trello, including several new ones in the last year or two, and we don’t expect ours to be right for every team. But we think it will help small teams keep their process light as it evolves, and save them time and frustration.<p>Thanks!<p>P.S. There’s a dark mode not yet exposed in the settings; if you want to see it just change the body tag class from c9r-light-mode to c9r-dark-mode and optionally add the class c9r-dark-high-contrast.",
      "time": 1630502775,
      "title": "Show HN: Constructor – simple issue tracking for small teams, inspired by Trello",
      "type": "story"
    }
  ]
}