{
  "stories": [
    {
      "by": "viebel",
      "descendants": 0,
      "id": 32190574,
      "score": 1,
      "time": 1658486841,
      "title": "Clj-commons/etaoin: Pure Clojure Webdriver protocol implementation",
      "type": "story",
      "url": "https://github.com/clj-commons/etaoin"
    },
    {
      "by": "omitmyname",
      "descendants": 0,
      "id": 32190563,
      "score": 1,
      "text": "As an example. When I’m developing some requests handlers I ask myself those questions:\n1) how do I handle multiple same requests\n2) What happens if database fails\n3) What happens if server fails\n4) How do I work with time if users are from different timezones\nEtc<p>Do you have some kind of cheat sheet?",
      "time": 1658486750,
      "title": "Ask HN: Back end. Which questions you ask yourself while developing back end?",
      "type": "story"
    },
    {
      "by": "yangzhiganlu",
      "descendants": 1,
      "id": 32190559,
      "kids": [
        32190560
      ],
      "score": 1,
      "time": 1658486724,
      "title": "Truck Knowledge: Engines of HOWO Dump Truck-Talenet",
      "type": "story",
      "url": "https://www.trucksglobal.com/engines-of-howo-dump-truck/"
    },
    {
      "by": "ff133",
      "descendants": 0,
      "id": 32190556,
      "score": 1,
      "text": "Hi, I&#x27;m looking for a way to rotate SSH-keys in an infrastructure. I have no experience when it comes to rotating SSH-keys.<p>Today I use SSH Key-based authentication to authenticate to my servers, tho I have been wondering if I should take a look SSH Certificate-based authentication, or if it is just an &quot;idea&quot; that seems nice.<p>This is far from a well structured question, but I appreciate anyone who contributes.<p>Thanks.",
      "time": 1658486694,
      "title": "Ask HN: Experience when it comes to SSH-key rotation?",
      "type": "story"
    },
    {
      "by": "oriettaxx",
      "descendants": 0,
      "id": 32190543,
      "score": 1,
      "text": "I just received this notice from Google<p>&quot;We associate your Google Account with a country (or region) so that we can better provide our services to you. This association is used to determine two things:<p><pre><code>    The Google company that provides the services, processes your information and is responsible for complying with applicable privacy laws\n    The version of the Terms of Service that governs our relationship, which can vary depending on local laws\n</code></pre>\nYour country association will change within 30 days:<p><pre><code>    from XXX\n    to YYY </code></pre>\n&quot;<p>where XXX is a country in europe, and YYY is not (is where I often go in vacation)<p>then<p>&quot;If the country associated with your account doesn’t match your country of residence, it could be because of a difference between your country of work and residence, because you’ve installed a virtual private network (VPN) to mask your IP address, or because you live close to a territorial border. If you recently moved, it can take about a year for your country association to update. You can find more information about your country association, and a way to request a change if you think that it’s wrong, by reviewing the Google Terms of Service.\nYour country association affects the Terms of Service that apply to your use of our services. &quot;<p>so, basically, I am not protected by EU privacy law, and I cannot reverse it.<p>Am I the only one?<p>(btw, I already moved my data out of Google, but I still have an account, almost empty, for some email forwarding)",
      "time": 1658486539,
      "title": "Ask HN: Google moving my account out of Europe",
      "type": "story"
    },
    {
      "by": "mrcuttles",
      "descendants": 1,
      "id": 32190539,
      "kids": [
        32190541
      ],
      "score": 1,
      "time": 1658486528,
      "title": "Deepdivr",
      "type": "story",
      "url": "https://www.deepdivr.io"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32190528,
      "score": 1,
      "time": 1658486412,
      "title": "The Unlikely Odds of Making It Big on TikTok",
      "type": "story",
      "url": "https://pudding.cool/2022/07/tiktok-story/"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 32190516,
      "score": 1,
      "time": 1658486225,
      "title": "Me and Monotropism: A unified theory of autism",
      "type": "story",
      "url": "https://www.bps.org.uk/psychologist/me-and-monotropism-unified-theory-autism"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 1,
      "id": 32190515,
      "kids": [
        32190558,
        32190537
      ],
      "score": 2,
      "text": "I have a child with autism, who has developed a fascination with the bath and running the water. If we stop him he of course has a meltdown, so what I am looking for is a method for controlling the water easily from another point than the faucet. I guess a plumber can set me up something like that, but I also wanted to see if anyone had suggestions. Also was wondering if anyone had suggestions for setting up a recycled tub, that is to say the water can be set to run back after running out, so that it does not cost excessive amounts.",
      "time": 1658486219,
      "title": "Ask HN: How to keep Water-obsessed autistic child from wasting",
      "type": "story"
    },
    {
      "by": "Rhysjc",
      "descendants": 1,
      "id": 32190504,
      "kids": [
        32190547
      ],
      "score": 1,
      "text": "Hey HN,<p>Very longtime lurker who finally has something to share!<p>Over the last couple of years I&#x27;ve found it pretty difficult to organise one to ones with my colleagues, and when I do get some time with them, the conversation often feels a little unstructured and not as valuable as it could be.<p>I built Pontoon to try and solve these problems, and maximise the quality of the one to one time I have. I&#x27;ve only just launched (I literally pressed the button yesterday!), and so there&#x27;s only a few simple features so far:\n- Meeting planner\n- Actions\n- Video meetings\n- Calendar sync<p>There&#x27;s plenty more in the pipeline but I wanted to open Pontoon up to everyone and start getting some feedback from real users. You can sign up for a 30 day trial with no card details, and if you&#x27;re enjoying it just ping me an email at rhys@meetpontoon.com telling me you&#x27;re from HN and I&#x27;ll add some credit to your account.<p>Thanks a lot",
      "time": 1658486097,
      "title": "Show HN: Pontoon, one to one meeting tracker",
      "type": "story",
      "url": "https://meetpontoon.com"
    }
  ]
}