{
  "stories": [
    {
      "by": "jeffreyrogers",
      "descendants": 0,
      "id": 31541294,
      "score": 1,
      "time": 1653753201,
      "title": "Platt scaling, isotonic regression, and beta calibration",
      "type": "story",
      "url": "https://www.abzu.ai/articles/calibration-introduction-part-2/"
    },
    {
      "by": "shivajikobardan",
      "descendants": 0,
      "id": 31541286,
      "score": 1,
      "text": "First of all I am not learning this currently from web development Point of view. So I think I don’t need the extreme level of understanding. I am studying this in a topic called “HTTP protocol”. And in my opinion, I need to learn enough to write what it does in exam paper.<p>It is so confusing in internet. I can’t explain enough. Firstly I was just confused between PUT and POST. But later someone started to tell me that you could use GET instead of these two in submitting form. That got me confused to next level.<p>What I have already understood(be it wrong or right I am not sure).<p>GET-: It helps to retrieve the file indicated by URL in request line from server.<p>PUT and POST seems same thing to me.<p>PUT places data in body to the URL in request line.\nPOST has no such definitions anywhere in books or internet. And it is generalized as “POST is used to submit form data”.\nBut the gist of these two seems similar ie post data to server. What’s the difference?<p>And there are like 6,670,000,000 results  in google. \nBut I don’t know how stupid I am to not get this.Most articles in internet are copied from each other and written pretty unprofessionally. I am not very smart. I mean smart in the sense that one who can understand anything taught by anyone and doesn’t need that clarity. I need something very simplified to understand and I don’t find it at least till now.<p>https:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;630453&#x2F;what-is-the-difference-between-post-and-put-in-http\nhttps:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;107390&#x2F;whats-the-difference-between-a-post-and-a-put-http-request<p>These are perhaps the only reputable answers about this but I find them very confusing.<p>They say idemptotencyy is there in some and not in other. But I want their basic difference in working.(PUT is idempotent).\nIdempotent means you can keep repeating the same thing again and again but the final result will be the same as the initial result that happened when you did that thing for the first time.<p>Is this the only difference between POST and PUT working and is their definition same? \nAnother thing that I am seeing is PUT keeps data to be sent in URL whereas POST doesn’t do it. How do we know about it? I can’t see any information that shows this thing practically. (They say while googling you use PUT so that you can visit that page again as well.) But IDK how to explain, I don’t know how. \nJust tell me the difference between PUT and POST in terms of real working difference, Like how they work. Thanks for the information.",
      "time": 1653753166,
      "title": "What Is the Difference Between Get vs. Post vs. Put? Mainly Post vs. Put?",
      "type": "story"
    },
    {
      "by": "iammkarim25",
      "descendants": 0,
      "id": 31541271,
      "score": 1,
      "text": "After news breaks of a layoff or startup bust, the community explains that it was inevitable based on factors they had already foreseen.",
      "time": 1653753075,
      "title": "Which highly valued startup is running on a flawed premise, heading for layoffs?",
      "type": "story"
    },
    {
      "by": "KlimYadrintsev",
      "descendants": 0,
      "id": 31541263,
      "score": 1,
      "time": 1653753024,
      "title": "The original Pong video game had no code and was built using hardware circuitry",
      "type": "story",
      "url": "https://old.reddit.com/r/EngineeringPorn/comments/ul49zt/the_original_pong_video_game_had_no_code_and_was/"
    },
    {
      "by": "AndreBaltazar",
      "descendants": 0,
      "id": 31541262,
      "score": 1,
      "time": 1653753015,
      "title": "Ask HN: Is DALL-E behind this video?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=95gDiOTvHus"
    },
    {
      "by": "baal80spam",
      "descendants": 0,
      "id": 31541248,
      "score": 1,
      "time": 1653752935,
      "title": "Broadcom to 'focus on rapid transition to subscriptions' for VMware",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/27/broadcom_vmware_subscriptions/"
    },
    {
      "by": "MickeyDicky",
      "descendants": 0,
      "id": 31541226,
      "score": 1,
      "time": 1653752763,
      "title": "Why the next Leonardo DiCaprio won't, and doesn't, look like Leonardo DiCaprio",
      "type": "story",
      "url": "https://markadonyus.substack.com/p/on-21st-century-stars-social-media"
    },
    {
      "by": "nikolay",
      "descendants": 0,
      "id": 31541219,
      "score": 1,
      "time": 1653752710,
      "title": "GraphJin – An Instant GraphQL to SQL Compiler",
      "type": "story",
      "url": "https://graphjin.com/"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 31541213,
      "score": 1,
      "time": 1653752647,
      "title": "NASA's idea for making food from thin air just became a reality",
      "type": "story",
      "url": "https://bigthink.com/health/protein-from-air/"
    },
    {
      "by": "exochrono",
      "descendants": 0,
      "id": 31541208,
      "score": 1,
      "time": 1653752632,
      "title": "A 7k-ton Broadway theater was hoisted 30 feet",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/28/business/palace-theater-times-square-lift.html"
    }
  ]
}