{
  "stories": [
    {
      "by": "taubek",
      "descendants": 0,
      "id": 30708590,
      "score": 1,
      "time": 1647503091,
      "title": "DeepWell plans to make video games to treat health conditions",
      "type": "story",
      "url": "https://www.fastcompany.com/90731659/this-startup-is-using-video-games-to-to-treat-health-conditions"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 30708582,
      "score": 1,
      "time": 1647502940,
      "title": "Tesla fired worker who posted YouTube video of FSD accident",
      "type": "story",
      "url": "https://driving.ca/auto-news/industry/tesla-fired-worker-who-posted-youtube-video-of-fsd-accident"
    },
    {
      "by": "tempestn",
      "descendants": 0,
      "id": 30708561,
      "score": 1,
      "time": 1647502653,
      "title": "DuckDuckGo, the free speech search engine that never was",
      "type": "story",
      "url": "https://www.vox.com/recode/22981115/duckduckgo-free-speech-privacy-oops"
    },
    {
      "by": "yololol",
      "descendants": 0,
      "id": 30708560,
      "score": 1,
      "text": "So far inflation in Europe has risen to 5%, and many think that it will raise even more. Naturally, the question comes on how to protect any savings that are not being intended for investing, but rather for a rainy day, from inflation. Banks (at least in EU) offer a much smaller interest rate for locking funds for a predetermined amount of time. What are the alternatives?",
      "time": 1647502651,
      "title": "Ask HN: How do you protect your emergency fund from inflation?",
      "type": "story"
    },
    {
      "by": "j1nd4L",
      "descendants": 0,
      "id": 30708552,
      "score": 1,
      "time": 1647502575,
      "title": "Suhail(mightyapp): Man, Firefox is janky af",
      "type": "story",
      "url": "https://twitter.com/Suhail/status/1504201864648134656"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 30708549,
      "score": 2,
      "time": 1647502525,
      "title": "PIP: Physics-Aware Real-Time Human Motion Tracking from Sparse Inertial Sensors",
      "type": "story",
      "url": "https://xinyu-yi.github.io/PIP/"
    },
    {
      "by": "bedatadriven",
      "descendants": 0,
      "id": 30708547,
      "score": 1,
      "text": "We have a successful, growing, niche b2b saas product. A few of our larger customers have expressed interest in paying for missing features. These are in general good ideas that we&#x27;d like to build anyway in time, but the relatively small size of our dev team and the complexity of the product means it will take longer than they&#x27;d like.<p>In the early days of the product, we did a lot of billing for specific features and it led to a lot of stress, ux incoherence, and a total shift of focus from our product to project management, which I personally am not very good at.<p>Are there alternatives means of partnering with customers that would give us the resources to develop faster without loosing our focus on the overall product and committment to quality over deadlines?",
      "time": 1647502493,
      "title": "Ask HN: How to let SaaS customers pay for new features?",
      "type": "story"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 30708542,
      "score": 1,
      "time": 1647502444,
      "title": "Physical Neural Cellular Automata for 2D Shape Classification",
      "type": "story",
      "url": "https://arxiv.org/abs/2203.07548"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 30708536,
      "score": 1,
      "time": 1647502381,
      "title": "Dual Diffusion Implicit Bridges for Image-to-Image Translation",
      "type": "story",
      "url": "https://arxiv.org/abs/2203.08382"
    },
    {
      "by": "gracie_k_t",
      "descendants": 1,
      "id": 30708530,
      "kids": [
        30708572
      ],
      "score": 2,
      "text": "Hello -<p>I’m a reporter for a news station in Washington state, working on a story about data breaches. I am hoping to connect with anyone who has something to say on this topic!<p>I’ve read many insightful threads&#x2F;comments and it’s clear there are many experts on this website. My reporting is focused mainly on WA’s data breach law, and breaches impacting Washingtonians… but breaches seemingly don’t observe borders, so this doesn’t limit the scope of sources I’m looking for.<p>Some specific things I’d love to talk about: \n&#x2F;&#x2F; Any info which hasn’t been widely reported a data breach, particularly on late notifications or cover ups by data controllers \n&#x2F;&#x2F; Any personal anecdotes&#x2F;stories&#x2F;etc. about a data breach\n&#x2F;&#x2F; The relationship between legal data broking and the illicit data market \n&#x2F;&#x2F; The role of offensive cybersecurity (and more broadly the surveillance&#x2F;intelligence apparatus) in making private info vulnerable\n&#x2F;&#x2F; Data breach notification laws – specifically WA state’s and others which are similar. Do they meaningfully protect people? Do companies etc. follow this law – particularly notification timeline requirements? \n&#x2F;&#x2F; Any proactive measures&#x2F;laws&#x2F;etc. which might better protect people from privacy violations and data breaches\n&#x2F;&#x2F; Holes in the mainstream narrative about data breaches (e.g. the perpetrators are located in whichever country the US considers the enemy)\n&#x2F;&#x2F; Common misconceptions to avoid in reporting on this topic, reading or source recommendations, philosophical insight, etc. etc. etc. (aka anything you find interesting and are willing to share with me)<p>Feel free to email me at gkt two six (at) cornell (dot) edu.\n(remove spaces and replace two six with 26). \nFrom there I can share my protonmail&#x2F;signal&#x2F;phone number. Or you can leave a comment here if preferred. If you’d prefer to speak “off the record” – either initially or always – that is cool with me and will be 100% honored.<p>Thank you so much, and I hope you all are having a great day!\n- Gracie",
      "time": 1647502253,
      "title": "Please tell me about data breaches",
      "type": "story"
    }
  ]
}