{
  "stories": [
    {
      "by": "MrWiffles",
      "descendants": 0,
      "id": 29588545,
      "score": 1,
      "text": "I&#x27;m in a job where we work with large corporate clients, fortune 500 companies, that sort of thing (US based). Those clients all have different mandates on what software you have to use, how it&#x27;s remotely managed and by whom, the patching strategy, etc. Some even go so far as to literally disable copy and paste in your company-mandated work environment! I shit you not!<p>To get around this, my employer (a consulting firm) is now mandating that all employees MUST use the company (our company, not the client&#x27;s) laptop which MUST be remote managed at all times and is subject to monitoring. This is all in a remote context, too, and I don&#x27;t have a second bedroom in my apartment to dedicate as a workspace to that either.<p>I&#x27;m not willing to sacrifice my own personal workstation setup - consisting of a nice multi-monitor, docking station thing on a nice work desk - to use the company laptop for all things, and I refuse to put ANY of my personal stuff on there whatsoever because it&#x27;s stupid to trust your employer who has absolutely zero loyalty to you whatsoever (we just got acquired by a larger company a few months ago, too, so there&#x27;s that).<p>But it&#x27;s a massive pain in the ass to have my REAL workstation in place, then have to pivot over to another table - not even a desk, literally a plastic folding table from WalMart - on the other side of the room where I don&#x27;t have a monitor, docking station, keyboard, chair, etc. and stare at that dinky piece of crap screen for 8-16 hours a day 5-7 days a week. I&#x27;m just not willing to do that and I think it&#x27;s unreasonable to expect it.<p>Normally I&#x27;d just set up some kind of remoting so I could have a remote session from my real workstation into the company laptop, but there have been subtle indications that this approach is going to be flat denied as well.<p>So I&#x27;m at my wit&#x27;s end here. They&#x27;re entirely intransigent on the subject and don&#x27;t care how much of a pain in the ass it is to do the job, nor how much pain they&#x27;re putting their employees through with these mandates. Some of this is definitely necessary by law and such, and I understand that, but some of those restrictions - like disabling remote sessions, disallowing copy&#x2F;paste, etc. - are just play batshit crazy with absolutely no way they&#x27;re protecting a damn thing. I mean, I have physical access to the damn device anyway, how the hell you gonna stop me if I want to steal your IP? But nonetheless, this draconian dogma persists, and short of finding another job, I have no leverage here.<p>So does anybody have suggestions on how to ease these kinds of workflows? Are there good strategies, best practices, other software and&#x2F;or tools out there that can be used to make this less of a pain in your day-to-day?<p>Because I desperately need something to make my job sane again.",
      "time": 1639721793,
      "title": "Ask HN: Workflow suggestions for untrusted, remote-managed environments?",
      "type": "story"
    },
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 29588524,
      "score": 1,
      "time": 1639721606,
      "title": "Sheppard’s Warning",
      "type": "story",
      "url": "https://www.historytoday.com/archive/history-matters/sheppards-warning"
    },
    {
      "by": "hariswill",
      "descendants": 0,
      "id": 29588507,
      "score": 1,
      "time": 1639721474,
      "title": "A spyware-for-hire, Predator, caught hacking phones of politicians, journalists",
      "type": "story",
      "url": "https://techcrunch.com/2021/12/16/cytrox-predator-phone-hacking-meta/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29588480,
      "score": 2,
      "time": 1639721246,
      "title": "China is mining data directly from workers’ brains on an industrial scale (2018)",
      "type": "story",
      "url": "https://www.scmp.com/news/china/society/article/2143899/forget-facebook-leak-china-mining-data-directly-workers-brains"
    },
    {
      "by": "Hooke",
      "descendants": 0,
      "id": 29588420,
      "score": 2,
      "time": 1639720770,
      "title": "Whatever Happened to Airships?",
      "type": "story",
      "url": "https://daily.jstor.org/whatever-happened-to-airships/"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 29588378,
      "score": 2,
      "time": 1639720387,
      "title": "Running BGP in Data Centers at Scale",
      "type": "story",
      "url": "https://www.usenix.org/conference/nsdi21/presentation/abhashkumar"
    },
    {
      "by": "prismatic",
      "descendants": 0,
      "id": 29588372,
      "score": 1,
      "time": 1639720335,
      "title": "How the Loft Generation Refused to Fit In",
      "type": "story",
      "url": "https://newrepublic.com/article/164698/loft-generation-refused-fit-edith-schloss-memoir-review"
    },
    {
      "by": "spenrose",
      "descendants": 0,
      "id": 29588321,
      "score": 2,
      "time": 1639720059,
      "title": "Chipmakers' nightmare: Will shortages give way to a supply glut?",
      "type": "story",
      "url": "https://asia.nikkei.com/Spotlight/Supply-Chain/Chipmakers-nightmare-Will-shortages-give-way-to-a-supply-glut"
    },
    {
      "by": "whytai",
      "descendants": 0,
      "id": 29588278,
      "score": 1,
      "time": 1639719624,
      "title": "Exq is a job processing library compatible with Resque / Sidekiq for Elixir",
      "type": "story",
      "url": "https://github.com/akira/exq"
    },
    {
      "by": "vanusa",
      "descendants": 0,
      "id": 29588260,
      "score": 2,
      "time": 1639719417,
      "title": "A ‘false solution’? How crypto mining became the oil industry’s new hope",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/dec/16/crypto-mining-oil-industry-waste-climate-crisis"
    }
  ]
}