{
  "stories": [
    {
      "by": "hoppyhoppy2",
      "descendants": 0,
      "id": 28055304,
      "score": 1,
      "time": 1628031555,
      "title": "Shareholders sue Activision Blizzard for withholding harassment info",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2021/08/shareholders-sue-activision-blizzard-for-withholding-harassment-info/"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 28055290,
      "score": 1,
      "time": 1628031455,
      "title": "Reading List",
      "type": "story",
      "url": "https://blakeir.com/Reading-List-929850f030d04ff896ac9228feb442bc"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28055283,
      "kids": [
        28055284
      ],
      "score": 1,
      "time": 1628031415,
      "title": "ProtonMail: Nutzerdaten für die USA dank Rechtshilfe und guter Zusammenarbeit",
      "type": "story",
      "url": "https://steigerlegal.ch/2021/08/02/protonmail-daten-usa/"
    },
    {
      "by": "pandroutsos",
      "descendants": 0,
      "id": 28055258,
      "score": 1,
      "text": "i wanted to reach out to the community and ask for a few pointers&#x2F;caveats regarding a new project that i would like to start.  as i have limited experience with payment systems, i am interested in finding out what are the things that should be set up from the get go when aiming for<p>1) a tool which will require montly payments (per user, or other metric)<p>2) if an application requires other underlying tech that a customer does not already have (industry with low technology penetration), is it ok to simply pass on the expense&#x2F;fees? are third parties typically agreeable to bringing in business to them for a discount (e.g. my process requires saas tool X that charges $Y&#x2F;user&#x2F;month)? how are such services typically passed on to a new clint of my own if said service is a requirement for me?<p>3) what to look out for when having to migrate users in an industry when they have no software&#x2F;tools and must take on all new tech?<p>cheers",
      "time": 1628031246,
      "title": "Ask HN: Starting a Project with Payments in Mind",
      "type": "story"
    },
    {
      "by": "hqhs",
      "descendants": 0,
      "id": 28055257,
      "score": 1,
      "text": "I&#x27;ve recently read &quot;You and your research&quot; (link: http:&#x2F;&#x2F;www.cs.virginia.edu&#x2F;~robins&#x2F;YouAndYourResearch.html) about great scientists and become interested: what are actual unsolved problems in CS field for which we have a workable attack surface? It seems like everyone keeps talking about AI and blockchain, but it\nhave become increasingly complicated to distinguish between hype and actual progress. Answers to the same question but in the related fields would suffice too, e.g.: There&#x27;s some noticeable progress in the protein folding problem, but it&#x27;s made via neural networks, if I understand correctly.\nIt’s important to note the “workable attack surface” part of the question, meaning that P = NP is an unsolved problem, but I doubt anyone understands how to approach solving it.",
      "time": 1628031243,
      "title": "Ask HN: What are relevant problems in CS except for AI and blockchain?",
      "type": "story"
    },
    {
      "by": "DangerDan",
      "descendants": 0,
      "id": 28055248,
      "score": 2,
      "text": "I&#x27;m trying to restart my life in my 30s as a software developer, and feel inhibited when it comes to setting up a bold public profile that would help me stand out as a pro.<p>My name is unique so it would be impossible to keep my professional life separate from my private life without using a professional alias.<p>Would it be a good idea to start using a professional alias? Is it likely to cause me any problems down the line? Could I use my alias on my resume instead of my real name? Would anyone involved in hiring react negatively to finding out I use an alias?<p>Any feedback would be appreciated. Thanks for your attention.",
      "time": 1628031206,
      "title": "Ask HN: Should I use a professional alias?",
      "type": "story"
    },
    {
      "by": "Stratoscope",
      "descendants": 0,
      "id": 28055223,
      "score": 2,
      "time": 1628030971,
      "title": "Americans Are Willing to Take Pay Cuts to Never Go into the Office Again",
      "type": "story",
      "url": "https://www.msn.com/en-us/money/other/americans-are-willing-to-take-pay-cuts-to-never-go-into-the-office-again/ar-AAMSYrz"
    },
    {
      "by": "Kye",
      "descendants": 0,
      "id": 28055202,
      "score": 1,
      "time": 1628030853,
      "title": "Emergency Medical Services [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Ezv8sdTLxKo"
    },
    {
      "by": "appwiz",
      "descendants": 0,
      "id": 28055193,
      "score": 1,
      "time": 1628030814,
      "title": "Madman Muntz",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Madman_Muntz"
    },
    {
      "by": "Overton-Window",
      "descendants": 0,
      "id": 28055186,
      "score": 1,
      "time": 1628030781,
      "title": "Hubei gov deletes report claiming Covid-19 could damage male fertility (2020)",
      "type": "story",
      "url": "https://www.scmp.com/news/china/society/article/3074945/coronavirus-hubei-government-deletes-report-claiming-covid-19"
    }
  ]
}