{
  "stories": [
    {
      "by": "mufeedvh",
      "descendants": 0,
      "id": 29058302,
      "score": 1,
      "time": 1635698982,
      "title": "Show HN: Gisture – A blog generator based on GitHub Gist",
      "type": "story",
      "url": "https://github.com/mufeedvh/gisture"
    },
    {
      "by": "vyuh",
      "descendants": 0,
      "id": 29058283,
      "score": 2,
      "time": 1635698818,
      "title": "Nb is a command line note‑taking, bookmarking, archiving, and knowledge base app",
      "type": "story",
      "url": "https://xwmx.github.io/nb/"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29058276,
      "score": 1,
      "time": 1635698798,
      "title": "Useful Idiot",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Useful_idiot"
    },
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 29058266,
      "score": 2,
      "time": 1635698726,
      "title": "Deadliest weather event in history killed up to 600k people 50 years ago",
      "type": "story",
      "url": "https://www.9news.com.au/wild-weather/extreme-weather-bhola-cyclone-killed-half-a-million-people-fifty-years-ago/5753f8b3-aa39-40c0-bd91-3e726f391f4a"
    },
    {
      "by": "gamalinosqui",
      "descendants": 1,
      "id": 29058264,
      "kids": [
        29058265
      ],
      "score": 2,
      "time": 1635698717,
      "title": "EZ.devs- Connecting LatAm developers to worldwide companies (Business review)",
      "type": "story",
      "url": "https://www.ezdevs.com/"
    },
    {
      "by": "darthvoldemort",
      "descendants": 0,
      "id": 29058254,
      "score": 2,
      "text": "I&#x27;m going through an interview loop right now, and my biggest pet peeve is when interviewers interrupt my train of thought so that they can correct a bug in my code.<p>Please, for the love of God, LEAVE THE CANDIDATE ALONE UNTIL THEY&#x27;RE DONE. I don&#x27;t know what the urge is for interviewers to correct candidates as they are in the middle of coding, maybe it&#x27;s a superiority thing which is bad, or maybe they think they&#x27;re helping, but they&#x27;re not. Let the candidate fail if there&#x27;s a bug, and let them find the bug themselves.<p>No one writes perfect code on the first pass. No one. If they do, it means they have memorized the answer. So when I code, I dump my thoughts down so that I don&#x27;t lose any idea and then go over them again. That&#x27;s the process of iterating to a final answer, as well as debugging. If you expect perfect code on first pass, you&#x27;re a terrible interviewer.<p>It doesn&#x27;t help when the interviewer keeps interrupting, or makes suggestions in the middle of my thought process, especially when I haven&#x27;t fully formed my ideas. It completely pulls people into a different direction and leads to more confusion than anything else. And then you start thinking &quot;Man I must not be doing well on this question&quot; and the anxiety and embarrassment kicks in and inhibits performance even further.<p>I&#x27;ve done hundreds of interviews now in my career, and the best way to coax out maximum performance is for me as an interviewer to shut the fuck up. Give the candidate time to breathe, and only if they want help, do I step in. Sometimes candidates come up with different ideas that I&#x27;ve never seen, so it&#x27;s better to let them fully form their ideas rather than me guide them into a direction that I want them to go. Then that turns into the candidate having to try to guess what answer I&#x27;m thinking of, as opposed to the candidate trying to solve the problem their way, and that is completely the wrong approach.<p>To all interviewers, as someone who is going through interviews right now, please:<p>If they&#x27;re headed down the wrong path, still give them time to breathe or figure it out. Them figuring out that they&#x27;re wrong is also signal.<p>If they have a bug in their code, let the bug stay they until they&#x27;re done testing. That&#x27;s the whole point, isn&#x27;t it? They are supposed to find their bugs and to present a final answer.<p>Also as a bonus request, if you have multiple parts to a question, let them know ahead of time. Don&#x27;t spring it on them afterwards. People try to time how long to spend on a question, so it&#x27;s better to give them a head&#x27;s up that they need to finish this in about 30 mins in order to get a crack at the second part of the question.",
      "time": 1635698568,
      "title": "Tell HN: To all interviewers, please don't interrupt candidates while coding",
      "type": "story"
    },
    {
      "by": "toricalea",
      "descendants": 0,
      "id": 29058248,
      "score": 1,
      "time": 1635698535,
      "title": "The Benefits of Iframe Based Development",
      "type": "story",
      "url": "https://stakedy.com/long/the-hidden-benefits-of-iframe-based-development.html"
    },
    {
      "by": "offer_gombo",
      "descendants": 1,
      "id": 29058239,
      "kids": [
        29058240
      ],
      "score": 1,
      "time": 1635698489,
      "title": "API Platform- Create, Deploy, Monetize",
      "type": "story",
      "url": "https://byvalue.org/"
    },
    {
      "by": "nceqs3",
      "descendants": 0,
      "id": 29058238,
      "score": 1,
      "time": 1635698475,
      "title": "ShareTechNote",
      "type": "story",
      "url": "https://sharetechnote.com"
    },
    {
      "by": "malshe",
      "descendants": 0,
      "id": 29058232,
      "score": 1,
      "time": 1635698448,
      "title": "Supply-Chain Crisis Has Companies Asking: Should We Still Advertise?",
      "type": "story",
      "url": "https://www.wsj.com/articles/supply-chain-crisis-has-companies-asking-should-we-still-advertise-11635599386"
    }
  ]
}