{
  "stories": [
    {
      "by": "lifeplusplus",
      "descendants": 0,
      "id": 29338517,
      "score": 1,
      "text": "Sorry it&#x27;s a bit of rant&#x2F;observation.<p>Most software companies have high engineers turn over and yet they continue to DO the same things as other companies. While acting puzzled and dismayed at hiring market.<p>Let me tell you WHY I got into coding. Maybe it would reveal something, which should have been obvious.<p>A: To experiment, build what I thought should exists, learn, and help solve problems.<p>I didn&#x27;t become an engineer...<p>- not to have no say, micro-managed and treated like socially lobotomized monkey<p>- to give status every day about things that are already there (really an attendance in disguise, reminds me of 5th grade)<p>- to be given project piece by piece (your idea? puff... you are just an human-human-interface to ideas of everyone else)<p>- to have things that I already thought was stupid change because now team sees it was stupid<p>- to write tests that I know with 100% certainty will be wasted (i.e. unit tests, esp for FE)<p>- to estimate vague 2 line descriptions about a ticket written by non-tech product manager<p>- to match fake deadlines<p>- to partake in weird CI&#x2F;CD non-sensical dances<p>Fixes:<p>- Remove scrum masters and everything agile. Trust me world existed before. Try kanban.. or anything that simply shows projects and bugs needing fixing. And devs with appropriate skills come and get it when they are done and have relevant skills&#x2F;interests.<p>- Don&#x27;t do TDD, do integration testing of your backend only. Or hire devs for just writing tests and maintaining them.<p>- If you don&#x27;t know what CI&#x2F;CD is great, if you know then imagine google docs but 9 people are writing on same page, yea it just doesn&#x27;t work..<p>- Allow agency over work. Spec projects, let devs figure out how it&#x27;d need to be structured. Get MVP and launch estimate, in weeks. Be available throughout the build process and explain why and take into account new insights. you learn a lot when you interact with an idea vs just wireframes.<p>- Understand there is off time and busy time, in all jobs. It&#x27;s ok if they don&#x27;t do 3 projects in 3 weeks, if they do pick up speed next month. You go through cycle of rest and passion.<p>- Allow ownership. Let devs have full view, invite to non-tech meetings. Get insights.",
      "time": 1637818706,
      "title": "Tell HN: Why I and other Developers Leave",
      "type": "story"
    },
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 29338477,
      "score": 2,
      "time": 1637818275,
      "title": "LinkedOut: Partagez votre réseau professionnel avec ceux qui n'en ont pas",
      "type": "story",
      "url": "https://www.linkedout.fr/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 29338455,
      "score": 3,
      "time": 1637817864,
      "title": "Jamulus ‒ Play music online. With friends. For free",
      "type": "story",
      "url": "https://jamulus.io/"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29338452,
      "score": 2,
      "time": 1637817831,
      "title": "The Largest Organism Is Slowly Being Eaten, Scientist Says",
      "type": "story",
      "url": "https://www.sciencealert.com/the-world-s-largest-organism-is-slowly-being-eaten-scientist-says"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29338451,
      "score": 3,
      "time": 1637817820,
      "title": "Orion 0.17 – X25519 with formally-verified field arithemtic and serde support",
      "type": "story",
      "url": "https://github.com/orion-rs/orion"
    },
    {
      "by": "greenSunglass",
      "descendants": 0,
      "id": 29338411,
      "score": 1,
      "time": 1637817271,
      "title": "Constructors and Evil Initializers in C++",
      "type": "story",
      "url": "https://jmmv.dev/2021/11/cpp-ctors-vs-init.html"
    },
    {
      "by": "kungfudoi",
      "descendants": 0,
      "id": 29338390,
      "score": 1,
      "time": 1637816907,
      "title": "Why this city is Europe's best kept cycling secret",
      "type": "story",
      "url": "https://www.bbc.com/news/business-59386433"
    },
    {
      "by": "malshe",
      "descendants": 0,
      "id": 29338356,
      "score": 7,
      "time": 1637816441,
      "title": "Minority professor denied grants because he hires on merit",
      "type": "story",
      "url": "https://nationalpost.com/news/canada/minority-professor-denied-grants-because-he-hires-on-merit-people-are-afraid-to-think"
    },
    {
      "by": "codehex",
      "descendants": 0,
      "id": 29338339,
      "score": 2,
      "time": 1637816226,
      "title": "Show HN: Cowsay Command for 2021",
      "type": "story",
      "url": "https://github.com/Code-Hex/Neo-cowsay"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29338338,
      "score": 2,
      "time": 1637816217,
      "title": "Amsterdam's Airport is trialing pigs to protect planes from bird strikes",
      "type": "story",
      "url": "https://www.cnn.com/travel/article/schipol-airport-amsterdam-pigs-scli-intl/index.html"
    }
  ]
}