{
  "stories": [
    {
      "by": "swemgrmgr",
      "descendants": 0,
      "id": 31304935,
      "score": 1,
      "text": "What advice would you give to a new-ish manager who is struggling to move past firefighting and make progress on long term system redesign?<p>For context: I am new to managing managers. This person has been an experienced consultant lead and IC, but has been managing for &lt;1 year. The team is trying to fix issues with a legacy system and incrementally build pieces of the next one, but seems to be constantly swallowed up in firefighting.<p>How should I collaborate with this manager? What’s the right way to help guide forward? (I struggle sometimes to keep track of why there always seems to be 2 steps forward, 1 step back progress around firefighting). I am not sure this person enjoys being a manager and they often seem overwhelmed by the meta tasks (reporting on progress, developing plans, talking to stakeholders, attending meetings) vs actually developing solutions. That said, they’ve built a highly motivated team that seems to be collaborating actively and working together well AND they have great stakeholder trust and relationships.<p>Things I’ve considered:<p>* Asking for clear roadmap and criteria for firefighting, plus a roll up summary of firefighting time over past month.\n* Joining the team as a partial IC to get the lay of the land.\n* Asking what to cut from scope of team to make progress<p>My core management goal is to empower my reports to work independently, but this manager is clearly struggling. I even wonder if they should move back to an IC role instead.",
      "time": 1652023750,
      "title": "Ask HN: Helping manager struggling to make progress past firefighting?",
      "type": "story"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 31304912,
      "kids": [
        31304915
      ],
      "score": 1,
      "time": 1652023591,
      "title": "The Employees: A Workplace Novel of the 22nd Century",
      "type": "story",
      "url": "https://www.nybooks.com/articles/2022/05/26/under-their-skin-the-employees-olga-ravn/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31304910,
      "score": 1,
      "time": 1652023590,
      "title": "Joker: Small Clojure interpreter, linter and formatter",
      "type": "story",
      "url": "https://github.com/candid82/joker"
    },
    {
      "by": "lucaaa",
      "descendants": 0,
      "id": 31304898,
      "score": 1,
      "time": 1652023513,
      "title": "Flag of Nepal – Aspect Ratio",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Flag_of_Nepal"
    },
    {
      "by": "avinassh",
      "descendants": 1,
      "id": 31304897,
      "kids": [
        31304903
      ],
      "score": 1,
      "time": 1652023503,
      "title": "Show HN: CaskDB – project to teach you building a key value store",
      "type": "story",
      "url": "https://github.com/avinassh/py-caskdb"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31304878,
      "score": 1,
      "time": 1652023413,
      "title": "Told GPT3 to write Python that calculates and plots a projectile's trajectory",
      "type": "story",
      "url": "https://twitter.com/thisiswrenn/status/1523182708385452032"
    },
    {
      "by": "ankushio",
      "descendants": 0,
      "id": 31304843,
      "score": 1,
      "time": 1652023273,
      "title": "YouTube takes down most popular educational Web3 channel without warning",
      "type": "story",
      "url": "https://twitter.com/BanklessHQ/status/1523317593947353089"
    },
    {
      "by": "RyanShook",
      "descendants": 0,
      "id": 31304808,
      "score": 2,
      "text": "I really enjoy my local library in Texas but the digital library they offer is limited. Do you know of any libraries that have open memberships to non-locals?",
      "time": 1652023039,
      "title": "Ask HN: Any Open Library Memberships?",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31304786,
      "score": 1,
      "time": 1652022869,
      "title": "Squaring the Circle",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Squaring_the_circle"
    },
    {
      "by": "thunderbong",
      "descendants": 1,
      "id": 31304777,
      "kids": [
        31304819
      ],
      "score": 3,
      "time": 1652022751,
      "title": "PowerToys – 11 features Microsoft won’t add to Windows",
      "type": "story",
      "url": "https://www.fourth-wall.co.uk/post/powertoys-11-awesome-features-microsoft-won-t-add-to-windows"
    }
  ]
}