{
  "stories": [
    {
      "by": "wcerfgba",
      "descendants": 0,
      "id": 30677483,
      "score": 1,
      "text": "Hi all,<p>I am just curious if anyone is using any lock-based approaches to version control for collaborative production of software or other digital assets. It seems like the merge model, exemplified by Git, is ubiquitous to the point that nobody is experimenting with any other workflows.<p>I think lock-based version control would would very well with trunk-based development. Separate devs branch from mainline, files get locked for everyone else as they are edited, and so it is necessary to work in very tight iterations and merge back to mainline very frequently.<p>Is anyone working with a lock-based approach to version control, either for personal projects, or in an organisational setting?<p>Thanks :)",
      "time": 1647288206,
      "title": "Ask HN: Is anyone using lock-based version control?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30677477,
      "score": 1,
      "time": 1647288187,
      "title": "DataSkop: Simulating the Dynamics of Recommender Systems",
      "type": "story",
      "url": "https://algorithmwatch.org/en/dataskop-simulator-plattformdynamiken/"
    },
    {
      "by": "tambourine_man",
      "descendants": 0,
      "id": 30677466,
      "score": 1,
      "time": 1647288137,
      "title": "Antarctic sea ice hits lowest minimum on record",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-00550-4"
    },
    {
      "by": "JustARandomGuy",
      "descendants": 0,
      "id": 30677452,
      "score": 1,
      "text": "Hello,<p>Are there any Coursera software engineers or PMs that could help me?<p>I am currently taking the iMBA, a joint Coursera&#x2F;University of Illinois @ Urbana Champaign (UIUC) MBA degree: https:&#x2F;&#x2F;www.coursera.org&#x2F;degrees&#x2F;imba . To get credit for a UIUC course, you need to show a Coursera certificate from the associated course. However, UIUC insists that the Coursera certificate must come from an automated feed they have with Coursera - you can&#x27;t just directly link them the certificate online.<p>I&#x27;ve had no problems for the last 2 years (2020, mid 2021) but starting this year, UIUC is saying they didn&#x27;t receive my completed certificate from Coursera. I&#x27;m trying to work with support but each side seems to point the finger at the other.<p>I was hoping that there&#x27;s some Coursera engineer or PM out there that can poke around and see why my completed certificate information isn&#x27;t making it to UIUC&#x27;s grading system. Failing that, would appreciate an escalation point.<p>Apologies for using HN as a support forum, but I honestly don&#x27;t know where else to turn to.",
      "time": 1647288081,
      "title": "Ask HN: Any Coursera Engineers Available?",
      "type": "story"
    },
    {
      "by": "LucasFada",
      "descendants": 0,
      "id": 30677431,
      "score": 1,
      "text": "Hey everyone! Would like to learn more about Crypto and Blockchain, and I love playing &quot;party games&quot;, which are board games like Chamaleon, Cards Against Humanity, etc.<p>Challenges to learn about this:<p>There are sooo many fluffy terms in the industry that are probably not that complicated to understand.<p>These terms make it hard for me and I guess a lot of ppl to get into it.<p>Listening to podcasts, talking to people, and reading on Twitter is fine, but not as fun as playing a game.<p>Anyone else with me?<p>Research:<p>BGG&#x27;s top 5 list, I don&#x27;t find an educational list, or a crypto one.<p>The games to learn crypto are all online, and mostly to learn how to trade, or &quot;play-to-earn&quot; (which you already need to have a wallet). They don&#x27;t focus on its concepts and are not across the industry (Defi, Web3, Blockchain, NFTs, etc).<p>Questions for y&#x27;all:<p>Do you know any board game to learn crypto?<p>If not: Do you know any board game to learn about concepts, an industry, or a topic?<p>Thanks for reading, and please let me know if anything needs clarification",
      "time": 1647287939,
      "title": "Any Crypto/Blockchain Educational Board Games Around?",
      "type": "story"
    },
    {
      "by": "braco_alva",
      "descendants": 0,
      "id": 30677408,
      "score": 1,
      "time": 1647287820,
      "title": "Interest in NFTs and the Metaverse Is Falling Fast",
      "type": "story",
      "url": "https://www.forbes.com/sites/paultassi/2022/03/10/interest-in-nfts-and-the-metaverse-is-falling-fast/"
    },
    {
      "by": "andyzei",
      "descendants": 0,
      "id": 30677406,
      "score": 1,
      "time": 1647287816,
      "title": "Strava Abruptly Ends 3rd Party Data Sync to Apple Health",
      "type": "story",
      "url": "https://www.dcrainmaker.com/2022/03/strava-abruptly-ends-3rd-party-data-push-to-apple-health.html"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30677396,
      "score": 1,
      "time": 1647287760,
      "title": "Australia and the Netherlands – New Case against Russia over 2014 Jet shot-down",
      "type": "story",
      "url": "https://text.npr.org/1086449199"
    },
    {
      "by": "hirundo",
      "descendants": 0,
      "id": 30677366,
      "score": 2,
      "time": 1647287607,
      "title": "Stack Exchange Q&A access will not be restricted in Russia",
      "type": "story",
      "url": "https://meta.stackexchange.com/questions/376743/stack-exchange-qa-access-will-not-be-restricted-in-russia"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30677334,
      "score": 2,
      "time": 1647287470,
      "title": "FreeBSD on the CubieBoard2",
      "type": "story",
      "url": "https://www.cambus.net/freebsd-on-the-cubieboard2/"
    }
  ]
}