{
  "stories": [
    {
      "by": "brian_herman",
      "descendants": 0,
      "id": 31236093,
      "score": 1,
      "text": "I want metal support in qemu and am going to put 1000 dollars down as a bounty.",
      "time": 1651504121,
      "title": "Ask HN: How do I do a feature request for GPU support in QEMU",
      "type": "story"
    },
    {
      "by": "jordigh",
      "descendants": 0,
      "id": 31236082,
      "score": 1,
      "time": 1651504091,
      "title": "Pointer Compression in V8 (2020)",
      "type": "story",
      "url": "https://v8.dev/blog/pointer-compression"
    },
    {
      "by": "Gabriel_h",
      "descendants": 0,
      "id": 31236066,
      "score": 2,
      "text": "Hey HN, I&#x27;m Gabriel, founder of Meticulous (<a href=\"https:&#x2F;&#x2F;www.meticulous.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meticulous.ai</a>). We&#x27;re building an API for replay testing. That is, we enable developers to record sessions in their web apps, then replay those sessions against <i>new</i> frontend code, in order to catch regressions before the code is released.<p>I was inspired to start Meticulous from my time at Dropbox, where we had regular &#x27;bug bashes&#x27; for our UX. Five or six engineers would go to a meeting room and click through different flows to try to break what we built. These were effective but time consuming—they required us to click through the same set of actions each time prior to a release.<p>This prompted me to start thinking about replaying sessions to automatically catch regressions. You can&#x27;t replay against production since you might mutate production data or cause side effects. You could replay against staging, but a lot of companies don&#x27;t have a staging environment that is representative of production. In addition, you need a mechanism to reset state after each replayed session (imagine replaying a user signing up to your web application).<p>We designed Meticulous with a focus on regressions, which I think are a particularly painful class of bug. They tend to occur in flows which users are actively using, and the number of regressions generally scales with the size and complexity of a codebase, which tends to always increase.<p>You can use Meticulous on any website, not just your own. For example, you can start recording a session, then go sign up to (say) amazon.com, then create a simple test which consists of replaying against amazon.com twice and comparing the resulting screenshots. You can also watch recordings and replays on the Meticulous dashboard. Of course, normally you would replay against the base commit and head commit of a PR, as opposed to the production site twice.<p>Our API is currently quite low-level. The Meticulous CLI allows you to do three things:<p>1) You can use &#x27;yarn meticulous record&#x27; to open a browser which you can then use to record a session on a URL of your choice, like localhost. You can also inject our JS snippet onto staging, local, dev and QA environments if you want to capture a larger pool of sessions. This is intended for testing your own stuff! If you inject our snippet, please ask for the consent of your colleagues before recording their workflows. I would advise against production deployments, because our redaction is currently very basic.<p>2) You can use &#x27;yarn meticulous replay&#x27; to replay a session against a URL of your choice. During replay, we spin up a browser and simulate click events with Puppeteer. A list of exceptions and network logs are written to disk. A screenshot is taken at the end of the replay and written to disk.<p>3) You can use &#x27;yarn meticulous screenshot-diff&#x27; to diff two screenshots.<p>There are lots of potential use cases here. You could build a system on top of the screenshot diffing to detect major regressions with a UX flow. You could also try to diff exceptions encountered during replay to detect new uncaught JS exceptions. We plan to build a higher-level product which will provide some testing out of the box.<p>Meticulous captures network traffic at record-time and mocks out network calls at replay-time. This isolates the frontend and avoids causing any side effects. However, this approach does have a few problems. The first is that you can&#x27;t test backend changes or integration changes, only frontend changes. (We are going to make network-stubbing optional, though, so that you can replay against a staging environment if you wish.) The second problem with our approach is that if your API significantly changes, you will need to record a new set of sessions to test against. A third problem is that we don&#x27;t yet support web applications which rely heavily upon server-side rendering. However, we felt these trade-offs were worth it to make Meticulous agnostic of the backend environment.<p>Meticulous is not going to replace all your testing, of course. I would recommend using it in conjunction with existing testing tools and practices, and viewing it as an additional layer of defense.<p>We have a free plan where you can replay 20 sessions per month. I&#x27;ve temporarily changed our limit to 250 for the HN launch. Our basic plan is $100&#x2F;month. The CLI itself is open-source under ISC. We&#x27;re actively discussing open sourcing the record+replay code.<p>I&#x27;d love for you to play around with Meticulous! You can try it out at <a href=\"https:&#x2F;&#x2F;docs.meticulous.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.meticulous.ai</a>. It&#x27;s rough around the edges, but we wanted to get this out to HN as early as possible. Please let us know what you might want us to build on top of this (visual diffs? perf regressions? dead code analysis? preventing regressions?). We would also love to hear from people who have built any sort of replay testing out at their company. Thank you for reading and I look forward to the comments!",
      "time": 1651504009,
      "title": "Launch HN: Meticulous (YC S21) – Catch JavaScript errors before they hit prod",
      "type": "story",
      "url": "https://meticulous.ai/"
    },
    {
      "by": "HelenePhisher",
      "descendants": 0,
      "id": 31236034,
      "score": 1,
      "time": 1651503885,
      "title": "We're Publishing the Facebook Papers",
      "type": "story",
      "url": "https://gizmodo.com/facebook-news-feed-ranking-algorithms-how-they-work-1848814459"
    },
    {
      "by": "avonmach",
      "descendants": 0,
      "id": 31236032,
      "score": 1,
      "time": 1651503882,
      "title": "A U.S. Recession, Are We There Yet?",
      "type": "story",
      "url": "https://thepeopleseconomist.substack.com/p/a-us-recession-are-we-there-yet"
    },
    {
      "by": "flickzcode",
      "descendants": 0,
      "id": 31236030,
      "score": 1,
      "time": 1651503880,
      "title": "Show HN: HN monthly 'Who is hiring' on a kanban board for easy organization",
      "type": "story",
      "url": "https://www.hnwhoishiring.io/may-2022"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31236026,
      "score": 1,
      "time": 1651503872,
      "title": "Extraverts are considered to be poorer listeners",
      "type": "story",
      "url": "https://digest.bps.org.uk/2022/04/27/extraverts-are-considered-to-be-poorer-listeners/"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 31236021,
      "score": 2,
      "time": 1651503864,
      "title": "U.S. Supreme Court backs Christian group in Boston flag flap",
      "type": "story",
      "url": "https://www.reuters.com/world/us/us-supreme-court-backs-christian-group-boston-flag-flap-2022-05-02/"
    },
    {
      "by": "blopeur",
      "descendants": 0,
      "id": 31235980,
      "score": 1,
      "time": 1651503732,
      "title": "Docs Roundup 2.2 – Sometimes Dragons",
      "type": "story",
      "url": "https://redmonk.com/kfitzpatrick/2022/04/22/docs-roundup-2-2/"
    },
    {
      "by": "doikor",
      "descendants": 0,
      "id": 31235979,
      "score": 1,
      "time": 1651503731,
      "title": "Apple Pay is anticompetitive, says EU in preliminary ruling",
      "type": "story",
      "url": "https://www.theverge.com/2022/5/2/23048116/apple-pay-eu-antitrust-nfc-payment-wallet"
    }
  ]
}