{
  "stories": [
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 28227828,
      "score": 1,
      "text": "My career thus far has been a dud. Always underpaid (and yes, I mean underpaid) and in orgs with bad&#x2F;outdated practices. I’ve also always just taken the first thing I can get and always have accepted a less than ideal situation, because I hate the job hunt&#x2F;interview process so much. I heard about how hot the job market is recently, so I decided to try and see what was out there and maybe straighten my shit out. I also decided to go ahead and actively search for roles as well. I wanted to be a little more stringent this time, not breaking rankin my requirements for roles&#x2F;pay.<p>The result has been mostly disappointing. I expected to get a lot more recruiters, but I’ve seen fewer than when I had 2 YoE. Another issue is I’m not happy with the direction of my career. So far I’ve been pigeonholed into a certain category and I don’t want to do this type of work for the next X decades, I’m not sure I can take it. I have a better idea of what I want to do now, and was trying to apply to roles more in line with that. But the simple fact is I’m not qualified for these roles. They’re just so radically different from what I do now, and mostly at senior+ level. I see so many cool jobs and think “shit, I could do this, I’ve been doing stuff like this since forever” but then quickly realize that on paper I haven’t done anything remotely relevant and since these are senior level roles there’s just no point in applying. On the occasion I see a role that look interesting that I believe I can spin my past experience to look reveling for, I get very quickly screened out with a generic ATS rejection. There doesn’t seem to be a way to win. Side projects don’t make up for experience in senior level roles and don’t fit on a resume in any manner that someone would read. The one option seems to be doing some serious open source work in a project in the domains I’m interested in, but that would end up being a second career on its own.<p>Similarly majority of the recruiters I get are recruiting for roles that basically just land me in the same type of roles I’ve worked in the last, maybe with better pay. I don’t really want to take a role like this, as it’s still likely to end up paying lower than what I was targeting and will just stagnate me further. At the same time, I could use the pay raise which would still be a good 30%-40% above what I make now. There probably won’t be a ton of room for growth, both lay wise or otherwise, without moving into management. I’m just worried that if I do this, I’ll end up permanently entrenching myself in this type of work and kill any remote chance at getting a role more aligned to my goals.",
      "time": 1629324932,
      "title": "Ask HN: Should I give up and settle career wise?",
      "type": "story"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 28227768,
      "score": 1,
      "time": 1629324520,
      "title": "AlmaLinux Arrives on Azure Cloud",
      "type": "story",
      "url": "https://www.zdnet.com/article/almalinux-arrives-on-azure-cloud/"
    },
    {
      "by": "gorthmog",
      "descendants": 0,
      "id": 28227756,
      "score": 1,
      "time": 1629324432,
      "title": "Roger Wagner's Apple 1 and Lisa",
      "type": "story",
      "url": "https://www.rrauction.com/auctions/categories/645-the-roger-wagner-collection"
    },
    {
      "by": "jdorfman",
      "descendants": 0,
      "id": 28227748,
      "score": 1,
      "time": 1629324366,
      "title": "The Simple Genius of the Interstate Highway System [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=SR7BA3xEmDo"
    },
    {
      "by": "uxp100",
      "descendants": 0,
      "id": 28227740,
      "score": 4,
      "text": "The behavior I am seeing is demonstrated here: https:&#x2F;&#x2F;gfycat.com&#x2F;thornyfeistyleafcutterant<p>I am always returned to the page that I was linked to if I try to browse elsewhere on the site.",
      "time": 1629324327,
      "title": "Ask HN: Has Twitter removed the ability to browse while logged out?",
      "type": "story"
    },
    {
      "by": "AllSeason",
      "descendants": 0,
      "id": 28227729,
      "score": 1,
      "time": 1629324231,
      "title": "The Simple Way to Be Right All the Time",
      "type": "story",
      "url": "https://wealthyaccountant.com/2016/06/29/occams-razor/"
    },
    {
      "by": "sdeframond",
      "descendants": 1,
      "id": 28227711,
      "kids": [
        28227721,
        28227743
      ],
      "score": 3,
      "time": 1629324107,
      "title": "Draining Static Charge Procedure",
      "type": "story",
      "url": "https://www.dell.com/community/Laptops-General-Read-Only/Draining-static-charge-procedure/td-p/1740772"
    },
    {
      "by": "exotree",
      "descendants": 0,
      "id": 28227633,
      "score": 12,
      "time": 1629323506,
      "title": "Canada calls screen scraping ‘unsecure,’ sets Open Banking target for 2023",
      "type": "story",
      "url": "https://finledger.com/2021/08/09/canada-sets-open-banking-target-for-2023/"
    },
    {
      "by": "goindeep",
      "descendants": 0,
      "id": 28227589,
      "score": 3,
      "time": 1629323207,
      "title": "Creator Tokens Are About to Explode",
      "type": "story",
      "url": "https://cryptofireside.medium.com/creator-tokens-are-about-to-explode-a40b3c53268c"
    },
    {
      "by": "nickfrost",
      "descendants": 0,
      "id": 28227583,
      "score": 1,
      "time": 1629323150,
      "title": "We Need More Women Founders and Here Is What We Are Doing to Make That Happen",
      "type": "story",
      "url": "https://medium.com/authority-magazine/april-and-nikki-dominguez-why-we-need-more-women-founders-here-is-what-we-are-doing-to-make-that-ec4aa3a0393f"
    }
  ]
}