{
  "stories": [
    null,
    {
      "by": "JumpCrisscross",
      "descendants": 0,
      "id": 31661003,
      "score": 1,
      "time": 1654642477,
      "title": "Credit Suisse pushed for spyware sales at NSO despite US blacklisting",
      "type": "story",
      "url": "https://www.ft.com/content/e55a92d4-6a0a-4284-aa22-639dad5f2b65"
    },
    {
      "by": "MarcellusDrum",
      "descendants": 0,
      "id": 31660994,
      "score": 1,
      "text": "I&#x27;m in my 20s, and have been noticing that I have a bad memory. I don&#x27;t forget anything major or concerning, but its obvious my memory is below average. It is starting to cause a bit of a problem at work.<p>I started to write a lot of things down, but the problem is that I can&#x27;t always anticipate what I to need to remember later on. So what tools&#x2F;methods do you use to help you overcome this?",
      "time": 1654642412,
      "title": "Ask HN: How do you deal with slight memory impairment?",
      "type": "story"
    },
    {
      "by": "remotecar",
      "descendants": 1,
      "id": 31660976,
      "kids": [
        31660988
      ],
      "score": 6,
      "time": 1654642250,
      "title": "The Worst Perk at Google",
      "type": "story",
      "url": "https://www.coveragecat.com/blog/the-worst-perk-at-google"
    },
    {
      "by": "miduil",
      "descendants": 0,
      "id": 31660955,
      "score": 1,
      "time": 1654642085,
      "title": "EU reaches deal for adequate minimum wages",
      "type": "story",
      "url": "https://www.europarl.europa.eu/news/en/press-room/20220603IPR32188/deal-reached-on-new-rules-for-adequate-minimum-wages-in-the-eu"
    },
    {
      "by": "_ben_",
      "descendants": 0,
      "id": 31660922,
      "score": 1,
      "time": 1654641864,
      "title": "Welcome to the New Database Era",
      "type": "story",
      "url": "https://ethanjb.medium.com/welcome-to-the-new-database-era-f4f8c8c407e1"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 31660886,
      "score": 2,
      "time": 1654641506,
      "title": "Google Sheets and SQL: Querying Google Sheets with DataStation",
      "type": "story",
      "url": "https://datastation.multiprocess.io/docs/tutorials/Query_Google_Sheets_with_DataStation.html"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31660871,
      "score": 2,
      "time": 1654641381,
      "title": "Playing Dice with the Universe (2021)",
      "type": "story",
      "url": "https://www.artnews.com/art-in-america/features/tauba-auerbach-s-v-z-sfmoma-1234612921/"
    },
    {
      "by": "spearingthehead",
      "descendants": 4,
      "id": 31660869,
      "kids": [
        31661047,
        31660913,
        31660995
      ],
      "score": 7,
      "text": "I am a software engineer who is self-taught, and after graduation I took local jobs for small web shops for dev work.<p>Here&#x27;s a brief description of my timeline from beginning to present:<p>- 1.5 years contract-to-hire SWE (W2 never actually happened)<p>- 3 months full-time W2 work, followed by 6 months unemployed<p>- 10 years independent contract work (freelancing)<p>- 2.5 years of no work, and a lot of job searching<p>The last 5 years of independent contract work have been very sporadic. I typically made under $10k every year. I don&#x27;t really know how to &quot;put myself out there&quot; as a freelancer, and after 10 years of doing it, I just want to go back to W2 as a FT employee.<p>My tech job skills include, PHP, MySQL, vanilla JS and jQuery. I don&#x27;t know testing, cloud, or CI&#x2F;CD practices. Jobs involve building small scale websites- at first only WordPress and eCommerce sites but around year 5 become more much web app SaaS-focused.<p>I have spent a very long time without work because I don&#x27;t really know how to fit myself into other places with such a skill set. I get interviews and then get rejected for not being good enough. But these are the skills I have the most experience in by far. I don&#x27;t have any other job skills that come close. I don&#x27;t have close friends and relatives who have a good pulse on the tech industry. I do have a Github portfolio- it&#x27;s not very &quot;hot&quot; or &quot;trendy&quot; tech but just things I do them because I enjoy doing them.<p>What other good options do I have? It doesn&#x27;t have to be highly relevant to work I&#x27;ve done in the past. Anyone have any ideas of what I can or should do?<p>A side note: I&#x27;ve been working remote since 2013 (may explain a lot about my how my career has went) and am pretty good with maintaining a schedule and discipline around WFH.",
      "time": 1654641370,
      "title": "Ask HN: Best alternative jobs for “outdated” skills with small websites/apps?",
      "type": "story"
    },
    {
      "by": "nradov",
      "descendants": 0,
      "id": 31660858,
      "score": 3,
      "time": 1654641293,
      "title": "Hyundai Cargo Ship in the Pacific Just Made the First Autonomous Long Haul",
      "type": "story",
      "url": "https://www.thedrive.com/tech/hyundai-cargo-ship-in-the-pacific-just-made-the-first-autonomous-long-haul"
    }
  ]
}