{
  "stories": [
    {
      "by": "trwhite",
      "descendants": 0,
      "id": 29277922,
      "score": 1,
      "time": 1637334537,
      "title": "Six million Sky routers had serious security flaw",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-59332840"
    },
    {
      "by": "agustif",
      "descendants": 0,
      "id": 29277904,
      "score": 1,
      "text": "Hello Everyone, today we&#x27;ve had a very weird experience in our fb group, one of our admins has been demoted by himself (without doing anything) and I cannot add it him back now (says it already has a role)<p>Anyone working at fb knows what&#x27;s going on at the new groups webapp, on mobile old&#x27;s app It still appears as member&#x2F;admin, but on the new one doesnt",
      "time": 1637334412,
      "title": "Ash HN: Is something funny going on with new FB Groups?",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29277903,
      "score": 1,
      "time": 1637334397,
      "title": "'Apple Car' will disrupt auto industry, says Morgan Stanley",
      "type": "story",
      "url": "https://appleinsider.com/articles/21/11/19/apple-car-will-disrupt-auto-industry-says-morgan-stanley"
    },
    {
      "by": "nurettin",
      "descendants": 0,
      "id": 29277896,
      "score": 1,
      "time": 1637334360,
      "title": "Redis Command Lolwut",
      "type": "story",
      "url": "https://redis.io/commands/lolwut"
    },
    {
      "by": "hidden-spyder",
      "descendants": 0,
      "id": 29277893,
      "score": 1,
      "time": 1637334354,
      "title": "Is the Internet so full of spam that good information is impossible to find?",
      "type": "story",
      "url": "https://www.quora.com/Is-the-Internet-filling-up-with-useless-information-to-the-extent-good-information-is-nearly-impossible-to-find"
    },
    {
      "by": "j03b",
      "descendants": 0,
      "id": 29277866,
      "score": 2,
      "time": 1637334142,
      "title": "Launching a Startup on Cloudflare Workers",
      "type": "story",
      "url": "https://blog.cloudflare.com/developer-spotlight-tejas-metha-cclip/"
    },
    {
      "by": "earthisnotmine",
      "descendants": 0,
      "id": 29277855,
      "score": 1,
      "time": 1637334110,
      "title": "FastAPI Creator Sebastián RAMírez Interview",
      "type": "story",
      "url": "https://evrone.com/sebastian-ramirez-interview"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 29277833,
      "score": 1,
      "time": 1637334019,
      "title": "IBM's New Quantum Computer Is Double the Size of China's Jiuzhang 2",
      "type": "story",
      "url": "https://interestingengineering.com/ibms-new-quantum-computer-is-double-the-size-of-chinas-jiuzhang-2"
    },
    {
      "by": "tomaskafka",
      "descendants": 0,
      "id": 29277824,
      "score": 1,
      "time": 1637333978,
      "title": "If you worked in tech for 15 years, what have you done to keep it exciting?",
      "type": "story",
      "url": "https://twitter.com/zmagg/status/1461450620628451328"
    },
    {
      "by": "aleksiloytynoja",
      "descendants": 1,
      "id": 29277810,
      "kids": [
        29277843
      ],
      "score": 2,
      "text": "This week, ConstitutionDAO (https:&#x2F;&#x2F;www.constitutiondao.com&#x2F;) made an effort to purchase a rare copy of US Constitution in an auction organized by Sotheby&#x27;s.<p>Initiated by a few internet-native Twitter users with some following, ConstitutionDAO is a fully autonomous group of internet strangers that has gathered around a shared cause. Most members have never met one another or don&#x27;t necessarily even know who they are – they have come together from all over the world for their mission, to buy the Constitution.<p>ConstitutionDAO went viral immediately and became a phenomenon never seen before. The group broke records for the most money crowdfunded in less than 72 hours and eventually collected +$40M from +8000 members. The money was managed by a multi-signature crypto wallet with 13 signers (some of them represented anonymously).<p>Even though the group failed to purchase the Constitution, it&#x27;s a great example of mission-driven community-led organizations that can achieve phenomenal successes in a short period of time. Based on confidence created on trustless blockchain, people who have never met are able to organize themselves, engage with orchestrated efforts, and successfully conduct remarkable projects. Most importantly, this is all done so that each and every one of the participants feel engaged and being part of the community reaching a goal bigger than itself.<p>This organizational model creates a strong force for many fields in the future. Think about non-profits, political parties, hobby groups... that are transparently run by their members who are passionate about their mission. Internet and trustless blockchains enable global collaboration across borders, and crypto makes it possible to financially incentivize participants to push the org forward. Future opportunities are countless!<p>Think about Reddit that is owned and governed by us, the users, and karma would be financially denominated so that you would earn money when gaining upvotes (i.e. creating value to the platform)...<p>I strongly believe in the future of DAOs and, therefore, recently founded Kleoverse (https:&#x2F;&#x2F;www.kleoverse.com). We want to make it frictionless to discover the coolest DAOs and give you step-by-step instructions how to get involved – either as regular member or as a contributor who gets paid for their work!<p>If you find it interesting, ensure your early access by signing up today!",
      "time": 1637333900,
      "title": "Why DAOs create the most organizations of today?",
      "type": "story"
    }
  ]
}