{
  "stories": [
    {
      "by": "RioEmperio",
      "descendants": 0,
      "id": 31037966,
      "score": 1,
      "time": 1650013132,
      "title": "Camera Hacking App – Hack Someone’s Phone Camera Remotely",
      "type": "story",
      "url": "https://ios-data-recovery.com/camera-hacking-app-hack-someones-phone-camera/"
    },
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31037947,
      "score": 1,
      "text": "After several fruitful exchanges here on HN, I think I&#x27;m finally ready to start putting some of my personal work out there into the real-world!<p>My original &quot;plan&quot; (ie grand scheme) was to have everything figured out and perfected and then publish it all at once, fireworks and all. Needless to say I no longer think that&#x27;s a good idea...<p>So with a slow start, I don&#x27;t expect there to be any audience for probably quite some time, and I&#x27;m okay with that (it&#x27;ll give me time to play around anyway). But then, what else does one do besides regularly posting content? Where does one get quality, honest feedback? With so little feedback, how does one know if the content&#x27;s any good? And if one upholds to high standards (which I do), how can one present their work to reputable individuals without getting &quot;sympathy&quot; feedback? All of which then makes me wonder: What sets the successful &quot;creators&quot; apart from the rest? Quality? Timing? Luck? Network?<p>Sorry there&#x27;s a lot of unknowns as I&#x27;ve never done anything like this before (in fact this was probably why I had avoided sharing personal work for so long).<p>So for those of you who have been on this path:<p>What&#x27;s been your experience? What worked for you and what didn&#x27;t? How did you manage to get good feedback?<p>Do you know of any good resources (books, articles, etc) that cover this topic?<p>Thanks so much in advance! :)",
      "time": 1650012968,
      "title": "Ask HN: Finally ready to share my personal work, how to manage expectations?",
      "type": "story"
    },
    {
      "by": "coolandsmartrr",
      "descendants": 0,
      "id": 31037944,
      "score": 1,
      "time": 1650012961,
      "title": "Dropbox Backup",
      "type": "story",
      "url": "https://blog.dropbox.com/topics/product/new-ways-to-do-more-with-digital-content"
    },
    {
      "by": "Sydneysider44",
      "descendants": 0,
      "id": 31037941,
      "score": 1,
      "text": "I have a couple of ideas around software that (I think) are worthy of patenting. I want to know more about real-world examples of people, especially regular salaried software developers like me, who have successfully filed patents for themselves (not on behalf of and paid for by the organizations they work for).\nI have only heard anecdotally that software patents are particularly tough to file and even more tough (and expensive) to defend.<p>Some of that anecdotal knowledge about software patents I have is:<p>- They&#x27;re difficult to file and get approved.<p>- Expensive to defend (as would be any patent, I&#x27;d imagine?)<p>- I have heard that personal notes and diagrams regarding the idea can serve as a basis for the patent filing application.<p>Questions:<p>- What has your experience been like? What would you advise a novice with plenty of software experience?<p>- Did you file in multiple countries to make it robust?<p>- What other pertinent questions should I be asking?<p>I&#x27;m not particularly rich but have fairly good savings. I am in Australia working as a software developer.<p>Thanks!",
      "time": 1650012948,
      "title": "Software Patents – what was your experience?",
      "type": "story"
    },
    {
      "by": "Michelangelo11",
      "descendants": 1,
      "id": 31037868,
      "kids": [
        31037951
      ],
      "score": 2,
      "time": 1650012139,
      "title": "Denny Delk",
      "type": "story",
      "url": "http://www.dennydelk.com/"
    },
    {
      "by": "stared",
      "descendants": 0,
      "id": 31037860,
      "score": 1,
      "time": 1650012067,
      "title": "Examples of mathematical patterns that eventually fail",
      "type": "story",
      "url": "https://math.stackexchange.com/questions/111440/examples-of-patterns-that-eventually-fail"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 31037847,
      "score": 1,
      "time": 1650011925,
      "title": "Gerrit Is Awesome",
      "type": "story",
      "url": "https://techspot.zzzeek.org/2016/04/21/gerrit-is-awesome/"
    },
    {
      "by": "lixtra",
      "descendants": 0,
      "id": 31037842,
      "score": 3,
      "time": 1650011865,
      "title": "Gambit – open-source tools for doing computation in game theory",
      "type": "story",
      "url": "http://www.gambit-project.org/"
    },
    {
      "by": "peter_retief",
      "descendants": 0,
      "id": 31037840,
      "score": 1,
      "time": 1650011845,
      "title": "The code should be on GitHub",
      "type": "story",
      "url": "https://twitter.com/hardmaru/status/1514838070595829760"
    },
    {
      "by": "ivanvas",
      "descendants": 0,
      "id": 31037838,
      "score": 1,
      "time": 1650011828,
      "title": "A brief look at hey.com stack",
      "type": "story",
      "url": "https://www.hugo.im/blog/a-brief-look-at-heycom-stack/"
    }
  ]
}