{
  "stories": [
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 31563576,
      "score": 1,
      "time": 1653944380,
      "title": "Peter Higgs: I wouldn't be productive enough for today's academic system (2013)",
      "type": "story",
      "url": "https://www.theguardian.com/science/2013/dec/06/peter-higgs-boson-academic-system"
    },
    {
      "by": "calebmontiveros",
      "descendants": 0,
      "id": 31563566,
      "score": 1,
      "time": 1653944276,
      "title": "American Times, Roman Morals",
      "type": "story",
      "url": "https://pacification.substack.com/p/american-times-roman-morals"
    },
    {
      "by": "ffenix113",
      "descendants": 0,
      "id": 31563542,
      "score": 1,
      "time": 1653944126,
      "title": ".NET IQueryable-like generator for Golang",
      "type": "story",
      "url": "https://github.com/ffenix113/goquery"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 31563510,
      "kids": [
        31563512
      ],
      "score": 1,
      "time": 1653943943,
      "title": "Must We Grow?",
      "type": "story",
      "url": "https://www.nybooks.com/articles/2022/06/09/must-we-grow-consumerism-michelle-nijhuis/"
    },
    {
      "by": "vwoolf",
      "descendants": 1,
      "id": 31563467,
      "kids": [
        31563474
      ],
      "score": 1,
      "time": 1653943622,
      "title": "Clean-Power Megaproject Held Hostage by a Ranch and a Bird",
      "type": "story",
      "url": "https://www.bloomberg.com/graphics/2022-clean-energy-power-lines-transwest-wind-maps-private-property/"
    },
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 31563465,
      "score": 1,
      "time": 1653943617,
      "title": "Sabotage and pistols – was Ellen Willmott gardening's ‘bad girl’?",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/stories-61388646"
    },
    {
      "by": "hansaw",
      "descendants": 1,
      "id": 31563463,
      "kids": [
        31563515
      ],
      "score": 2,
      "text": "After having sold my small business and having landed a well paying job, I find myself with some money to start saving for the first time in my adult life.<p>I&#x27;m in my late 20s, in a long term relationship, no kids, no money I can count on from my parents, and have ~70K sitting idle in my bank account. My goal is to preserve it, defend against inflation, and in general being responsible with it.<p>I could open a savings account and let the bank take care of it, but it looks to me that managing savings is not rocket science: ETF &#x2F; index fund should do the trick. And I could save in fees. Also, I&#x27;d like to learn.<p>Am I right? How can I learn how to manage my finances? What tools to use, what simple strategies to pursue, and whatnot. Tried to Google it &#x2F; find YT videos but it&#x27;s all a huge content marketing mess. Everyone pitching &quot;how to retire early&quot; or &quot;how to make money in the stock market&quot;. I&#x27;m not interested: I just want to be proactive and prepared with my personal finances, so that in 10 years from now I can buy a house (not interested in taking a mortgage now: I value flexibility more) and take care of my potential future family.<p>Would love to hear your strategies and your advice on how I can learn.",
      "time": 1653943605,
      "title": "Ask HN: How to Invest Savings?",
      "type": "story"
    },
    {
      "by": "napbree",
      "descendants": 0,
      "id": 31563460,
      "score": 1,
      "text": "We&#x27;ve had a challenge asked of us. Re-creating a PDF Catalogue that has around 530 pages (about 1300 products) into a digital form.<p>Logic being they have to pay and spend a lot of time to create a PDF and then a digital version (basically a PDF Viewer which has some interactivity) and then reformat the data to import the product into an ordering tool.<p>By consolidating these steps, we could import it into the ordering tool (or a pre-processor which runs along side the ordering tool) and &quot;spit out&quot; the relevant versions. However, I don&#x27;t think it&#x27;s realistic to generate a PDF version programmatically, so we may still have to setup a PDF generated via data using InDesign (not a disaster) but then we have the challenge of recreating a digital catalogue on the web.<p>They can&#x27;t lose the ability to print the &quot;digital catalogue&quot; which restricts us, I believe.<p>Any ideas &#x2F; anyone seen anything in the wild that works well?<p>EDIT: Worth saying, the ordering tool is built in NET Core.",
      "time": 1653943572,
      "title": "Ask HN: Replacing PDF Catalogue with just digital?",
      "type": "story"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 31563446,
      "score": 1,
      "time": 1653943502,
      "title": "DeLorean returns with 300-mile Taycan rival for 2024",
      "type": "story",
      "url": "https://www.autocar.co.uk/car-news/new-cars/official-delorean-returns-300-mile-taycan-rival-2024"
    },
    {
      "by": "0x64",
      "descendants": 0,
      "id": 31563435,
      "score": 1,
      "time": 1653943458,
      "title": "Ethereum's “Ropsten” testnet to be upgraded to Proof-of-Stake in early June",
      "type": "story",
      "url": "https://blog.ethereum.org/2022/05/30/ropsten-merge-announcement/"
    }
  ]
}