{
  "stories": [
    {
      "by": "onpedrof",
      "descendants": 0,
      "id": 30599024,
      "score": 2,
      "time": 1646741375,
      "title": "Better.com plans to lay off about 4k people this week",
      "type": "story",
      "url": "https://techcrunch.com/2022/03/07/better-com-plans-to-lay-off-about-4000-people-this-week-sources-say/"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30599018,
      "score": 1,
      "time": 1646741276,
      "title": "Ageing reversal: scientists rejuvenate tissues in middle-aged mice",
      "type": "story",
      "url": "https://www.theguardian.com/science/2022/mar/07/ageing-reversal-scientists-rejuvenate-tissues-in-middle-aged-mice"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30598972,
      "score": 6,
      "time": 1646740820,
      "title": "Ukrainian drone enthusiasts detect Russian forces",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=s_X_N985OHs"
    },
    {
      "by": "chrisbarry",
      "descendants": 1,
      "id": 30598947,
      "kids": [
        30599003
      ],
      "score": 2,
      "text": "I&#x27;ve got a lot of experience in a lot of different types of development. (I regularly write in Python, JavaScript and C#, and sometimes in Kotlin, Swift, PHP etc... I have never run a big Kafka&#x2F;Hadoop cluster or some high performance system in akka&#x2F;erlang. Or writen enough lisp). I&#x27;m pro relational database, less so no-sql unless a good fit. I like JSON fields. Prefer redis to speed things up.<p>I&#x27;ve built huge web platforms and worked in almost every frontend framework. Plus about 10 years on and off Unity experience.<p>I run a small agency on my own and get on well with a number of clients.<p>However, it&#x27;s immensely difficult to get a handle on it all, a lot of the projects I do are &quot;difficult&quot; ie require a range of skillsets that I&#x27;d struggle to find a single developer to cover all the bases.<p>I can&#x27;t work out, what if anything, if I was to try to become &quot;more sensible&quot; what I would restrict myself to in order to stop streching myself so thinnly across so many different technologies and enviroments.<p>My first job for 4-5 years was managing teams of 10-20 as a Technical Project Manager, and I moved into seriously delivering the technology over the last 10.<p>I feel like the answer is to provide a much bulkier up front process (planning &#x2F; design &#x2F; ux) in order to grow the value of the work I do, but I&#x27;ve kind of specialised myself in doing the development work as quickly and cost effectively as possible. Obivously that means sometimes there are problems, but in general, as I&#x27;ve delivered so quickly, I&#x27;m still about 10x under market rate. And I don&#x27;t feel it&#x27;s my world to do design&#x2F;ux.<p>I have regardly been involved in RapidStarts. ie 2 day hackathons where I delvier a working protype ready for presentation to CEO&#x2F;CTO level people, and have generally shone in these situations.<p>Working like this is breaking me though, so I&#x27;d like to sensibly move to something else or start doing things differently.<p>Perhaps it is just working in a job or working as a day rate contractor? Or selling my business&#x2F;skills differently.<p>If I was to get a job, what role should I aim for?<p>Any thoughts appreicated!",
      "time": 1646740597,
      "title": "I'm a full stack developer and I can't workout how to package my experience",
      "type": "story"
    },
    {
      "by": "throw0101a",
      "descendants": 0,
      "id": 30598944,
      "score": 2,
      "time": 1646740590,
      "title": "HCA Red List of Endangered Crafts",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/HCA_Red_List_of_Endangered_Crafts"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 30598943,
      "score": 2,
      "text": "Dear Mojeek community,<p>Today we can now update the index-size timeline once again, and this time it’s a very big milestone, 5 billion pages!<p>Whilst other alternative options in search have stayed tied to Big Tech indexes, we’ve continued to plug away on our mission to provide the world with a true alternative in search. A search solution which doesn’t require a relationship with a company that doesn’t share our perspective on many important issues.<p>This means that when you search on Mojeek, you are providing no support to a company whose business model is based on harvesting the data of its users, tagging them with aspects of their history and demographics, and selling access to this package off to the highest bidder.<p>If you’d like to celebrate this milestone with us, we invite you to come talk search on https:&#x2F;&#x2F;community.mojeek.com",
      "time": 1646740575,
      "title": "Mojeek Search Index Now 5B Pages and Counting",
      "type": "story"
    },
    {
      "by": "keewee7",
      "descendants": 1,
      "id": 30598917,
      "kids": [
        30598977
      ],
      "score": 3,
      "time": 1646740338,
      "title": "Over 700 rectors, many from top Russian technical universities, support the war.",
      "type": "story",
      "url": "https://www.rsr-online.ru/news/2022-god/obrashchenie-rossiyskogo-soyuza-rektorov1/"
    },
    {
      "by": "dola",
      "descendants": 0,
      "id": 30598902,
      "score": 6,
      "time": 1646740119,
      "title": "Google Cloud to acquire Mandiant for $5.4B",
      "type": "story",
      "url": "https://www.googlecloudpresscorner.com/2022-03-08-mgc"
    },
    {
      "by": "moody5bundle",
      "descendants": 1,
      "id": 30598898,
      "kids": [
        30599056
      ],
      "score": 2,
      "text": "I have stumbled upon a weird thing today and don&#x27;t know what to think about it:\nif you navigate on Linus Torvald&#x27;s github page (https:&#x2F;&#x2F;github.com&#x2F;torvalds) you see he is a member of one organization. I was curious about that organization and went to check it out (https:&#x2F;&#x2F;github.com&#x2F;DROPCitizenShip) and the link on their profile is pointing to a very weird scam site...? you will only see the scam once, when you visit the first time, every other visit so far produced a simple looking landing page. Did I drink too much tea today or why does this seem so off to me?",
      "time": 1646740084,
      "title": "Ask HN: Is Linus Torvalds GitHub page a scam?",
      "type": "story"
    },
    {
      "by": "keewee7",
      "descendants": 0,
      "id": 30598888,
      "score": 7,
      "time": 1646740003,
      "title": "My own house is reportedly destroyed by Russian Forces. The R&D lab is gone.",
      "type": "story",
      "url": "https://twitter.com/vshymanskyy/status/1501132484062425089"
    }
  ]
}