{
  "stories": [
    {
      "by": "lsllc",
      "descendants": 0,
      "id": 27885630,
      "score": 1,
      "time": 1626718467,
      "title": "Pegasus Project: Apple iPhones compromised by NSO spyware",
      "type": "story",
      "url": "https://www.amnesty.org/en/latest/news/2021/07/pegasus-project-apple-iphones-compromised-by-nso-spyware/"
    },
    {
      "by": "biznerd",
      "descendants": 0,
      "id": 27885625,
      "score": 1,
      "text": "I was in college when they IPOed. The founders seemed to really have a vision to be the anti-Microsoft. Stuff like 20% time, free food, moonshot projects, etc.<p>Now it seems they&#x27;re just another big tech company. The news is filled about how they&#x27;re not up to very good stuff.<p>What happened?",
      "time": 1626718436,
      "title": "Ask HN: Decline of Google as a “Utopian” Company",
      "type": "story"
    },
    {
      "by": "alfreadx",
      "descendants": 0,
      "id": 27885623,
      "score": 1,
      "time": 1626718433,
      "title": "Go Protein Bars",
      "type": "story",
      "url": "https://www.vurzo.co.uk/"
    },
    {
      "by": "hw",
      "descendants": 0,
      "id": 27885615,
      "score": 1,
      "time": 1626718388,
      "title": "Letsencrypt Service Disruption",
      "type": "story",
      "url": "https://letsencrypt.status.io/pages/incident/55957a99e800baa4470002da/60f5b56d1c82f805369a7d98"
    },
    {
      "by": "MathCodeLove",
      "descendants": 0,
      "id": 27885602,
      "score": 1,
      "text": "Simple put, I can develop applications. I&#x27;m a (somewhat) competent software engineer, yet I find myself becoming increasingly frustrated by what I perceive to be an unnecessary amount of friction most tools require in order for me to actually make something. I feel as if there&#x27;s some magical tool, language, framework, or technology that exists which could immensely improve my developer experience if I just found it and used it. While I doubt the magic tool actually exists, I am interested in hearing how other developers minimize this friction.",
      "time": 1626718310,
      "title": "Ask HN: What tools/frameworks to use to reduce friction from idea to execution",
      "type": "story"
    },
    {
      "by": "jsbdk",
      "descendants": 0,
      "id": 27885590,
      "score": 1,
      "time": 1626718252,
      "title": "60% of people admitted to hospital with Covid are double-jabbed",
      "type": "story",
      "url": "https://news.sky.com/story/covid-19-60-of-people-being-admitted-to-hospital-with-coronavirus-have-been-double-jabbed-says-vallance-12359317"
    },
    {
      "by": "mastrsushi",
      "descendants": 0,
      "id": 27885571,
      "score": 1,
      "text": "I want to write a minimal browser layout engine. I know it&#x27;s an extremely daunting task, I don&#x27;t intend to converge with HTML5 compatibility. I just find browsers fascinating and would like to learn more about them.<p>I want to have an actual Window appear that can emit text, color, and shapes. I don&#x27;t want to use a graphic UI framework like WPF. I also believe a graphics library like DirectX or OpenGL would be overkill as it&#x27;s adding features I don&#x27;t need, but I really don&#x27;t know. Chrome and Firefox use ANGLE, maybe that&#x27;s a start?<p>TLDR If I wanted to write a layout engine for multiple OS&#x27;s, should this be built on top of a graphics library, a windowing system, both, or something entirely different?",
      "time": 1626718081,
      "title": "Ask HN: Writing a layout engine for multiple operating systems",
      "type": "story"
    },
    {
      "by": "pramodbiligiri",
      "descendants": 0,
      "id": 27885554,
      "score": 1,
      "time": 1626718013,
      "title": "FaaSNet: Provisioning of Custom Serverless Container Runtimes at Alibaba Cloud",
      "type": "story",
      "url": "https://arxiv.org/abs/2105.11229"
    },
    {
      "by": "ushakov",
      "descendants": 1,
      "id": 27885519,
      "kids": [
        27885588
      ],
      "score": 1,
      "text": "recently, i&#x27;ve noticed an interesting trend:<p>startups don&#x27;t translate their products, despite their teams&#x2F;founders being polyglot<p>this is true especially among YC startups<p>for instance, i&#x27;ve seen YC-baked startups with European roots, but none of them offer product in their home language<p>does anybody have an explanation why this has happened?<p>in my experience, companies are more eager to work with you if you speak their language",
      "time": 1626717818,
      "title": "Ask HN: Why startups don't translate the products?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27885509,
      "score": 1,
      "time": 1626717774,
      "title": "MicroMacro: Crime City named winner of 2021 Spiel des Jahres",
      "type": "story",
      "url": "https://www.toynews-online.biz/2021/07/19/micromacro-crime-city-named-winner-of-2021-spiel-des-jahres/"
    }
  ]
}