{
  "stories": [
    {
      "by": "kbrisso",
      "descendants": 0,
      "id": 31389742,
      "score": 1,
      "text": "Would you spend time on a side project hosted on GitHub or practicing algorithms? I&#x27;m finding myself chasing my tail at times. I do have a full time job but I want to find something else to do.  I would like to get  job using Electron&#x2F;React or React native (don&#x27;t hate - I find Electron fun to build desktop apps) so I&#x27;m building a project that uses Electron&#x2F;React so I can get the experience.",
      "time": 1652639377,
      "title": "Ask HN: Whats more important in regards to finding a new job?",
      "type": "story"
    },
    {
      "by": "neo_optimus",
      "descendants": 0,
      "id": 31389724,
      "score": 2,
      "text": "I recently got promoted to a senior position involving one of the top distributed system projects in the world. The journey till here was very strenuous for myself, and the next level seems very difficult to reach without better mental structures in place. Even becoming a senior required putting in a lot of extra effort in my day to day activities so that I can barely achieve all objectives by the deadline, compared to my teammates with a similar workload. Because of my executive dysfunction, I&#x27;m having a hard time with the following things and I need to put in extra effort (on order of multiple hours everyday). It took me many, many months to develop simple planning and organization abilities, for eg. planning for the day at a granularity that doesn&#x27;t overwhelm me and yet provide me a good enough overview of tasks so that I don&#x27;t miss out on anything.<p>1. Tracking multiple small work items, especially the tail end work items that are inherently boring: As a mid level engineer when I was working on a maximum of couple of work items, it was easier to focus on them and track deployments, follow ups with others etc. It becomes exponentially tougher for me once it goes beyond 2 work items.<p>2. Understanding a mature big project in detail: I have always been able to efficiently work on projects that require working from ground up as they provided extra motivation. I can even handle medium size projects as I can work with a few unknowns. But for huge projects spanning teams worth 100s of team members, it becomes overwhelmingly difficult to focus on my subproject without trying to understand everything it touches upon. Maybe it&#x27;s a result of perfectionist tendencies, maybe it&#x27;s because I have problems starting work items with extremely limited amount of scope compared to the workings of the whole project. There are new terms, new things very slightly unrelated to my smaller project at hand that I don&#x27;t know no matter how much I learn.<p>3. Relatively efficient multi tasking: Once I get started on any task, it takes a while for me to get going, and even after finishing it up, it takes a while to start on another task as well.  \nI&#x27;m extremely efficient once I get into the zone and the task is a big enough unit that only I have to work on. But when the project involves interacting with multiple stakeholders in an async manner, it gets split into tens of small units requiring immense willpower to start and stop. If these units are not big enough, this results in lengthy procrastination times that ultimately reduces my productivity to 10% compared to when I&#x27;m working on a single big item by myself. This problem is easily avoidable at junior&#x2F;mid level engineer, but at senior level these are prerequisite rather than a choice.<p>4. Acceptance with the nature of work: I have always loved Computer Science ever since I understood its basic concepts. I have worked at fintech companies where the work involved understanding and interacting with core C&#x2F;C++ constructs and computer science fundamentals to extract the maximum execution speed to give that edge in trading, and that was immensely satisfying. But at senior level and above, most if not all software companies require work that&#x27;s less research&#x2F;depth in nature and more planning&#x2F;organizing&#x2F;breadth in nature. I have considered doing a MS&#x2F;PhD but at the moment I want to continue evolving in the role I have.<p>I&#x27;m interested in any and all opinions&#x2F;points of view here, ranging from &quot;Use X technique&#x2F;tool to help being organized&#x2F;plan&#x2F;etc.&quot; to &quot;I struggled with similar issues, and here&#x27;s how I cope&#x2F;developed structures to help with this over the years&quot;.",
      "time": 1652639208,
      "title": "Ask HN: Senior Engineers with ADHD, any mental/physical structures for work?",
      "type": "story"
    },
    {
      "by": "Rerarom",
      "descendants": 0,
      "id": 31389715,
      "score": 1,
      "time": 1652639128,
      "title": "Steve Jobs: The Next Insanely Great Thing (1996)",
      "type": "story",
      "url": "https://www.wired.com/1996/02/jobs-2/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31389709,
      "score": 2,
      "time": 1652639098,
      "title": "A Russian Operator Urged Catalonian Leaders to Break with Madrid",
      "type": "story",
      "url": "https://www.occrp.org/en/investigations/fueling-secession-promising-bitcoins-how-a-russian-operator-urged-catalonian-leaders-to-break-with-madrid"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31389703,
      "score": 2,
      "time": 1652639043,
      "title": "Elon Musk says Twitter's legal team told him he broke his NDA",
      "type": "story",
      "url": "https://www.businessinsider.com/elon-musk-twitter-legal-violated-nda-2022-5"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31389683,
      "score": 1,
      "time": 1652638930,
      "title": "Building bridges with difficult co-workers",
      "type": "story",
      "url": "https://leaddev.com/communication-relationships/building-bridges-difficult-co-workers"
    },
    {
      "by": "cmitsakis",
      "descendants": 0,
      "id": 31389682,
      "score": 1,
      "time": 1652638928,
      "title": "Why Going Faster-Than-Light Leads to Time Paradoxes [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=an0M-wcHw5A"
    },
    {
      "by": "gogo61",
      "descendants": 0,
      "id": 31389679,
      "score": 1,
      "time": 1652638924,
      "title": "How to Choose a Gift?",
      "type": "story",
      "url": "https://irohitgupta.com/blog/2022/05/15/gift/"
    },
    {
      "by": "paulgb",
      "descendants": 0,
      "id": 31389647,
      "score": 6,
      "time": 1652638740,
      "title": "The Problem with Bitcoin Miners",
      "type": "story",
      "url": "https://paulbutler.org/2022/the-problem-with-bitcoin-miners/"
    },
    {
      "by": "julosflb",
      "descendants": 0,
      "id": 31389645,
      "score": 1,
      "time": 1652638736,
      "title": "“Carbon Bombs” – Mapping key fossil fuel projects",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S0301421522001756"
    }
  ]
}