{
  "stories": [
    {
      "by": "geekydev",
      "descendants": 0,
      "id": 30806719,
      "score": 1,
      "time": 1648240080,
      "title": "Can You Win at Gambling? A Real Casino vs. My Computer Simulation",
      "type": "story",
      "url": "https://blog.devgenius.io/can-you-really-win-at-gambling-a-real-casino-vs-my-computer-simulation-14db4e241eba?gi=6dac67ebe342"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30806680,
      "score": 2,
      "time": 1648239791,
      "title": "Intel Virtualization and Apple Silicon",
      "type": "story",
      "url": "https://www.highcaffeinecontent.com/blog/20220325-Intel-Virtualization-and-Apple-Silicon"
    },
    {
      "by": "ummonk",
      "descendants": 0,
      "id": 30806668,
      "score": 2,
      "time": 1648239714,
      "title": "YouTube blocks WION for reporting Russian statement",
      "type": "story",
      "url": "https://www.wionews.com/india-news/youtube-blocks-wion-for-reporting-russian-statement-465552"
    },
    {
      "by": "jklp",
      "descendants": 1,
      "id": 30806665,
      "kids": [
        30806738
      ],
      "score": 2,
      "time": 1648239697,
      "title": "Apple forced to allow Sideloading and 3rd-party app stores under new EU law",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/25/22996248/apple-sideloading-apps-store-third-party-eu-dma-requirement"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 30806656,
      "score": 2,
      "time": 1648239621,
      "title": "Quota Plan May Destroy Oscars",
      "type": "story",
      "url": "https://www.lamag.com/culturefiles/are-the-oscars-over-2/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30806634,
      "score": 1,
      "time": 1648239509,
      "title": "We Need International Agreement on How to Handle These Dangerous Technologies",
      "type": "story",
      "url": "https://slate.com/technology/2022/03/dual-use-surveillance-technology-export-controls.html"
    },
    {
      "by": "jicea",
      "descendants": 0,
      "id": 30806632,
      "score": 1,
      "time": 1648239498,
      "title": "Timeui, minimal profiling tool for the macOS",
      "type": "story",
      "url": "https://trycombine.com/posts/introducing-timeui/"
    },
    {
      "by": "database_guy",
      "descendants": 2,
      "id": 30806624,
      "kids": [
        30806638,
        30806641
      ],
      "score": 3,
      "text": "I&#x27;m a single engineer who wants to run a database by myself, no cloud vendors involved. I don&#x27;t really care about scalability to a point, I don&#x27;t really care about the API to interact with the database. I just want something that I can set up on multiple machines with minimal effort and have the loss of one of those nodes not cause catastrophic failures. I want the experience of something like etcd without being limited to a few gigabytes of data in the cluster (a Terabyte or maybe a couple hundred Gigabytes as a limit would probably be fine). I&#x27;ve spent a lot of time looking through the various options and wrote up my thoughts on why each of them wasn&#x27;t a good fit.<p>Postgres: A great database but HA options either have far too many moving parts, require manual intervention, are proprietary, or are Fake Open Source. Seems like there&#x27;s lack of interest in addressing this because companies that sponsor development generate a lot of value off complex operations<p>MySQL: This database has some odd behavior but that would be fine if it weren&#x27;t Fake Open Source<p>MariaDB: HA Options are poor or abandoned<p>SQL Server: Proprietary<p>Oracle: haha<p>CockroachDB: Fake Open Source<p>YugabyteDB: Fake Open Source. Special shout out here for not even linking to instructions for how to build the database in the readme.<p>MongoDB: Proprietary, and even before the license change it was Fake Open Source<p>Cassandra: Not fun to run, and even though I said I didn&#x27;t care about API I don&#x27;t necessarily love how it works. But it comes probably the closest?<p>ScyllaDB: Fake Open Source<p>TiDB: Fake Open Source<p>Singlestore: Fake Open Source<p>FoundationDB: This one comes close but its beginning as a proprietary database really hurt its community, which is way smaller now than it should be. Could grow into something great if more folks got behind it.<p>etcd: not suitable for use above a couple GB of data<p>What do I mean by Fake Open Source? A project that has a large percentage of its contributors beholden to a single organization&#x2F;entity to me is not really open source in spirit. I&#x27;m looking for a project where I can feel confident my contributions won&#x27;t effectively end up behind some proprietary license down the line if&#x2F;when the VC backed organization that primarily sponsors development decides it needs to protect itself from AWS. If there&#x27;s an &quot;Enterprise&quot; product and the organization calls the source code for the main project the &quot;Community Edition&quot; or something like it, it&#x27;s not Real Open Source. If a single organization shuts down and contributions fall off a cliff (https:&#x2F;&#x2F;github.com&#x2F;rethinkdb&#x2F;rethinkdb&#x2F;graphs&#x2F;contributors) it&#x27;s not Real Open Source. There are lots of Real Open Source projects with great communities of users&#x2F;contributors, but many of the newer databases don&#x27;t have legitimate open source development communities behind them, in my opinion.<p>I&#x27;ve probably missed some examples. Mostly, I wonder why there hasn&#x27;t been a general purpose open source database that does the operations stuff as well as the proprietary databases do. Am I missing something?",
      "time": 1648239409,
      "title": "Ask HN: Why are there no easy-to-use highly-available open source databases?",
      "type": "story"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 30806617,
      "score": 3,
      "time": 1648239384,
      "title": "UK exposes Russian spy agency behind cyber incidents",
      "type": "story",
      "url": "https://www.gov.uk/government/news/uk-exposes-russian-spy-agency-behind-cyber-incidents"
    },
    {
      "by": "knoxa2511",
      "descendants": 0,
      "id": 30806616,
      "score": 1,
      "time": 1648239383,
      "title": "Ask HN: What do you do with your cloudtrail logs?",
      "type": "story"
    }
  ]
}