{
  "stories": [
    {
      "by": "armagon",
      "descendants": 0,
      "id": 30969547,
      "score": 2,
      "text": "I just received an e-mail from Google yesterday that they are discontinuing G Suite Legacy Free edition (which I believe was called &#x27;Google Apps For Your Domain&#x27; back in the day). Public info is at https:&#x2F;&#x2F;www.ghacks.net&#x2F;2022&#x2F;01&#x2F;20&#x2F;google-ends-the-g-suite-legacy-free-edition-leaving-users-worried&#x2F;<p>They intend to have a free tier, but without the most important feature, e-mail at your existing e-mail address. I&#x27;ve set up my kids with e-mail addresses from this domain, and have a couple accounts myself, for ten accounts in all. The cheapest paid option is going to be $6 (USD, presumably) &#x2F; month &#x2F; account, or $720&#x2F;year for the 10 accounts, which is a non-starter, as I&#x27;m not using this for a business.<p>If possible, I&#x27;d like to keep the e-mail accounts working. I am able to administer my DNS settings, so changing the, uh, MX records shouldn&#x27;t be too hard.<p>What options should I look at? I gather that running your own e-mail server is horrible unless you want to spend your life running the server. Are there inexpensive services that will host e-mail with custom domains?",
      "time": 1649522492,
      "title": "Ask HN: Migrate from G Suite, keep email addresses?",
      "type": "story"
    },
    {
      "by": "vletal",
      "descendants": 0,
      "id": 30969537,
      "score": 1,
      "text": "Hey!<p>I would like to try to do some predictions of the upcoming French Presidential elections. Unfortunately I do not speak French which makes it a bit hard for me to search trough the official Frech GOV websites.<p>I tried https:&#x2F;&#x2F;api.gouv.fr&#x2F; - yet it _seems_ that it is not there. Is there please:<p><pre><code>  - a dataset (API) of district-wise results of previous elections? (Presidential, Regional, ...)\n\n  - is there a live API during the vote counting which provides information from the districts which already finished the count?\n\n</code></pre>\nI hope that there is a French crowd here as well :)<p>Thanks a lot!",
      "time": 1649522445,
      "title": "Ask HN: Is there an open API for upcoming French Presidential elections?",
      "type": "story"
    },
    {
      "by": "thebigman433",
      "descendants": 0,
      "id": 30969529,
      "score": 1,
      "time": 1649522345,
      "title": "Hacking a Trans-Atlantic Cable",
      "type": "story",
      "url": "https://twitter.com/hacker_/status/1512552850831851531"
    },
    {
      "by": "mcp_",
      "descendants": 0,
      "id": 30969516,
      "score": 1,
      "time": 1649522252,
      "title": "I Went Clubbing in Virtual Reality: Metaverse Raves",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ZRPjgSrQ8gA"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30969515,
      "score": 1,
      "time": 1649522247,
      "title": "Ways the Chip Shortage Is Rewiring Tech",
      "type": "story",
      "url": "https://spectrum.ieee.org/chip-shortage-rewiring-tech"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30969508,
      "score": 1,
      "time": 1649522207,
      "title": "Why China’s Version of Email Marketing Is So Effective",
      "type": "story",
      "url": "https://future.a16z.com/private-traffic-is-chinas-version-of-email-marketing/"
    },
    {
      "by": "OrvalWintermute",
      "descendants": 0,
      "id": 30969470,
      "score": 1,
      "time": 1649521928,
      "title": "Human Flourishing or “Living Naturally”: Alex Epstein’s Case for Using More Oil",
      "type": "story",
      "url": "https://www.forbes.com/sites/tilakdoshi/2022/03/31/human-flourishing-or-living-naturally-alex-epsteins-case-for-using-more-oil-coal-and-natural-gas/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30969468,
      "score": 2,
      "time": 1649521910,
      "title": "PCB Thermal Design Hack Gets Hot and Heavy",
      "type": "story",
      "url": "https://hackaday.com/2022/04/08/pcb-thermal-design-hack-gets-hot-and-heavy/"
    },
    {
      "by": "Tomte",
      "descendants": 1,
      "id": 30969439,
      "kids": [
        30969526
      ],
      "score": 2,
      "time": 1649521730,
      "title": "The era of fixing your own phone has nearly arrived",
      "type": "story",
      "url": "https://www.theverge.com/23017361/ifixit-right-to-repair-parts-google-samsung-valve-microsoft"
    },
    {
      "by": "ali92hm",
      "descendants": 0,
      "id": 30969437,
      "score": 2,
      "text": "Hi HN,<p>Like many of you I want to be able to enjoy my evenings after work by either reading books, spending time with friends, learning something new, working on side projects, workout, or running errands. However, I&#x27;m typically way too tired to get myself off the couch on most days to do anything and unfortunately I cannot take a nap or sleep to recharge. I&#x27;m only able to consume easy to digest content in this state. This was both the case with WFH or going to the office.<p>The other day I took a shower after I got back home and it was extremely recharging. I&#x27;ve been forcing myself to walk into the office which gives me a separation between work and home and also forces me to walk 30 mins to and from the office which is a great daily exercise.<p>What have worked for you that allows you to recharge after a day of work so you can use the evening for the activities you like to do?",
      "time": 1649521707,
      "title": "Ask HN: What do you do to recharge after a day of work?",
      "type": "story"
    }
  ]
}