{
  "stories": [
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32140491,
      "score": 1,
      "time": 1658163442,
      "title": "On Transitioning from Software Developer to Architect (2020)",
      "type": "story",
      "url": "https://www.databasesandlife.com/developer-to-architect/"
    },
    {
      "by": "yvbbrjdr",
      "descendants": 0,
      "id": 32140487,
      "score": 2,
      "text": "Thanks for checking out Babble! You might wonder why this app is even useful and why not just use Signal&#x2F;PGP. This app&#x27;s target audience is actually ordinary people in China or similar countries who are under severe government surveillance and censorship, where access to Signal and similar E2EE messaging software is blocked by nationwide firewalls, such as the Great Firewall of China (GFW).<p>Chinese people have been deprived of freedom of speech even before the COVID-19 pandemic. Li Wenliang, who was among the first to notice the spread of the virus and warned his colleagues about it in a <i>private</i> WeChat group, was admonished by the police for &quot;spreading rumors&quot;; his punishment was then aired on the national TV channel. After Wenliang passed away due to getting COVID-19 himself, discussions about it on China&#x27;s public Internet were highly restricted; most discussions will be deleted upon being posted, which was done by some automatic keyword detection mechanism.<p>Things got even worse over the years and especially during the Shanghai lockdown in early 2022. Everything related to questioning the public health policy is banned. Many people posted articles about how bad Shanghai&#x27;s economic and social situation is on their WeChat public accounts. None of these articles, not even their accounts, can survive for longer than a few hours. Even articles crying for help, because people were starving, got deleted.<p>A video called Voice from Shanghai Lockdown (<a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;38_thLXNHY8\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;38_thLXNHY8</a>), which contains audio recordings of desperate Shanghai people during the lockdown, went viral on Chinese social media at the end of this April. Unsurprisingly, this video was immediately censored. People got angry and tried to spread this video as much as possible by re-posting it again and again, racing against the detection algorithm. But it was futile.<p>It&#x27;s just like 1984, where the number of words available to say &quot;legally&quot; is decreasing. There are no tools available for people to speak out. Public social media and private messaging apps are all monitored by the government. Foreign tools such as Telegram, Signal, or anything similar are blocked by the GFW. PGP is too technical for normal people. The goal of Babble is to provide those people with a cryptographic and steganographic tool that&#x27;s easy enough to use but secure enough against a censorship system. It&#x27;s not perfect as of now, but we are making an effort to make it better.<p>Yes, Babble might get removed from the App Store in China if the Chinese government asks, but it&#x27;s fundamentally different from Signal being blocked - there are a considerable number of people in China who has an overseas Apple ID so that they can download apps not on Chinese App Store, but to use Signal, you have to bypass GFW, which fewer people know how to. One of the real challenges for this project though, is how to get people aware of the situation, because our education is brainwashing and people are starting to take surveillance and censorship for granted. And it&#x27;s very hard for the app to reach its intended audience because the surveillance system is designed to prevent them from accessing this kind of tool.",
      "time": 1658163425,
      "title": "Show HN: Babble – a tool for encrypting text and image you post/send to others",
      "type": "story",
      "url": "https://babble.landrop.app/"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 32140456,
      "score": 2,
      "time": 1658163261,
      "title": "Homeland Security records show 'shocking' use of phone data, ACLU says",
      "type": "story",
      "url": "https://www.politico.com/news/2022/07/18/dhs-location-data-aclu-00046208"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 32140455,
      "score": 1,
      "time": 1658163245,
      "title": "Spot Bitcoin ETF approval hinges on big ask",
      "type": "story",
      "url": "https://www.axios.com/2022/07/18/spot-bitcoin-etf-approval-sec"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32140436,
      "score": 1,
      "time": 1658163165,
      "title": "High-flying experiment: Do stem cells grow better in space?",
      "type": "story",
      "url": "https://apnews.com/article/space-exploration-science-health-shootings-841ed7547d8b1a73b42531e593632e6d"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 32140414,
      "score": 1,
      "time": 1658163044,
      "title": "Scratch – coding tools and community for children",
      "type": "story",
      "url": "https://scratch.mit.edu"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 32140385,
      "score": 2,
      "time": 1658162917,
      "title": "The Many Reasons ESG Is a Loser",
      "type": "story",
      "url": "https://www.wsj.com/articles/esg-loser-funds-costs-basis-points-blackrock-500-environment-green-sec-11657461127"
    },
    {
      "by": "pj3677",
      "descendants": 0,
      "id": 32140382,
      "score": 1,
      "time": 1658162914,
      "title": "Nvidia Canvas: AI for creating realistic landscape images",
      "type": "story",
      "url": "https://www.nvidia.com/en-us/studio/canvas/"
    },
    {
      "by": "shadycuz",
      "descendants": 1,
      "id": 32140366,
      "kids": [
        32140410
      ],
      "score": 1,
      "time": 1658162837,
      "title": "Show HN: Terraform module template with pre-configured CICD",
      "type": "story",
      "url": "https://github.com/DontShaveTheYak/terraform-module-template"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 32140349,
      "score": 1,
      "time": 1658162751,
      "title": "Metas and Minimums",
      "type": "story",
      "url": "https://laulpogan.substack.com/p/metas-and-minimums"
    }
  ]
}