{
  "stories": [
    {
      "by": "codeismath",
      "descendants": 0,
      "id": 29582490,
      "score": 1,
      "text": "Hi HN,<p>Should I upgrade my development and business workstation from Windows 10 to Linux (instead of upgrading to Windows 11)?<p>I&#x27;m extremely intimidated in taking the leap.  I&#x27;m very familiar with Linux without a UI, and feel very comfortable with managing linux servers.  I setup and run a cluster of RHEL servers for a private-cloud OpenStack deployment (kvm hypervisor).  Familiar with apache web servers, and I run my own Asterisk PBX phone system, and have in the past done my own email server.  Networking, iptables, etc.<p>But I&#x27;ve never used Linux in a desktop UI environment.  Ever.  Always been an MS Windows guy.  But Windows 11?<p>I think my biggest fear are driver issues and having to convert a ton of files over to new formats for things I use to run my business.  (Lots of MS Excel files for example).  I use Microsoft Office (Word, Outlook, Excel) and Microsoft Visual Studio (F# Development) heavily.  Excel is my biggest worry.  And fighting with driver issues.<p>I&#x27;m familiar mostly with RHEL (CentOS, and I guess now &quot;Rocky Linux&quot;).<p>Anyone here convert from Windows to Linux?  What kind of issues did you run into?  Should I do it?<p>Perhaps most importantly:  Which Linux distro should I choose, and which desktop environment?<p>-AMD Ryzen Threadripper 2950X 16-Core 3.50 GHz<p>-Aorus X399 XTreme EATX TR4<p>-128GB RAM<p>-NVIDEO GeForce RTX 2080 (Gigabyte)<p>-(Two) 1TB NVMe Samsung SSD 970",
      "time": 1639682101,
      "title": "Ask HN: Upgrade from Windows 10 to Linux instead of Windows 11?",
      "type": "story"
    },
    {
      "by": "artembugara",
      "descendants": 0,
      "id": 29582486,
      "score": 1,
      "time": 1639682086,
      "title": "Mining Financial Stock News Using SpaCy Matcher",
      "type": "story",
      "url": "https://newscatcherapi.com/blog/spacy-matcher-mining-financial-stock-news"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29582455,
      "score": 1,
      "time": 1639681922,
      "title": "Mailing List Usability",
      "type": "story",
      "url": "https://www.nngroup.com/articles/mailing-list-usability/"
    },
    {
      "by": "manjana",
      "descendants": 0,
      "id": 29582437,
      "score": 1,
      "time": 1639681815,
      "title": "tqdm (Python)",
      "type": "story",
      "url": "https://tqdm.github.io/"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 29582433,
      "kids": [
        29582434
      ],
      "score": 1,
      "time": 1639681813,
      "title": "What if. like. what if chat messages. but like this",
      "type": "story",
      "url": "https://cloudwithlightning.net/random/dialog-portraits/"
    },
    {
      "by": "dgaff",
      "descendants": 0,
      "id": 29582422,
      "score": 1,
      "time": 1639681769,
      "title": "Falsifying Traffic Counts to Manipulate Website Auction Marketplaces",
      "type": "story",
      "url": "https://www.ipm-corporation.com/research/falsifying-traffic-counts-to-manipulate-website-auction-marketplaces"
    },
    {
      "by": "tomstim",
      "descendants": 0,
      "id": 29582420,
      "score": 3,
      "time": 1639681756,
      "title": "Facebook Comments About Whites, Men and Americans Will Face Less Moderation",
      "type": "story",
      "url": "https://www.forbes.com/sites/jemimamcevoy/2020/12/03/on-facebook-comments-about-whites-men-and-americans-will-face-less-moderation/"
    },
    {
      "by": "DrHilarius",
      "descendants": 0,
      "id": 29582417,
      "score": 1,
      "time": 1639681738,
      "title": "Refugees lack COVID shots because drugmakers fear lawsuits",
      "type": "story",
      "url": "https://www.reuters.com/world/refugees-lack-covid-shots-because-drugmakers-fear-lawsuits-documents-2021-12-16/"
    },
    {
      "by": "crackercrews",
      "descendants": 0,
      "id": 29582385,
      "score": 1,
      "time": 1639681625,
      "title": "Pony.ai’s permit to test driverless vehicles in CA is suspended after crash",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/14/22834496/pony-ai-av-test-permit-suspend-california-dmv-crash"
    },
    {
      "by": "GhettoComputers",
      "descendants": 0,
      "id": 29582374,
      "score": 1,
      "text": "There is something very magical about how Nintendo doesn&#x27;t focus on powerful specs as much as fun gameplay, and I remember reading about this philosophy. The systems are made from existing mass produced hardware (the Wii was basically a slightly more powerful GameCube with novel controls: the GameCube&#x27;s Gekko PowerPC Processor, a modified PPC750CXe, is only 486MHz while the Wii Broadway Power PC Processor, a close to stock PPC750CL, is 729MHz. That pegs the Wii processor at roughly 67% more powerful than the GameCube.)<p>https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Gunpei_Yokoi#Lateral_Thinking_with_Withered_Technology<p>He articulated his philosophy of &quot;Lateral Thinking of Withered Technology&quot; (枯れた技術の水平思考, &quot;Kareta Gijutsu no Suihei Shikō&quot;) (also translated as &quot;Lateral Thinking with Seasoned Technology&quot;) in the book Yokoi Gunpei Game House. &quot;Withered technology&quot; in this context refers to a mature technology which is cheap and well understood. &quot;Lateral thinking&quot; refers to finding radical new ways of using such technology. Yokoi held that toys and games do not necessarily require cutting-edge technology; novel and fun gameplay are more important. In the interview he suggested that expensive cutting-edge technology can get in the way of developing a new product.<p>Even recently the Switch was basically just an Nvidia shield. Thoughts on this, and have you seen this philosophy in use anywhere else? I see that somewhat with installing linux on buying&#x2F;using computers deemed too slow.",
      "time": 1639681577,
      "title": "Nintendo: Lateral Thinking with Withered Technology (fun over specs)",
      "type": "story"
    }
  ]
}