{
  "stories": [
    {
      "by": "jcfrei",
      "descendants": 0,
      "id": 31505659,
      "score": 1,
      "text": "The Google Authenticator app got updated today. As a frequent user with lots of accounts I&#x27;ve noticed that the app is now significantly slower: It takes several seconds to start the application and to generate the next iteration of pins. The &quot;click to reveal pin&quot; is just jarring to use and doesn&#x27;t add any additional security in my opinion. Wondering if anybody else on HN shares this frustration.",
      "time": 1653491354,
      "title": "Google Authenticator Updated: Slower, Mandatory Click to Reveal",
      "type": "story"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 31505654,
      "score": 1,
      "time": 1653491342,
      "title": "“The Parent Trap:” Review of Hilger",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2022/05/the-parent-trap-review-of-hilger.html"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31505645,
      "score": 1,
      "time": 1653491280,
      "title": "How We Experience Time, Inflation Edition (2021)",
      "type": "story",
      "url": "https://ritholtz.com/2021/11/time-peak-inflation/"
    },
    {
      "by": "igorzij",
      "descendants": 0,
      "id": 31505640,
      "score": 1,
      "time": 1653491263,
      "title": "Show HN: AWS Bootstrap – Full stack on AWS in one click",
      "type": "story",
      "url": "https://awsbootstrap.io"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 31505636,
      "score": 1,
      "time": 1653491257,
      "title": "The DoD's use of Solatia and condolence payments in Iraq and Afghanistan (2007)",
      "type": "story",
      "url": "https://www.gao.gov/products/gao-07-699"
    },
    {
      "by": "argondonor",
      "descendants": 0,
      "id": 31505587,
      "score": 2,
      "text": "I have the unfortunate privilege of working in a space with some irritating qualities that over time have begun to wear on me, such as:<p>- a completely interior room, with no windows (nor possibility for windows)\n- no more than 15&#x27; square, with no sightlines from desk any further than the walls\n- track lighting with harsh spotlights<p>I take a lap around the building a few times a day just to let my eyes refocus and to get a glimpse of the sunlight, but that&#x27;s just a few moments of respite before I&#x27;m back into the dungeon. I&#x27;m looking for any ideas on how to make this better to sit in all day, because switching rooms isn&#x27;t an option. Appreciate any help&#x2F;tips.",
      "time": 1653491062,
      "title": "Ask HN: Tips for Improving a Windowless Workspace",
      "type": "story"
    },
    {
      "by": "LaSombra",
      "descendants": 0,
      "id": 31505584,
      "score": 1,
      "time": 1653491043,
      "title": "The Python GIL: Past, Present, and Future",
      "type": "story",
      "url": "https://www.backblaze.com/blog/the-python-gil-past-present-and-future/"
    },
    {
      "by": "djhaskin987",
      "descendants": 0,
      "id": 31505575,
      "score": 1,
      "time": 1653491011,
      "title": "Contextual Logging in Kubernetes 1.24",
      "type": "story",
      "url": "https://www.kubernetes.dev/blog/2022/05/25/contextual-logging/"
    },
    {
      "by": "ngaut",
      "descendants": 0,
      "id": 31505543,
      "score": 1,
      "time": 1653490877,
      "title": "Trends in open source Google Analytics alternatives",
      "type": "story",
      "url": "https://ossinsight.io/collections/google-analytics-alternative/trends/"
    },
    {
      "by": "CobaltFire",
      "descendants": 0,
      "id": 31505489,
      "score": 1,
      "text": "Just got the following email:<p>Dear Proton Supporter,<p>As a Proton Visionary or Lifetime subscriber, we are honored to have your support for our mission to build a better internet where privacy is the default. With the rollout of the new Proton ecosystem and the continued unification of our privacy services this week, our shared vision of this better internet is closer to being realized.<p>You are a special group, and much of what Proton has achieved over the years would not have been possible without your endorsement and support. As a way of saying thanks, we’re making the following improvements to Proton Visionary and Lifetime accounts at no extra cost:<p>We’ve boosted your total storage to 3,000 GB to help you make the most out of Proton Drive. It also means you’ll never have to worry about email storage again.\nWe’ve increased the number of email addresses you can have to 100.\nEach of your users can now connect to our high-speed VPN on up to 10 devices.\nVisionary and Lifetime subscribers will continue to receive free access to the paid versions of all new privacy services we release in the future. You will also continue to receive early access to all future features and products at no extra cost.<p>Proton Visionary is a special plan for the strongest early supporters of our mission, and for this reason, we are no longer offering it. As the plan becomes more exclusive in the future, we will provide additional unique benefits and enhancements.<p>Your opinion matters, and we also prioritize your feedback when it comes to setting the future direction of Proton. Your support tickets have the highest priority and are addressed first. However, if you have thoughts, suggestions, or other feedback that you would like to share with us, we’ve created an email channel just for you at protonvision@proton.me.<p>We look forward to hearing from you and continuing to serve you.<p>Thank you again for your support and for joining us on this journey.<p>Best regards,<p>Dr. Andy Yen\nFounder &amp; CEO\nProton",
      "time": 1653490693,
      "title": "ProtonMail Sunsets Visionary",
      "type": "story"
    }
  ]
}