{
  "stories": [
    {
      "by": "WaitWaitWha",
      "descendants": 0,
      "id": 30461602,
      "score": 1,
      "time": 1645744136,
      "title": "Magpies Help Each Other Remove Tracking Devices, Thwart Scientists",
      "type": "story",
      "url": "https://www.extremetech.com/extreme/331977-magpies-help-each-other-remove-tracking-devices-thwart-scientists"
    },
    {
      "by": "vinni2",
      "descendants": 0,
      "id": 30461594,
      "score": 1,
      "time": 1645744072,
      "title": "Elon Musk and brother under investigation for alleged insider trading",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2022/feb/24/elon-musk-brother-under-investigation-insider-trading"
    },
    {
      "by": "DriftRegion",
      "descendants": 0,
      "id": 30461574,
      "score": 1,
      "text": "My embedded projects are heavy on C. Libraries get developed and tested on linux x86_64 and deployed on baremetal ARM. I want to use Rust for new library development where possible. For this to work, running Rust libs in a C project has to be easy and compilation targets must be swappable. Bazel makes this tenable.",
      "time": 1645743918,
      "title": "Show HN: Mix Rust, C, and compilation targets with Bazel",
      "type": "story",
      "url": "https://github.com/driftregion/bazel-c-rust-x86_linux-armv7_baremetal"
    },
    {
      "by": "isoscrewed",
      "descendants": 0,
      "id": 30461560,
      "score": 2,
      "text": "Hi HN, hoping someone can point me to some good info.<p>My situation is that I started a new job at a startup recently. Let&#x27;s say June, 2021. Part of my compensation package included a number of ISOs.<p>While interviewing, I was aware that the company was raising a new round of funding. I joined the company intending to join _before_ this round closed to lock in a lower strike price. Though the details are not available to me, I believe the round of funding closed one or two months after I joined the company. It was at least announced internally at that time.<p>6 months passed from when I joined until I had an equity grant to sign. I asked about it once about 2 months in and was told they were waiting on the board to sign. The strike price on the grant reflects the new round (but the vesting schedule reflects my start date, if you&#x27;re curious). Though I don&#x27;t know what the price was before the round closed, I assumed it was between $0.50 and $1 based on my previous experience and how many rounds the company had raised. Now it&#x27;s an amount that makes it unlikely that I will be able to afford to exercise in full without being irresponsible with savings (or, let&#x27;s hope the lottery tickets from currCompany - 1 pay out). I&#x27;m aware that I can do an &quot;exercise-and-sell-to-cover&quot; transaction in some circumstances. I consider these circumstances generally unlikely.<p>So, my questions for the hive mind:<p>1. Is waiting 6 months to receive a grant normal? Are there any rules around how long an employer can take to issue the grant? Or, what factors affect this process? My previous employer issued the grant within 90 days of my start date.<p>2. My offer letter and employment contract described how many options I would receive but didn&#x27;t specify timing or strike price. This mirrors my experience at my last employer, but is it normal or even possible to put these details in writing?<p>3. What would you do in this scenario? From one perspective, my total compensation is substantially lower than I expected when factoring in a now-non-trivial strike price. Would you try to negotiate for higher cash compensation? Would you look for a new role?<p>Those are my explicit questions, but if you have other thoughts on my situation I&#x27;d appreciate the perspective. I don&#x27;t mind blunt honesty.<p>Cordially, isoscrewed?",
      "time": 1645743836,
      "title": "Ask HN: Employer granted ISOs 6 months after start date, now I can't afford them",
      "type": "story"
    },
    {
      "by": "codechoir",
      "descendants": 0,
      "id": 30461548,
      "score": 1,
      "text": "Hi everyone!<p>I&#x27;m very interested in the EdTech&#x2F;EduTech space. However, while I have a decent understanding of them, the various technical standards (e.g., SCORM, LTI, xAPI) are challenging me - especially when it comes to questions of implementation.<p>Also, most of the documentation and examples that I was able to find (especially if it is related to IMS Global) seem extremely bad&#x2F;unintuitive to me.<p>Therefore my question: Can any of you recommend some good introductory to intermediate materials (e.g., books, courses, etc.) regarding such standards?<p>Best!",
      "time": 1645743763,
      "title": "Ask HN: Decent Introduction to Technical EdTech Standards (LTI, XAPI, etc.)",
      "type": "story"
    },
    {
      "by": "okl",
      "descendants": 0,
      "id": 30461521,
      "score": 4,
      "time": 1645743590,
      "title": "Suddenly increased Gamma radiation in Ukraine?",
      "type": "story",
      "url": "https://www.saveecobot.com/en/radiation-maps#11/51.3463/30.1513/gamma/comp+cams+fire"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 30461514,
      "score": 1,
      "time": 1645743519,
      "title": "Google Maps Live Traffic Showed the Russian Invasion of Ukraine",
      "type": "story",
      "url": "https://www.vice.com/en/article/xgd7dd/google-maps-live-traffic-showed-the-russian-invasion-of-ukraine"
    },
    {
      "by": "dy2t7t",
      "descendants": 0,
      "id": 30461500,
      "score": 2,
      "time": 1645743396,
      "title": "Sanctions targeting Russia’s space program",
      "type": "story",
      "url": "https://spaceflightnow.com/2022/02/24/biden-announces-sanctions-targeting-russias-space-program/"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 30461498,
      "score": 1,
      "time": 1645743379,
      "title": "MGH Study: Pandemic Lockdown May Be Linked to Brain Inflammation",
      "type": "story",
      "url": "https://www.nbcboston.com/news/local/mgh-study-pandemic-lockdown-may-be-linked-to-brain-inflammation/2652114/"
    },
    {
      "by": "ethanpil",
      "descendants": 0,
      "id": 30461494,
      "score": 1,
      "time": 1645743350,
      "title": "Monero (XMR) Botnet Currently Making over $120k/Month",
      "type": "story",
      "url": "https://xmr.nanopool.org/account/4DSQMNzzq46N1z2pZWAVdeA6JvUL9TCB2bnBiA3ZzoqEdYJnMydt5akCa3vtmapeDsbVKGPFdNkzqTcJS8M8oyK7WGimsxx6Ew51dGBpEJ"
    }
  ]
}