{
  "stories": [
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 29056454,
      "score": 1,
      "time": 1635682755,
      "title": "Britain can't decide whether it should send its looted treasures back",
      "type": "story",
      "url": "https://www.cnn.com/style/article/benin-bronze-returns-britain-intl-cmd-gbr/index.html"
    },
    {
      "by": "aj3",
      "descendants": 0,
      "id": 29056442,
      "score": 1,
      "time": 1635682624,
      "title": "But, Mr. Zuckerberg, How Do You Play Basketball Against a Hologram?",
      "type": "story",
      "url": "https://www.vice.com/en/article/v7dg74/but-mr-zuckerberg-how-do-you-play-basketball-against-a-hologram"
    },
    {
      "by": "blopeur",
      "descendants": 0,
      "id": 29056437,
      "score": 2,
      "time": 1635682582,
      "title": "Creepy case over an invalid patent: 2 unethical businesses and 60 jobs lost",
      "type": "story",
      "url": "http://www.fosspatents.com/2021/10/creepy-patent-case-involves-two.html"
    },
    {
      "by": "susam",
      "descendants": 0,
      "id": 29056429,
      "score": 1,
      "time": 1635682490,
      "title": "sysexits – preferable exit codes for programs",
      "type": "story",
      "url": "https://www.freebsd.org/cgi/man.cgi?query=sysexits"
    },
    {
      "by": "OulaX",
      "descendants": 1,
      "id": 29056426,
      "kids": [
        29056460
      ],
      "score": 2,
      "text": "PRE-DESCLAIMER: I apologize if posting such rants and discussion threads is against the rules of HN.<p>DESCLAIMER: This post can be quite long for some people, and I get it if no one wants to read it, but I would be grateful if you don&#x27;t downvote me, maybe someone who&#x27;s actually willing to help might see and answer me, because quite honestly I&#x27;ve been stuck in a terrible rut and I need some professional help.<p>Some Information About Me, I am 25 years old, and I live in a third world country (Iraq to be specific), the city I live in almost has no software-based startups &#x2F; companies, also goverment work in IT is very very very difficult to get due to the amount of corruption there is, what I am currently doing is some freelance work, sometimes a client comes and wants a very basic static website, and I build it for them (Using a premade template from ThemeForest, because I am not a UI&#x2F;UX designer). Sometimes a client requires a mobile app, so I stich together an app by following tutorials here and there, even though most of my stuff works, they are by no means professionally made, nor scalable or maintainable, I just need to do these jobs in order to get some cash flowing on, otherwise I would have nothing to depend on.\nI have gotten my CS degree last year when I was 24, and currently I have a BSc in CS. I have been coding 10 years ago, but to this date I haven&#x27;t built something that I can be proud of!<p>I am stuck in a rut trying to specialize in a niche and keep on improving myself on that particular area.<p>I have tried Frontend Web Development but quite honestly I really hate working with CSS, it&#x27;s not the syntax that I struggle with, it&#x27;s the fact that making a site responsive really really is something I hate, I mostly hate working with UIs.<p>When I was in college I really loved working on the console, I built great apps using the console, and I quite enjoyed what I was doing! We were learning C++ at the time, and working on the console made me think about my logic, my code, my idea, instead of sweating about the design, or how a button looks, or how to make text appear good on all screen sizes.<p>I want to try out Native mobile development but I am not sure whether it would be the right choice for me or not.<p>I am stuck, and there&#x27;s so much on my mind that I want to speak here but I can&#x27;t explain them easily without going too much into the details.<p>I really want a hand guys, and would be willing to answer or comment on any ideas or questions you might have!<p>EDIT: Sometimes I also think coding might not be for me aswell! Maybe I made the wrong choice, but there are times that I enjoy coding, especially when someone gives me a problem or an assignment to solve.",
      "time": 1635682419,
      "title": "Ask HN: Been in the IT Industry for 10 Years with Nothing to Show For",
      "type": "story"
    },
    {
      "by": "yakkomajuri",
      "descendants": 0,
      "id": 29056405,
      "score": 2,
      "time": 1635682106,
      "title": "A read query can write to disk: a Postgres story",
      "type": "story",
      "url": "https://www.mutuallyhuman.com/blog/how-a-read-query-can-write-to-disk-a-postgresql-story/"
    },
    {
      "by": "gibsonf1",
      "descendants": 0,
      "id": 29056394,
      "score": 1,
      "time": 1635681929,
      "title": "Scrum Master: The Agile Training Seminar for Business Performance",
      "type": "story",
      "url": "https://www.abi-agile.com/en/book/"
    },
    {
      "by": "Anon84",
      "descendants": 0,
      "id": 29056383,
      "score": 2,
      "time": 1635681837,
      "title": "The Economics of Pumpkin Patches",
      "type": "story",
      "url": "https://thehustle.co/the-economics-of-pumpkin-patches/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 29056379,
      "score": 1,
      "time": 1635681777,
      "title": "NIH, FDA and 15 organizations join to accelerate development of gene therapies",
      "type": "story",
      "url": "https://www.nih.gov/news-events/news-releases/nih-fda-15-private-organizations-join-forces-increase-effective-gene-therapies-rare-diseases"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29056363,
      "score": 2,
      "time": 1635681564,
      "title": "Epilys/rsqlite3: sqlite3 Rewritten in RiiR Rust",
      "type": "story",
      "url": "https://github.com/epilys/rsqlite3"
    }
  ]
}