{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28769687,
      "score": 1,
      "time": 1633499900,
      "title": "Canon’s new dual-fisheye EOS R lens is for creating 3D VR content",
      "type": "story",
      "url": "https://www.theverge.com/2021/10/6/22712126/canon-dual-fisheye-lens-eos-vr-system-price-release-date"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 28769620,
      "score": 2,
      "time": 1633499174,
      "title": "Insertion, Evasion and DoS: Eluding Network Intrusion Detection System (1998) [pdf]",
      "type": "story",
      "url": "https://www.cs.unc.edu/~fabian/course_papers/PtacekNewsham98.pdf"
    },
    {
      "by": "croes",
      "descendants": 0,
      "id": 28769614,
      "score": 1,
      "time": 1633499138,
      "title": "Investors Spent Millions on 'Evolved Apes' NFTs. Then They Got Scammed",
      "type": "story",
      "url": "https://www.vice.com/en/article/y3dyem/investors-spent-millions-on-evolved-apes-nfts-then-they-got-scammed"
    },
    {
      "by": "bartoszgorka",
      "descendants": 0,
      "id": 28769604,
      "score": 2,
      "time": 1633499040,
      "title": "Phoenix 1.6 Released",
      "type": "story",
      "url": "https://bartoszgorka.com/phoenix-1-6-released"
    },
    {
      "by": "chuckee",
      "descendants": 0,
      "id": 28769584,
      "score": 3,
      "time": 1633498856,
      "title": "Canadian government's proposed online harms legislation threatens human rights",
      "type": "story",
      "url": "https://www.cbc.ca/news/opinion/opinion-online-harms-proposed-legislation-threatens-human-rights-1.6198800"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28769578,
      "score": 1,
      "time": 1633498736,
      "title": "Daily Life with Covid Pass in Lithuania and Europe",
      "type": "story",
      "url": "https://txti.es/covid-pass/images"
    },
    {
      "by": "lifeplusplus",
      "descendants": 0,
      "id": 28769567,
      "score": 3,
      "text": "I moved to USA about 8 years ago from a very homogeneous country, which I believe has an effect on how you see the world. Living in a diverse society actually seems to make you more racist, if that makes sense. Your brain gets trained to automatically obsessively tag people by their race as it stands out. Back there everyone you&#x27;d encounter is of same religion and race. When something is so common it becomes useless as a factor to be used for judging. The best national hero is also of same religion and race as the worst criminal. So your brain gets trained to look for other things - wealth, dialect, dress, place of birth (north&#x2F;south, city&#x2F;village...), etc.<p>Stereotypes exist, in fact, there are way more. People think of you differently based on what job you do and your parents do, what dialect you speak, what part of the town you live in, or what village&#x2F;city you live&#x2F;lived in, how wealthy you are, what sect of religion you follow... stereotypes are prevalent. Just show up and speak for few seconds.. and other person has pretty much figured out where you originate from, what ethnicity you are and how much education you have had. It&#x27;s amazing but can be stupidly harmful to unfortunate as well. Compared to there, here you can break from your past and start anew much more easily.<p>Since there you don&#x27;t really encounter anything different in terms of race&#x2F;nationality&#x2F;religion on daily basis, or even in a life time, you really don&#x27;t have any negative association with someone who is new race&#x2F;language&#x2F;religion, it&#x27;s like you have no data. your natural reaction is of more a curiosity. It&#x27;s like finding a cow with two heads, everyone in the village would want to see it and touch it.<p>As a kid I&#x27;d watch ton of international kids, read books on various topics... I never once thought I&#x27;m watching an english kid, If I saw a kid, I saw myself in them. Newton was my role model, and to even this day I admire so many people from all over the world from philosophers, explorers, scientists, inventors.. basically either someone brave, righteous or genius. They could have been from greek, india, england, africa, arab, etc.. To me they were my heritage, the heritage of humans. I always felt I owe it to them to carry their legacy in someway.<p>However, When I moved here for the first time I realized skin color, thus race, could also be used as another factor to judge. And it made sense, it really stands out in a diverse place like USA, and if there is correlation people will start to pick up on that, whether it&#x27;s overestimation or underestimation is debatable or if it&#x27;s even productive to society is also another important topic i.e. negative correlation might be true but if acting on it creates a self-sustaining cycle, it harms everyone.<p>Unfortunately I noticed that kids&#x2F;adults alike here didn&#x27;t see the world as their heritage and went extra mile to only focus on heroes&#x2F;geniuses from their race, even gender sometimes. It was kinda sad realization. To exclude so much of what&#x27;s truly yours because you see yourself belonging to a side. One day walking outside with a friend who was born here, I was talking how expensive this city is and I&#x27;m just gonna move to somewhere cheaper like austin or houston. he said he wouldn&#x27;t, I&#x27;m thinking 100s of reason why.. does he like the ocean, near family, subway system?, weather?, don&#x27;t like new experiences...what is it? he says oh i don&#x27;t wanna be in all white place. Blew my mind. But maybe I&#x27;m naive... but holyshit it&#x27;d be suffocating to live in a country with X majority, thinking X is out to get you (.. seeing police cam videos maybe it&#x27;s not too far off). Like when I see the person, first few things I see are they angry, something in their hand, expensive clothes, are they worried, what do they do, what are they doing, what are they thinking... but it felt like most people, extrapolating from friends who I&#x27;ve here, always dominantly focus on race first and create this wall.",
      "time": 1633498595,
      "title": "Tell HN: I think living in a diverse society makes you racist",
      "type": "story"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 28769555,
      "score": 1,
      "time": 1633498494,
      "title": "Silicon’s 300% Surge Throws Another Price Shock at the World",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-10-01/silicon-s-300-surge-throws-another-price-shock-at-the-world"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 28769531,
      "score": 1,
      "time": 1633498133,
      "title": "The Steve Jobs deal with Michael Dell that could have changed tech history",
      "type": "story",
      "url": "https://www.cnet.com/tech/computing/the-steve-jobs-deal-with-dell-that-could-have-changed-apple-and-tech-history/"
    },
    {
      "by": "Thevet",
      "descendants": 0,
      "id": 28769466,
      "score": 1,
      "time": 1633497412,
      "title": "A Rebel with Every Cause",
      "type": "story",
      "url": "https://www.historytoday.com/archive/history-matters/rebel-every-cause"
    }
  ]
}