{
  "stories": [
    {
      "by": "agensaequivocum",
      "descendants": 0,
      "id": 30715884,
      "score": 1,
      "time": 1647551176,
      "title": "Recent History of Concealed Carry in the US",
      "type": "story",
      "url": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Right_to_Carry%2C_timeline.gif"
    },
    {
      "by": "jonathanzufi",
      "descendants": 0,
      "id": 30715850,
      "score": 1,
      "text": "I sent a message to a friend of mine (a 30+ year veteran designer (he&#x27;s seen&#x2F;done it all) and Apple user) earlier today about Apple&#x27;s new Universal Control feature after reading https:&#x2F;&#x2F;www.theverge.com&#x2F;2022&#x2F;3&#x2F;16&#x2F;22980566&#x2F;universal-control-ios-macos-mac-ipad-hands-on. His response intrigued me and I&#x27;d love to hear from the HN community regarding any idea&#x2F;suggestions abou what he&#x27;s experiencing - with all the collaboration that Apple has done with the design&#x2F;animation&#x2F;studio community who typically have these monster setups I&#x27;m really surprised that he&#x27;s having these issues. Here was his note:<p>&quot;I’ll have to try it out…but my expectations are pretty low at this point. Most of these (black) magic features from Apple seem geared towards laptop and iMac users that have an iPad sitting next to them. Everything falls apart when you have towers with 2-3 displays attached.<p>Whatever the little deamon or code devil or whatever that’s in charge of managing all the screens + power + window arrangement is just woefully not up to the task. For the past four OS versions I’ve not been able to ever put my machines to sleep. And for the past two or three versions even letting the displays “sleep” causes all sorts of havoc.<p>If I let my Mac Pros sleep then it’s a slim chance that tapping the space bar will bring all displays back up or at the 4K res they were when they went down. OS X will then shuffle windows or app UI around haphazardly. A restart will usually fix it but the more ram you have the longer that boot time is. With 400GB it can be “go get a cup of tea” time.<p>I’ve trained myself to try and close most production apps if I plan to be away from my computer for more than hour – the time at which my screens go to sleep. If I fail to do that then when I return all the app windows will have moved to the center screen. Dragging the Mail app back to the left screen isn’t so bad but if you have Photoshop on one workspace and Maya on another, etc. then you have to spend an uneasy moment or two dragging panels back to where they were when you left.<p>If the resolution has shifted then some Adobe panels might be off screen and you can’t get to the top bars to move them.<p>I’ve tried DisplayPort, HDMI and last year I switched all my monitors to a single flavor of LGs with Thunderbolt but nothing seems to help. These LGs say they pull full power down the cable so the 2nd TB port should run another monitor in a chain or at least charge an iPad. But they seem to be right at their limits and if they happen to power cycle for some reason like a brown out that exceeds your UPS’s battery lifetime then there’s a 50&#x2F;50 chance the screen won’t boot up and they just turn themselves off citing “No Input Signal Detected”. At that point you have to plug one screen in at a time and reboot the mac a few times (and clear the PMU sometimes) to get things unstuck.&quot;",
      "time": 1647550980,
      "title": "Ask HN: Putting macOS to sleep with multiple monitors",
      "type": "story"
    },
    {
      "by": "da12",
      "descendants": 0,
      "id": 30715842,
      "score": 1,
      "time": 1647550901,
      "title": "Tips for Writing Pythonic Code",
      "type": "story",
      "url": "https://davidamos.dev/3-tips-for-writing-pythonic-code/"
    },
    {
      "by": "jmatt",
      "descendants": 0,
      "id": 30715841,
      "score": 2,
      "time": 1647550895,
      "title": "Cresta Raises Series C",
      "type": "story",
      "url": "https://cresta.com/press/cresta-announces-series-c/"
    },
    {
      "by": "HumanFirstWorks",
      "descendants": 0,
      "id": 30715820,
      "score": 2,
      "time": 1647550750,
      "title": "Management: Sailing on the Sea of Context",
      "type": "story",
      "url": "https://humanfirstworks.com/management-sailing-the-sea-of-context/"
    },
    {
      "by": "lifeisstillgood",
      "descendants": 0,
      "id": 30715816,
      "score": 3,
      "time": 1647550726,
      "title": "P&O Ferries sparks outrage by sacking 800 workers",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-60779001"
    },
    {
      "by": "klausschaefers",
      "descendants": 0,
      "id": 30715815,
      "score": 1,
      "time": 1647550725,
      "title": "Luisa – Turn Figma designs into Vue apps",
      "type": "story",
      "url": "https://luisa.cloud/"
    },
    {
      "by": "WellDressed",
      "descendants": 0,
      "id": 30715784,
      "score": 4,
      "time": 1647550480,
      "title": "US official: If the war drags, Putin is likely to make nuclear threats/Bloomberg",
      "type": "story",
      "url": "https://twitter.com/ragipsoylu/status/1504557933614575616"
    },
    {
      "by": "News-Dog",
      "descendants": 1,
      "id": 30715782,
      "kids": [
        30715800
      ],
      "score": 2,
      "time": 1647550471,
      "title": "Putin's Chilling Warning of 'Traitors' 'Scum' Signs Things Aren't Going to Plan",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_b6356c5df8dbc9da3478b5332db355c4"
    },
    {
      "by": "mcone",
      "descendants": 0,
      "id": 30715772,
      "score": 1,
      "time": 1647550417,
      "title": "Largest Federal Utility Chooses Gas, Defying Biden’s Clean Energy Goals",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/17/climate/tennessee-valley-authority-biden-climate.html"
    }
  ]
}