{
  "stories": [
    {
      "by": "oldjavacoder",
      "descendants": 0,
      "id": 32069468,
      "score": 3,
      "text": "When I think about TypeScript and Angular I break out in a cold sweat. When I remember creating UI&#x27;s in GWT and it just worked, in Java, it brings back fond memories. So I&#x27;m relegated to the backend. Any other Java devs out there who&#x27;d like to to more in the front end but in Java, the language we know and love?",
      "time": 1657631877,
      "title": "Ask HN: Why isn't GWT or Vaadin more popular among Java developers?",
      "type": "story"
    },
    {
      "by": "samemail88",
      "descendants": 0,
      "id": 32069449,
      "score": 2,
      "time": 1657631781,
      "title": "Readable code is better than efficient code",
      "type": "story",
      "url": "https://ashlan.com/blog/readable-code-is-better-than-efficient-code/"
    },
    {
      "by": "apignotti",
      "descendants": 0,
      "id": 32069418,
      "score": 1,
      "text": "WebAssembly is a modern bytecode supported by all browsers and designed to be a compiler target for a wide variety of programming languages.<p>To effectively support some forms of Functional Programming support for tail-calls has been proposed as an extension to the WebAssembly standard.<p>This proposal has reached Phase3 of the standardization process years ago, but has since stalled.<p>Phase3 is known as &quot;the implementation phase&quot; and the prerequisite for advancing the proposal to Phase4 is to have support in two different browser engines. V8&#x2F;Chrome support has been available for a long time, so another engine is required.<p>To unblock this situation we have contributed full support for WebAssembly Tail Calls to JavaScript&#x2F;WebKit&#x2F;Safari. The PR is available here:<p>https:&#x2F;&#x2F;github.com&#x2F;WebKit&#x2F;WebKit&#x2F;pull&#x2F;2065<p>An in-depth article about the challenges of implementing this feature is also available. This is intended both as documentation for our contribution, but also as a general explainer about how tails calls actually work, with a particular focus on stack space management.<p>https:&#x2F;&#x2F;leaningtech.com&#x2F;fantastic-tail-calls-and-how-to-implement-them&#x2F;",
      "time": 1657631663,
      "title": "Show HN: We are trying to (finally) get tail-calls into the WebAssembly standard",
      "type": "story"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 32069407,
      "score": 2,
      "time": 1657631625,
      "title": "Evidence from the World's Most Exclusive Marriage Market",
      "type": "story",
      "url": "https://fermatslibrary.com/s/assortative-matching-at-the-top-of-the-distribution-evidence-from-the-world-s-most-exclusive-marriage-market#email-newsletter"
    },
    {
      "by": "millytamati",
      "descendants": 0,
      "id": 32069397,
      "score": 1,
      "time": 1657631609,
      "title": "As a generalist, I couldn't find my place in startup communities.So I built one",
      "type": "story",
      "url": "https://old.reddit.com/r/Entrepreneur/comments/vx8ql0/as_a_generalist_i_could_never_find_my_place_in/"
    },
    {
      "by": "sogen",
      "descendants": 0,
      "id": 32069374,
      "score": 1,
      "time": 1657631536,
      "title": "Slay the Spire – a roguelike deck-building video game",
      "type": "story",
      "url": "https://www.megacrit.com/"
    },
    {
      "by": "rjshade",
      "descendants": 0,
      "id": 32069350,
      "score": 1,
      "time": 1657631455,
      "title": "Explore JWST’s first image in full resolution",
      "type": "story",
      "url": "https://web.wwtassets.org/specials/2022/jwst-smacs/"
    },
    {
      "by": "strikingloo",
      "descendants": 0,
      "id": 32069307,
      "score": 1,
      "time": 1657631281,
      "title": "Vim: How to Start Using the Text Editor for Developers",
      "type": "story",
      "url": "https://strikingloo.github.io/vim-basics"
    },
    {
      "by": "__jambo",
      "descendants": 0,
      "id": 32069299,
      "score": 1,
      "text": "(old debate I know, but psychology isn&#x27;t my strong point).<p>Facebook, google, etc have wildly comprehensive databases of my behaviour, online and offline. Only recently I have come to understand that a lot about my personality is quite static. Given this it feels like I can be manipulated and therefore my decisions can be sold to the highest bidder. Is there still hope?",
      "time": 1657631248,
      "title": "To what extent do I still have free will given online behavioural data?",
      "type": "story"
    },
    {
      "by": "ottersarecool",
      "descendants": 0,
      "id": 32069295,
      "score": 4,
      "time": 1657631233,
      "title": "BBC R&D released guidelines to design remote multiplayer applications",
      "type": "story",
      "url": "https://rig.rd.labs.bbc/"
    }
  ]
}