{
  "stories": [
    {
      "by": "toteno",
      "descendants": 0,
      "id": 31816379,
      "score": 1,
      "time": 1655761152,
      "title": "Export Figma designs as React code (Aspect)",
      "type": "story",
      "url": "https://www.figma.com/community/plugin/1118342101812507980/Aspect"
    },
    {
      "by": "jenthoven",
      "descendants": 0,
      "id": 31816377,
      "score": 1,
      "text": "I&#x27;ve been enjoying BeReal recently, the new social media app that promises to not waste your time and encourages authentic expression.  Most of human life is boring, ugly, and unfiltered, which is exactly what I see in my BeReal feed.<p>However, I think it is pretty sketchy of BeReal to not tell people about screenshot notifications. It turns out that if you take screenshots of BeReal photos, that person can see that you did it. It can be embarrassing to save someone&#x27;s photo, on purpose or accidentally, and not realize that they will find out. There&#x27;s no warning or confirmation process, so you might take a screenshot without realizing that someone else will know. The developers haven&#x27;t written a blog post on this topic, don&#x27;t mention this in their &quot;Warnings&quot; in the app store, and haven&#x27;t answered open Reddit threads even though they clearly included this feature as a growth hack.<p>I think that BeReal should tell users explicitly that if you take screenshots, the person will know and see who you are. I believe this because I think your behavior in an app should be considered private unless explicitly stated otherwise. What do you think?",
      "time": 1655761150,
      "title": "BeReal Shows Who Takes Screenshots with No Notice to Users",
      "type": "story"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31816369,
      "score": 1,
      "time": 1655761125,
      "title": "Windows emergency update fixes Microsoft 365 issues on Arm devices",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/windows-emergency-update-fixes-microsoft-365-issues-on-arm-devices/"
    },
    {
      "by": "breck",
      "descendants": 0,
      "id": 31816357,
      "score": 1,
      "time": 1655761071,
      "title": "I Almost Did Not Graduate from Stanford University",
      "type": "story",
      "url": "https://brownstone.org/articles/how-i-almost-did-not-graduate-from-stanford-university/"
    },
    {
      "by": "solomonkinard",
      "descendants": 0,
      "id": 31816347,
      "score": 1,
      "time": 1655761029,
      "title": "Gerrit Comments",
      "type": "story",
      "url": "https://marketplace.visualstudio.com/items?itemName=solomonkinard.gerrit-comments"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31816345,
      "score": 1,
      "time": 1655761024,
      "title": "What science can do for democracy: a complexity science approach (2020)",
      "type": "story",
      "url": "https://www.nature.com/articles/s41599-020-0518-0"
    },
    {
      "by": "L0in",
      "descendants": 1,
      "id": 31816280,
      "kids": [
        31816386
      ],
      "score": 2,
      "text": "Since my new cycle of anxiety and depression over the last few months i started going to therapy again. Every therapist i&#x27;ve gone thus far said i theorize and overthink a lot, and something that&#x27;s missing from my life is practicality. «Don&#x27;t think, act. Don&#x27;t theorize about a plan. Just start.».<p>And so i&#x27;ve started thinking...<p>I study CS, i want to work in security, i really like and want to learn algorithmic thinking and problem solving, researching, and imagine, but at the same time my mind&#x27;s thought spiral can disable me. (I use the phrase &quot;thought spiral&quot; because i feel it&#x27;s the best description, but i don&#x27;t believe i have, and never been diagnosed with OCD.)<p>How do i balance my desire for a way of life that, at the same time, creates my problems?",
      "time": 1655760691,
      "title": "Ask HN: Overthinking in personal life and Thinking as a job",
      "type": "story"
    },
    {
      "by": "samwillis",
      "descendants": 0,
      "id": 31816265,
      "score": 1,
      "time": 1655760632,
      "title": "Joining CSV files in the browser using Datasette Lite",
      "type": "story",
      "url": "https://simonwillison.net/2022/Jun/20/datasette-lite-csvs/"
    },
    {
      "by": "blopeur",
      "descendants": 0,
      "id": 31816255,
      "score": 4,
      "time": 1655760593,
      "title": "WebAssembly on Amazon Lambda: Lessons Learned",
      "type": "story",
      "url": "https://wasmer.io/posts/wasm-on-amazon-lambda-lessons-learned"
    },
    {
      "by": "altarius",
      "descendants": 0,
      "id": 31816251,
      "score": 1,
      "time": 1655760590,
      "title": "Turning Downtown Offices into Housing Isn’t the Solution You Think It Is",
      "type": "story",
      "url": "https://sfstandard.com/housing-development/turning-downtown-offices-into-housing-isnt-the-solution-you-think-it-is/"
    }
  ]
}