{
  "stories": [
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 31838888,
      "score": 1,
      "time": 1655918119,
      "title": "Impact of reading about climate science goes away almost instantly",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/06/impact-of-reading-about-climate-science-goes-away-almost-instantly/"
    },
    {
      "by": "mig39",
      "descendants": 0,
      "id": 31838852,
      "score": 1,
      "time": 1655917954,
      "title": "Mullvad audit found no information leakage or logging of customer data",
      "type": "story",
      "url": "https://mullvad.net/en/blog/2022/6/22/vpn-server-audit-found-no-information-leakage-or-logging-of-customer-data/"
    },
    {
      "by": "jmartens",
      "descendants": 0,
      "id": 31838794,
      "score": 1,
      "time": 1655917730,
      "title": "Status pages are lying to you",
      "type": "story",
      "url": "https://metrist.io/blog/why-status-pages-are-lying-to-you-and-what-to-do-about-it/"
    },
    {
      "by": "dspoka",
      "descendants": 0,
      "id": 31838789,
      "score": 2,
      "time": 1655917711,
      "title": "OctoML CLI: A New DevOps Focused ML Deployment Tool",
      "type": "story",
      "url": "https://octoml.ai/blog/new-ai-ml-tool-for-fans-of-docker-compose-and-kubernetes-octoml-cli/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31838784,
      "score": 1,
      "time": 1655917703,
      "title": "Moscow warns of “serious” consequences over new sanctions [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=OyDiHnBW0Pw"
    },
    {
      "by": "FrankLicea",
      "descendants": 1,
      "id": 31838764,
      "kids": [
        31838860,
        31838803
      ],
      "score": 8,
      "text": "Howdy HN! We’re Jacqueline and Frank from Astro (<a href=\"https:&#x2F;&#x2F;www.tryastro.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tryastro.com&#x2F;</a>). We’re a platform that gives you access to engineering talent in Latin America and lets you build teams there. We take care of the sourcing, payroll, HR, benefits, local procurement, and equipment, all from an easy-to-use dashboard. (Video here: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RmiVOVfbHFI</a>)<p>Before starting Astro, we worked as leaders at the same company, Jacqueline in sales and Frank in engineering. As we built our teams, we found it was very hard to compete against top tech companies for talent. Therefore, we broadened our search beyond Austin, Texas.<p>We ended up working with various partners in Latin America because of the strong talent pool, great English, and US friendly time zones. However, finding and retaining engineering teams in Latin America was a challenge. We loved our teammates, but were never thrilled about the outsourcing firms they worked for. Because they weren’t our employees, we couldn’t control what they were being paid, couldn’t give them benefits and perks, and the only visibility we had was the $150&#x2F;hr bill we got from the outsourcing company. How much of that actually went to the team?<p>Because traditional outsourcing firms tend to attract non-tech clients and their culture revolves around billable hours, our team members were also unsatisfied with the outsourcing company that they worked for. Freelancing could be an alternative, but is also difficult for teams in Latin America due to its inherent risk and likelihood of being treated as a second class contractor on a foreign team rather than a first-class stakeholder.<p>We were stuck with three uncomfortable options: outsource the entire product, manage a large team of independent freelancers, or rely on an outsourcing company to create our engineering culture.<p>What we really wanted were our own teams, including our own offices, equipment, salaries, benefits, etc. But setting up a foreign entity and knowing how to hire in foreign markets was a distraction and difficult—not to mention payroll, benefits, procurement, legal compliance, etc.<p>We ultimately went to work at different companies, but continued to experience the same pain points at our new companies. Finally, in 2018, after commiserating many times over beers, we decided to build the company we kept looking for, a company to automatically handle all of these international complexities.<p>We originally called ourselves Austin Software and we started by building teams by hand for startups in Austin, Texas. Then, we started to realize we had gotten good at solving lots of problems on behalf of teams in the US: sourcing Macbooks, finding competitive local benefits and perks, legal compliance, even organizing happy hours, travel and SWAG. Our idea was to productize what we’d learned and make it available to other companies. We got tired of explaining that we build teams, not bill project hours! So we built Astro (“Austin Software Tool for Recommendations and Opportunities” :)<p>You can think of Astro as something like a love child between Toptal + Gusto + WeWork + Amazon (the latter because of the logistics we do — more on that below), tailored specifically for software engineering teams in LATAM. Unlike Toptal or Turing, we fulfill local benefits, equipment, even team-building events. Our pricing is also transparent, in contrast to companies that charge by the hour, upfront fees, or handcuff you to long-term contracts. Customers review and pay for 1) the developer’s desired salary, 2) benefits and taxes, and 3) our 15% management fee on a week-to-week basis.<p>Here’s one example of the kind of thing we take care of. A 16 inch M1 Macbook Pro is not just a perk in Latin America, they actually save countless hours when dealing with heavy dev environments. But they’re difficult to source in Latin America, especially outside of the handful of major cities. And even if they are sourced, they’re extremely expensive, especially if they know you’re an American company, and getting them to teammates across South America runs the risk of theft or damage. We solve this by having local entities, local logistics, local distribution and secure local offices.<p>We’re proud of the fact that developers in Latin America have a much better experience working with us. That’s because our customers (i.e. the companies using Astro) are looking to scale their engineering departments with long-term stakeholders, not temporary “horsepower”, and also because real tech culture (the sort of thing devs in Silicon Valley take for granted) is a huge draw for developers, but nearly impossible to find via outsourcing shops, and very hit-and-miss on Toptal&#x2F;Turing.<p>We hope you’ll try us out! Visit <a href=\"https:&#x2F;&#x2F;www.TryAstro.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.TryAstro.com</a>, and configure your desired team (See video tutorial and screenshots below if you&#x27;re just curious). Astro will source, pre-vet, schedule interviews, send offer letters, manage employment contracts, and coordinate equipment, office space, and SWAG. Once that’s set up, you can use Astro to manage your team on an ongoing basis: salaries, bonuses, additional benefits, perks, equipment, etc.<p>Check out some screenshots here: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;drive&#x2F;folders&#x2F;17qYsZLKrhPdE1Ud1LA5A8RYNZiJkXo41\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;drive&#x2F;folders&#x2F;17qYsZLKrhPdE1Ud1LA5A...</a> and a video tutorial here: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RmiVOVfbHFI</a><p>We’d love to hear your feedback and we’re excited to answer any questions!",
      "time": 1655917635,
      "title": "Launch HN: Astro (YC W21) – Build your own dev teams in Latin America",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31838760,
      "score": 1,
      "time": 1655917630,
      "title": "P2 – a platform for teams to share, discuss, and collaborate openly",
      "type": "story",
      "url": "https://wordpress.com/p2/"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 31838757,
      "score": 1,
      "time": 1655917625,
      "title": "Why Demos Are Critical to ML Research and How to Build Them",
      "type": "story",
      "url": "https://docs.google.com/presentation/d/1TXw48MjZFvkVur6rE0tUrEECf76SgUrglTjv0Kb0SWQ/edit#slide=id.g10d8aca05c4_0_10"
    },
    {
      "by": "carlycue",
      "descendants": 0,
      "id": 31838756,
      "score": 2,
      "time": 1655917620,
      "title": "iPhone 13 continues to dominate as ‘global best-selling smartphone’: report",
      "type": "story",
      "url": "https://9to5mac.com/2022/06/22/best-selling-smartphone-iphone-13/"
    },
    {
      "by": "bfirsh",
      "descendants": 0,
      "id": 31838752,
      "score": 1,
      "time": 1655917613,
      "title": "Ongo – Generate a painting from text with guided diffusion",
      "type": "story",
      "url": "https://replicate.com/laion-ai/ongo"
    }
  ]
}