{
  "stories": [
    {
      "by": "heavyset_go",
      "descendants": 0,
      "id": 31745876,
      "score": 1,
      "time": 1655239789,
      "title": "Anti-Trans Campaigns Set the Stage for Far-Right Attacks on Pride Festivities",
      "type": "story",
      "url": "https://theintercept.com/2022/06/13/pride-lgbtq-trans-attacks-far-right/"
    },
    {
      "by": "Utkarsh_Mood",
      "descendants": 0,
      "id": 31745865,
      "score": 1,
      "text": "Hi HN, \nI’d like to preface my question with saying I acknowledge that I am a very privileged individual who’s lucky he has supportive family and friends to have the luxury of pursuing my dreams and people looking out for me<p>I’m currently in 11th grade and have high ambitions of pursuing my higher education abroad preferably in the US. I’ve had this dream since childhood and this incentivised me to always work hard in class in do my best alongside various activities. Recently I’ve been discussing finances, profile strength, and the like with my parents. My parents are extremely supportive of me and always want to provide me with the best of their resources they’re capable of providing. This includes: finding the best academic tutors for me, paying for summer programs and many more similar activities.<p>Regarding college applications we were looking for college counsellors and services that would help increase my chances and further work towards achieving my goal. With this being said, we looked at a few ranging from over 5 thousand dollars to 16 thousand dollars being the maximum. Keep in mind these programs are way above what my family would be comfortable providing with and the kids attending here usually have parents who are in the C - Level in large companies and the upper class income bracket. No-one I know in my immediate friend group is paying remotely close to this amount and are looking for cheaper&#x2F;affordable options which are more flexible. I even have a younger brother who’s also probably going to study in the US considering the fact he’s a US citizen.<p>It comes as no surprise as the higher the prices of the counselling sessions go, the better results they usually have to the top colleges, sometimes even providing substatial aid to applicants  from an overrepresented country(India, China,etc). They generally have better tried and tested strategies and have people on the inside who have insight the average applicant here has no chance of knowing about.<p>I should also add my father also had a pretty unique experience regarding college as he was initially a mining engineer but felt it wasn’t for him and asked his father for money to change majors and my grandfather trusted him, giving him his money he’d saved for retirement with the trust that he knew he son would use it for good and it Paid off since my dad can now take care of him and live together<p>Anyways after meeting all of them and thinking about it, my father, who’s always been searching painlessly for the best resources to me staying until two am to find the best person who can mentor me; has agreed to go for the most expensive and well known one there is. While I felt grateful and acknowledge the fact that im so so lucky and privileged to have such supportive parents, who’ve even told me that they’re fine if nothing works out and I have to pull out my plan B and not to take stress. It has been gnawing my mind on how I can truly take every single opportunity that will handed to me and I don’t want to ever ‘waste’ any of this and feel guilty that they’re spending their hard earned money on me. They’re taking every humanly possible step they can to see me succeed and I don’t want to fail them even in the slightest.<p>How do I ensure that I do everything I possibly can in my hands to make sure my parents sacrifice doesn’t go in vain, and also don’t stay stressed 24&#x2F;7 thinking about the fear of failure? Any advice would be much appreciated<p>TLDR; Parents risking almost all they’ve got to maximise my shot at college applications, how to succeed, not let them down and not be haunted by the possibility of failure.",
      "time": 1655239744,
      "title": "Ask HN: How to ensure I don't let my parents down and do the best I can?",
      "type": "story"
    },
    {
      "by": "abidlabs",
      "descendants": 0,
      "id": 31745821,
      "score": 1,
      "time": 1655239526,
      "title": "The 7GUIs in Python / Gradio",
      "type": "story",
      "url": "https://github.com/gradio-app/7guis-gradio"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31745818,
      "score": 1,
      "time": 1655239517,
      "title": "Salary Transparency",
      "type": "story",
      "url": "https://xeiaso.net/salary-transparency"
    },
    {
      "by": "Tiktaalik",
      "descendants": 0,
      "id": 31745795,
      "score": 1,
      "time": 1655239416,
      "title": "New Quebec language bill could cause ‘permanent damage’ to tech sector",
      "type": "story",
      "url": "https://www.theglobeandmail.com/business/article-new-quebec-language-bill-could-cause-permanent-damage-to-provinces/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31745765,
      "score": 2,
      "time": 1655239279,
      "title": "STxP70/Sthorm/P2012 – ST's Microcontroller",
      "type": "story",
      "url": "https://the6p4c.github.io/2022/06/13/stxp70-sthorm-p2012.html"
    },
    {
      "by": "surrTurr",
      "descendants": 1,
      "id": 31745747,
      "kids": [
        31745819
      ],
      "score": 1,
      "time": 1655239183,
      "title": "Ask HN: Which Linux distro „just works“?",
      "type": "story"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 31745740,
      "score": 1,
      "time": 1655239117,
      "title": "The domain for the Dillo web browser has expired and is currently parked",
      "type": "story",
      "url": "https://pleroma.envs.net/notice/AKUT3aLJm1idSA8Cwa"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 31745724,
      "kids": [
        31745734
      ],
      "score": 1,
      "time": 1655239067,
      "title": "Sure, Internet Explorer Had Its Faults. But Fans Are Mourning Its Death Anyway",
      "type": "story",
      "url": "https://www.wsj.com/articles/sure-microsoft-internet-explorer-browser-had-its-faults-but-fans-are-mourning-its-death-anyway-11655226882"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31745706,
      "score": 2,
      "time": 1655239010,
      "title": "Freeport LNG Out for Months, Stranding 2 Bcf/D and Rattling Global Markets",
      "type": "story",
      "url": "https://www.naturalgasintel.com/freeport-lng-says-post-explosion-restart-unlikely-until-late-2022-natural-gas-futures-plunge/"
    }
  ]
}