{
  "stories": [
    {
      "by": "hahamrfunnyguy",
      "descendants": 0,
      "id": 32110320,
      "score": 1,
      "text": "I am looking to start monetizing a web-based app with ads.  I would like some degree of control over where the apps are displayed and the type of ad content is allowed.  Presently, the app is ONLY running as a website so the network needs to support this mode of serving ads.<p>What networks would be a good starting point to look at? Who are the reputable and established players in this space?<p>At first glance, Google AdSense does not seem to have the level of control I am looking for.",
      "time": 1657904703,
      "title": "Ask HN: Options for in-app advertising in a web app?",
      "type": "story"
    },
    {
      "by": "oavioklein",
      "descendants": 0,
      "id": 32110292,
      "score": 1,
      "time": 1657904597,
      "title": "A deeper dive into the Rogers outage",
      "type": "story",
      "url": "https://www.kentik.com/blog/a-deeper-dive-into-the-rogers-outage/"
    },
    {
      "by": "philliphaydon",
      "descendants": 0,
      "id": 32110290,
      "score": 1,
      "time": 1657904593,
      "title": "NPM trends: parcel vs. snowpack vs. vite",
      "type": "story",
      "url": "https://npmtrends.com/parcel-vs-snowpack-vs-vite"
    },
    {
      "by": "batmaniam",
      "descendants": 0,
      "id": 32110286,
      "score": 1,
      "time": 1657904559,
      "title": "Like Father Like Son: Elon Musk’s Dad Has Secret Second Kid with Stepdaughter",
      "type": "story",
      "url": "https://www.rollingstone.com/culture/culture-news/elon-musk-dad-has-secret-second-child-1383353/"
    },
    {
      "by": "throwaway894345",
      "descendants": 0,
      "id": 32110273,
      "score": 1,
      "time": 1657904487,
      "title": "1,500 Tesla Powerwall owners have already joined the new virtual power plant",
      "type": "story",
      "url": "https://electrek.co/2022/07/15/tesla-powerwall-owners-joined-new-virtual-power-plant-california/"
    },
    {
      "by": "elpeper",
      "descendants": 0,
      "id": 32110268,
      "score": 1,
      "time": 1657904468,
      "title": "How to Level Up into a Startup Leadership Role",
      "type": "story",
      "url": "https://blog.epistemix.com/blog/how-to-level-up-into-a-startup-leadership-role"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 32110266,
      "score": 1,
      "time": 1657904465,
      "title": "Can US Himars Rocket Artillery Make a Difference?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=vQOgQSm7g_c"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 32110250,
      "score": 1,
      "time": 1657904387,
      "title": "London braces for first-ever extreme heat red warning",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/15/world/uk-heat-red-warning-record-climate/index.html"
    },
    {
      "by": "unknownsky",
      "descendants": 0,
      "id": 32110248,
      "score": 1,
      "text": "As a junior, I had one job years ago where I had an opportunity to see a small business&#x27;s work process. I immediately saw things that could be automated and so-called &quot;pain points&quot; that could be improved with software. I opened up Balsamiq, sketched up a sample of software that would solve their problems and presented it to them. They loved my ideas and paid my employer to have me make them. They were thrilled with the result and I even heard through the grapevine how much it had helped them long after I had left that company.<p>Years later, I&#x27;m now a senior developer. Except for that one job, my whole career has been developing a carefully refined backlog of features that are handed to me. I get to use creativity and problem-solving for technical problems, but I keep thinking wistfully back to that one junior job where I got to come up with ideas for the software and features themselves.<p>I don&#x27;t know how to get an opportunity like that again. How would I convince a small business to let me come in and spy on their work processes so I can pitch them ideas to let me build something that would improve them? Has anyone successfully found their way in to do this?",
      "time": 1657904378,
      "title": "Ask HN: How can you convince companies to open up to you about pain points?",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32110230,
      "score": 1,
      "time": 1657904297,
      "title": "The Correlation",
      "type": "story",
      "url": "https://seths.blog/2022/07/the-correlation/"
    }
  ]
}