{
  "stories": [
    {
      "by": "breck",
      "descendants": 0,
      "id": 28010054,
      "score": 1,
      "time": 1627664898,
      "title": "Explorable Explanations",
      "type": "story",
      "url": "https://explorabl.es/"
    },
    {
      "by": "n4bz0r",
      "descendants": 0,
      "id": 28010047,
      "score": 1,
      "text": "Bonus questions:<p>* When was the last time you&#x27;ve encountered a trojan or a crypto-miner in pirated software&#x2F;games?<p>* Do viruses still get crypted?",
      "time": 1627664861,
      "title": "Ask HN: How good is Windows Defender at detecting trojans today?",
      "type": "story"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 28010022,
      "score": 2,
      "time": 1627664697,
      "title": "Internal CDC document warns delta infections likely more severe",
      "type": "story",
      "url": "https://www.washingtonpost.com/health/2021/07/29/cdc-mask-guidance/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 28010019,
      "score": 1,
      "time": 1627664664,
      "title": "Early Multidisciplinary Practice, Not Specialization, Predicts High Performance",
      "type": "story",
      "url": "https://journals.sagepub.com/doi/abs/10.1177/1745691620974772"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 28010001,
      "score": 1,
      "time": 1627664523,
      "title": "This Cruise Line Is Courting Remote Workers With Fast, Reliable Wi-Fi",
      "type": "story",
      "url": "https://www.travelandleisure.com/cruises/hurtigruten-remote-work-cruises"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 28009997,
      "score": 1,
      "time": 1627664509,
      "title": "JSDocs: It's like TypeScript but without all that TypeScript",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=iP5XwRT2tNw"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28009984,
      "score": 1,
      "time": 1627664433,
      "title": "Why the Stock Market Has Gone Up So Much",
      "type": "story",
      "url": "http://greyenlightenment.com/2021/07/28/stock-market-investing-series-part-1-why-the-stock-market-has-gone-up-so-much/"
    },
    {
      "by": "jamesog",
      "descendants": 0,
      "id": 28009982,
      "score": 1,
      "time": 1627664421,
      "title": "Mastodon for iOS",
      "type": "story",
      "url": "https://apps.apple.com/us/app/mastodon-for-iphone/id1571998974"
    },
    {
      "by": "ishishah",
      "descendants": 0,
      "id": 28009972,
      "score": 6,
      "text": "Hi, I&#x27;m Ishita, cofounder of Matrubials. We are developing milk-derived therapeutics to address infectious diseases.<p>I have extensive experience in microbiology and infectious diseases in both academia and industry. Taken together, our founding team has ~100 years of combined experience in microbiology and ecology, food science and chemistry. My cofounders have previously founded other health companies with specialized products (eg. Evolve Biosystems and BCD Bioscience).<p>We have been focused on structure-function analysis of mammalian milk and the benefits individual components can bring to human health for about two decades. In recent years, we discovered peptides in milk that have selective antimicrobial activity, meaning that they know who the pathogens are, and essentially go after them fast for elimination while bypassing the &quot;good&quot; bugs, leaving them around to continue their jobs. That was the moment we decided we needed to bring these to the market.<p>One niche in the human body where the imbalance between the good and the bad is really bad, is the human vagina. We&#x27;ve been focusing on specific bacteria that reside in the normal human vagina and those that take over to cause disease. In particular, we hope to reduce the burden of bacterial vaginosis, which remains unresolved with current antibiotics. This is especially important because these infections tend to recur, and can lead to secondary infections and reproductive issues.<p>Antibiotic discovery is hard, technically and financially. To develop candidate molecules from early stage research to clinically viable products, with efficacy and safety that do better than current standard-of-care, is a major challenge. An opportunity like this one doesn&#x27;t come around often so we&#x27;re pretty excited about it.<p>Converting milk components into therapeutics- now isn&#x27;t that a great hack? We think so! Happy to hear your thoughts and answer questions!",
      "time": 1627664392,
      "title": "Launch HN: Matrubials (YC S21) Milk-derived therapeutics for infectious diesases",
      "type": "story"
    },
    {
      "by": "deobald",
      "descendants": 0,
      "id": 28009967,
      "score": 1,
      "time": 1627664367,
      "title": "Crux 1.18.0 Is Out",
      "type": "story",
      "url": "https://github.com/juxt/crux/releases/tag/1.18.0"
    }
  ]
}