{
  "stories": [
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 31655651,
      "score": 1,
      "time": 1654615180,
      "title": "OptiPNG vs. PNGcrush vs. Gimp to Reduce PNG Size",
      "type": "story",
      "url": "https://rubysash.com/programming/wordpress/optipng-vs-pngcrush-vs-gimp-to-reduce-png-size/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31655644,
      "score": 1,
      "time": 1654615132,
      "title": "Next Steps in Japan’s Nuclear Sharing Debate",
      "type": "story",
      "url": "https://www.nippon.com/en/in-depth/d00809/"
    },
    {
      "by": "soapdog",
      "descendants": 0,
      "id": 31655635,
      "score": 1,
      "time": 1654615104,
      "title": "About iPads and Developers",
      "type": "story",
      "url": "https://andregarzia.com/2022/06/about-ipads-and-developers.html"
    },
    {
      "by": "kgilmer",
      "descendants": 0,
      "id": 31655626,
      "score": 1,
      "time": 1654615066,
      "title": "Regolith Desktop 2.0",
      "type": "story",
      "url": "https://regolith-desktop.com/"
    },
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 31655574,
      "score": 1,
      "time": 1654614868,
      "title": "Cloture – Implementation of Clojure in Common Lisp",
      "type": "story",
      "url": "https://github.com/ruricolist/cloture"
    },
    {
      "by": "gabrielboeker",
      "descendants": 0,
      "id": 31655509,
      "score": 1,
      "text": "One of the most important and biggest mantras in the startup world is user-centricity. &quot;be close to the user, develop solutions for problems people have, product market fit is all about the user&#x27;s needs&quot;. This is all true and should definitely be cultivated, because one of the many advantages of a startup compared to larger companies is its massive flexibility - and that includes the ability to work close to the user and make decisions quickly. Of course, I&#x27;m only talking about product development here.<p>Why do so many startups decide to prioritize the user&#x27;s basic needs lower once the supposed PMF is reached? Because the solution obviously meets what the user needs (because, by definition, product market fit can only be achieved when the solution provided meets the requirements). However, there is a problem with this: users change their needs from time to time.<p>This happens slowly but steadily, of course. Like the frog that is slowly boiled and doesn&#x27;t notice because the temperature barely rises noticeably, it is important for companies to keep a constant eye on the thermometer. Even the biggest companies in the world with the most established products lose their relevance as soon as they stop evolving.<p>In the early stages of a startup, it is en vouge to talk to your customers and find out in close interviews exactly what needs exist. Customer support and sales then do this in later stages as they work closely with the customer, but product development often forgets to build clear structures into their work that allow them to record and analyze the customer voice.<p>Reading the customer&#x27;s mind is also important for vertical product development. But it&#x27;s also exhausting and doesn&#x27;t bring any money directly into the bank. Listening is one thing, recognizing patterns and taking action is another.<p>I very often made the mistake of developing products that no one needed and working on features that were based on assumptions. So often that I now hold lectures in universities on how to work closer to the customer and validate needs.<p>Because this is not enough for me and I have seen many great founders fail, I decided to found Watchwork.<p>With watchwork, companies can make their customers (and churnees) their north star. Smart feedback flows paired with analytics help founders, product developers and also other teams like marketing and co to constantly keep an eye on the needs of their customers.<p>So far, I&#x27;m working on the product in a closed beta - after all, I don&#x27;t want to just preach, I want to practice.<p>In doing so, I am clearly focusing on three points:\n- User centricity\n- Clear design systems for intuitive handling and better scalability\n- Small and fast iterations for hypothesis validation<p>So far so good. Now it&#x27;s time to talk to customers!<p>- Gabriel",
      "time": 1654614587,
      "title": "Why so many startups stop talking to users and why it's a bad idea",
      "type": "story"
    },
    {
      "by": "merwanedr",
      "descendants": 0,
      "id": 31655470,
      "score": 1,
      "time": 1654614438,
      "title": "An API to get more context from on-chain data",
      "type": "story",
      "url": "https://chaingrep.com/"
    },
    {
      "by": "andsoitis",
      "descendants": 0,
      "id": 31655447,
      "score": 1,
      "time": 1654614389,
      "title": "Epistemology",
      "type": "story",
      "url": "https://plato.stanford.edu/entries/epistemology/"
    },
    {
      "by": "bwindels",
      "descendants": 0,
      "id": 31655442,
      "score": 1,
      "time": 1654614352,
      "title": "WebPush notifications coming to Safari 16 on macOS Ventura and iOS next year",
      "type": "story",
      "url": "https://webkit.org/blog/12824/news-from-wwdc-webkit-features-in-safari-16-beta/#web-push-for-macos"
    },
    {
      "by": "morajabi",
      "descendants": 2,
      "id": 31655430,
      "kids": [
        31655551,
        31655594
      ],
      "score": 2,
      "time": 1654614316,
      "title": "AirPods sound quality is crap in calls",
      "type": "story",
      "url": "https://airpods.wtf"
    }
  ]
}