{
  "stories": [
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 31608108,
      "score": 1,
      "time": 1654263596,
      "title": "Tosca Musk, Elon’s younger sister, is the force behind Passionflix",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/02/business/media/tosca-musk-passionflix.html"
    },
    {
      "by": "jjtang1",
      "descendants": 0,
      "id": 31608101,
      "score": 1,
      "time": 1654263558,
      "title": "SRE vs. Platform Engineering – Differences Explained",
      "type": "story",
      "url": "https://rootly.com/blog/sre-vs-platform-engineering-the-key-differences-explained"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 31608085,
      "score": 1,
      "time": 1654263488,
      "title": "Elon Musk tells Tesla chiefs to ax 10% of staff",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10881267/Musk-says-Tesla-needs-cut-staff-10-pauses-hiring.html"
    },
    {
      "by": "JaneLangley",
      "descendants": 0,
      "id": 31608078,
      "score": 1,
      "text": "Despite the dramatic collapse cryptocurrency markets witnessed in Q2, 2022, GetBlock’s development and marketing processes go like clockwork. Here’s the shortest recap of what we achieved in the first months of 2022.\nGetBlock and NEAR entered into a long-term partnership<p>In May, 2022, GetBlock partnered one of the most technically advanced blockchains, NEAR Protocol (NEAR). GetBlock is among the leading providers of NEAR Protocol’s APIs: our clients are using both shared and dedicated nodes of NEAR.<p>With new partnership inked, GetBlock received an ecosystem grant by NEAR Foundation. This grant is set to fuel the development of the first feature-rich explorer for the NEAR ecosystem. As a leading nodes provider, GetBlock has unmatched expertise in building customized blockchain explorers from scratch.<p>Also, in May, GetBlock scored partnerships with DropsTab crypto prices dashboard and CardStack, first-ever OS for Web3 purposes.\nBitTorrent Chain, TON nodes added: Why is it crucial?<p>Then, GetBlock added new offers to its nodes stack. We activated shared and dedicated nodes of BitTorrent Chain, an eccentric project based on the legendary BitTorrent peer-to-peer data exchange protocol. Currently, it is controlled by Justin Sun’s Tron Foundation.<p>Also, we integrated shared and dedicated nodes of The Open Network (previously Telegram Open Network). Initially designed as a Telegram’s payments system, The Open Network or TON gains steam as a high-performance Proof-of-Stake (PoS) blockchain.<p>Decentralized applications’ ecosystems of both blockchains are still in nascent stages. As such, GetBlock’s clients of BTTC and TON nodes can unlock ‘first mover advantage’ for their products.<p>AMA with Dash (DASH) team and new videos<p>In terms of community building, the GetBlock team was laser-focused on educational content. Maria Key, our Business Development manager sat down with Marina Siradegyan, Marketing Manager at Dash to discuss the features of Dash APIs for crypto businesses.<p>Also, we released new videos to cover the operations of our Bitcoin Cash (BCH), Dogecoin (DOGE) and Polkadot (DOT) shared nodes.",
      "time": 1654263458,
      "title": "Near Partnership, BitTorrent Chain and Ton APIs, AMA with Dash: 2022 in GetBlock",
      "type": "story"
    },
    {
      "by": "at-fates-hands",
      "descendants": 0,
      "id": 31608071,
      "score": 2,
      "time": 1654263422,
      "title": "Pre to postmortem: the inside story of the death of Palm and webOS (2012)",
      "type": "story",
      "url": "https://www.theverge.com/2012/6/5/3062611/palm-webos-hp-inside-story-pre-postmortem"
    },
    {
      "by": "xatlasm",
      "descendants": 0,
      "id": 31608069,
      "score": 2,
      "time": 1654263420,
      "title": "We’ve joined the FIDO Alliance to build a better future for authentication",
      "type": "story",
      "url": "https://blog.1password.com/1password-is-joining-the-fido-alliance/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 31608059,
      "score": 2,
      "time": 1654263373,
      "title": "Sheryl Sandberg’s Legacy",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/02/technology/sheryl-sandberg-legacy.html"
    },
    {
      "by": "dmitrygr",
      "descendants": 0,
      "id": 31608051,
      "score": 1,
      "time": 1654263336,
      "title": "Restaurants Add New Fees to Your Check to Counter Inflation",
      "type": "story",
      "url": "https://www.wsj.com/articles/waiter-theres-a-fee-in-my-soup-11654139870"
    },
    {
      "by": "Vector919",
      "descendants": 0,
      "id": 31608028,
      "score": 1,
      "time": 1654263247,
      "title": "Insurtech Policygenius cuts 25% of staff, less than 3 months after raising $125M",
      "type": "story",
      "url": "https://techcrunch.com/2022/06/02/insurtech-policygenius-cuts-25-of-staff-less-than-3-months-after-raising-125m/"
    },
    {
      "by": "amitport",
      "descendants": 1,
      "id": 31608023,
      "kids": [
        31608045
      ],
      "score": 1,
      "time": 1654263228,
      "title": "Angular 14",
      "type": "story",
      "url": "https://blog.angular.io/angular-v14-is-now-available-391a6db736af?gi=45b6d06a3f3e"
    }
  ]
}