{
  "stories": [
    {
      "by": "AlexBThomsen",
      "descendants": 1,
      "id": 30527848,
      "kids": [
        30527849
      ],
      "score": 1,
      "time": 1646232289,
      "title": "CryptoOwl – Improve your crypto returns while reducing stress",
      "type": "story",
      "url": "https://cryptoowl.xyz/"
    },
    {
      "by": "jicea",
      "descendants": 0,
      "id": 30527821,
      "score": 1,
      "time": 1646232137,
      "title": "API mock servers and contracts testing",
      "type": "story",
      "url": "https://meta.stoplight.io/docs/prism"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30527819,
      "score": 1,
      "time": 1646232121,
      "title": "Arrays of metallic nanoparticles form optical cavity tunable by liquid crystals",
      "type": "story",
      "url": "https://phys.org/news/2022-03-arrays-metallic-nanoparticles-optical-cavity.html"
    },
    {
      "by": "smbv",
      "descendants": 1,
      "id": 30527807,
      "kids": [
        30527820
      ],
      "score": 1,
      "time": 1646232067,
      "title": "Everyone who tells me it is “insecure” without defining a threat model owes $20",
      "type": "story",
      "url": "https://cybre.space/@haskal/107884402186470416"
    },
    {
      "by": "fben",
      "descendants": 0,
      "id": 30527802,
      "score": 1,
      "time": 1646232056,
      "title": "Show HN: Quickly build a beautiful status page for free",
      "type": "story",
      "url": "https://www.statusmetricshq.com/"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30527799,
      "score": 1,
      "time": 1646232026,
      "title": "Russian Bomber HF Activity, Amateur Radio / SDR",
      "type": "story",
      "url": "https://www.rtl-sdr.com/russian-bomber-hf-activity-amateur-radio-banned-in-ukraine-sdr-hobbyist-warning-again/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30527797,
      "score": 1,
      "time": 1646232019,
      "title": "Better sound, better graphics, better physics–the Gran Turismo 7 review",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2022/03/gran-turismo-7-reviewed-the-legend-turns-25/"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30527771,
      "score": 1,
      "time": 1646231888,
      "title": "Retro Game Consoles for Programmers",
      "type": "story",
      "url": "https://pikuma.com/blog/game-console-history-for-programmers"
    },
    {
      "by": "troygoode",
      "descendants": 1,
      "id": 30527757,
      "kids": [
        30527843
      ],
      "score": 3,
      "text": "Hi HN! I’m Troy, the founder of Courier (<a href=\"https:&#x2F;&#x2F;www.courier.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.courier.com</a>). Courier replaces all the extra work developers have had to do to add different notification channels—email, browser, mobile, SMS, chat, etc.—to their product.<p>I&#x27;m an engineer and have been in engineering leadership for a long time. I kept seeing my teams spending hundreds or thousands of hours building notification infrastructure on top of messaging APIs to solve for common use cases, and it really just felt like a missing abstraction layer to me.<p>At one point we were building a chat feature for our product and just wanted the ability to let Bob @mention Alice and have it get intelligently pushed either in-app, via mobile push, or email—something Slack does well. As we dug into it we discovered how expensive it is to roll-your-own. Companies like Airbnb have dozens of engineers that work only on this part of their infrastructure! We realized it was going to take way more work than we could justify, so I went to Twilio, AWS, et al asking if I could buy a solution and learned that that just didn&#x27;t exist. Somebody needed to create it.<p>Most product companies rebuild the same notification infrastructure on top of services like Twilio, Postmark, APNS&#x2F;Firebase, etc. Those pipes are great, but there is significant complexity in scheduling notifications, templating, retrying, and so on. Courier gives developers higher-level abstractions that make it fast to develop robust notifications, and much cheaper to maintain moving forward.<p>Courier has been heavily inspired by a now-famous article by Slack’s engineering team about how they decide when (and how) to send a notification to a user using a complicated state-chart [0], as well as a post by LinkedIn’s engineering team on their own notification infrastructure [1].  We make all of that possible for teams and products of any size. Our YC pitch was &quot;Segment for notifications.&quot;<p>Our customers plug in their existing messaging providers for the channels they want to notify customers on (e.g. Postmark or SendGrid for email, Twilio or MessageBird for SMS, etc.) They then call the Courier API which is able to correctly respect users&#x27; preferences, route a message to the “best” channel for a user, schedule messages to send seconds or months later, synchronize state across email and app inboxes, have a consistent template design experience for engineers and non-engineers on their team, ensure robust delivery at scale, and more.<p>A core focus for us from day one has been templating, something I think most developers have been frustrated by. We of course let you use your existing template code, but we also give you the ability to use our cross-channel JSON specification [2] or have both developers and non-technical teammates build templates for any channel using our drag and drop editor. In the latter cases, we use an abstract syntax tree under the hood to then render your message to the right format for each channel&#x2F;provider combination – e.g. HTML for email and BlockKit for Slack.<p>Courier is free to sign up for and send up to 10,000 notifications each month – no credit card required. We offer usage-based pricing if you need to remove our “Powered by Courier” branding or send a higher volume of messages.<p>Our team’s mission is to make software-to-human communication delightful, for both developers and for the users they are notifying – so we’d love to hear your experience from either side. Have you had to build internal notification micro-services? Is there anything really cool you wish would’ve been easier, or wish you saw more products offering? Are there apps or services that you wish were more delightful today?<p>[0]: <a href=\"https:&#x2F;&#x2F;slack.engineering&#x2F;reducing-slacks-memory-footprint&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;slack.engineering&#x2F;reducing-slacks-memory-footprint&#x2F;</a><p>[1]: <a href=\"https:&#x2F;&#x2F;engineering.linkedin.com&#x2F;blog&#x2F;2018&#x2F;03&#x2F;air-traffic-controller--member-first-notifications-at-linkedin\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.linkedin.com&#x2F;blog&#x2F;2018&#x2F;03&#x2F;air-traffic-co...</a><p>[2]: <a href=\"https:&#x2F;&#x2F;www.courier.com&#x2F;docs&#x2F;elemental&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.courier.com&#x2F;docs&#x2F;elemental&#x2F;</a>",
      "time": 1646231797,
      "title": "Launch HN: Courier (YC S19) – Developer infrastructure for product notifications",
      "type": "story",
      "url": "https://www.courier.com/"
    },
    {
      "by": "totaldude87",
      "descendants": 0,
      "id": 30527743,
      "score": 1,
      "time": 1646231715,
      "title": "Fitbit recalls Ionic smartwatch after 78 reports of burns",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/2/22957989/fitbit-ionic-recall-burns-smartwatch-fitness-tracker-refund"
    }
  ]
}