{
  "stories": [
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29742438,
      "score": 1,
      "time": 1640904300,
      "title": "The Illustrated TLS Connection: Every Byte Explained",
      "type": "story",
      "url": "https://tls.ulfheim.net/"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 29742427,
      "score": 1,
      "time": 1640904256,
      "title": "PhysURLs – A neat physics news aggregator",
      "type": "story",
      "url": "https://physurls.com"
    },
    {
      "by": "chris_overseas",
      "descendants": 0,
      "id": 29742419,
      "score": 1,
      "time": 1640904213,
      "title": "New Malware Uses SSD Over-Provisioning to Bypass Security Measures",
      "type": "story",
      "url": "https://www.tomshardware.com/news/ssd-over-provisioning-vulnerability"
    },
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29742408,
      "score": 1,
      "time": 1640904128,
      "title": "The Evolution of a Programmer",
      "type": "story",
      "url": "http://www.ariel.com.au/jokes/The_Evolution_of_a_Programmer.html"
    },
    {
      "by": "diminium",
      "descendants": 0,
      "id": 29742406,
      "score": 2,
      "text": "This is a discussion I hope can lead to some answers among the developer community about what&#x27;s going on these days.<p>I previously wrote about how various shopping sites are being very hostile to their customer base [https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29384866].  Why does a 32kb text article need 10MB of battery draining heavy javascript to just work?  But this is more then just shopping sites as so many websites, browsers, programs, and even OS&#x27;s are making decisions that are hostile to their users.   And it&#x27;s coming from everywhere.  What used to be controversial (e.g. dark patterns), is now normal.  And if the user complains - the answers from the developers is &quot;we&#x27;re sorry, just live with it?&quot;<p>I could write an essay on this but I&#x27;ll focus on a company which publicly represent this hostility - Blizzard.  Blizzard is an entertainment company in an industry which has a tremendous amount of competition.  And many Blizzard games are paid for directly from the user&#x27;s pockets so the customers are paying.  But yet, even with this, the contempt the developers have towards their users is immense.  While I&#x27;m not a Blizzard fan, I know people who are and they are furious.  Yet at the same time, even with this angry customer base, the developers kept saying they &quot;knew best&quot; demanding the customers do things their until the ceiling broke and the mass exodus we know today happened.  There&#x27;s no apology, no sympathy - nothing - just complete hostility against their users.<p>But of course, this is not just a story about Blizzard.  It&#x27;s Apple, Google, Firefox, Reddit, Facebook, Twitter, Microsoft, etc.  Just look at Microsoft and their heavy use of dark patterns to force Windows 10&#x2F;11 options (another essay unto itself).  And so many companies gleefully advertising &quot;it&#x27;s your choice&quot; where &quot;your choice&quot; is slowly &quot;depreciated&quot; until &quot;your choice&quot; is no longer in the deeply hidden options menu.<p>What is it about this field that attracts people that are so adamant, so demanding that their users, their customers do it &quot;their way or the highway&quot;?  People who seemly absolutely refuse to even acknowledge the burdens they force upon their users even when their users are saying, very loudly, &quot;I don&#x27;t want this.&quot;<p>In the past, I used software because I wanted to use it.  These days, I use software, not because I want to, but because I have to.<p>(To be fair, it might not be the individual developers who is hostile but something in the decision making process is causing entire company to be hostile to their users.)",
      "time": 1640904120,
      "title": "Discuss HN: Why do so many developers seem hostile to their users these days?",
      "type": "story"
    },
    {
      "by": "someelephant",
      "descendants": 0,
      "id": 29742380,
      "score": 1,
      "text": "Anecdotally, quite a clever dark pattern Instacart is using. Telling users they can get an email before they cancel and then designing the email so it will likely be marked as spam.",
      "time": 1640903999,
      "title": "Ask HN: Has anybody had an Instacart Express renewal message hit their inbox?",
      "type": "story"
    },
    {
      "by": "eigenhombre",
      "descendants": 0,
      "id": 29742372,
      "score": 1,
      "time": 1640903915,
      "title": "Covid-19 Risk Calculators Help Assess Safety",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/30/style/covid-risk-calculator.html"
    },
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29742369,
      "score": 1,
      "time": 1640903899,
      "title": "Unofficial Google Advanced Search",
      "type": "story",
      "url": "http://jwebnet.net/advancedgooglesearch.html"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29742348,
      "score": 1,
      "time": 1640903670,
      "title": "International Space Station Transits the Sun",
      "type": "story",
      "url": "https://www.nasa.gov/image-feature/images-of-2021-international-space-station-transits-the-sun/"
    },
    {
      "by": "27182818284",
      "descendants": 0,
      "id": 29742344,
      "score": 1,
      "time": 1640903642,
      "title": "Upside-Down Skyscraper Could Become One of NYC’s Tallest Buildings",
      "type": "story",
      "url": "https://mymodernmet.com/adjaye-associates-affirmation-tower/"
    }
  ]
}