{
  "stories": [
    {
      "by": "toomuchtodo",
      "descendants": 0,
      "id": 28051762,
      "score": 1,
      "time": 1628011354,
      "title": "UK finance giants plan to buy out fossil fuel plants in order to shut them",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/aug/03/uk-finance-giants-plan-to-buy-out-fossil-fuel-plants-in-order-to-shut-them"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 28051755,
      "score": 1,
      "time": 1628011265,
      "title": "'solo VCs' are changing the venture game",
      "type": "story",
      "url": "https://pitchbook.com/news/articles/how-solo-vcs-are-changing-the-venture-game"
    },
    {
      "by": "BigBalli",
      "descendants": 0,
      "id": 28051704,
      "score": 1,
      "time": 1628010976,
      "title": "The Oxymoron of “Data-Driven Innovation”",
      "type": "story",
      "url": "https://chelseatroy.com/2021/07/30/the-oxymoron-of-data-driven-innovation/"
    },
    {
      "by": "hnaccount_rng",
      "descendants": 0,
      "id": 28051699,
      "score": 1,
      "time": 1628010951,
      "title": "Apple updates Intel Mac Pro with three new graphics card modules",
      "type": "story",
      "url": "https://9to5mac.com/2021/08/03/apple-updates-intel-mac-pro-with-three-new-graphics-card-modules/"
    },
    {
      "by": "smhx",
      "descendants": 0,
      "id": 28051692,
      "score": 2,
      "time": 1628010917,
      "title": "Growing open-source: from Torch to PyTorch",
      "type": "story",
      "url": "https://soumith.ch/posts/2021/02/growing-opensource/"
    },
    {
      "by": "robot_jackie",
      "descendants": 0,
      "id": 28051684,
      "score": 1,
      "text": "Every warehouse around the world has to do inventory counts. We used to do this job ourselves, with paper and pencil. It sucks. Warehouses lose inventory all the time.<p>We built full Level 4 autonomy for drones so they fly in big warehouse aisles by themselves. It’s built on a ROS and PX4-based stack we built ourselves using a visual-inertial system for real-time motion planning and controls.<p>What we mean by Level 4 autonomy is, our UAVs fly without any human involvement at all, repeatedly, for weeks. Fully automated scheduling, takeoff, landing, data transfer. They autonomously fly closer to look at inventory labels of interest.<p>Full autonomy is the only way this will work, removing friction for traditional industries to adopt. Putting up thousands of localization stickers and beacons sucks. Manual pilot is even worse.<p>This only works for single-deep pallet or carton level items. I don’t know how to solve for items behind other items. Folks mention RFID, but then inevitably say they’ll adopt RFID “in two or three years.”<p>One cofounder was a founding contributor of PX4, the popular drone autopilot that many commercial UAVs are based on. Another cofounder used to work a warehouse inventory job, before building autonomous aircraft for the DoD. A third wrote an ERP from scratch in college and integrated it to legacy systems. They’re much smarter than me. I’m lucky to be working with them.<p>What motivates me is, I think one pillar of future economic development will come from the dock to dock automation of supply chain. Companies in rich and poor countries will be free to focus on growth, instead of the mundane tasks of moving things around and tracking where they are. In addition to inventory drones, we’re working on automating other key warehouse functions in the future.<p>Check out the demo video!  https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;corvus-one&#x2F;<p>HN friends: Have you worked in a warehouse or factory? What’s been your experience with robot automation, and what automation impressed you the most? I’d love to hear your thoughts on supply chain automation, robotic autonomy, and economic development!",
      "time": 1628010862,
      "title": "Show HN: Corvus Robotics (YC S18): Level 4 autonomy, warehouse inventory UAVs",
      "type": "story"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 28051672,
      "score": 1,
      "time": 1628010781,
      "title": "'Why I'm ending my life, while I can' [video]",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/av/uk-england-london-58014609"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28051661,
      "score": 1,
      "time": 1628010723,
      "title": "How to Create a Standalone ConsoleLoggerProvider",
      "type": "story",
      "url": "https://mikehadlow.com/posts/standalone-consoleloggerprovider/"
    },
    {
      "by": "robot_jackie",
      "descendants": 1,
      "id": 28051647,
      "kids": [
        28051648
      ],
      "score": 2,
      "time": 1628010671,
      "title": "Show HN: Corvus Robotics (YC S18) – Level 4 autonomy, warehouse inventory UAVs",
      "type": "story",
      "url": "http://spectrum.ieee.org/drone-warehouse-corvus-robotics"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28051645,
      "score": 1,
      "time": 1628010665,
      "title": "As Cyberattacks Surge, Security Startups Reap the Rewards",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/26/technology/cyberattacks-security-investors.html"
    }
  ]
}