{
  "stories": [
    {
      "by": "mdsami",
      "descendants": 0,
      "id": 28329222,
      "score": 1,
      "time": 1630078839,
      "title": "Mobile app UI KIT. Flutter coming next week",
      "type": "story",
      "url": "https://www.uihut.com/mobile-app/mobile-app"
    },
    {
      "by": "GordonS",
      "descendants": 0,
      "id": 28329217,
      "score": 1,
      "time": 1630078803,
      "title": "Conductor: We Migrated from Kubernetes to Nomad",
      "type": "story",
      "url": "https://thenewstack.io/conductor-why-we-migrated-from-kubernetes-to-nomad/"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 28329214,
      "score": 1,
      "time": 1630078794,
      "title": "OnlyFans Shows How the Banking System Is Politicized",
      "type": "story",
      "url": "https://www.coindesk.com/business/2021/08/26/onlyfans-shows-how-the-banking-system-is-politicized/"
    },
    {
      "by": "FridayoLeary",
      "descendants": 0,
      "id": 28329212,
      "score": 1,
      "time": 1630078776,
      "title": "Britain to raise contactless payment limit to 100 stg on Oct. 15",
      "type": "story",
      "url": "https://www.reuters.com/technology/britain-raise-contactless-payment-limit-100-stg-oct-15-2021-08-27/"
    },
    {
      "by": "ridwan_olalere1",
      "descendants": 0,
      "id": 28329211,
      "score": 3,
      "text": "Hello Hacker News! Rian and I are co-founders of Lemonade Finance (<a href=\"https:&#x2F;&#x2F;lemonade.finance\" rel=\"nofollow\">https:&#x2F;&#x2F;lemonade.finance</a>). Lemonade is a digital bank for the African diaspora. There are over 20M African immigrants in North America and Europe and the majority are running some form of business back home. We provide multi-currency accounts to help them manage their unique banking needs.<p>Rian and I have worked together over the last several years helping to build African fintechs such as Opay (in Nigeria) and Okash (in Kenya). As directors of operations and finance, we were instrumental in scaling Opay from $0 to $2B monthly transactions.<p>It stood out to us that Africans can pay up to 30% more than the global average to move money abroad, and most African countries are only enabled to receive, and unable to send. Looking further, we discovered that remittance (sending money back home) wasn&#x27;t enough for the diaspora—a lot of them run one or two businesses back home. There&#x27;s limited access to African currencies abroad, it&#x27;s difficult to open and maintain accounts back home, getting money out of Africa is a challenge, and the size and frequency of their transactions is much greater.<p>We issue bank accounts to our users in both their country&#x2F;currency of origin as well as in their country&#x2F;currency of residence, and provide them with the tools to manage both their personal and business banking between continents. We integrate and build open banking APIs in the countries we operate, manage floats across countries, and obtain the licensing that enables our users to store or move money across borders.<p>8 of the 10 fastest growing international migrant populations are African. The African diaspora represents a $10B market opportunity. We launched 10 months ago and are currently processing $5.5M per month and made $23k in monthly revenue in July. We are licensed to provide our services in the US, Canada, and the UK.<p>We are really happy we get to share this with the Hacker news community. Please let us know your thoughts and questions in the comment section below.",
      "time": 1630078765,
      "title": "Launch HN: Lemonade Finance (YC S21) – Digital Bank for the African Diaspora",
      "type": "story"
    },
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 28329200,
      "score": 1,
      "time": 1630078687,
      "title": "Google’s new ad goes full Jony Ive on the Pixel 5A headphone jack",
      "type": "story",
      "url": "https://www.theverge.com/2021/8/27/22644368/google-pixel-5a-headphone-jack-ad"
    },
    {
      "by": "OJFord",
      "descendants": 0,
      "id": 28329167,
      "score": 1,
      "time": 1630078516,
      "title": "'Hipster antitrust' might end the mega-merger party (2019)",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2019-11-19/-hipster-antitrust-might-end-the-megamerger-party"
    },
    {
      "by": "lakis",
      "descendants": 0,
      "id": 28329160,
      "score": 1,
      "time": 1630078452,
      "title": "State of California alleges Activision Blizzard HR “shredded” documents",
      "type": "story",
      "url": "https://www.eurogamer.net/articles/2021-08-25-state-of-california-alleges-activision-blizzard-hr-shredded-documents"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 28329135,
      "score": 1,
      "time": 1630078365,
      "title": "Microsoft warns of critical Azure Cloud vulnerability impacting Cosmos DB",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/microsoft-warns-of-critical-azure-cloud-vulnerability-impacting-cosmos-db-accounts"
    },
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 28329130,
      "score": 3,
      "time": 1630078340,
      "title": "Afghan All-Girls Robotics Team Tells US Woman to Stop Taking Credit for Rescue",
      "type": "story",
      "url": "https://www.thedailybeast.com/afghan-all-girls-robotics-team-tells-oklahoma-woman-to-stop-taking-credit-for-rescue"
    }
  ]
}