{
  "stories": [
    {
      "by": "TomWhitwell",
      "descendants": 0,
      "id": 32126573,
      "score": 1,
      "time": 1658064437,
      "title": "DALL-E algorithm updated to produce more diverse images",
      "type": "story",
      "url": "https://twitter.com/tomwhitwell/status/1548580174416863234"
    },
    {
      "by": "mathverse",
      "descendants": 0,
      "id": 32126563,
      "score": 1,
      "text": "Have you experienced people trying to always build &#x2F; maintain monoethnic teams? How do you approach this problem and how do you even talk about it?<p>This is very specific to my EU&#x2F;Singapore experience so I am not sure how big of a problem this is in the US&#x2F;North America.<p>Even though the working language is english there&#x27;s usually teams where one person decides to always hire people of his ethnicity or people that speak a specific language.<p>Meetings with such team is always awkward as they internally discuss the topic in their own language during the meeting. Also their hiring practices are essentially discriminatory.",
      "time": 1658064322,
      "title": "Ask HN: One team lead always builds a monoethnic team. What to do?",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 32126540,
      "score": 2,
      "time": 1658064180,
      "title": "CTE support is coming to Rails",
      "type": "story",
      "url": "https://twitter.com/palkan_tula/status/1548052356306063370"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 32126537,
      "score": 2,
      "time": 1658064162,
      "title": "The New Numbers on Music Consumption Are Ugly",
      "type": "story",
      "url": "https://tedgioia.substack.com/p/the-new-numbers-on-music-consumption"
    },
    {
      "by": "t_mann",
      "descendants": 0,
      "id": 32126533,
      "score": 1,
      "text": "It&#x27;s really time for me to move on from Outlook, the amount of glitches is becoming unbearable (it regularly crashes on routine operations, like when I try to add or delete accounts, or even just on meeting reminders). My requirements are:<p>* decent support for multiple accounts<p>* Support for IMAP as well as Exchange<p>* Exchange calendar sync, all other features are kind of optional (lean would be preferred)<p>I tried those alternatives, but none seem to do quite what I want:<p>* Windows Mail: I actually really like the app, it&#x27;s leaner and faster than Outlook, but it has one major bug on my machine: it&#x27;s using the same &quot;Sent From&quot; name on all accounts and doesn&#x27;t let me edit it. I found an blog post describing the same problem and how a reinstall helped them, but for me not even that does the trick.<p>* Thunderbird: this would be my favourite, but it doesn&#x27;t support Exchange",
      "time": 1658064154,
      "title": "Ask HN: Which email client do you use on Windows?",
      "type": "story"
    },
    {
      "by": "luciantartea",
      "descendants": 0,
      "id": 32126523,
      "score": 1,
      "time": 1658064038,
      "title": "How to make money with HTML CSS and design",
      "type": "story",
      "url": "https://devreso.com/how-sell-html-website-templates/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 32126521,
      "score": 1,
      "time": 1658064015,
      "title": "M2 MacBook Air 10 Core vs 8 Core GPU",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=lTiDnh8g3ss"
    },
    {
      "by": "tomrod",
      "descendants": 0,
      "id": 32126520,
      "score": 1,
      "text": "Received from Proton this morning:<p>----<p>Update about recent disruptions to Proton services<p>Dear Proton community member,<p>Earlier this week, some of you may have experienced disruptions with Proton services. While these disruptions were brief for many of you, some community members experienced longer service interruptions. We know this is unacceptable to you, and it also falls short of the standards that we set for ourselves.<p>Proton’s redundant infrastructure means no data or emails were lost. Still, in the spirit of transparency on which Proton is founded, we want to share details about what happened and what we have done to resolve the issue.<p>What happened Over the last several months, we have been upgrading our infrastructure to serve you better. This involves adding new servers and upgrading our software to deliver improvements like faster performance or more storage capacity for paid users. As a part of this process, we upgraded the servers running our core database to a new version on Sunday, July 10. Before this week, we’d extensively tested this upgrade and completed it hundreds of times without incident.<p>However, our core database has higher activity than other databases, and it behaved differently from what the tests led us to expect. Under high activity, it became sensitive to the time it took to establish a connection in an unexpected way. As a result, during the peak activity period on Monday, July 11, connections began to overload the upgraded database. This automatically activated protective measures that prevented some of you from connecting to Proton.<p>When addressing a situation like this, we would typically switch back to the previous version of the database software, but this particular upgrade was irreversible because it changed the database’s data formats.<p>How we solved it As soon as the incident began, we progressively reduced the load on the databases by splitting the workload over more servers and slowing down lower priority services, such as push notifications. This is why some of you might have experienced delays in receiving notifications.<p>Many of these changes required us to bring additional servers online, and our infrastructure engineering team worked in continuous shifts around the clock to get it done. We worked to make the intermittent service interruptions as short as possible during this period. Despite these efforts, we regret that this situation still impacted many of you. After redistributing the database workload, we were able to fully restore system stability and improve performance.<p>Next steps Serving the Proton community is our main priority, and we’re deeply sorry about these service disruptions. We owe you an apology and understand that we must do better. Many of the improvements we have made this week have substantially strengthened Proton’s infrastructure, making disruptions like this one far less likely to occur in the future. We will take these lessons with us as we continuously work to serve you better. We will also publish a more detailed report on the Proton blog in the coming weeks.<p>Proton is building a better internet where people come first and privacy is the default. Our work would not be possible without you. Thank you again for bearing with us and for supporting our mission.<p>Thank you, The Proton Team",
      "time": 1658064011,
      "title": "Email from ProtonMail on recent service disruptions",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32126483,
      "score": 1,
      "time": 1658063655,
      "title": "Quickenv: An Unintrusive Environment Manager",
      "type": "story",
      "url": "https://github.com/untitaker/quickenv"
    },
    {
      "by": "gereshes",
      "descendants": 0,
      "id": 32126474,
      "score": 1,
      "time": 1658063575,
      "title": "A Note on Error Due to Floating-Point Arithmetic",
      "type": "story",
      "url": "https://gereshes.com/2022/07/17/a-note-on-error-due-to-floating-point-arithmetic/"
    }
  ]
}