{
  "stories": [
    {
      "by": "tonmoy",
      "descendants": 0,
      "id": 31841287,
      "score": 1,
      "text": "As an engineer working in ASIC universe it is difficult to do side projects and learn digital design or RTL without spending thousands of dollars on hardware. Cloud based FPGA services like aws-FPGA seem approachable, but I’m wondering if these services actually have any good use cases in real life. I don’t want to work on a side project like making an HDMI controller or something if it has no real world value",
      "time": 1655928816,
      "title": "Ask HN: Anyone using cloud based FPGA for non-ML tasks?",
      "type": "story"
    },
    {
      "by": "anigbrowl",
      "descendants": 0,
      "id": 31841285,
      "score": 1,
      "time": 1655928798,
      "title": "Neutral bots probe political bias on social media",
      "type": "story",
      "url": "https://www.nature.com/articles/s41467-021-25738-6"
    },
    {
      "by": "TheIronYuppie",
      "descendants": 0,
      "id": 31841275,
      "score": 1,
      "time": 1655928735,
      "title": "Show HN: The SAME project – simplifying bringing your notebook to production",
      "type": "story",
      "url": "https://sameproject.ml/blog/2022-06-15-Introducing-The-SAME-Project/"
    },
    {
      "by": "eimrine",
      "descendants": 0,
      "id": 31841271,
      "score": 1,
      "text": "Schematics and layout of a circuit design and binaries for digital components with ability of public developing.",
      "time": 1655928716,
      "title": "Ask HN: Is there a GitHub analog for electronics?",
      "type": "story"
    },
    {
      "by": "scifibestfi",
      "descendants": 0,
      "id": 31841254,
      "score": 1,
      "time": 1655928640,
      "title": "The World’s Bubbliest Housing Markets Are Flashing Warning Signs",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2022-06-21/cooling-real-estate-markets-in-us-uk-risk-deeper-global-economic-slump"
    },
    {
      "by": "rafd",
      "descendants": 0,
      "id": 31841251,
      "score": 1,
      "time": 1655928625,
      "title": "Unstuck – An App for Peer-to-Peer Support and On-Demand Training",
      "type": "story",
      "url": "https://www.unstuckapp.com/"
    },
    {
      "by": "ramshorst",
      "descendants": 0,
      "id": 31841247,
      "score": 1,
      "time": 1655928593,
      "title": "Ask HN: What Makes HN Addictive?",
      "type": "story"
    },
    {
      "by": "TekMol",
      "descendants": 0,
      "id": 31841242,
      "score": 1,
      "text": "In the USA, about 5 Trillion have been created:<p>https:&#x2F;&#x2F;fred.stlouisfed.org&#x2F;series&#x2F;M2SL<p>In Europe it was similar. Also trillions have been created.<p>Where is all that money?<p>It must be on the bank accounts of some peopl, companies, institutions, right? But where? And how did it get there?<p>I for sure do not have it. My bank account did not get bigger during Corona.<p>Any &quot;Corona winners&quot; here?",
      "time": 1655928571,
      "title": "Ask HN: Trillions of new Dollars and Euros have been printed – where are they?",
      "type": "story"
    },
    {
      "by": "jameslao",
      "descendants": 0,
      "id": 31841215,
      "score": 1,
      "text": "Hi HN!<p>I&#x27;ve been working on a code review app for GitHub called Crocodile for about a year. I used to work at Microsoft where we used a tool called CodeFlow for reviewing code and I missed it after I left. I know many other ex-Microsoft engineers feel the same. Here are some of the distinguishing features of Crocodile that are inspired by CodeFlow:<p>* Comments float above the code instead of being inline. Long discussions that are displayed inline make it really hard to review the code.\n* Comment on any text selection in the file, even a single character.\n* Comments don&#x27;t get lost when code changes. I hate it when comments become &quot;outdated&quot; because I rebase or the line is edited.<p>I also implemented lots of features that I wish CodeFlow had which you can read more about on the blog. [1]<p>For those curious about the tech stack: it&#x27;s mostly written in Go with Alpine.js, HTMX, and Tailwind CSS for the frontend. For storage I use PostgreSQL, S3 compatible object storage, and Redis for caching. I use Pulumi for infrastructure provisioning and Kubernetes deployments. Everything is hosted on DigitalOcean.<p>Feedback is welcome!<p>[1] <a href=\"https:&#x2F;&#x2F;www.crocodile.dev&#x2F;blog&#x2F;why-crocodile\" rel=\"nofollow\">https:&#x2F;&#x2F;www.crocodile.dev&#x2F;blog&#x2F;why-crocodile</a>",
      "time": 1655928452,
      "title": "Show HN: Crocodile - Better code review for GitHub",
      "type": "story",
      "url": "https://www.crocodile.dev/"
    },
    {
      "by": "erehweb",
      "descendants": 0,
      "id": 31841194,
      "score": 1,
      "time": 1655928363,
      "title": "The tiny mites that have sex on your face are close to extinction",
      "type": "story",
      "url": "https://www.sciencefocus.com/news/demodex-mites-have-sex-on-your-face-close-to-extinction/"
    }
  ]
}