{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31261104,
      "score": 1,
      "time": 1651675207,
      "title": "Simone Giertz will sell you a terrible jigsaw puzzle",
      "type": "story",
      "url": "https://www.theverge.com/2022/5/3/23055713/simone-giertz-yetch-inventor-creator-youtube"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 31261062,
      "score": 1,
      "time": 1651675013,
      "title": "PyScript: Python in the Browser",
      "type": "story",
      "url": "https://anaconda.cloud/pyscript-python-in-the-browser"
    },
    {
      "by": "jorgeleo",
      "descendants": 0,
      "id": 31261058,
      "score": 2,
      "text": "On the essence of computer science<p>&quot;I&#x27;d like to welcome you to this course on computer science. Actually, that&#x27;s a terrible way to start. Computer science is a terrible name for this business. First of all, it&#x27;s not a science. It might be engineering or it might be art, but we&#x27;ll actually see that computer so-called science actually has a lot in common with magic, and we&#x27;ll see that in this course.<p>So it&#x27;s not a science. It&#x27;s also not really very much about computers. And it&#x27;s not about computers in the same sense that physics is not really about particle accelerators, and biology is not really about microscopes and petri dishes. And it&#x27;s not about computers in the same sense that geometry is not really about using surveying instruments.<p>In fact, there&#x27;s a lot of commonality between computer science and geometry. Geometry, first of all, is another subject with a lousy name. The name comes from Gaia, meaning the Earth, and metron, meaning to measure. Geometry originally meant measuring the Earth or surveying.<p>And the reason for that was that, thousands of years ago, the Egyptian priesthood developed the rudiments of geometry in order to figure out how to restore the boundaries of fields that were destroyed in the annual flooding of the Nile. And to the Egyptians who did that, geometry really was the use of surveying instruments.<p>Now, the reason that we think computer science is about computers is pretty much the same reason that the Egyptians thought geometry was about surveying instruments. And that is, when some field is just getting started and you don&#x27;t really understand it very well, it&#x27;s very easy to confuse the essence of what you&#x27;re doing with the tools that you use. And indeed, on some absolute scale of things, we probably know less about the essence of computer science than the ancient Egyptians really knew about geometry.<p>Well, what do I mean by the essence of computer science? What do I mean by the essence of geometry? See, it&#x27;s certainly true that these Egyptians went off and used surveying instruments, but when we look back on them after a couple of thousand years, we say, gee, what they were doing, the important stuff they were doing, was to begin to formalize notions about space and time, to start a way of talking about mathematical truths formally. That led to the axiomatic method. That led to sort of all of modern mathematics, figuring out a way to talk precisely about so-called declarative knowledge, what is true.<p>Well, similarly, I think in the future people will look back and say, yes, those primitives in the 20th century were fiddling around with these gadgets called computers, but really what they were doing is starting to learn how to formalize intuitions about process, how to do things, starting to develop a way to talk precisely about how-to knowledge, as opposed to geometry that talks about what is true.&quot;<p>-- Hal Abelson, Structure and Interpretation of Computer Programs, MIT",
      "time": 1651674998,
      "title": "On the Essence of Computer Science",
      "type": "story"
    },
    {
      "by": "zacchj",
      "descendants": 0,
      "id": 31261025,
      "score": 1,
      "time": 1651674884,
      "title": "TFHE – a fully homomorphic encryption scheme based on LWE",
      "type": "story",
      "url": "https://www.zama.ai/post/tfhe-deep-dive-part-1"
    },
    {
      "by": "soneca",
      "descendants": 0,
      "id": 31261005,
      "score": 1,
      "time": 1651674799,
      "title": "Are Cryptocurrencies Currencies? Bitcoin as Legal Tender in El Salvador [pdf]",
      "type": "story",
      "url": "https://bfi.uchicago.edu/wp-content/uploads/2022/04/BFI_WP_2022-54.pdf"
    },
    {
      "by": "drallison",
      "descendants": 1,
      "id": 31261004,
      "kids": [
        31261033
      ],
      "score": 1,
      "time": 1651674796,
      "title": "Prototype Shadecraft Satellite Project",
      "type": "story",
      "url": "http://ee380.stanford.edu"
    },
    {
      "by": "Crontab",
      "descendants": 0,
      "id": 31260961,
      "score": 2,
      "text": "I have a number of webpages that I would like to archive as a PDF with the website formatting preserved. The normal process of saving to PDF via printing creates a file that I find unacceptable. I haven&#x27;t had any luck finding a solution to this, although using Puppeteer would seem to be an option.<p>Does anyone have a suggestion on saving webpages as PDFs that display just like the webpage did in the browser?",
      "time": 1651674578,
      "title": "Ask HN: Saving Webpages as PDF While Preserving Formatting",
      "type": "story"
    },
    {
      "by": "janetacarr",
      "descendants": 2,
      "id": 31260959,
      "kids": [
        31261096,
        31260988
      ],
      "score": 1,
      "time": 1651674562,
      "title": "Ramen Profitable",
      "type": "story",
      "url": "http://paulgraham.com/ramenprofitable.html"
    },
    {
      "by": "lawgimenez",
      "descendants": 1,
      "id": 31260934,
      "kids": [
        31261088
      ],
      "score": 2,
      "text": "Looking to add more tech or engineering blogs to my RSS reader. Thanks!",
      "time": 1651674455,
      "title": "Ask HN: What are your favorite tech or engineering blogs to follow?",
      "type": "story"
    },
    {
      "by": "mlejva",
      "descendants": 0,
      "id": 31260925,
      "score": 1,
      "time": 1651674421,
      "title": "Open Source Guides",
      "type": "story",
      "url": "https://opensource.guide/"
    }
  ]
}