{
  "stories": [
    {
      "by": "ittan",
      "descendants": 0,
      "id": 28793693,
      "score": 1,
      "time": 1633650597,
      "title": "Samsung Outlines 3nm Plans",
      "type": "story",
      "url": "https://news.samsung.com/global/samsung-foundry-innovations-power-the-future-of-big-data-ai-ml-and-smart-connected-devices"
    },
    {
      "by": "ildaron_ron",
      "descendants": 2,
      "id": 28793660,
      "kids": [
        28793691,
        28793661
      ],
      "score": 1,
      "time": 1633650360,
      "title": "Laser to Kill Mosquitoes",
      "type": "story",
      "url": "https://github.com/Ildaron/Laser_control"
    },
    {
      "by": "LeslieDewhurst",
      "descendants": 0,
      "id": 28793637,
      "score": 2,
      "text": "Not everyone gets a second chance at life.<p>For me it came when I was diagnosed with Chronic Kidney Disease (CKD), put on dialysis and told that I’d need to wait three to five years for a new kidney. Depressed at the thought of five year wait, thrice weekly dialysis and the likelihood that I might die, I’d  revised my will, walked into my local coffee and asked in an embarrassingly loud voice if anyone had a spare kidney. Fortunately, Lucy the manager volunteered and praise be, we were a kidney compatible match. My ordeal was over in less than two years and I’d gotten my second chance.<p>That’s when I’d started to learn about the humongous cost of CKD patient support. About 20% of the US  Medicare budget of $776 Bln is used in supporting patients with kidney disease. A similar percentage is taken by the UK’s NHS. The reason’s straightforward: once diagnosed, CKD is for the rest of a patient’s life. For us post-transplanters a lifetime of support, mostly quarterly physician meetings and twice daily meds, is still required and that’s a lot of time for both patients and physicians.<p>What if we could reduce at least some of that cost by putting most of that post transplant support into an App that patients can use daily and physicians can remotely monitor? That’s how Health-AI and TrackMyTac, our first App, came into being after I’d spent too many months on the interminable treadmill of blood works, followed by physician meetings and more meds.  In my ideal world, that App would coach me into taking my meds on-time twice a day and also reassure me and my physician that my med levels at my next bloods would be on-track. Most important of all: if this would be possible with one App, then that App should be available globally because kidney failure is a global challenge and needs a global solution.<p>By early 2020, we had a demonstrable version of TrackMyTac and I showed it around. There was interest, but by far the most common comment was: interesting, come and see us in 3- 5 year’s time and change it now, cos docs won’t like self-monitoring. \nThen Covid-19 blew-in like a baltic blizzard. \nRather than down keyboards and wait out the pandemic we pushed-on and developed an additional entry level App along with a totally automated one with voice control. Then, almost overnight, Doctors worldwide began to search for ways to manage and monitor patients remotely and that 3 - 5 years dissolved into 3 - 5 months.<p>We’re almost two years old now and we have product, users and a developing, worldwide, market. Now, we’re looking to our next funding round. \nNone of this would have happened if I hadn’t suffered that personal crisis, Lucy hadn’t agreed to help and remote patient monitoring hadn’t become a pressing global reality.<p>With serendipity like that, how could I not have founded an Heath Tech start-up?<p>@DewhurstLeslie",
      "time": 1633650217,
      "title": "Why kidney failure led me to found an Health Tech Startup",
      "type": "story"
    },
    {
      "by": "mikermcneil",
      "descendants": 0,
      "id": 28793633,
      "score": 4,
      "time": 1633650201,
      "title": "Osquery creator forks widely-used laptop monitoring software",
      "type": "story",
      "url": "https://blog.fleetdm.com/a-new-fleet-d4096c7de978"
    },
    {
      "by": "gfitz",
      "descendants": 0,
      "id": 28793615,
      "score": 2,
      "time": 1633650025,
      "title": "Tesla Moves HQ from California to Austin",
      "type": "story",
      "url": "https://www.kxan.com/news/business/elon-musk-announces-teslas-headquarters-will-move-to-austin/"
    },
    {
      "by": "HiroProtagonist",
      "descendants": 0,
      "id": 28793599,
      "score": 1,
      "time": 1633649956,
      "title": "Tesla is moving its headquarters to Texas",
      "type": "story",
      "url": "https://www.protocol.com/elon-musk-says-tesla-moving-headquarters-to-texas"
    },
    {
      "by": "jiungerich",
      "descendants": 0,
      "id": 28793556,
      "score": 1,
      "time": 1633649715,
      "title": "Show HN: AR Digital Note making app just released",
      "type": "story",
      "url": "https://www.diverium.com/"
    },
    {
      "by": "gringoDan",
      "descendants": 0,
      "id": 28793541,
      "score": 1,
      "time": 1633649608,
      "title": "Getting a Crypto Job",
      "type": "story",
      "url": "https://paranoidenough.com/2021/10/06/Getting-a-Crypto-Job.html"
    },
    {
      "by": "enesakar",
      "descendants": 0,
      "id": 28793533,
      "score": 1,
      "time": 1633649569,
      "title": "Multi Region Serverless Redis",
      "type": "story",
      "url": "https://docs.upstash.com/features/globaldatabase"
    },
    {
      "by": "stanislavb",
      "descendants": 0,
      "id": 28793526,
      "score": 1,
      "time": 1633649535,
      "title": "Natural Killer Cells Coordinate Wound Healing",
      "type": "story",
      "url": "https://www.media.uzh.ch/en/Press-Releases/2021/Wound-Healing.html"
    }
  ]
}