{
  "stories": [
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31118132,
      "score": 1,
      "text": "First off, I&#x27;m no hacker, in any sense of the word. I work a warehouse job at a university bookstore and pack boxes all day. And I literally can&#x27;t code anything, period. At home, my &quot;tech set up&quot; is a $250 Chromebook, a $30 Bluetooth speaker, and an old budget Android phone. But maybe we can look past the tech stuff.<p>Perhaps more relevant (and more problematic), is that I can&#x27;t actually keep up with most of the discussions on here. 99% of the links on HN, I have no idea what it&#x27;s talking about. And of the comments posted, I can maybe make sense of only a fraction, and I certainly don&#x27;t understand enough to participate in any meaningful way.<p>Heck, I don&#x27;t even browse the web anymore. Which means I have no links to submit, either.<p>So what am I left with? Asking a s*<i>-ton of generic Ask-HNs. </i>One to two a day* for the past month, in fact.<p>So, <i>why am I here</i>?<p>Because in real life, I&#x27;m surrounded by people who are boring and uncritical. And even if the individuals themselves are not, the social norm certainly is (in my world, at least).<p>It&#x27;s easy to go along to get along with everyone: I can be one of the <i>friendliest</i> people! While having <i>no friends</i>.<p>I&#x27;m admittedly not a &quot;naturally smart&#x2F;intelligent&quot; person (trust me on this one), but I <i>am</i> a very curious soul, and I love to learn, love to think.<p>But the more I embrace my intellectual self, the more <i>disconnected</i> I feel from the rest of the world. The more my mind grows, the more it <i>dies</i> from loneliness.<p>So why am I here, posting all these Ask HNs? Obviously, to surround myself with like-minds (or more accurately, smarter minds), to fill the void that was becoming increasingly unbearable.<p>And I&#x27;m <i>so glad</i> I&#x27;m here. I&#x27;ve never felt this happy, this <i>alive</i>. To be seen, to be taken seriously. But in the back of my mind, I know I&#x27;m overly excited, maybe even <i>obsessed</i>. All the while realizing that I&#x27;m most likely making a fool out of myself, my naive, childish, attention-seeking self.<p>Do I belong here? Am I welcomed here? Maybe I can ask <i>that</i> on Ask HN? And what, die of embarrassment? Or, more likely, I&#x27;ll get a bunch of pity points and sympathy reassurance. But how will I know what you all <i>really</i> think?<p>...<p>I think it&#x27;s time for a break. Most likely won&#x27;t be posting any more Ask HNs for a while. But I&#x27;ll probably still poke around and lurk a bit. And I&#x27;m definitely still open to emails and hanging out on Discord. Feel free to reach out as usual.<p>Thank you all so so much for having me. Thank you for all your advice and wisdom. Thank you for being honest and constructive. Thank you for the generosity and support. It&#x27;s been a blast. :))<p>Much love,\nSam",
      "time": 1650600904,
      "title": "Tell HN: I'm an Imposter",
      "type": "story"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31118108,
      "score": 1,
      "time": 1650600668,
      "title": "Wall Street analysts fret over Tesla margins",
      "type": "story",
      "url": "https://fa.news/articles/wall_street_analysts_fret_over_tesla_margins-171615/"
    },
    {
      "by": "nickswalker",
      "descendants": 0,
      "id": 31118098,
      "score": 1,
      "time": 1650600553,
      "title": "Ghost",
      "type": "story",
      "url": "https://github.com/ghost"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31118088,
      "score": 1,
      "time": 1650600430,
      "title": "There are 8 classes of intelligence. Which are you?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ylyDYKizNJM"
    },
    {
      "by": "shortleash",
      "descendants": 0,
      "id": 31118081,
      "score": 2,
      "time": 1650600349,
      "title": "The Unfathomable Heart – On “Nukey Poo”",
      "type": "story",
      "url": "https://dark-mountain.net/the-unfathomable-heart/"
    },
    {
      "by": "bnbond",
      "descendants": 0,
      "id": 31118065,
      "score": 1,
      "time": 1650600215,
      "title": "The Internet Is Made of Demons",
      "type": "story",
      "url": "https://damagemag.com/2022/04/21/the-internet-is-made-of-demons/"
    },
    {
      "by": "tawrahim",
      "descendants": 0,
      "id": 31118055,
      "score": 1,
      "text": "Hi there,<p>I built an app to make it easy to add all your payment profile in one page. Here is a sample <a href=\"https:&#x2F;&#x2F;paylinkz.app&#x2F;tawheed\" rel=\"nofollow\">https:&#x2F;&#x2F;paylinkz.app&#x2F;tawheed</a><p>One of the biggest challenge I run into all the time as a freelancer is that people are always asking me &quot;How do you want to be paid?&quot;<p>I detailed my motivations behind this here <a href=\"https:&#x2F;&#x2F;paylinkz.app&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;paylinkz.app&#x2F;about</a>",
      "time": 1650600105,
      "title": "Show HN: I made an app for all your payment links",
      "type": "story",
      "url": "https://paylinkz.app/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31118016,
      "score": 3,
      "time": 1650599690,
      "title": "How Did Life Spring Up from Non-Life? Scientists May Finally Have Some Clues",
      "type": "story",
      "url": "https://www.popularmechanics.com/science/a39762892/how-did-life-spring-up-from-non-life/"
    },
    {
      "by": "b0b_d0e",
      "descendants": 1,
      "id": 31117996,
      "kids": [
        31118042
      ],
      "score": 2,
      "time": 1650599515,
      "title": "Disrupting the $7B Stripclub Industry",
      "type": "story",
      "url": "https://goddessguild.xyz/"
    },
    {
      "by": "doppp",
      "descendants": 0,
      "id": 31117990,
      "score": 1,
      "time": 1650599475,
      "title": "China's Xiaohongshu kicks off staff layoffs: Source",
      "type": "story",
      "url": "https://www.channelnewsasia.com/business/chia-xiaohongshu-staff-layoffs-2638326"
    }
  ]
}