{
  "stories": [
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 30848912,
      "score": 1,
      "time": 1648591104,
      "title": "Sailfish OS 4.4 “Vanha Rauma” Released",
      "type": "story",
      "url": "https://blog.jolla.com/vanharauma/"
    },
    {
      "by": "empressplay",
      "descendants": 0,
      "id": 30848895,
      "score": 1,
      "time": 1648591024,
      "title": "Logo Game Design Introduction: Downhill Skiing",
      "type": "story",
      "url": "https://turtlespaces.org/2022/03/29/logo-game-design-introduction-downhill-skiing/"
    },
    {
      "by": "pedrodelfino",
      "descendants": 0,
      "id": 30848886,
      "score": 1,
      "time": 1648590980,
      "title": "Ask HN: What are some good books on how to stop comparing yourself to others?",
      "type": "story"
    },
    {
      "by": "kaycebasques",
      "descendants": 0,
      "id": 30848882,
      "score": 1,
      "time": 1648590932,
      "title": "100 Cool Web Moments",
      "type": "story",
      "url": "https://developer.chrome.com/100/"
    },
    {
      "by": "auslegung",
      "descendants": 0,
      "id": 30848876,
      "score": 1,
      "time": 1648590888,
      "title": "Haskell Foundation: New Executive Director",
      "type": "story",
      "url": "https://discourse.haskell.org/t/new-executive-director-for-the-haskell-foundation/4290"
    },
    {
      "by": "geephroh",
      "descendants": 0,
      "id": 30848845,
      "score": 2,
      "time": 1648590661,
      "title": "Computer History Museum: Rescuing the Compuserve Collection",
      "type": "story",
      "url": "https://computerhistory.org/blog/mission-impossible-chm-edition/"
    },
    {
      "by": "stanislavb",
      "descendants": 0,
      "id": 30848843,
      "score": 1,
      "text": "I just noticed that Upwork has put a &quot;trade mark&quot; symbol next to the term &quot;Project Catalog&quot; (on their homepage and email communications).<p>Does anyone know what that means? That they are in the process of registering that generic term as a trademark that only they can use? That&#x27;d be a bit odd...",
      "time": 1648590627,
      "title": "Ask HN: What does a trademark of “Project Catalog” means?",
      "type": "story"
    },
    {
      "by": "crazypython",
      "descendants": 0,
      "id": 30848837,
      "score": 1,
      "time": 1648590597,
      "title": "Gigascaling: scaling blockchains to support the world’s financial transactions",
      "type": "story",
      "url": "http://www.gigascaling.net/"
    },
    {
      "by": "hnthrowaway3",
      "descendants": 0,
      "id": 30848823,
      "score": 2,
      "text": "So I have a Google Workspace account for my business and I wanted to migrate all email&#x2F;data of an employee who left the business. Previously, as a GSuite user, all it took was a couple of clicks to achieve this. Now, I have to do the following.<p>1. Login to admin console<p>2. Select the user and reset their password. You cannot use the &quot;Automatically generate a password&quot;. This becomes important later. You instead have to specify a password which meets some security criteria<p>3. In the Security section for the user, Disable &quot;Login challenge&quot;. You now have 10 minutes to get all the next few steps done<p>4. If you have 2FA enforced in your org, download backup codes for the user<p>5. Go to home page of Admin Console, click on &quot;Data migration&quot;<p>6. Select Gmail as source<p>7. Manually type in the email address of the user you want to migrate email for.<p>8. Click on &quot;Authorize&quot;<p>9. You will be taken to a login screen where you enter the user name (again) and password which you specified in step (2)<p>10. You will be prompted with a 2FA challenge. Click on &quot;Try another way&quot; and enter a backup code you downloaded in step (4)<p>11. If you made the mistake of choosing the &quot;Automatically generate a password&quot; option in step (2), it will prompt you to choose a new password for this user. Type a new password, type it again<p>12. It takes you back to the same screen as in step (7) with the status showing &quot;Authorized&quot;.<p>13. You now enter a destination mailbox for the user.<p>14. Click on &quot;Start&quot; and wait.<p>It took me a good hour with a number of missteps, head scratching, reading docs, contacting support, chatting with them to arrive at the above sequence of steps.<p>After the above finishes, you then have to separate migrate the users docs&#x2F;drive etc. separately.<p>WHO IN GOOGLE THOUGHT THIS WAS A GOOD USER EXPERIENCE??!!",
      "time": 1648590534,
      "title": "Tell HN: Deleting a user account from Google Workspace is a nightmare",
      "type": "story"
    },
    {
      "by": "cjg",
      "descendants": 0,
      "id": 30848819,
      "score": 1,
      "time": 1648590515,
      "title": "Tainted Bitcoin Isn’t What You Think It Is",
      "type": "story",
      "url": "https://cipherblade.com/blog/tainted-bitcoin-isnt-what-you-think-it-is/"
    }
  ]
}