{
  "stories": [
    {
      "by": "open-source-ux",
      "descendants": 0,
      "id": 31008647,
      "score": 2,
      "time": 1649800160,
      "title": "Where did all the women in tech go? [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=oNdc5ZCuhjQ"
    },
    {
      "by": "nocpu",
      "descendants": 0,
      "id": 31008589,
      "score": 1,
      "time": 1649799814,
      "title": "The Great Resignation and Why I Stayed",
      "type": "story",
      "url": "https://sionwilliams.com/posts/2022-04-12-the-great-resignation/"
    },
    {
      "by": "jtsymonds",
      "descendants": 1,
      "id": 31008587,
      "kids": [
        31008621
      ],
      "score": 1,
      "time": 1649799798,
      "title": "Solving the cloud talent crisis through intelligent software selection",
      "type": "story",
      "url": "https://blog.min.io/addressing-the-talent-crisis-in-the-cloud/"
    },
    {
      "by": "open-source-ux",
      "descendants": 0,
      "id": 31008569,
      "score": 1,
      "time": 1649799709,
      "title": "Founder of lastminute.com shares her top life and work tips [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=dk2VEi10yWg"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 31008550,
      "score": 1,
      "time": 1649799600,
      "title": "First-class TypeScript support in modular AWS SDK for JavaScript",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/developer/first-class-typescript-support-in-modular-aws-sdk-for-javascript/"
    },
    {
      "by": "wunderlust",
      "descendants": 0,
      "id": 31008532,
      "score": 1,
      "time": 1649799524,
      "title": "A $925M advance market commitment to accelerate carbon removal",
      "type": "story",
      "url": "https://twitter.com/paulg/status/1513886186795905026"
    },
    {
      "by": "el_benhameen",
      "descendants": 0,
      "id": 31008496,
      "score": 2,
      "text": "I manage most of my family&#x27;s finances, insurance, bills, etc. There&#x27;s nothing wild, but there are a lot of different accounts in different places. I would like to keep all of this information somewhere that would be easily accessible to my wife if I get hit by a bus, but that is secure enough that I don&#x27;t have to worry about someone else making off with our life savings. What solutions have you all used for this sort of thing?",
      "time": 1649799308,
      "title": "Ask HN: Where do you store important information for your next of kin?",
      "type": "story"
    },
    {
      "by": "MakisH",
      "descendants": 0,
      "id": 31008488,
      "score": 2,
      "time": 1649799228,
      "title": "Indico (by CERN): The effortless open-source tool for event organisation",
      "type": "story",
      "url": "https://getindico.io/"
    },
    {
      "by": "xnx",
      "descendants": 0,
      "id": 31008483,
      "score": 1,
      "text": "Waymo regularly releases technical information about their systems on their blog (e.g. https:&#x2F;&#x2F;ai.googleblog.com&#x2F;2022&#x2F;04&#x2F;lidar-camera-deep-fusion-for-multi.html). Does Tesla do anything similar for technologies it has developed?",
      "time": 1649799210,
      "title": "Ask HN: Where are Tesla's technical papers / blog posts?",
      "type": "story"
    },
    {
      "by": "almostright",
      "descendants": 0,
      "id": 31008477,
      "score": 1,
      "text": "I’m a team lead but the job feels more like senior developer with some management responsibilities. In my previous job I had the same role but with much less hands on work and had the opportunity to lead multiple teams. I prefer that so I started looking for engineering management jobs.\nHere are some stats: ~30 applications out of ~100 reviewed job postings. Got 7 interviews out of which I didn’t pass the first or second interview step in 4. In the remaining 3 I didn’t pass the last interview with the hiring director or VP. These 3 interview processes took me a lot of time and energy. On average I had 6 interviews in each of them.<p>I’m not happy at my current job but I really try to be positive and productive as much as I can. The interviews are taking significant portion of my time and that affects my performance. At my current job I’m in the middle of very complex project which causes me a lot of stress. I joined this company with no previous experience in their tech stack. Somehow that didn’t matter for them and me. I thought this would be similar job to the previous one where I didn’t do much IC work. It isn’t and I think I made a mistake. Actually I took this job because I didn’t get another manager job I was interviewing for at the same time and the salary was much better than the one I had.<p>I don’t think I can leave my job right now to have more time for the job search. The financial risk will just increase my stress and it will negatively affect my interviews.<p>For the interviews I think I do everything I should (obviously not) by learning about the companies and their products, answering to questions with real examples from my experience (combined with how you are supposed to answer leadership&#x2F;management questions), and being generally positive and enthusiastic about the jobs. I don’t get feedback from the companies even when I ask. Which I guess is expected due to possible legal risk or they just don’t bother.<p>The reason I’m looking for manager instead of team lead roles is that I don’t think I’m good with combining management and IC responsibilities. I feel way more confident when focusing only on one of them. I could go back to IC only role (I still get the thrill of solving problems with code) but I strongly prefer management responsibilities at this point. I understand that in a lot of companies managers are expected to be hands on but there are some that this is not the case and I got rejected at those.<p>So I really don’t know for how long I can keep doing this. It has been 4 months since I started looking for a new job and the current one is just getting more stressful due to mainly how I respond to the whole situation I’m in.<p>Does anyone with similar experiences have some ideas about how I can help myself?",
      "time": 1649799161,
      "title": "Ask HN: I'm feeling stuck, how do I get out of it?",
      "type": "story"
    }
  ]
}