{
  "stories": [
    {
      "by": "jamesfricker",
      "descendants": 0,
      "id": 31475766,
      "score": 1,
      "time": 1653285837,
      "title": "Graduate Theory",
      "type": "story",
      "url": "https://www.graduatetheory.com/"
    },
    {
      "by": "ayende",
      "descendants": 0,
      "id": 31475765,
      "score": 1,
      "time": 1653285825,
      "title": "Modern programming languages require generics",
      "type": "story",
      "url": "https://ayende.com/blog/197282-B/modern-programming-languages-require-generics?key=37e0cfa91b16417bae269c4bdd17f522"
    },
    {
      "by": "sharmavinu0024",
      "descendants": 0,
      "id": 31475750,
      "score": 1,
      "time": 1653285627,
      "title": "Top Zmovies Alternatives Every One of You Must Try",
      "type": "story",
      "url": "https://www.activenoon.com/top-5-zmovies-alternatives/658/"
    },
    {
      "by": "DandyDev",
      "descendants": 0,
      "id": 31475748,
      "score": 1,
      "time": 1653285596,
      "title": "Statement on Removal of Mercedes Lackey from the Nebula Conference",
      "type": "story",
      "url": "https://www.sfwa.org/2022/05/22/statement-removal-mercedes-lackey-nebula-conference/"
    },
    {
      "by": "reportaman",
      "descendants": 0,
      "id": 31475739,
      "score": 1,
      "text": "arttime brings curated text-art to otherwise artless terminal emulators of starving developers (and other users who can use terminal emulators). While doing so, it blends display of art (a not-so-techie thing) with functionality of a nifty clock&#x2F;timer which is a retake on the stereotypical alarms&#x2F;timers. With one line of title message under the art, it also provides one line of opportunity for developers to display their activism (a not-so-techie thing either) or just attach a functional message for themselves for usual developer activity on terminal (like &quot;debug the failing build tonight&quot;).",
      "time": 1653285484,
      "title": "Show HN: Arttime – CLI art meets functionality",
      "type": "story",
      "url": "https://github.com/reportaman/arttime"
    },
    {
      "by": "kyoung3412",
      "descendants": 0,
      "id": 31475728,
      "score": 1,
      "text": "How to find exposed HFS HTTP File Server with analysis report on malicious code site on a chinese HFS HTTP Filer Servers.",
      "time": 1653285385,
      "title": "Show HN: Search Query, How to Find Exposed HFS HTTP File Server",
      "type": "story",
      "url": "https://blog.criminalip.io/2022/05/18/criminal-ip%eb%a1%9c-%ed%99%95%ec%9d%b8%ed%95%9c-%ec%a4%91%ea%b5%ad-http-file-server%ec%97%90-%ec%9d%80%eb%8b%89%eb%90%98%ec%96%b4-%ec%9e%88%eb%8a%94-%eb%94%b0%eb%81%88%ed%95%9c-%ec%95%85%ec%84%b1/"
    },
    {
      "by": "sharmavinu0024",
      "descendants": 0,
      "id": 31475695,
      "score": 1,
      "time": 1653285012,
      "title": "What Is the Overall Worth of Travis Scott? Everything to Be Known",
      "type": "story",
      "url": "https://www.activenoon.com/overall-worth-of-travis-scott/2631/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31475689,
      "score": 1,
      "time": 1653284880,
      "title": "World stumbling into a new era of risk, concludes SIPRI report",
      "type": "story",
      "url": "https://www.sipri.org/media/press-release/2022/world-stumbling-new-era-risk-concludes-sipri-report"
    },
    {
      "by": "tapanjk",
      "descendants": 0,
      "id": 31475681,
      "score": 1,
      "text": "Allow me to first set the context. The question is at the end.<p>On your first day on a new job, you receive a bouquet of goodies. Some of these are essential for you to perform your job (laptop, headphones, mouse, etc.) and the rest are &quot;feel good&quot; things (water bottle, t-shirt, a notebook, a pen, etc. with the company logo on them). I guess the idea is to make your first day memorable, and perhaps down the road, even remind you of this day. I often use a sweatshirt I received from my then employer some 8 years ago, and it still makes me smile to think of my days at that company.<p>Some companies give books to their prospective new employees (the famous book bomb at Amazon) to help them learn or brush up on a few skills they will need on the job. Employers who do this convey that they care about their people&#x27;s intellectual growth. What follows is a list of three books that I think would be a good addition to your welcome kit for the new Software Development Managers joining your team.<p>First is [The Manager&#x27;s Path][1], which can be a career guide for software developers who have chosen the path of management. The best thing about this book is that it is valuable no matter how far ahead you are on this path. Encouraging your new employees to start thinking in terms of their career ladder and growth path can be a strong motivator.<p>Second on this list is [Working Backwards: Insights, Stories, and Secrets from Inside Amazon][2]. This book distills the knowledge of ways of working that make Amazon successful. Applying even a few of these methods to your work, even if it is only at a personal level, will produce better outcomes for you.<p>The third is [Zero to One: Notes on Startups, or How to Build the Future][3]. The best part of this book is that it encourages business owners to solve problems by applying thinking that starts with first principles. It also teaches you to ask the questions that lead you to find value in unexpected places.<p>Question: What would you change or add to this list of books for new Software Development Managers joining your company&#x2F;team? Why?<p>[1]: https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;33369254-the-manager-s-path<p>[2]: https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;53138083-working-backwards<p>[3]: https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;18050143-zero-to-one",
      "time": 1653284799,
      "title": "Ask HN: Book bomb for a Software Development Manager joining your company",
      "type": "story"
    },
    {
      "by": "mji",
      "descendants": 0,
      "id": 31475680,
      "score": 5,
      "time": 1653284797,
      "title": "My experience as a Unit-18 Berkeley Lecturer",
      "type": "story",
      "url": "http://blog.pamelafox.org/2022/05/my-experience-as-unit-18-berkeley.html"
    }
  ]
}