{
  "stories": [
    {
      "by": "0bfus",
      "descendants": 0,
      "id": 28623684,
      "score": 1,
      "text": "aContext: I was in Paris staying in a month plus long Airbnb when our airbnb house key was stolen from us. We ended up staying in hotels for two days without our essentials (medicines, clothes, passports, etc), during which our host basically offered no alternatives -- he told us plainly he was on vacation and wouldn&#x27;t return to help us for two weeks (had an extra key in Paris). After spending two days trying to figure out solutions which were repeatedly shot down by the host, we ended up deciding we had to get a locksmith to cut the lock so we could get in, we couldn&#x27;t spend any more time without our essentials. Cutting the lock ended up being about $250 and re-keying the locks ended up being another $750. The airbnb was still unusable (we needed a security fob to get into the building each time, regardless of the unit keys), so we ended up booking another Airbnb and starting a claim with airbnb.<p>Throughout the entire process Airbnb, basically has kept repeating that the host committed no violations so they can&#x27;t help us. I don&#x27;t fault the airbnb host for the stolen key, but I do find it fairly unreasonable for us to pay the full cost of this, when the larger problem exposed was the host has no backup plan.<p>Has anyone dealt with a situation with like this? Am I out of luck because we bothered to help rekey the hosts unit and we should have simply left it unsecured after we got in? Do I have other avenues I should consider outside of Airbnb and the host to get some assistance?<p>Pretty at a loss for what I&#x27;m supposed to do, I just keep getting passed from team to team on the Airbnb support side hearing the same things. Is this just a known risk with Airbnb that you&#x27;re completely on your own if things go wrong and I was just too naive to count on anyone to help?",
      "time": 1632355581,
      "title": "Ask HN: Has anyone had any luck dealing with Airbnb when things go wrong?",
      "type": "story"
    },
    {
      "by": "blacksqr",
      "descendants": 0,
      "id": 28623681,
      "score": 1,
      "time": 1632355568,
      "title": "Super premium treasuries to solve debt limit (2013)",
      "type": "story",
      "url": "https://www.businessinsider.com/treasury-could-issue-super-premium-bonds-2013-10"
    },
    {
      "by": "Shadeoffen",
      "descendants": 0,
      "id": 28623638,
      "score": 1,
      "text": "People are unlikely to have long-term success selling to Americans over the Internet if customers have to wait some indefinite number of weeks for items to cross the ocean. Dropshipping, as described in the linked article, is bullshit. A couple of years ago, most of the products sold on their sites were shipped directly. However, they were starting to set up warehouses to hold inventory. I used to do e-commerce for dropshippers who sold furniture, lighting, chair bags where the companies were run from one or two-room offices. The products were delivered from other companies&#x27; warehouses in the US or Canada. And if you need to track your package, I suggest https:&#x2F;&#x2F;www.packages24.com&#x2F;carriers&#x2F;cnexps-tracking. I used it a lot when I ordered things.",
      "time": 1632355278,
      "title": "Well",
      "type": "story"
    },
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 28623593,
      "score": 1,
      "time": 1632355010,
      "title": "Stick Page – Best Online Stick Figure Movies and Stick Games",
      "type": "story",
      "url": "http://www.stickpage.com/"
    },
    {
      "by": "prideout",
      "descendants": 0,
      "id": 28623588,
      "score": 1,
      "time": 1632355002,
      "title": "Hot loading C++ game code",
      "type": "story",
      "url": "https://prideout.net/blog/cpp_script/"
    },
    {
      "by": "droptablemain",
      "descendants": 0,
      "id": 28623583,
      "score": 3,
      "time": 1632354941,
      "title": "Dating the First Case of Covid-19 Epidemic from a Probabilistic Perspective",
      "type": "story",
      "url": "http://chinaxiv.org/abs/202109.00058"
    },
    {
      "by": "B1FF_PSUVM",
      "descendants": 0,
      "id": 28623534,
      "score": 1,
      "time": 1632354603,
      "title": "When Cecil Rhodes raided the Transvaal in 1895",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Jameson_Raid"
    },
    {
      "by": "ls65536",
      "descendants": 0,
      "id": 28623523,
      "score": 1,
      "time": 1632354560,
      "title": "Challenges to Making Sense of the 21st Century",
      "type": "story",
      "url": "https://consilienceproject.org/challenges-to-making-sense-of-the-21st-century/"
    },
    {
      "by": "genzer",
      "descendants": 0,
      "id": 28623520,
      "score": 1,
      "time": 1632354557,
      "title": "Generate Curl Command from Headers",
      "type": "story",
      "url": "https://github.com/curl/h2c"
    },
    {
      "by": "psychanarch",
      "descendants": 0,
      "id": 28623507,
      "score": 1,
      "time": 1632354425,
      "title": "Apple Denies Request by Epic to Bring ‘Fortnite’ Developer Account Back",
      "type": "story",
      "url": "https://www.wsj.com/articles/epic-games-says-apple-won-t-reinstate-developer-account-11632331517"
    }
  ]
}