{
  "stories": [
    {
      "by": "reaperducer",
      "descendants": 0,
      "id": 32083908,
      "score": 1,
      "text": "HN seems to be a mix of people who love deals, but also hate Amazon, I wonder if any HN&#x27;ers bought anything during this year&#x27;s Prime Day, and what they got.<p>I looked around and didn&#x27;t see anything I needed, but I also noticed that some of the brick-and-mortar stores around me were also running sales promoted to coincide with Prime Day, so I scored a bundt cake at a local bakery for half off.",
      "time": 1657725597,
      "title": "Ask HN: Did you buy anything during Prime Day?",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32083903,
      "score": 1,
      "time": 1657725581,
      "title": "Amazon squashes years-old authentication bugs in AWS Kubernetes service",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/12/authentication_bug_aws_kubernetes/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32083889,
      "score": 1,
      "time": 1657725517,
      "title": "Who are the hackers who say they started a fire in Iran?",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-62072480"
    },
    {
      "by": "hydrogen7800",
      "descendants": 0,
      "id": 32083883,
      "score": 1,
      "time": 1657725487,
      "title": "Jemba Inertia Notes System- Automatically generates rally course notes",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Jemba_Inertia_Notes_System"
    },
    {
      "by": "gok",
      "descendants": 0,
      "id": 32083872,
      "score": 1,
      "time": 1657725445,
      "title": "Gates Foundation Announces Aim to Increase Annual Payout by 50%",
      "type": "story",
      "url": "https://www.gatesfoundation.org/ideas/articles/gates-foundation-aims-payout-increase-us-9-billion-help-meet-global-needs"
    },
    {
      "by": "indekkel",
      "descendants": 0,
      "id": 32083853,
      "score": 1,
      "text": "My current co-worker and I would like to create a startup together. We are currently exploring strategies to fund the startup, and would love to get some advice.<p>We are currently thinking we could start a business, offer consulting&#x2F;contracting services, take reduced salaries (compared to what we currently make), and keep all the remaining money in a business account to give us runway for the startup. We would use the accumulated business money to pay reduced salaries and handle expenses when we transition fully to the startup.<p>We both have domain expertise that would allow us to land customers (for contracting&#x2F;consulting) for 1-2 years to bankroll the business account. The issue is our domain expertise is in a field that we both want to get out of, and hence the desire to create a startup.<p>In an ideal world, we would both quit our current job now, and start working on the startup tech. However, it does seem less risky to build up some savings first, and then work the startup.<p>Has anyone done something similar? Does this even seem like a good idea?<p>From poking around a bit, it looks like an S-Corp might be a good structure for this approach - any thoughts on that? We will certainly meet with a lawyer and CPA as needed to iron out details, but I do like the idea of reading about the basics before meeting with them.<p>Any comments are appreciated!",
      "time": 1657725364,
      "title": "Ask HN: What are some good strategies to self-fund a startup?",
      "type": "story"
    },
    {
      "by": "gaudat",
      "descendants": 0,
      "id": 32083846,
      "score": 1,
      "time": 1657725346,
      "title": "Installing Proxmox VE on WSL2",
      "type": "story",
      "url": "https://github.com/gaudat/gauup/blob/master/homelab/pve-wsl2.md"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32083831,
      "score": 1,
      "time": 1657725275,
      "title": "One way past Moore's Law: Chips that mix photonics and electronics",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/13/one_way_past_moores_law/"
    },
    {
      "by": "rohitrajan",
      "descendants": 0,
      "id": 32083827,
      "score": 1,
      "text": "Anyone know of any public Jira things rich with projects&#x2F;epics&#x2F;users&#x2F;issues&#x2F;etc?",
      "time": 1657725257,
      "title": "Ask HN: Public Jira Boards",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32083817,
      "score": 1,
      "time": 1657725235,
      "title": "BMW puts heated seats, other features behind paywall",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/12/bmw_locks_korean_car_owners/"
    }
  ]
}