{
  "stories": [
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31029739,
      "score": 1,
      "time": 1649955700,
      "title": "Can the BBC Survive the British Government?",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2022/04/18/can-the-bbc-survive-the-british-government"
    },
    {
      "by": "ironyman",
      "descendants": 0,
      "id": 31029710,
      "score": 1,
      "time": 1649955623,
      "title": "US Officials Tie North Korean Hacker Group to Axie's Ronin Exploit",
      "type": "story",
      "url": "https://www.coindesk.com/policy/2022/04/14/us-officials-tie-north-korean-hacker-group-to-axies-ronin-exploit/"
    },
    {
      "by": "miikavonbell",
      "descendants": 0,
      "id": 31029698,
      "score": 1,
      "text": "I&#x27;m currently coming off of a project where I barely knew my coworkers after having worked with them for more than two years.<p>Before this project, I used to work with coworkers who I learned to know a lot better.<p>I don&#x27;t know how much of this is because of the pandemic and how much of it is because of other cultural aspects of the project.<p>How well do others know their coworkers on a personal level? Do you feel like you should or shouldn&#x27;t share aspects from private life with your coworkers or not?",
      "time": 1649955555,
      "title": "Ask HN: How well do you know your colleagues?",
      "type": "story"
    },
    {
      "by": "data_spy",
      "descendants": 0,
      "id": 31029696,
      "score": 1,
      "time": 1649955551,
      "title": "BetFair: An Introduction to Tennis Modelling",
      "type": "story",
      "url": "https://www.betfair.com.au/hub/an-introduction-to-tennis-modelling/"
    },
    {
      "by": "alephao",
      "descendants": 0,
      "id": 31029673,
      "score": 1,
      "time": 1649955453,
      "title": "ERC-721 Gas Usage Benchmarks",
      "type": "story",
      "url": "https://github.com/alephao/erc721-benchmarks"
    },
    {
      "by": "neelc",
      "descendants": 0,
      "id": 31029655,
      "score": 1,
      "time": 1649955410,
      "title": "How to Get on the Front Page of Hacker News",
      "type": "story",
      "url": "https://www.neelc.org/posts/front-page-hacker-news/"
    },
    {
      "by": "Zaheer",
      "descendants": 0,
      "id": 31029632,
      "score": 1,
      "time": 1649955317,
      "title": "Weekly newsletter guide to exploring outdoors in California",
      "type": "story",
      "url": "https://www.weekendsherpa.com/"
    },
    {
      "by": "35mm",
      "descendants": 0,
      "id": 31029573,
      "score": 1,
      "text": "You can create a voice command using the built in Shortcuts app, which will run an arbitrary SSH script on a remote server.<p>Key based auth is supported.<p>Just discovered this today and thought I’d share.",
      "time": 1649955080,
      "title": "Tell HN: iOS has built in Siri voice commands to run any SSH script",
      "type": "story"
    },
    {
      "by": "JobReplacing",
      "descendants": 0,
      "id": 31029536,
      "score": 2,
      "text": "Long story short, I&#x27;ve had a pretty lucrative ($XXX,XXX) contracting gig for a few years, I built a great relationship and basically did work nobody else in the entire company could do. There&#x27;s now new directors, SVPs, etc. who basically know nothing about this business but are implementing generic BS like Agile and OKRs that are nothing more than busy work.<p>One of the two people who hired me recently left, and the other basically ignored my message when I asked who I should submit my timesheets to. I&#x27;ve been coasting (I&#x27;ve always stood out as an above average engineer because of my creativity and past business experience) for a while with great pay, but I think the gravy train is ending.<p>I&#x27;m not happy with my role and while I&#x27;m still being paid and nobody bothers me, I feel like I have no purpose in the overall new direction things are going and I find the new people incompetent as well. They&#x27;re generic engineers who want to build cool technology instead of solving the actual business problems I&#x27;ve seen working 1-1 with so many people across the org top to bottom.<p>I don&#x27;t plan to leave until they fire me, because I barely do any work and get paid but at the same time I feel slighted by the person who I&#x27;ve worked for for not responding, and I suffered an injury because of this work too (I burned days nonstop trying to build something at one point and injured myself, may need surgery).<p>I don&#x27;t really feel like getting a new job because I&#x27;d have to work for more than 10 hours a week, but I also don&#x27;t like hopping onto Slack and only having 2 - 3 people message me over a week or two, and I don&#x27;t really have ownership over anything besides a small project with lots of delays and back and forth with nothing to do in between.<p>Feel kind of lost and like there&#x27;s no future. So I ask HN, if anyone else has been here before, what should I do?",
      "time": 1649954922,
      "title": "Ask HN: Fortune 500 company with a whole new team of executives, time to leave?",
      "type": "story"
    },
    {
      "by": "danso",
      "descendants": 1,
      "id": 31029504,
      "kids": [
        31029621
      ],
      "score": 2,
      "time": 1649954808,
      "title": "Ethereum Has Issues",
      "type": "story",
      "url": "https://blog.dshr.org/2022/04/ethereum-has-issues.html"
    }
  ]
}