{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29954754,
      "score": 1,
      "time": 1642327949,
      "title": "How Tumblr Became Popular for Being Obsolete",
      "type": "story",
      "url": "https://www.newyorker.com/culture/infinite-scroll/how-tumblr-became-popular-for-being-obsolete"
    },
    {
      "by": "throwawayacc2",
      "descendants": 1,
      "id": 29954740,
      "kids": [
        29954769
      ],
      "score": 1,
      "text": "HN I need your help, I’ve been torn about getting the vaccine for months now and it feels like I can’t come to a conclusion on my own no matter how hard I try.<p>Here’s my list of pros and cons for the vaccine.<p>Pro vaxx<p>- I don’t want covid.<p>- Baring myocarditis the vaccine is probably ok, side effect wise included.<p>- I can’t travel that much without the vaccine.<p>- Both mrna and viral vector technologies have been studied for a long time so they’re probably safe.<p>- Medical standards are probably higher and better regulated than software engineering standards.<p>- It’s probably good practice to get vaccinated even if the benefits are small.<p>- A lot of people I know had the vaccine and are ok.<p>- A doctor I know advised me to get the vaccine.<p>- I read the covid and vaxx infographics, it broadly makes sense and checks out with a super quick wikipedia page.<p>- I don’t think a truly harmful vaccine would be rolled out so widely<p>Anti vaxx<p>- I’m relatively young, in good shape, healthy so I’m not super worried about covid.<p>- I might get myocarditis.<p>- I don’t want to participate in the green pass thing because it’s authoritarian in my opinion.<p>- Even with pre-researched technology this is the first live deployment of the tech.<p>- What if the doctors build stuff like programmers?!<p>- What if they do want to turn the vaccine in a subscription model?<p>- A lot of people I know didn’t have the vaccine and are ok.<p>- Dr Malone on Joe Rogan too advised against it.<p>- I saw &#x2F;pol&#x2F; screencaps of threads detailing how the vaccine messes up the body - broadly checks out too<p>- I genuinely don’t trust governments, big pharmacy, regulatory agencies, etc<p>I can’t decide on a side. You do it for me HN. What do I do, do I get the jab? Tell me what to think HN!",
      "time": 1642327810,
      "title": "Ask HN: Do I Get Jabbed?",
      "type": "story"
    },
    {
      "by": "JonathanBeuys",
      "descendants": 1,
      "id": 29954729,
      "kids": [
        29954762
      ],
      "score": 2,
      "time": 1642327587,
      "title": "Even in Web3, the Rule Is “Convenience Uber Alles”",
      "type": "story",
      "url": "https://twitter.com/JonathanBeuys/status/1482654364942704645"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29954705,
      "score": 1,
      "time": 1642327277,
      "title": "The writer who made me love comics taught me to hate them (2016)",
      "type": "story",
      "url": "https://www.polygon.com/2016/3/1/11139828/the-dark-knight-returns"
    },
    {
      "by": "boshomi",
      "descendants": 1,
      "id": 29954685,
      "kids": [
        29954694
      ],
      "score": 1,
      "time": 1642327041,
      "title": "An open-access database and analysis tool for perovskite solar cells",
      "type": "story",
      "url": "https://www.nature.com/articles/s41560-021-00941-3"
    },
    {
      "by": "dylancollins",
      "descendants": 0,
      "id": 29954634,
      "score": 1,
      "time": 1642326327,
      "title": "Climate-Change Arbitrage",
      "type": "story",
      "url": "https://dylancollins.com/2022/01/16/climate-change-arbitrage/"
    },
    {
      "by": "jakobdabo",
      "descendants": 0,
      "id": 29954626,
      "score": 2,
      "time": 1642326244,
      "title": "Varosha: The abandoned tourist resort (2014)",
      "type": "story",
      "url": "https://www.bbc.com/news/magazine-25496729"
    },
    {
      "by": "aliswe",
      "descendants": 2,
      "id": 29954608,
      "kids": [
        29954761,
        29954699
      ],
      "score": 2,
      "text": "Ok so I just got to the magical level of 500 karma points on HN, unlocking the legendary downvote button.<p>But I do not like it, and I will in fact boycott it, vowing to never use it. Why you ask?<p>UX wise, it&#x27;s too blunt and its purpose too vaguely defined. It resembles a &quot;dislike&quot; button.<p>Algorithm wise, it is too powerful, and seems like -4 points gives you a throttle (which actually means strangle) for a few hours.<p>Happened to me when I posted a smug (or?) remark on an OCaml post. Not gonna lie - going slightly out of line resulting in a hour-long &quot;shut up&quot; period felt very humiliating.<p>Everyone knows that a downvote is very powerful. Yet it&#x27;s obvious that people use it against dissenting opinion. &quot;I don&#x27;t know why you&#x27;re getting downvoted&quot;.<p>In a sense it becomes a kind of elitist power tool, earned by conforming to that silent but crushing pool of downvoters.<p>Speaking candidly, it therefor almost becomes like a social credit system, and deplatforms dissenting voices.<p>I&#x27;m not sure I can word it any better than this.<p>This is the problem. What is the solution?",
      "time": 1642325999,
      "title": "I'm boycotting the HN downvote button",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 2,
      "id": 29954607,
      "kids": [
        29954668
      ],
      "score": 21,
      "time": 1642325958,
      "title": "Why Galesburg has no money",
      "type": "story",
      "url": "https://inlandnobody.substack.com/p/why-galesburg-has-no-money"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 29954598,
      "score": 1,
      "time": 1642325902,
      "title": "When Did Maytag Go Bad?",
      "type": "story",
      "url": "https://www.automaticwasher.org/cgi-bin/TD/TD-VIEWTHREAD.cgi?10502"
    }
  ]
}