{
  "stories": [
    {
      "by": "vfclists",
      "descendants": 0,
      "id": 31440682,
      "score": 1,
      "text": "The title should be &quot;FairEmail developer &quot;rage quits&quot; because of unappreciative cheapskate  Android users&quot; but I have to reconsider for falling foul of HN moderators, and even then I don&#x27;t think this will last.<p>Many HN users interested in FairEmail would have seen these threads by now<p>https:&#x2F;&#x2F;forum.xda-developers.com&#x2F;t&#x2F;app-5-0-fairemail-fully-featured-open-source-privacy-oriented-email-app.3824168&#x2F;page-1087<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31432334<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31433051<p>and a few more related threads.<p>They all dwell at some length on Google&#x27;s tortuous, Byzantine, capricious, whimsical, Kakfaesque, Heath Robinsonian (running out of adjectives here - will come up with few more) (dis-)approval process, but Google is Google and will never stop being Google anymore than Apple will stop being Apple.<p>I think we need to face some facts here. With over 5 million+ downloads there are not enough people upgrading to the paid version or donating to him to make it worth his while. Saying that Google is the only culprit here isn&#x27;t entirely quite true, but this act on their part may be the straw that broke the camel&#x27;s back.<p>We have to acknowledge that a lot of users take free software developers for granted as a lot of software developers acknowledge. Even Google and a lot of major tech companies are guilty of this, taking advantage of a lot of software developed for free by part-timers and enthusiast without giving anything in return. OpenSSL anyone?<p>This discussion should turn into one about how free software developers can be compensated for the time and effort into their product, even if they are not in it for the money.<p>I am a user of FairEmail and I haven&#x27;t paid for it or donated to the developer and had I known that something like this was in the offing I may have donated to it or paid for the upgrade earlier. I could argue that the interface wasn&#x27;t exactly to my liking and was looking to see some changes but that doesn&#x27;t cut it. I benefit from it and the price of the upgrade is about the same of my mobile phone subscription which I don&#x27;t use much and even less than the price of takeaway meal at my local greasejoints.<p>Let us talk more about how we compensate developers for their efforts which we benefit from. I have some ideas about this, especially in relation to software that is automatically downloaded assuming they haven&#x27;t been mooted by others before, but going into that will make this post too long. That will be another post, hopefully sooner rather than later.",
      "time": 1652997509,
      "title": "FairEmail developer quits because of unappreciative cheapskate users",
      "type": "story"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31440681,
      "score": 1,
      "time": 1652997504,
      "title": "Several ways sci-fi imagines data storage",
      "type": "story",
      "url": "https://www.hpe.com/us/en/insights/articles/8-ways-sci-fi-imagines-data-storage-1903.html"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 31440663,
      "score": 1,
      "time": 1652997386,
      "title": "Atlas V Launches Starliner's Orbital Flight Test 2 (OFT-2)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_5KGePUTq_g"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31440644,
      "score": 1,
      "time": 1652997267,
      "title": "Terraform Back End: Role-Based Access Control – Part 1",
      "type": "story",
      "url": "https://www.bti360.com/terraform-backend-rbac-pt-1/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31440640,
      "score": 1,
      "time": 1652997246,
      "title": "Great Zimbabwe",
      "type": "story",
      "url": "https://www.nationalgeographic.org/encyclopedia/great-zimbabwe/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31440635,
      "score": 1,
      "time": 1652997228,
      "title": "Mali Empire",
      "type": "story",
      "url": "https://www.worldhistory.org/Mali_Empire/"
    },
    {
      "by": "PotatoPancakes",
      "descendants": 0,
      "id": 31440622,
      "score": 1,
      "time": 1652997116,
      "title": "Making Sense of VRChat, the “Metaverse” People Like [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=4PHT-zBxKQQ"
    },
    {
      "by": "ramoswriter",
      "descendants": 0,
      "id": 31440601,
      "score": 1,
      "time": 1652996977,
      "title": "Hiring 101: What to know before growing your team",
      "type": "story",
      "url": "https://ghost.org/resources/hiring-for-creators/"
    },
    {
      "by": "ignitionmonkey",
      "descendants": 0,
      "id": 31440593,
      "score": 1,
      "time": 1652996905,
      "title": "Routing in React Using Redux",
      "type": "story",
      "url": "https://jahed.dev/2022/05/16/routing-in-react/"
    },
    {
      "by": "kofejnik",
      "descendants": 0,
      "id": 31440580,
      "score": 2,
      "time": 1652996801,
      "title": "RIP Vangelis, legendary composer behind Blade Runner",
      "type": "story",
      "url": "https://www.avclub.com/rip-vangelis-blade-runner-chariots-of-fire-1848950743"
    }
  ]
}