{
  "stories": [
    null,
    null,
    {
      "by": "kitkat_new",
      "descendants": 0,
      "id": 29000032,
      "score": 1,
      "time": 1635254419,
      "title": "Climate scientists fear tipping points (maybe you should too)",
      "type": "story",
      "url": "https://phys.org/news/2021-10-climate-scientists.html"
    },
    {
      "by": "datashrimp",
      "descendants": 0,
      "id": 29000031,
      "score": 1,
      "time": 1635254405,
      "title": "Shaking the foundations:delusions in sequence models for interaction and control",
      "type": "story",
      "url": "https://arxiv.org/abs/2110.10819"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29000005,
      "score": 1,
      "time": 1635254238,
      "title": "Rindfleischetikettierungsüberwachungsaufgabenübertragungsgesetz",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Rinderkennzeichnungs-_und_Rindfleischetikettierungs%C3%BCberwachungsaufgaben%C3%BCbertragungsgesetz"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29000002,
      "score": 1,
      "time": 1635254231,
      "title": "Notes on AI Bias (2019)",
      "type": "story",
      "url": "https://www.ben-evans.com/benedictevans/2019/4/15/notes-on-ai-bias"
    },
    {
      "by": "gigglesupstairs",
      "descendants": 0,
      "id": 28999995,
      "score": 1,
      "time": 1635254202,
      "title": "Adobe’s Photoshop and Illustrator Coming to Web",
      "type": "story",
      "url": "https://blog.adobe.com/en/publish/2021/10/26/new-creative-cloud-releases-enable-creative-collaboration-drive-innovation-empower-creative-careers.html"
    },
    {
      "by": "logon",
      "descendants": 0,
      "id": 28999992,
      "score": 1,
      "text": "I am thinking of making a free tool to help businesses market via WhatsApp. In my country everyone uses WhatsApp which is why I believe it is a good channel that can no longer be used properly by businesses.<p>When I say marketing I mean more about customer relationships than about sending too many messages. From my company experience, potential customers who have not responded by phone or email are often answered via WhatsApp.",
      "time": 1635254194,
      "title": "I am using WhatsApp bulk marketing software",
      "type": "story"
    },
    {
      "by": "GautamAhuja",
      "descendants": 0,
      "id": 28999985,
      "score": 1,
      "text": "So yesterday I announced to launch of Microsponsor here on Hacker News.<p>And it&#x27;s been just 24 hours and I have got 3 signup and one creator actually submitted his newsletter to the marketplace!<p>How did I find my first users?<p>Finding the first real users can be very difficult, especially for a 19 year old like me with no network whatsoever. So, I decided to go with cold emails.<p>The good thing here is that my competitors have few good newsletters already submitted. So, I just contacted these writers either through the contact form on their website or through their publicly available email. And fortunately, one of them actually submitted his newsletter!<p>I know that cold emailing is not scalable, but in my opinion it can be a good way for acquiring your first few users.<p>Do you have any suggestions on how I can approach user acquisition? Let me know in the comments, I would love to hear from you<p>Shameless plug -<p>1. If you happen to be a newsletter writer, please consider submitting your amazing newsletter to Microsponsor<p>2. If you are a founder or brand looking to collaborate with creators, consider joining the waitlist (launching soon!). We take no commission<p>Know more here =&gt; microsponsor.co<p>Thanks!",
      "time": 1635254160,
      "title": "To 1 User in 24hr with My First Product",
      "type": "story"
    },
    {
      "by": "lobochrome",
      "descendants": 0,
      "id": 28999942,
      "score": 1,
      "time": 1635253907,
      "title": "Using Floppy Disks in 2021 for Data Transfer in Japan",
      "type": "story",
      "url": "https://asia.nikkei.com/Business/Technology/Tokyo-says-long-goodbye-to-beloved-floppy-disks"
    }
  ]
}