{
  "stories": [
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 31838573,
      "score": 1,
      "text": "Growing up in India, saving is second nature to me. It was so ingrained that I brought this to the States as my immigrant inheritance.<p>It is reflected in everything I do. I judge people who don’t ‘save for a rainy day’. I am fiscally conservative and I vote on this basis. I will totally jump entire oceans between political parties on this criteria alone. My political angst stems from mismanagement of state coffers rather than social issues.<p>I am risk averse and this too reflects in every aspect of my life..not just money. Although I can’t be accused of being ‘penny wise pound foolish’, I will walk away from adrenaline rush hooks. So I almost wear it like a badge of merit. Like it’s a secret I brought to this country and that I share with other immigrants.<p>Until it just struck me today..perhaps Americans ‘live pay check to pay check’ because they never had to save. Saving is an off shoot from uncertainty and instability. India when I was growing up was not a bed of political and economic stability. Even though we were comfortably middle class, the national anxiety seeps into homes. We saw this recently during the great covid toilet paper scarcity and hoarding phenomena.<p>Citizens of wealthy nations don’t save because they don’t have to as there is sufficient trust in the government. Saving is a reaction to scarcity.<p>I stopped saving a while ago and now with the interest rate goat rodeo, I have started thinking about it again.<p>Curious about other saving philosophies and the latest bank shenanigans will influence ingrained stances about money.",
      "time": 1655916886,
      "title": "On ‘Saving for a Rainy Day’",
      "type": "story"
    },
    {
      "by": "MarkovChain242",
      "descendants": 0,
      "id": 31838558,
      "score": 1,
      "time": 1655916854,
      "title": "A Roadmap to Zero Trust Architecture",
      "type": "story",
      "url": "https://zerotrustroadmap.org/"
    },
    {
      "by": "kjksf",
      "descendants": 0,
      "id": 31838542,
      "score": 1,
      "text": "Oh, hello. I didn&#x27;t see you there.<p>Did you ever wonder what it takes to build and launch a software product from scratch?<p>Not a high-level summary. Not a short essay that describes a year of development.<p>Detailed, day to day activities. A captain&#x27;s log.<p>Mistakes and pivots. Technology choices. Marketing activities. Design considerations.<p>You might know me as the creator of SumatraPDF.<p>I&#x27;m starting a new software product from scratch and I decided to make it an experiment of building in public.<p>I hope to inspire others to build more software by de-mystifying the process of creation.<p>I&#x27;m on day 14. It&#x27;s early but that is the point: you can follow along.<p>Here&#x27;s the daily dev diary: https:&#x2F;&#x2F;blog.kowalczyk.info&#x2F;article&#x2F;30da6655040f47e693f8e66eacd308c1&#x2F;diary-of-a-solo-dev-building-a-web-app.html<p>The product is Filerion, a web-based file browser &#x2F; file manager with support for s3, Dropbox etc.<p>I&#x27;ll be posting updates to https:&#x2F;&#x2F;twitter.com&#x2F;kjk but don&#x27;t just follow along. Start building your own stuff as well. The world needs more great software.",
      "time": 1655916783,
      "title": "Show HN: Diary of building software startup from scratch",
      "type": "story"
    },
    {
      "by": "MuchoMaas",
      "descendants": 0,
      "id": 31838529,
      "score": 1,
      "time": 1655916730,
      "title": "Voyager shares crash after warning of Three Arrows crypto loss",
      "type": "story",
      "url": "https://www.ft.com/content/d75801c9-b9dd-4f90-b012-6948cca680d0"
    },
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 31838479,
      "score": 2,
      "time": 1655916559,
      "title": "Packt Twitter Account Takeover (@Packtpub Twitter hacked)",
      "type": "story",
      "url": "https://hub.packtpub.com/twitter-account-takeover/"
    },
    {
      "by": "extra_rice",
      "descendants": 0,
      "id": 31838476,
      "score": 1,
      "text": "I&#x27;ve run in to this interesting question multiple times mostly during systems design interviews, but I&#x27;m never quite sure what&#x27;s the &quot;best&quot; way to address this since I&#x27;ve not encountered it in any of my real world projects, unfortunately. This is usually in the context of high demand items such as limited time promotional vouchers, concert tickets, limited stock items, etc. that customers will for sure be rushing to buy, and will sell out in a relatively short period of time.<p>My naive solution to this is to basically count the number of reservations made (basically, do something like an SQL count of all the rows) and subtract it from some constant limit, which can be safely copied across multiple instances of the reservation&#x2F;ticketing service. However, for millions of rows, this may be potentially slow and having to do this for thousands of requests per second could be fairly inefficient. Adding some caching in front of a (probably sharded&#x2F;distributed) database might help, but due to the numbers being updated very quickly, I&#x27;m not sure the cache will help that much.<p>One alternative I can think of is maybe setup a lightweight(?) store (something like Redis perhaps, though I don&#x27;t have first hand experience with it) to keep track of the count. This will introduce problems related to eventual consistency, but I think it could work. This can be durable store, or we can make it semi-durable and just do a count query if we ever need to restore the service. I always ask if it&#x27;s possible for us to handle overbooking because there&#x27;s a chance this could occur. Strong consistency guarantees will prevent this, but at the cost of slower performance.<p>Another alternative I can think of is adding a sequence number to the reservation records, and query the max instead. I&#x27;m not sure if this performs better than count or they&#x27;re pretty similar in performance.<p>Any insights or pointers on this?",
      "time": 1655916548,
      "title": "Ask HN: How do I efficiently track record count for big (distributed) DBs?",
      "type": "story"
    },
    {
      "by": "RemoteIsHeaven",
      "descendants": 1,
      "id": 31838472,
      "kids": [
        31838574
      ],
      "score": 1,
      "text": "Does competency in writing in a natural language correlate to competency in a programming language?<p>I am wondering if there&#x27;s opportunity in training english&#x2F;french, anthropology, history, art majors who have demonstrated competency in writing in a natural language that have overlap in vocabulary and structure with programming languages?<p>Or is competency in writing in a natural language orthogonal to competency in a programming language?",
      "time": 1655916529,
      "title": "Ask HN: Competency in natural language correlates to competency in programming?",
      "type": "story"
    },
    {
      "by": "O__________O",
      "descendants": 0,
      "id": 31838462,
      "score": 1,
      "time": 1655916487,
      "title": "Same Energy (visual search engine)",
      "type": "story",
      "url": "https://same.energy"
    },
    {
      "by": "melony",
      "descendants": 0,
      "id": 31838447,
      "score": 1,
      "time": 1655916431,
      "title": "Java is now running on 58billion devices",
      "type": "story",
      "url": "https://dev.java/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31838446,
      "score": 1,
      "time": 1655916426,
      "title": "One in every 13 incidents blamed on API insecurity – report",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/one-in-every-13-incidents-blamed-on-api-insecurity-report"
    }
  ]
}