{
  "stories": [
    {
      "by": "adlrocha",
      "descendants": 0,
      "id": 29532747,
      "score": 1,
      "time": 1639337321,
      "title": "Web3: The Metaverse",
      "type": "story",
      "url": "https://adlrocha.substack.com/p/adlrocha-web3-the-metaverse"
    },
    {
      "by": "cgb223",
      "descendants": 0,
      "id": 29532709,
      "score": 1,
      "text": "Who is trying to alleviate the current issues with global supply chain?<p>Are any new companies attempting to disrupt the way it currently (doesn’t) work?<p>What about the bigger players?<p>What solutions are being considered?",
      "time": 1639337109,
      "title": "Ask HN: What companies are taking on the current supply chain issues?",
      "type": "story"
    },
    {
      "by": "hn_throwaway_99",
      "descendants": 0,
      "id": 29532676,
      "kids": [
        29532751
      ],
      "score": 4,
      "text": "I ask this (as truly an open question, without knowing the answer) because of 2 recent posts on HN that got flagged, one a thought-provoking article by a Yale student titled &quot;Abolish Yale&quot;, and the other about the California proposal to use the recently-novel &quot;citizen deputization&quot; legal techniques pioneered by Texas, but this time to restrict assault weapons.<p>The reason I ask this is because there appear to be a growing collection of topics that <i>are</i> interesting and deserving of debate, but because they are hot-button issues they often devolve into flame wars. I&#x27;ve been on the other side of this as well, where I commented that I flagged a DEI-focused article because, while I thought the topic itself was interesting, it seems comment threads on DEI topics <i>always</i> devolve into uninteresting flame wars, and that I rarely learn something new from these threads.<p>I didn&#x27;t feel that about the 2 topics today that got flagged - indeed, there were a bunch of comments that let me to going down Wikipedia rabbit holes and I learned a ton, and for both of these topics the first I heard about them was on HN.<p>So my question to the HN community is whether you think there is some way (e.g. feature changes, &quot;sub topics&quot;, etc.) to host these topics that seem fundamentally relevant to the HN audience, but which are so difficult to have debate about without getting flooded by low quality comments?",
      "time": 1639336924,
      "title": "Ask HN: Is there a place on HN for interesting yet flame-war inducing topics?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29532627,
      "score": 2,
      "time": 1639336641,
      "title": "Anne Rice, author of The Vampire Chronicles dies at 80",
      "type": "story",
      "url": "https://twitter.com/AnneRiceAuthor/status/1469921605216133121"
    },
    {
      "by": "disabled",
      "descendants": 0,
      "id": 29532610,
      "score": 2,
      "time": 1639336527,
      "title": "Bosnia: Serbs vote to leave key institutions in secession move",
      "type": "story",
      "url": "https://www.dw.com/en/bosnia-serbs-vote-to-leave-key-institutions-in-secession-move/a-60088061"
    },
    {
      "by": "brlnwest",
      "descendants": 0,
      "id": 29532565,
      "score": 1,
      "time": 1639336216,
      "title": "The CTO Journey with Mark Porter of MongoDB",
      "type": "story",
      "url": "https://www.git-tower.com/blog/cto-mark-porter/"
    },
    {
      "by": "mfrw",
      "descendants": 0,
      "id": 29532552,
      "score": 2,
      "time": 1639336140,
      "title": "Drop-In Replacement for Memcached",
      "type": "story",
      "url": "https://www.memc.rs"
    },
    {
      "by": "aeim",
      "descendants": 0,
      "id": 29532528,
      "score": 2,
      "text": "There seems to be a simple way to think about and explain our minds that is consistent with experiential practices like meditation, observations of scientific method, and with mechanisms of evolution by natural selection.<p>A proposed Computational System design describes brain mechanisms and mind processes that explicitly and specifically impact the way we are - it is predictive and testable.<p>Initial reasoned observations appear to suggest consistency across phenomenological experience from volitional and circumstantial behaviours to often overlooked or dismissed idiosyncrasies (&amp; points to explanation for a number of curious observations in scientific experiment).<p>Jolly good.<p>The problem is, I&#x27;m not in academia, and it&#x27;s taking a while to write up. It has become much bigger than one person.<p><pre><code>  - Any tips&#x2F; thoughts on moving forwards? \n    - Positive\n    - Cautionary\n  - Concept validation?\n  - Connect with academia?\n    - Or relevant specialists?\n  - Independent release? \n    - Incremental?\n    - What would you want to know first?\n  - I&#x27;d prefer to remain anonymous initially as if it is shown to be formative it will upset some people\n  - Any advice here?\n</code></pre>\nWould I be better asking somewhere else? If so where?<p>Many Thanks",
      "time": 1639335957,
      "title": "Ask HN: Next steps for solo researcher arriving at Computational Theory of Mind?",
      "type": "story"
    },
    {
      "by": "marcelnita",
      "descendants": 0,
      "id": 29532511,
      "score": 1,
      "time": 1639335874,
      "title": "DARPA and NASA Scientists Accidentally Create Warp Bubble",
      "type": "story",
      "url": "https://coffeeordie.com/alcubierre-white-warp-drive/"
    },
    {
      "by": "AshleysBrain",
      "descendants": 0,
      "id": 29532481,
      "score": 1,
      "time": 1639335730,
      "title": "Servefolder.dev",
      "type": "story",
      "url": "https://servefolder.dev/"
    }
  ]
}