{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29729899,
      "score": 1,
      "time": 1640811296,
      "title": "Your Politics Are Boring as Fuck (1997)",
      "type": "story",
      "url": "https://de.crimethinc.com/1997/04/11/your-politics-are-boring-as-fuck"
    },
    {
      "by": "aussieguy1234",
      "descendants": 0,
      "id": 29729896,
      "score": 1,
      "time": 1640811279,
      "title": "How to Drastically Boost Your Developer Productivity",
      "type": "story",
      "url": "https://expose.sh/blog/2021/12/21/8-ways-to-drastically-boost-your-developer-productivity/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29729890,
      "score": 1,
      "time": 1640811249,
      "title": "Python, unlike C, has the mod operator always return a positive number",
      "type": "story",
      "url": "https://twitter.com/ID_AA_Carmack/status/1476294133975240712"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 29729886,
      "score": 1,
      "time": 1640811207,
      "title": "The most creative battery breakthroughs of 2021",
      "type": "story",
      "url": "https://newatlas.com/energy/best-battery-energy-breakthroughs-2021/"
    },
    {
      "by": "longitudinal93",
      "descendants": 0,
      "id": 29729879,
      "score": 1,
      "time": 1640811173,
      "title": "Minecraft Players Fight Censorship with In-Game Library",
      "type": "story",
      "url": "https://www.freethink.com/social-change/censorship"
    },
    {
      "by": "hheikinh",
      "descendants": 0,
      "id": 29729866,
      "score": 2,
      "time": 1640811117,
      "title": "The Global AI Index",
      "type": "story",
      "url": "https://www.tortoisemedia.com/intelligence/global-ai/"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 29729847,
      "score": 2,
      "time": 1640811011,
      "title": "Recovered Patients of Severe Covid Infection 233% More Likely to Die Within Year",
      "type": "story",
      "url": "https://oneresearch.org/2021/12/29/recovered-patients-of-severe-covid-19-infection-233-more-likely-than-negative-counterparts-to-die-within-year/"
    },
    {
      "by": "baxtr",
      "descendants": 0,
      "id": 29729844,
      "score": 1,
      "time": 1640810998,
      "title": "All Hail Dead Week, the Best Week of the Year",
      "type": "story",
      "url": "https://www.theatlantic.com/family/archive/2021/12/christmas-new-years-dead-week-romjul/621098/"
    },
    {
      "by": "mikhael",
      "descendants": 0,
      "id": 29729840,
      "score": 1,
      "time": 1640810979,
      "title": "Tokyo researchers work toward dream Covid-19 vaccine giving protection for life",
      "type": "story",
      "url": "https://www.japantimes.co.jp/news/2021/12/29/national/science-health/one-shot-lifetime-covid-vaccine/"
    },
    {
      "by": "88840-8855",
      "descendants": 0,
      "id": 29729822,
      "score": 3,
      "text": "I just received a letter from my electricy supplier. They are bankrupt and I am exposed to 80Cents&#x2F;kwh now as they stop delivering electricity immediatly.<p>Here is a brief summary of the electricity crisis in Germany:<p>Consumer electricity prices in Germany climb to record high despite a warm winter. Not only mine, but already several more electricity prodivers went bankrupt in the past days. The price available to consumers is now 45-80 Cents&#x2F;kwh. Many providers have stopped accepting new customers as they need to recalculate their propositions, leaving consumers exposed to the &quot;basic supply&quot; which has reached 80 Eurocents per kwh in many regions. My plan is now to take a contract that I can terminate monthly and hope that the situation will improve. If they accept my application,  I will have to pay 65 Eurocents per kwh starting now.<p>The bad news is: starting 1st of Jan the prices will increase even further due to an increased CO2 tax and the Green Party has announced to further push this tax up. However, I hope that the underlying effect will improve and lead to an overall price reduction.<p>At the same time, 3 of 6 nuclear power plants will be shut down on 31st December 2021 - in 2 days. As the Green Party does want to accelerate the transition to e-mobility, projections show that we have a demand for several new natural gas power plants in Germany. Unfortunately, due to political tensions with Russia, Germany is working closely with the United States to import LNG. It is not only more expensive, but also dirty, as fracked gas has a similar CO2 balance as coal and a horrible environmental impact.<p>The solution that Germany has to meet electrity demand is to further buy electrity from neighbors that are expanding their nuclear power plant capacity even further.<p>I am shocked and not prepared. Luckily I can pay that but I can imagine that this might drive an increase of prices for everyday goods - and lead to a errosion of our industrial competitiveness.",
      "time": 1640810922,
      "title": "Consumer electricity prices in Germany climb to record high: 45-80 Cents/kwh",
      "type": "story"
    }
  ]
}