{
  "stories": [
    {
      "by": "marban",
      "descendants": 0,
      "id": 31166634,
      "score": 1,
      "time": 1650976155,
      "title": "11 years ago today, Satoshi shared his final message and left forever",
      "type": "story",
      "url": "https://old.reddit.com/r/CryptoCurrency/comments/ucart7/11_years_ago_today_satoshi_shared_his_final/"
    },
    {
      "by": "yamoriyamori",
      "descendants": 0,
      "id": 31166622,
      "score": 1,
      "text": "Participation in technical discussion can be hard, and frankly I feel that I&#x27;ve lost my confidence over the last year.  (Possibly a covid&#x2F;remote effect, but not my main aim with this question.)  Depending on the topic or scope, such discourse can cover a lot of a tech stack and&#x2F;or functional ground.  I feel as if I&#x27;ve lost a large degree of confidence in simply participating in discussion, and for myself approaching mid-career it&#x27;s both troubling and humbling.  I hope to ASK-HN a discussion or hear people&#x27;s perspectives.<p>In the moment: during discussions of late I&#x27;ve become severely hesitant to chime in, either through uncertainty or general lack of confidence about how my three cents (inflation) will fit within the discourse.  I have observed and generalized a few (of my own) causes:<p>- The need to be precise+accurate with any statement.  (A dysfunctional workplace will not leave room for self-effacing behavior.  But there&#x27;s still a self check of &quot;is what I&#x27;m about to say correct or additive ... enough?&quot;)\n- Missing half a sentence and suddenly I&#x27;m permanently behind the topic track.\n- Or it seems that everyone else is speaking with such confidence that everyone already commands an extra layer&#x2F;depth of understanding on the subject matter, and I&#x27;m a fish out of water.\n- And I&#x27;ve noticed a follow-on effect after someone has added to the conversation, because that addition to the discourse may seem &quot;obvious&quot; to me, that I&#x27;ll either enter a self-bullying spiral of &quot;why couldn&#x27;t you have said that because you already knew it&quot; or &quot;well this discussion is full of people stating the obvious, you are allowed to mentally check out now.&quot;<p>Did you know that Holden Caufield is actually a JS developer in the year 2022?!  I would like to opine that this is appreciably different from impostor syndrome.  (Though I do believe it&#x27;s real and enjoy any related posts, recently [1].)  And it&#x27;s because there&#x27;s always code to &#x27;retreat&#x27; to, because it&#x27;s the &#x27;real&#x27; work and because code is altogether a product&#x2F;craft&#x2F;skill&#x2F;ground-truth&#x2F;machine and related discussion will always feel subordinate.  Or it seems easier to effect the team with a confluence&#x2F;wiki page (which can contain code snippets).  In no way do I think this is correct or healthy, but it&#x27;s so easy to slip into a mode of &#x27;retreat to the code&#x27;, and it can be speciously validated that it&#x27;s &quot;going back to where things matter.&quot;<p>Just as beer is the social lubricant, I&#x27;m looking for my &#x27;professional beer&#x27;.  Obviously not a cure-all pill, but how to ease some accumulated inhibitions, and participate in technical discussion without having to worry about the act of participating.  I&#x27;m curious to hear anyone&#x27;s experience or journey especially in the realm of technology and software jobs and roles.<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31129716",
      "time": 1650976036,
      "title": "Ask HN: Low confidence in tech discussions, or impostor syndrome?",
      "type": "story"
    },
    {
      "by": "aroccoli",
      "descendants": 0,
      "id": 31166608,
      "score": 1,
      "time": 1650975919,
      "title": "Introduction to Haskell Typeclasses",
      "type": "story",
      "url": "https://serokell.io/blog/haskell-typeclasses"
    },
    {
      "by": "rexreed",
      "descendants": 0,
      "id": 31166605,
      "score": 1,
      "text": "Over the past year I&#x27;ve anecdotally noticed a decrease in posting volume, comment volume, and even comment and post quality. HN doesn&#x27;t publicly post their statistics (to my knowledge), but does anyone at HN have (and can share) visibility into any stats or trends over the past few years and can share how any of that has changed? Mostly curious but also I think there&#x27;s some macro changes going on in tech and entrepreneurship.",
      "time": 1650975898,
      "title": "Ask HN: Has HN traffic / engagement declined over the past year?",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 1,
      "id": 31166567,
      "kids": [
        31166584
      ],
      "score": 1,
      "time": 1650975616,
      "title": "Covid is spreading in deer. What does that mean for the pandemic?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01112-4"
    },
    {
      "by": "szhorvat",
      "descendants": 0,
      "id": 31166533,
      "score": 1,
      "time": 1650975412,
      "title": "R/igraph 1.3 Released",
      "type": "story",
      "url": "https://igraph.discourse.group/t/r-igraph-1-3-0/1178"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31166523,
      "score": 1,
      "time": 1650975266,
      "title": "Hacking chemical plants for competition and extortion (2015) [pdf]",
      "type": "story",
      "url": "https://www.blackhat.com/docs/us-15/materials/us-15-Krotofil-Rocking-The-Pocket-Book-Hacking-Chemical-Plant-For-Competition-And-Extortion-wp.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31166522,
      "score": 2,
      "time": 1650975256,
      "title": "Guy gets Constitution amended (2017)",
      "type": "story",
      "url": "https://www.loweringthebar.net/2017/03/guy-who-got-a-c-on-amendment.html"
    },
    {
      "by": "groffee",
      "descendants": 0,
      "id": 31166481,
      "score": 3,
      "time": 1650974921,
      "title": "Privacy email provider CTemplar is shutting down",
      "type": "story",
      "url": "https://ctemplar.com/ctemplar-is-shutting-down/"
    },
    {
      "by": "aristofun",
      "descendants": 0,
      "id": 31166475,
      "score": 3,
      "text": "I&#x27;m not looking for textbooks or best education materials per se, but rather for thought provoking and inspiring reading on computer science topics.<p>What books you find the most brilliant, inspiring and explaining the core CS ideas, data structures, algorithms?<p>For any level of readers, just your personal best two.<p>For example, I find this book amazing for beginners: https:&#x2F;&#x2F;www.amazon.com&#x2F;Code-Language-Computer-Hardware-Software&#x2F;dp&#x2F;0735611319<p>And this one of the same author for more prepared reader: https:&#x2F;&#x2F;www.amazon.com&#x2F;Annotated-Turing-Through-Historic-Computability&#x2F;dp&#x2F;0470229055&#x2F;",
      "time": 1650974821,
      "title": "Ask HN: Top inspiring books on crucial CS ideas?",
      "type": "story"
    }
  ]
}