{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28377283,
      "score": 2,
      "time": 1630481853,
      "title": "Crafting an Interpreter in Zig: part 1",
      "type": "story",
      "url": "https://zig.news/andres/crafting-an-interpreter-in-zig-part-1-jdh"
    },
    {
      "by": "jinqueeny",
      "descendants": 0,
      "id": 28377272,
      "score": 1,
      "time": 1630481666,
      "title": "Engula, a unit orchestration system that provides storage services as a whole",
      "type": "story",
      "url": "https://github.com/engula/engula"
    },
    {
      "by": "TriNetra",
      "descendants": 0,
      "id": 28377259,
      "score": 1,
      "text": "Hi all,<p>We&#x27;ve built an alternative way to track consumption of the cloud. It’s in beta, and we’ve just made it public: https:&#x2F;&#x2F;cloudalarm.in&#x2F;<p>Right now, we support Azure and plan to support AWS and other cloud providers gradually in near future.<p>I&#x27;ve been Azure customer for years and have found the built-in budget alerting not useful. I wanted to get notified as soon as my current consumption rate would be estimated to exceed my budget, but budget alerts only notify you when you&#x27;ve consumed the specified percentage (threshold) of your budget. Setting a lower percentage means that I&#x27;d receive the email every month and I&#x27;d start ignoring it, while a higher percentage means I&#x27;d get alert very late by which time the damage is done.<p>On multiple occasions, I had a database got created in a much expensive tier (thanks to Azure defaults) and I&#x27;d find out about it after a month or so. A round of emails for refund would then be initiated. A colleague of mine also faced the same problem and upon research we found many other people were in the same boat.<p>I checked and discovered that AWS cloud watch also requires a similar threshold value.<p>As we started building it, we&#x27;ve also learnt that there&#x27;s no near real-time usage information made available regarding your consumption by the cloud providers, so we came up with a concept of resource alerts to alert whenever a new resource is created higher than the specified tier. Resources list is available in real-time so we can cache and compare to find out new resources just added.<p>ON top of this, we&#x27;ve added a few more things to make it even more usable:<p>- Email subject with enough info about the alert so you don&#x27;t have to read the body if you are already aware about the cause.<p>- email reminders for budget alerts so you don&#x27;t miss it.<p>- Embedded actions in budget alerts to ignore alert or update your budget without having to login<p>- Track accidental deletion of critical resources like databases.<p>It ended up taking us over 4 months to build this into a scalable solution that can work efficiently with a cloud subscription having a few resources to the one having thousands of them - we faced multiple consistency issues in the APIs around getting this info reliably from Azure, not to mention the covid and other diseases that engulfed the family of very small team of ours.<p>We’d love your feedback, experience and thoughts!",
      "time": 1630481469,
      "title": "Show HN: Get timely alerts for your cloud resources and costs",
      "type": "story"
    },
    {
      "by": "randomperson_24",
      "descendants": 0,
      "id": 28377244,
      "score": 1,
      "time": 1630481285,
      "title": "Privacy, Ads and Confusion",
      "type": "story",
      "url": "https://www.ben-evans.com/benedictevans/2021/8/27/understanding-privacy"
    },
    {
      "by": "andrewgleave",
      "descendants": 1,
      "id": 28377229,
      "kids": [
        28377243
      ],
      "score": 2,
      "time": 1630481083,
      "title": "Show HN: SnipRSS – Straight to RSS web clipper for content curators",
      "type": "story",
      "url": "https://sniprss.com"
    },
    {
      "by": "lgats",
      "descendants": 0,
      "id": 28377199,
      "score": 3,
      "time": 1630480727,
      "title": "Private Internet Access (VPN) mistakenly cancels many long-term users",
      "type": "story",
      "url": "https://www.reddit.com/r/PrivateInternetAccess/comments/pfjxzr/paypal_cancelled/"
    },
    {
      "by": "personjerry",
      "descendants": 0,
      "id": 28377190,
      "score": 1,
      "time": 1630480632,
      "title": "Is `yes | rm -r` safer than `rm -rf`?",
      "type": "story",
      "url": "https://unix.stackexchange.com/q/666766/381762"
    },
    {
      "by": "elsus",
      "descendants": 0,
      "id": 28377184,
      "score": 1,
      "text": "Hello,<p>I have had some ideas I wanted to transform into reality. It&#x27;s a website for a company that I work for.<p>The idea is simple because we don&#x27;t need to &quot;explain ourselves&quot;. I&#x27;d just like a simple single-page web containing one animated logo and maybe 1-2 links.<p>How should I approach building the web? I have zero-to-none knowledge of web building. I&#x27;ve previously created web pages with wordpress but it&#x27;s too complicated for my current needs.\nIs it possible to create some responsive web in, for example, HTML5 (bear in mind I&#x27;m not familiar with the possibilities of each programming language offered for web).<p>I&#x27;d also like to not use all the junk-filled prepaid websites with other limitations that offer solution for my problem since I have access to webhosting a webserver so only thing I need is &quot;the website&quot;. Pardon my language I&#x27;m not a native english speaker.<p>Thanks for any advice.",
      "time": 1630480581,
      "title": "Ask HN: Single-Page website builder with limited programming",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 28377171,
      "score": 1,
      "time": 1630480386,
      "title": "Stack Overflow’s 2021 Developer Survey Uncovers New Trends in Tech and Work",
      "type": "story",
      "url": "https://www.infoq.com/news/2021/09/so-developer-survey-2021/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28377166,
      "score": 1,
      "time": 1630480321,
      "title": "Yuzu Progress Report July 2021",
      "type": "story",
      "url": "https://yuzu-emu.org/entry/yuzu-progress-report-jul-2021/"
    }
  ]
}