{
  "stories": [
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 31530190,
      "score": 1,
      "time": 1653662380,
      "title": "Druid: A Real-Time Analytical Data Store",
      "type": "story",
      "url": "https://www.micahlerner.com/2022/05/15/druid-a-real-time-analytical-data-store.html"
    },
    {
      "by": "throwawaaaaay17",
      "descendants": 0,
      "id": 31530176,
      "score": 1,
      "text": "I&#x27;ve been dealing with a serious health issue that is a major problem in my life, I am in constant pain, I can barely work. My experience with the US healthcare system has been abysmal - I go to a doctor, the doctor sends me to get tests, it&#x27;s 3 weeks, after that another 3 weeks to see a specialist, 3 weeks more for more tests, etc, etc. I&#x27;ve been ping-ponged around for 4 months with little progress in terms of diagnosis.<p>I&#x27;m sure that there is a way to buy better healthcare. Surely Satya Nadella doesn&#x27;t have to go through this. What I would love to do is pay a large amount of money ($50K out of pocket not counting insurance for just the diagnosis) and go through all of the doctors&#x2F;tests in two weeks. Does anyone know where I can do that? The US would be best, but can travel internationally for this too.<p>Would appreciate any pointers people might have, I don&#x27;t even know what to Google. If necessary, the issue is neck-spine related, relevant doctors might be neurologist, rheumatologist, spine surgeon, etc.",
      "time": 1653662298,
      "title": "Ask HN: How can you buy high quality healthcare?",
      "type": "story"
    },
    {
      "by": "brycewray",
      "descendants": 0,
      "id": 31530173,
      "score": 1,
      "time": 1653662276,
      "title": "Cloudflare dev docs and the switch from Gatsby back to Hugo",
      "type": "story",
      "url": "https://www.brycewray.com/posts/2022/05/cloudflare-dev-docs-hugo-gatsby/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31530161,
      "score": 1,
      "time": 1653662238,
      "title": "Techniques for Building Reliable AI Models",
      "type": "story",
      "url": "https://future.a16z.com/7-techniques-for-building-reliable-ai-models/"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 31530157,
      "score": 1,
      "time": 1653662221,
      "title": "Darmok and Jalad at Tanagra",
      "type": "story",
      "url": "http://ianchadwick.com/blog/darmok-and-jalad-at-tanagra/"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 31530156,
      "score": 1,
      "time": 1653662215,
      "title": "Benedict Evans: “There's no such thing as 'data'”",
      "type": "story",
      "url": "https://twitter.com/benedictevans/status/1222923781288710148"
    },
    {
      "by": "Pixelmix_Games",
      "descendants": 1,
      "id": 31530130,
      "kids": [
        31530131
      ],
      "score": 1,
      "time": 1653662104,
      "title": "Flapping Bird",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=com.pixelmixgames.flappingbird&hl=en_US&gl=US"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31530117,
      "score": 1,
      "time": 1653662049,
      "title": "Use conic gradients to create a cool border",
      "type": "story",
      "url": "https://web.dev/conic-gradient-border/"
    },
    {
      "by": "phantompeace",
      "descendants": 1,
      "id": 31530113,
      "kids": [
        31530171
      ],
      "score": 1,
      "text": "Based in UK. I started a new position at a company that trains people in various cloud stuff (Azure, AWS, Salesforce). For the first 12 weeks, we (the cohort) study and gain some certs and then after that, we get placed with a client to work on some projects.<p>However, after 3 weeks and 1 cert later, we were told that the company can&#x27;t find enough clients and we may need to look for other jobs soon. We still have about 5 - 6 weeks left for training and another cert to attain. If the company can&#x27;t find any clients in 6-10 weeks, we will most likely be let go (their words).<p>The problem is that most of us cannot go back to our previous jobs because the way we left wasn&#x27;t ideal - the training started way too early and we had to leave during our notice periods. On top of that, certs are kinda useless without the experience to back them.<p>What would you advise us to do in this situation?",
      "time": 1653662028,
      "title": "Ask HN: New employer cannot guarantee work after training. What should I do?",
      "type": "story"
    },
    {
      "by": "donsupreme",
      "descendants": 1,
      "id": 31530105,
      "kids": [
        31530167
      ],
      "score": 1,
      "time": 1653662002,
      "title": "Musk: Covid stay-at-home has tricked people thinking you don't need to work hard",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1529983508206190592"
    }
  ]
}