{
  "stories": [
    {
      "by": "DaniDaniel5005",
      "descendants": 0,
      "id": 31672096,
      "score": 1,
      "time": 1654713604,
      "title": "Shields.io Is Down",
      "type": "story",
      "url": "https://shields.io/"
    },
    {
      "by": "rc-1140",
      "descendants": 0,
      "id": 31672091,
      "score": 1,
      "text": "For both personal projects and at the workplace, I&#x27;m running into an issue where there&#x27;s a LOT of tabular data to display, and I&#x27;ve tried searching around for examples with nothing to show for it. In the workplace in particular, the project I&#x27;m working on has an almost unreasonable amount of columns, and our userbase has said that they can&#x27;t live without any of the columns.<p>Are there any (web)apps out there that any of you use or have worked on that try to organize or segment tabular data into manageable chunks? Trying to find some kind of design inspiration that won&#x27;t involve the usual cry of &quot;let&#x27;s rewrite the app and burn what we have!&quot;",
      "time": 1654713587,
      "title": "Ask HN: Web)Apps that display tabular data in a user-friendly way?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31672084,
      "score": 1,
      "time": 1654713552,
      "title": "Whiley Gets Rusty",
      "type": "story",
      "url": "https://whileydave.com/2022/05/31/whiley-gets-rusty/"
    },
    {
      "by": "zthrowaway",
      "descendants": 0,
      "id": 31672068,
      "score": 1,
      "time": 1654713490,
      "title": "Stop telling kids that climate change will destroy their world",
      "type": "story",
      "url": "https://www.vox.com/23158406/climate-change-tell-kids-wont-destroy-world"
    },
    {
      "by": "unpresidented",
      "descendants": 0,
      "id": 31672066,
      "score": 1,
      "text": "I recently heard that some senior management at my company monitor employee &quot;work habit&quot; using some Microsoft Office&#x27;s feature for all their department<p>There is indeed a Microsoft Office feature called &quot;Viva&quot;, but it supposed to be private to us.<p>https:&#x2F;&#x2F;docs.microsoft.com&#x2F;en-us&#x2F;viva&#x2F;insights&#x2F;personal&#x2F;overview&#x2F;privacy-guide-users<p>Viva emails are grossly inaccurate for me. It recalls 80% focus time when clearly I have been in meetings (sometimes unnecessary but beyond my control) and in-person collaboration all day for a week.<p>I can&#x27;t think what could be wrong! Sometimes I don&#x27;t get time to accept my meetings; because I haven&#x27;t figured out which one of my conflicts to pick. I still attend the one I feel is appropriate. Microsoft is someone unable to link attendance information from Teams?<p>Is Viva using this to predict that I am not attending a meeting? If that is true, where is the accountability on Microsoft for having designed unverifiable and un-auditable monitoring methods that clearly could affect people&#x27;s career? Do they assume I am working entirely inside office products? I can&#x27;t imagine what happens to some poor soul who needs to keep their job. Microsoft says their tool is not meant for monitoring... like that is going to prevent folks from using it.<p>Anyone with similar experience?",
      "time": 1654713484,
      "title": "Ask HN: Employee monitoring using Microsoft Office",
      "type": "story"
    },
    {
      "by": "somerando7",
      "descendants": 0,
      "id": 31672063,
      "score": 1,
      "time": 1654713478,
      "title": "Facebook's Zookeeper Implementation on Delos",
      "type": "story",
      "url": "https://engineering.fb.com/2022/06/08/developer-tools/zelos/"
    },
    {
      "by": "afont",
      "descendants": 0,
      "id": 31672058,
      "score": 1,
      "text": "I created a tool that forces solution-oriented people to build project plans with the end in mind. It&#x27;s a visual network of nodes that tells a story. Built it because I was tired of the same old productivity tool that is just a post it board for to dos. Missions, I believe, will help build effective processes rather than needless processes. It&#x27;ll also give project members ease of mind knowing that they&#x27;re always on track. Feel free to give it a go and just reply and I can give full access. Warning: bugs &#x2F; beta features exist. Enjoy.",
      "time": 1654713462,
      "title": "Show HN: Missions that help with anxiety, storytelling, and retention",
      "type": "story",
      "url": "https://twigflo.com/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31672054,
      "score": 1,
      "time": 1654713448,
      "title": "Is it a Ponzi? A framework for evaluating crypto projects",
      "type": "story",
      "url": "https://every.to/almanack/is-it-a-ponzi"
    },
    {
      "by": "lousyd",
      "descendants": 0,
      "id": 31672049,
      "score": 1,
      "time": 1654713430,
      "title": "Supreme Court may take territories off the map of the US",
      "type": "story",
      "url": "https://www.bostonglobe.com/2022/06/08/opinion/supreme-court-may-take-territories-off-map-us/"
    },
    {
      "by": "orang2tang",
      "descendants": 0,
      "id": 31672046,
      "score": 1,
      "time": 1654713418,
      "title": "Paleoclimate Indicators Correlate to Date of Noah's Flood",
      "type": "story",
      "url": "https://www.kjvbible.org/greenland_ice_sheet.html"
    }
  ]
}