{
  "stories": [
    {
      "by": "iamsandysk",
      "descendants": 0,
      "id": 28211246,
      "score": 1,
      "text": "Hey all, my name is Santhosh, and I am the Co-founder of Jikoo. For the last 18 months, I have been working to build a modern No-code Chatbot and Livechat platform with ticketing capabilities.<p>The backstory:<p>I was leading the GTM of Zoho for the UK&#x2F;European market back in 2020. When Covid struck we went to work from home, that&#x27;s when the real challenge began. There were a lot of chats coming in from customers as a lot of people were working from home and incoming calls almost dropped to zero.<p>Sometimes we were handling 10-15 chats parallelly, chats were getting missed frequently. I was not able to transfer queries to sales&#x2F;product teams as the chat product didn&#x27;t allow us to do so. No proper ticketing and issue&#x2F;query tagging were available within the live chat software which even slowed down the process, couldn&#x27;t really understand why customers were coming. When we tried to implement a chatbot it took a lot of learning and time to actually go live.<p>So I finally decided this is the problem I should be solving which can make a real difference for the new-age companies and quit my job last year. In a startup, be it the Head of Marketing or Product should always be in sync with customer queries. So how do you create a product which can bring all the teams together in a single window without a lot of effort? I was a huge fan of service now - almost anything can be templated and workflows can be created to streamline processes.<p>So taking inspiration from Service now, I have created a next-gen Chatbot &amp; Live chat software with rich ticketing capabilities. Gone are the times where you will have to worry about missing important customer chats.<p>Enough of the story, so let&#x27;s see how we really make a difference:<p>Scenario 1: If a customer comes to report a bug - You can talk to him using the chatbot and gather all the information. Create a ticket automatically and tag it to the developer in charge, later the developer can push the issue to JIRA in seconds.<p>Scenario 2: If a new lead comes in, you can qualify them using the chatbot. Based on the responses you can either provide a self-service or tag someone from the sales team. The beauty here is our powerful tags can help you tag the query - Eg: Customer type | New lead, Location | New York, Deal Type | Enterprise. Makes life easy for your GTM teams to focus on stuff that matters.<p>Once the lead is converted you can create a new ticket from the existing chat and assign it to your onboarding or operations team. So the entire cycle of customer management becomes absolutely easy.<p>The quickest way to get a feeling of how Jikoo works is by checking out our page: https:&#x2F;&#x2F;jikoo.io&#x2F;<p>With this version, I feel that I am very close to my vision for what Jikoo MVP should be. In other words; it is finally ready for public consumption. I&#x27;d wholeheartedly advice you to look into it and give it a whirl if you are interested in no-code and cx :)<p>Hope you like it, and please share any feedback you might have in the comments!",
      "time": 1629215712,
      "title": "Spent 18 months building a modern No-code Chatbot platform for GTM teams",
      "type": "story"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 28211245,
      "score": 1,
      "time": 1629215703,
      "title": "Satellite photos show chaos in Afghanistan exit",
      "type": "story",
      "url": "https://www.c4isrnet.com/intel-geoint/2021/08/16/satellite-photos-show-chaos-in-afghanistan-exit/"
    },
    {
      "by": "malshe",
      "descendants": 0,
      "id": 28211244,
      "score": 1,
      "time": 1629215702,
      "title": "How to recognize AI snake oil [slides] [pdf]",
      "type": "story",
      "url": "https://www.cs.princeton.edu/~arvindn/talks/MIT-STS-AI-snakeoil.pdf"
    },
    {
      "by": "alphathesis",
      "descendants": 0,
      "id": 28211240,
      "score": 1,
      "text": "I&#x27;m looking for references from any startup founders who have partnered with Altura Ventures and learn about your experience. https:&#x2F;&#x2F;www.altura.com&#x2F;",
      "time": 1629215693,
      "title": "Have any startup founders worked with Altura Ventures?",
      "type": "story"
    },
    {
      "by": "marc__1",
      "descendants": 0,
      "id": 28211200,
      "score": 2,
      "time": 1629215492,
      "title": "Corellium will pay for security researchers to check Apple CSAM claims",
      "type": "story",
      "url": "https://www.corellium.com/blog/open-security-initiative"
    },
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 28211189,
      "score": 1,
      "time": 1629215442,
      "title": "Sources of funding (including self-funding) for Taliban – AOAV (2017)",
      "type": "story",
      "url": "https://aoav.org.uk/2017/sources-funding-including-self-funding-major-groupings-perpetrate-ied-incidents-taliban/"
    },
    {
      "by": "bldavies",
      "descendants": 0,
      "id": 28211188,
      "score": 1,
      "time": 1629215437,
      "title": "Models of human predictions can out-perform the humans those models are based on",
      "type": "story",
      "url": "https://bldavies.com/blog/improving-human-predictions/"
    },
    {
      "by": "anarbadalov",
      "descendants": 0,
      "id": 28211185,
      "score": 1,
      "time": 1629215421,
      "title": "When in Doubt, Copy",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/when-in-doubt-copy/"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 28211183,
      "score": 1,
      "time": 1629215407,
      "title": "Google and Facebook’s New Cable to Link Japan and Southeast Asia",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-16/google-and-facebook-s-new-cable-to-link-japan-and-southeast-asia"
    },
    {
      "by": "brundolf",
      "descendants": 0,
      "id": 28211174,
      "score": 1,
      "time": 1629215358,
      "title": "Casual Parsing in JavaScript",
      "type": "story",
      "url": "https://www.brandons.me/blog/casual-parsing-javascript"
    }
  ]
}