{
  "stories": [
    null,
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 31850491,
      "score": 1,
      "time": 1655998124,
      "title": "Language Models: Past, Present, and Future",
      "type": "story",
      "url": "https://cacm.acm.org/magazines/2022/7/262080-language-models/fulltext"
    },
    {
      "by": "kwindla",
      "descendants": 0,
      "id": 31850470,
      "score": 1,
      "time": 1655998051,
      "title": "On the Grid in Leisang",
      "type": "story",
      "url": "https://www.nybooks.com/daily/2022/06/22/on-the-grid-in-leisang/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31850451,
      "score": 1,
      "time": 1655997987,
      "title": "The Economics Behind Esports",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=VFUbhz9xRYQ"
    },
    {
      "by": "hemloc_io",
      "descendants": 0,
      "id": 31850448,
      "score": 1,
      "time": 1655997968,
      "title": "FDA bans Juul e-cigarettes",
      "type": "story",
      "url": "https://www.cnbc.com/2022/06/23/fda-bans-juul-e-cigarettes-as-us-cracks-down-on-nicotine-products.html"
    },
    {
      "by": "stewfortier",
      "descendants": 0,
      "id": 31850439,
      "score": 4,
      "text": "Hi HN, Stew and Dan here from Foster (<a href=\"https:&#x2F;&#x2F;foster.co\" rel=\"nofollow\">https:&#x2F;&#x2F;foster.co</a>). Foster connects you with professional editors who can improve your writing. We&#x27;ve built a button in Google Docs that you can tap and get collaborative support on your document within 24 hours.<p>Most online writing today is produced in a broken way. Writers are commonly told to publish a lot, see how readers respond, and adjust. But most internet readers don’t comment or respond. They just get whatever they can and move on. They bail on an article the minute it fails to hold their attention, and you don’t get a second chance. Thus the most common response to writing online is silence. Silence is a terrible teacher!<p>What writers need is feedback <i>before</i> they hit publish, so that readers receive the best-expressed version of their ideas. But it’s hard to get quality feedback on a draft. Asking friends tends to be unsustainable—you burn an ask each time—and hiring an editor is complicated and expensive. That’s the problem we’re solving with Foster.<p>I published a personal blog for ~2 years that basically nobody read. One day, I decided to start asking friends for feedback on my writing. I was pretty surprised to discover how much my writing sucked. The first post I published after an extensive round of peer edits became my most popular piece.<p>At the time, I was working on another startup and blogging for fun on the side but the experience was so profound that I wondered if this might be something I could help more people experience one day. A year later, I reconnected with my friend (and now co-founder) Dan and we realized neither of us were passionate about our startups at the time. We started to talk about our mutual love of writing and realized this might be our chance to build something we really cared about.<p>We launched Foster as a Slack group that writers could join to swap feedback on each others’ drafts. But over time we learned that most of our members primarily loved to write and, while editing other people’s work could be helpful and interesting, they ultimately wanted to just get the best possible feedback on their own work.<p>So we started to redesign the experience so that writers didn’t have to join a full-on community and could instead share and track their drafts using a simple web app. On the other side, we recruited professional editors, writers, and experts who could support drafts where they felt they could add unique value.<p>We eventually realized we should just bring the entire experience to the draft itself since that’s where the writer lives, so we built a Chrome extension that works with Google Docs. Writers see a Foster button directly in their doc that they can tap to submit the work to Foster. Editing help then comes directly to their document without them ever leaving.<p>Unlike hiring an editor via marketplaces like Upwork, you don’t need to do any job-posting or back-and-forth. You hit a button in Google Docs and high-quality collaborators jump directly in to help. The majority of the writers we spoke with early on use Google Docs, but we plan to expand work with other writing platforms in the future to accommodate more writers.<p>We’ve built a collective of editors, writers, and experts who enjoy jumping into first drafts and helping to improve them. Foster contributors do more than spot a missing comma—they give you suggestions on how to make a story funnier or how to make your argument air-tight.<p>People tend to underestimate how much better their writing can be. We’ve found it&#x27;s hardest to get somebody to post a first draft in Foster, because often they don&#x27;t think they need an editor. But once they do, more than half post another draft.<p>A few of our early users are Hacker News regulars who have used Foster to improve their work before submitting it here. These were both sent through Foster prior to being submitted to HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31327219\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31327219</a>, <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29304667\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29304667</a> (this post landed the author a job at Replit).<p>And while it’s exciting to see individual pieces improve, many writers tell us that using Foster has elevated their writing skills generally (<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;tomcritchlow&#x2F;status&#x2F;1535404631123173376\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;tomcritchlow&#x2F;status&#x2F;1535404631123173376</a>)\n and motivated them to write more (<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;liuxi&#x2F;status&#x2F;1511191555796729862\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;liuxi&#x2F;status&#x2F;1511191555796729862</a>).<p>Today, we’re opening up Foster to anybody who writes. You can go to <a href=\"https:&#x2F;&#x2F;foster.co\" rel=\"nofollow\">https:&#x2F;&#x2F;foster.co</a>, pick a plan based on how much you write, and install our Chrome extension (you can also submit drafts via our web app).<p>We’ll be giving away free trials today, so you should see a promo code when you go to pick a plan. If you don’t see a code and still want to try Foster, shoot us a note at founders@foster.co.<p>We hope you’ll share your input, questions, and suggestions in this thread. We’re excited to hear what you think.",
      "time": 1655997937,
      "title": "Launch HN: Foster (YC W21) – Improve your writing with on-demand editing",
      "type": "story",
      "url": "https://www.foster.co/"
    },
    {
      "by": "michaelsbradley",
      "descendants": 0,
      "id": 31850436,
      "score": 1,
      "time": 1655997924,
      "title": "Mastering Nim: A complete guide to the programming language",
      "type": "story",
      "url": "https://forum.nim-lang.org/t/9259"
    },
    {
      "by": "has1990",
      "descendants": 1,
      "id": 31850416,
      "kids": [
        31850417
      ],
      "score": 1,
      "time": 1655997862,
      "title": "The Case of the Missing $46M",
      "type": "story",
      "url": "https://torontolife.com/city/the-case-of-the-missing-46-million/"
    },
    {
      "by": "dustingetz",
      "descendants": 0,
      "id": 31850409,
      "score": 1,
      "time": 1655997842,
      "title": "Hyperfiddle/Photon, a new web stack with compiler managed client/server datasync",
      "type": "story",
      "url": "https://hyperfiddle.notion.site/Hyperfiddle-Photon-progress-update-57aee367c20e45b3b80366d1abe4fbc3"
    },
    {
      "by": "fauria",
      "descendants": 0,
      "id": 31850402,
      "score": 2,
      "time": 1655997824,
      "title": "Running a shared local DNS cache and unclear docs mistaken as a bug",
      "type": "story",
      "url": "https://bugbounty.club/2022/06/23/running-a-shared-local-dns-cache-and-unclear-docs-mistaken-as-a-bug.html"
    }
  ]
}