{
  "stories": [
    {
      "by": "atsushin",
      "descendants": 0,
      "id": 32104434,
      "score": 1,
      "text": "I&#x27;ve been at a very large firm &#x2F; project for a little more than a year working as a backend developer. During that time I&#x27;ve accrued a decent amount of technical and domain knowledge about our system, enough that they&#x27;ve placed me as a technical architect working with two teams for an upcoming release whose deadline is about a year from now. Given most of HN consists of tech-oriented folks, I was hoping to get some advice on how to thrive in this new role both from a technical and leadership standpoint, as I feel I am still getting my footing in adjusting to this sudden change.",
      "time": 1657857181,
      "title": "Ask HN: Advice for a new Technical Architect?",
      "type": "story"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 32104428,
      "kids": [
        32104429
      ],
      "score": 1,
      "time": 1657857011,
      "title": "The Rapture of Listening to a Fake Baseball Game",
      "type": "story",
      "url": "https://www.newyorker.com/culture/rabbit-holes/the-rapture-of-listening-to-a-fake-baseball-game"
    },
    {
      "by": "strikingloo",
      "descendants": 0,
      "id": 32104415,
      "score": 1,
      "time": 1657856892,
      "title": "Confidence Intervals Through Bootstrapping in Python (Tutorial with Code)",
      "type": "story",
      "url": "https://strikingloo.github.io/wiki-articles/programming/bootstrapping"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 32104405,
      "score": 1,
      "time": 1657856807,
      "title": "Marketing Docs Are Not Written for Engineers",
      "type": "story",
      "url": "https://ethancbanks.com/marketing-docs-are-not-written-for-engineers/"
    },
    {
      "by": "lizhe",
      "descendants": 1,
      "id": 32104401,
      "kids": [
        32104402
      ],
      "score": 1,
      "time": 1657856747,
      "title": "Belt Cleaner",
      "type": "story",
      "url": "https://www.conveyorsplicing.com/"
    },
    {
      "by": "totallyblasted",
      "descendants": 0,
      "id": 32104394,
      "score": 1,
      "text": "I noticed that when there&#x27;s a backlog of notifications in your notifications queue, the phone intelligently shows calendar events at the top depending on when they&#x27;re actually important with other metrics I actively track on the phone, like sleep quality and sleep duration. (This was a sleep reminder based on when the phone saw that I&#x27;m routinely going to bed, presumably). Whereas other calendar events I&#x27;ve been ignoring the last few days due to other obligations did not show up at the top of the queue despite being more recent &quot;events&quot; in my life than some of the backlogged items I still haven&#x27;t bothered to clear out yet.<p>Would be cool to work at Apple on that stuff. Both the hardware and the software are sooo gorgeous. Super smart calendar reminder in the notifications. I can&#x27;t tell if that&#x27;s the notification&#x27;s system being very intelligent about what to show at the top and when, or if it&#x27;s the calendar app itself running checks periodically on what reminders you actually care about historically, and weighing that in deciding which events&#x2F;reminders to put at the top of the queue?<p>Edit: Or...<p><i>le gasp</i><p>Could it be my iPhone&#x27;s Siri lovingly reminding me to go to bed because <i>chosen Siri pronoun</i> saw that my tone of voice and sleep quality improved when that particular reminder issued at the top consistently vs other reminders that may vye for the top of that queue? What an impactful change since I&#x27;m actually going to respect that calendar reminder even more often as a result! I love that! That&#x27;s why I&#x27;m so happy about this lmao! Wow!",
      "time": 1657856695,
      "title": "Ask HN: Siri's iOS calendar reminder notifications are neat, which team was it?",
      "type": "story"
    },
    {
      "by": "LordAtlas",
      "descendants": 0,
      "id": 32104382,
      "score": 1,
      "time": 1657856634,
      "title": "Why Does Everyone Have IBS?",
      "type": "story",
      "url": "https://www.thedriftmag.com/sick-to-our-stomachs/"
    },
    {
      "by": "chris_armstrong",
      "descendants": 0,
      "id": 32104365,
      "score": 1,
      "time": 1657856433,
      "title": "Observability: What to Instrument?",
      "type": "story",
      "url": "https://www.chrisarmstrong.dev/posts/observability-what-to-instrument/"
    },
    {
      "by": "chazeon",
      "descendants": 0,
      "id": 32104356,
      "score": 1,
      "time": 1657856363,
      "title": "Microsoft moves to new Windows development cycle",
      "type": "story",
      "url": "https://www.windowscentral.com/software-apps/windows-11/microsoft-moves-to-new-windows-development-cycle-with-major-release-every-three-years-feature-drops-in-between"
    },
    {
      "by": "thebigship",
      "descendants": 0,
      "id": 32104352,
      "score": 1,
      "time": 1657856273,
      "title": "MBS’s $500B Desert Dream Just Keeps Getting Weirder",
      "type": "story",
      "url": "https://www.bloomberg.com/features/2022-mbs-neom-saudi-arabia/"
    }
  ]
}