{
  "stories": [
    {
      "by": "thinkloop",
      "descendants": 0,
      "id": 29577253,
      "score": 1,
      "text": "I have a laptop with a humble amount of disk-space and a desktop with a massive amount of disk-space.<p>I would like for the desktop to be a logically infinite source of storage, while the laptop stores only what I am currently using.<p>For example, if I have a &quot;photos&quot; folder with 10tb of photos, I would like to see a list of all the photos when I open the folder on my laptop. If I then select a specific photo to open, my laptop checks if it already has it downloaded locally and if not, silently pulls it from the server. If I do that thousands of times and run out of space on my laptop, the laptop should automatically purge the LRU photo to load the new one.<p>From the laptop&#x27;s perspective, it has an unlimited amount of space - the only noticeable thing is that some files take longer to load than others.<p>A critical component of this is that both systems are automatically synched. If a folder is created on the laptop, it is also created on the desktop. If a file is created on the laptop it is automatically backed up to the desktop. If a file is added to the desktop, its metadata is automatically synched to the laptop. Etc.<p>The desktop stores a superset of the the laptop and nothing else. The laptop always knows all the files on the desktop.<p>What self-hosted, preferably FOSS, software does this?",
      "time": 1639655087,
      "title": "Self-hosted on-demand synched file storage",
      "type": "story"
    },
    {
      "by": "Schiphol",
      "descendants": 0,
      "id": 29577229,
      "score": 2,
      "time": 1639654759,
      "title": "The Proof Is Trivial",
      "type": "story",
      "url": "https://www.theproofistrivial.com/"
    },
    {
      "by": "xupybd",
      "descendants": 0,
      "id": 29577228,
      "score": 1,
      "text": "What wisdom have you learned as a software developer, that you&#x27;d like to share with others?",
      "time": 1639654755,
      "title": "Ask HN: What have you learned as a developer?",
      "type": "story"
    },
    {
      "by": "stepbeek",
      "descendants": 0,
      "id": 29577216,
      "score": 1,
      "time": 1639654584,
      "title": "Cube CSS",
      "type": "story",
      "url": "https://cube.fyi/"
    },
    {
      "by": "samrohn777",
      "descendants": 0,
      "id": 29577212,
      "score": 1,
      "time": 1639654541,
      "title": "The Greatest Counterfeiter",
      "type": "story",
      "url": "https://darknetdiaries.com/episode/102/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29577188,
      "score": 1,
      "time": 1639654178,
      "title": "Vegetables Don’t Exist (2019)",
      "type": "story",
      "url": "https://popula.com/2019/02/20/vegetables-dont-exist/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29577185,
      "score": 1,
      "time": 1639654162,
      "title": "UK's disused mine shafts could be used to store renewable energy (2019)",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2019/oct/21/how-uks-disused-mine-shafts-plan-to-store-renewable-energy"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29577181,
      "score": 1,
      "time": 1639654121,
      "title": "Tesla told France there was no sign of technical fault in Paris big crash",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/french-transport-minister-says-not-worried-about-tesla-after-paris-car-accident-2021-12-15/"
    },
    {
      "by": "sigmaprimus",
      "descendants": 3,
      "id": 29577177,
      "kids": [
        29577214,
        29577194
      ],
      "score": 2,
      "text": "We have seen Programs become Applications and eventually Apps.\nMainframe systems evolved into servers and through &quot;Serverless&quot; innovations there is now &quot;The Cloud&quot;<p>It seems as time goes by certain names and terms for technology get, forgive my lack of a better phrase &quot;Dumbed Down&quot;.<p>So my question is: Given that public ledgers have become &quot;Block Chains&quot; does anyone have ideas on what we will call them in the next 5-10 years? And does&#x2F;should it matter?",
      "time": 1639654081,
      "title": "Ask HN: Does anyone have a prediction for the next trendy name for blockchain?",
      "type": "story"
    },
    {
      "by": "ianpurton",
      "descendants": 1,
      "id": 29577176,
      "kids": [
        29577251
      ],
      "score": 1,
      "text": "I&#x27;m looking to see what tools or techniques people are using during development, in the CI CD pipeline and out into production.<p>For example would you survive a log4j style attack, and how.<p>Do you secure development environments against malicious code.<p>If you do web development how do you know the Javascript in production matches that in development.",
      "time": 1639654080,
      "title": "Ask HN: What are you doing to secure your software supply chain?",
      "type": "story"
    }
  ]
}