{
  "stories": [
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 31163335,
      "score": 1,
      "time": 1650940127,
      "title": "The oldest person, a Japanese woman, dies at 119",
      "type": "story",
      "url": "https://www.npr.org/2022/04/25/1094630648/the-worlds-oldest-person-japans-kane-tanaka-dies-at-age-119"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31163332,
      "score": 1,
      "time": 1650940099,
      "title": "Elon Musk reaches agreement to acquire Twitter for about $44B",
      "type": "story",
      "url": "https://www.pbs.org/newshour/economy/elon-musk-reaches-agreement-to-acquire-twitter-for-about-44-billion"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 31163329,
      "score": 1,
      "time": 1650940075,
      "title": "Chevrolet Spark (2012-2016) EV batteries no longer available",
      "type": "story",
      "url": "https://www.autoblog.com/2022/04/25/chevy-spark-ev-batteries-unavailable/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31163321,
      "score": 1,
      "time": 1650939980,
      "title": "Elon Musk pledges to 'authenticate all humans' as he buys Twitter for $44B",
      "type": "story",
      "url": "https://www.businessinsider.com/what-will-elon-musk-change-about-twitter-2022-4"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 31163318,
      "score": 1,
      "time": 1650939945,
      "title": "Elon Musk bought Twitter. Here's what he says he'll do next",
      "type": "story",
      "url": "https://www.npr.org/2022/04/25/1094671225/elon-musk-bought-twitter-plans"
    },
    {
      "by": "crackercrews",
      "descendants": 0,
      "id": 31163317,
      "score": 1,
      "time": 1650939936,
      "title": "Supreme Court Temporarily Allows Elite School’s New Admissions Rules",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/25/us/politics/supreme-court-admissions-race.html"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31163308,
      "score": 1,
      "time": 1650939865,
      "title": "A realtime acoustic bird classification system for the Raspberry Pi",
      "type": "story",
      "url": "https://github.com/mcguirepr89/BirdNET-Pi"
    },
    {
      "by": "erichocean",
      "descendants": 0,
      "id": 31163300,
      "score": 2,
      "text": "According to customer service, all customers are limited to buying four Audio CDs <i>per week</i> from any seller, in any combination, on Amazon.com.<p>This is not a per-title nor a per-seller limit, nor is it related to Amazon Prime or FREE Shipping or whatever. It&#x27;s across all titles and sellers, in any combination (including 3rd party sellers), with any form of shipping, Prime or non-Prime.<p>Talking with customer support over the weekend, they claimed it was an error and would be fixed today, but as of this posting, the four-per-week purchase limit is still active.<p>The specific error message (during checkout) is:<p><i>There was a problem with some of the items in your order (see below for more information):<p>You have reached the purchase limit for this item. We have changed the quantity to the maximum allowable.<p>If the quantity has been set to 0, please delete the item (below the item details) to proceed.</i><p>More info on the problem here: https:&#x2F;&#x2F;forums.stevehoffman.tv&#x2F;threads&#x2F;anyone-having-troubles-ordering-from-amazon.1143712&#x2F;<p>The problem first appeared on Friday, April 22, 2022.",
      "time": 1650939809,
      "title": "Tell HN: Amazon.com is limiting purchases of Audio CDs to four-per-week",
      "type": "story"
    },
    {
      "by": "guuggye",
      "descendants": 0,
      "id": 31163279,
      "score": 2,
      "text": "I work remotely from home on a company provided laptop.<p>This may be excessively paranoid, but are there any privacy or security concerns with connecting it directly to my home network?<p>For example, isn&#x27;t there a risk that the company could be monitoring the traffic on my local network?<p>Also I regularly do work through an employer managed Google Workspace account that&#x27;s logged in on the system.<p>Given that my public IP is one way that Google targets and matches devices, that could mean that the recommended YouTube content for my corporate Google account would match my private and personal account that is associated with the same IP. And it should be possible for an administrator at my company to access my work account and see that profile.<p>Are there any recommendations for combating those concerns?<p>I can&#x27;t use a personal VPN client on my company laptop, and it&#x27;s not possible for me to move away from my personal Google account or work from a cafe.",
      "time": 1650939541,
      "title": "Ask HN: Do you connect your work computer directly to your home network?",
      "type": "story"
    },
    {
      "by": "RhysU",
      "descendants": 0,
      "id": 31163272,
      "score": 1,
      "text": "There are a gazillion posts about Bash replacements recently. Why?<p>I trust that you know how to make coffee. I don&#x27;t care if it&#x27;s drip, French press, Keurig, etc. I know that you will come to work with all the caffeine that you need.<p>Maybe we should geek out on beans sometimes but seriously why micro-optimize on beans? They&#x27;re a means not an end.<p>Similarly, shell is (to crib off Cyc) the whitespace not the content. There&#x27;s no there there. We might as well discuss 86 vs 87 octane or the size of a shipping container.",
      "time": 1650939431,
      "title": "What's with the Bash replacements?",
      "type": "story"
    }
  ]
}