{
  "stories": [
    {
      "by": "goshx",
      "descendants": 0,
      "id": 28656041,
      "score": 2,
      "time": 1632602452,
      "title": "Bandwidth is experiencing a major outage",
      "type": "story",
      "url": "https://status.bandwidth.com"
    },
    {
      "by": "CSDude",
      "descendants": 0,
      "id": 28656038,
      "score": 2,
      "time": 1632602418,
      "title": "Kubernetes Event Exporter",
      "type": "story",
      "url": "https://github.com/opsgenie/kubernetes-event-exporter"
    },
    {
      "by": "throwawaysea",
      "descendants": 1,
      "id": 28656005,
      "kids": [
        28656024
      ],
      "score": 1,
      "time": 1632602166,
      "title": "What the ‘Smart Money’ Knows About China’s Evergrande Crisis",
      "type": "story",
      "url": "https://www.wsj.com/articles/what-the-smart-money-knows-about-chinas-evergrande-crisis-11632495602"
    },
    {
      "by": "freecodeio",
      "descendants": 0,
      "id": 28656000,
      "score": 1,
      "time": 1632602118,
      "title": "Contenteditable vs. designMode – What is the difference?",
      "type": "story",
      "url": "https://answerly.io/blog/contenteditable-vs-designmode-what-is-the-difference/"
    },
    {
      "by": "matt_d",
      "descendants": 0,
      "id": 28655962,
      "score": 2,
      "time": 1632601743,
      "title": "Visualizing Control Flow Graphs",
      "type": "story",
      "url": "https://repository.arizona.edu/handle/10150/661593"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28655958,
      "score": 1,
      "time": 1632601721,
      "title": "The Fascinating Physics of Bowling",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=aFPJf-wKTd0"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 28655957,
      "score": 1,
      "time": 1632601707,
      "title": "Sea level rise is unstoppable. Here's how to adapt",
      "type": "story",
      "url": "https://www.fastcompany.com/90622038/sea-level-rise-is-unstoppable-cities-can-adapt-but-they-need-to-think-bigger"
    },
    {
      "by": "winternett",
      "descendants": 0,
      "id": 28655953,
      "score": 1,
      "text": "Solid funding, thorough testing, failover, and developer skill should always be prioritized in mission critical software-driven systems. There is tons of room for failure in complex solutions. There is also a growing trend in software being manipulated beyond it&#x27;s actual functional purpose into other categories like generating up-sales, in app purchases, and to embedding advertising into key features... Corruption of software functionality is a key threat to software stability in mission critical software, and in systems that people truly depend on and if it&#x27;s not addressed and regulated properly, it will spiral out of control in the future.<p>This applies not just to mission critical systems, it applies to cell phones that you pay for, televisions and cars people buy as consumers, because they are often mission critical to us.<p>With every single project, control, security, cost cutting, and tight delivery deadlines pose a constant threat to reliability and utility of all software-driven solutions.<p>Within IT companies, there are constantly well paid people working as decision makers that proclaim &quot;I&#x27;m not really a technical person&quot; on a regular basis.<p>Frankly, if you&#x27;re working in a position that has critical impact on technology-based decisions, YOU SHOULD ALREADY BE A TECHNICALLY AWARE PERSON, OR QUICKLY LEARN HOW TO BE A WELL INFORMED TECHNICAL PERSON, or step aside and let an accountable technical person serve in that role.<p>Key decision making in software based development needs to more carefully involve people dedicated to understanding technical implications, constraints, and potential outcomes in addition now more than ever in addition to other skills like human psychology, marketing, risk management, and within the many other roles filled within mission critical IT organizations.<p>Also, an emphasis on budget management by moves like undercutting developer salaries for key roles and&#x2F;or pressuring less experienced developers to write mission critical production code is fine for entertainment-based social media apps perhaps, but not for pacemakers... Some systems, especially those with the highest level of critical importance need to be exempt from cost cutting and should never tolerate a temporary fix&#x2F;workaround&#x2F;and that &quot;not a technical person&quot; culture.",
      "time": 1632601690,
      "title": "The dirty secret about software reliability that no company wants to admit",
      "type": "story"
    },
    {
      "by": "Blueskytech",
      "descendants": 0,
      "id": 28655947,
      "score": 1,
      "time": 1632601649,
      "title": "Chrome extension to close tabs to the left",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/close-tabs-to-the-left/gggbppgpkegkkgjpmlbedgbmgomecmoj"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28655943,
      "score": 1,
      "time": 1632601624,
      "title": "32-bit Console hardware and the reshaping of the industry",
      "type": "story",
      "url": "https://mechafatnick.co.uk/2021/09/25/complete-carnage-32-bit-console-hardware-and-the-reshaping-of-the-industry/"
    }
  ]
}