{
  "stories": [
    {
      "by": "alexmingoia",
      "descendants": 0,
      "id": 30359363,
      "score": 1,
      "time": 1645015956,
      "title": "Show HN: Read the Internet all at once – news, RSS, and newsletters on one page",
      "type": "story",
      "url": "https://sumi.news"
    },
    {
      "by": "usrme",
      "descendants": 0,
      "id": 30359358,
      "score": 1,
      "time": 1645015890,
      "title": "Thousands of NPM accounts use email addresses with expired domains",
      "type": "story",
      "url": "https://therecord.media/thousands-of-npm-accounts-use-email-addresses-with-expired-domains/"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 30359352,
      "score": 1,
      "time": 1645015848,
      "title": "Dystopian robot dog is the latest in history of US-Mexico border surveillance",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2022/feb/16/robot-dogs-us-mexico-border-surveillance-technology"
    },
    {
      "by": "smusamashah",
      "descendants": 1,
      "id": 30359330,
      "kids": [
        30359365
      ],
      "score": 1,
      "text": "Note taking apps are popular on HN and OneNote is rarely given any credit.<p>I take notes at work mostly where we use confluence for all the documentation.\nConfluence was slow so I tried local plain-text apps including Typora, Obsidian etc. and abandoned them quickly because I couldn&#x27;t easily link to confluence documents. And if I am trying to write a new document, its not easy to dump thoughts in these tools.<p>Tried confluence again and while it allows copy pasting images etc. its hard to format code, its very slow to modify something and again its hard to dump your thoughts in a confluence document in a hope to refactor into final document in multiple iterations.<p>OneNote is what I have settled on finally. New OneNote design silly like all new Microsoft software  https:&#x2F;&#x2F;answers.microsoft.com&#x2F;en-us&#x2F;msoffice&#x2F;forum&#x2F;all&#x2F;how-to-move-onenote-sections-back-to-top-of&#x2F;4db9afb6-e8fb-49aa-b374-d357bd9b75f1\nEvery page is like a free-form white board on which you can write or draw or paste images anywhere. Also, the text in screenshots becomes searchable. I was on a complicated task recently for past few months and OneNote was a huge help. I made a section dedicated to my task. Then made pages freely as I needed in there e.g. a page for architecture I was trying to figure out, another page for things i tried to test memory usage, a page for configurations etc etc. \nLeast resistance to put the idea down is <i>very important</i> and I couldn&#x27;t have managed all this information without OneNote this easily.<p>You cannot write the final document in OneNote though. It&#x27;s not built for that I think. But its a great assistant to jot your ideas down somewhere. I don&#x27;t think there is anything else as flexible and as resistance free to dump information while still keeping it manageable. Give this a try if you can.",
      "time": 1645015736,
      "title": "Tell HN: Give OneNote another try for note taking or dumping thoughts",
      "type": "story"
    },
    {
      "by": "lando2319",
      "descendants": 0,
      "id": 30359322,
      "score": 1,
      "time": 1645015690,
      "title": "San Francisco recalls 3 members of city’s school board",
      "type": "story",
      "url": "https://apnews.com/article/coronavirus-pandemic-health-education-race-and-ethnicity-racial-injustice-d22ee9c5175904885d41e149775102a5"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 30359312,
      "score": 1,
      "time": 1645015600,
      "title": "U.S. clears way for automakers to install smart headlights",
      "type": "story",
      "url": "https://www.axios.com/cars-smart-headlights-nhtsa-6686a7aa-ee4a-4fa4-a764-ccb58b96d40d.html"
    },
    {
      "by": "istvan-kreisz",
      "descendants": 1,
      "id": 30359310,
      "kids": [
        30359323
      ],
      "score": 1,
      "time": 1645015591,
      "title": "Show HN: Hide and Seek, only virtual and you can hide anywhere in the world",
      "type": "story",
      "url": "https://hideandseek.world/"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30359309,
      "score": 1,
      "time": 1645015590,
      "title": "Perl code that is syntactically correct only on Fridays",
      "type": "story",
      "url": "https://github.com/jwilk/perl-friday"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30359303,
      "score": 1,
      "time": 1645015525,
      "title": "Hire software dev talent from Afghanistan",
      "type": "story",
      "url": "https://yagankar.com/"
    },
    {
      "by": "Liriel",
      "descendants": 0,
      "id": 30359276,
      "score": 1,
      "time": 1645015315,
      "title": "ECS: Under the Hood",
      "type": "story",
      "url": "https://habr.com/en/post/651921/"
    }
  ]
}