{
  "stories": [
    {
      "by": "akbarnama",
      "descendants": 0,
      "id": 28654046,
      "score": 1,
      "time": 1632585090,
      "title": "New Study Finds the Human Metabolism Has Four Stages",
      "type": "story",
      "url": "https://barbend.com/human-metabolism-four-stages-study/"
    },
    {
      "by": "SMAAART",
      "descendants": 0,
      "id": 28654043,
      "score": 1,
      "text": "From the outside in, people think that I&#x27;ve got it going on. I grew up poor, and I was an awkward shy kid, and - a few decades later - by any measure I am living the American dream. With hard work I put myself through college at night, survived divorce, lay-off, and more.<p>When I was 18 almost as a joke I started a little FUN project that ended up as a mildly successful company with a small exit.  Then I follow the college-job route, here and there thinkering with entrepreneurship, but while I was not longer socially shy&#x2F;awkward my ventures often were relinquished to lists, or just acquiring a domain (at one point I owned &gt;200 domains), or building a sucky web site, or filing a provisional patent, but I was &quot;marketing shy&quot;, I never put myself out there, or at times I hid behind some excuse that I know now they were lame AF: &quot;I need 20 million dollars in VC to make it happen&quot;.<p>Plot twist, once I got a meeting with a VC I blew it off with an excuse.<p>Even at work as a VP I have the &quot;failure to launch&quot; syndrome, I promise projects and then I don&#x27;t follow through because I get stuck somewhere where my Anxiety cripples me (often when some deliverable involves managing other people).<p>Nobody believes me, not even my therapist. Let alone my dozens of ex-girlfirends; but here I am. Planing planning planning and never seeing a venture through. Insecurity, impostor&#x27;s syndrome, lack of self-esteem... I got it all.<p>I am my own worst enemy.<p>I need to get through my own BS.<p>Any pointers? Leads? Books (I&#x27;ve read so many)?<p>Or should I just be my own life&#x2F;accountability coach and kich my own derriere? Should I just move to a crappy little dark place and deprive myself of food and any pleasures&#x2F;necessities (become hungry by choice) and have my ventures be the ones providing my income, and not my job&#x2F;savings?",
      "time": 1632585063,
      "title": "I don't have crippling Anxiety, but Anxiety is crippling me",
      "type": "story"
    },
    {
      "by": "nullbytesmatter",
      "descendants": 0,
      "id": 28654032,
      "score": 1,
      "text": "I am a solo developer with a SaaS product that makes a substantial amount of money ($500k+). I think it has gotten to the point where I could use more clever accounting to save money and leverage the income better.<p>How can I find a solid accountant (preferably someone that works remote, and has experience with SaaS businesses)?",
      "time": 1632584996,
      "title": "Ask HN: As a solo developer, how can I find a solid accountant?",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28654031,
      "score": 1,
      "time": 1632584989,
      "title": "A gravestone missing for almost 150 years was being used to make fudge",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_05e05f1cb97d4320541a47f2d5bcb524"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28654014,
      "score": 1,
      "time": 1632584900,
      "title": "Godot Engine – Multiplayer in Godot 4.0: RPC syntax, channels, ordering",
      "type": "story",
      "url": "https://godotengine.org/article/multiplayer-changes-godot-4-0-report-2"
    },
    {
      "by": "CosmicShadow",
      "descendants": 0,
      "id": 28654011,
      "score": 1,
      "time": 1632584884,
      "title": "Two Canadians Freed as US Strikes Plea Deal with China",
      "type": "story",
      "url": "https://www.theglobeandmail.com/politics/article-michael-kovrig-michael-spavor-coming-home-after-us-strikes-plea-deal/"
    },
    {
      "by": "spapas82",
      "descendants": 0,
      "id": 28654003,
      "score": 1,
      "time": 1632584835,
      "title": "A forward and reverse proxy primer for the layman",
      "type": "story",
      "url": "https://spapas.github.io/2021/09/21/layman-proxy-primer/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28654000,
      "score": 1,
      "time": 1632584813,
      "title": "'We will not boost our way out of this pandemic,' CDC director says",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_f750dd374ac2d86611cd7550cf8938f7"
    },
    {
      "by": "michaelhoffman",
      "descendants": 0,
      "id": 28653978,
      "score": 1,
      "time": 1632584680,
      "title": "Reproducibility standards for machine learning in the life sciences",
      "type": "story",
      "url": "https://www.nature.com/articles/s41592-021-01256-7?error=cookies_not_supported&code=ba0a74c6-0e8b-4233-a654-4ce0a669549e"
    },
    {
      "by": "y4m4b4",
      "descendants": 0,
      "id": 28653970,
      "score": 1,
      "time": 1632584642,
      "title": "Show HN: MinIO introduces Multi-site active active replication",
      "type": "story",
      "url": "https://blog.min.io/minio-multi-site-active-active-replication/"
    }
  ]
}