{
  "stories": [
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30572598,
      "score": 1,
      "time": 1646519375,
      "title": "Event horizons are tunable factories of quantum entanglement",
      "type": "story",
      "url": "https://phys.org/news/2022-03-event-horizons-tunable-factories-quantum.html"
    },
    {
      "by": "sytelus",
      "descendants": 0,
      "id": 30572583,
      "score": 1,
      "time": 1646519210,
      "title": "Volodymyr Zelensky survives three assassination attempts in days",
      "type": "story",
      "url": "https://www.thetimes.co.uk/article/zelensky-survives-three-assassination-attempts-in-days-xnstdfdfc"
    },
    {
      "by": "bradvl",
      "descendants": 0,
      "id": 30572581,
      "score": 1,
      "time": 1646519194,
      "title": "MasterCard suspends all services in Russia",
      "type": "story",
      "url": "https://www.mastercard.com/news/press/2022/march/mastercard-statement-on-suspension-of-russian-operations/"
    },
    {
      "by": "aheilbut",
      "descendants": 0,
      "id": 30572551,
      "score": 1,
      "time": 1646518987,
      "title": "Journal ignores reports of obvious image duplication b/c “software” misses it",
      "type": "story",
      "url": "https://twitter.com/MicrobiomDigest/status/1499845489612578823"
    },
    {
      "by": "homarp",
      "descendants": 0,
      "id": 30572543,
      "score": 2,
      "time": 1646518915,
      "title": "How Does This End?",
      "type": "story",
      "url": "https://carnegieendowment.org/2022/03/03/how-does-this-end-pub-86570"
    },
    {
      "by": "TbobbyZ",
      "descendants": 0,
      "id": 30572536,
      "score": 1,
      "text": "President Putin, I’m a Czech-American born from Czechoslovakian refugees that fled before Prague Spring. I hold citizenship in both Czechia and America. On behalf of my generation from both nations, I want us to learn from our shared history and bring prosperity to the future generations of our great nations. Only technology will save us, if we allow it.<p>I love my American and Slavic cultures. Both have room for improvement. Even though I grew up in America, I still lived with poverty, a homeless father, a broken home, and all the stresses that come to from being a man, husband, and father. I work hard to not repeat the mistakes of my fathers. It’s not easy.<p>I turned 34 at the end of February. Reading about the recent events in Eastern Europe broke my dreams to be a part of the future of Europe. I have goals to live in Europe half the year each year with my wife and 3 children (who also have Czechia and American citizenship). We want to partake of our Slavic heritage and bring prosperity to it.<p>Considering how Covid has changed the world, I’ve doing exceptionally well. I recently celebrated my 12 year wedding anniversary. I purchased my first home in fall of last year. Living in the digital age has allowed me to move to the upper middle class and be home with my family during the entire journey. Even before the pandemic I was working 100% remote as a business owner and software architect. The fortune I have in these unusual times has allowed my wife to choose to stay home to teach and raise our 3 children.<p>Even with the current problems in both America and Europe,  my wife and I still want 3 more children. We want our children to live in a future where they can live peacefully and freely between both of their homelands. We can make the future generations of our nations mutual prosperous, President Putin. My experience and expertise are freely available. We can start making a future we all want, today.<p>Please join in this message: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=lDu6SQjiZ-I",
      "time": 1646518869,
      "title": "Dear President Putin, from a Czech-American Software Architect",
      "type": "story"
    },
    {
      "by": "zdgeier",
      "descendants": 0,
      "id": 30572518,
      "score": 1,
      "time": 1646518735,
      "title": "2008 Google Chrome Comic",
      "type": "story",
      "url": "https://www.google.com/googlebooks/chrome/"
    },
    {
      "by": "M2Ys4U",
      "descendants": 0,
      "id": 30572514,
      "score": 3,
      "time": 1646518726,
      "title": "Yandex Warns Debt May Affect Ability to Continue Operating",
      "type": "story",
      "url": "https://www.searchenginejournal.com/yandex-warns-debts-may-have-material-adverse-impact/440957/"
    },
    {
      "by": "mcyc",
      "descendants": 0,
      "id": 30572485,
      "score": 2,
      "time": 1646518529,
      "title": "How BART on the Golden Gate Bridge Died: A New History",
      "type": "story",
      "url": "https://seungylee14.substack.com/p/how-bart-on-the-golden-gate-bridge"
    },
    {
      "by": "LittleMoveBig",
      "descendants": 0,
      "id": 30572478,
      "score": 1,
      "time": 1646518478,
      "title": "U.S. debates how to aid possible Zelenskyy government in exile",
      "type": "story",
      "url": "https://www.nbcnews.com/politics/congress/us-debates-aid-possible-zelenskyy-government-exile-rcna18817"
    }
  ]
}