{
  "stories": [
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 28190679,
      "score": 1,
      "text": "Let me summarize it without any sugarcoating<p>USSR had USA mired in Viet Nam<p>So USA created a Viet Nam for the Soviets by funding, arming, and training fighters against them (Afghan Arabs, Mujahideen) and drawing them into a costly occupation to drain their resources<p>https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Operation_Cyclone<p>Afterwards, we went in and spent 20 years and trillions doing exactly what the Soviets were doing, but on our own dime.<p>This past decade, the CIA even did studies and confirmed that arming rebels hardly ever does anything good, but we continued to do it anyway (latest was in Syria).<p>https:&#x2F;&#x2F;www.nytimes.com&#x2F;2014&#x2F;10&#x2F;15&#x2F;us&#x2F;politics&#x2F;cia-study-says-arming-rebels-seldom-works.amp.html<p>The million refugees that Lebanon accepted from Syria have now contributed to an economic crisis of epic proportions in that country, which FOX News is almost completely not covering — certainly silent relative to Venezuela — because it can’t blame socialists so it lacks the “moral” cautionary tale for its viewers.<p>For being hesitant to get involved in Syria, Obama’s adminstration was called “weak” and Republicans said they would “prefer Putin was our president” while the media and Congress chastized him for not “leading” in that region. The entire issue was framed around whether USA is the “indispensable nation” and Obama had to literally cite destroying peaceful alliances and making countries “barely hold together” in the face of rebels with American weaponry. Mind you, the point of citing all was NOT to highlight a negative for the people on the ground, but as evidence for domestic consumption to portray us as “leading” more than Russia in that region. As if our ego and “indispensability” was the most important thing. The framing is quite dystopian:<p>https:&#x2F;&#x2F;m.youtube.com&#x2F;watch?v=wib6cLJ99yY<p>Meanwhile, the very groups (including Al Nusra Front) creating the instability and civil war came to be as a result of our actions in Afghanistan and later in Iraq.<p>USA and Saudi Arabia funneled billions to rebel groups who later founded Al Qaieda, and simply left them there with no oversight. Hillary Clinton pretty much openly admitted it:<p>https:&#x2F;&#x2F;www.dailymotion.com&#x2F;video&#x2F;x2f52cp<p>Then that created massive security problems for USA and Saudi governments, with some of the largest terrorist attacks on their own soil coming from the same Wahhabi groups they funded. So they started the war on terror, passed the PATRIOT act, and put in place a lot of mechanisms to erode civil liberties at home (indefinite detention etc.) torture nearby (enhanced interrogation etc.) and for invading and occupying countries thousands of miles away (including the Authorization to Use Military Force) which the executive branch of the US government alone pretty much used to go into many countries without Congress authorizing war, relying on that AUMF even a decade later in conflicts seemingly unrelated to 9&#x2F;11<p>https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Authorization_for_Use_of_Military_Force_of_2001<p>We put together some international coalitions, destabilized Iraq by ousting all Sunnis we had installed earlier, turned Libya into a total failed state by outsting the Gaddafi government, and the Wahhabi ideology spread to other countries via Boko Haram (Nigeria, for example), and ISIS (Iraq Syria and many neighboring countries).",
      "time": 1629049532,
      "title": "Ask HN: Is the US foreign policy insane?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28190664,
      "score": 1,
      "time": 1629049444,
      "title": "Tocqueville21",
      "type": "story",
      "url": "https://tocqueville21.com/"
    },
    {
      "by": "notRobot",
      "descendants": 0,
      "id": 28190655,
      "score": 2,
      "time": 1629049394,
      "title": "Afghan President Ghani relinquishes power, Taliban form interim gov't",
      "type": "story",
      "url": "https://www.dailysabah.com/world/asia-pacific/afghan-president-ghani-relinquishes-power-taliban-form-interim-govt"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 28190652,
      "score": 1,
      "time": 1629049377,
      "title": "European Flood Awareness System",
      "type": "story",
      "url": "https://www.efas.eu/en"
    },
    {
      "by": "beervirus",
      "descendants": 0,
      "id": 28190650,
      "score": 1,
      "time": 1629049356,
      "title": "China winner of Olympics (after claiming medals won by Hong Kong, Taiwan, Macau)",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-9894045/China-declares-winner-2020-Olympics-claiming-medals-won-Hong-Kong-Taiwan.html"
    },
    {
      "by": "eplanit",
      "descendants": 0,
      "id": 28190648,
      "score": 1,
      "time": 1629049335,
      "title": "Siberian wildfires dwarf all others on Earth combined",
      "type": "story",
      "url": "https://www.livescience.com/siberian-wildfire-smoke-reaches-north-pole.html"
    },
    {
      "by": "richardanaya",
      "descendants": 0,
      "id": 28190643,
      "score": 1,
      "time": 1629049307,
      "title": "Pine64 announces PineNote 60hz eInk reader with quartz64 CPU",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=AwMKfQtSXPE"
    },
    {
      "by": "silexia",
      "descendants": 1,
      "id": 28190636,
      "kids": [
        28190653
      ],
      "score": 3,
      "text": "Remember “Never forget”?<p>The phrase that everyone was parroting after 9&#x2F;11?<p>The Taliban just defeated the United States and has retaken Afghanistan, just in time for the 20th anniversary of 9&#x2F;11.<p>Defeated might be a strong word…. America simply gave up. Our policy of pacifism in nation building has never worked. When we conquer territory, we owe it to the people in the territory to give them our full commitment – make them a state, pay for it by auctioning off property internationally, and use harsh Roman strategies to put down continued resistance.<p>The Afghanistan people who supported us; those who fought alongside American troops and translated for Americans, and the little girls and women who believed our promises that they could get an education and have rights, are now being raped and murdered.",
      "time": 1629049264,
      "title": "Ask HN: Never Forget?",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 28190620,
      "score": 1,
      "time": 1629049135,
      "title": "Interoception: The sense that shapes well-being",
      "type": "story",
      "url": "https://www.theguardian.com/science/2021/aug/15/the-hidden-sense-shaping-your-wellbeing-interoception"
    },
    {
      "by": "null_object",
      "descendants": 0,
      "id": 28190619,
      "score": 1,
      "time": 1629049133,
      "title": "Spain launches inquiry after dams drained for profit during drought",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/aug/15/spain-launches-inquiry-after-dams-drained-for-profit-amid-heatwave"
    }
  ]
}