{
  "stories": [
    null,
    {
      "by": "surfTide",
      "descendants": 0,
      "id": 31191992,
      "score": 1,
      "text": "A couple of years ago I had an idea for a gender slider. The basic idea is that instead of a dropdown different specific values, you slide along a slider between two values. So in it&#x27;s most basic form, you&#x27;d slide between male and female, somewhere inbetween is where you are.<p>Initially I thought this would be a one-time entry thing. But then I thought that it be nice to track gender over time. I.e. sliding each day over a month would give you an average of how you felt that month.<p>Then I realised that if other people were going to do this, then I didn&#x27;t want to know what their average meant nor their gender nor anything else. So I decided to replace the specific gender values with colours. So you slide between two colors, their meaning is up to you, and at the end of the month you get a &quot;average&quot; colour.<p>Ironically, it seems, that there is a real need for such a slider. A child of a brother-of-different-mother would love to use it but because it&#x27;s not an app (i.e. iOS dungeon ..err.. market or Google cave ..err... store) she won&#x27;t use it (its just a web page - in fact a large SVG). Basically it needs to be a button on the home screen (I know, browser can put bookmarks on screens but try explaining that to a non-tech teenager).<p>I really don&#x27;t want to get into building apps for android nor iOS, so if anyone is interested in doing this, then please do.<p>Monetisation would definitely not come from selling data (even that isn&#x27;t possible in the current implementation [1]). A couple of things I was thinking about was perhaps being able to change colour would a premium feature. Or perhaps using a circle, i.e. 2 dimensional sliding could also be premium.<p>But of course, the premium feature that would be the cash cow would be an edit button ... if you forget to slide on a particular day, then you pay to change history.<p>Anyway a semi tongue-in-cheek write up[1] and the webapp[2] are both available. Thanks for reading this far!<p>[1]=https:&#x2F;&#x2F;gregorius.rippenstein.art&#x2F;works&#x2F;slider\n[2]=https:&#x2F;&#x2F;gender.sldr.in",
      "time": 1651151260,
      "title": "Ask HN: Gender Slider iOS/Google App",
      "type": "story"
    },
    {
      "by": "andrenth",
      "descendants": 0,
      "id": 31191989,
      "score": 1,
      "time": 1651151247,
      "title": "'Al Qaeda is on our side': How Obama-Biden team empowered terrorists in Syria",
      "type": "story",
      "url": "https://mate.substack.com/p/al-qaeda-is-on-our-side-how-obama"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31191972,
      "score": 2,
      "time": 1651151145,
      "title": "Covid is spreading in deer. What does that mean for the pandemic?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01112-4"
    },
    {
      "by": "mzs",
      "descendants": 0,
      "id": 31191951,
      "score": 1,
      "time": 1651150996,
      "title": "How Paxlovid came to be: From the germ of an idea to a vital tool against Covid",
      "type": "story",
      "url": "https://www.statnews.com/2022/04/28/how-paxlovid-came-to-be-from-the-germ-of-an-idea-to-a-vital-tool-against-covid/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31191943,
      "score": 1,
      "time": 1651150944,
      "title": "A Field Guide to Elephpants",
      "type": "story",
      "url": "https://afieldguidetoelephpants.net/"
    },
    {
      "by": "davidwguymon",
      "descendants": 0,
      "id": 31191934,
      "score": 1,
      "time": 1651150891,
      "title": "Strategically Thinking Through Coding Exercises",
      "type": "story",
      "url": "https://www.blog.bydave.dev/strategically-thinking-through-coding-exercises"
    },
    {
      "by": "marcoshira",
      "descendants": 0,
      "id": 31191920,
      "score": 1,
      "time": 1651150829,
      "title": "Fusion of Blockchain and IoT – Blockchain IoT Applications in Real Life 2022",
      "type": "story",
      "url": "https://www.suffescom.com/blog/blockchan-iot-applications-in-real-life/"
    },
    {
      "by": "mathieubordere",
      "descendants": 0,
      "id": 31191916,
      "score": 1,
      "text": "Hi all,<p>I&#x27;m interested in anything (computer) science &#x2F; mathematics related, however, I&#x27;m a Software Engineer and would not consider myself a scientist or mathematician.<p>I currently have subscriptions for &quot;Nature&quot; and &quot;Communications of the ACM&quot; but I won&#x27;t renew my subscriptions for neither of them. Most of the articles in Nature are too specialized for me, only the first part of the magazine is readable, where the gist of the content is presented. CACM on the other side seems a bit too high-level and I have the impression it&#x27;s mainly about A.I. and inclusiveness these days (nothing against these topics, just don&#x27;t want to read about it all the time).<p>Any recommendations?",
      "time": 1651150813,
      "title": "Ask HN: Which magazines do you recommend?",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31191913,
      "score": 2,
      "time": 1651150809,
      "title": "Angela Merkel’s nuclear folly fuelled Putin’s ambitions in Ukraine",
      "type": "story",
      "url": "https://www.theglobeandmail.com/opinion/article-angela-merkels-nuclear-folly-fuelled-putins-ambitions-in-ukraine/"
    }
  ]
}