{
  "stories": [
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31071562,
      "score": 1,
      "text": "With all the constructive feedback I&#x27;ve been getting from you folks lately, I&#x27;m starting to build some confidence in my own abilities while learning about the things that I may not be so good at [1]. Specifically, other than the writing that I will be posting on my personal website, I think I will very much enjoy building a community around my work, where I will get to engage regularly with like-minded people, exchange advice and perspectives, maybe do some AMAs etc.<p>So the question is, what&#x27;s a good platform for engaging with an audience&#x2F;community?<p>Right now I&#x27;m thinking Discord as my primary choice, as it&#x27;s very low-barrier and super chill, and it doesn&#x27;t place too much pressure on me to have to continually produce content (I work slowly). I can just take in people&#x27;s comments and stories and rants etc etc and offer my take on it all. It&#x27;ll also be nice to see the whole community in one place! (In fact I&#x27;ve already set one up if anyone&#x27;s interested! [2]).<p>I&#x27;m also curious about using Twitch for live-streams. The people I know in real life seem to like my positive-presence, so maybe this is a good place to show my face and be more friendly and personal. But I&#x27;ve never used Twitch ever (aside from seeing them on youtube), so I&#x27;m completely unfamiliar with how to set things up there, how much learning curve there is (eg do I need to edit videos?), whether the audience expect regular content, what types of features are available, etc.. If anyone&#x27;s familiar with this I&#x27;d love to hear all about it!<p>Other options include Substack&#x2F;newsletters, but these aren&#x27;t so interactive, and definitely puts pressure on me having to produce often. Then there&#x27;s Youtube in general, which is an interesting place to upload more cleaned up material (eg a video essay), but I&#x27;m also worried about it taking more work as I&#x27;m not a video-maker.<p>Anyway, would love to get some feedback from you awesome smart people!!<p>Thank you so much in advance!<p>Sam<p>[1]: Just last night I posted a thread about giving people advice (https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31065876), but after trying to help several people, I realized I&#x27;m not very good at giving people <i>specific</i> advice tailored to their unique situations (even though I would love to!). I&#x27;m much better at sharing general&#x2F;philosophical advice or insights from observing general phenomena -- hence why I have enjoyed writing so far. Sorry folks!<p>[2]: Discord invite link! https:&#x2F;&#x2F;discord.gg&#x2F;ZZN3v7Usdx",
      "time": 1650293967,
      "title": "Ask HN: What's a good platform for engaging with an audience/community?",
      "type": "story"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31071556,
      "score": 1,
      "time": 1650293943,
      "title": "Mercury Thrusters: A Worldwide Disaster Averted Just in Time",
      "type": "story",
      "url": "https://hackaday.com/2022/04/18/mercury-thrusters-a-worldwide-disaster-averted-just-in-time/"
    },
    {
      "by": "croh",
      "descendants": 0,
      "id": 31071540,
      "score": 1,
      "time": 1650293886,
      "title": "GitHub suspends accounts of Russian devs at sanctioned companies",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/github-suspends-accounts-of-russian-devs-at-sanctioned-companies/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31071529,
      "score": 1,
      "time": 1650293848,
      "title": "Evolving Cumulative Layout Shift in web tooling",
      "type": "story",
      "url": "https://web.dev/cls-web-tooling/"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 31071524,
      "score": 1,
      "time": 1650293838,
      "title": "Old Playstation forces evacuation of Boston airport terminal",
      "type": "story",
      "url": "https://www.universalhub.com/2022/crappy-old-playstation-forces-evacuation-terminal"
    },
    {
      "by": "croh",
      "descendants": 0,
      "id": 31071517,
      "score": 1,
      "time": 1650293810,
      "title": "DeFi Project Beanstalk Loses $182M in Flash Loan Attack",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-04-18/defi-project-beanstalk-loses-182-million-in-flash-loan-attack"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 31071471,
      "score": 2,
      "time": 1650293634,
      "title": "Which Computational Universe Do We Live In?",
      "type": "story",
      "url": "https://www.quantamagazine.org/which-computational-universe-do-we-live-in-20220418/"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31071464,
      "score": 1,
      "time": 1650293603,
      "title": "Useful Mental Models",
      "type": "story",
      "url": "https://www.scotthyoung.com/blog/2020/06/08/best-mental-models/"
    },
    {
      "by": "juancolamendy",
      "descendants": 0,
      "id": 31071463,
      "score": 1,
      "text": "Understanding customer feelings is very important for growing your business.<p>Sentiment analysis helps to get insights and enhance the customer experience.<p>There are NLP algorithms that helps you to classify people&#x27;s emotions.<p>1&#x2F; Naïve Bayes<p>This technique is based on Bayes Theorem, a conditional probability model.<p>Basically, a Naïve Bayes classifier assumes the features are independent.<p>2&#x2F; SVM<p>It classifies text by finding a line or plane that separates data points into different groups.<p>These points are called support vectors.<p>This algorithm is good at dealing with noisy data.<p>3&#x2F; Deep learning<p>It is used very successful in classifying text.<p>Common algorithms are Recurrent neural networks (RNNs), Word2Vec, GloVe, and Convolutional Neural Networks (CNN).<p>4&#x2F; Transformers<p>This architecture is a breakthrough in NLP.<p>Helps computers understand text and its context.<p>Very good at doing natural language processing than other kinds of neural networks.<p>Start using them for text classification with @huggingface pre-trained models.<p>Do you have real-world experience using those algorithms for sentiment analysis?\nPlease, share your thoughts or provide a feedback?<p>Origina article =&gt; https:&#x2F;&#x2F;pxla.xyz&#x2F;ZkL6Prp",
      "time": 1650293597,
      "title": "Show HN: NLP algorithms for real-world sentiment analysis",
      "type": "story"
    },
    {
      "by": "joydeepdg",
      "descendants": 0,
      "id": 31071409,
      "score": 1,
      "time": 1650293404,
      "title": "HackerRank in Haskell (2018)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=h_D4P-KRNKs&list=PLguYJK7ydFE4aS8fq4D6DqjF6qsysxTnx"
    }
  ]
}