{
  "stories": [
    {
      "by": "skissane",
      "descendants": 1,
      "id": 28163527,
      "kids": [
        28163529
      ],
      "score": 2,
      "time": 1628813363,
      "title": "Boeing’s Starliner Launch Could Face Delay of Several Months",
      "type": "story",
      "url": "https://www.wsj.com/articles/boeing-s-starliner-launch-could-face-delay-of-several-months-11628808399"
    },
    {
      "by": "Overton-Window",
      "descendants": 0,
      "id": 28163449,
      "score": 1,
      "time": 1628812902,
      "title": "House of Representatives raises max salary for staff to nearly $200k",
      "type": "story",
      "url": "https://www.axios.com/house-max-salary-e64b6328-1f14-4fc3-a541-04dddec74db7.html"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 28163376,
      "score": 2,
      "time": 1628812485,
      "title": "Infection-enhancing antibodies recognize both the original and Delta",
      "type": "story",
      "url": "https://doi.org/10.1016/j.jinf.2021.08.010"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 28163293,
      "score": 1,
      "time": 1628812083,
      "title": "The Most Complex Pop Song of All Time",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ZnRxTW8GxT8"
    },
    {
      "by": "DLay",
      "descendants": 0,
      "id": 28163266,
      "score": 2,
      "time": 1628811916,
      "title": "Rumble will pay creators who ‘challenge the status quo’",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2021/08/12/rumble-video-gabbard-greenwald/"
    },
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 28163223,
      "score": 4,
      "text": "I need to get out of development, I fucked my career over and it seems that digging myself out of the hole is going to be nearly as difficult as just doing something else.<p>Unfortunately most other things I find myself interested in are blocked by expensive credentials, however I’m curious about security.<p>I know “security” is a ridiculously generic description, that can range from guys making high level decisions, to people managing security infrastructure, or testers, security researchers, etc. I’m mostly interested in knowing what the easiest transition from being a developer is.<p>For a little context on my particular situation, I’ve mostly worked in non-tech, enterprise type environments. For at least part of my career, I’ve worked adjacent to security, mostly assisting with implementing security features for various compliance frameworks (think HIPAA, PCI, SOX, etc.) but am not intimately familiar with the frameworks myself. I have a rough idea of simple vulnerabilities, though the only ones I’ve ever exploited&#x2F;patched in the wild we’re boring XSS+session hijacking vulnerabilities. I also have a <i>very</i> (emphasis on that) surface level understanding of reverse engineering along with familiarity with some tools.<p>What sort of roles do you think I could transition too in the security field, quickly and how bad would the pay cut be? I’m not actually compensated that great at the moment, but I was hoping to get my comp closer in line to the development industry prior to my realization.I figure boring is fine if I can make a decent salary and have chance of breaking in.<p>Additionally, what does one actually need to do to switch fields. I’ve consistently had issues getting past the screening stage for development roles given my past experience is mostly irrelevant to what I was applying to, I imagine it’s worse when going to a whole new field.<p><i>As a random side note, I’m unlikely to be eligible for a TS clearance, so that may limit my options.</i>",
      "time": 1628811708,
      "title": "Ask HN: What security roles are easiest for a developer to transition to",
      "type": "story"
    },
    {
      "by": "throwaway85238",
      "descendants": 0,
      "id": 28163177,
      "kids": [
        28163424
      ],
      "score": 3,
      "text": "So I&#x27;ve been freelancing&#x2F;working fully remotely for the last 10+ years, mostly because it allowed me to make 2x more than I could on site in my local area, and it required less effort than going to an office every day.<p>I loved the freedom of it, but now in my mid-30s, I&#x27;m starting to notice how detrimental it was to my social life, skills and status. While I&#x27;m doing OK among other devs, whenever I meet with a doctor, a lawyer, a corporate person, heck even my coach, I&#x27;m envious of how eloquent, confident and composed they are. In contrast with them, I feel like a weirdo, mumbling and struggling to come up with anything interesting to say.<p>A younger me used to think that work was only supposed to support your &quot;passions&quot;, but it turned out these tend to get old, and at some point it&#x27;s your job that really shapes you the most, determines your lifestyle, and your position in the flock. If you&#x27;re an IT nerd spending better part of your life in a cave, well, that&#x27;s who you are, no matter how much you make, what car you drive, etc.<p>Even with hobbies and going out on your own, it&#x27;s really hard to break out of your bubble. They&#x27;re not nearly a replacement for and everyday forced and purposeful interaction with different types of people, especially of a higher social status than yours. Forced on you, but even more importantly, also on them ;)<p>Anyhow, not looking for any specific advice, just wondering if anyone had a similar experience, or maybe a success story to share.",
      "time": 1628811477,
      "title": "Ask HN: How do you maintain a satisfying lifestyle when working remotely?",
      "type": "story"
    },
    {
      "by": "Geekette",
      "descendants": 0,
      "id": 28163165,
      "score": 2,
      "time": 1628811407,
      "title": "New credit apps target young, debt-laden consumers, offer less protection",
      "type": "story",
      "url": "https://www.latimes.com/politics/story/2021-08-11/sleek-new-credit-apps-target-a-young-generation-already-drowning-in-debt"
    },
    {
      "by": "hncurious",
      "descendants": 11,
      "id": 28163164,
      "kids": [
        28163338,
        28163504,
        28163505,
        28163311,
        28163347,
        28163324,
        28163409,
        28163290,
        28163297,
        28163336,
        28163439
      ],
      "score": 16,
      "time": 1628811397,
      "title": "Women are struggling to find men who make as much money as they do",
      "type": "story",
      "url": "https://nypost.com/2019/09/25/women-are-struggling-to-find-men-who-make-as-much-money-as-they-do/"
    },
    {
      "by": "wilhelm____",
      "descendants": 0,
      "id": 28163082,
      "score": 1,
      "text": "With the explosion in research on all things transformers, it seemed there was a need to have a single table to distill the &quot;tl;dr&quot; of each paper&#x27;s contributions relative to each other. Here is what I got so far: https:&#x2F;&#x2F;github.com&#x2F;will-thompson-k&#x2F;tldr-transformers . Would love feedback - and feel free to contribute too :)",
      "time": 1628810942,
      "title": "Show HN: \"TL;DR\" on Recent Transformers Papers",
      "type": "story"
    }
  ]
}