{
  "stories": [
    {
      "by": "kith",
      "descendants": 0,
      "id": 28344800,
      "score": 1,
      "time": 1630220515,
      "title": "Custom forms that send the results to webhooks",
      "type": "story",
      "url": "https://flowhooks.com"
    },
    {
      "by": "ArlenBales",
      "descendants": 0,
      "id": 28344797,
      "score": 1,
      "text": "Strange title I know, let me explain.. I&#x27;ve had this idea for a company for the last few weeks.<p>Finding proper medical care in the U.S. is probably the worst experience in life. I think healthcare insurance companies intentionally make it obtuse because they don&#x27;t actually want you to get medical care. After all, they&#x27;re a for-profit business.<p>I have severe chronic pain in my leg from a sports injury. The process of finding medical care worked like this:<p>1. Visit primary care doctor about specific symptoms (chronic pain).<p>2. Doctor can&#x27;t figure it out, refers me to specialist.<p>3. Specialist can&#x27;t figure it out, refers me to another specialist.<p>4. Repeat step #3 a couple more times.<p>5. Specialist refers me to &quot;Pain Management&quot; clinic. I am now on pain drugs for the rest of my life, instead of actually, you know, fixing the problem.<p>Ideally, #2 or #3 results in a diagnosis and treatment that yields positive results.<p>In my case, every doctor I encountered did not have the domain knowledge, experience, or skills to solve my problem. In a city of hundreds of providers, it&#x27;s not surprising this can happen. Specifically, every doctor I met had little to no background in sports medicine and most of their patients were elderly and not athletes. I needed a sports medicine specialist, a physician who treats professional sports teams for example.<p>Long story short, after a lot of research and reaching out, I eventually found a sports medicine provider who specialized in injuries of my nature, and they were able to get me on a path that has resulted in an actual diagnosis and treatment plan.<p>But fucking hell did it take forever (14 months after first symptoms). I&#x27;m not trying to dirty physicians, but like any other profession, I&#x27;m not naive enough to think every physician knows how to solve every problem just because they got a medical degree. They may simply have never encountered your problem before and don&#x27;t know how to fix it, or don&#x27;t know who to properly refer you to, or hell -- they&#x27;re just bad doctors. Every field has bad people at their job, doctors sure as hell aren&#x27;t exempt.<p>Enter Sherlock Holmes. Or, a more apt medicine analogy: House from House M.D. Fictional characters that solve mysteries in short order because of their amazing knowledge and observational skills far beyond the average person.<p>Imagine a company that is Sherlock Holmes. You have an injury, but instead of going through the nightmare yourself of finding a medical provider, you go to this company and pay them to investigate and find you the most suitable medical provider.<p>The above process becomes:<p>1. Go to company and explain my situation and symptoms.<p>2. Company investigates all providers in my area that are best suited to diagnosing and treating me. Company would actually reach out by phone or email and aggressively determine the expertise, background, and qualifications of each provider for treating and diagnosing my symptoms.<p>3. Company contacts me and gives me their ideal provider candidate. I contact provider and setup an appointment.<p>4. I get diagnosed and treated. Fin.<p>When and how this company gets paid I don&#x27;t know, perhaps before they investigate, or perhaps after.<p>Still, I sure as well wouldn&#x27;t hesitate to spend hundreds on such a service, considering I&#x27;ve spent at least $10k in time&#x2F;energy&#x2F;money trying to find proper medical care myself.",
      "time": 1630220424,
      "title": "Ask HN: Is there a Sherlock Holmes service for finding the best medical care?",
      "type": "story"
    },
    {
      "by": "Apocryphon",
      "descendants": 0,
      "id": 28344792,
      "score": 1,
      "time": 1630220280,
      "title": "Racer Trash",
      "type": "story",
      "url": "https://racertrash.com/"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 28344744,
      "score": 1,
      "time": 1630219703,
      "title": "Three Super-Massive Black Holes Merging Together in Our Nearby Universe",
      "type": "story",
      "url": "https://pib.gov.in/PressReleasePage.aspx?PRID=1749437"
    },
    {
      "by": "Lammy",
      "descendants": 0,
      "id": 28344729,
      "score": 1,
      "time": 1630219427,
      "title": "Street lighting has detrimental impacts on local insect populations",
      "type": "story",
      "url": "https://advances.sciencemag.org/content/7/35/eabi8322"
    },
    {
      "by": "privatdozent",
      "descendants": 0,
      "id": 28344706,
      "score": 2,
      "time": 1630219005,
      "title": "Degrowth: Solving the Climate Impasse by Magical Thinking",
      "type": "story",
      "url": "https://brankomilanovic.substack.com/p/degrowth-solving-the-impasse-by-magical"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 28344684,
      "score": 2,
      "time": 1630218774,
      "title": "Are Viruses Alive? (2008)",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/are-viruses-alive-2004/"
    },
    {
      "by": "parsecs",
      "descendants": 0,
      "id": 28344677,
      "score": 4,
      "time": 1630218680,
      "title": "Big company tale: six months for a list and a button",
      "type": "story",
      "url": "https://rachelbythebay.com/w/2021/08/28/big/"
    },
    {
      "by": "downandout",
      "descendants": 0,
      "id": 28344666,
      "score": 1,
      "text": "I am working with a small team of people on a highly optimized GPU-based parallelized shortest path algorithm.  AWS accounts are not by default allowed to use GPU instances, so you must request them.  During the week-long approval process for that, they said that the card that one of my partners put on the account was not acceptable for whatever reason (despite that their system said it had been validated), so I put my own card on it.  After a week of going in circles with them, we were finally able to get approved to spend a whopping 75 cents per hour on a GPU instance.<p>Less than 24 hours after starting the instance, I received an email from AWS.  The card I added to our team AWS account was also on my personal Amazon account, which is how they found my email address.  They said that they believed my card had been stolen and fraudulently added to an AWS account, and that they had proactively suspended the AWS account.  The email also said that if it was actually authorized, to simply reply to the email and the account would be reinstated.<p>I replied within 15 minutes of that email saying that it was authorized and to reinstate the account.  I have replied several times since then, as I have received no reply nearly 24 hours later, and the AWS account is still suspended.<p>Does anyone have a good way of getting ahold of these people?",
      "time": 1630218566,
      "title": "Ask HN: How to Fix Erroneous AWS Suspension?",
      "type": "story"
    },
    {
      "by": "ChrisArchitect",
      "descendants": 0,
      "id": 28344635,
      "score": 1,
      "time": 1630218124,
      "title": "Arctic Adventure: A lost 1981 TRS-80 adventure game by Harry McCracken",
      "type": "story",
      "url": "https://www.arctic81.com/"
    }
  ]
}