{
  "stories": [
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 31132790,
      "score": 1,
      "time": 1650708341,
      "title": "ARM64 Is Tier 1",
      "type": "story",
      "url": "https://freebsdfoundation.org/past-issues/arm64-is-tier-1/"
    },
    {
      "by": "jacob_rezi",
      "descendants": 0,
      "id": 31132788,
      "score": 1,
      "time": 1650708329,
      "title": "Show HN: Resume Editor",
      "type": "story",
      "url": "https://www.rezi.ai/rezi-ai-resume-editor"
    },
    {
      "by": "MeteorMarc",
      "descendants": 0,
      "id": 31132782,
      "score": 1,
      "time": 1650708158,
      "title": "Digital services act: political agreement",
      "type": "story",
      "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_22_2545"
    },
    {
      "by": "cunidev",
      "descendants": 0,
      "id": 31132781,
      "score": 1,
      "time": 1650708138,
      "title": "Macintosh IIsi-Hosted Website",
      "type": "story",
      "url": "http://www.danamania.com/"
    },
    {
      "by": "helij",
      "descendants": 0,
      "id": 31132780,
      "score": 2,
      "text": "Today the Ruble is worth more than 2 months ago before the Russian invasion of Ukraine. Can any economists chime in and explain why this is happening? Inflation in Russia looks to be high but similar to the one in Lithuania for example. Ukraine inflation is lower which in my dilettante view doesn&#x27;t make sense.<p>It looks like it&#x27;s business as usual and war doesn&#x27;t really have any impact on global economy at the moment. Prices were going up before Feb anyway.<p>So what&#x27;s going on?",
      "time": 1650708052,
      "title": "Ask HN: Why did Ruble stabilize and what's going on?",
      "type": "story"
    },
    {
      "by": "kovac",
      "descendants": 0,
      "id": 31132779,
      "score": 1,
      "text": "I&#x27;m looking for text books in the field of natural language understanding. I&#x27;m looking for theory&#x2F;algorithms using classical theory (first-order logic, statistical models) rather than machine learning. One example book I&#x27;m going through right now is Natural Language Understanding by James Allen. Looking for similar books. Thanks.",
      "time": 1650708007,
      "title": "Ask HN: Book recommendations for Natural Language Understanding",
      "type": "story"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 31132778,
      "score": 2,
      "time": 1650707981,
      "title": "HMRC locks out taxpayers from their online accounts",
      "type": "story",
      "url": "https://www.theguardian.com/money/2022/apr/23/hmrc-locks-out-taxpayers-from-their-online-accounts"
    },
    {
      "by": "yashg",
      "descendants": 0,
      "id": 31132773,
      "score": 1,
      "text": "This is an experience with India&#x27;s largest public bank, SBI. SBI takes security very seriously. Let&#x27;s see how<p>One day I log into my online banking account. \nI enter my username and password and captcha - OTP on mobile verification\nYour password has expired, set new password - OTP verification\nYour password has been changed, thank you. Please login again. I login again - OTP verification<p>You just verified me once by sending me the OTP after my first login, why do you need another OTP for setting the new password which you are forcing on me in the &quot;same session&quot; and after I change the password, why are you forcing me to login again?<p>What happens next, will leave you exhausted.<p>The system shows me my obfuscated email id and asks me if I want to verify if that is still my email id. (Because normal people change their email id every month right?)\nI click yes. (If I don&#x27;t they may stop my Net Banking access anytime in future. With SBI anything is possible)\nFirst enter profile password. (It&#x27;s different from login password)\nThen you confirm the email id.\nNext, they send an OTP to your email, the OTP is inside a password protected PDF! (I kid you not)\nPassword of the PDF file? YOUR MOBILE NUMBER! So you open the PDF, get the OTP, it&#x27;s an 8 digit number which can&#x27;t be pasted in the OTP field. (You don&#x27;t say!) You enter email OTP<p>Next step, one more confirmation\n - Via debit card\n - Physically visiting the branch\n - OTP on mobile via SMS\nSo I choose the least cumbersome option - OTP\nEnter the OTP received on phone and finally the Machine Overlords of SBI are satisfied and confirm my email id.<p>World may still be grappling with Two Factor Authentication, SBI has perfected the art of N-Factor Authentication.<p>At some point in time, some bureaucrat came across a Captcha and an OTP and immediately fell in love. &quot;I want this&quot; he said. And then it was implemented at every stage in every government website. Often multiple times, because &quot;security&quot;.",
      "time": 1650707910,
      "title": "OTP hell – when security is bureaucratized",
      "type": "story"
    },
    {
      "by": "niklasmtj",
      "descendants": 0,
      "id": 31132769,
      "score": 5,
      "time": 1650707808,
      "title": "Google, Meta and others have to explain algorithms under new EU legislation",
      "type": "story",
      "url": "https://www.theverge.com/2022/4/23/23036976/eu-digital-services-act-finalized-algorithms-targeted-advertising"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31132758,
      "score": 2,
      "time": 1650707632,
      "title": "Cancer patients seriously ill after struggle to access COVID-19 drugs in England",
      "type": "story",
      "url": "https://www.theguardian.com/society/2022/apr/05/covid-patients-seriously-ill-after-struggling-to-access-antivirals-in-england"
    }
  ]
}