{
  "stories": [
    {
      "by": "bonkerbits",
      "descendants": 0,
      "id": 30346000,
      "score": 1,
      "time": 1644931182,
      "title": "Why Augmented Reality (not virtual reality) will be the Gateway to the Metaverse",
      "type": "story",
      "url": "https://www.businesstoday.in/opinion/columns/story/heres-why-augmented-reality-will-be-the-gateway-to-metaverse-322518-2022-02-14"
    },
    {
      "by": "FpUser",
      "descendants": 0,
      "id": 30345948,
      "score": 1,
      "text": "Long story short I needed to buy some software for business from Google for Android. Not sure what exactly I would need I&#x27;ve decided to buy play store gift card from Amazon. Few moments after completing a purchase I received an email that my account is suspended and I would need to click this and do that to get it reinstated. Clicking ended up in never ending circle. So I called them - the guy grilled me for a while and then said that he has to submit all data to higher ups and can do nothing himself and I should wait for email. At this point I was pretty much fuming.<p>To their credit few hours later email did come telling that account has been reinstated. I did have to enter credit cards again though.<p>Phew. I went to internets and read about the subject and people say that buying gift card is considered scum &#x2F; laundering and is ground for account suspension.<p>Now comes a question - if the above is true then why bother selling those in a first place?",
      "time": 1644930862,
      "title": "Buy from Amazon and Get Suspended",
      "type": "story"
    },
    {
      "by": "Bhurn00985",
      "descendants": 0,
      "id": 30345929,
      "score": 2,
      "text": "How do you start a company together with people that are living in multiple countries ? We are all based in the EU, but relocation is unfortunately not an option. What company forms would be applicable in such a case or how do you structure such a situation ?<p>Any pointers in the right direction would be much appreciated !",
      "time": 1644930650,
      "title": "Ask HN: Starting a company with people that are not in the same country?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30345921,
      "score": 2,
      "time": 1644930585,
      "title": "Amazon Elastic File System Update – Sub-Millisecond Read Latency",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/amazon-elastic-file-system-update-sub-millisecond-read-latency/"
    },
    {
      "by": "Jimmc414",
      "descendants": 0,
      "id": 30345886,
      "score": 12,
      "time": 1644930280,
      "title": "Trudeau announces intention to freeze bank accounts of protestors",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-60383385"
    },
    {
      "by": "edent",
      "descendants": 1,
      "id": 30345880,
      "kids": [
        30345983
      ],
      "score": 2,
      "time": 1644930228,
      "title": "The Existential Terror of LinkedIn",
      "type": "story",
      "url": "https://shkspr.mobi/blog/2022/02/the-existential-terror-of-linkedin/"
    },
    {
      "by": "avianes",
      "descendants": 0,
      "id": 30345879,
      "score": 2,
      "time": 1644930226,
      "title": "Remote Memory-Deduplication Attacks [pdf]",
      "type": "story",
      "url": "https://arxiv.org/abs/2111.08553"
    },
    {
      "by": "taubek",
      "descendants": 3,
      "id": 30345859,
      "kids": [
        30345969,
        30345955,
        30345894
      ],
      "score": 3,
      "text": "I&#x27;ve never worked in open space office. I&#x27;ve had a home office, I&#x27;ve shared office with 2 to 5 other people but I&#x27;ve never worked at open space office.<p>Mostly I&#x27;ve listen about bad sides of open space. Are there any good sides? Did covid situation change the open space? Do they still exist?",
      "time": 1644930110,
      "title": "Ask HN: Does anyone like to work in open space?",
      "type": "story"
    },
    {
      "by": "mmaunder",
      "descendants": 0,
      "id": 30345842,
      "score": 1,
      "text": "https:&#x2F;&#x2F;techcrunch.com&#x2F;2020&#x2F;08&#x2F;11&#x2F;mozilla-lays-off-250&#x2F;<p>The official internal message started with: \nWe are making significant changes at Mozilla Corporation today. Pre-COVID, our plan for 2020 was a year of change: building a better internet by accelerating product value in Firefox, increasing innovation, and adjusting our finances to ensure financial stability over the long term. We started with immediate cost-saving measures such as pausing our hiring, reducing our wellness stipend and cancelling our All-Hands. But COVID-19 has accelerated the need and magnified the depth for these changes. Our pre-COVID plan is no longer workable. We have talked about the need for change — including the likelihood of layoffs — since the spring. Today these changes become real.\n—-snip—-<p>But every tech biz I know has benefited from Covid except rare cases like AirBnB that has direct exposure to the travel industry.<p>During Covid there has been a big move towards remote work and remote earning, and surely Mozilla would have benefited?<p>I’ve also noticed a trend over the past two years of using Covid as a justification when the real reason is something less comfortable. Covid has become the new “to spend time with their family”.<p>So did Covid really affect Mozilla that quickly and that badly that they had to ditch a quarter of their team? This happened in August 2020.",
      "time": 1644930038,
      "title": "Why did Mozilla lay of 250 after a previous round of layoffs?",
      "type": "story"
    },
    {
      "by": "theaeolist",
      "descendants": 0,
      "id": 30345833,
      "score": 1,
      "time": 1644929932,
      "title": "A library for effect handlers in C++",
      "type": "story",
      "url": "https://github.com/maciejpirog/cpp-effects"
    }
  ]
}