{
  "stories": [
    {
      "by": "small_proton",
      "descendants": 1,
      "id": 28294773,
      "kids": [
        28294775
      ],
      "score": 1,
      "time": 1629837900,
      "title": "RIP Charlie Watts",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/24/arts/music/charlie-watts-dead.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 28294730,
      "score": 1,
      "time": 1629837672,
      "title": "38M Records Were Exposed Online–Including Contact-Tracing Info",
      "type": "story",
      "url": "https://www.wired.com/story/microsoft-power-apps-data-exposed/"
    },
    {
      "by": "mrzool",
      "descendants": 0,
      "id": 28294711,
      "score": 1,
      "time": 1629837585,
      "title": "The Art of Tending to Oneself",
      "type": "story",
      "url": "https://www.are.na/blog/the-art-of-tending-to-oneself"
    },
    {
      "by": "yashg",
      "descendants": 1,
      "id": 28294618,
      "kids": [
        28294747
      ],
      "score": 1,
      "text": "If you build it, they will come is a fallacy. I know it. I have built several products that have bombed. My latest flop is an HTML to PDF conversion API called PDFMark.<p>The pundits and coaches say you should always do your market research before writing a single line of code. And I think I have done market research. I had once built a cloud-based photo backup application after surveying existing users of my photo watermarking application. Many of them said they would use a cloud-based photo backup application. I had thousands of photographers using my photo watermarking tool and they were the obvious target users of a photo backup tool. Yet hardly anyone signed up for the product. When I conducted a survey and I asked them if photo backup was a problem and if they would use a cloud backup service they said yes, but when it actually came to signing up for the service and shelling out real money, not many people did.<p>I am lost as to what do I even ask the prospective customers anymore? Henry Ford said if I had asked customers what do they want they would have said a faster horse. I am confused about the whole market research business.<p>New trend on Twitter is about building a community before you build a product. I have followed several community builders. And I quickly realised, people who have thousands of followers are mostly good at gaining more followers. Those who are building real products have no time to post 20 times a day to build a Twitter following.<p>When I look back, I realise that many of the products I have built simply because I thought building them would be cool. My most successful product – the photo watermark software uMark ($4K monthly) is one such product. I had built it because I thought it would be cool to build. I had no use of that product myself, I did not ask anyone if they needed such a product, I did not check if there was anything available in the market already. I did not waste time thinking a name or designing a logo. The first version was built over a weekend and released on a free download site. It got 1500 downloads on the first day.<p>I really don’t know if market research and community building and all that is as important as it is made out to be. After that first product I have had no such luck with any other products.<p>What do you guys think? What kind of market research did you do before launching? How did you decide which product to build?",
      "time": 1629837144,
      "title": "Ask HN: How did you decide which product to build?",
      "type": "story"
    },
    {
      "by": "dsr12",
      "descendants": 0,
      "id": 28294574,
      "score": 1,
      "time": 1629836945,
      "title": "Colab Pro+ Features, Kaggling on Colab, and Cloud GPU Platforms",
      "type": "story",
      "url": "https://heads0rtai1s.github.io/2021/08/24/colab-plus-kaggle-cloud-gpu/"
    },
    {
      "by": "andreyk",
      "descendants": 1,
      "id": 28294561,
      "kids": [
        28294625
      ],
      "score": 1,
      "time": 1629836901,
      "title": "AI as a Hype Tool",
      "type": "story",
      "url": "https://www.skynettoday.com/editorials/ai-hype"
    },
    {
      "by": "dmart",
      "descendants": 0,
      "id": 28294534,
      "score": 2,
      "time": 1629836805,
      "title": "SQLModel – SQL Databases in FastAPI",
      "type": "story",
      "url": "https://github.com/tiangolo/sqlmodel"
    },
    {
      "by": "hu3",
      "descendants": 0,
      "id": 28294531,
      "score": 2,
      "time": 1629836793,
      "title": "Don't waste time on heroic death marches",
      "type": "story",
      "url": "https://www.computerworld.com/article/3630653/dont-waste-time-on-heroic-death-marches.html"
    },
    {
      "by": "defli",
      "descendants": 5,
      "id": 28294524,
      "kids": [
        28294642,
        28294525
      ],
      "score": 1,
      "time": 1629836782,
      "title": "I made a book quotes app,swipe for like or dislike like Tinder. Feedbacks pls",
      "type": "story",
      "url": "https://apps.apple.com/tr/app/swipewise-smart-book-quotes/id1581004412"
    },
    {
      "by": "benbreen",
      "descendants": 1,
      "id": 28294508,
      "kids": [
        28294690
      ],
      "score": 1,
      "time": 1629836698,
      "title": "When the Big Bang Was Just a Theory",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/24/books/review/flashes-of-creation-paul-halpern.html"
    }
  ]
}