{
  "stories": [
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 30672278,
      "score": 1,
      "time": 1647265183,
      "title": "Chemosensory Pleasure Scale: Measuring Hedonic Smell and Taste Capacities",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/31201424/"
    },
    {
      "by": "velmu",
      "descendants": 0,
      "id": 30672268,
      "score": 1,
      "time": 1647265136,
      "title": "Putin Signs Bill: Leased Aircraft Belong to Russian Airlines",
      "type": "story",
      "url": "https://airwaysmag.com/airlines/putin-signs-bill-leased-aircraft/"
    },
    {
      "by": "anondevvie",
      "descendants": 0,
      "id": 30672246,
      "score": 2,
      "text": "I haven&#x27;t had exposure working with lower-level network programming and have been trying to find a learning path to do so.  Books on network programming discuss entry-level concepts for networking protocols but aren&#x27;t instructive about writing networked applications.  For instance, I don&#x27;t understand flow control mechanisms and how to use them effectively and I haven&#x27;t written my own custom binary protocols nor a message parser.  I think I&#x27;m looking for a syllabus for a network programming course that doesn&#x27;t exist, or I&#x27;m just not aware of.  Suggestions are welcome!",
      "time": 1647265027,
      "title": "Ask HN: Learning Network Programming",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30672123,
      "score": 2,
      "time": 1647264237,
      "title": "Tup – a file-based build system for Linux, OS X, and Windows",
      "type": "story",
      "url": "https://gittup.org/tup/"
    },
    {
      "by": "valar_m",
      "descendants": 3,
      "id": 30672117,
      "kids": [
        30672276,
        30672248,
        30672266
      ],
      "score": 22,
      "text": "My new kink is responding to recruiters who ask for my current salary by asking them for the total comp for the role they&#x27;re recruiting for.<p>It&#x27;s purely for entertainment, of course - I won&#x27;t even meet with them after that. A company that asks your current salary is asking to find out how little they can pay you. They are seeking to create and exploit a superior bargaining position that results from unequal knowledge - they know how much you make and how much they pay, but you only know one of those things. And that&#x27;s how they treat you <i>before</i> you start working there.<p>I doubt that companies who do this can be persuaded to stop.<p>But if I were a VC, it might give me pause to learn that a company in my portfolio does this. Knowing that the make or break comes down to people - or at least suspecting that might matter - might make me worry about a company that rejects valuing the one single resource that decides the whole ballgame.<p>Anywho, my nonsense aside, the object of the game is to see how many messages a recruiter will respond with before giving an actual compensation number. An unsolicited phone call counts as two messages. My current record is 7.",
      "time": 1647264192,
      "title": "Tell HN: Recruiters asking for current salary may respectfully fuck off",
      "type": "story"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 30672090,
      "score": 1,
      "time": 1647264039,
      "title": "“Scalping”: stockpiling popular products and reselling them at a higher price",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-60709207"
    },
    {
      "by": "the__prestige",
      "descendants": 0,
      "id": 30672079,
      "score": 1,
      "time": 1647263983,
      "title": "Missing ancient Greek inscriptions solved by Artificial Intelligence",
      "type": "story",
      "url": "https://greekreporter.com/2022/03/10/greek-inscriptions-ai-deep-neural-networks/"
    },
    {
      "by": "taubek",
      "descendants": 1,
      "id": 30672076,
      "kids": [
        30672097
      ],
      "score": 1,
      "time": 1647263974,
      "title": "State of WordPress Security in 2021",
      "type": "story",
      "url": "https://patchstack.com/whitepaper/the-state-of-wordpress-security-in-2021/"
    },
    {
      "by": "n1000",
      "descendants": 0,
      "id": 30672074,
      "score": 2,
      "time": 1647263962,
      "title": "BetterTouchTool Notch Bar for macOS",
      "type": "story",
      "url": "https://docs.folivora.ai/docs/1200_notch_bar.html"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 30672052,
      "score": 2,
      "time": 1647263855,
      "title": "Slobbing out and giving up: why are so many people going ‘goblin mode’?",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2022/mar/14/slobbing-out-and-giving-up-why-are-so-many-people-going-goblin-mode"
    }
  ]
}