{
  "stories": [
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31628788,
      "score": 1,
      "time": 1654413835,
      "title": "Should we protect nature for its own sake? For its economic value?",
      "type": "story",
      "url": "https://theconversation.com/should-we-protect-nature-for-its-own-sake-for-its-economic-value-because-it-makes-us-happy-yes-180302"
    },
    {
      "by": "vector_spaces",
      "descendants": 0,
      "id": 31628780,
      "score": 1,
      "time": 1654413723,
      "title": "Dubious Ways to Compute the Zeros of a Polynomial",
      "type": "story",
      "url": "https://blogs.mathworks.com/cleve/2016/06/27/19-dubious-ways-to-compute-the-zeros-of-a-polynomial/"
    },
    {
      "by": "ejahijagic",
      "descendants": 0,
      "id": 31628778,
      "score": 1,
      "text": "TLDR; I&#x27;m not linking any of my stories, profile, etc... Asking for advice and suggestions only, regarding blogging and Medium in particular. I had 35k views in the last 30 days, should I keep writing and pursue the partnership program? How much money can I earn?<p>So, a few weeks back I wanted to start my blog on various tech and software engineering topics. I wondered why not start writing on Medium, and I&#x27;ll see how it goes there, before starting my own website, blog, app, etc.\nSo, I started writing on the 15th of May. My first reads started bumping on the 19th of May.<p>I got much more response than I expected, so I&#x27;m wondering whether am I doing good, or if this is just average for new writers.<p>Stats<p>In the last 16 days - I&#x27;ve got 34k Views - 10.3k Reads - 310 Fans\nI have a total of 171 Followers.<p>I wrote 22 Stories - some of these were just experimental stories, so they didn&#x27;t perform at all. Most have under 400 Views, some even less than 50 Views.<p>I have some Stories, that perform really well or relatively well.\nOne with 18.1k Views\nOne with 7k Views\nTwo With ~2-3k Views\nOne with 1k Views<p>Personally, I didn&#x27;t expect this amount of views and reads even remotely. I average around a 40% read-view ratio.<p>Publications\nThe two stories with the most Views (7k, and 18k) were performing really well even before I submitted them to a publication.<p>The other ones started performing well once I published them in smaller publications, which have ~10-50k followers. The decent one with 7k, I later on published in one quite big publications on tech., on Medium. It has 650k followers.<p>The story with 18k views is published in a small publication, but still generates a decent amount of views, reads, and comments daily.<p>Topics<p>I mostly write on the same topics, and my audience is mostly evenly distributed between these tags: Programming, Technology, Software Engineering, Science, and Data Science.<p>I&#x27;m just throwing this out here, as another stat.<p>--<p>So Reddit, can you please give me some feedback on this?<p>How good are my stats? I&#x27;m unfortunately not from a country that Medium supports for their Partnership program. Stripe is however supported, so I know there are some workarounds - but is it worth it in my case? I heard it would cost you around $500 on Stripe, to get a business that can then be approved for a partnership or something under those lines.<p>Would that cost be justified? How much could I earn with these stats?<p>Also, what I was planning is to create my own blog, website, and app. I&#x27;m a developer, so I wouldn&#x27;t need to spend a lot of money, except my time, on this. I thought I&#x27;ll start linking my Medium, Blog, and App together, that should increase my reach I think. Is that a good idea?<p>Any suggestions, please. Should I go for Medium partnership workarounds, should I create the blog in combination with Medium, or should I even consider writing only on my blog without going through the Medium partnership hassle?<p>Thanks!",
      "time": 1654413681,
      "title": "New writer asking for advice, regarding writing on Medium. Am I doing it right?",
      "type": "story"
    },
    {
      "by": "moconnor",
      "descendants": 1,
      "id": 31628774,
      "kids": [
        31628781
      ],
      "score": 2,
      "time": 1654413598,
      "title": "Every photo I took of a NATO building disappeared from my camera roll",
      "type": "story",
      "url": "https://twitter.com/ethorkel/status/1533202626904350721"
    },
    {
      "by": "ppqq",
      "descendants": 0,
      "id": 31628772,
      "score": 1,
      "text": "I&#x27;m making a list of educational&#x2F;wholesome entertainment resources for children&#x2F;young adults (e.g math&#x2F;logic puzzles, knots, intro programming projects, Sherlock Holmes stories, LotR, growing avacado trees from seed, ant farms, youtube video on building a home, stoic philosophy, how to play the piano, etc).<p>Do you have anything interesting to add that you really enjoyed?<p>Thanks",
      "time": 1654413568,
      "title": "Educational/wholesome entertainment resources for children/young adults",
      "type": "story"
    },
    {
      "by": "kqr",
      "descendants": 0,
      "id": 31628766,
      "score": 1,
      "time": 1654413510,
      "title": "The Metaphysics of Morrowind",
      "type": "story",
      "url": "https://fallingawkwardly.wordpress.com/2010/08/29/the-metaphysics-of-morrowind-part-1/"
    },
    {
      "by": "car_analogy",
      "descendants": 0,
      "id": 31628760,
      "score": 1,
      "time": 1654413448,
      "title": "Masters of the opium trade: the fabulous wealth of the Sassoons",
      "type": "story",
      "url": "https://www.spectator.co.uk/article/masters-of-the-opium-trade-the-fabulous-wealth-of-the-sassoons"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31628740,
      "score": 1,
      "time": 1654413155,
      "title": "The mesmerising murmurations of Europe’s starlings",
      "type": "story",
      "url": "https://www.theguardian.com/artanddesign/2022/jun/05/a-fragment-of-eternity-the-mesmerising-murmurations-of-europes-starlings"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31628737,
      "score": 1,
      "time": 1654413097,
      "title": "Podman is a container engine for developing, managing, and running containers",
      "type": "story",
      "url": "https://podman.io/"
    },
    {
      "by": "rmdoss",
      "descendants": 0,
      "id": 31628733,
      "score": 3,
      "time": 1654413010,
      "title": "Analysis of a large brute force attack campaign against Windows Remote Desktop",
      "type": "story",
      "url": "https://trunc.org/learning/brute-force-attacks-against-windows-remote-desktop"
    }
  ]
}