{
  "stories": [
    null,
    null,
    null,
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 29824580,
      "score": 1,
      "time": 1641482383,
      "title": "Samsung Freestyle portable projector can put Netflix just about anywhere",
      "type": "story",
      "url": "https://www.cnet.com/tech/home-entertainment/samsung-cute-little-freestyle-portable-projector-can-put-netflix-just-about-anywhere/"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 29824562,
      "score": 1,
      "time": 1641482312,
      "title": "Thoughts on being a new data science manager",
      "type": "story",
      "url": "https://alexkgold.space/mfy.html"
    },
    {
      "by": "PTOB",
      "descendants": 0,
      "id": 29824537,
      "score": 1,
      "time": 1641482233,
      "title": "The Crafsman – How to Teach with Beauty and Humor",
      "type": "story",
      "url": "https://www.youtube.com/channel/UCzsjHlc0WRwZYwlinsmtM4w"
    },
    {
      "by": "wglb",
      "descendants": 0,
      "id": 29824523,
      "score": 1,
      "time": 1641482207,
      "title": "Chasing the Night Parrot: The 'Ghost Bird' of Australia's Outback",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/04/science/night-parrot-ghost-bird-australia.html"
    },
    {
      "by": "aphroz",
      "descendants": 0,
      "id": 29824519,
      "score": 1,
      "time": 1641482180,
      "title": "She said he Couldn’t Make a 3D Calculator Game So he Did",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_dTSCxV5KUE"
    },
    {
      "by": "shivajikobardan",
      "descendants": 0,
      "id": 29824513,
      "score": 1,
      "text": "TLDR-: student who feels like doing nothing eg not like to even read a page during some days. Used to happen a lot during exams. Is happening since 15 days, visited doctor, started taking meds. Meds might be doing their work. I need some guidance and advice that I might be missing.<p>1) I am Computer Engineering student and burnout is really a huge issue for me. I keep getting burn out(IDK the exact word for this tbh). I feel exhausted. I feel fed up studying. It feels like a brain fog. I don&#x27;t feel like opening my textbook or watching video. I don&#x27;t want to do anything at all. I instead browse reddit, watch youtube videos to pass my time. I feel so resistant to studying I don&#x27;t have a word for that man. This has been happening to me since last 15 days. I am simply idle. It is not like I don&#x27;t feel fear. Even if I feel fear, I feel like doing nth. I have already consulted doctor and doctor just gives me medicines and nth more. So hope people here will be considerate and give tips independent or dependent my medical conditions. My life really sucks due to this.<p>2) Even now I have been feeling this thing for around 15 days. I went to Psychiatrist and he added proate medicine. Hope that works. But even though it works I still need some advices and guidances as medicines can&#x27;t fix everything.<p>3) It is not like I study 10 hrs everyday. I study 3-5 hrs everyday normally. I even had a vacation where I travelled a lot and had lots of fun. So it is not due to lack of entertainment NOW. but I agree entertainment lacks in my life a lot. I don&#x27;t have any ways to relax my mind as most ways to relax would be expensive like guitar. And it is winter it is really boring to do yoga, stretching and meditation. (I used to do it as well in the past but still got burn out so this is not the reason why I am getting burn out.).<p>4) My medical conditions-: The medicines that I am using are-: 1) Proate 500 2) Zosert 50 3) Sizodon 2<p>5) In the past when I used to get burnout only during exams-: We have 3 days gaps to study during each exam. Our exams last 1 month long And I would finish studying 40% of topics before exams and during exams at least during 2 exams(we would have 5-6-7 exams depending on semester). I would get burnout and fail to do anything during those exams..And I keep failing exams that I have already studied 40% because I can&#x27;t focus during exams. The culture here in Nepal is most students study during those 3 days and pass the exam comfortably. I have improved here as well. In the past, I used to finish studying once and I would not make revision notes so I had to re-read what I have studied all again. But nowadays I make summaries while studying and just revise it. So it is a bit better in this case. But I still get burnout.<p>6) What are hobbies,activities that are not very expensive that I can do in order to prevent myself from being burnout very frequently. I won&#x27;t mind a burnout every 3 month.",
      "time": 1641482168,
      "title": "How do I minimize/prevent AND recover from burnout from studying?",
      "type": "story"
    },
    {
      "by": "trypwire",
      "descendants": 0,
      "id": 29824501,
      "score": 1,
      "time": 1641482107,
      "title": "Creating an equalizer plugin using Elementary and ReactJS",
      "type": "story",
      "url": "https://blog.stijn-kuijper.me/2022/01/05/elementary-blog-post/"
    }
  ]
}