{
  "stories": [
    {
      "by": "miohtama",
      "descendants": 0,
      "id": 31290616,
      "score": 1,
      "time": 1651879767,
      "title": "Putin Cronies Took over Yandex",
      "type": "story",
      "url": "https://meduza.io/en/feature/2022/05/06/toxic-assets"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 31290609,
      "score": 1,
      "time": 1651879693,
      "title": "Environmental Outcomes of the US Renewable Fuel Standard",
      "type": "story",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2101084119"
    },
    {
      "by": "mitchbob",
      "descendants": 0,
      "id": 31290592,
      "score": 1,
      "time": 1651879453,
      "title": "Nose Spray Vaccines Could Quash Covid Virus Variants",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/nose-spray-vaccines-could-quash-covid-virus-variants/"
    },
    {
      "by": "vyrotek",
      "descendants": 0,
      "id": 31290589,
      "score": 1,
      "time": 1651879444,
      "title": "Nvidia Uses Holograms to Shrink the Size of VR Headsets",
      "type": "story",
      "url": "https://vrscout.com/news/nvidia-uses-holograms-to-shrink-the-size-of-vr-headsets/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31290584,
      "score": 1,
      "time": 1651879427,
      "title": "Thinking in Graphs",
      "type": "story",
      "url": "https://graphql.org/learn/thinking-in-graphs/"
    },
    {
      "by": "merlinscholz",
      "descendants": 0,
      "id": 31290566,
      "score": 4,
      "time": 1651879273,
      "title": "UK is over the edge: archive.org blocked at the telecom level",
      "type": "story",
      "url": "https://virtuallyfun.com/wordpress/2022/05/06/uk-is-over-the-edge-archive-org-blocked-at-the-telecom-level/"
    },
    {
      "by": "aireo",
      "descendants": 0,
      "id": 31290561,
      "score": 3,
      "text": "Hello, everyone. I&#x27;m a first-time poster but a long-time reader here.<p>I&#x27;ve started my journey into CS, and I wanted to humbly tap into the collective knowledge and wisdom of HN. (I&#x27;ve seen other people ask questions similar to mine, and I&#x27;ve been repeatedly blown away at the quality and depth of the responses; it&#x27;s wonderful to see.)<p>I recently completed the first semester of a four-semester diploma program in software development. I&#x27;m a mature student, in my mid-30s, and I went back to school because I&#x27;ve always loved technology, and because problem-solving through programming is deeply appealing to me. (Some of what I&#x27;ve read on HN pushed me to this career path, too.)<p>This summer, I want to focus on learning fundamental skills -- mostly technical, but I&#x27;m more than open to soft skills, too -- that will contribute to my success in this program and for my career. However, the amount of stuff out there combined with my inexperience has left me rather overwhelmed. It&#x27;s difficult knowing where to start.<p>I&#x27;d love your feedback on where a novice like me can best focus his efforts. I have a few questions below, but I guess part of my problem is not knowing exactly what to ask other than: what skills, ideas, concepts, or knowledge should I spend my time on?<p>(For some context, my education background is in English Literature. I don&#x27;t have a lengthly or particularly strong background in math or STEM. We ARE learning mathematics for computing and discrete math in our program.)<p>* Some questions *<p>-- In our first semester, we used Python as a gateway language to learn computational thinking and problem-solving. I like Python and want to continue with it, but because we&#x27;re learning C next semester, and because I want to broaden my skills, I started learning C on my own by way of _C Programming: A Modern Approach_, by K. N. King (A fantastic read, btw). An instructor suggested doing both is fine. Do you agree? Or would it be better to focus on just one language?<p>-- It seems to me that algorithms and data structures are foundational skills worth focusing on. Would you agree? If so, what one, two, or three books would you consider (a) required reading and&#x2F;or (b) excellent for beginners? What else in this space would help?<p>-- More generally, what top three to five skills, ideas, concepts, etc. should I be spending time on?<p>-- Any other recommendations &#x2F; advice &#x2F; suggestions &#x2F; words of wisdom?<p>Thank you for considering my inquiry. I&#x27;m deeply grateful for any input you may have!",
      "time": 1651879220,
      "title": "Ask HN: What skills as a CS student should I focus on this summer?",
      "type": "story"
    },
    {
      "by": "ourmandave",
      "descendants": 0,
      "id": 31290436,
      "score": 1,
      "time": 1651878067,
      "title": "The Biggest Crypto Heists of 2022 So Far",
      "type": "story",
      "url": "https://gizmodo.com/bitcoin-cryptocurrency-biggest-heists-2022-so-far-1848883482"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31290421,
      "score": 8,
      "time": 1651877954,
      "title": "The Diminishing Returns of Productivity Culture",
      "type": "story",
      "url": "https://annehelen.substack.com/p/the-diminishing-returns-of-productivity"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 31290411,
      "score": 1,
      "time": 1651877897,
      "title": "AVM (AOM Video Model) the Reference for Next Alliance for Open Media Codec",
      "type": "story",
      "url": "https://gitlab.com/AOMediaCodec/avm"
    }
  ]
}