{
  "stories": [
    {
      "by": "digital55",
      "descendants": 0,
      "id": 31429680,
      "score": 1,
      "time": 1652923977,
      "title": "Will the James Webb Space Telescope Reveal Another Earth?",
      "type": "story",
      "url": "https://www.quantamagazine.org/will-the-james-webb-space-telescope-reveal-another-earth-20220518/"
    },
    {
      "by": "JacobHenner",
      "descendants": 0,
      "id": 31429679,
      "score": 1,
      "time": 1652923952,
      "title": "Red Hat Enterprise Linux 9.0 GA Now Officially Available",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=RHEL-9.0-GA-Official"
    },
    {
      "by": "daenz",
      "descendants": 0,
      "id": 31429672,
      "score": 1,
      "text": "We&#x27;re eventually going to have a Mars colony. Is there any prior art that we can look to for a likely system of governance? Will it inherit the constitution of the founding country?<p>Throughout history, it seems there is a huge opportunity to improve things when you can start fresh in a new place. Will we do that with Mars?",
      "time": 1652923866,
      "title": "Ask HN: What will the Mars government be?",
      "type": "story"
    },
    {
      "by": "b8",
      "descendants": 0,
      "id": 31429545,
      "score": 3,
      "time": 1652922647,
      "title": "Ransomware gang threatens to overthrow Costa Rica government",
      "type": "story",
      "url": "https://apnews.com/article/technology-government-and-politics-caribbean-gangs-381efc2320abb5356dee7f356e55e608"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 31429535,
      "score": 1,
      "time": 1652922565,
      "title": "Joint Policy Search for Multi-Agent Collaboration with Imperfect Information",
      "type": "story",
      "url": "https://arxiv.org/abs/2008.06495"
    },
    {
      "by": "rpi1337",
      "descendants": 0,
      "id": 31429531,
      "score": 1,
      "text": "Hi All,<p>I have recently wrote an inquiry about Canadian Tech jobs (&quot;Who Is Hiring In Canada&quot;), and got mixed responses.<p>I am a 31 (almost 32) years old European, EU citizen (Hungary) wanting to relocate to Canada (Toronto&#x2F;Vancouver). I have checked out the options, so far I have seen two ways of managing the move:<p>- going there as a Skilled worker and also as a Maverick: I have to show 14k CAD on my account for the entry and try to find a job once there<p>- going there with a Valid Job Offer from any &quot;Canadian&quot; company (must be established, and registered there), no budget check, just need to cover the first few months<p>I am actively applying on LinkedIn&#x2F;Glass-door, whatever jobsite I find. I&#x27;m a full-stack engineer with IT BSc having 8 years of commercial experience (startups, fortune 500s), so &quot;skill-wise&quot; I should be qualified for many jobs, even if I have to accept sacrifices like the role&#x2F;tech&#x2F;salary, whatever it takes to get started.<p>I have lived in three countries in Europe already, it is simply &quot;boring&quot;, and the war in Ukraine puts my foreseeable career&#x2F;life at risk. Don&#x27;t get me wrong, I am not a refugee, but wish to live on a much greener pasture.<p>If you have any tip, insight, or a name of a Company worth to checkout, please don&#x27;t hesitate to comment! Any help is much Appreciated!<p>THANKS!\nArpad",
      "time": 1652922530,
      "title": "Ask HN: Imigrating to Canada",
      "type": "story"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 31429524,
      "score": 2,
      "time": 1652922493,
      "title": "The US Military Is Building Its Own Metaverse",
      "type": "story",
      "url": "https://www.wired.com/story/military-metaverse/"
    },
    {
      "by": "throwaway203482",
      "descendants": 2,
      "id": 31429511,
      "kids": [
        31429642,
        31429609
      ],
      "score": 2,
      "text": "Hi HN,<p>I have been a software developer for 2 years, all at the same company. Last week, I got asked to interview for a position at Google. I was stoked, took the phone interview a few days ago. Today, I got emails from both Microsoft and Amazon.<p>This can&#x27;t be a coincidence - why have these tech companies decided to reach out to me now of all times?<p>This sounds crazy, but the only thing I can think of is that I had a tweet go lowest-key viral among a subgroup of a subgroup associated with tech.<p>Does anyone with knowledge of Big Tech recruiting know what&#x27;s going on?",
      "time": 1652922423,
      "title": "Ask HN: Why are all the big tech companies reaching out all at once?",
      "type": "story"
    },
    {
      "by": "monocasa",
      "descendants": 2,
      "id": 31429503,
      "kids": [
        31429652,
        31429514
      ],
      "score": 2,
      "time": 1652922336,
      "title": "Crusoe Exposed: Transmeta TM5xxx Architecture 2",
      "type": "story",
      "url": "https://www.realworldtech.com/crusoe-exposed/"
    },
    {
      "by": "crescit_eundo",
      "descendants": 0,
      "id": 31429469,
      "score": 1,
      "time": 1652922086,
      "title": "Sacha Baron Cohen Developing Animated Chelm Series for HBO Max/Cartoon Network",
      "type": "story",
      "url": "https://deadline.com/2022/05/sacha-baron-cohen-animated-series-hbo-max-cartoon-network-mike-judge-greg-daniels-michael-koman-1235026685/"
    }
  ]
}