{
  "stories": [
    {
      "by": "turminal",
      "descendants": 0,
      "id": 31618988,
      "score": 1,
      "time": 1654340649,
      "title": "Implementing Regular Expressions in Hare",
      "type": "story",
      "url": "https://harelang.org/blog/2022-06-03-implementing-regular-expressions-in-hare/"
    },
    {
      "by": "recvonline",
      "descendants": 1,
      "id": 31618955,
      "kids": [
        31618966
      ],
      "score": 1,
      "text": "I am looking into video games which I can play myself or with my kids! Reason is: In real life, I don’t like guns, war or aggression. But when I play games, I often go for FPS or other, violent games.<p>I wondered why, but it turns out, I am more drawn to the story of these games than anything else.<p>So I wondered if there are more games which have a great gameplay and deep story to keep me engaged and are fun to play which don’t have gun or violence involved.",
      "time": 1654340334,
      "title": "Ask HN: Non-violent video games with great stories?",
      "type": "story"
    },
    {
      "by": "dytyramb",
      "descendants": 0,
      "id": 31618951,
      "score": 1,
      "text": "Racket editor (DrRacket) is incredibly memory hungry. Indeed, try this: 1) Launch DrRacket 2) Launch Microsoft Visual Studio 3) Start Task Manager and look at memory consumption.<p>You will get the result as in this picture: https:&#x2F;&#x2F;ibb.co&#x2F;ZLdTPGB<p>You’ll see that DrRacket consumes an enormous 648MB of memory while you haven’t even done anything in it yet! Visual studio consumes only 240MB (which is still a lot, to be clear, but still significantly less than the pathetic DrRacket).<p>Why is this so???<p>Is this the best argument that the whole Racket thing is failed project, maybe?<p>(Especially, given that the performance was even worse before, but the core team decided to switch to excellent Chez Scheme recently, being unable to produce decent compiler by themselves.)<p>It is especially interesting that the Racket community always says that they are superior, but they are obviously not able to make a more memory efficient editor than, according to them, the poor Visual Studio (which is much more than an editor and has many more functions than DrRacket)!",
      "time": 1654340287,
      "title": "Ask HN: Why DrRacket is so much memory hungrier than “bloated” Visual Studio?",
      "type": "story"
    },
    {
      "by": "imperio59",
      "descendants": 0,
      "id": 31618935,
      "score": 1,
      "time": 1654340116,
      "title": "Vulnerabilities Affecting Dominion Voting Systems ImageCast X (2022)",
      "type": "story",
      "url": "https://www.cisa.gov/uscert/ics/advisories/icsa-22-154-01"
    },
    {
      "by": "tablet",
      "descendants": 0,
      "id": 31618908,
      "score": 2,
      "time": 1654339822,
      "title": "Block-based interfaces can help us create more structured data on the web",
      "type": "story",
      "url": "https://maggieappleton.com/block-data"
    },
    {
      "by": "notasquirrel2",
      "descendants": 0,
      "id": 31618907,
      "score": 1,
      "time": 1654339817,
      "title": "ProInspector: Improving Node.js Inspection of Objects",
      "type": "story",
      "url": "https://github.com/Reiryoku-Technologies/pro-inspector"
    },
    {
      "by": "sanrod02",
      "descendants": 0,
      "id": 31618892,
      "score": 1,
      "text": "92% of companies running K8s have sufferd security incidents. Avoid misconfigurations, scan containers realtime for vulnerabilities, enforce pod sec policies, implement mTLS, and audit trails using configuration as code and GitOps. All provided out-of-the-box by Otomi: https:&#x2F;&#x2F;github.com&#x2F;redkubes&#x2F;otomi-core",
      "time": 1654339616,
      "title": "Improve Kubernetes Security",
      "type": "story"
    },
    {
      "by": "Ambolia",
      "descendants": 0,
      "id": 31618869,
      "score": 1,
      "time": 1654339304,
      "title": "The Fire This Time",
      "type": "story",
      "url": "https://www.ecosophia.net/the-fire-this-time/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31618857,
      "score": 1,
      "time": 1654339193,
      "title": "Ampere: Cloud biz buy-ins prove our Arm server CPUs are the real deal",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/04/ampere_arm_cloud/"
    },
    {
      "by": "notyeast",
      "descendants": 0,
      "id": 31618823,
      "score": 4,
      "text": "If you host your markdown blog on GitHub, what&#x27;s your newsletter tool?<p>Email marketing tools like ConvertKit and Mailchimp make me want to vomit. I&#x27;m sure it&#x27;s great for e-commerce megacorps using complex automation logic. But for independent writers, not so much: the UX is too multi-purpose and doesn&#x27;t inspire. And I&#x27;d prefer to keep GitHub as my one source of truth.<p>Newsletter tools like Ghost and Revue can be turned into pure email list managers, kind of. They allow you to unlist posts, but the posts are still accessible if you get ahold of their link. Furthermore, default CTAs like &quot;View online&quot; and &quot;Unsubscribe&quot; point to their own front-end. It&#x27;s a meh workaround.<p>So I want a simple newsletter service with read-access to my blog&#x27;s GitHub repo. When I publish a post there (with the category &quot;Newsletter&quot;, say) an email goes out, containing a backlink to that post on my blog. Alternatively, the tool may have write-access to my repo, allowing me to publish from inside the tool.<p>Are there any tools that do this? Am I doomed to copy-pasting posts into some email list manager like Listmonk? Is it ridiculous to get annoyed about, or can anyone relate? Will I have to build it myself?",
      "time": 1654338794,
      "title": "Markdown bloggers, what's your newsletter tool?",
      "type": "story"
    }
  ]
}