{
  "stories": [
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 29980189,
      "score": 1,
      "time": 1642518274,
      "title": "ID systems analysed: e-Estonia (X-Road)",
      "type": "story",
      "url": "https://privacyinternational.org/case-study/4737/id-systems-analysed-e-estonia-x-road"
    },
    {
      "by": "cbzbc",
      "descendants": 0,
      "id": 29980184,
      "score": 1,
      "time": 1642518264,
      "title": "Model of the Classic Ibanez Tube Screamer 808 Using Nodal Analysis and WDF",
      "type": "story",
      "url": "https://github.com/JamesStubbsEng/TS-808-Ultra"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29980173,
      "score": 1,
      "time": 1642518244,
      "title": "Extending FusionAuth Roles with Cerbos",
      "type": "story",
      "url": "https://fusionauth.io/blog/2022/01/18/extending-fusionauth-roles-with-cerbos/"
    },
    {
      "by": "josephcsible",
      "descendants": 0,
      "id": 29980165,
      "score": 1,
      "time": 1642518196,
      "title": "Intel CEO: AMD in rearview mirror, 'never again will they be in the windshield'",
      "type": "story",
      "url": "https://www.pcgamer.com/intel-ceo-says-amd-is-in-the-rearview-mirror-and-never-again-will-they-be-in-the-windshield/"
    },
    {
      "by": "addorai",
      "descendants": 0,
      "id": 29980162,
      "score": 4,
      "text": "Hi HN. Aravindh and Alex here, co-founders of www.tryfable.com. Fable allows product teams to collaborate on product specs, which it automatically syncs to issue trackers like Jira and Linear. Here&#x27;s a demo video: <a href=\"https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;a34eebc263f949db90f2e17aa7ffe104\" rel=\"nofollow\">https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;a34eebc263f949db90f2e17aa7ffe104</a><p>Product teams painstakingly craft their product specs to ensure they’re building the right thing. Unfortunately, the pace of modern product development is so fast that the minute a product spec is written, it’s no longer relevant. People waste time copy&#x2F;pasting this content into issue trackers, because the engineers need tickets to work on. Worse yet, these stale artifacts result in bad decisions and ultimately the wrong product going out the door.<p>Alex and I have been PMs at companies of varying sizes and industries—from Microsoft to Budweiser to Zocdoc. This idea came to mind when I was a PM at TpT (Teachers Pay Teachers). I was wasting hours copy&#x2F;pasting from my spec into Jira, time that I could have spent doing more valuable things like talking to users. Then after creating those Jira tickets, I’d get the link and paste it back in the spec. Problem was that I didn’t have time to keep updating the spec, which is the only place that my teammates on marketing and sales looked at. They didn’t want to go into Jira.<p>Fable gives product teams a place to collaboratively write their specs. What’s unique is that once the spec is written, teams can push a button to sync the content with their issue tracker (currently Jira and Linear are supported but we’re adding more). It’s a two-way sync—meaning if content changes in the issue tracker, it comes back to Fable and vice versa. You can start writing your spec in Fable, push a button to sync with the issue tracker, and <i>maintain accuracy</i> even as the content changes in the issue tracker.<p>Other document editors allow users to embed a Jira or Linear ticket, but it’s not a two-way sync. Building two-way sync was an engineering challenge since we had to account for offline issues, errors, etc that could cause conflicts between the two versions. We’ve designed our conflict resolution engine to be smart about handling these scenarios, and when we can’t come to a decision on what the source of truth is, we prompt the user to select one.<p>We’ve built Fable from the ground up for product teams, emphasizing ease of use (no complicated setup or learning curve) and speed (you don’t have to wait a few seconds every time you want to edit a doc). The foundation is a powerful document editor built on Prosemirror. It allows users to dynamically embed content from sources including Figma, Google Drive, and Airtable.<p>Fable makes product definition a more collaborative process, involving teammates all the way from ideation to creating tickets on issue trackers, and letting everyone keep track of what is being built and its status. No more sales and marketing people going into the issue tracker and throwing their hands up because they don’t know how to parse through all the tickets. Later, the Fable doc serves as a record of what was built, so teams can look back later to understand the thought behind live features.<p>We charge per “maker”, meaning people who are actively creating content. This tends to the product manager, and sometimes also the designer and engineering manager. Anyone who just wants to view and comment on the doc (marketing, sales, etc) gets access for free.<p>We’re looking forward to feedback from the community!",
      "time": 1642518168,
      "title": "Launch HN: Fable (YC W21) – Collaborate on product specs, sync to issue trackers",
      "type": "story"
    },
    {
      "by": "omgbobbyg",
      "descendants": 0,
      "id": 29980138,
      "score": 1,
      "time": 1642518046,
      "title": "SwiftUI vs. UIKit in 2022, Which Framework Should Your App Use?",
      "type": "story",
      "url": "https://www.bluelabellabs.com/blog/swiftui-vs-uikit/"
    },
    {
      "by": "rspoerri",
      "descendants": 0,
      "id": 29980117,
      "score": 1,
      "text": "I am concerned about my privacy on the internet and i think using cdn&#x27;s for data that is very common and often reused - such as fonts - opens a huge door to user tracking.<p>In a short research i did not find a browser plugin to replace online font cdn&#x27;s with locally cached fonts. I wanted to open a discussion about the feasability, problems, ideas and interest in such a plugin.<p>If you think this is a good idea and you&#x27;d love to work on it, you are very welcome to &quot;steal&quot; it. I will hardly be able to work on it myself in the near future.",
      "time": 1642517976,
      "title": "A browser plugin to make (Google) fonts offline",
      "type": "story"
    },
    {
      "by": "zikohh",
      "descendants": 0,
      "id": 29980082,
      "score": 1,
      "time": 1642517836,
      "title": "The Story of Jython",
      "type": "story",
      "url": "http://hugunin.net/story_of_jython.html"
    },
    {
      "by": "daddylonglegs",
      "descendants": 0,
      "id": 29980075,
      "score": 1,
      "time": 1642517804,
      "title": "Israeli police accused of using Pegasus spyware on Netanyahu's opponents",
      "type": "story",
      "url": "https://www.washingtonpost.com/world/2022/01/18/israel-pegasus-activists-spyware/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29980039,
      "score": 2,
      "time": 1642517676,
      "title": "Lithuania wins microchip windfall from Taiwan in China clash",
      "type": "story",
      "url": "https://www.politico.eu/article/lithuania-taiwan-china-microchip-windfall-clash/"
    }
  ]
}