{
  "stories": [
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 32124870,
      "score": 1,
      "time": 1658038410,
      "title": "A truly interest rate hike is now on the table",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/14/investing/premarket-stocks-trading/index.html"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 32124868,
      "score": 1,
      "time": 1658038376,
      "title": "Homebuyers are canceling deals at the highest rate since start of the pandemic",
      "type": "story",
      "url": "https://www.cnbc.com/2022/07/11/homebuyers-are-canceling-deals-at-highest-rate-since-start-of-covid.html"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32124860,
      "score": 1,
      "time": 1658038314,
      "title": "Hidden Van Gogh self-portrait discovered",
      "type": "story",
      "url": "https://www.nationalgalleries.org/art-and-artists/features/hidden-van-gogh-self-portrait-discovered"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 32124852,
      "score": 1,
      "time": 1658038246,
      "title": "GLIntercept – OpenGL function call interceptor and logger for Windows",
      "type": "story",
      "url": "https://github.com/dtrebilco/glintercept"
    },
    {
      "by": "joering2",
      "descendants": 0,
      "id": 32124848,
      "score": 2,
      "time": 1658038165,
      "title": "Nearly 100 hospitalized after eating lentil based product from Daily Harvest",
      "type": "story",
      "url": "https://www.nbcnews.com/news/us-news/daily-harvest-hospitalizations-hit-nearly-100-hundreds-became-ill-fda-rcna38489"
    },
    {
      "by": "r0n0j0y",
      "descendants": 0,
      "id": 32124840,
      "score": 1,
      "time": 1658038044,
      "title": "Is mass media still ‘manufacturing consent’ in the internet age?",
      "type": "story",
      "url": "https://aeon.co/videos/is-mass-media-still-manufacturing-consent-in-the-internet-age"
    },
    {
      "by": "chynkm",
      "descendants": 0,
      "id": 32124829,
      "score": 1,
      "time": 1658037740,
      "title": "Year One: The OpenSearch Project",
      "type": "story",
      "url": "https://opensearch.org/blog/community/2022/07/year-one-the-opensearch-project/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32124816,
      "score": 1,
      "time": 1658037562,
      "title": "Riding the Rails, in a Literal Sense",
      "type": "story",
      "url": "https://hackaday.com/2022/07/16/riding-the-rails-in-a-literal-sense/"
    },
    {
      "by": "kqr",
      "descendants": 0,
      "id": 32124809,
      "score": 2,
      "text": "Or, more generally, how to give children freedom and privacy, yet also be there to help them understand the lessons the world is about to teach them?<p>I have this preconceived notion that I don&#x27;t want to violate my children&#x27;s privacy. It&#x27;s very tempting, of course, to passively monitor e.g. their spending or online habits, but I don&#x27;t want to.<p>(As a concrete example, I know a some people get very detailed reports from the daycare about what their children have been up to. I&#x27;m not interested in that -- when I want to know what the daycare experience is like, I personally spend a day at the daycare.<p>This gives me much more nuance than a report ever would, but it also feels more respectful toward my child that they&#x27;re allowed a part of their life outside of my supervision. But the reason I can do that is because there are other helpful adults at the daycare. That won&#x27;t be the case everywhere, unfortunately.)<p>So I want them to have privacy, but I would also want to pick up on problems early -- either their own bad behaviour, or if they&#x27;re victim&#x27;s of someone else&#x27;s bad behaviour.<p>Some more concrete questions in the same vein:<p>- What fraction of their online time should I sit with them?<p>- Do I play all video games with them or should they have some of &quot;their own&quot;?<p>- Do I give them the ability to do online purchases?<p>- Do I allow them to use up all of their money even as a mistake, or do I set up a limit?<p>- Do I limit their &quot;screen time&quot; (hate that term) or will that prevent them from interacting with their friends in the way they would want to?<p>This depends on maturity levels, of course, but I&#x27;m looking for generalisations. My children are 2 and 0.2 years old now, so this won&#x27;t be relevant in a while but I like to be prepared and if you have thoughts regarding any maturity level, please share.<p>The reason I ask you HN folks is (a) that you are likely to understand my concern for privacy and personal integrity, and (b) that I&#x27;ve received very useful and thought-out child-related advice here before.<p>----<p>I&#x27;m also skipping a bunch of privilege-related questions like &quot;who the hell can take a day off to spend it at the daycare?&quot; Or, perhaps more importantly, &quot;what determines how much time you spend online with your children may not be what&#x27;s appropriate, but how much time you can spare for it?&quot;<p>And yeah, both of those are problems for myself as well -- I&#x27;m interested in all creative solutions here, also that help work around such problems.",
      "time": 1658037469,
      "title": "Ask HN: How to deal with children's online habits?",
      "type": "story"
    },
    {
      "by": "hunglee2",
      "descendants": 0,
      "id": 32124806,
      "score": 1,
      "time": 1658037354,
      "title": "Imaginary Numbers Are Real",
      "type": "story",
      "url": "https://aeon.co/essays/how-imaginary-numbers-describe-the-fundamental-shape-of-nature"
    }
  ]
}