{
  "stories": [
    {
      "by": "AuthorizedCust",
      "descendants": 0,
      "id": 31602639,
      "score": 1,
      "time": 1654217015,
      "title": "VSCode has dirty PowerShell debugger, on purpose",
      "type": "story",
      "url": "https://github.com/PowerShell/vscode-powershell/issues/4009"
    },
    {
      "by": "gilad",
      "descendants": 0,
      "id": 31602523,
      "score": 1,
      "time": 1654216396,
      "title": "Payloads All The Things: Useful payloads, bypass for web security and pentest",
      "type": "story",
      "url": "https://github.com/swisskyrepo/PayloadsAllTheThings"
    },
    {
      "by": "walterbell",
      "descendants": 1,
      "id": 31602502,
      "kids": [
        31602514
      ],
      "score": 1,
      "time": 1654216288,
      "title": "Luna: Multi-tool for building, analyzing, and hacking USB devices",
      "type": "story",
      "url": "https://www.crowdsupply.com/great-scott-gadgets/luna"
    },
    {
      "by": "LopRabbit",
      "descendants": 1,
      "id": 31602485,
      "kids": [
        31602521
      ],
      "score": 2,
      "time": 1654216190,
      "title": "Restaurants Add New Fees to Your Check to Counter Inflation",
      "type": "story",
      "url": "https://www.wsj.com/articles/waiter-theres-a-fee-in-my-soup-11654139870"
    },
    {
      "by": "fortysixdegrees",
      "descendants": 0,
      "id": 31602480,
      "kids": [
        31602483
      ],
      "score": 2,
      "time": 1654216130,
      "title": "Elon Musk declares end to remote working at Tesla",
      "type": "story",
      "url": "https://www.bbc.com/news/business-61666339"
    },
    {
      "by": "rubanp",
      "descendants": 0,
      "id": 31602465,
      "score": 1,
      "time": 1654216011,
      "title": "For new traders, trading seems like rocket science! It shouldn’t be!",
      "type": "story",
      "url": "https://medium.com/trading-and-investing-with-ai/for-new-traders-trading-seems-like-rocket-science-it-shouldnt-be-555aec3995e8"
    },
    {
      "by": "gxs",
      "descendants": 1,
      "id": 31602455,
      "kids": [
        31602458
      ],
      "score": 1,
      "time": 1654215936,
      "title": "Elon Musk tells Tesla employees: Return to the office, or else",
      "type": "story",
      "url": "https://www.cnn.com/2022/06/01/tech/elon-musk-tesla-ends-work-from-home/index.html"
    },
    {
      "by": "bsg75",
      "descendants": 0,
      "id": 31602427,
      "score": 1,
      "text": "Recently came across a posting for a Director level technical role where the initial remote interview involves a coding test. Personally I consider coding tests not very useful, as I can learn more about a candidate in interactive discussions about problems and solutions, where I can see what their thought process is instead of what test questions they can answer from memory.<p>While I believe that the best management is capable of understanding the work their team does, coding tests for director level positions is a red flag, because it brings up a question of what they really want to hire for.<p>Does the audience here agree, or is it possible my distaste for coding tests is coloring my perspective?",
      "time": 1654215719,
      "title": "Ask HN: Coding Test for Management Roles?",
      "type": "story"
    },
    {
      "by": "djellybeans",
      "descendants": 0,
      "id": 31602419,
      "score": 1,
      "text": "I&#x27;m searching for any job opportunities at larger companies that can &quot;get you back up to speed&quot; on required peripheral knowledge with some on-site training&#x2F;mentoring, provided that you can take care of most of the core knowledge yourself. I want to look beyond FAANG, for other places that have a lower barrier of entry, but still provide a good training regimen.<p>I&#x27;m a software programmer who&#x27;s been out of work since late 2019 and have roughly 10 YOE (though I fall usually in junior or mid-level rank).<p>What are some larger companies that can provide adequate training for people lagging behind? Perhaps consultancies and body shops are for me... if so, which in particular would you recommend?<p>I know the core knowledge of my job to be:<p>- Algorithms and data structures\n- Imperative and OO programming\n- Control flow\n- Design patterns<p>And peripheral knowledge:<p>- Front-end frameworks\n- Back-end frameworks\n- Cloud services\n- Testing\n- Automation and Deployment<p>I&#x27;m fairly good with a lot of the core knowledge, although with data structures and algorithms, my ability to solve problems using them are mostly limited to Leetcode easy problems. My peripheral knowledge needs a lot more work- many companies I&#x27;ve interviewed have rejected me for it. I know very little about most of them and rather out of date with frameworks. I need to get hired to begin with a training period on such knowledge before they expect me to be productive.<p>Also, I&#x27;m interested in startup or freelance opportunities. I have already been freelancing since 2011, and for smaller companies. Trying to pivot to a steady route that is also &quot;low pressure&quot; with the interviews.",
      "time": 1654215622,
      "title": "Ask HN: Larger but overlooked companies that have a great training culture?",
      "type": "story"
    },
    {
      "by": "ddtaylor",
      "descendants": 36,
      "id": 31602417,
      "kids": [
        31602652,
        31602543,
        31602631,
        31602481,
        31602493,
        31602506,
        31602486
      ],
      "score": 64,
      "time": 1654215612,
      "title": "Ford Is Going to 100% Online, Fixed-Price Sales for EVs",
      "type": "story",
      "url": "https://www.roadandtrack.com/news/a40175990/ford-online-sales-no-negotiation/"
    }
  ]
}