{
  "stories": [
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 28299727,
      "score": 1,
      "time": 1629886220,
      "title": "A history of Google messaging apps: Will Google ever figure this out?",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/08/a-decade-and-a-half-of-instability-the-history-of-google-messaging-apps/"
    },
    {
      "by": "legostormtroopr",
      "descendants": 0,
      "id": 28299710,
      "score": 1,
      "time": 1629886084,
      "title": "SquarEat - gourmet 50g food square that provides nutrients without any additives",
      "type": "story",
      "url": "https://squareat.com/"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 28299707,
      "score": 1,
      "time": 1629886027,
      "title": "Chinese Citizen Journalist Who Filmed Wuhan Outbreak Is On Prison Hunger Strike",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/25/world/asia/china-zhang-zhan-hunger-strike.html"
    },
    {
      "by": "mulmen",
      "descendants": 0,
      "id": 28299703,
      "score": 1,
      "time": 1629885985,
      "title": "The What, Why, and When of Single-Table Design with DynamoDB (2020)",
      "type": "story",
      "url": "https://www.alexdebrie.com/posts/dynamodb-single-table/"
    },
    {
      "by": "pyxisedge",
      "descendants": 0,
      "id": 28299687,
      "score": 1,
      "text": "Hi, are you a US entrepreneur (or team) without a project currently? You don&#x27;t have to be technical, the following is for everyone.<p>After attending startup school W2020 we launched a service which has gone live in the UK (https:&#x2F;&#x2F;hug.agency).<p>We are launching recruitment agencies globally which gift 100% net agency fee back to the worker and society. No traditional agency can compete with us, their shareholders won&#x27;t let them give away their profits. We also give better benefits for businesses (than traditional agencies) such as support for their ESG commitment (very important for institutional investment) and great brand kudos as they are credited with injecting (on average) $4000 wealth per job back into their local communities.<p>However, we are not really recruiters, we are a fintech. We are capturing their $400B annual global market using &quot;not-for-profit&quot; agencies, but which generate significant profits using a &quot;for-profit&quot; fintech (by managing the asset portfolios the new hires create with their gift). Therefore, we do huge societal good, but also generate great investor returns (i.e. we are a social impact, so you will be helping families get more wealth in their pockets).<p>We would now like to launch in the USA and are inviting a number of US co-founder&#x2F;investors to join us and be part of the founding team. You will be joining our first round, at no financial or operating disadvantage to the original team who created the service.<p>We are introducing new digital economy technology (digital wallets, verifiable credentials, tokenomics and later A.I) into the recruitment process. Our founders will receive a percentage of free tokens (regulated securities, designed to appreciate in price), which they can sell on a public exchange later. Future agencies will be run by employed staff (not founders) and so you will share the fintech profits from all of the agencies as we expand globally.<p>We&#x27;re looking for US co-founders with the energy, skills (maybe with a good business network) to launch our recruitment agencies in the US (with sales benefits no traditional agency can compete with). In return you will co-own the offshore parent business (in a tax efficient and crypto friendly jurisdiction governed by English law), plus franchises, plus security tokens.<p>So, if you are an entrepreneur&#x2F;investor seeking to co-found a project which could kickstart your future ones, I&#x27;d love to hear from you.<p>ps - non-US entrepreneurs please DM too. We can prioritise i18n application support for your country or find a temporary workaround.",
      "time": 1629885889,
      "title": "US entrepreneurs seeking a project?",
      "type": "story"
    },
    {
      "by": "fandahao17",
      "descendants": 0,
      "id": 28299654,
      "score": 1,
      "time": 1629885559,
      "title": "Pi Review – a website for PhD students to review their PIs",
      "type": "story",
      "url": "https://pi-review.com"
    },
    {
      "by": "i_don_t_know",
      "descendants": 0,
      "id": 28299612,
      "score": 1,
      "text": "I&#x27;m looking to learn more about formally specifying the requirements for a piece of software, modelling and simulating the design, and verifying its correctness with a proof assistant or model-checker. Thanks!",
      "time": 1629885122,
      "title": "Ask HN: Books on formal methods for software verification?",
      "type": "story"
    },
    {
      "by": "YohAsakura",
      "descendants": 0,
      "id": 28299609,
      "score": 1,
      "time": 1629885065,
      "title": "I use attrs instead of pydantic",
      "type": "story",
      "url": "https://threeofwands.com/why-i-use-attrs-instead-of-pydantic/"
    },
    {
      "by": "jstx1",
      "descendants": 0,
      "id": 28299600,
      "score": 1,
      "text": "How did you make the switch from frontend, backend, mobile, games, ML, embedded, desktop etc. to any of the other domains on the list?<p>How did you bridge the gap in skills? Did you have problems with not having any commercial experience in the new domain? Did you have to take a pay cut?<p>It would be great to hear people&#x27;s experience with this. Any tips and general advice are also appreciated.",
      "time": 1629884852,
      "title": "Ask HN: What was your experience switching domains within the software industry?",
      "type": "story"
    },
    {
      "by": "PVS-Studio",
      "descendants": 0,
      "id": 28299577,
      "score": 1,
      "time": 1629884627,
      "title": "Performant String Parsing in C++",
      "type": "story",
      "url": "https://thecodepad.com/cpp/performant-string-parsing-in-cpp/"
    }
  ]
}