{
  "stories": [
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28747459,
      "score": 1,
      "time": 1633358989,
      "title": "Backblaze Data Shows SSDs Failing Almost as Often as Hard Drives",
      "type": "story",
      "url": "https://www.tomshardware.com/news/ssds-fail-almost-as-often-as-hard-drives-backblaze"
    },
    {
      "by": "als0",
      "descendants": 0,
      "id": 28747454,
      "score": 1,
      "time": 1633358973,
      "title": "Test-takers busted for using Bluetooth-connected flip-flops to cheat",
      "type": "story",
      "url": "https://boingboing.net/2021/10/02/test-takers-busted-for-using-bluetooth-connected-flip-flops-to-cheat.html"
    },
    {
      "by": "kikiodazie",
      "descendants": 0,
      "id": 28747452,
      "score": 1,
      "time": 1633358967,
      "title": "Create Alignment: How Engineering Managers Can Keep Their Team on the Same Page",
      "type": "story",
      "url": "https://www.zumvie.com/create-alignment-how-engineering-managers-can-keep-their-team-on-the-same-page/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28747446,
      "score": 1,
      "time": 1633358943,
      "title": "Horrifying Facts from the Facebook Whistleblower Interview",
      "type": "story",
      "url": "https://gizmodo.com/9-horrifying-facts-from-the-facebook-whistleblowers-new-1847791184"
    },
    {
      "by": "Kaibeezy",
      "descendants": 0,
      "id": 28747443,
      "score": 1,
      "time": 1633358941,
      "title": "William Shatner and Blue Origin’s Audrey Powers to Fly on New Shepard",
      "type": "story",
      "url": "https://www.blueorigin.com/news/shatner-powers-announced-ns18"
    },
    {
      "by": "smoyer",
      "descendants": 0,
      "id": 28747432,
      "score": 1,
      "text": "I used to look forward to the a daily podcast that had useful software perspectives - some days the podcasts still have great interviews but I&#x27;m having a hard time taking it seriously lately due to the host&#x2F;owner&#x27;s erratic behavior.  Today&#x27;s episode (as well as the one titled &quot;Mark Suckerberg&quot;) makes me thinks there&#x27;s a crisis coming soon.<p>- https:&#x2F;&#x2F;softwareengineeringdaily.com&#x2F;",
      "time": 1633358887,
      "title": "Ask HN: Has Sofware Engineering Daily gone off the rails?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28747430,
      "score": 1,
      "time": 1633358884,
      "title": "The Age of America First",
      "type": "story",
      "url": "https://www.foreignaffairs.com/articles/united-states/2021-09-29/biden-trump-age-america-first"
    },
    {
      "by": "openthc",
      "descendants": 0,
      "id": 28747428,
      "score": 1,
      "text": "We make open-source software for the cannabis industry, there are roughly 150 other software providers in this space, and we all need to share data (Lot details, Crop details, Product details, Lab Results, etc).  Around 2018 or so we published a OpenAPI specification for data models ( https:&#x2F;&#x2F;github.com&#x2F;openthc&#x2F;api ) that we were hoping to get others to participate in.  It&#x27;s been rather difficult.<p>The previous blocker was that in much of the USA, this data flows through a central system operated by the Government (as a contract to BioTrackTHC, Metrc or Akerna&#x2F;MJ Freeway&#x2F;LeafData).  So, there hasn&#x27;t been a critical need for interop.  However, recent states to legislate cannabis (Oklahoma, Maine) don&#x27;t fully have that and one (Washington) is moving away from theirs at the end of the year.<p>The Washington state one is now, finally, getting some eyeballs to our API model.  We&#x27;d been inviting these compititors for years to participate but it was crickets.  Just recently a trade association stepped up efforts to get some parties to the table.  After a few meetings we still haven&#x27;t been able to even agree to agree.  It&#x27;s frustrating to be asked over and over if we&#x27;re OK to have others contribute (TF!? we&#x27;ve been asking them for years).  And the conversations go in circles:<p>a) what if we don&#x27;t get everybody to participate? (we won&#x27;t)\n b) what if the model is not perfect? (it&#x27;s not)\n c) what if you (OpenTHC) take some nefarious action? (on MIT licensed work, in a public repo? feels like a bad-faith question)\n d) what do other industries do? (they have a common data-model (eg: GS1))\n e) what if we don&#x27;t get everybody to participate? (we won&#x27;t)\n f) repeat while (true);<p>Then after the meeting, we get stuck in one-on-one meetings with the same parties from the group sit-down; and talk the same circles; and deal with finger pointing; and re-explain how common-data-model helps us (why are we explaing this to CTOs and techinical founders?).  Sometimes it&#x27;s even suggested to form a <i>NEW</i> association&#x2F;group for this. It would be disappointing in our efforts to reduce the number of interop-protocols we actually create another one! ( https:&#x2F;&#x2F;xkcd.com&#x2F;927&#x2F; )<p>We don&#x27;t think the API is too complex, the models are very simple and (we assume) that everyone knows distributed&#x2F;federated systems are a good design goal.  We&#x27;ve offered many times to help with integration, run pilot programs, or talk through models.  In fact, some of these informal conversations have led directly to changes in the model -- it&#x27;s just the person giving the feedback won&#x27;t do it publicly, there&#x27;s no Issue filed, no PR -- and we still don&#x27;t actually move forward on the integration; and the project doesn&#x27;t have the community feedback publicly documented -- so it looks less &quot;strong&quot; than it really is.  Many of the vendors have APIs (unique, bespoke) but they are just slightly different (eg: Area vs Section or updated_at vs updatedAt) and none of them are posted for community use and feedback and all that FOSSy stuff; so at the moment we&#x27;re like the only one out there.<p>a) what are we missing?\n b) any tips on getting competitors to agree on interop-protocols?\n c) what are we doing wrong?\n d) what lesson did we miss?<p>The industry (cannabis farmers, labs, retailers) needs us to work together but it just feels impossible to get folks to play nice with each other.\nHow the F did email come to actually work across vendors?",
      "time": 1633358872,
      "title": "Ask HN: How to get compeitors to use our open source interop-prototcol?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28747421,
      "score": 1,
      "time": 1633358839,
      "title": "Profilerpedia: A Map of the Software Profiling Ecosystem",
      "type": "story",
      "url": "https://www.markhansen.co.nz/profilerpedia/"
    },
    {
      "by": "kosasbest",
      "descendants": 0,
      "id": 28747402,
      "score": 1,
      "time": 1633358744,
      "title": "“Hi, I’m the founder of _____”",
      "type": "story",
      "url": "https://email-is-good.com/2021/08/09/hi-im-the-founder-of-_____/"
    }
  ]
}