{
  "stories": [
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30584856,
      "score": 1,
      "time": 1646635479,
      "title": "Russia and Putin's Ukraine war may have been preventable",
      "type": "story",
      "url": "https://www.msnbc.com/opinion/msnbc-opinion/russia-s-ukraine-invasion-may-have-been-preventable-n1290831"
    },
    {
      "by": "noduerme",
      "descendants": 0,
      "id": 30584851,
      "score": 1,
      "text": "Take a man who loves freedom. Traded having a career job for freelancing and traveling. The man&#x27;s afraid of two things, namely: Getting sick and not being able to support himself; and, since growing up in the 1980s and having nightmares as a child, nuclear war.\nLock him indoors for 2 years and terrify him with a deadly virus. No more travel, nowhere you can go. Whole world locked down. No freedom.\nThen confront him with the real possibility of nuclear war.\nAnd while you&#x27;re doing it, take away the daily comfort of conversation. Take away the cafes and bars, the parks and friends&#x27; get-togethers. Replace his social life with an artificial world, not of real people, but of bubbles of friends on Zoom, and faceless opinionated idiots who might be bots, filling every space with ahistorical lies that can&#x27;t be distinguished from basic ignorance. A world of faceless voices who first incredibly deny the virus, making it worse, then advocate for the end of the world. So that it seems none of them want to live. Or care about life.\nHow can they not care about life? How did so many angry and pessimistic come to exist? A few years ago there was so much belief in a better future, in individuality, in the human spirit and the experience of knowing and loving the world. Suddenly it&#x27;s been replaced by anger on every side, FOMO, some feeling that nothing is fair if your life isn&#x27;t like someone else&#x27;s. Suddenly every actress has huge puffy lips and looks like they mutated into a duck face photo. Suddenly it&#x27;s not a mark of pride to eat rice and beans while working your way up. Suddenly everyone assumes they&#x27;ll never get &quot;there&quot;, that they&#x27;ll fail, that they&#x27;re being lied to, that everything is rigged. And no one wants to know the truth, or look at the details. Everyone gets mileage out of being angry. They spend time complaining about what other people have instead of working on themselves, or making anything for themselves, or experiencing life in all its beauty and complexity. And so they hate life. \nIt costs nothing to travel, really. It costs nothing to read books. They don&#x27;t do it. Ten years ago I would have been talking about a fragment of the religious right. Now I&#x27;m talking about everybody.\nThey just want to tear down the world. The anti-vax people and the anti-mask people, the climate change denialists. And the people panicking about climate change, panicking about who&#x27;s vaccinated. End of the world doomers on all sides. No rationality. Just stories, conspiracy stories.<p>You wake up one day in your country, but it&#x27;s a different country. There&#x27;s no space for reasonable people who want to live a nice life, get along with their neighbor, be civil, work hard, enjoy the fruits of their labor. No space for civilian life. Everything is converted to internecine warfare. We all blame some vague outside force for creating this condition. You wake up with ignorant assholes screaming from every direction, meth addicts camped on your porch, crazy people driving by with confederate flags and shotguns, people excusing terrible behavior, people behaving terribly. You can see why they want it all to end. Their inner mindscape is some kind of hell because they lack the tools to think critically and objectively; they even lack the sense that they should find those tools. It&#x27;s what Hannah Arendt described as the totalitarian mob, except there are two mobs; and neither has anything to live for.<p>But YOU have something to live for. And their ignorance is the enemy. So you try to speak your mind, to make personal connections, to take down the level of anger. But it doesn&#x27;t work. The level of anger on all sides goes up every day. And you can see where it&#x27;s all heading.<p>How could this happen in 2022? Every day someone&#x27;s trying to open the door on an airplane, screaming to be let out. What is happening to the world? And do all the people who don&#x27;t enjoy life need to destroy it for the rest of us?",
      "time": 1646635436,
      "title": "A plea, a rant, a profound sense of loss",
      "type": "story"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30584847,
      "score": 1,
      "time": 1646635382,
      "title": "Hear a Pep-Talk from Kids, Kids Laughing with Delight – Hotline for Joy",
      "type": "story",
      "url": "https://text.npr.org/1084800784"
    },
    {
      "by": "lifeisstillgood",
      "descendants": 0,
      "id": 30584838,
      "score": 1,
      "time": 1646635281,
      "title": "Facebook emails incl Zuck Six4Three (2018)",
      "type": "story",
      "url": "https://web.archive.org/web/20181206132832/https://twitter.com/ashk4n/status/1070344140708171776"
    },
    {
      "by": "tomcam",
      "descendants": 0,
      "id": 30584801,
      "score": 1,
      "time": 1646634871,
      "title": "Valveless jet-powered go kart",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=gAKekhmTRaY"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30584796,
      "score": 2,
      "time": 1646634805,
      "title": "Russian gymnast investigated for wearing pro-war symbol on podium",
      "type": "story",
      "url": "https://www.bbc.co.uk/sport/gymnastics/60641891"
    },
    {
      "by": "adamstep",
      "descendants": 0,
      "id": 30584771,
      "score": 1,
      "time": 1646634557,
      "title": "Refactoring a Python Codebase with LibCST",
      "type": "story",
      "url": "https://engineering.instawork.com/refactoring-a-python-codebase-with-libcst-fc645ecc1f09?gi=a92cd6200701"
    },
    {
      "by": "helsinkiandrew",
      "descendants": 1,
      "id": 30584750,
      "kids": [
        30584787
      ],
      "score": 2,
      "time": 1646634315,
      "title": "What future is there for Russia’s foreign science collaborations?",
      "type": "story",
      "url": "https://www.economist.com/science-and-technology/2022/03/02/what-future-is-there-for-russias-foreign-science-collaborations/21807946"
    },
    {
      "by": "greenSunglass",
      "descendants": 0,
      "id": 30584715,
      "score": 2,
      "time": 1646634021,
      "title": "I miss easily seeing how my coworkers use tools",
      "type": "story",
      "url": "https://alexanderell.is/posts/casual-collaboration/"
    },
    {
      "by": "yessirwhatever",
      "descendants": 2,
      "id": 30584694,
      "kids": [
        30584850,
        30584808
      ],
      "score": 3,
      "time": 1646633721,
      "title": "Swedish car startup passed off rebadged Chinese EV as its new ‘model Zero’",
      "type": "story",
      "url": "https://www.thelocal.se/20220129/hyped-swedish-car-start-up-passed-off-chinese-ev-as-new-model-zero/"
    }
  ]
}