{
  "stories": [
    {
      "by": "weatherlight",
      "descendants": 0,
      "id": 29066696,
      "score": 1,
      "time": 1635775264,
      "title": "Apple's Privacy Features Have Cost Social Media Companies $10B in Revenue",
      "type": "story",
      "url": "https://www.macrumors.com/2021/11/01/apple-privacy-social-media-companies/"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29066679,
      "score": 1,
      "time": 1635775203,
      "title": "The Golden Ratio and User-Interface Design",
      "type": "story",
      "url": "https://www.nngroup.com/articles/golden-ratio-ui-design/"
    },
    {
      "by": "herbertl",
      "descendants": 0,
      "id": 29066672,
      "score": 1,
      "time": 1635775175,
      "title": "Great Writing Is an Extension of the Product",
      "type": "story",
      "url": "https://herbertlui.net/product-writing/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29066664,
      "score": 1,
      "time": 1635775124,
      "title": "Predictions for the Future of Smartphones",
      "type": "story",
      "url": "https://www.theverge.com/22749341/smartphones-future-predictions"
    },
    {
      "by": "hbn",
      "descendants": 0,
      "id": 29066640,
      "score": 1,
      "time": 1635774862,
      "title": "The True Story of Audion (2004)",
      "type": "story",
      "url": "https://www.panic.com/extras/audionstory/"
    },
    {
      "by": "darth_coder",
      "descendants": 0,
      "id": 29066639,
      "score": 1,
      "time": 1635774852,
      "title": "Ask HN: What are the concepts a developer must remember his entire career?",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 1,
      "id": 29066634,
      "kids": [
        29066678
      ],
      "score": 2,
      "time": 1635774824,
      "title": "Facebook’s Meta mission laid out in a 2018 paper written by an Oculus executive",
      "type": "story",
      "url": "https://www.cnbc.com/2021/10/30/facebooks-meta-mission-was-laid-out-in-a-2018-paper-on-the-metaverse.html"
    },
    {
      "by": "lambdaba",
      "descendants": 0,
      "id": 29066627,
      "score": 1,
      "text": "Would be cool if this was an option, but I figure someone figured it out already?",
      "time": 1635774778,
      "title": "Ask HN: Extension/userscript to collapse all comments by default?",
      "type": "story"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29066622,
      "score": 1,
      "time": 1635774726,
      "title": "Did Vikings and their stowaway mice beat Portugal to the Azores?",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/oct/31/did-vikings-and-their-stowaway-mice-beat-portugal-to-the-azores"
    },
    {
      "by": "Nimitz14",
      "descendants": 1,
      "id": 29066613,
      "kids": [
        29066684
      ],
      "score": 3,
      "text": "We&#x27;re about to receive a mil in funding. It&#x27;s a &quot;cool&quot; startup, as in it&#x27;s trying to solve a hard problem with a still to be completed hardware solution that also involves a lot of trendy (deep learning and more) software.<p>I had a discussion with the two cofounders where they confronted me for not being engaged enough. They have a point.<p>I&#x27;m only moderately excited about the product and the problem space. And I don&#x27;t enjoy working with my cofounders very much.<p>I am the most experienced (they&#x27;re basically newgrads). Part of what annoys me is their inexperience (leading to bad decision making, while not listening to common sense advice). At the same time I feel we do complement each other well because we are quite different personality wise, and it&#x27;s possible that as they mature the issues I have will go away.<p>I&#x27;ve invested 9 months of ~25% work. It feels crazy to leave when we&#x27;re about to get funding, and where I don&#x27;t actually even have to fully commit as I&#x27;m parttime at officially 20% supposed to go to 40, and me going fulltime is not being asked for. I&#x27;m worried I&#x27;m being a diva, I have a habit of dropping people the moment things aren&#x27;t going well. Maybe creating an ambitious new product does require people that wouldn&#x27;t hang out normally (diversity is good blabla)?<p>At the same time there&#x27;s other things I&#x27;d also like to do. And why should I invest more time working on something I&#x27;m not excited about, and with people I don&#x27;t look forward to seeing?<p>I knew what was gonna happen in the meeting, so I had planned some stuff to say to smooth things over because I thought I should try and stay. But when it was pointed out that after a recent major milestone I hadn&#x27;t posted anything on any social media, it made me think why I am I working on something that I don&#x27;t feel the urge to share with anyone? My instinctual  answer is because we&#x27;re very far from having a good product, but I feel that&#x27;s not good enough. And so I just said I need to think about it.",
      "time": 1635774664,
      "title": "Ask HN: Cofounder in startup about to get funding but not feeling it",
      "type": "story"
    }
  ]
}