{
  "stories": [
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31783232,
      "score": 1,
      "time": 1655494735,
      "title": "The browser stores passwords and sensitive data in clear text in memory",
      "type": "story",
      "url": "https://www.ghacks.net/2022/06/12/your-browser-stores-passwords-and-sensitive-data-in-clear-text-in-memory/"
    },
    {
      "by": "whitakerch",
      "descendants": 0,
      "id": 31783224,
      "score": 2,
      "text": "I&#x27;ve seen different arguments on this topic and thought I&#x27;d ask HN if you all have a standard for this.<p>Say you have a form that&#x27;s filled out and saved to a DB. \nOne required field is a dropdown with Yes and No.\nBut the field begins as blank to show that a value hasn&#x27;t been selected yet, ensuring that the User pays attention to the field.<p>Do you use a Nullable Bit (DB) and Nullable Bool (Code)?\nOR an Enum: Yes, No, Unset?<p>You wouldn&#x27;t use a boolean to represent states like say New, Processing, Done. But do you consider NULL a separate &quot;state&quot;?<p>Thanks",
      "time": 1655494697,
      "title": "Ask HN: Do You Use Enum for Yes, No, Unset?",
      "type": "story"
    },
    {
      "by": "gabea",
      "descendants": 0,
      "id": 31783217,
      "score": 1,
      "time": 1655494661,
      "title": "Langur monkeys grieve over fake monkey",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=vaIH5tLmC8U"
    },
    {
      "by": "comaksemih",
      "descendants": 0,
      "id": 31783215,
      "score": 1,
      "text": "Hello everyone\n My name is Semih.  I am an 18 year old hacker.  Actually, it would be more accurate to say SCADA&#x2F;ICS and OSINT hacker.  Today I&#x27;m going to talk to you about hacking critical industrial control systems.  When I first started this business, there were not many resources on the internet, so I decided to write this blog.  I want to inspire you by writing an incident that happened to me First of all, I must say that scada hacking is not like other types of hacking.  Thanks to the scada system you hacked, you can sometimes cut off the electricity of a city, and sometimes cause dozens of planes to crash at an airport.\n I was doing bug bounty when I was 16 years old.  I suffered many injustices and did not receive any money.  I wanted to focus on a more serious field.  First, I targeted a sector (health sector).  Then I chose a country and chose India.  The reason they chose India was because they produced thousands of unsafe software.  I then identified a suitable company (www.meddiff.com).  Then I found the ip address of the software the company sells (I won&#x27;t tell you how I found these ip addresses).  I then discovered an incorrect security configuration in the system.  I was able to enter the hospital system by taking advantage of this vulnerability and I was very surprised.  Because I had the citizenship information, phone numbers, loads of connected devices and bank accounts of thousands of patients and doctors.  I discovered 100 more hospitals affected by this vulnerability.  I infiltrated all these hospitals.  Later, I wrote an e-mail to the company that produced this software, but even after 6 months, there was still no progress.  I reported this to the Indian consulate in my country.  They also directed me to the ministry of defense.  I was promised a monetary reward by the company, but they did not. And they closed the gap.\n                                                    If you have more questions about Scada&#x2F;ICS hacking, you can reach me on Instagram.\n  @32smh32",
      "time": 1655494656,
      "title": "How to hack a hospital? Scada ICCShacking",
      "type": "story"
    },
    {
      "by": "jpm_sd",
      "descendants": 1,
      "id": 31783188,
      "kids": [
        31783241
      ],
      "score": 2,
      "time": 1655494518,
      "title": "The Peecyclers. Their Idea to Help Farmers Is No. 1",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/17/climate/peecycling-farming-urine-fertilizer.html"
    },
    {
      "by": "heavyset_go",
      "descendants": 0,
      "id": 31783160,
      "score": 2,
      "time": 1655494393,
      "title": "Tesla lays off more employees, and hourly ones despite Elon Musk’s comments",
      "type": "story",
      "url": "https://electrek.co/2022/06/17/tesla-tsla-lays-off-more-employees/"
    },
    {
      "by": "sbbq",
      "descendants": 0,
      "id": 31783142,
      "score": 1,
      "time": 1655494283,
      "title": "Sharing Deep Learning Research Models: Building a Super Resolution App",
      "type": "story",
      "url": "https://sebastianraschka.com/blog/2022/lightning-app-srgan-1.html"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 31783132,
      "score": 1,
      "time": 1655494213,
      "title": "Trustless",
      "type": "story",
      "url": "https://www.profgalloway.com/trustless/"
    },
    {
      "by": "ourmandave",
      "descendants": 0,
      "id": 31783114,
      "score": 2,
      "time": 1655494116,
      "title": "Average Monthly Car Payment Hits Record High of $712",
      "type": "story",
      "url": "https://jalopnik.com/average-monthly-car-payment-hits-record-high-of-712-1849077074"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 31783106,
      "score": 2,
      "time": 1655494081,
      "title": "Fastest-growing black hole ever seen is devouring an Earth per second",
      "type": "story",
      "url": "https://www.space.com/fastest-growing-black-hole-powering-quasar"
    }
  ]
}