{
  "stories": [
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 28534490,
      "score": 1,
      "time": 1631672753,
      "title": "HSBC exits US mass market retail banking",
      "type": "story",
      "url": "https://www.about.us.hsbc.com/news-and-media/hsbc-exits-us-mass-market-retail-banking"
    },
    {
      "by": "yuqingcai",
      "descendants": 0,
      "id": 28534451,
      "score": 2,
      "time": 1631672325,
      "title": "Best IDE in History – Borland",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=phsR-aVq_is&t=9s"
    },
    {
      "by": "pmcollins",
      "descendants": 0,
      "id": 28534443,
      "score": 1,
      "time": 1631672225,
      "title": "Boeing's Fatal Flaw (full documentary) – FRONTLINE",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=wXMO0bhPhCw"
    },
    {
      "by": "yuqingcai",
      "descendants": 0,
      "id": 28534442,
      "score": 1,
      "time": 1631672217,
      "title": "Show HN: A souece analyser help you to understand code efficiently",
      "type": "story",
      "url": "https://cymbols.io/"
    },
    {
      "by": "mmphosis",
      "descendants": 0,
      "id": 28534434,
      "score": 1,
      "time": 1631672126,
      "title": "BC Vaccine Passport Data Format",
      "type": "story",
      "url": "https://dunae.ca/notes/2021/09/08/bc-vaccine-passport-format.html"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28534433,
      "score": 1,
      "time": 1631672118,
      "title": "Maersk CEO Says Construction of Fossil Fueled Ships Should Be Banned",
      "type": "story",
      "url": "https://gcaptain.com/maersk-ceo-says-construction-of-fossil-fueled-ships-should-be-banned/"
    },
    {
      "by": "smallbizdev420",
      "descendants": 0,
      "id": 28534397,
      "score": 1,
      "text": "HN readers running online SaaS might be interested in this cautionary tale of marketing failure.<p>Omnisend is a email marketing platform. When I signed up for their free tier a few months ago, it was because they were giving me the freedom to grow my business with them. The free tier had unlimited contacts&#x2F;15000 mails per month. I didn&#x27;t expect to reach that limit soon and I appreciated being able to start out free and switch to paid if and when the business took off.<p>Yesterday, I received a mail that said Omnisend is now changing pricing. I opened the mail with a feeling of dread and found that the free tier is now 250 contacts and 500 emails&#x2F;month. I don&#x27;t mind the contacts limit but the mail limit is crippling.<p>My limits in the new plan, assuming everything goes perfectly (which it never does) = 1 campaign + 80 transactions.\nOne transaction generally means 3 messages (order placed, order dispatched, order delivered). \nOne email campaign per month = 250 messages.\nFor comparison, Mailchimp&#x27;s free tier has unlimited contacts and 3000 messages per month. They limit mails to 12&#x2F;contact&#x2F;month.\nThese limits might work for a monthly church newsletter where you occasionally want to post an addendum&#x2F;correction. Not for me and I think likely not for most small business.<p>The communication around the pricing update is complete crap. The headline says &quot;We are moving to contact-based pricing&quot;. I have no idea how much they are going to charge per contact. Read their update here (https:&#x2F;&#x2F;support.omnisend.com&#x2F;en&#x2F;articles&#x2F;5499152-omnisend-pricing) and tell me if you can figure it out. How likely am I to sign up for something if i can&#x27;t figure out the cost of it up front?<p>I get that free tiers cost the provider money and they are prone to abuse. But surely the marketing value of a free tier has to be weighed against the cost. This change feels like a cautionary business tale to me in every way, and that&#x27;s why I&#x27;m sharing it on HN.<p>To summarize:\n 1. Dropping free tier to unusable limits\n 2. Opaque pricing in new plans\n 3. No clear dates (The Trial plan will be sunset once the new pricing is released this autumn.) I thought it&#x27;s already autumn now?<p>If I had been in charge, I&#x27;d have put a contact limit on the free tier, capped it at 12 mails per month per contact and be done with it. That would have been understandable. This is incomprehensible.<p>I&#x27;ll be dropping them. A pity, because their support has been excellent, even for the trial. I expect a lot of others will do the same. Your thoughts appreciated.",
      "time": 1631671834,
      "title": "A cautionary marketing tale: Omnisend's pricing changes",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28534358,
      "score": 1,
      "time": 1631671552,
      "title": "Pioneering Gene Therapy Freed Her of Sickle Cell. Is a Cure at Hand?",
      "type": "story",
      "url": "https://www.nytimes.com/2021/09/14/health/sickle-cell-cure.html"
    },
    {
      "by": "lando2319",
      "descendants": 0,
      "id": 28534347,
      "score": 3,
      "time": 1631671491,
      "title": "Cargo ship capsized because of inaccurate stability calculations, the NTSB finds",
      "type": "story",
      "url": "https://www.cnn.com/2021/09/14/us/golden-ray-cargo-ship-ntsb-report/index.html"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28534343,
      "score": 2,
      "time": 1631671473,
      "title": "The Han Chinese Myth",
      "type": "story",
      "url": "https://rhapsodyinlingo.com/en/han-myth/"
    }
  ]
}