{
  "stories": [
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 29081118,
      "score": 1,
      "time": 1635860795,
      "title": "Zillow to sell 7k homes, many for less than it paid, after flipping flop",
      "type": "story",
      "url": "https://www.ocregister.com/2021/11/01/zillow-to-sell-7000-homes-for-2-8-billion-after-flipping-flop/"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29081101,
      "score": 1,
      "time": 1635860703,
      "title": "SPARCbook 3000ST: The coolest 90s laptop",
      "type": "story",
      "url": "https://jasoneckert.github.io/myblog/sparcbook3000st-the-coolest-90s-laptop/"
    },
    {
      "by": "nixass",
      "descendants": 0,
      "id": 29081088,
      "score": 1,
      "time": 1635860649,
      "title": "Musk says Hertz deal isn’t signed – questions Tesla rally after the announcement",
      "type": "story",
      "url": "https://www.marketwatch.com/story/musk-says-hertz-deal-isnt-signed-and-questions-tesla-rally-after-the-announcement-11635843116"
    },
    {
      "by": "tut-urut-utut",
      "descendants": 0,
      "id": 29081087,
      "score": 1,
      "time": 1635860644,
      "title": "Leaving Debian",
      "type": "story",
      "url": "https://corecursive.com/leaving-debian/"
    },
    {
      "by": "CtznIndn",
      "descendants": 0,
      "id": 29081071,
      "score": 1,
      "time": 1635860576,
      "title": "Tesla recalls vehicles after identifying Full Self-Driving Beta software error",
      "type": "story",
      "url": "https://techcrunch.com/2021/11/02/tesla-recalls-11704-vehicles-after-identifying-full-self-driving-beta-software-error/"
    },
    {
      "by": "SocialSMWB",
      "descendants": 0,
      "id": 29081059,
      "score": 1,
      "time": 1635860529,
      "title": "Holistic SEO: How to Win on Amazon, Google, and YouTube",
      "type": "story",
      "url": "https://www.similarweb.com/corp/blog/marketing/seo/integrated_search_strategy/"
    },
    {
      "by": "adrianthedev",
      "descendants": 0,
      "id": 29081054,
      "score": 3,
      "text": "Hey HN, This is Adrian and David, and we&#x27;re excited (and nervous) to show you basetool (https:&#x2F;&#x2F;basetool.io). Basetool helps companies view and manage all their data in one place.<p>Companies have data in tons of places like BI tools, data warehouses, 3rd party services, and their databases. However, because the tools are not connected, it&#x27;s a hassle to have visibility across the whole organization and even more difficult to safely share that data with the team or external collaborators.<p>The vision is to give basetool access to your data source and get a tool that way above a database client. You get an app that&#x27;s more than an admin panel but somewhere around an internal tool tailored to your needs. The app can be configured visually (no more engineering bottlenecks) and ready to be used by your end-users like teammates and external collaborators. You can easily curate the data you want to show and assign it to your stakeholders.<p>We are aware everyone has questions about data security. We know how important security is to you. That&#x27;s why we&#x27;re offering the self-hosted version from the get-go. Use it on your infrastructure close to your data.<p>By default, basetool doesn&#x27;t store any of your data, and it&#x27;s straightforward to disable tables and fields that are not meant to be seen or contain PII (they never leave the server). In addition, with a role-based access control system and custom filters based view system, you can control who can see what type of data.<p>The second-most troubling issue with these kinds of tools is around data safety. &quot;You don&#x27;t directly edit production data&quot;. We know how vital data safety is, so we&#x27;re shipping with validation rules in place from day one. Standard validation rules are in place (required, read-only, nullable, defaults, etc.), with more stringent rules coming shortly.<p>The third big problem we&#x27;re tackling is showing the data in a meaningful way. We don&#x27;t just want to display a table with your records. We want to help you curate what&#x27;s essential in an intuitive way. We have some very cool updates coming your way to allow that even better.<p>We&#x27;re nerds, so we built this as an open-source project. We want to give something back to the fantastic OSS community and want to open up basetool so anyone can contribute and help improve the ecosystem. The fields and data sources are totally pluggable, so you can bring your own.<p>Basetool is written in TypeScript and (in our opinion) with most modern pieces of tech out there; React, Redux toolkit, Next.js, Prisma, and tailwindcss. We want this to be a project that lives on in the future.<p>We also want to build a business that funds the further development of products like basetool. This is why we&#x27;re offering a cloud version that will eventually have paid tiers. https:&#x2F;&#x2F;basetool.io wants to be your one-stop shop where you go from credentials to an admin panel in less than 60 seconds.<p>We built this in about ten weeks, so there might still be some rough edges, but we&#x27;re here to polish them.<p>We made a short demo video this morning. https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;b8f40183134445208c121128d11b12d9<p>We&#x27;d love to hear about any feedback, ideas, or questions you might have about what we&#x27;re building!",
      "time": 1635860494,
      "title": "Open-source, self-hosted data management platform and internal tool builder",
      "type": "story"
    },
    {
      "by": "simon_000666",
      "descendants": 0,
      "id": 29081048,
      "kids": [
        29081100
      ],
      "score": 2,
      "time": 1635860444,
      "title": "Show HN: Self-Hosted SVG/React Based Miro Whiteboard Clone POC",
      "type": "story",
      "url": "https://workshoppr.com/"
    },
    {
      "by": "ianai",
      "descendants": 0,
      "id": 29081043,
      "score": 1,
      "time": 1635860425,
      "title": "Resignation rate of employees with a 5-10-year tenure was 56.8% higher in 2021",
      "type": "story",
      "url": "https://www.fastcompany.com/90692090/these-are-the-people-still-most-likely-to-quit-during-the-next-wave-of-the-great-resignation"
    },
    {
      "by": "numair",
      "descendants": 0,
      "id": 29081041,
      "score": 1,
      "time": 1635860419,
      "title": "The End of the Dark Age of Unproductive Insecurity",
      "type": "story",
      "url": "https://numair.medium.com/the-end-of-the-dark-age-of-unproductive-insecurity-6cd64f7e98ca"
    }
  ]
}