{
  "stories": [
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 31524646,
      "score": 1,
      "time": 1653609126,
      "title": "Russia's forcibly depopulating hundreds of thousands from east Ukraine to Russia",
      "type": "story",
      "url": "https://www.cnn.com/2022/05/26/politics/ukraine-filtration-camps-forcibly-remove-russia/index.html"
    },
    {
      "by": "captainchris",
      "descendants": 0,
      "id": 31524645,
      "score": 1,
      "text": "Hi HN:<p>Failed USA-based startup founder here. I was cofounder for a SaaS startup and have fallen on hard times. I stopped programming a few years ago and have been cycling between inadequately housed and homeless since before the pandemic. Homeless at this time without transportation. I travel on foot with a backpack and sleep outdoors for now.<p>I&#x27;ve exhausted gov&#x27;t help, as well as help from friends and family already. I am in a rural area with limited work options. My best bet short term, barring a coding gig here, is odesk (Upwork). But, I need some basics such as a bicycle, a laptop, and a coworking membership to do any tech work. There are no programming jobs locally for which I would qualify at this time.<p>I&#x27;ve worked small local jobs here and there, but its sporadic and difficult to maintain without even a bicycle. Today, I asked a friend locally for their extra bike, from which I will seek any kind of work for food at a minimum. If that comes through, I&#x27;ll be in a far better spot to do any kind of job, whether manual labor or technical.<p>My SNAP food allowance has run out for the month. A few nice people here on hn helped me out with food and toiletries this week, and I just need a few more bucks to get through this month.<p>A gentleman here on hn sent me $15 yesterday to PayPal, intended for food, which I used at CVS for first aid supplies, as my feet are worn out and began bleeding today from my heels, due to walking too many miles without proper footware.<p>Even basics like laundry, new socks and sneakers are out of reach, as food&#x2F;toiletries&#x2F;first aid have taken precedence.<p>I have my Apple phone and ACP cell service to stay on grid and manage virtual cash (apple cash, paypal&#x2F;venmo&#x2F;cashapp).<p>May I ask if anyone can help out with some emergency food money so I may eat before early next month? Beyond that, I am quite open to pointers to a low pay remote coding gig. I&#x27;d need the aforementioned basics but I can work at a senior level SWE.<p>If you can help, can you e&#x27;mail me at hackernewscontactmail at gmail? Thank you for helping.",
      "time": 1653609120,
      "title": "Ask HN: Failed startup cofounder seeking emergency assistance",
      "type": "story"
    },
    {
      "by": "mark-ruwt",
      "descendants": 0,
      "id": 31524636,
      "score": 1,
      "time": 1653608964,
      "title": "Defector’s Valuation Is $333M, According to Real Business Math",
      "type": "story",
      "url": "https://defector.com/defectors-valuation-is-333-million-according-to-very-real-business-math/"
    },
    {
      "by": "DrZootron",
      "descendants": 0,
      "id": 31524635,
      "score": 1,
      "time": 1653608947,
      "title": "Web API to the General Bathymetric Chart of the Oceans",
      "type": "story",
      "url": "https://amentum.io/ocean_docs"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31524626,
      "score": 1,
      "time": 1653608882,
      "title": "The Opioid Crisis: Everyone Is Fucking Stupid",
      "type": "story",
      "url": "https://mburr.bearblog.dev/so-the-opioid-crisis-everyone-is-fucking-stupid/"
    },
    {
      "by": "danbmil99",
      "descendants": 0,
      "id": 31524622,
      "score": 1,
      "text": "Hi! this is Dan and Genevieve from Burstable AI, developers of Cloudburst, a Jupterlab-based cloud platform with notebooks, a terminal, and GPU.<p>We&#x27;ve just added support for git-lfs (Large File Storage) to be able to track datasets and models in git without worrying about storage limits.<p>To make this useful, we are hosting Datahub, our own open, public LFS server, free to use for any AI&#x2F;ML-related data. The easiest way to use it is to check out our LFS tutorial on cloudburst (link is on the landing page). Note that Datahub is not tied to Cloudburst: repos created in Cloudburst can be checked out by any git client with LFS installed.<p>LFS has a nasty reputation as being hard to configure and use, but we have tried to make the experience as simple and intuitive as possible. Please let us know how we are doing! We can be contacted at:<p>beta at cloudburst dot host.",
      "time": 1653608864,
      "title": "Show HN: Free LFS Storage with Datahub and Cloudburst",
      "type": "story",
      "url": "https://cloudburst.host/lfs"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31524605,
      "score": 1,
      "time": 1653608707,
      "title": "Jump – Experiences like you're there (2015)",
      "type": "story",
      "url": "https://arvr.google.com/"
    },
    {
      "by": "peddamat",
      "descendants": 1,
      "id": 31524598,
      "kids": [
        31524599
      ],
      "score": 1,
      "time": 1653608644,
      "title": "FancyZones fork which maximizes windows properly",
      "type": "story",
      "url": "https://github.com/peddamat/PowerToys/releases/tag/v0.58.0-maxinzone"
    },
    {
      "by": "zu03776",
      "descendants": 0,
      "id": 31524597,
      "score": 2,
      "time": 1653608630,
      "title": "Rash of parts thefts is leaving Freightliner trucks inoperable",
      "type": "story",
      "url": "https://www.freightwaves.com/news/thefts-of-powertrain-modules-plague-daimler-truck"
    },
    {
      "by": "stanislavb",
      "descendants": 0,
      "id": 31524567,
      "score": 1,
      "time": 1653608282,
      "title": "Switching Your Search Engine",
      "type": "story",
      "url": "https://seths.blog/2022/05/switching-your-search-engine/"
    }
  ]
}