{
  "stories": [
    {
      "by": "_ben_",
      "descendants": 0,
      "id": 31781706,
      "score": 1,
      "time": 1655487876,
      "title": "Scaling GraphQL with Redis Consumer Groups",
      "type": "story",
      "url": "https://www.parabol.co/blog/scaling-graphql-with-redis-consumer-groups/"
    },
    {
      "by": "Razengan",
      "descendants": 1,
      "id": 31781678,
      "kids": [
        31781708
      ],
      "score": 1,
      "time": 1655487786,
      "title": "Prince Rupert’s Drop",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Prince_Rupert%27s_drop"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31781669,
      "score": 1,
      "time": 1655487760,
      "title": "Is the UK getting hotter, and what causes heatwaves?",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/science-environment-61825371"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 31781666,
      "score": 2,
      "time": 1655487749,
      "title": "Russia May Have Used Autonomous Drones. Now What?",
      "type": "story",
      "url": "https://lastweekin.ai/p/russia-may-have-used-autonomous-drones"
    },
    {
      "by": "Hchanni",
      "descendants": 1,
      "id": 31781650,
      "kids": [
        31781715
      ],
      "score": 2,
      "text": "Curious, as I&#x27;m worried honestly as a prospective employee, will the company even last?<p>I wonder if Brian will reply to this cause I&#x27;m curious to see what the burn rate is now with the layoffs and rescinds of offers, and how the company is planning to live through a 2-3 year maybe more recession + crypto winter.",
      "time": 1655487696,
      "title": "Coinbase Burn Rate 1.5 Bil? Will This Company Last?",
      "type": "story"
    },
    {
      "by": "anarbadalov",
      "descendants": 0,
      "id": 31781635,
      "score": 1,
      "time": 1655487653,
      "title": "The Ends of Men",
      "type": "story",
      "url": "https://slate.com/culture/2022/06/sandra-newman-the-men-review-gendercide-women-worlds-history.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31781622,
      "score": 2,
      "time": 1655487624,
      "title": "The detectives hunting for underwater volcanoes",
      "type": "story",
      "url": "https://www.bbc.com/future/article/20220607-the-detectives-hunting-for-underwater-volcanos"
    },
    {
      "by": "giorgioz",
      "descendants": 0,
      "id": 31781613,
      "score": 2,
      "text": "How you can help:\nIf you know someone working at the Google Play Store tell them to add warning emails 1 month before bots remove apps!<p>Story:\nIt&#x27;s the second time in a year our Android app gets removed from the Google Play Store by bot without warning.\n1 year ago we got removed because the Amharic title for the app was not confirming the store guidelines. (Our app is translated in 40+ languages). It had been the same for 4+ years but suddenly someone wrote a bot to just remove all apps that didn&#x27;t pass that guideline without any email notification.\nWe modified the metadata, appealed and resubmitted and our app was re-added with reviews with a 7 days downtime costing us thousands of dollars in revenues. The level of stress was VERY HIGH.\nYesterday again our app was removed.\nThis time the culprit guideline is not providing email&#x2F;password for the reviewers to use.\nThe app has been the same for 9 years.\nSomeone added that to the guidelines 2+ years ago.\nAnd then now someone wrote a bot to enforce that.\nThe bot just removes the apps without any warning.<p>Let&#x27;s be clear.\nI&#x27;m not against the guidelines. The problem is there are 100+ pages of guidelines and they get updated all the time.\nEngineers at the Google Play Store need to STOP IMMEDIATELY this kill-bots that ban straight away without an email notification.\nPlease build in a grace period where you notify developers 1-4 weeks before you are going to remove their apps.<p>BUT WE WARNED YOU IN THE GOOGLE PLAY STORE CONSOLE...\nWe don&#x27;t check the Google Play Store Console very often and pretending millions of developers to be on the edge all the time reading manuals of dozens of pages updated monthly and checking compulsively UIs warning that matters once a year is just a cruel dystopia.<p>Please stop the killbots and add the warn-bots followed by killbots.\nThis bots have seriously damaged the brand of Google in my eyes and have forced us to change marketing strategy from the app stores to SEO&#x2F;content marketing to be less dependent on the whims of bots developers.",
      "time": 1655487584,
      "title": "Tell HN: Trivially bot banned from Google Play Store twice in a year",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31781610,
      "score": 1,
      "time": 1655487564,
      "title": "The double standard of the return-to-office",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20220602-the-double-standard-of-the-return-to-office"
    },
    {
      "by": "jmcarey",
      "descendants": 0,
      "id": 31781607,
      "score": 1,
      "text": "Exploring a startup that leverages payroll APIs (e.g., Check) to build integrated payroll (e.g., scheduling, time &amp; attendance, payroll itself, reporting) for a specific industry.<p>My gut says there must be an industry out there that has specific unmet needs&#x2F;pain points and would love something tailored to them.",
      "time": 1655487559,
      "title": "Does payroll serve specific industries badly?",
      "type": "story"
    }
  ]
}