{
  "stories": [
    {
      "by": "pitchpodcasts",
      "descendants": 0,
      "id": 28600731,
      "score": 2,
      "text": "Talk to your customers! I have heard it forever, never listened, until now! I grew my startup revenue 159%!  Here&#x27;s how we did it...<p>#1. Start connecting with ALL your users (we call them friends)! Connect with them directly, NO AUTOMATION. EVERY USER!<p>Here&#x27;s an example message we send out. I hope it helps you craft a message for your users that will make their lives and yours better...<p>===\nAylin here.  Thanks for using PitchPodcasts, you rock!<p>How&#x27;s it going?<p>Have you been able to pitch any podcasts? Any success getting on a show?<p>I would love to help you succeed in getting a guest spot on one of our member podcasts.<p>How could I help make that happen?<p>Cheers!<p>Aylin - PitchPodcasts.com\n===<p>Message Breakdown:<p>A. Start with appreciation and encouragement! \nWe all need more kind, positive words, why not send them in EVERY email (even the refund requests!)<p>B. Check on how people are doing! \nPeople often have needs beyond our product.  We can help, ALWAYS ASK! There are PEOPLE behind the emails.  They hurt, they suffer, they get depressed!  Reach out and help them!<p>C. Ask if they have been successful!  \nIf we care about what we offer we need to ask our users how they are doing, OFTEN, and then help them succeed!  Make sure your product is doing what it needs to do, and if not, change it!<p>D. Show you care and offer to help solve their problem!\nIf we can solve a problem for someone, that&#x27;s worth it!  Have you actually checked to see if your product has helped your customers? Do it!<p>#2. Watch and see what people do when they interact with your product. Don&#x27;t make people work to solve their problem, make it easy!  It&#x27;s tempting to optimize for engagement, DON&#x27;T!  Optimize for LIFE! Make people&#x27;s REAL lives better.  If this person was your friend using your product how would you change the experience, the product? Don&#x27;t waste peoples time, give them more time by giving them an experience that solves their problem in the best and quickest way possible!<p>#3. Authentically care about your users! Provide as much free options as possible to help them be more successful.  It&#x27;s easy to treat our users as numbers. I did this WAYYY too long!!  Now we look at them as real people, like they are friends!  Resist the urge to automate, to &quot;fake&quot; customize&#x2F;personalize your messages to your friends (users).  Our team actually contacts EVERY person. We don&#x27;t run scripts, automations, etc.  We connect with everyone on the platform (podcast or guest)!  Connecting with our 2,000+ friends :) takes time but our goal is to connect with EVERYONE in a positive and encouraging way, and to me, that&#x27;s a goal worth fighting for!<p>In this world of A.I., automation, etc. we need to ACTUALLY take time to connect with our users.  They are REAL people just like us, they have REAL lives, REAL struggles.  Let&#x27;s optimize our products and services so people can live REAL lives BETTER instead of DIGITAL lives.<p>Start seeing your users as people, STOP calling them users and START calling them friends :)  If we treat our users as friends this world will be a better place for everyone!<p>In closing I want to let you know I am a Jesus follower.  ALL of the GOOD ideas (if any :) I have covered in this post come directly from what Jesus has taught me.  The mindset outlined in this post is NOT natural or comfortable for me but by implementing it, I have seen awesome growth and even better, I am contributing to peoples lives in a positive way, in love!<p>God Bless You!<p>Titus<p>PS. If you ever have questions about Jesus let me know, I would love to chat, and I am not about condemning you, I am about loving you, like Jesus...so reach out!  “For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life. For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him.&quot; John 3:16-17 in the Bible",
      "time": 1632184206,
      "title": "I grew my revenue 159% in 12 months by calling our users, friends",
      "type": "story"
    },
    {
      "by": "concertina226",
      "descendants": 0,
      "id": 28600720,
      "score": 1,
      "time": 1632184126,
      "title": "'nerd' culture powered through the pandemic",
      "type": "story",
      "url": "https://www.bbc.com/news/business-58535299"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28600693,
      "score": 1,
      "time": 1632183849,
      "title": "Amazon Ring uses domestic violence to market doorbell cameras",
      "type": "story",
      "url": "https://www.technologyreview.com/2021/09/20/1035945/amazon-ring-domestic-violence/"
    },
    {
      "by": "Ice_cream_suit",
      "descendants": 0,
      "id": 28600660,
      "score": 1,
      "time": 1632183455,
      "title": "Texas restaurant kicks out couple who wore masks to protect their at-risk son",
      "type": "story",
      "url": "https://nypost.com/2021/09/20/texas-restaurant-kicks-out-couple-who-wore-masks-to-protect-their-at-risk-son/"
    },
    {
      "by": "sea6ear",
      "descendants": 0,
      "id": 28600651,
      "score": 4,
      "time": 1632183385,
      "title": "A function decorator that rewrites the bytecode to enable goto in Python",
      "type": "story",
      "url": "https://github.com/snoack/python-goto"
    },
    {
      "by": "droptablemain",
      "descendants": 0,
      "id": 28600631,
      "score": 2,
      "time": 1632183166,
      "title": "What's the deal with tab size (8 spaces) in the GitHub UI?",
      "type": "story",
      "url": "https://github.community/t/whats-the-deal-with-tab-sizes-on-github-gists/954"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 28600625,
      "score": 1,
      "time": 1632183111,
      "title": "The hidden patterns of startup failure",
      "type": "story",
      "url": "https://www.nfx.com/post/hidden-patterns-startup-failure/"
    },
    {
      "by": "chmaynard",
      "descendants": 0,
      "id": 28600594,
      "score": 2,
      "time": 1632182821,
      "title": "Structural pattern matching in Python 3.10",
      "type": "story",
      "url": "https://benhoyt.com/writings/python-pattern-matching/"
    },
    {
      "by": "markdog12",
      "descendants": 0,
      "id": 28600588,
      "score": 4,
      "time": 1632182755,
      "title": "Gmail loads 4MB of compressed JavaScript to render the inbox",
      "type": "story",
      "url": "https://twitter.com/dhh/status/1439891231128043523"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 28600585,
      "score": 1,
      "time": 1632182738,
      "title": "James Patterson: Author or Brand Manager?",
      "type": "story",
      "url": "https://blog.bookstellyouwhy.com/james-patterson-author-or-brand-manager"
    }
  ]
}