{
  "stories": [
    {
      "by": "osivertsson",
      "descendants": 0,
      "id": 30628171,
      "score": 1,
      "time": 1646927085,
      "title": "Untangling Direct3D 12 Memory Heap Types and Pools",
      "type": "story",
      "url": "https://asawicki.info/news_1755_untangling_direct3d_12_memory_heap_types_and_pools"
    },
    {
      "by": "vulgar_otter",
      "descendants": 0,
      "id": 30628167,
      "score": 1,
      "time": 1646927052,
      "title": "Show HN: Nbpreview – a terminal viewer for Jupyter notebooks",
      "type": "story",
      "url": "https://github.com/paw-lu/nbpreview"
    },
    {
      "by": "freediver",
      "descendants": 0,
      "id": 30628165,
      "score": 2,
      "time": 1646927050,
      "title": "New cars make me want to Saab (2020)",
      "type": "story",
      "url": "https://theoutline.com/post/8743/cars-are-ugly-now-i-miss-saab"
    },
    {
      "by": "ashleynewman",
      "descendants": 0,
      "id": 30628151,
      "score": 1,
      "time": 1646926979,
      "title": "Be More Like SpongeBob",
      "type": "story",
      "url": "https://write.as/ashleynewman/be-more-like-spongebob"
    },
    {
      "by": "eveningcoffee",
      "descendants": 0,
      "id": 30628142,
      "score": 1,
      "text": "Clint Ehrlich is sharing on Twitter news about next hilarious stupidity that Russian propaganda machine has produced.<p>https:&#x2F;&#x2F;twitter.com&#x2F;ClintEhrlich&#x2F;status&#x2F;1501690951323963395<p>Member of Russian Academy of Military Sciences -- Alexander Bartosh -- claimed America was developing gene weapons in Ukraine targeting Slavs.<p>That&#x27;s right, Russian propaganda machine claims that United States developed a weapon specially targeting Slavic people in a Slavic country using Slavic scientists.<p>So they developed in Ukraine weapons that would target nations that are considered US allies like of course Ukrainians but also Poles, Slovaks, Czechs, Slovenians, Bulgarians and so on?<p>Yes, of course, this makes perfect sense to do that.<p>But in all seriousness, there is no such thing as Slavic gene. It is mostly cultural thing and people geographically close to each other share huge amount of genes. https:&#x2F;&#x2F;www.quora.com&#x2F;Is-Slavic-a-genetic-or-cultural-term-Are-Eastern-Western-and-South-Slavs-the-same-blood<p>If you want to target Russians, you will end up targeting some Ukrainians, some Belorussians, Latvians, Estonians, Lithuanians, Poles and so on.<p>It is complete nonsense but this of course does not stop Russian propaganda machine to produce and spread it and it stops even less its gullible followers to swallow it, believe it and spread it even further.<p>To Make a Long Story Short: do not believe anything the Russian propaganda tries to make you believe.",
      "time": 1646926924,
      "title": "Tell HN: Some antidote against stupidity (part 1)",
      "type": "story"
    },
    {
      "by": "galaxyLogic",
      "descendants": 0,
      "id": 30628136,
      "score": 1,
      "time": 1646926914,
      "title": "War Is Calling Crypto’s ‘Neutrality’ into Question",
      "type": "story",
      "url": "https://www.wired.co.uk/article/crypto-russia-ukraine-sanctions"
    },
    {
      "by": "harambae",
      "descendants": 0,
      "id": 30628123,
      "score": 2,
      "time": 1646926872,
      "title": "Sex in the metaverse will be ‘equally enjoyable’ as real life act, experts claim",
      "type": "story",
      "url": "https://www.the-sun.com/tech/4858390/sex-in-the-metaverse-virtual-reality/"
    },
    {
      "by": "zaik",
      "descendants": 0,
      "id": 30628118,
      "score": 1,
      "time": 1646926860,
      "title": "Writing Semantic ASCII",
      "type": "story",
      "url": "https://smitop.com/post/ascii/"
    },
    {
      "by": "Axeryon",
      "descendants": 0,
      "id": 30628117,
      "score": 1,
      "text": "Would it be possible to implement a programming language that supports as many features and paradigms as possible? If you want to use a target runtime, which one would be best? CLR, JVM, GraalVM (with Truffle) or something else?<p>Maybe native like LLVM would be best because runtimes make assumptions that can be a limit but I thought of a runtime target like CLR or JVM so that I can access the whole ecosystem of libraries provided.<p>Regarding GraalVM I read in this document (https:&#x2F;&#x2F;www.oracle.com&#x2F;a&#x2F;ocom&#x2F;docs&#x2F;tools&#x2F;graalvm-ee-white-paper.pdf):<p>&quot;Computer virtualization has been a consistent trend for the past 20 years. While “virtualization” and “virtual machines” (VMs) mean different things in different contexts, they have a couple of goals in common: the isolation of code from other code running in the same machine and the ability to write once, run anywhere. To date, this virtualization vision has been incomplete. That’s because traditional virtualization approaches don’t address the issue of multiple programming languages. Meanwhile, the number of programming languages in use continues to increase. So, virtualization’s multilingual problem is growing. Attempts to build multilingual runtimes to fill this void have fallen short with poor performance and an inability to support all the semantics, features, and native extensions libraries of the new languages. But all that is changing with GraalVM language-level virtualization.&quot;",
      "time": 1646926855,
      "title": "Programming Language with all features",
      "type": "story"
    },
    {
      "by": "davydog187",
      "descendants": 0,
      "id": 30628109,
      "score": 1,
      "time": 1646926801,
      "title": "AvroEx v2.0.0",
      "type": "story",
      "url": "https://davelucia.com/blog/avro-2.0"
    }
  ]
}