{
  "stories": [
    {
      "by": "mudro_zboris",
      "descendants": 0,
      "id": 30440390,
      "score": 1,
      "time": 1645620424,
      "title": "The Toxoplasma of Rage (2014)",
      "type": "story",
      "url": "https://slatestarcodex.com/2014/12/17/the-toxoplasma-of-rage/"
    },
    {
      "by": "orborde",
      "descendants": 0,
      "id": 30440388,
      "score": 1,
      "time": 1645620393,
      "title": "Global warming is real. It is also – so far – mostly beneficial",
      "type": "story",
      "url": "https://www.mattridley.co.uk/10786"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 30440386,
      "score": 1,
      "time": 1645620349,
      "title": "After a Shaky Start, Airborne Wind Energy Is Slowly Taking Off",
      "type": "story",
      "url": "https://e360.yale.edu/features/after-a-shaky-start-airborne-wind-energy-is-slowly-taking-off"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30440370,
      "score": 1,
      "time": 1645620263,
      "title": "Sound waves convert stem cells into bone in regenerative breakthrough",
      "type": "story",
      "url": "https://newatlas.com/medical/sound-waves-stem-cells-bone/"
    },
    {
      "by": "Geekette",
      "descendants": 0,
      "id": 30440365,
      "score": 1,
      "time": 1645620204,
      "title": "Weakest link in America’s national security may be its people not foreign tech",
      "type": "story",
      "url": "https://www.economist.com/1843/2020/02/25/the-friendly-mr-wu"
    },
    {
      "by": "vmception",
      "descendants": 0,
      "id": 30440363,
      "score": 1,
      "text": "Unlimited Vacation paid time off (PTO) policies in the US have started getting a lot of well deserved criticism, with many adept observers calling it a scam<p>This is due to the following reasons:<p>1. Workers often experience pressure to never use the unlimited vacation policy.<p>2. The managers might not approve the vacation time, the manager’s opinion of what is a normal amount of vacation is arbitrary and can be low.<p>3. In companies with a specific number of days of vacation, this amount of time accrues in a balance for the employee and is paid out to the employee if the employee never uses it when they leave the company. Companies with “Unlimited” time have no balance, and so nothing is paid out, hence why its seen as a ploy and scam.<p>The reason I like PTO is because I do take the risk of leveraging it and am content with that.<p>1. I’ve seen managers try to guilt employees into the idea that 10 days unlimited vacation as the max, or other arbitrary numbers around there based on their own experience. (If you are not aware, the US has no norm or legally required amount of vacation time. Many workers have zero paid vacation.) In a developed nation like Germany, the statutory minimum is 24 working days a year, however, it’s common practice that companies offer 30 days as a standard for all employees. As American Exceptionally is baselessly ingrained into many people’s minds, my US Unlimited Vacation policy competes with developed nations.<p>2. Set your goals and meet them. In many jobs the software engineers and team is empowered to make their own goals, and are judged on how well they met them. Time in the office and presence doesn’t matter. I like Doubling down on that theory and observation.<p>3. In companies with other PTO policies which can be paid out in cash when the employee leaves, the vacation time accrues slowly, where eventually the employee winds up with a decent amount of vacation time. Even the aforementioned German system has a 6 month time period before the full benefits kick in. This is worse for me than an unlimited paid time off policy. Accruing PTO can eventually begin to benefit employees of a company several years into their tenure, because the amount they have and can take can begins exceeding 15, 20, 25 days. As I leave companies with a year or two, I get reset every time. No matter what the compensation is, it would impact my work life balance. Whereas actually using an Unlimited Vacation policy would not, after setting development goals and meeting them with integrity.<p>&quot;25-30 days is arbitrary too, why stop there&quot; you might ask. I mostly just want to keep up with my girlfriends from developed nations who also have that much time off.<p>A perspective.",
      "time": 1645620186,
      "title": "Tell HN: Unlimited Vacation” Policies. Why I still like them",
      "type": "story"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30440355,
      "score": 1,
      "time": 1645620019,
      "title": "Dietary carbohydrate and the risk of type 2 diabetes: updated systematic review",
      "type": "story",
      "url": "https://www.nature.com/articles/s41598-022-06212-9"
    },
    {
      "by": "11001100",
      "descendants": 0,
      "id": 30440353,
      "score": 2,
      "time": 1645619949,
      "title": "Roman mosaic found in London",
      "type": "story",
      "url": "https://www.theguardian.com/uk-news/2022/feb/22/lavish-roman-mosaic-is-biggest-found-in-london-for-50-years"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 30440346,
      "score": 1,
      "time": 1645619833,
      "title": "Play First and Lose: Zugzwang in Chess, Math and Pizzas",
      "type": "story",
      "url": "https://www.quantamagazine.org/zugzwang-in-chess-math-and-pizzas-20220222/"
    },
    {
      "by": "jjude",
      "descendants": 0,
      "id": 30440339,
      "score": 1,
      "time": 1645619782,
      "title": "RPA saved about 7 crores for an Indian e-commerce giant [podcast]",
      "type": "story",
      "url": "https://jjude.com/jyothi-rpa"
    }
  ]
}