{
  "stories": [
    {
      "by": "stefanve",
      "descendants": 0,
      "id": 28097847,
      "score": 1,
      "time": 1628336962,
      "title": "In defense of Apples client-side check for child pornography",
      "type": "story",
      "url": "https://pastebin.com/GBQAuhxY"
    },
    {
      "by": "rounakbanik",
      "descendants": 0,
      "id": 28097824,
      "score": 1,
      "text": "Imagine you are John Doe, an extremely wealthy art collector. You have just found out that the Louvre Museum has decided to auction off the Mona Lisa. There are two different ways this pans out in two parallel universes.<p>Case 1\nHere, the painting is auctioned off in a standard way. You win the bid and you agree to pay $1 billion dollars to buy the Mona Lisa. Louvre hands over the original to you. You can now choose to do whatever you want with it.\nIn the place where the painting originally hanged, a plaque states that the painting has been sold off. It, however, makes no mention of your name.<p>Case 2\nIn this universe, a machine exists that can create exact replicas of products. It does it in such a way that the original and the duplicate are indistinguishable. For instance, if the Mona Lisa was duplicated with this machine, things contained in the original such as (for instance) Da Vinci’s fingerprints and DNA would be copied exactly onto the duplicate. In other words, it is scientifically impossible to determine the replica from the fake.\nLouvre decides to create 100,000 copies of the Mona Lisa using this machine. Due to a mishap, the original gets mixed with the replicas. There is absolutely no way of knowing which is the original anymore.\nLouvre now decides to conduct an auction. If you win, Louvre will put up a plaque stating that you, John Doe, are the original owner of the Mona Lisa. They will give you the option of taking one of the copies home. They will continue to hang a copy at the museum. And they will sell the remaining at their gift shop for $1 apiece.\nWe can never know if the original is hanging at the Louvre, was picked by you, or by someone at the gift store for a dollar. But a plaque will always exist at the Louvre stating that the original Mona Lisa belongs to John Doe, thus ascribing ownership to you.<p>I have 2 questions:\n1. If you were willing to pay $1 billion in case 1, how much would you be willing to pay in case 2?\n2. Why did you choose this amount? Why was it higher&#x2F;lower&#x2F;the same?",
      "time": 1628336700,
      "title": "The Mona Lisa Thought Experiment",
      "type": "story"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 28097790,
      "score": 2,
      "time": 1628336285,
      "title": "New ‘Delta Plus’ Covid Variant Detected in San Francisco Bay Area",
      "type": "story",
      "url": "https://sanfrancisco.cbslocal.com/2021/08/06/delta-plus-covid-variant-detected-san-francisco-bay-area/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28097783,
      "score": 1,
      "time": 1628336230,
      "title": "Password of three random words better than complex variation, experts say",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/aug/07/password-of-three-random-words-better-than-complex-variation-experts-say"
    },
    {
      "by": "ckipp",
      "descendants": 0,
      "id": 28097776,
      "score": 1,
      "time": 1628336176,
      "title": "Tooling Talks Podcast",
      "type": "story",
      "url": "https://www.tooling-talks.com/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28097773,
      "score": 1,
      "time": 1628336147,
      "title": "Big Tech Is Coming to Small-Town America, but There's a Catch",
      "type": "story",
      "url": "https://time.com/6085525/big-tech-data-centers/"
    },
    {
      "by": "tomaskafka",
      "descendants": 0,
      "id": 28097770,
      "score": 2,
      "time": 1628336138,
      "title": "I bought my kid an MP3 player so he could listen to podcasts without screens",
      "type": "story",
      "url": "https://twitter.com/hondanhon/status/1423476490063147010"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28097698,
      "score": 1,
      "time": 1628335278,
      "title": "O Delta, Delta, Wherefore Art Thou Delta?",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2021-08-07/how-covid-variants-hurricanes-and-other-nasty-things-got-their-names"
    },
    {
      "by": "Kaibeezy",
      "descendants": 0,
      "id": 28097697,
      "score": 1,
      "time": 1628335269,
      "title": "The modem choir (video, 2016)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Yn2MVeu0XdY"
    },
    {
      "by": "lavp",
      "descendants": 0,
      "id": 28097683,
      "score": 1,
      "time": 1628335114,
      "title": "The Apple Psi System [pdf]",
      "type": "story",
      "url": "https://www.apple.com/child-safety/pdf/Apple_PSI_System_Security_Protocol_and_Analysis.pdf"
    }
  ]
}