{
  "stories": [
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31418594,
      "score": 1,
      "time": 1652840471,
      "title": "AvatarCLIP: Zero-Shot Text-Driven Generation and Animation of 3D Avatars",
      "type": "story",
      "url": "https://hongfz16.github.io/projects/AvatarCLIP.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31418572,
      "score": 1,
      "time": 1652840274,
      "title": "Ceiling frescoes discovered in the Temple of Khnum at Esna",
      "type": "story",
      "url": "https://phys.org/news/2022-05-spectacular-ceiling-frescoes-temple-khnum.html"
    },
    {
      "by": "davidbarker",
      "descendants": 0,
      "id": 31418542,
      "score": 2,
      "time": 1652839983,
      "title": "Elon Musk Does Not Care About Spam Bots",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-05-17/elon-musk-does-not-care-about-spam-bots"
    },
    {
      "by": "webo",
      "descendants": 1,
      "id": 31418535,
      "kids": [
        31418615
      ],
      "score": 2,
      "text": "Received this email from Split Team &lt;product@split.io&gt;.<p>Curious how the developers at split and the tech industry in general feel about this? A few years ago, there was a push towards renaming blacklist&#x2F;whitelist terms in major codebases like Go and PHP [0]. Github code search still shows 21M and 17M occurrences of whitelist&#x2F;blacklist.<p>---<p>Subject: ACTION REQUIRED: Change of non-diverse terminology in the platform<p>Dear webo,<p>Diversity, equity, and inclusion are fundamental to fair and effective organizations. With that in mind, terms like “whitelist” and “blacklist” cannot be separated from racial connotations, even if unintended, and must be thoughtfully reconsidered.<p>It is our responsibility to back up our values with definitive action. Earlier this year, we already replaced the term “whitelist” with “target individually” in Split’s UI.<p>Effective June 15th, the term “target individually” will also replace “whitelist” in Split definitions returned in Audit Logs Webhooks and integrations. Please note that replacing “whitelist” in Split definitions and Impressions may require actions from you. For example, if you’ve integrated around the Audit Logs Webhook and your integration is relying on the value “whitelist” being present in the “definition” field, the integration will likely break. We are here to offer any needed support.<p>Split definitions are JSON data structures that are made available to customers via webhooks and in integrations. If you have integrated one of these webhooks, are using one of the community integrations, or are using one of Split’s integrations, we suggest that you check if any updates need to be made on your end to accommodate the new “target individually” terminology.<p>If you’re unsure, you can confirm if this affects you by going to Admin Settings &#x2F; Integrations &#x2F; Configured and cross-checking with the list in the appendix here.<p>Later in 2022, we intend to release the third and final phase of the transition to introduce “target individually” to the Impressions data-structure. Until this last phase is complete, you will experience slight inconsistencies in the use of terminology.<p>Please don’t hesitate to contact our customer success team at support@split.io if you have any questions. We know this might be an inconvenience and are appreciative to have customers like yourselves that also care deeply about inclusivity. If necessary, we look forward to partnering with you to navigate this change without disruptions to your business.<p>Sincerely,\nThe Split Team<p>---<p>[0] https:&#x2F;&#x2F;go-review.googlesource.com&#x2F;c&#x2F;go&#x2F;+&#x2F;236857&#x2F; https:&#x2F;&#x2F;github.com&#x2F;php&#x2F;php-src&#x2F;pull&#x2F;5685",
      "time": 1652839943,
      "title": "Tell HN: Split.io replaces “whitelist” with “target individually” in it's UI",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 1,
      "id": 31418527,
      "kids": [
        31418624
      ],
      "score": 3,
      "time": 1652839884,
      "title": "Putin involved in war ‘at level of colonel or brigadier’, say western sources",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/may/16/putin-involved-russia-ukraine-war-western-sources"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31418515,
      "score": 1,
      "time": 1652839761,
      "title": "Google Clicks 'Undo' on Plan to Force Legacy Free Google Apps Users to Pay Up",
      "type": "story",
      "url": "https://www.pcmag.com/news/google-clicks-undo-on-plan-to-force-legacy-free-google-apps-users-to-pay"
    },
    {
      "by": "armsteadj1",
      "descendants": 0,
      "id": 31418511,
      "score": 1,
      "time": 1652839728,
      "title": "Dots 2.0 – Automate 1099/W8 payouts across any rail globally",
      "type": "story",
      "url": "https://dots.dev/"
    },
    {
      "by": "htroisi",
      "descendants": 0,
      "id": 31418506,
      "score": 2,
      "time": 1652839689,
      "title": "Game about squares (visual puzzle)",
      "type": "story",
      "url": "http://gameaboutsquares.com/?"
    },
    {
      "by": "ummonk",
      "descendants": 0,
      "id": 31418499,
      "score": 3,
      "time": 1652839576,
      "title": "John Deere Tractors Stolen by Russia in Ukraine Remotely Disabled",
      "type": "story",
      "url": "https://www.thedrive.com/news/john-deere-tractors-stolen-by-russia-in-ukraine-remotely-disabled"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31418493,
      "score": 1,
      "time": 1652839521,
      "title": "Debian Clojure Team 2022 Sprint Report",
      "type": "story",
      "url": "https://veronneau.org/clojure-team-2022-sprint-report.html"
    }
  ]
}