{
  "stories": [
    {
      "by": "LaMarineta",
      "descendants": 0,
      "id": 30935974,
      "score": 1,
      "time": 1649270928,
      "title": "La Marineta Xd",
      "type": "story"
    },
    {
      "by": "novateg",
      "descendants": 0,
      "id": 30935963,
      "score": 1,
      "text": "Monthly impressions for my website are 105,000 but only 83 clicks, which makes clickthrough rate of 0.1%<p>Screenshot: https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;JbDUpB7<p>How can I improve the clickthrough rate?",
      "time": 1649270884,
      "title": "Ask HN: How to Improve Conversion?",
      "type": "story"
    },
    {
      "by": "22222",
      "descendants": 0,
      "id": 30935960,
      "score": 1,
      "time": 1649270867,
      "title": "Alexey Navalny: How an ordinary Russian TV viewer sees it",
      "type": "story",
      "url": "https://twitter.com/i/status/1511368941758787592"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30935949,
      "score": 1,
      "time": 1649270839,
      "title": "Tailscale: Enabling HTTPS",
      "type": "story",
      "url": "https://tailscale.com/kb/1153/enabling-https/"
    },
    {
      "by": "djcollier",
      "descendants": 0,
      "id": 30935925,
      "score": 1,
      "time": 1649270716,
      "title": "How to Not Dread Rebases When Managing Long-Lived Feature Branches (2017)",
      "type": "story",
      "url": "https://sparkbox.com/foundry/how_to_not_dread_rebases_when_managing_long_lived_feature_branches"
    },
    {
      "by": "ilovecaching",
      "descendants": 0,
      "id": 30935918,
      "score": 1,
      "text": "&quot;“Free software” means software that respects users&#x27; freedom and community. Roughly, it means that the users have the freedom to run, copy, distribute, study, change and improve the software. Thus, “free software” is a matter of liberty, not price. To understand the concept, you should think of “free” as in “free speech,” not as in “free beer.” We sometimes call it “libre software,” borrowing the French or Spanish word for “free” as in freedom, to show we do not mean the software is gratis.\nYou may have paid money to get copies of a free program, or you may have obtained copies at no charge. But regardless of how you got your copies, you always have the freedom to copy and change the software, even to sell copies.&quot; - From the GNU Website.<p>Do you believe in Free Software? People often talk about the benefits of open source, but they tend to switch to proprietary, partly-proprietary (Jetbrains is a good example. Only parts of their products are open source), or corporate controlled open source (Corporations like Microsoft who espouse open source, but not free software because most of their stack is proprietary), when there&#x27;s convenience to be had.<p>Is free software a lost cause? If we believe in things like right to repair, must we also believe in free software? Is using free software for financial benefit and then not contributing back simply by promoting and using free software immoral? Are we building a bad future for software by not fighting for something like the Free Software movement?",
      "time": 1649270656,
      "title": "Ask HN: Do you believe in GNU's Free Software?",
      "type": "story"
    },
    {
      "by": "withzombies",
      "descendants": 0,
      "id": 30935917,
      "score": 1,
      "time": 1649270652,
      "title": "Watching the Watchers: Analyzing corporate automated bug reporters in Linux",
      "type": "story",
      "url": "https://margin.re/media/watching-the-watchers.aspx"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30935910,
      "score": 1,
      "time": 1649270633,
      "title": "Jack Dongarra, who made supercomputers usable, awarded 2021 ACM Turing prize",
      "type": "story",
      "url": "https://www.zdnet.com/article/jack-dongarra-who-made-supercomputers-usable-awarded-2021-acm-turing-prize/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30935872,
      "score": 1,
      "time": 1649270477,
      "title": "Large-anon: Practical scalable anonymous records for Haskell",
      "type": "story",
      "url": "https://well-typed.com/blog/2022/04/large-anon/"
    },
    {
      "by": "softwarebeware",
      "descendants": 0,
      "id": 30935832,
      "score": 1,
      "time": 1649270231,
      "title": "Utah dinosaur tracks damaged by construction machinery",
      "type": "story",
      "url": "https://www.npr.org/2022/04/04/1090870392/utah-dinosaur-tracks-damage-construction-project"
    }
  ]
}