{
  "stories": [
    {
      "by": "davidberreby",
      "descendants": 0,
      "id": 29112682,
      "score": 1,
      "time": 1636060884,
      "title": "Is It Ever OK to Bash a Robot?",
      "type": "story",
      "url": "https://robots4therestofus.substack.com/p/is-it-ever-ok-to-bash-a-robot"
    },
    {
      "by": "vermaden",
      "descendants": 0,
      "id": 29112670,
      "score": 1,
      "time": 1636060829,
      "title": "Enterprise Certificate Management on FreeBSD",
      "type": "story",
      "url": "https://klarasystems.com/webinars/on-demand-library/webinar-enterprise-certificate-management-on-freebsd/"
    },
    {
      "by": "rsj_hn",
      "descendants": 0,
      "id": 29112657,
      "score": 1,
      "time": 1636060756,
      "title": "Biden pushes G20 energy producing countries to boost production",
      "type": "story",
      "url": "https://www.reuters.com/business/energy/biden-push-g20-energy-producers-boost-capacity-ease-price-pressures-2021-10-30/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29112616,
      "score": 1,
      "time": 1636060453,
      "title": "New study illuminates the biology of a common heart disorder",
      "type": "story",
      "url": "https://medicalxpress.com/news/2021-11-illuminates-biology-common-heart-disorder.html"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 29112607,
      "score": 1,
      "time": 1636060372,
      "title": "A spin-coater from SLA-printed parts",
      "type": "story",
      "url": "https://kevinlynagh.com/spin-coater/"
    },
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 29112606,
      "score": 1,
      "time": 1636060372,
      "title": "The Engineered Student: On B. F. Skinner’s Teaching Machine",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/the-engineered-student-on-b-f-skinners-teaching-machine/"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 29112605,
      "score": 2,
      "time": 1636060367,
      "title": "Austin project would be biggest 3-D printed housing development in U.S.",
      "type": "story",
      "url": "https://www.wsj.com/articles/3-d-printed-houses-are-sprouting-near-austin-as-demand-for-homes-grows-11635240601"
    },
    {
      "by": "ChrisArchitect",
      "descendants": 0,
      "id": 29112600,
      "score": 2,
      "time": 1636060352,
      "title": "Eco-Bot.Net: exposing climate disinformation and greenwashing ads during COP26",
      "type": "story",
      "url": "https://eco-bot.net"
    },
    {
      "by": "nemoniac",
      "descendants": 0,
      "id": 29112552,
      "score": 2,
      "time": 1636060096,
      "title": "The “Ultimate” ThinkPad",
      "type": "story",
      "url": "https://calbryant.uk/blog/the-ultimate-thinkpad/#installing-an-ips-full-hd-panel"
    },
    {
      "by": "Nyra",
      "descendants": 0,
      "id": 29112546,
      "score": 1,
      "text": "I finished a degree in CS last December, though I&#x27;ve been unable to turn it into anything meaningful since. The difficult truth is that my alma mater did not actually teach me what I needed to know and I can admit to simply not being competent enough to deserve a job in the industry, which potential employers surely recognized. To give some sort of reference, by our capstone project neither my peers nor I were educated enough actually able to produce anything for that class, but most of us still graduated. To my credit, though, I was not given a choice for my thesis subject and it was in an objectively difficult field I was not really capable of tackling. Graduating left me with no satisfaction and nobody really understood when I described how hollow this &quot;accomplishment&quot; felt. I didn&#x27;t even wait a day before devising a curriculum for myself and starting.<p>I was lucky enough to meet an engineer at a FAANG (or is this MAANG, now?) who took me under their wing and it has been without a doubt the best thing to ever happen, giving me the chance to learn so much more than I ever did as an undergraduate or could have on my own. This relationship has gone on far longer than I expected but it can&#x27;t last forever. I feel like I let my mentor down every day, which hurts because despite my deficiencies they are incredibly supportive. After a few months of timidly applying for jobs, I gave up to focus on technical skills and even though I&#x27;ve sacrificed everything to pursue this (hobbies, social life, even my health because of the anxiety and pressure that plagues me) I&#x27;ve somehow stalled as I approach a year since finishing school.<p>A career in software isn&#x27;t even my measure of success, it only matters because I have deferred working my service job enough to accumulate any savings for time to study the overwhelming number of subjects needed to catch up and is now my only path for any sort of fiscal stability. Independent work and helping my friends seems far more appealing to me than professional employment and I&#x27;m not in it for the money. I genuinely love what I&#x27;m learning and find even the drier subjects fascinating, but it&#x27;s difficult because my knowledge is extremely unrounded. I have deep understanding of some complicated subjects and little to none on other basic ones. My biggest fear is that in ten years I&#x27;ll still be an unemployable, destitute hermit. My student loan repayment is due to start in January as well, making the 4.5 years in school seem like an absolute waste.<p>All I have to show for this time is design work I did for an (admittedly complicated) website I couldn&#x27;t finish developing, reimplementations of portions of the C++ STL library, some simple C data structures, and an assortment of very small-scale games. Please understand that I don&#x27;t blame anyone but myself for ending up in this position. More than anything I want to knowledgable and capable, but I don&#x27;t seem to be able to teach myself well enough to get there. I spend all of my time these days reading textbooks&#x2F;tutorials, working on Advent of Code and Leetcode problems, I probably need to get a real job or work with other people to make any meaningful progress on my abilities. The gap between graduation and now seems like an obstacle that only gets taller.<p>I&#x27;m not sure what to do at this point or when&#x2F;if I should call it and go a different direction. I know these types of threads probably pop up daily but I wanted to know if anyone else has been or is in this position and what advice they could give me. I have been deliberately vague about a lot of things in order to preserve anonymity.",
      "time": 1636060066,
      "title": "Ask HN: Finding Employment Post-Graduation",
      "type": "story"
    }
  ]
}