{
  "stories": [
    {
      "by": "spideymans",
      "descendants": 0,
      "id": 32179825,
      "score": 1,
      "time": 1658413680,
      "title": "Notion transitions to faster native mobile apps, and introduces new features",
      "type": "story",
      "url": "https://www.notion.so/releases/2022-07-20"
    },
    {
      "by": "domrdy",
      "descendants": 0,
      "id": 32179806,
      "score": 1,
      "time": 1658413567,
      "title": "Academia or Startup? A Decision Matrix for Future Scientist-Founders",
      "type": "story",
      "url": "https://www.nfx.com/post/techbio-scientists-academia-or-startup"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 32179805,
      "score": 1,
      "time": 1658413553,
      "title": "Microsoft starts blocking Office macros by default, once again",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-starts-blocking-office-macros-by-default-once-again/"
    },
    {
      "by": "yannchx",
      "descendants": 0,
      "id": 32179804,
      "score": 1,
      "time": 1658413546,
      "title": "How Brian Eno Created \"Ambient 1: Music for Airports\"",
      "type": "story",
      "url": "https://reverbmachine.com/blog/deconstructing-brian-eno-music-for-airports/"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 32179797,
      "score": 1,
      "text": "About 1.5 years ago, I introduced my review aggregator BuyForLife on Hacker News, where it became the #8 most upvoted Show HN project of all time. The idea of helping people to make better purchasing decisions continued to chase me over the last year. \nHere are some stats that illustrate how important online reviews are:<p>• 90% check online reviews as part of their online buying journey<p>• 43% visit 5-10 websites to research a product<p>• 75% spend more than a day doing research before buying a product<p>The top frustrations with the current process are:<p>• Google full of SEO spam and Ads<p>• Fake reviews<p>• Fragmented trusted sources<p>• Inconsistent information across sources<p>Thanks to the recent advances in NLP (transformers, GPT-3, etc.) it became possible to solve these problems at scale, so I decided to team up with my co-founders Johnny and Tavis to build <a href=\"https:&#x2F;&#x2F;Looria.com\" rel=\"nofollow\">https:&#x2F;&#x2F;Looria.com</a>.<p>We aggregate and summarize the most trusted product reviews on the web. Just like Rotten Tomatoes provides trustworthy ratings for movies, Looria offers ratings and reviews for all kinds of products. Our vision is to make Looria the go-to platform for making purchase decisions.<p>Let me try to answer a few questions:<p># Why should you trust this meta review site over the 100&#x27;s of other meta or search sites and 10,000&#x27;s of fake review sites on the web?<p>-&gt; We are completely unbiased and transparent. We are not affiliated with any of the businesses or products that we review, so we have no incentive to skew our ratings in any way.\nOur team has a deep understanding of the product review space and the specific problems that exist within that market. We&#x27;re also solving our own problem after spending countless hours finding and researching good products.<p># Why can&#x27;t I just go to Wirecutter or Consumer Reports directly?<p>-&gt; Most people don&#x27;t trust anyone blindly and look at multiple opinions (4-7 websites on average). One single place will never be &quot;just enough&quot; for a product you&#x27;re planning to use for a long time and spend quite some money on it. There is often at least one deal-breaking issue that you will find after reading through different sources.<p>Many people rely on Reddit for reviews. Redditors and other forum members are more interested in boosting their ego by showing their depth of knowledge on the topic (and correcting others on the topic), whereas corporate websites are more interested in generating clicks.<p># How do you avoid fake reviews?<p>-&gt; Fake reviews are a big challenge that even platforms like Amazon don&#x27;t have under control. Good fake reviews are technically almost impossible to detect, even with sophisticated network analysis of the reviewer&#x27;s profile.<p>We focus on keeping track of and removing the special status of sources caught getting paid to write fake reviews. Some categories are more prone to astroturfing than others, and we account for that by restricting the sources. Actively curating the sources is part of our daily work.<p># What are Exit Reviews?<p>-&gt; Another big frustration with product research is the lack of long-term product information.\nWe should reflect upon how a product performed over its duration of service instead of when it first arrived and people haven&#x27;t spent much time with it to learn the quirks.\nThat&#x27;s why we&#x27;re building exitreviews.com - a community where people can learn how products performed over their lifetime, where they failed, and how to fix them.<p># What&#x27;s next?<p>-&gt; We will soon start integrating this data into our product recommendations. For example, we could show the average cost per month of ownership or the percentage of people who would&#x2F;wouldn&#x27;t buy the product again after its exit.<p>Looria is still in beta and our data is far from perfect. We&#x27;re working hard on improving the data quality, adding better filters, and scaling to many more categories.<p>We&#x27;d love to hear what you think about Looria, product research, and how to fix it.",
      "time": 1658413508,
      "title": "Show HN: Looria – A Rotten Tomatoes-style platform for products",
      "type": "story",
      "url": "https://looria.com"
    },
    {
      "by": "mikece",
      "descendants": 1,
      "id": 32179794,
      "kids": [
        32179809
      ],
      "score": 3,
      "time": 1658413502,
      "title": "Apple Indonesia agreement could force company to hand over iCloud data",
      "type": "story",
      "url": "https://9to5mac.com/2022/07/21/apple-indonesia/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 32179790,
      "score": 1,
      "time": 1658413496,
      "title": "Wearable activity trackers encourage us to walk up to 40 minutes more each day",
      "type": "story",
      "url": "https://www.unisa.edu.au/media-centre/Releases/2022/wearing-your-fitness-on-your-sleeve-is-great-for-the-heart/"
    },
    {
      "by": "tonerow",
      "descendants": 0,
      "id": 32179784,
      "score": 1,
      "time": 1658413468,
      "title": "DALL-E as a graphic design tool",
      "type": "story",
      "url": "https://tone-row.com/blog/dall-e-2"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 32179769,
      "score": 1,
      "time": 1658413349,
      "title": "Notation and Thought",
      "type": "story",
      "url": "https://github.com/k-qy/notation"
    },
    {
      "by": "liberia",
      "descendants": 0,
      "id": 32179765,
      "score": 1,
      "time": 1658413326,
      "title": "NSO Is Conducting a Lobbying Campaign to Get Off U.S. Blacklist",
      "type": "story",
      "url": "https://www.propublica.org/article/pegasus-spyware-nso-israel-blacklist-lobbying"
    }
  ]
}