{
  "stories": [
    {
      "by": "kurinikku",
      "descendants": 0,
      "id": 29409936,
      "score": 1,
      "time": 1638397402,
      "title": "Show HN: Implementing a minimal Bitcoin-inspired block in Python",
      "type": "story",
      "url": "https://ezzeriesa.notion.site/1-1-Blocks-7ac100e797924a18b1af4765b9497b5a"
    },
    {
      "by": "uptown",
      "descendants": 0,
      "id": 29409933,
      "score": 1,
      "text": "I have a number of domain names I&#x27;m looking to dispose of.  Though I&#x27;ve been gradually allowing some to lapse at the end of their registry period, I suspect that others have some value.  I&#x27;ve sold a few domain names over the years, but am curious whether there are new platforms that provide better exposure or more-protection for both buyers and sellers beyond using an escrow service to manage the transfer.",
      "time": 1638397393,
      "title": "Ask HN: What is the best platform for selling domain names?",
      "type": "story"
    },
    {
      "by": "platformx",
      "descendants": 0,
      "id": 29409899,
      "kids": [
        29409942
      ],
      "score": 3,
      "time": 1638397222,
      "title": "Unlimited forwarding email addresses, snooze selected sender emails, once a week",
      "type": "story",
      "url": "https://eml.monster"
    },
    {
      "by": "JakubKolor",
      "descendants": 0,
      "id": 29409898,
      "score": 1,
      "text": "Hi! We have created Kolor, the first social media dapp.<p>Check it out here: https:&#x2F;&#x2F;kolor.social&#x2F;<p>Use MetaMask and Ropsten testnet to log in.<p>What is it?<p>Kolor is a decentralized social platform based on blockchain. The purpose of Kolor is to create a platform that enables creators to make their content permanent and get deserved appreciation for it. Users log in with their crypto wallets, so they can remain anonymous if that&#x27;s what they desire. They are also just one click away from tipping their favorite creators. The core idea of Kolor is that all content is free of ads available to everyone. If you like a particular creator, then you&#x27;re welcome to appreciate their posts with ETH or (soon) any ERC-20 tokens (yes, you will be able to use Shiba Inu coin!).<p>What do I get from it?<p>On Kolor, a creator will have to think twice about posting content which serves no value because of gas fees (it costs money to upload a post). That way as a user you can expect only high quality content on the platform.<p>How do creators get rewarded?\nOn Kolor there&#x27;s no like button. The way you appreciate artists is by transferring them your ETH and (soon) all ERC-20 tokens such as DAI, SHIB or anything you like! In further stages of development Kolor Creators will also be rewarded in Kolor Token.<p>How does it work?<p>When you upload posts to Kolor, they are sent to the blockchain. Right now we&#x27;re using Ropsten testnet just to gather user feedback, in the later stages of development we are planning to integrate multiple chains. The post is sent to mempool (just like a normal transaction would) and after the next block is mined it is ready to be displayed on Kolor.<p>What network is it on?<p>The app is currently deployed on Ropsten testnet.\nHow do I interact with the dapp?\nTo interact with Kolor you need some testnet ethers. You can get some for free here: https:&#x2F;&#x2F;faucet.dimensions.network&#x2F; or here: https:&#x2F;&#x2F;faucet.ropsten.be&#x2F; and them have fun with them on https:&#x2F;&#x2F;kolor.social&#x2F;\nHow do I log into the dapp?\nTo log into Kolor you need MetaMask wallet browser extension (https:&#x2F;&#x2F;metamask.io&#x2F;)<p>Thanks for getting familiar with Kolor!<p>We&#x27;re looking forward to getting feedback from you.",
      "time": 1638397217,
      "title": "Revolutionary Social Media Dapp",
      "type": "story"
    },
    {
      "by": "lawrenceyan",
      "descendants": 0,
      "id": 29409894,
      "score": 1,
      "time": 1638397202,
      "title": "Instagram Is Facebook Now",
      "type": "story",
      "url": "https://embedded.substack.com/p/instagram-is-facebook-now"
    },
    {
      "by": "poetically",
      "descendants": 0,
      "id": 29409871,
      "score": 1,
      "time": 1638397085,
      "title": "The Chaos in Our Hands",
      "type": "story",
      "url": "https://medium.com/@shradha.kundra/the-pandemic-has-forced-us-to-unlearn-and-relearn-normalcy-2f21acfc83a9"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 29409866,
      "score": 1,
      "time": 1638397045,
      "title": "Which languages support operators as first-class citizens?",
      "type": "story",
      "url": "https://softwareengineering.stackexchange.com/questions/318233/which-programming-languages-support-operators-as-first-class-citizens"
    },
    {
      "by": "tekkertje",
      "descendants": 0,
      "id": 29409795,
      "score": 1,
      "time": 1638396663,
      "title": "Completing a member knowledge graph with Graph Neural Networks",
      "type": "story",
      "url": "https://engineering.linkedin.com/blog/2021/completing-a-member-knowledge-graph-with-graph-neural-networks"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 29409771,
      "score": 2,
      "time": 1638396545,
      "title": "If London Breed thinks San Francisco's mask mandate is a joke, she should say so",
      "type": "story",
      "url": "https://www.sfgate.com/politics-columns/article/London-Breed-San-Francisco-mask-mandate-nightclub-16665410.php"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29409753,
      "score": 2,
      "time": 1638396404,
      "title": "My worst tech interview experience",
      "type": "story",
      "url": "https://www.jessesquires.com/blog/2021/12/01/my-worst-tech-interview-experience/"
    }
  ]
}