{
  "stories": [
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 28180629,
      "score": 1,
      "time": 1628949220,
      "title": "The climate refugees in Madrid’s malls:They stay there all day because it’s cool",
      "type": "story",
      "url": "https://english.elpais.com/society/2021-08-13/the-climate-refugees-in-madrids-shopping-malls-they-stay-there-all-day-because-its-cool.html"
    },
    {
      "by": "codesternews",
      "descendants": 0,
      "id": 28180581,
      "score": 1,
      "time": 1628948859,
      "title": "Bad Interview: Apple Chief Explains ‘Misunderstood’ iPhone Child-Protection",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=OQUO1DSwYN0"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 28180579,
      "score": 1,
      "time": 1628948841,
      "title": "Massachusetts Startup Hopes to Move a Step Closer to Commercial Fusion",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/10/technology/commonwealth-fusion-mit-reactor.html"
    },
    {
      "by": "coder28",
      "descendants": 1,
      "id": 28180566,
      "kids": [
        28180567
      ],
      "score": 1,
      "time": 1628948732,
      "title": "Junior engineers need these non coding skills",
      "type": "story",
      "url": "https://www.codingshorts.io/blog/junior-software-engineer"
    },
    {
      "by": "sbuttgereit",
      "descendants": 0,
      "id": 28180563,
      "score": 2,
      "time": 1628948708,
      "title": "Time trends and factors related to Covid-19 vaccine hesitancy: a large US survey",
      "type": "story",
      "url": "https://www.medrxiv.org/content/10.1101/2021.07.20.21260795v1"
    },
    {
      "by": "areoform",
      "descendants": 0,
      "id": 28180559,
      "score": 2,
      "time": 1628948688,
      "title": "Project Echo",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Project_Echo"
    },
    {
      "by": "throwmea",
      "descendants": 0,
      "id": 28180551,
      "kids": [
        28180564
      ],
      "score": 1,
      "text": "I recently found me in the situation that some peers in a specific group use social media alot. I use(d) Instagram from my photography and enjoyed Facebook for a while and streamed on Twitch for some friends. I tried Twitter recently but dont like it that much. Especially in IT-Security seems like you either have an professional Twitter account or some anonymous one with anime and meme posts in between. Now im slowly in a situation where i want to post what i create (writing a blog, writing papers, posting images, throwing my oppinion into the world) but i also enjoy consuming and sharing a lot of Meme and Gaming content or other foolery and see that some others are completely fine without social media at all or do a much better job seperating. No one prepared me for this private vs public content predicement and part of my decision difficulties are the question if it is even necessary at all. Im not a very social guy so i got to know some great people through social media (that im now friends with IRL), but overall it seems pretty time consuming. I never wanted to be one of those narcists feeling happy when 20 people like the selfie you post but i realised how easy it is to fall for it and how tempting it can be. Another fear is missing out on things. You can read tweets from every conference and almost all vulnerability reports include twitter handles and are shared shortly after they go public. You could spend 24&#x2F;7 getting the latest news on certain topics and i did pretty much that for a while. Now im wondering how much it gives you an advantage over those who dont use social media. When you have people who listen - an audience - its much easier to spread your work or projects. You can get in touch with others and spread word about your latest discoveries. But good work should also spread by itself, right? Is it worth the effort being on social media and building and audience or is it better to pour the effort into the work itself? Also how do you get to know other people when not using it and how can you share your projects with others? Im just having difficulties dealing with social media and this kind of concepts. Its not like smoking where you have a warning on the package - i realise the mental effects only now that i used it for quite some time. Ive probably been more productive when not checking my phone every 5 min (though this is mostly messangers) and thinking about social networks. Also why do i even want to blog or share what i do? Shouldnt it be enough to do it because i want to? Theres so many questions and difficulties. As far as i can see Bezos stopped using Twitter too - wonder if he had the same struggle.<p>So how do you deal with social media? How do your friends do? Is it necessary to use it in your field or can you be successfull withiout it? Even in the future?<p>Addition: I even have to stay away from Hacker News regulary because theres too much content that i want to read",
      "time": 1628948649,
      "title": "Ask HN: How do you deal with social media",
      "type": "story"
    },
    {
      "by": "shadowprofile76",
      "descendants": 0,
      "id": 28180545,
      "score": 1,
      "time": 1628948584,
      "title": "Canada's awful new proposals on “harmful” content",
      "type": "story",
      "url": "https://pluralistic.net/2021/08/11/the-canada-variant/#no-canada"
    },
    {
      "by": "lycopodiopsida",
      "descendants": 1,
      "id": 28180531,
      "kids": [
        28180612
      ],
      "score": 3,
      "time": 1628948485,
      "title": "The Perl Foundation is fragmenting over Code of Conduct enforcement",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/08/the-perl-foundation-is-fragmenting-over-code-of-conduct-enforcement/"
    },
    {
      "by": "traverseda",
      "descendants": 0,
      "id": 28180528,
      "score": 1,
      "text": "You can no longer use your password to push to get repositories.<p>The explanation given on the blog rings a bit hollow, for such a major change. I&#x27;d be interested in hearing hackernew&#x27;s thoughts on what actually brought this change on.",
      "time": 1628948466,
      "title": "Ask HN: Why did GitHub remove password auth?",
      "type": "story"
    }
  ]
}