{
  "stories": [
    {
      "by": "ttyp3",
      "descendants": 0,
      "id": 31357291,
      "score": 2,
      "time": 1652376790,
      "title": "Manhattan Apartment Rents Hit Record with Intense Summer Ahead",
      "type": "story",
      "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=994e472f-d219-11ec-9630-415958627470&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNS0xMi9tYW5oYXR0YW4tYXBhcnRtZW50LXJlbnRzLWhpdC1yZWNvcmQtd2l0aC1pbnRlbnNlLXN1bW1lci1haGVhZA=="
    },
    {
      "by": "ttunguz",
      "descendants": 0,
      "id": 31357283,
      "score": 1,
      "time": 1652376759,
      "title": "Five MidYear Predictions for Web3",
      "type": "story",
      "url": "https://tomtunguz.com/6-midyear-predictions-web3/"
    },
    {
      "by": "krn",
      "descendants": 0,
      "id": 31357264,
      "score": 1,
      "time": 1652376689,
      "title": "The Passion Economy and the Future of Work",
      "type": "story",
      "url": "https://future.a16z.com/passion-economy/"
    },
    {
      "by": "sjav",
      "descendants": 0,
      "id": 31357257,
      "score": 1,
      "time": 1652376666,
      "title": "Why founders are the lifeblood of global tech ecosystems",
      "type": "story",
      "url": "https://restofworld.org/2022/why-founders-are-the-lifeblood-of-global-tech-ecosystems/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31357255,
      "score": 1,
      "time": 1652376663,
      "title": "$4.6M Series Seed to defend open source from supply chain attacks",
      "type": "story",
      "url": "https://socket.dev/blog/series-seed"
    },
    {
      "by": "gobienan",
      "descendants": 0,
      "id": 31357238,
      "score": 1,
      "text": "As crazy as it sounds, I really created my own task board because no one worked for me. There is just a huge gap between Jira (which is a mess) and something like Todoist (which is too simple).<p>So I build 7todos for myself. A task board to fill the gap. And over time a lot of people have joined and love it as well. One of my favorite feedback<p>&quot;In my opinion, it does that better than all the other more comprehensive tools like DoneDone, Easynote, or Anywhere. Other tools may have more features or focus on teamwork, but when I work with them, I consistently feel like they slow me down. Not so with 7todos.&quot;<p>The kind of feedback you love to hear, especially as an indie maker<p>7todos aims to help you to get an overview of all workspaces and all your tasks across projects, and maybe it can also help you :)",
      "time": 1652376590,
      "title": "Show HN: I Built a Task Board for Makers",
      "type": "story",
      "url": "https://www.7todos.com/"
    },
    {
      "by": "kavehkhorram",
      "descendants": 0,
      "id": 31357221,
      "score": 1,
      "text": "Hey HN: Kaveh here, the founder of https:&#x2F;&#x2F;www.usage.ai&#x2F;<p>We help companies drive down AWS EC2 spend. Why? Because the way it&#x27;s done now is a pain. DevOps engineers end up becoming cloud accountants trying to figure out what commitments are expiring soon and how much they&#x27;re saving.<p>Previous to founding Usage, I worked on high-performance computing research at JP Morgan Chase and as a software engineer at a number of medium-sized startups.<p>Here&#x27;s how it works: We are typically brought in by a DevOps manager to cut AWS EC2 costs. The app is entirely self-service and the savings are generated automatically, typically we do this live on a call. On average, we reduce AWS EC2 spend by 57% for 5 minutes of work.<p>To reduce by ~57%, we don&#x27;t touch the instances, require any code change, or change the performance of your instances. We buy Reserved Instances on your behalf (a billing layer change only) and bundle them with guaranteed buyback. So you get the steep 57% savings of 3-year no-upfront RIs with none of the commitment (you can sell them back to us anytime after 30 days).<p>We make money off a 20% Savings Fee. Happy to chat directly kaveh@usage.ai<p>Have you experienced any issues with managing your company or organization&#x27;s AWS expenses? We&#x27;d love to hear your feedback and ideas!",
      "time": 1652376542,
      "title": "Show HN: I built a service to help companies reduce AWS spend by 50%",
      "type": "story"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 31357220,
      "score": 1,
      "time": 1652376541,
      "title": "MicroStrategy shares tumbling as the firm's Bitcoin bet falls underwater",
      "type": "story",
      "url": "https://www.cnbc.com/2022/05/12/microstrategy-shares-fall-as-software-firms-bitcoin-bet-is-underwater.html"
    },
    {
      "by": "BuffaloBagel",
      "descendants": 0,
      "id": 31357219,
      "score": 1,
      "time": 1652376540,
      "title": "Chinese national sentenced for kickbacks as purchaser for Utah home audio cmpy",
      "type": "story",
      "url": "https://www.stgeorgeutah.com/news/archive/2022/05/11/cgb-washington-city-man-sentenced-in-federal-court-for-taking-2-1-million-in-illegal-kickbacks/"
    },
    {
      "by": "wirelesspotat",
      "descendants": 0,
      "id": 31357202,
      "score": 1,
      "time": 1652376495,
      "title": "Researchers find a potential biomarker for Sudden Infant Death Syndrome",
      "type": "story",
      "url": "https://www.thelancet.com/journals/ebiom/article/PIIS2352-3964(22)00222-5/fulltext"
    }
  ]
}