{
  "stories": [
    {
      "by": "revorad",
      "descendants": 0,
      "id": 32131519,
      "score": 1,
      "time": 1658093363,
      "title": "The Hypocrisy of Elites",
      "type": "story",
      "url": "https://eriktorenberg.substack.com/p/the-hypocrisy-of-elites"
    },
    {
      "by": "JPLeRouzic",
      "descendants": 0,
      "id": 32131511,
      "score": 1,
      "time": 1658093327,
      "title": "Blood Exchange and Alzheimer's Disease",
      "type": "story",
      "url": "https://padiracinnovation.org/News/"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 32131510,
      "score": 1,
      "time": 1658093311,
      "title": "Kuai Kuai Culture",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Kuai_Kuai_culture"
    },
    {
      "by": "eupolin",
      "descendants": 0,
      "id": 32131497,
      "score": 2,
      "text": "The following situation is at hand.<p>I am in my early 20s and I am “grinding” my way through life. I am pursuing different fields of interest like:<p>+ Investing<p>+ Practicing Martial Arts<p>+ Going to the gym<p>+ Studying AI (Distance learning university)<p>+ Reading business books (Right now – Ray Dalio – Principles)<p>I tried to involve people into my circle to go through this path with me. With more than 10 different people I tried to start something, every time something went wrong. People wouldn’t stick to the plan, or people would break loyalty for short term benefits while blending out the long-term outcomes (Me myself did mistakes also). Through a long time of self-reflection, I realized that my expectations in terms of work-ethic are very high. And this could be the thing why I can’t be with some types of people (I guess that in my close real-life environment there just isn’t that much potential to find – most of the people here can’t even get a basic school degree). Also, I am a very direct person, I’m not going to talk around your problems, and mine. They will be addressed immediately. Not caring about small talk is one of my “skills” also, if it is not somehow related to the goals that are set in place, my subconscious gets bored (I can’t really control that, if I try not to, it is hard).<p>So, for better clarification - the plan that I am following is:<p>1. Get money for moving out of mom’s apartment and starting my own business (In AI – with investment profits)<p>2. Creating a company in the field of artificial intelligence (don’t know the specific product or service yet)<p>3. And while doing that – maintaining Gym, MA, and book reading (self-improvement)<p>The most important one here is the actualization of the AI company.<p>These are a lot of questions, and it would be nice if somebody could give them a look:<p>+ So, I am here and asking you guys. Do you have any tips to find running mates or a small community with “smart” people that are believable and capable (Focus on: Business, AI, and self-improvement overall)?<p>+ Or what would you do in your early 20s if your endeavors would be similar as mine? Do you have any general suggestions to proceed better&#x2F;more efficiently in these areas? (For e.g., good books, structured daily routines (which were beneficial for your progress and goals), networking strategies, tips on working effectively for a &quot;normal guy&quot; with big temptations but also huge ambitions.<p>+ How would you a structure a basic &quot;get-out-plan&quot; out of your mom&#x27;s basement if you are hitting all these areas with the 20&#x2F;80 principle? The money is by any means - simply put - too low, without a well-paying job.<p>+ Should I just patiently wait and follow my usual grind while studying and managing all these other areas with a 20 percent input (gym, reading self-development books etc.) or would you consider a smarter way to get out?<p>It would help me a lot to get thoughtful answers, thanks!",
      "time": 1658093259,
      "title": "Ask HN: I need some advice from intelligent people on my situation",
      "type": "story"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 32131449,
      "score": 2,
      "time": 1658093014,
      "title": "JavaScript Decimal Proposal",
      "type": "story",
      "url": "https://github.com/tc39/proposal-decimal"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 32131411,
      "score": 1,
      "time": 1658092749,
      "title": "B4: Experience with a globally-deployed software defined WAN",
      "type": "story",
      "url": "https://research.google/pubs/pub41761/"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 32131401,
      "score": 1,
      "time": 1658092701,
      "title": "Don't Use Manjarno",
      "type": "story",
      "url": "https://manjarno.snorlax.sh/"
    },
    {
      "by": "swarmy",
      "descendants": 0,
      "id": 32131396,
      "score": 3,
      "time": 1658092682,
      "title": "Rowan Atkinson: Visual Comedy (1992) [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LeuiFa9pI7c"
    },
    {
      "by": "sogen",
      "descendants": 0,
      "id": 32131393,
      "score": 2,
      "time": 1658092668,
      "title": "UI Browser Going Away",
      "type": "story",
      "url": "https://www.pfiddlesoft.com"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32131376,
      "score": 3,
      "time": 1658092574,
      "title": "China is mining data directly from workers’ brains on an industrial scale (2018)",
      "type": "story",
      "url": "https://www.scmp.com/news/china/society/article/2143899/forget-facebook-leak-china-mining-data-directly-workers-brains"
    }
  ]
}