{
  "stories": [
    {
      "by": "em-bee",
      "descendants": 0,
      "id": 30949661,
      "score": 1,
      "time": 1649361593,
      "title": "Fedora Plans to Drop Support for Legacy BIOS Systems",
      "type": "story",
      "url": "https://linuxiac.com/fedora-plans-to-drop-support-for-legacy-bios-systems/"
    },
    {
      "by": "gear_envy",
      "descendants": 0,
      "id": 30949658,
      "score": 1,
      "text": "Reader modes have become a very important browser feature for me. I can&#x27;t read an article on the internet these days without them. They allow me to avoid the autoplay videos, newsletter subscription popups, and the other annoying web design trends that plague news and publication websites. Sometimes I can even skip the paywalls!<p>Here&#x27;s a low-effort comparison between the readers on Chrome, Firefox, and Edge.<p>Chrome: Hidden by default, accessible via chrome:&#x2F;&#x2F;flags, a choice of three fonts (Serif, Sans-Serif, and Monospace), white&#x2F;sepia&#x2F;dark modes, and a content scale slider. Clearly not a priority for Chrome devs.<p>Firefox: Accessible by keyboard command (Option+Command+R on Mac), Two fonts only (Serif and Sans-Serif), font size adjustment, white&#x2F;sepia&#x2F;dark modes, and independent height and width adjustments for content. You also get a read aloud feature and a Save to Pocket button.<p>Edge: 3 fonts (Calibri, Sitka and ugh, Comic Sans), text size slider, 3 text column sizes, and a lot more colors for reader theme than just white&#x2F;sepia&#x2F;dark. Probably has the most extra features. Access with F9, translation, line focus, grammar tools, and a read aloud that I prefer over Firefox&#x27;s.<p>Here&#x27;s a previous discussion: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28286493<p>What do you all think about reader modes?",
      "time": 1649361577,
      "title": "Ask HN: Thoughts on Browser Reader Modes?",
      "type": "story"
    },
    {
      "by": "andyjih_",
      "descendants": 0,
      "id": 30949649,
      "score": 1,
      "time": 1649361538,
      "title": "Airbyte Acquires Grouparoo to Accelerate OSS Data Movement",
      "type": "story",
      "url": "https://airbyte.com/blog/airbyte-acquires-grouparoo-to-accelerate-data-movement"
    },
    {
      "by": "serverlessmom",
      "descendants": 0,
      "id": 30949638,
      "score": 1,
      "time": 1649361510,
      "title": "Building Product Notifications That Users Love",
      "type": "story",
      "url": "https://www.courier.com/blog/building-product-notifications-that-users-love/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30949614,
      "score": 1,
      "time": 1649361377,
      "title": "Caïssa",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ca%C3%AFssa"
    },
    {
      "by": "voussoir",
      "descendants": 0,
      "id": 30949609,
      "score": 1,
      "time": 1649361348,
      "title": "Night Light (1995)",
      "type": "story",
      "url": "https://voussoir.net/writing/night_light_1995"
    },
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 30949588,
      "score": 1,
      "time": 1649361234,
      "title": "Pink Floyd – Hey Hey Rise Up (Feat. Andriy Khlyvnyuk of Boombox)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=saEpkcVi1d4"
    },
    {
      "by": "wppick",
      "descendants": 0,
      "id": 30949580,
      "score": 1,
      "text": "Want to just put this idea out there for the feasibility of a crypto currency backed not by solving hard computations, but instead for producing clean, pure water.<p>High quality water and availability seems to be trending in the direction of scarcity. You might think this is ridiculous, since there appears to be an unlimited supply of tap water, but how clean is that water? Tap water is increasingly becoming polluted in ways hard to clean. Microplastics, metals, hormones like estrogen, possible contamination by farming, industry.<p>What if the work done to mine the crypto currency was the cleaning of water. Either waste water, salt water, or tap water locally (in the home, or apartment complex, or neighbourhood level).<p>It would need a way to be cheat-proof, but there could be a water-exchange where you can consume or inject clear water and receive&#x2F;spend crypto-currency.<p>How harebrained of an idea is it? The fundamental problem is there, but the execution would need to be heavily regulated (possibly limited to highly trusted actors). What if a future fiat currency were not backed by something like gold, or Bitcoin, but clean water?",
      "time": 1649361205,
      "title": "Proposal: Crypto Mining for Clean Water",
      "type": "story"
    },
    {
      "by": "pwillia7",
      "descendants": 0,
      "id": 30949562,
      "score": 1,
      "time": 1649361103,
      "title": "Howard Zinn in his own words (2011)",
      "type": "story",
      "url": "https://blogs.umb.edu/joinercenter/2011/02/22/howard_zinn/"
    },
    {
      "by": "tooltower",
      "descendants": 0,
      "id": 30949545,
      "score": 2,
      "time": 1649361015,
      "title": "Tanis: Fossil of dinosaur killed in asteroid strike found, scientists claim",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-61013740"
    }
  ]
}