{
  "stories": [
    {
      "by": "exz",
      "descendants": 0,
      "id": 31959068,
      "score": 1,
      "time": 1656770620,
      "title": "YC makes a Product Hunt, Product Hunt makes an A16Z, A16Z makes a YC",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/02/yc-makes-a-product-hunt-product-hunt-makes-an-a16z-a16z-makes-a-yc/"
    },
    {
      "by": "__warlord__",
      "descendants": 0,
      "id": 31959067,
      "score": 1,
      "time": 1656770610,
      "title": "Lessons I learned from senior engineers",
      "type": "story",
      "url": "https://memooo.ooo/posts/senior-engineers/"
    },
    {
      "by": "ugjka",
      "descendants": 0,
      "id": 31959044,
      "score": 1,
      "time": 1656770442,
      "title": "Samsung Has a Way to Increase DRAM over PCIe",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tJ9djg0lCk8"
    },
    {
      "by": "samizdis",
      "descendants": 1,
      "id": 31959035,
      "kids": [
        31959042
      ],
      "score": 1,
      "time": 1656770363,
      "title": "Super-Earths with atmospheres far from their star may be habitable",
      "type": "story",
      "url": "https://www.axios.com/2022/07/02/super-earth-planets-habitability"
    },
    {
      "by": "pmontra",
      "descendants": 0,
      "id": 31959016,
      "score": 1,
      "time": 1656770214,
      "title": "Node-Tor",
      "type": "story",
      "url": "https://github.com/Ayms/node-Tor"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31958998,
      "score": 2,
      "time": 1656770086,
      "title": "RadioShack reinvents itself as a crypto platform with wild tweets",
      "type": "story",
      "url": "https://www.washingtonpost.com/business/2022/07/01/radio-shack-tweets/"
    },
    {
      "by": "Pasternak",
      "descendants": 0,
      "id": 31958978,
      "score": 1,
      "text": "Hi guys!<p>I&#x27;m 18 years old and starting my second business called Metacom Platforms.<p>Our mission is to remove the borders between the brand and the market, to align their values and incentives.<p>Metacom will function as a digital platform decentralising the e-commerce market where products will be opened up for co-creation and co-ownership using blockchain technology.<p>Think of it as a combination of crowdsourcing and crowdfunding. For example, if a brand decides to release a new product collection they&#x27;ll be able to put out a very basic version of it on the platform for their market. If the product is something the market finds value in they could purchase an NFT representing an ownership share of that product collection. That NFT will also result in a dividends per sale in real time using blockchain. Since the owner of the NFT is a co-owner of the product collection they can be a part of the product development.<p>This will reduce the brands risk and increase the brands efficiency by raising the financial resources needed to develop the product after a proof-of-concept from the market. Meaning much less risk for the brand to release the product whilst not needing as much resources to develop more products. Using this platform a brand can release way more products per quarter because of a larger pool of creativity and financial resources.<p>The vision is for our commerce to go beyond the existing one. Beyond commerce, meta commerce.<p>Anyways, any feedback on the business model or business concept is very much appreciated!<p>If you want to know more the website is metacom.market",
      "time": 1656769935,
      "title": "Decentralising E-Commerce",
      "type": "story"
    },
    {
      "by": "jakobov",
      "descendants": 0,
      "id": 31958973,
      "score": 1,
      "text": "I want to get access to one of the leading LLMs. I am not picky which one. What is the best way to get access?",
      "time": 1656769904,
      "title": "Ask HN: What is the best way to get access to a LLM?",
      "type": "story"
    },
    {
      "by": "songeater",
      "descendants": 1,
      "id": 31958970,
      "kids": [
        31959018
      ],
      "score": 1,
      "time": 1656769885,
      "title": "Prokaryote or eukaryote? A unique microorganism from the deep sea (2012)",
      "type": "story",
      "url": "https://academic.oup.com/jmicro/article-abstract/61/6/423/1989140?redirectedFrom=fulltext"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31958969,
      "score": 1,
      "time": 1656769880,
      "title": "Bicycle Handlebars",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bicycle_handlebar"
    }
  ]
}