{
  "stories": [
    {
      "by": "FrenchAmerican",
      "descendants": 0,
      "id": 30973771,
      "score": 2,
      "text": "Our future on Earth is rather gloomy. We are causing a massive climate dereliction and an even larger loss of biodiversity - and we do very little about it.<p>The space programs to send humans in space are at the same time granted hundreds of billions. Many point that maybe this money should be invested in ... discovering our oceans rather than setting up a base on the Moon.<p>I was until recently convinced that it would be much more relevant. Now I wonder: Could it be better to keep the oceans away from our knowledge?<p>I know how absurd it sounds. My opinion varies accordingly to my mood, I reckon. One day, I have faith that knowledge and Science is The Way. The other day, I can&#x27;t help thinking that the current unchecked capitalism will ruthlessly exploit whatever Science discovers at whatever cost for the climate and biodiversity.<p>Could it be more ethical to keep our oceans and seas out of reach of capitalism?<p>Of course, it&#x27;s easy to argue that a better knowledge will empower the protectors of the oceans, since unchecked capitalism is already depleting the seas.<p>Scientific arguments would be therefore the only way to convince the governments to preserve the oceans.<p>But would they really? In the last 30 years, the IPCC reports have proved reliable. Its climate model has been being tuned continuously and their last report is now very reliable.<p>And yet we do nothing at the scale of the issue.<p>So what is the point, really, to know more about our oceans except opening new ways to make profits while destroying Life?<p>Hoping for the best as a principle is nice. And easy. But doing again and again the same error is stupid, isn&#x27;t it?<p>If we believed in Science and Technology as much as we pretend, why aren&#x27;t the 300 billions needed for a base on the Moon directed to find a technical solution to grab CO2 and methane from the atmosphere - at a scale large enough to stop global warming?<p>It seems that we trust Science and Technology in very different ways. A colony on Mars? Yeah, genius! Stop global warming? Rather than founding EarthX, Elon Musk himself prefers to grant 100 million to whoever finds the way to massively recapture CO2.<p>So, what do you think? Is Science the Way or are we helplessly the baddies, since we can&#x27;t help going to the Dark Side when money is to be made?",
      "time": 1649555047,
      "title": "Ask HN: Should we survey all the oceans?",
      "type": "story"
    },
    {
      "by": "2143",
      "descendants": 0,
      "id": 30973758,
      "kids": [
        30973761
      ],
      "score": 1,
      "time": 1649554824,
      "title": "The Submarine (2005)",
      "type": "story",
      "url": "http://www.paulgraham.com/submarine.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30973755,
      "score": 1,
      "time": 1649554815,
      "title": "Privacy Prevails in the Age of Big Tech",
      "type": "story",
      "url": "https://www.theatlantic.com/magazine/archive/2022/05/privacy-law-technology-california-gajda-seek-and-hide/629373/"
    },
    {
      "by": "bane",
      "descendants": 0,
      "id": 30973750,
      "score": 1,
      "time": 1649554702,
      "title": "How 90s dial-up Internet worked, and let's make our own ISP",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Je8lwcUPBys"
    },
    {
      "by": "xdavidliu",
      "descendants": 0,
      "id": 30973712,
      "score": 2,
      "text": "In CLRS (as recently as the fourth edition), a &quot;complete k-ary tree&quot; is defined as a tree in which &quot;all leaves have the same depth and all internal nodes have degree k&quot;.<p>Knuth (as well as nearly every other source I&#x27;m aware of) uses an entirely different definition: &quot;a k-ary tree in which all levels are filled except possibly the last, and in the last level, all nodes (which must be leaves) are as far to the left as possible&quot;.<p>One consequence is that the Knuth definition allows leaves at different depths. For example, a tree with two nodes: one root and a child, is a complete binary tree according to Knuth, but not according to CLRS.<p>I emailed the authors of CLRS a few months ago before the fourth edition was released, and was told that they acknowledge the difference, but did not have space to mention it because they were up against a publisher-enforced page count.",
      "time": 1649554299,
      "title": "CLRS and Knuth disagree in the definition of “complete k-ary tree”",
      "type": "story"
    },
    {
      "by": "cyansmoker",
      "descendants": 0,
      "id": 30973699,
      "score": 1,
      "text": "https:&#x2F;&#x2F;github.com&#x2F;Fusion&#x2F;mailbiter<p>A simple rules engine written in Go, to supplement my smart-but-not-easily-configurable email client.<p>It comes with a way to write natural language-type rules to classify, delete, etc. email messages.<p>It&#x27;s still in its infancy and I would definitely like to hear how it could be made more useful.",
      "time": 1649554127,
      "title": "Show HN: Mailbiter – a lightweight email rules engine",
      "type": "story"
    },
    {
      "by": "rococode",
      "descendants": 0,
      "id": 30973691,
      "score": 1,
      "time": 1649554061,
      "title": "Chess Champion Magnus Carlsen Advances to Top 39 in Norwegian Poker Championship",
      "type": "story",
      "url": "https://en.pokerpro.cc/news/chess-world-champion-magnus-carlsen-among-final-39-in-norwegian-poker-championship-2022-453.html"
    },
    {
      "by": "goodside",
      "descendants": 0,
      "id": 30973689,
      "score": 1,
      "time": 1649554032,
      "title": "Generate images from text with Latent Diffusion LAION-400M",
      "type": "story",
      "url": "https://huggingface.co/spaces/multimodalart/latentdiffusion"
    },
    {
      "by": "tkiolp4",
      "descendants": 0,
      "id": 30973675,
      "score": 1,
      "text": "I’ve switched jobs recently. I have been working at my new place for around 4 months. Company is 100% remote. Managers of all the tech department areas were doing some sort of “socializing events” on Fridays for their teams since the pandemic started; basically: coffee session in the morning, share your lunch at midday and games and chatting on the afternoon. These were all optional, but I felt somehow obliged to attend at least one or two of them every Friday. All of this, of course with the goal of: work life balance, keeping us social and mentally healthy, etc. Last week, the CEO decided to give us Fridays free. He said, “well, what’s better for your well being? A Friday full of rituals or a Friday entirely for yourselves? If you want to hangout with colleagues on your free Friday, you still can do it!” And so, I don’t work anymore on Fridays (salary unaffected).<p>P.S. everything is true, except the part about having Fridays free.",
      "time": 1649553799,
      "title": "Tell HN: Fridays free at my new company",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30973670,
      "score": 1,
      "time": 1649553749,
      "title": "Why Is Exxon Mining Bitcoin?",
      "type": "story",
      "url": "https://seekingalpha.com/article/4500564-why-is-exxon-mining-bitcoin"
    }
  ]
}