{
  "stories": [
    {
      "by": "arzdigital",
      "descendants": 0,
      "id": 29077698,
      "score": 3,
      "text": "Hi HN,<p>We’re a startup and have recently been victim of a series of repeated fraudulent DMCA takedown requests filed with Google against our website, a popular regional&#x2F;niche (Persian) media platform called arzdigital.com which is very dear to us.<p>https:&#x2F;&#x2F;transparencyreport.google.com&#x2F;copyright&#x2F;domains&#x2F;arzdigital.com?hl=en<p>Each time this happens, lots of our website links are delisted (currently 45 Urls) from Google and hobbles our business. Despite DMCA notifications being sworn statements filed under penalty of perjury, the reporter is making an entirely baseless&#x2F;false claim using a (presumable) fake name, disposable email, and VPN, so while submitting them is a crime, our website is still delisted.  (They’re claiming copyright over our logo, which is completely bogus.)  This amounts to a legally-specified denial-of-service, as I understand Google has limited discretion in how they respond to properly formatted DMCA takedown requests.<p>We are heavily dependent on Google inbound traffic and we generally receive ~750,000 uniques from Google to our website each day which, while we are delisted, We have lost ~250,000 uniques so far.  We’re a media platform so without traffic, we’re toast.<p>We are very concerned that we will lose our rankings and perhaps our entire business (we are small but still we employ over a hundred people) if we can’t figure out a way to stop this from happening.<p>We already have submitted a DMCA counternotification, however it will take 10-14 days until we are reinstated. Meanwhile, the attacker has recently submitted a second fraudulent takedown notice for another 167 Urls (presumably in response). We are very afraid that this issue will keep us largely deindexed and perhaps entirely destroy our startup that we have worked so hard to build from scratch over the last four years.<p>Has this happened to anyone else?  Is there a person or team inside of Google that cares about this sort of thing?  I assume this attack doesn’t work against facebook.com; what is a little guy to do?  Is there US-based law enforcement that gets involved when there is such blatant criminal activity?  What should we do?<p>Thanks,\nJames, Seyedi, and Shabani\narzdigital.com",
      "time": 1635833790,
      "title": "Ask HN: What to do reg fraudulent Google DMCA takedowns destroying our business?",
      "type": "story"
    },
    {
      "by": "codesparkle",
      "descendants": 0,
      "id": 29077688,
      "score": 1,
      "time": 1635833708,
      "title": "Odd: A Texas hold'em poker odds simulator written in Rust",
      "type": "story",
      "url": "https://github.com/ocisly/odd"
    },
    {
      "by": "mbrodersen",
      "descendants": 0,
      "id": 29077683,
      "score": 1,
      "time": 1635833629,
      "title": "Millions of Users, Purely Functional Code",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=gRFjOo-ZgK8"
    },
    {
      "by": "syspec",
      "descendants": 0,
      "id": 29077663,
      "score": 1,
      "time": 1635833388,
      "title": "CS50 Lecture by Mark Zuckerberg",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=xFFs9UgOAlE"
    },
    {
      "by": "Thevet",
      "descendants": 0,
      "id": 29077659,
      "score": 1,
      "time": 1635833348,
      "title": "Kunyu Wanguo Quantu",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Kunyu_Wanguo_Quantu"
    },
    {
      "by": "prismatic",
      "descendants": 0,
      "id": 29077652,
      "score": 1,
      "time": 1635833275,
      "title": "The Artist Behind the Bowler Hat",
      "type": "story",
      "url": "https://literaryreview.co.uk/the-artist-behind-the-bowler-hat"
    },
    {
      "by": "andrebalza1",
      "descendants": 0,
      "id": 29077632,
      "score": 1,
      "time": 1635833134,
      "title": "Better Eats",
      "type": "story",
      "url": "https://www.worksinprogress.co/issue/better-eats/"
    },
    {
      "by": "Turukawa",
      "descendants": 0,
      "id": 29077609,
      "score": 2,
      "time": 1635832884,
      "title": "Facebook will let Kazakhstan government directly flag content it deems harmful",
      "type": "story",
      "url": "https://www.theglobeandmail.com/world/article-facebook-will-let-kazakhstan-government-directly-flag-content-the/"
    },
    {
      "by": "guivin",
      "descendants": 1,
      "id": 29077592,
      "kids": [
        29077593
      ],
      "score": 2,
      "time": 1635832710,
      "title": "Want to Migrate from Docker Desktop on Mac? Setup Your Own Alternative Solution",
      "type": "story",
      "url": "https://getbetterdevops.io/find-alternatives-to-docker-desktop-on-mac/"
    },
    {
      "by": "Iqramustafa45",
      "descendants": 1,
      "id": 29077584,
      "kids": [
        29077585
      ],
      "score": 1,
      "time": 1635832657,
      "title": "8-Step Marketing Client Onboarding Checklist for Agencies",
      "type": "story",
      "url": "https://blog.contentstudio.io/client-onboarding-checklist/"
    }
  ]
}