{
  "stories": [
    {
      "by": "TakakiTohno",
      "descendants": 0,
      "id": 30916314,
      "score": 1,
      "time": 1649144535,
      "title": "MaidSafe's 16 Year Journey to Decentralize the Entire Internet",
      "type": "story",
      "url": "https://hackernoon.com/about-maidsafes-16-year-journey-to-decentralize-the-entire-internet"
    },
    {
      "by": "netfortius",
      "descendants": 0,
      "id": 30916302,
      "score": 1,
      "text": "After a professional career of 25+ yrs in IT (and some more in other engineering fields, prior to that), I decided to move onto a sabbatical &#x2F; maybe  RE stage (part of the FIRE). I am looking now at approx 9-10TB of data I gathered (cleaned irrelevant stuff in time, and probably will clean more, while other parts have been compressed, where such offered an evident benefit of space saving) - duplicated onto 2 x 12TB encrypted disks - for what I could consider my &quot;digital&quot; life. Major categories:<p>- personal (including family) info<p>- career info<p>- pictures (a third copy in the cloud, but planning to remove it, eventually)<p>- personal and professional notes I created in my time, for all of the above<p>- some software I wrote in time (just the code, in large part)<p>- professional documentation of all sorts (mainly fundamentals associated to CS and derivatives, math, physics, misc engineering, as well as specific technologies)<p>- ebooks + movies + series of critical significance to me<p>- documented trips around the world<p>- misc not fitting in any of the categories above<p>Based on the new direction my life will take, the emphasis in digital imprint growth, from this point on, for the reminder of life, could be safely extrapolated from the existing data on pictures, ebooks and trips, and will probably amount to no more than 2TB. All this being said, I assume I could say that my &quot;digital life&quot; will be eventually represented by aprox. 12TB of stored info.<p>What is the estimate of the &quot;digital size&quot; of your life, and what goes in yours?",
      "time": 1649144427,
      "title": "Ask HN: What is the “digital size” of your life, and what goes in?",
      "type": "story"
    },
    {
      "by": "Liriel",
      "descendants": 0,
      "id": 30916292,
      "score": 2,
      "time": 1649144171,
      "title": "What it’s like to get custom earbuds made",
      "type": "story",
      "url": "https://thenextweb.com/news/custom-earbuds-campfire-audio-solistice"
    },
    {
      "by": "xenohunter",
      "descendants": 0,
      "id": 30916289,
      "score": 2,
      "time": 1649144144,
      "title": "Number Sense Tricks [pdf]",
      "type": "story",
      "url": "http://bryantheath.com/files/2018/04/Heath_NSTricks_revA.pdf"
    },
    {
      "by": "vhiairrassary",
      "descendants": 0,
      "id": 30916286,
      "score": 2,
      "time": 1649144113,
      "title": "Sweep raises $73M Series B, led by Coatue",
      "type": "story",
      "url": "https://techcrunch.com/2022/04/04/sweep-series-b-investment/"
    },
    {
      "by": "kecupochren",
      "descendants": 0,
      "id": 30916283,
      "score": 2,
      "text": "I&#x27;ve read this article on a blog like 5 years ago. It was written by a neuroscientist, it was super long and the conclusion was that computer scientist radically understimate the complexity of human brain.<p>No matter what query I try I can&#x27;t find it. Hoping someone here read it too. Thanks!",
      "time": 1649144092,
      "title": "Ask HN: Looking for article comparing human brain with neural nets",
      "type": "story"
    },
    {
      "by": "kirschner",
      "descendants": 0,
      "id": 30916281,
      "score": 2,
      "time": 1649144086,
      "title": "Video: What is Free Software (Open Source)? Explained in under 3 minutes",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=EMi3PCW23yQ"
    },
    {
      "by": "lorenzfx",
      "descendants": 0,
      "id": 30916260,
      "score": 3,
      "time": 1649143935,
      "title": "The Para Method: A Universal System for Organizing Digital Information",
      "type": "story",
      "url": "https://fortelabs.co/blog/para/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30916253,
      "score": 2,
      "time": 1649143906,
      "title": "The West is running out of ways to punish Putin",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_49c4469a21c7ca146e745393b793f061"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30916251,
      "score": 2,
      "time": 1649143893,
      "title": "Putin’s European Allies",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/04/briefing/putin-allies-hungary-serbia.html"
    }
  ]
}