{
  "stories": [
    {
      "by": "asimpleusecase",
      "descendants": 0,
      "id": 31364687,
      "score": 1,
      "time": 1652429432,
      "title": "Royal Mail is building a fleet of 500 DRONES to carry mail",
      "type": "story",
      "url": "https://www.dailymail.co.uk/sciencetech/article-10809029/Royal-Mail-building-500-drones-carry-mail-remote-communities.html"
    },
    {
      "by": "posharma",
      "descendants": 0,
      "id": 31364684,
      "score": 1,
      "text": "Are there any companies in Bay Area that pay well and hire w&#x2F;o leetcode style interviews for staff+ engineer or engineering manager roles (backend)? As a TLM with 2 decades of overall experience and currently managing a team of 7 and a family of 4 I&#x27;m finding it very difficult to find time to sustain leetcode practice for several months. I understand it&#x27;s a necessary evil these days and this is the best most companies can do to hire talent but still looking for exceptions. Thanks!",
      "time": 1652429404,
      "title": "Ask HN: Companies in BayArea that hire without leetcode style interviews",
      "type": "story"
    },
    {
      "by": "fxtentacle",
      "descendants": 0,
      "id": 31364675,
      "score": 1,
      "text": "I&#x27;m posting this because it is a great example of what can go wrong in a product migration.<p>I&#x27;ve never been a big fan of Unity, because we hit bugs in their engine and they refused to even name me the price for paid support, so our entire project got derailed by their unwillingness to fix the bug. But my company did have some projects hosted with Unity Collaborate. Apparently, Unity recently purchased Plastic SCM and now they decided to make it the default. Here&#x27;s what they did:<p>1. They sent us a Japanese email from @codicesoftware.com to inform us that our Unity Collaborate data will be migrated to Unity SCM in 2 business days. Needless to say, this went straight to spam at the time.<p>Lesson learned #1: If you send localized emails, cross-check your data. This is a German company with a German billing address, so it would have been easy to automatically verify if Japanese emails are a go or no-go.<p>Lesson learned #2: For important announcements, use the email address that you always use. I&#x27;m guessing codicesoftware.com was the developer of Plastic before Unity bought it, but we have no relationship with them. @unity3d.com would have been whitelisted in the spam filter.<p>2. While the old system allowed export as a zipped Git repo, the new system does not. So due to their migration, we lost our export ability, meaning all revision data stored with them is now incompatible with our other tools and, hence, effectively worthless. The email didn&#x27;t offer any opt out or delay ability and they only informed us 2 days in advance in the first place.<p>Lesson learned #3: Make &quot;upgrades&quot; that deprecate export features opt-in. Yes, that is more work. And yes, I&#x27;m sure Unity is confident that Plastic SCM is better than Unity Collaborate. But in our case, the upgrade caused data loss.<p>3. They now tried to charge our company credit card, which thankfully didn&#x27;t go through. This is how I became aware of this mess. Apparently, while our Unity Collaborate storage was included in our Unity Teams accounts, Unity Plastic SCM storage is not included. So they now want us to pay more for them not to delete what&#x27;s left of our data after their broken migration. This just strikes me as somewhat offensive and greedy. Also, I wonder if it&#x27;s legal for codicesoftware.com to use the credit card that I had on file with unity3d.com. Plus they signed us up for their new Plastic Cloud Edition subscription without anyone knowing. And visiting http:&#x2F;&#x2F;codicesoftware.com&#x2F; didn&#x27;t exactly reduce the confusion.<p>Lesson learned #4: Do not subscribe customers to paid plans without opt-in. Should be obvious, but they did screw it up, so I&#x27;m listing it.<p>Lesson learned #5: Don&#x27;t share payment methods between seemingly unrelated business units. To an outsider, it is not obvious that Codice Software is now a part of Unity Technologies ApS. That&#x27;s probably why my bank denied their transaction.<p>Lesson learned #6: Make sure the domain in your payment emails and on your invoices displays something useful.<p>Lesson learned #7: Don&#x27;t keep people hostage with their data. The fact that there&#x27;s no way for us to recover the data we had stored with Unity Collaborate and that we&#x27;re now expected to pay a monthly fee just to have a chance at recovering parts of our old data is what made all of this so infuriating in the first place.",
      "time": 1652429335,
      "title": "Tell HN: Let's learn from Unity's f-up Plastic SCM migration and data hostage",
      "type": "story"
    },
    {
      "by": "nor0x",
      "descendants": 0,
      "id": 31364668,
      "score": 1,
      "time": 1652429255,
      "title": "I fixed my broken monitor with a hair dryer",
      "type": "story",
      "url": "https://johnnys.news/2022/05/How-i-fixed-my-broken-monitor-with-a-hair-dryer/"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 31364661,
      "score": 1,
      "time": 1652429193,
      "title": "Bullying Hurts",
      "type": "story",
      "url": "https://www.heinemann.com/products/e04356.aspx"
    },
    {
      "by": "nerdyadventurer",
      "descendants": 1,
      "id": 31364659,
      "kids": [
        31364706
      ],
      "score": 1,
      "text": "I graduated in December 2017 in CS program, after that I went for a couple of interviews, but I had intention to do something of my own, I did try some ideas, some failed, some got abandoned due to health issue which I will explain later.<p>I was diagnosed with OCD in 2010, even thought I had been suffering with symptom from 2008,currently I take Fluoxetine daily to control symptoms. Furthermore, I was depressed in 2010 after OCD diagnosis. After graduating college I was trying hard to keep working on my app idea, I have done considerable amount of work, but I kept procrastinating doing other work (volunteering, helping relatives, neighbors, helping my father&#x27;s farming work), time to time I muster courage to work on my app by summoning my will power, but it only last for about a week, I have read&#x2F;watch many science based articles.&#x2F;videos for battling procrastinating, but I stil could work for a week by using up willpower. Due to my this chronic procrastination I was blaming myself for years, until this year I decide to learn more about ADHD even though I have heard of it before, after knowing about ADHD, I grasp what is going on with me (executive dis-functioning) which explained by knowing lot and failing execute, time blindness, clouded mind, distractability etc. So I went to meet my psychiatrist, and he prescribed me Atomoxitine, in the first days Atomoxitine regardless of its strong side effects, I felt my mind was clam, I was able to very quickly (ex: tasks that took me a day were done in hour), this remembered me what my mind was used to be like a decade ago, which was quiet and how much benefit those neurotypicals had over me all those years, with medication I was hopeful. After the use of Atomoxitine for first two days quietness of the mind reduced, but I have the ability to keep on working regularly on my projects with Atomoxitine (do not have to use up my will power all the time) which was quite useful, I am thinking of trying other stimulant medication in the future.<p>During those years I had work on some small freelance projects for friends in React and Android and currently working fully fledge ecommerce site for my cousin as business partners.<p>I have to keep eye on my parents since my mom is suffering from Parkinson&#x27;s for years, she needs help with daily activities, sometimes get delusional and suicidal, dad also have high blood pressure time to time, issue in prostate (getting ready for operation later this year). My dad is farmer since he is old and have health issues sometimes I have to look into his farming duties.<p>So now to my question, recent months I was thinking for applying for job as SE, since I am having hard time with economic crisis and structured environment like company help me to work&#x2F;learn easily, in the meantime gain career capital. But I do not know how could I explain my 6-year gap of unemployment, whether they will hire me due to my health conditions?<p>Any advice highly appreciated!",
      "time": 1652429174,
      "title": "Ask HN: How do I explain gap after college due to health/family issues?",
      "type": "story"
    },
    {
      "by": "goncaloo",
      "descendants": 0,
      "id": 31364649,
      "score": 1,
      "time": 1652429072,
      "title": "Elon Musk boasts his Neuralink brain chips ‘will 100% cure’ common illness",
      "type": "story",
      "url": "https://www.the-sun.com/tech/5304207/elon-musk-neuralink-brain-chips-cure-common-illness/"
    },
    {
      "by": "dom9301k",
      "descendants": 1,
      "id": 31364648,
      "kids": [
        31364674
      ],
      "score": 1,
      "text": "Except the evergreen rsync",
      "time": 1652429051,
      "title": "Ask HN: What is your go-to backup system for Linux servers?",
      "type": "story"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31364641,
      "score": 1,
      "text": "This is a little tool that I wrote about 4 months ago that lets you fetch data from cht.sh[0]. It is more of a toy, but someone might find this useful.<p>[0]: <a href=\"https:&#x2F;&#x2F;cht.sh\" rel=\"nofollow\">https:&#x2F;&#x2F;cht.sh</a>",
      "time": 1652428970,
      "title": "Show HN: A program that fetches data from cht.sh based on the topic",
      "type": "story",
      "url": "https://github.com/HoangTuan110/cheat"
    },
    {
      "by": "nailer",
      "descendants": 0,
      "id": 31364638,
      "score": 1,
      "time": 1652428922,
      "title": "Butyrylcholinesterase is a potential biomarker for Sudden Infant Death Syndrome",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/35533499/"
    }
  ]
}