{
  "stories": [
    {
      "by": "sdevonoes",
      "descendants": 0,
      "id": 28523529,
      "score": 1,
      "text": "It&#x27;s crazy, but this seems to be accurate from my limited experience:<p>1. Senior backend developer (~10 years of experience) trying to find a 100K Euro&#x2F;year job in Western Europe: quite hard if all you want to be is a simple &quot;individual contributor&quot; (employee, not contractor) writing $PROGRAMMING_LANG code without having to deal with k8s, the cloud, mentoring, or on-call paging. Besides, I&#x27;m not specially bright, just average, so I cannot pass tricky tech interviews. I&#x27;m currently making 85K Euro&#x2F;year (around 4600 Euro&#x2F;month after taxes) which is nice, but I cannot deal with the stress my current role (tech lead?) implies: I&#x27;m supposed to be on-call, to mentor junior engineers, to &quot;own&quot; our products, to learn more about devops&#x2F;infra topics, to bring and introduce new topics to my team, to be an example to engineers with less experience. All I want to do is to be part of a team pushing useful features for our customers: I don&#x27;t want to be on-call; I like to teach and learn from others but I don&#x27;t want to be a mentor; I want to write $PROGRAMMING_LANG code, I don&#x27;t want to setup the infra of our services... I want the job I had in 2010!\nNow, that&#x27;s for positions that pay ~85K euro&#x2F;year. Imagine the stress for positions that pay 100K. I don&#x27;t even think such positions (plain IC) exist in WE (excluding top companies ofc: I&#x27;m just the average Joe). It seems that this ~17% salary increase I&#x27;m looking for implies a 100% increase in stress. Nuts.<p>2. Getting a 50K euro&#x2F;year job in Western Europe is easy for someone like me with ~10 years of experience. I can pass the interviews just fine (I guess I would just have to hide some previous experience of mine so that I look like a junior to the companies). 50K euro&#x2F;year is around 3K&#x2F;month after taxes. Not bad. Now, the stress of a 50K euro&#x2F;year job is close to zero for someone with years of dev experience. Besides, you&#x27;ll get ton of free time because you know exactly how to do &quot;junior&quot; tasks! No on-call, no mentoring, no cloud, no k8s... just coding like it&#x27;s 2010!<p>Now, the big IF: what if I quit my current job and get 2x50K euro&#x2F;year jobs? That would mean (oversimplifying taxes) around 6K euro&#x2F;month after taxes (more than I would make earning 100K euro&#x2F;year!). I think I could do it just fine (perhaps I would have trouble with meetings at the same time). Low stress (because I would be a senior doing junior tasks), more money. Bingo. From an ethical point of view: I would be a junior (earning junior money) producing senior-level coding. That&#x27;s a big win for any company, no?<p>Now, coming back to reality: this is probably never going to happen.",
      "time": 1631621745,
      "title": "Ask HN: 2x50K Jobs vs. 1x100K",
      "type": "story"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 28523528,
      "score": 1,
      "time": 1631621733,
      "title": "Stanford professors urge U.S. to end program looking for Chinese spies",
      "type": "story",
      "url": "https://www.reuters.com/world/us/stanford-professors-urge-us-end-program-looking-chinese-spies-academia-2021-09-13/"
    },
    {
      "by": "neocortex666",
      "descendants": 1,
      "id": 28523517,
      "kids": [
        28523518
      ],
      "score": 1,
      "time": 1631621684,
      "title": "Financial Management for Technology Entrepreneurs",
      "type": "story",
      "url": "https://saurabhsaha.substack.com/p/financial-management-for-technology"
    },
    {
      "by": "el_duderino",
      "descendants": 0,
      "id": 28523514,
      "score": 2,
      "time": 1631621680,
      "title": "Engineers create 3D-printed objects that sense how users interact with them",
      "type": "story",
      "url": "https://news.mit.edu/2021/3d-printed-objects-sense-interaction-0914"
    },
    {
      "by": "fogus",
      "descendants": 0,
      "id": 28523506,
      "score": 1,
      "time": 1631621635,
      "title": "Stevey's Tech Talk Videos",
      "type": "story",
      "url": "https://www.youtube.com/user/SteveYegge/videos"
    },
    {
      "by": "monkeydust",
      "descendants": 0,
      "id": 28523505,
      "score": 1,
      "time": 1631621635,
      "title": "Creative AI: On the Democratisation and Escalation of Creativity (2016)",
      "type": "story",
      "url": "https://medium.com/@creativeai/creativeai-9d4b2346faf3"
    },
    {
      "by": "kylehogeboom",
      "descendants": 0,
      "id": 28523461,
      "score": 2,
      "text": "For any ordered system, there can be a mathematical description of its structure and relationships.<p>So, can human knowledge be organized into an ordered structure that can be used to statistically measure an individual person&#x27;s state of knowledge? (A map of knowledge as a standard of measurement to evaluate a person&#x27;s level of understanding)<p>I&#x27;m aware of Knowledge Space Theory and Bayesian Knowledge Tracing. I&#x27;m asking whether human knowledge, as a whole, can be organized into a tangible hierarchical structure of nodes, sub-nodes, etc. whose relationships can be mapped in a reasonably doable way.<p>To me, the use of mental models, first principles thinking, scientific reductionism, and the abundance of freely available knowledge (Wikipedia) would make this a not-impossible and very-rewarding task. If we divide knowledge into science (discovered) and philosophy (made), it&#x27;d be easier to organize scientific knowledge first, then move on to making the complex organization of history, philosophy, political science, etc. (As the saying goes, the laws of planetary motion are simpler than the history of Sweden).",
      "time": 1631621363,
      "title": "Mathematics and Organized Knowledge",
      "type": "story"
    },
    {
      "by": "orencohen",
      "descendants": 0,
      "id": 28523456,
      "score": 1,
      "time": 1631621310,
      "title": "How to Make a New Beginning Meaningful?",
      "type": "story",
      "url": "https://orencohen.substack.com/p/issue-1-the-beginning-begins"
    },
    {
      "by": "FridayoLeary",
      "descendants": 0,
      "id": 28523452,
      "score": 1,
      "time": 1631621291,
      "title": "Microsoft confirms running on an Apple M1 'is not a supported scenario'",
      "type": "story",
      "url": "https://www.theregister.com/2021/09/10/windows_11_m1/"
    },
    {
      "by": "sir_eliah",
      "descendants": 0,
      "id": 28523439,
      "score": 1,
      "time": 1631621223,
      "title": "Show HN: Dragit – Easily share files on a local network",
      "type": "story",
      "url": "https://github.com/sireliah/dragit"
    }
  ]
}