{
  "stories": [
    {
      "by": "pelasaco",
      "descendants": 0,
      "id": 29813899,
      "score": 1,
      "time": 1641411882,
      "title": "Melatonin drugs inhibit SARS-CoV-2 entry into the brain and virus-induced damage",
      "type": "story",
      "url": "https://www.biorxiv.org/content/10.1101/2021.12.30.474561v1"
    },
    {
      "by": "kstrauser",
      "descendants": 1,
      "id": 29813873,
      "kids": [
        29813902
      ],
      "score": 1,
      "time": 1641411742,
      "title": "Updates (“We got hit by a ransomware attack.”)",
      "type": "story",
      "url": "https://sflive.schedulefly.com/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 29813815,
      "score": 1,
      "time": 1641411479,
      "title": "U.S. charges ex-Wall Street quantitative analyst with insider trading",
      "type": "story",
      "url": "https://www.reuters.com/legal/government/us-charges-ex-wall-street-quantitative-analyst-with-insider-trading-2021-09-23/"
    },
    {
      "by": "ducttapethrow",
      "descendants": 0,
      "id": 29813801,
      "score": 1,
      "text": "Throwaway bc I&#x27;m pretty active here. I would love some help explaining a creepy incident I experienced a couple hours ago.<p>I was working on a Macbook at my desk when I heard someone speaking. There was a Sonos across the room playing music from my partner&#x27;s phone, but the sound wasn&#x27;t coming from that direction. My desk is where I have a gaming PC and connected to it are a set of Audioengine A5+ speakers - (they aren&#x27;t smart speakers&#x2F;connected to wifi). The speakers were powered on, but my gaming PC was turned off (not switched off, though).<p>I increased the volume of my laptop to check if that was the source of the voice but it wasn&#x27;t, so I muted my computer. I tried listening to the song playing across the room but the voice was definitely coming from somewhere closer. I brought my ear near the left A5 speaker on my desk and could hear what the voice was saying. They said: &quot;Do you know what duct tape feels like across your lips&quot; in a creepy manner.<p>I Googled the phrase to hopefully find the lyrics to a song but there were no relevant results. The top &quot;lyrics&quot; result was by a band called the Insane Clown Posse but the lyrics didn&#x27;t match up at all. The voice stopped speaking and I didn&#x27;t know what to do, so I turned off the Sonos in case that actually was the source. I went back to my desk and tried listening to the Insane Clown Posse song on my phone and I heard the voice again from the A5 speaker. This time they said &quot;duct tape, duct tape&quot;. I unplugged the A5s power cable and switched off my PC and haven&#x27;t heard the voice since.<p>I&#x27;m pretty confident the voice was coming from the left A5 speaker. There are no other electronics on that corner of the desk besides a lamp. However, the A5s are connected to my gaming PC which has been turned off this entire time and resting on the ground in the same corner as the left speaker. It&#x27;s a relatively new PC and I only have a few apps installed on (Steam, Discord, Epic Launcher). I received the A5s from a close friend years ago and have used them almost daily. No one has access to my computers but me and my partner who would never do something like this. I&#x27;m pretty sure none of my friends have anything to do with this. I do live in a dense urban area. I don&#x27;t have history of mental illness&#x2F;hallucinations. I also wouldn&#x27;t say that I&#x27;m a target for any reason. Although I am very creeped out, I think this is more likely a prank than a threat to me.<p>Given all this, can anyone come up with a technical explanation? The only one I can think of is that my gaming PC was being hacked&#x2F;remotely accessed and someone was speaking out loud or playing an audio file to prank me. The only action I&#x27;ve taken so far is change my WiFi&#x27;s password (I was using the default password before). I appreciate any help here.",
      "time": 1641411438,
      "title": "Ask HN: Can anyone help explain remote access to my computer speakers?",
      "type": "story"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 29813788,
      "score": 2,
      "time": 1641411359,
      "title": "Biblically Inspired Pseudoscience and Clickbait Cause Looting",
      "type": "story",
      "url": "https://www.sapiens.org/archaeology/tall-el-hamman/"
    },
    {
      "by": "matt_d",
      "descendants": 0,
      "id": 29813774,
      "score": 1,
      "time": 1641411298,
      "title": "Profile Inference Revisited",
      "type": "story",
      "url": "https://research.facebook.com/publications/profile-inference-revisited/"
    },
    {
      "by": "andymatuschak",
      "descendants": 0,
      "id": 29813764,
      "score": 1,
      "time": 1641411249,
      "title": "The Silicon Valley-backed effort to reimagine how the world funds science",
      "type": "story",
      "url": "https://endpts.com/inside-the-multibillion-dollar-silicon-valley-backed-effort-to-reimagine-how-the-world-funds-and-conducts-science/"
    },
    {
      "by": "jpatel3",
      "descendants": 0,
      "id": 29813759,
      "score": 1,
      "time": 1641411222,
      "title": "Invisible Scripts of life and discussion making",
      "type": "story",
      "url": "https://positive.substack.com/p/invisible-scripts-of-life-and-discussion"
    },
    {
      "by": "ecliptik",
      "descendants": 0,
      "id": 29813716,
      "score": 1,
      "time": 1641411016,
      "title": "GopherVR",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/GopherVR"
    },
    {
      "by": "a785236",
      "descendants": 0,
      "id": 29813713,
      "score": 1,
      "time": 1641411001,
      "title": "Reconstruction Attacks in Practice",
      "type": "story",
      "url": "https://differentialprivacy.org/diffix-attack/"
    }
  ]
}