{
  "stories": [
    {
      "by": "wheresvic4",
      "descendants": 0,
      "id": 31167081,
      "score": 1,
      "time": 1650978911,
      "title": "War Story – hunting down a memory leak in a C++ application",
      "type": "story",
      "url": "https://smalldata.tech/blog/2020/07/01/war-story-hunting-down-a-memory-leak-in-a-c++-application"
    },
    {
      "by": "janandonly",
      "descendants": 0,
      "id": 31167073,
      "score": 1,
      "time": 1650978885,
      "title": "Python 3 library for consuming and providing Moneysocket connections",
      "type": "story",
      "url": "https://github.com/moneysocket/py-moneysocket"
    },
    {
      "by": "philk10",
      "descendants": 0,
      "id": 31167072,
      "score": 1,
      "time": 1650978864,
      "title": "Generative Art: Dive Deeper with Recursion",
      "type": "story",
      "url": "https://spin.atomicobject.com/2022/04/26/generative-art-recursion/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31167067,
      "score": 1,
      "time": 1650978841,
      "title": "Dell workstation lets you pick a thicker chassis for extra performance",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/04/new-dell-workstation-laptops-fit-128gb-of-ddr5-ram-on-a-single-module/"
    },
    {
      "by": "roomey",
      "descendants": 0,
      "id": 31167062,
      "score": 1,
      "text": "I used to have my own little darkroom for doing manual photography.<p>I could pick the film, develop it myself.\nPick the photo paper.\nUse the enlarger to expose, focus, burn, shade, double expose etc. etc.<p>It was all very intuitive. I have a photo of a tree and I want the nice silvery white you get with it and the rich blacks, and I am looking for a tool or something where I can essentially emulate the chemical darkroom process.<p>I am ok with GIMP and Darktable but I don&#x27;t know how to get them to act the same as, for example, choosing a specific type of photo paper, or leaving it in the developer a bit longer.<p>I have tried to search for something like this but I can find nothing.\nThank you!",
      "time": 1650978819,
      "title": "Ask HN: Is there a chemical darkroom emulator for Linux",
      "type": "story"
    },
    {
      "by": "mchmarny",
      "descendants": 0,
      "id": 31167059,
      "score": 1,
      "time": 1650978791,
      "title": "Search HN stories with topic classification and sentiment visualization",
      "type": "story",
      "url": "https://news.thingz.io"
    },
    {
      "by": "cosmorocket",
      "descendants": 0,
      "id": 31167046,
      "score": 1,
      "text": "Say, I am building a service which I want to gain natural 100% trust from anyone who uses it or for any reason is skeptical about it.<p>As a parallel example, I as a user can 100% trust, e.g. lodash library to use in my projects. It&#x27;s open-source, popular, traceable by the large community and there is literally no place for any backdoor, hidden tracking and so on.<p>So, what if I want my service with all its infrastructure, data in databases, incoming and outgoing connections to be 100% transparent, open to be investigated and audited?<p>Disregard the problem of data privacy and sensitivity - assume that there is no such data.<p>Problems I see:<p>- When I create a commit&#x2F;push to the codebase, then run CI, how do I as the owner can prove that exactly this build goes to production without any backdoor being added to it when deployed?<p>- As a user how do I know there is no hidden process running tracking events, data writes in background while I am performing some action?<p>- As a user how do I know the monitoring&#x2F;audit tools provided by the owner are not fake and show exactly the state of the service?\n- Is it even possible in reality to create it the way when an arbitrary user, having some level of expertise and some level of access to the system (in order not to bring harm) could say that the system is completely clear in all its incentives, data and processes?",
      "time": 1650978710,
      "title": "Ask HN: Can I make my whole web service completely transparent?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31167038,
      "score": 2,
      "time": 1650978646,
      "title": "OpenSSH now defaults to protecting against quantum computer attacks /",
      "type": "story",
      "url": "https://www.zdnet.com/article/openssh-now-defaults-to-protecting-against-quantum-computer-attacks/"
    },
    {
      "by": "trojanski",
      "descendants": 0,
      "id": 31167029,
      "score": 1,
      "text": "LastPass and I&#x27;m sure many other password managers claim that they encrypt and decrypt the data ONLY on your local device and that master key is never sent to LastPass servers - https:&#x2F;&#x2F;www.lastpass.com&#x2F;how-lastpass-works \nMy question is: How the password that&#x27;s encrypted on my device using my own key can be decrypted by other people with whom I shared that entry with ?",
      "time": 1650978574,
      "title": "Ask HN: How encryption works for shared entries?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31166993,
      "score": 1,
      "time": 1650978364,
      "title": "APL Seeds ’22",
      "type": "story",
      "url": "https://www.dyalog.com/blog/2022/04/apl-seeds-22-tuesday-29-march/"
    }
  ]
}