{
  "stories": [
    {
      "by": "secure",
      "descendants": 0,
      "id": 30734086,
      "score": 1,
      "time": 1647700758,
      "title": "Smart Home Components",
      "type": "story",
      "url": "https://michael.stapelberg.ch/posts/2022-03-19-smart-home-components/"
    },
    {
      "by": "denisw",
      "descendants": 0,
      "id": 30734072,
      "score": 1,
      "time": 1647700669,
      "title": "Fish 3.4.0",
      "type": "story",
      "url": "https://fishshell.com/docs/current/relnotes.html"
    },
    {
      "by": "burlesona",
      "descendants": 0,
      "id": 30734062,
      "score": 1,
      "time": 1647700596,
      "title": "Why can’t America build quickly anymore?",
      "type": "story",
      "url": "https://fullstackeconomics.com/why-america-cant-build-big-things-any-more/"
    },
    {
      "by": "jamghee",
      "descendants": 0,
      "id": 30734057,
      "score": 1,
      "time": 1647700570,
      "title": "Ask HN: What does it mean to be a senior software engineering vs. lower levels?",
      "type": "story"
    },
    {
      "by": "jackfruit2",
      "descendants": 0,
      "id": 30734052,
      "score": 1,
      "text": "Hi,<p>I&#x27;m thinking of starting a few side projects but very worried about the Intellectual Property clause within my employement contract I signed years ago.<p>I&#x27;m looking for a lawyer who could help me parse the following clauses, or am I snookered and should just quit.<p>I&#x27;m wordering how an overlap is determined. Would that be for a judge to decide?<p>From my contract:<p>We understand that lots of our employees have tech related ideas that they work on outside of working hours. In a case where your idea overlaps or conflicts with the work of said company, you agree to the following:<p>1. You will promptly provide to said company, and otherwise keep confidential, full written details of all inventions, copyright works or designs originated, conceived, written or made by you, alone or with others (“Intellectual Property”), and work relating to Intellectual Property that you have worked on at any time during the course of your employment with said company which relate to, or are reasonably capable of being used in, the business of said company (&quot;Employment IP&quot;). Unless otherwise agreed in writing by the CEO, you are assigning said company absolutely all rights, title, benefits and interests in the Employment IP. The reason for this clause is to protect the Intellectual Property of the Company from infringement or misuse that may damage the position of said company in the market or our ability to serve our clients.<p>2. You hereby assign to said company with full title guarantee by way of assignment all present and future copyright, database and design rights and other proprietary rights (if any) for the full term of such rights throughout the world in respect of all Intellectual Property and you waive in favour of said company all moral rights conferred by Chapter 4 Part 1 of the Copyright Designs and Patents Act 1988 and all similar rights in other jurisdictions.<p>3. You irrevocably appoint said company as your attorney to execute any instrument and do any such thing for the purpose of giving to the Company the full benefit of clause 1.",
      "time": 1647700548,
      "title": "Ask HN: Any Recommendations for Employment IP Lawyer in the UK",
      "type": "story"
    },
    {
      "by": "skilled",
      "descendants": 0,
      "id": 30734028,
      "score": 1,
      "text": "Just wondering what could be the issue here:<p>https:&#x2F;&#x2F;developer.mozilla.org&#x2F;en-US&#x2F;docs&#x2F;Web&#x2F;CSS&#x2F;min()<p>Actually, I get the same error when trying to access max() also. I tried it in 4 different browser variations and all return the same error: &quot;developer.mozilla.org redirected you too many times.&quot;",
      "time": 1647700403,
      "title": "Ask HN: Is the min() CSS reference on MDN broken?",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30734008,
      "score": 1,
      "time": 1647700295,
      "title": "FleetZero looks to capsize the shipping world with electric vessels",
      "type": "story",
      "url": "https://techcrunch.com/2022/03/15/fleetzero-looks-to-capsize-the-shipping-world-with-electric-vessels-serving-forgotten-ports/"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30734002,
      "score": 1,
      "time": 1647700279,
      "title": "Current Production Issue – Google Maps Platform – Multiple APIs",
      "type": "story",
      "url": "https://issuetracker.google.com/issues/225361510?pli=1"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30733998,
      "score": 1,
      "time": 1647700268,
      "title": "A drowning world: Kenya’s quiet slide underwater",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/mar/17/kenya-quiet-slide-underwater-great-rift-valley-lakes-east-africa-flooding"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30733981,
      "score": 3,
      "time": 1647700136,
      "title": "Apple's new M1 Ultra isn't faster than an RTX 3090",
      "type": "story",
      "url": "https://www.pcgamer.com/big-surprise-apples-new-m1-ultra-isnt-actually-faster-than-an-rtx-3090/"
    }
  ]
}