{
  "stories": [
    {
      "by": "RileyJames",
      "descendants": 0,
      "id": 28177912,
      "score": 1,
      "time": 1628915421,
      "title": "Australia is becoming a police state",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=8mmgeQ6SCqI"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 28177910,
      "score": 1,
      "time": 1628915378,
      "title": "George Soros Exits Shares Bought During Bill Hwang’s Archegos Implosion",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-13/soros-liquidates-portfolio-bought-during-bill-hwang-s-implosion"
    },
    {
      "by": "kletinic",
      "descendants": 0,
      "id": 28177885,
      "score": 1,
      "text": "Hi Hacker News! I’m the founder of DocOne (https:&#x2F;&#x2F;docone.io). DocOne delivers the most relevant physicians for any medical condition based on expertise. We currently cover all US physicians and ~4500 conditions.<p>Why? The complexity of medicine is accelerating exponentially. Medical knowledge doubles every few months. To keep up, physicians are focusing on narrow groups of conditions. While there are only around 40 traditional medical specialties, in reality there are &gt;500 ultra-specialties.<p>If there’s one thing we’ve heard over and over from physicians (when they refer their patients) and people (when they search for specialists), it’s that they struggle to identify the right physicians. I’ve personally experienced this. Old-school physician directories (hospital, insurance, 3rd party like ZocDoc and Healthgrades) are essentially phone books. They don’t rely on expertise. They use patient reviews, which have no correlation with expertise. They often sell ads.<p>That’s why we created DocOne. Our team has a background in data science and medicine. We capture and mine large-scale, up-to-date medical knowledge sources, and use data science (computational linguistics, NLP, shallow and deep learning language models, information retrieval) to build models of medical conditions and to rank physicians according to their relevance to any given condition. Instead of doing the traditional search by physician specialty, people can do a precise search by an individual condition.<p>We&#x27;re excited to show you the free and open version of our platform. We&#x27;ve tested it with a narrow group of patients, but we&#x27;re ready to open it up to a broader user base. To search, start typing a medical condition and select an option from the drop down menu. Search nationwide, or type in a zip code or city&#x2F;state. Filter by specialty (the platform knows all relevant specialties for each condition, helping the user search for the right type of specialist).<p>We hope you’ll take a moment to try docone.io and let us know how it goes. Excited to have your feedback! Please leave your thoughts and comments.",
      "time": 1628915082,
      "title": "Show HN: DocOne – A Search Engine for Healthcare",
      "type": "story"
    },
    {
      "by": "sam345",
      "descendants": 0,
      "id": 28177884,
      "score": 1,
      "time": 1628915071,
      "title": "Jensen's Kitchen was a lie: Nvidia reveals GTC 2021 keynote nearly 100% fake",
      "type": "story",
      "url": "https://www.techradar.com/news/jensens-kitchen-is-a-lie-nvidia-reveals-gtc-2021-keynote-nearly-100-synthetic"
    },
    {
      "by": "jjxe",
      "descendants": 0,
      "id": 28177873,
      "score": 1,
      "time": 1628914916,
      "title": "The Science of Imposter Syndrome",
      "type": "story",
      "url": "https://www.theschoolofmomentum.com/post/imposter-syndrome-who-am-i-to-make-this-decision"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28177855,
      "score": 1,
      "time": 1628914701,
      "title": "Games With Words: Which of the world's Englishes do you speak?",
      "type": "story",
      "url": "http://archive.gameswithwords.org/WhichEnglish/"
    },
    {
      "by": "thunderbong",
      "descendants": 1,
      "id": 28177818,
      "kids": [
        28177904
      ],
      "score": 4,
      "time": 1628914172,
      "title": "The EU Wants a Universal Mobile Charger, but Apple Doesn’t",
      "type": "story",
      "url": "https://www.howtogeek.com/748444/the-eu-wants-a-universal-mobile-charger-but-apple-doesnt/"
    },
    {
      "by": "chynkm",
      "descendants": 0,
      "id": 28177807,
      "score": 1,
      "time": 1628914006,
      "title": "AWS adds an extra 5.5M (~10%) IPv4 addresses",
      "type": "story",
      "url": "https://github.com/seligman/aws-ip-ranges"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 28177792,
      "score": 3,
      "time": 1628913783,
      "title": "Sydney Residents Will Now Have to Register Their Single Bubble Partner’s Name",
      "type": "story",
      "url": "https://www.pedestrian.tv/news/greater-sydney-tightenning-restrictions-single-bubbles/"
    },
    {
      "by": "zetalyrae",
      "descendants": 0,
      "id": 28177780,
      "score": 1,
      "time": 1628913715,
      "title": "American Information Exchange",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/American_Information_Exchange"
    }
  ]
}