{
  "stories": [
    {
      "by": "taf2",
      "descendants": 0,
      "id": 30768151,
      "score": 2,
      "time": 1647966556,
      "title": "Twilio Voice Outage",
      "type": "story",
      "url": "https://status.twilio.com/incidents/lfs7fznldzm7"
    },
    {
      "by": "max__d",
      "descendants": 1,
      "id": 30768145,
      "kids": [
        30768162
      ],
      "score": 1,
      "time": 1647966536,
      "title": "Show HN: Kaibex, a Uniswap clone that saves on gas",
      "type": "story",
      "url": "https://kaibex.kaibadefi.com/"
    },
    {
      "by": "vichu",
      "descendants": 0,
      "id": 30768144,
      "score": 1,
      "time": 1647966525,
      "title": "A Curta Calculator",
      "type": "story",
      "url": "https://twitter.com/Srasgon/status/1505292245234163713"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30768131,
      "score": 1,
      "time": 1647966461,
      "title": "‘Locked out by a robot’: Amazon Fresh accused of retaliation to union drive",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2022/mar/22/amazon-fresh-retaliation-union-unionization"
    },
    {
      "by": "wwwpatdelcom",
      "descendants": 0,
      "id": 30768109,
      "score": 2,
      "text": "Probability involves a lot of extra-mathematical concepts and funny transforms. I have always had a hard time internalizing it. When I heard a couple years ago that Lemurs are actually capable of abstract math, that gave me a bit of motivation to try to finally conceptualize probability in terms of whole numbers, counts, geometric shapes, basically easy-to-remember mathematical primitives.<p>This book might be interesting to folks interested in predictive science, research, or just anyone who may have taken probability or statistics and might like a refresher on some of the edges of these sometimes tough to nail down concepts.<p>I would love any feedback or questions that anyone may have. Thanks!<p>Patrick Delaney",
      "time": 1647966392,
      "title": "Show HN: My Book Making Probability So Easy That a Lemur Could Learn It",
      "type": "story",
      "url": "https://leanpub.com/probabilityforlemurs/c/gv9B4Xz0jpq1_hackernews"
    },
    {
      "by": "emilec___",
      "descendants": 0,
      "id": 30768105,
      "score": 2,
      "text": "The situation is fairly simple. Your model could run 10 times faster by adding a few lines to your code, but you weren&#x27;t aware of it. Let me expand on that.<p>AI applications are multiplying like mushrooms, which is awesome<p>As a result, more and more people are turning to the dark side, joining the AI world, as I did<p>The problem? Developers focus only on AI, cleaning up datasets and training their models. Almost no one has a background in hardware, compilers, computing, cloud, etc<p>The result? Developers spend a lot of hours improving the accuracy and performance of their software, and all their hard work risks being undone by the wrong choice of hardware-software coupling<p>This problem bothered me for a long time, so with a couple of buddies at Nebuly (all ex MIT, ETH and EPFL), we put a lot of energy into an open-source library called nebullvm to make DL compiler technology accessible to any developer, even for those who know nothing about hardware, as I did.<p>How does it work? It speeds up your DL models by ~5-20x by testing the best DL compilers out there and selecting the optimal one to best couple your AI model with your machine (GPU, CPU, etc.). All this in just a few lines of code.<p>The library is open source and you can find it here https:&#x2F;&#x2F;github.com&#x2F;nebuly-ai&#x2F;nebullvm.<p>Please leave a star on GitHub for the hard work in building the library :) It&#x27;s a simple act for you, a big smile for us. Thank you, and don&#x27;t hesitate to contribute to the library!",
      "time": 1647966381,
      "title": "Almost no one knows how easily you can optimize your AI models",
      "type": "story"
    },
    {
      "by": "memish",
      "descendants": 0,
      "id": 30768098,
      "score": 1,
      "time": 1647966357,
      "title": "FixedPointMathLib.sol",
      "type": "story",
      "url": "https://github.com/recmo/experiment-solexp/blob/main/src/FixedPointMathLib.sol"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30768086,
      "score": 1,
      "time": 1647966313,
      "title": "AI based ECG algorithm for ECG interpretation: Can it pass the Turing test?",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S2666693621000463"
    },
    {
      "by": "Apocryphon",
      "descendants": 0,
      "id": 30768059,
      "score": 1,
      "time": 1647966209,
      "title": "Writing by Numbers: Do we want journalists to be rated like sitcoms? (2000)",
      "type": "story",
      "url": "https://time.com/"
    },
    {
      "by": "thr0wawayf00",
      "descendants": 0,
      "id": 30768057,
      "score": 2,
      "time": 1647966194,
      "title": "Lapsus$ Gang Claims Okta Hack",
      "type": "story",
      "url": "https://www.wired.com/story/okta-hack-microsoft-bing-code-leak-lapsus/"
    }
  ]
}