{
  "stories": [
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 30109626,
      "score": 1,
      "text": "WhatsApp, and even Signal, reveal your phone number when you contact someone. Telegram doesn&#x27;t but then again, its security is debatable.<p>Do you know how one can send encrypted messages w&#x2F;o revealing one&#x27;s phone number?<p>I know one approach is to use disposable SMS numbers, but I&#x27;m looking for other methods.",
      "time": 1643333338,
      "title": "Ask HN: E2E Encrypted Messaging App that doesn't reveal phone number?",
      "type": "story"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 30109624,
      "score": 1,
      "time": 1643333321,
      "title": "Wizard and Prophet",
      "type": "story",
      "url": "https://seths.blog/2021/12/the-wizard-and-the-prophet/"
    },
    {
      "by": "unobatbayar",
      "descendants": 0,
      "id": 30109618,
      "score": 1,
      "text": "I&#x27;m quite new to software engineering career and very bad at negotiating my salary. There is an annual pay raise and I don&#x27;t know which amount is good or bad.<p>Of course, it depends on my skill and value but there seem to be a huge gap between my actual skill and what my company thinks of my skill level. I will have to sign the papers today and frankly need your help.",
      "time": 1643333294,
      "title": "Ask HN: Share your experience of pay raise",
      "type": "story"
    },
    {
      "by": "lib_sys",
      "descendants": 0,
      "id": 30109595,
      "score": 1,
      "time": 1643333115,
      "title": "Chile citizens: Support constitutional proposals for digital rights and freedoms",
      "type": "story",
      "url": "https://www.fsf.org/blogs/community/chile-citizens-support-these-constitutional-proposals-for-free-software-and-user-privacy-by-feb-1"
    },
    {
      "by": "excalibur",
      "descendants": 0,
      "id": 30109592,
      "score": 1,
      "time": 1643333107,
      "title": "Retro Studios seeking developer for Metroid Prime 4",
      "type": "story",
      "url": "https://twitter.com/RetroStudios/status/1486730941426900993"
    },
    {
      "by": "matthewmcneely",
      "descendants": 0,
      "id": 30109586,
      "score": 1,
      "text": "Hi HN, I&#x27;m Matthew from Nectr (https:&#x2F;&#x2F;nectr.network). Nectr is a service that lets IT professionals easily create a free, sharable profile that accurately captures your skills, experience and availability. With this functionality &quot;in the can&quot;, we&#x27;re in midst of extending our service to let you create a genuine, uncontrived network of colleagues that you&#x27;ve actually worked with and who can accurately confirm your skills and experience. These confirmations will form the edges in our graph that comprise your first degree network.<p>As a long time freelancer, I started working on Nectr to fill a requirement that I&#x27;ve long had: ditching my Word-formatted résumé for good—and automatically answering the oft-asked question: &quot;Are you available?&quot;. Existing options (LinkedIn, StackOverflow, JSON resume, etc.) just don&#x27;t fit the bill.<p>How is Nectr different than the alternatives?<p>- Your profile (example here: https:&#x2F;&#x2F;nectr.pub&#x2F;12507&#x2F;matthew.mcneely) is completely open—the viewer does not need to have an account on Nectr. You can also append .json to the end of your profile URL to get a machine-friendly version. The ability to maintain your profile will &lt;u&gt;always be free&lt;&#x2F;u&gt;.<p>- Your skills and platform knowledge are bound to entries in our knowledge graph of IT skills and platforms. This has (obvious?) advantages over the simple keyword tags used in most other services.<p>- Our concept of availability is extremely granular. For instance, you can set an availability for a certain rate, or engagement type or zip code. In other words, we know that availability isn&#x27;t binary. Further, we know that people can have mulitple availabilities. For example, you might be willing to work on freelance crypto projects up to 10 hours a week after hours, but also might be open to a full time job close to your home.<p>- If you hate our UI (hey, we get it), we&#x27;ll soon open up our GraphQL API so you can maintain your profile programmatically.<p>We&#x27;re currently in preview release (aka unfunded!), so we&#x27;re limiting the number of accounts while we work out the kinks. If you&#x27;re an IT professional and this sounds like something you&#x27;d be down for, you can sign up here: https:&#x2F;&#x2F;nectr.network",
      "time": 1643333086,
      "title": "Show HN: Nectr–trying to kill the resume over here",
      "type": "story"
    },
    {
      "by": "dark_pattern",
      "descendants": 0,
      "id": 30109554,
      "score": 1,
      "time": 1643332803,
      "title": "Picking Color via Eyedropper on Web App",
      "type": "story",
      "url": "https://canvatechblog.com/picking-color-via-eyedropper-on-web-app-714b75c29e49?gi=3bd033e1f319"
    },
    {
      "by": "quassnoi",
      "descendants": 0,
      "id": 30109552,
      "score": 1,
      "time": 1643332767,
      "title": "Finding the best starting word for Wordle using SQL",
      "type": "story",
      "url": "https://explainextended.com/2022/01/27/a-good-first-word-for-wordle/"
    },
    {
      "by": "steelstraw",
      "descendants": 1,
      "id": 30109520,
      "kids": [
        30109547
      ],
      "score": 1,
      "time": 1643332561,
      "title": "Robinhood posts $423M net loss, shares sink after hours",
      "type": "story",
      "url": "https://www.cnn.com/2022/01/27/business/robinhood-earnings/index.html"
    },
    {
      "by": "version_five",
      "descendants": 0,
      "id": 30109517,
      "score": 3,
      "time": 1643332525,
      "title": "Canadian Truckers Rule (Musk)",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1486772334635536395"
    }
  ]
}