{
  "stories": [
    {
      "by": "yawaramin",
      "descendants": 0,
      "id": 28278553,
      "score": 1,
      "time": 1629736984,
      "title": "OCaml at Bloomberg 'we use OCaml to write DSLs and production services –'",
      "type": "story",
      "url": "https://twitter.com/adolfont/status/1429759258942377999"
    },
    {
      "by": "pron",
      "descendants": 0,
      "id": 28278546,
      "score": 1,
      "time": 1629736934,
      "title": "TLA+: Viewed from 40k Feet and Ground Level",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Ocxczi-CvRQ"
    },
    {
      "by": "IA21",
      "descendants": 0,
      "id": 28278544,
      "score": 1,
      "time": 1629736923,
      "title": "Removing dead thunderflies stuck inside an LCD monitor (2009)",
      "type": "story",
      "url": "https://superuser.com/questions/76153/removing-dead-thunderflies-stuck-inside-an-lcd-monitor"
    },
    {
      "by": "joefigura",
      "descendants": 0,
      "id": 28278515,
      "score": 7,
      "text": "Hi, we’re Ben and Joe from Buoyant (<a href=\"https:&#x2F;&#x2F;www.buoyant.aero&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.buoyant.aero&#x2F;</a>). We build small unmanned cargo airships and use them to move air freight at half the cost per mile of a small plane.<p>An airship (or blimp) is an aircraft that gets most of its lift from a lifting gas like helium. It’s the most efficient way to fly, which means it’s cheaper than any other aircraft for many missions. We’re starting by building an aircraft for middle-mile air freight in remote and rural areas—warehouse-to-warehouse or post office to post office. This is a $6B market in the US alone, and freight volumes are only increasing. By building autonomous blimps, we can lower shipping costs, increase quality and speed of service, and cut out millions of tons of CO2 emissions.<p>So far, we’ve built and flown four airships. The latest is 20 feet long and can fly up to 35 miles per hour. Here’s a video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VEYOfVcwRhk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VEYOfVcwRhk</a>.<p>We’re starting in areas where freight is already moved on small planes and helicopters. In these remote areas, availability of goods is lower, shipping takes longer, and it’s more expensive. For example, food in rural parts of Alaska is twice as expensive as in Anchorage. Small air freight is particularly expensive because of the cost of fuel, maintenance, pilots, and airport infrastructure. To make major cost reductions we need a new type of aircraft.<p>Ben is a mechanical engineer from Alaska and grew up in the outdoors, so is familiar with the challenges of remote supply operations. He has built aircraft tracking technology for the DoD, flat panel phased array antennas, GPS data loggers for motorsports, and helped start a company that made shirts with upside down pockets. I’m an aerospace engineer who’s built and flown spacecraft at two internet satellite startups, spending a lot of time on complicated flying machines. We met at MIT and have been friends for almost a decade since.<p>We spent years building satellites and antennas to provide internet connectivity to rural areas, and while doing so learned about the transportation challenges in remote places. Many drone delivery projects have focused on delivering small packages in suburbs, and are too short range or low payload to serve rural areas. We realized small airships were a technical approach that could work to move cargo in these areas, and decided to tackle the challenge.<p>An airship is the most efficient way to fly because it gets most of its lift from buoyancy, rather than spending energy on rotor lift or aerodynamic lift over a wing. This lets us fly further and carry more payload than other small aircraft. Other attempts at unmanned cargo aircraft have used quadcopters or quad-plane hybrid drones. These are useful for some missions but lack the flight efficiency to carry large payloads long distances.  Airships have other benefits too: they are safer and quieter than quadcopters or multirotor-plane hybrids. If the motors fail, an airship floats to the ground, while a quadcopter comes crashing down. And it’s an easy way to build an aircraft that can takeoff and land vertically, like a helicopter.<p>Our airship is a fabric envelope filled with helium, with an attached payload bay, motors, and power system. It gets 2&#x2F;3 of its lift from buoyancy, and the rest from aerodynamic lift. This combination is called a hybrid airship, and allows us to drop off a payload without needing to take on ballast. The aircraft flies autonomously and can take off and land in inclement weather, using centimeter accuracy GPS for approaches. It loads 650 lbs of cargo at one end, flies to the destination while we pilot it remotely, deposits the cargo, then returns. Our first vehicle will be battery electric, with a range of 200-300 miles and a cruise speed of 60 mph. Future vehicles will have hydrogen powertrains for longer-range missions.<p>We started off with a last-mile delivery concept (“Amazon box to the house”). But in conversations with logistics providers, we found a recurring problem transporting 300-600 lb shipments between warehouses or between airports. Using drones to deliver to houses is operationally complex, and the path to doing so at scale is still murky. But with a 650 lb payload, our drone can fit neatly into existing supply chains in the middle mile. This makes our operations much simpler and should allow us to get to market relatively quickly with a few aircraft on a few routes. We’ve closed $5M in LOIs, including one from a large regional air carrier in Alaska, and have two pilot programs planned.<p>We loved reading the thread a couple weeks ago about hydrogen vs. helium for blimps, and are excited to see what people think about our airships! Where do you see the biggest use case for vehicles like ours? Let us know any other thoughts or ideas, and we’ll be active in the comments today.",
      "time": 1629736824,
      "title": "Launch HN: Buoyant (YC S21) – Blimp drones for air freight",
      "type": "story"
    },
    {
      "by": "softwaredoug",
      "descendants": 0,
      "id": 28278503,
      "score": 1,
      "time": 1629736781,
      "title": "Old Europe (Archaeology)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Old_Europe_(archaeology)"
    },
    {
      "by": "noahfschr",
      "descendants": 0,
      "id": 28278502,
      "score": 1,
      "time": 1629736768,
      "title": "5ms Global Redis Latency with Edge Caching",
      "type": "story",
      "url": "https://edge-benchmark.vercel.app/"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 28278477,
      "score": 1,
      "time": 1629736656,
      "title": "Online platform continues to raise Afghan women’s voices",
      "type": "story",
      "url": "https://www.optimistdaily.com/2021/08/this-online-platform-will-raise-afghan-womens-voices-for-as-long-as-we-can/"
    },
    {
      "by": "sysadm1n",
      "descendants": 0,
      "id": 28278465,
      "score": 1,
      "time": 1629736624,
      "title": "Phantom – A friendly Solana wallet built for DeFi and NFTs",
      "type": "story",
      "url": "https://phantom.app/"
    },
    {
      "by": "robertohanas",
      "descendants": 0,
      "id": 28278444,
      "score": 1,
      "time": 1629736572,
      "title": "How far away from burnout are you?",
      "type": "story",
      "url": "https://www.brnsft.com/burnout"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28278423,
      "score": 1,
      "time": 1629736487,
      "title": "Novus – A fast and futuristic package manager for windows",
      "type": "story",
      "url": "https://www.novuspkg.com/"
    }
  ]
}