{
  "stories": [
    {
      "by": "neustradamus",
      "descendants": 0,
      "id": 30564782,
      "score": 1,
      "time": 1646460268,
      "title": "Expat library: libexpat 2.4.7 (CVE fixes)",
      "type": "story",
      "url": "https://github.com/libexpat/libexpat/blob/R_2_4_7/expat/Changes"
    },
    {
      "by": "mherrmann",
      "descendants": 0,
      "id": 30564774,
      "score": 1,
      "text": "Authoritarian regimes control the media and block internet access to unwanted web sites. This prevents citizens from gaining access to at least other viewpoints than the political propaganda. To combat this, would it be possible to go on public transport and open a free WiFi hotspot where people can download, say, Wikipedia and PDFs of the latest headlines of independent news outlets, ideally translated into the local language?",
      "time": 1646460197,
      "title": "Ask HN: \"Newsbombs\" as a way to combat authoritarian regimes",
      "type": "story"
    },
    {
      "by": "node-bayarea",
      "descendants": 0,
      "id": 30564742,
      "score": 1,
      "text": "I want to build a &quot;production&quot; quality Hacker News clone but it needs to have some Twitter&#x2F;LinkedIn like features such as a Company or a User profile page and secondly, billing. What low-code tool I can use to quickly build this up?",
      "time": 1646459917,
      "title": "Ask HN: What is the low-code tool I can use for my project?",
      "type": "story"
    },
    {
      "by": "Opy_",
      "descendants": 0,
      "id": 30564738,
      "score": 1,
      "text": "Hey All, so I often transcribe sections I like from audiobooks, blogs, podcasts etc. and save them for later. I saved this excerpt without reference two years ago, and now I&#x27;m trying to find where it&#x27;s from. It references leading VC&#x27;s in Silicon Valley, so it&#x27;s definitely 2005+.<p>_______________<p>Maybe I’m affected by me growing up in an an unprecedented part of history, where the entire human knowledge is available through the click of a button. This has a number of key implications.\nThe first, If you fail, it’s hard to blame anyone but yourself. This is because unless you’re working on something truly unique, which is improbable, someone has worked on it before, and you can learn from that person. It’s true that the unique circumstances of the situation can be specific to you, but in general, most of the cases we deal with in life are some form of variation, of not outwright exactly the same, to something that someone else had dealt with before.<p>The second. The main problem in for most of history was to acquire the information necessary to gain the knowledge (we can think of knowledge as applied information, analagous to how engineering is applied sciences). For the first time ever, the problem isn’t getting the information; it’s all there on your browser, but it’s finding credible sources where the information is reliable, clear, and relevant to your situation. This is hard, and often takes skills. But you can often find those skills by going down the knowledges pipeline.<p>First, ask, who would know how to get such an information?<p>A librarian would likely have the formal education to go through the process of finding information. This means you can learn a lot from them. talk to a librarian, or find an online library, and read through their guidelines and processes. If this doesn’t get you through the process of finding information, it will at minimum throw you into the general community where there is applied knowledge on this, and you can begin to navigate to secondary sources.<p>Second, ask, who has gone through this before?<p>It is extremely improbable that no one had gone through what you’re through before. If you’re a startup founder and are confused about how to raise funds for the first time, figure out who has gone through that process before? probably other founders of bigger organizations. Talk&#x2F;email them, and figure out how they went about it. What were helpful resources in their quest to learn more about this?<p>Third, how do you tell if the information is reliable or not?<p>There’s a ton of junk out there. Statistically, it’s probably more junk than not. How do you figure out which is reliable information and which isn’t?<p>I’m not sure yet. But I&#x27;ve found it helpful to go to the most expert possible source and figure out what they know. That will give you a baseline to start to assess what’s bullshit and what isn’t. Applied knowledge is information, and most of the community surrounding a topic usually repeat what the top 10% says and creates, regardless if it’s outdates or recently tested or not. You need to find that 10%, and figure out what they know.<p>For example, most VC’s repeat what the leading VC’s do. Leading VC’s, like a16z, sequoia, or YC, go down to the physics and investigate arguments themselves. They then publish the results, which are often consumed by lower-VC’s, who are often too lazy or inexperienced to conduct their own thought process, and will take these results as facts. \nThis works less in academia, where by default claims are questions. In industry, the 10% usually creates the literature and sets the standards.<p>Fourth, textbooks.<p>Textbooks are a great way to figure out the current consensus and literature on what’s going on within the community. They’r designed as reference points in which learners use to find information.  \nBlogs of leading authors&#x2F;institutions.",
      "time": 1646459876,
      "title": "How to Design for Optimization",
      "type": "story"
    },
    {
      "by": "Gollapalli",
      "descendants": 0,
      "id": 30564685,
      "score": 1,
      "time": 1646459281,
      "title": "LispPi: A Lisp OS running on a Raspberry Pi 3 (with GPU drivers written in Lisp)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=KR2KxS4_0-w"
    },
    {
      "by": "scabh",
      "descendants": 1,
      "id": 30564675,
      "kids": [
        30564683
      ],
      "score": 1,
      "time": 1646459165,
      "title": "The hyper local subscription marketplace - subspace",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 1,
      "id": 30564665,
      "kids": [
        30564743
      ],
      "score": 5,
      "text": "www outline.com is offline&#x2F;unreachable since about 10 days. It is&#x2F;was(?) a very useful service to make some webpages more readable and (in some case) avoid the paywall. I also used it a lot of time to extract the &quot;reader view&quot; of some article to send it via email. But since 7-10 the website is down but domain looks okay. I&#x27;m also using a recursive DNS resolver so it&#x27;s not blocked via DNS from my ISP.<p>Someone know what&#x27;s going on? I haven&#x27;t found other info.<p>Thanks",
      "time": 1646458961,
      "title": "Ask HN: What Happened to Outline.com?",
      "type": "story"
    },
    {
      "by": "ghrst",
      "descendants": 0,
      "id": 30564664,
      "score": 1,
      "time": 1646458939,
      "title": "My journey to becoming a Scrum Master",
      "type": "story",
      "url": "https://medium.com/@ghrst/my-journey-to-becoming-a-scrum-master-1b5a91a600aa"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30564662,
      "score": 2,
      "time": 1646458915,
      "title": "AI Model Detects Mental Disorders Based on Web Posts",
      "type": "story",
      "url": "https://home.dartmouth.edu/news/2022/03/ai-model-detects-mental-disorders-based-web-posts"
    },
    {
      "by": "thg",
      "descendants": 0,
      "id": 30564655,
      "score": 1,
      "time": 1646458824,
      "title": "Apache NetBeans 13 Released",
      "type": "story",
      "url": "https://blogs.apache.org/netbeans/entry/announce-apache-netbeans-13-released"
    }
  ]
}