{
  "stories": [
    {
      "by": "whack",
      "descendants": 0,
      "id": 30796988,
      "score": 1,
      "time": 1648165497,
      "title": "Mortgage rates are surging faster than expected, prompting economists to (cont)",
      "type": "story",
      "url": "https://www.cnbc.com/2022/03/22/mortgage-rates-are-surging-faster-than-expected-prompting-economists-to-lower-their-home-sales-forecasts.html"
    },
    {
      "by": "ryan_j_naughton",
      "descendants": 0,
      "id": 30796937,
      "score": 1,
      "time": 1648165168,
      "title": "Live event tickets and the first-sale doctrine (2011)",
      "type": "story",
      "url": "https://legallysociable.com/2011/02/27/live-event-tickets-and-the-first-sale-doctrine/"
    },
    {
      "by": "SquibblesRedux",
      "descendants": 0,
      "id": 30796929,
      "score": 2,
      "time": 1648165111,
      "title": "Israel blocked Ukraine from buying Pegasus spyware, fearing Russia’s anger",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/mar/23/israel-ukraine-pegasus-spyware-russia"
    },
    {
      "by": "mescaline",
      "descendants": 0,
      "id": 30796907,
      "score": 1,
      "time": 1648164992,
      "title": "Bitcoiner sends message to crypto scammer after requiring they use Lighting",
      "type": "story",
      "url": "https://cointelegraph.com/news/bitcoin-veteran-tricks-crypto-scammer-into-learning-lightning"
    },
    {
      "by": "Vespasian",
      "descendants": 0,
      "id": 30796880,
      "score": 2,
      "time": 1648164811,
      "title": "DMA: EU institutions agree on new rules for Big Tech",
      "type": "story",
      "url": "https://www.euractiv.com/section/digital/news/dma-eu-institutions-agree-on-new-rules-for-big-tech/"
    },
    {
      "by": "leozhang",
      "descendants": 0,
      "id": 30796819,
      "score": 1,
      "time": 1648164452,
      "title": "Uniswap V2 Explained (Beginner Friendly)",
      "type": "story",
      "url": "https://medium.com/@chiqing/uniswap-v2-explained-beginner-friendly-b5d2cb64fe0f"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 30796811,
      "score": 3,
      "time": 1648164411,
      "title": "Prepare for weaponized AI that adapts in real-time to your defenses, says prof",
      "type": "story",
      "url": "https://www.theregister.com/2022/03/24/ai_cybersecurity_gtc/"
    },
    {
      "by": "prohobo",
      "descendants": 1,
      "id": 30796778,
      "kids": [
        30796905
      ],
      "score": 3,
      "text": "“Everywhere is over. It’s not happening anywhere. There’s no point in city-chasing.” - Eric Weinstein.<p>Since Covid, there&#x27;s been a lot of talk about leaving cities and moving to smaller towns and the country-side. I also saw a growing interest in ideas like coliving, eco villages, and digital nomads.<p>It seems to me that a lot of people are either looking for a change, or for community - and aren&#x27;t finding it in the cities. The internet seems to have subsumed all of culture and everyone&#x27;s energy, so that you&#x27;re either in the rat race, working for the interests of the internet, or escaping to the country-side to farm potatoes. I&#x27;m wary of moving to a rural area, because I can&#x27;t really see anything going on there either. Won&#x27;t most people just become more isolated than they feel in the city?<p>Of course, I understand many people are perfectly happy and have strong roots where they live, and many people who feel that living in the city is just... well, better. That&#x27;s not what I&#x27;m talking about. There are many people who are unrooted. I don&#x27;t care about the restaurants, the shops, or the concerts. Don&#x27;t care about beautiful architecture or finding a group to play Dungeons &amp; Dragons with. Those things, for many people, sound good on paper but the reality is often very disappointing. For me, the city is a place to come to once a month to do one thing then leave - but I wouldn&#x27;t know where to leave to.<p>What I&#x27;m not seeing anywhere is a grounded movement of people doing something cool. Not consuming, not escaping, but doing. I&#x27;m tired of talking to people who are &quot;just looking around&quot; or &quot;studying&quot;. My eyes instantly glaze over when someone starts telling me about their incomprehensible job, or the amazingly inconsequential places they&#x27;ve been to, or their favorite consumables.<p>Another quote that resonates with me, from a song called Seattle Party: &quot;Your tattoos are so deep, they really make me think &#x2F;s&quot;, perfectly encapsulates my utter despair with living in the city.<p>What I&#x27;m talking about is in the quote from Eric Weinstein. Where are you supposed to go when you want something more (or less)? Where are the Willy Wonkas at? Where are the easy riders?<p>Are cities in general dead places? Is it just me?<p>inb4 Burning Man.",
      "time": 1648164212,
      "title": "Ask HN: Should people move away from cities?",
      "type": "story"
    },
    {
      "by": "swpecht",
      "descendants": 0,
      "id": 30796774,
      "score": 1,
      "time": 1648164166,
      "title": "Its Always Sunny in us-east-1",
      "type": "story",
      "url": "https://www.cyclic.sh/posts/its-always-sunny-in-us-east-1"
    },
    {
      "by": "anon23anon",
      "descendants": 0,
      "id": 30796753,
      "score": 2,
      "text": "Ten plus years ago the security team would actually read our code. They knew what to look for, where the language or database or server had vulnerabilities. Any issues they brought forward were actual real issues that needed attention. Now so many &quot;security researchers&quot; are simply running our code through automated tools. I have to spend time helping them create the Jenkins jobs to run the task and then they also need help analyzing the results. For example I had to explain dev dependencies don&#x27;t ship with our production code so a given exploit is not applicable. Do I just work for a junk company or is this the new norm?",
      "time": 1648164047,
      "title": "Ask HN: Anyone feel like the security field has gone to shit?",
      "type": "story"
    }
  ]
}