{
  "stories": [
    {
      "by": "awb",
      "descendants": 0,
      "id": 30515628,
      "score": 1,
      "time": 1646150010,
      "title": "Maersk suspends container shipments to and from Russia",
      "type": "story",
      "url": "https://www.businessinsider.com/maersk-pauses-russia-shipments-except-food-medical-humanitarian-aid-2022-3"
    },
    {
      "by": "lalaland1125",
      "descendants": 0,
      "id": 30515610,
      "score": 4,
      "time": 1646149895,
      "title": "Russia Today, Sputnik and other channels disappear from YouTube",
      "type": "story",
      "url": "https://www.independent.co.uk/tech/youtube-rt-russia-today-sputnik-ukraine-b2025512.html"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30515597,
      "score": 1,
      "time": 1646149844,
      "title": "Designing Gotham",
      "type": "story",
      "url": "https://www.theringer.com/2022/3/1/22955016/batman-gotham-city-design-history"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30515592,
      "score": 1,
      "time": 1646149820,
      "title": "What happens to your body when you start exercising regularly",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=rBUjOY12gJA"
    },
    {
      "by": "islon",
      "descendants": 0,
      "id": 30515584,
      "score": 1,
      "time": 1646149772,
      "title": "‘Yes, He Would’: Fiona Hill on Putin and Nukes",
      "type": "story",
      "url": "https://www.politico.com/news/magazine/2022/02/28/world-war-iii-already-there-00012340"
    },
    {
      "by": "slayerjain",
      "descendants": 1,
      "id": 30515583,
      "kids": [
        30515641
      ],
      "score": 3,
      "time": 1646149770,
      "title": "Our no-code testing platform is testing itself and already getting 70% coverage",
      "type": "story",
      "url": "https://github.com/keploy/keploy"
    },
    {
      "by": "lichtenberger",
      "descendants": 0,
      "id": 30515582,
      "score": 1,
      "text": "Hi all,<p>Sebastian and his students did a tremendous job creating Brackit[1] in the first place as a retargetable query engine for different data stores. They worked hard to optimize aggregations and joins. Despite its clear database query engine routes, it&#x27;s furthermore useable as a standalone ad-hoc in-memory query engine.<p>Sebastian did his research for his Ph.D. at the TU-Kaiserslautern at the database systems group of Theo Härder. Theo Härder coined the well-known acronym ACID with Andreas Reuter, the desired properties of transactions.<p>As he&#x27;s currently not maintaining the project anymore, I stepped up and forked the project a couple of years ago. I&#x27;m using it for my evolutionary, immutable data store SirixDB[2], which stores the entire history of your JSON data in small-sized snapshots in an append-only file (tailored binary format similar to BSON). It&#x27;s exceptionally well suited for audits, undo operations, and sophisticated analytical time travel queries.<p>I&#x27;ve changed a lot of stuff, such that Brackit is getting more and more compatible with the JSONiq query language standard, added JSONiq update primitives, and fixed several bugs. Furthermore, I&#x27;ve added temporal extension functions and temporal XPath axis in SirixDB, index rewrite rules, etc. pp.<p>As Brackit can query XML, we&#x27;re also able to transform XML data to JSON and vice versa.<p>Moshe and I are working on a  Jupyter Notebook &#x2F; Tutorial[3] for interactive queries.<p>We&#x27;re looking forward to your bug reports, issues, and questions. Contributions are, of course, highly welcome. Maybe even implementations for other data stores or common query optimizations.<p>Furthermore, we&#x27;d gladly see further (university-based?) research.<p>It should, for instance, be possible to add vector instructions in the future, as the query engine is already set-oriented and processes sets of tuples for the so-called FLWOR expressions (see JSONiq). Brackit rewrites FLWOR expression trees in the AST to a pipeline of operations to port optimizations from relational query engines for efficient join processing and aggregate expressions. Furthermore, certain parts of the queries are parallelizable, as detailed in Sebastian&#x27;s thesis. We also envision a stage for the compiler to use distributed processing (first research used MapReduce, but we can now use better-suited approaches, of course).<p>Kind regards\nJohannes<p>[1] https:&#x2F;&#x2F;github.com&#x2F;sirixdb&#x2F;brackit\n[2] https:&#x2F;&#x2F;sirix.io | https:&#x2F;&#x2F;github.com&#x2F;sirixdb&#x2F;sirix\n[3] https:&#x2F;&#x2F;colab.research.google.com&#x2F;drive&#x2F;19eC-UfJVm_gCjY--koOWN50sgiFa5hSC",
      "time": 1646149757,
      "title": "Show HN: Brackit – a retargetable JSONiq based query engine for JSON",
      "type": "story"
    },
    {
      "by": "mayyvan",
      "descendants": 2,
      "id": 30515554,
      "kids": [
        30515637,
        30515627
      ],
      "score": 3,
      "time": 1646149593,
      "title": "Compare Tech Salaries Instantly: Introducing the VanHack Tech Salary Calculator",
      "type": "story",
      "url": "https://blog.vanhack.com/blog/compare-tech-salaries-instantly-introducing-the-vanhack-tech-salary-calculator/"
    },
    {
      "by": "davidbarker",
      "descendants": 0,
      "id": 30515536,
      "score": 4,
      "time": 1646149518,
      "title": "React.__SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED",
      "type": "story",
      "url": "https://github.com/facebook/react/blob/main/packages/shared/ReactSharedInternals.js"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30515518,
      "score": 1,
      "time": 1646149449,
      "title": "Stuplimity: Shock and Boredom in Twentieth-Century Aesthetics",
      "type": "story",
      "url": "https://muse.jhu.edu/article/27722"
    }
  ]
}