{
  "stories": [
    {
      "by": "brethil",
      "descendants": 0,
      "id": 31713525,
      "score": 1,
      "time": 1655031060,
      "title": "Oneplus GPL violation for Android 12 Kernel",
      "type": "story",
      "url": "https://github.com/OnePlusOSS/android_kernel_oneplus_sm8250/issues/24"
    },
    {
      "by": "vkurjsnnw",
      "descendants": 0,
      "id": 31713492,
      "score": 1,
      "text": "I&#x27;m dating my best friend. We have amazing fun together, but I don&#x27;t find her that attractive. I often catch myself looking at other women, which feels like a bad sign for a healthy long-term relationship with her. On the other hand, I don&#x27;t think I could find anyone who I&#x27;d enjoy everyday life as much with.",
      "time": 1655030542,
      "title": "Ask HN: Importance af attraction for long-term relationship?",
      "type": "story"
    },
    {
      "by": "gsanghera",
      "descendants": 0,
      "id": 31713490,
      "score": 1,
      "time": 1655030530,
      "title": "First direct evidence of isolated stellar mass black hole roaming the Milky Way",
      "type": "story",
      "url": "https://www.nasa.gov/feature/goddard/2022/hubble-determines-mass-of-isolated-black-hole-roaming-our-milky-way-galaxy/"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 31713486,
      "score": 1,
      "time": 1655030489,
      "title": "Ten things all languages have in common",
      "type": "story",
      "url": "https://blog.duolingo.com/language-similarities/"
    },
    {
      "by": "tobr",
      "descendants": 0,
      "id": 31713483,
      "score": 1,
      "time": 1655030449,
      "title": "Beyond Cyberpunk! The Web Version",
      "type": "story",
      "url": "http://www.streettech.com/bcp/"
    },
    {
      "by": "unsignednoop",
      "descendants": 1,
      "id": 31713478,
      "kids": [
        31713536
      ],
      "score": 2,
      "text": "I have a full pantry and half an ounce of weed",
      "time": 1655030347,
      "title": "Ask HN: What’s the most efficient way to get cooked?",
      "type": "story"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 31713441,
      "score": 1,
      "time": 1655029717,
      "title": "Mass frog burial baffles experts at iron age site near Cambridge",
      "type": "story",
      "url": "https://www.theguardian.com/science/2022/jun/12/mass-frog-burial-baffles-experts-at-iron-age-site-near-cambridge"
    },
    {
      "by": "GRW9goqAmHpgXaj",
      "descendants": 0,
      "id": 31713435,
      "score": 1,
      "time": 1655029643,
      "title": "VRS: Lightweight static web server written in Rust",
      "type": "story",
      "url": "https://github.com/PeterPierinakos/vanilla-rustlang-server"
    },
    {
      "by": "itsmefaz",
      "descendants": 0,
      "id": 31713403,
      "score": 2,
      "text": "Most of the day to day software engineering is our ability to work with the language tooling. We can also call it the ecosystem that the language provides. From Java&#x27;s perspective most of our interaction with the language is not directly with the language but with frameworks like Spring etc. These things are meant to make the language more easily digestible.<p>The problem comes in when the platform becomes so huge that there is no way to logical develop a thorough understanding of the actual technology at hand. I have been studying Java again to brush up my understanding of it but found that the language has grown so much it is difficult to derive a logical end to the platform.<p>This was further evident when I started looking for Java developer roles in my country and found that just understanding Java and its principles were not enough. There seemed to be a general consensus that Java developers must know other related technologies like Spring, JPA, Hibernate, etc. All these related technologies bring their own software paradigm into the picture and hide the actual technology (Java) under the hood.<p>* Why for some weird reason a Java developer must know or supplement his understanding of the language with framework like Spring, JPA, Hibernate, etc? This is true for other platforms like Node.JS where you have MERN stack etc.<p>* Are there other languages (or platforms) like Go or Rust where the language is well developed that these external dependencies are minimal.",
      "time": 1655029156,
      "title": "Ask HN: Java Suffers from an Identity Problem",
      "type": "story"
    },
    {
      "by": "graylien",
      "descendants": 0,
      "id": 31713395,
      "score": 1,
      "time": 1655028995,
      "title": "Google engineer thinks AI bot has become sentient",
      "type": "story",
      "url": "https://www.businessinsider.com/google-engineer-thinks-artificial-intelligence-bot-has-become-sentient-2022-6"
    }
  ]
}