{
  "stories": [
    {
      "by": "geocon",
      "descendants": 0,
      "id": 31812984,
      "score": 1,
      "time": 1655745896,
      "title": "Redfin Economist says land value tax will fix the economy",
      "type": "story",
      "url": "https://narrativespodcast.com/2022/06/20/99-daryl-fairweather-the-housing-crisis/"
    },
    {
      "by": "revorad",
      "descendants": 0,
      "id": 31812983,
      "score": 1,
      "time": 1655745894,
      "title": "Fixing the ROI Rubric",
      "type": "story",
      "url": "https://longform.asmartbear.com/docs/roi-rubric/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31812979,
      "score": 1,
      "time": 1655745865,
      "title": "Postcards from Timbuktu",
      "type": "story",
      "url": "https://www.postcardsfromtimbuktu.com/"
    },
    {
      "by": "danielovichdk",
      "descendants": 0,
      "id": 31812947,
      "score": 1,
      "text": "I have been writing code and made products for a couple of centuries now. I am by no means a security guy and consider myself a novice in things that lie outside of the best practices, e.g: cross-site attacks, TLS everywhere, no password in configs, no clear text creds etc.<p>But what am I missing ?<p>What are the top 10 things you do when you want to feel safe, when developing products and code.<p>Do you lock the server into a vault and disconnect it from the power?<p>Please share<p>Every time I see",
      "time": 1655745708,
      "title": "Ask HN: As a developer, what is cyber security?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31812937,
      "score": 1,
      "time": 1655745662,
      "title": "OSSummit North America is going to be weird – and I can’t wait",
      "type": "story",
      "url": "https://blog.opensource.org/ossummit-north-america-is-going-to-be-weird-and-i-cant-wait/"
    },
    {
      "by": "yumraj",
      "descendants": 0,
      "id": 31812936,
      "score": 1,
      "text": "I&#x27;ve always been curious about the effectiveness of putting a company&#x27;s technical and marketing whitepapers behind a form collecting name&#x2F;email&#x2F;phone no.<p>On one hand it makes sense, that the company collects information, leads, that their sales team can follow-up on.<p>On the other hand, there is a friction and I&#x27;m assuming several people drop off who may have otherwise just clicked on the link to get the whitepaper.<p>Additionally, and I don&#x27;t have data, some people might be putting just fake info to download the material.<p>We see several examples of people posting direct links here on HN itself.<p>So, the question: has anyone done any research on what is an effective strategy? I believe there are a few options:<p>- Document behind a form<p>- Document behind a form, with a direct download link also provided to reduce friction<p>- Document link shared freely<p>- Document link shared freely, with an optional form if they&#x27;d like to be contacted out by the sales team.<p>- other?<p>Are there any good examples of best practices that companies have followed that people here on HN generally like?",
      "time": 1655745653,
      "title": "Ask HN: Whitepapers behind a form – Good idea or Bad? Best options?",
      "type": "story"
    },
    {
      "by": "pwython",
      "descendants": 0,
      "id": 31812932,
      "score": 1,
      "text": "Most popular &quot;tech&quot; YouTube videos I watch are usually sponsored by some sort of VPN company (partnerships, not display ads). So it seems like it&#x27;s quite a lucrative business. However, I&#x27;ve never actually understood why these VPNs are all the rage these days. I&#x27;ve been making websites since the late &#x27;90s, and the only time I&#x27;ve had to deal with a VPN was to help overseas employees see what I see in the US.<p>These days we have ad-blockers, incognito sessions and whatnot, so what is the benefit of using a VPN for daily personal use, to the point where the ad spend on this can be so enormous?",
      "time": 1655745636,
      "title": "Ask HN: Why do you use a VPN?",
      "type": "story"
    },
    {
      "by": "peter_d_sherman",
      "descendants": 0,
      "id": 31812926,
      "score": 1,
      "time": 1655745599,
      "title": "Internet Archive – The Vintage Software Collection",
      "type": "story",
      "url": "https://archive.org/details/vintagesoftware"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31812896,
      "score": 2,
      "time": 1655745455,
      "title": "Naps Can Jump-Start Your Creativity",
      "type": "story",
      "url": "https://www.literatureandlatte.com/blog/how-naps-can-jump-start-your-creativity"
    },
    {
      "by": "jad___",
      "descendants": 0,
      "id": 31812895,
      "score": 1,
      "time": 1655745453,
      "title": "For the Brave for the Proud",
      "type": "story",
      "url": "https://github.com/jadsaklawi/the-lowball/commit/9330b947d42bd3de36170ab86149a6e95f84bfaa"
    }
  ]
}