{
  "stories": [
    {
      "by": "mudro_zboris",
      "descendants": 0,
      "id": 30606273,
      "score": 1,
      "time": 1646770794,
      "title": "Trans People Stranded and Alone in Ukraine Following Russia’s Invasion",
      "type": "story",
      "url": "https://www.vice.com/en/article/akvyxz/ukraine-war-trans-people-lgbtq"
    },
    {
      "by": "T-A",
      "descendants": 0,
      "id": 30606263,
      "score": 1,
      "time": 1646770753,
      "title": "DeepFakes, Can You Spot Them?",
      "type": "story",
      "url": "https://detectfakes.media.mit.edu/"
    },
    {
      "by": "hachesilva",
      "descendants": 0,
      "id": 30606244,
      "score": 1,
      "text": "I&#x27;d like to create a GUI utility to work with ID3 tags on mp3 files. I was looking for options and found out that programming for Windows is a daunting experience.<p>I can recall starting programming using Visual Basic a long, long time ago. By then I found it very easy to start with because of the drag-&amp;-drop nature of the GUI, out-of-the-box events, etc.<p>What are some modern, free alternatives to Visual Basic that would allow me to easily create a GUI and attach scripts and events to its controls?<p>Please excuse my dated references, I am a web developer unfamiliar with programming for the desktop",
      "time": 1646770691,
      "title": "Ask HN: Modern, easy-to-start with alternatives to Visual Basic",
      "type": "story"
    },
    {
      "by": "andrewflnr",
      "descendants": 0,
      "id": 30606202,
      "score": 1,
      "text": "I&#x27;m not an expert in USB3 implementation details, but it seems to be a nightmare, even if you can afford to buy the spec. Meanwhile, power-over-ethernet has existed for a while. It seems like all we would need is slightly different connectors to fit into slim devices like phones, and PoE capable cables could fill the data-and-charging roles of USB3, with less weird proprietary nonsense, almost none except for the connector itself, which could conceivably (definitely in my fantasy world) be an open-source design. The software and most of the other hardware pretty much already exists, right? Connecting your phone to your computer is just networking, like plugging in an Ethernet adapter.<p>I&#x27;m sure it can&#x27;t actually be as simple as just CADing up some new connectors, but is there a reason besides inertia this couldn&#x27;t be done and be effective? Say, by a startup willing to abandon a bit of precedent to get a less-proprietary connector?",
      "time": 1646770536,
      "title": "Ask HN: Replacing USB3 with slim Power-over-Ethernet, too crazy?",
      "type": "story"
    },
    {
      "by": "gerbilly",
      "descendants": 0,
      "id": 30606156,
      "score": 1,
      "time": 1646770378,
      "title": "Dodemus.nl: Condolences for a Dead Sparrow (2005)",
      "type": "story",
      "url": "http://web.archive.org/web/20060117021306/http://www.dodemus.nl/"
    },
    {
      "by": "sideproject",
      "descendants": 1,
      "id": 30606145,
      "kids": [
        30606166
      ],
      "score": 1,
      "time": 1646770343,
      "title": "Show HN: Daily best from all StackExchange sites",
      "type": "story",
      "url": "https://stack.tello.app/b/0tkar0dsbo"
    },
    {
      "by": "boyneyy123",
      "descendants": 0,
      "id": 30606114,
      "score": 1,
      "time": 1646770235,
      "title": "Open Source Documentation Tool for Event-Driven Architectures",
      "type": "story",
      "url": "https://www.eventcatalog.dev/"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 30606058,
      "score": 1,
      "time": 1646770048,
      "title": "Ormeus Coin Founder Charged with Cryptocurrency Securities Fraud",
      "type": "story",
      "url": "https://www.justice.gov/usao-sdny/pr/john-barksdale-charged-cryptocurrency-securities-fraud-connection-sale-ormeus-coin"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 30605986,
      "score": 1,
      "time": 1646769803,
      "title": "Squeezing a Wordle Clone onto the Game Boy",
      "type": "story",
      "url": "https://hackaday.com/2022/03/01/squeezing-a-wordle-clone-onto-the-game-boy/"
    },
    {
      "by": "keewee7",
      "descendants": 0,
      "id": 30605970,
      "score": 1,
      "time": 1646769758,
      "title": "Poland ready to place all its MIG-29 jets at the disposal of the US",
      "type": "story",
      "url": "https://www.jpost.com/breaking-news/article-700709"
    }
  ]
}