{
  "stories": [
    {
      "by": "L_226",
      "descendants": 0,
      "id": 29011950,
      "score": 1,
      "time": 1635335466,
      "title": "Solar Updraft Tower",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Solar_updraft_tower"
    },
    {
      "by": "impostervt",
      "descendants": 0,
      "id": 29011946,
      "score": 1,
      "time": 1635335445,
      "title": "Scenius – the intelligence and intuition of a whole cultural scene",
      "type": "story",
      "url": "https://www.notboring.co/p/sc3nius"
    },
    {
      "by": "leefarrar",
      "descendants": 0,
      "id": 29011933,
      "score": 1,
      "time": 1635335304,
      "title": "How to give feedback (the 3 brain model)",
      "type": "story",
      "url": "https://medium.com/@leefarrar/you-have-3-brains-698fed937a95"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 29011909,
      "score": 3,
      "time": 1635335121,
      "title": "The Wit and Wisdom of Thomas Sowell",
      "type": "story",
      "url": "https://www.nationalreview.com/2021/10/the-wit-and-wisdom-of-thomas-sowell/"
    },
    {
      "by": "utdiscant",
      "descendants": 0,
      "id": 29011896,
      "score": 1,
      "text": "David here, CEO and co-founder of Eduflow (<a href=\"https:&#x2F;&#x2F;www.eduflow.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.eduflow.com</a>). Eduflow is a learning management system that lets you build and run learning experiences where participants can interact, participate actively and can do so asynchronously.<p>Learning needs to be active to be effective. For example, the best way to learn to code is to write a lot of code. Online learning still struggles with this. Mostly you get a playlist of videos to consume and a quiz at the end, or you’re required to participate in live video calls. Our product lets you build active and social learning experiences that work async.<p>We went through YC in 2017 with Peergrade (<a href=\"https:&#x2F;&#x2F;www.peergrade.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.peergrade.io</a>), a tool for online peer reviews. We got to a decent size, but ran into challenges. When we landed a deal with a company or a university, we would be a small part of the experience. We’d only get used a few times a year, and only a portion of instructors would be using peer reviews. Peer reviews were seen as a feature of a learning management system, not a product in itself.<p>We noticed that we could generalize Peergrade to make a more flexible tool that would be able to match their pedagogical designs and not force instructors to model their courses after our tool. At some point we were generalizing so much that we shifted focus to building a whole learning management system instead. That’s Eduflow!<p>Our design is modular. Your course starts out empty, and you add the learning activities that you want. Activities can depend on each other—for example, a group-based peer review flow where you first want learners to select their group members (group formation activity), then submit some kind of work together (submission activity), then give feedback to other groups (peer review activity) and finally to reflect on that feedback (feedback reflection activity). This modular approach has been non-trivial to implement but it allows instructors to build exactly the learning experience they want, so the experience for the learner is extremely guided. And it allows us to extend Eduflow by adding new activities which can then work with all the existing ones.<p>Some of our customers (such as Google, Adobe and Accenture) are large companies that use us to run training and onboarding for sales orgs, or to do peer reviews at scale. Others are educational institutions (such as ETH Zürich and McGill University) that use Eduflow to make their large courses more interactive.<p>We sell a subscription to our service, and we offer a freemium plan. Since raising some money after YC Demo Day in 2017, Eduflow has become a profitable 12-person company.<p>Looking forward to hearing your feedback and answering any questions you may have. Thank you :).",
      "time": 1635335035,
      "title": "Launch HN: Eduflow (YC S17) – Async Social Learning",
      "type": "story"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29011894,
      "score": 2,
      "time": 1635335010,
      "title": "Sequoia Productive Capital",
      "type": "story",
      "url": "https://stratechery.com/2021/sequoia-productive-capital/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29011876,
      "score": 2,
      "time": 1635334895,
      "title": "Toki Pona: A Language with a Hundred Words (2015)",
      "type": "story",
      "url": "https://www.theatlantic.com/technology/archive/2015/07/toki-pona-smallest-language/398363/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29011872,
      "score": 2,
      "time": 1635334881,
      "title": "It's took a long time, but I made my own garum",
      "type": "story",
      "url": "https://twitter.com/lostsupper/status/1453003368725717000"
    },
    {
      "by": "shahinghasemi",
      "descendants": 0,
      "id": 29011850,
      "score": 2,
      "time": 1635334706,
      "title": "Edward Snowden's Persian Tweet",
      "type": "story",
      "url": "https://twitter.com/Snowden/status/1451088363340144641"
    },
    {
      "by": "xiaodai",
      "descendants": 0,
      "id": 29011847,
      "score": 3,
      "time": 1635334683,
      "title": "The Czech Play That Gave Us the Word ‘Robot’",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/origin-word-robot-rur/"
    }
  ]
}