{
  "stories": [
    {
      "by": "frogtoss",
      "descendants": 0,
      "id": 29814311,
      "score": 1,
      "time": 1641413694,
      "title": "Low Overhead Structured Logging in C",
      "type": "story",
      "url": "https://www.frogtoss.com/labs/low-overhead-structured-logging-in-c.html"
    },
    {
      "by": "smrtinsert",
      "descendants": 0,
      "id": 29814301,
      "score": 1,
      "text": "I realized recently I find text flow in variable browser sizes very disorienting.<p>For example: the text on URL X on my phone is a lot easier for me to remember then the same URL on my laptop or desktop browser.  This is because I&#x27;m always resizing my browser on a desktop or laptop while on my phone, the text is always on the same place when I read it.  This is really helpful for remember for some reason.<p>Is there an extension or some pattern of browsing I can use to make sure my desktop experience is consistent across browsers?  Something like &quot;right click, set browser width to 120 ems&quot;?",
      "time": 1641413621,
      "title": "Ask HN: How do I normalize text width as a client across devices?",
      "type": "story"
    },
    {
      "by": "decimadigital",
      "descendants": 0,
      "id": 29814298,
      "score": 1,
      "time": 1641413609,
      "title": "Magento SEO Tips and Best Practices to Rank Higher Your Store in SERPs",
      "type": "story",
      "url": "https://decimadigital.com/magento-seo-tips/"
    },
    {
      "by": "ricc",
      "descendants": 0,
      "id": 29814286,
      "score": 1,
      "time": 1641413504,
      "title": "Canon’s flagship DSLR line will end with the EOS-1D X Mark III, eventually",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/30/22860537/canon-dslr-mirrorless-eos-1d-x-mark-iii-development-production-end"
    },
    {
      "by": "latchkey",
      "descendants": 0,
      "id": 29814278,
      "score": 1,
      "time": 1641413466,
      "title": "A Tax on Proof-of-Work",
      "type": "story",
      "url": "http://jpkoning.blogspot.com/2022/01/a-tax-on-proof-of-work.html"
    },
    {
      "by": "withatom",
      "descendants": 0,
      "id": 29814276,
      "score": 1,
      "text": "Hi, This is Shreyansh, founder of Brix, am very excited to announce that we&#x27;re now accepting requests for our full-stack non-custodial cryptocurrency payments and programmable payouts solution, which will do most of the legwork for you to make it easier to accept payments and manage payouts in cryptocurrencies on your e-commerce, SaaS, marketplace, platform app, or website, with high customizability, and easy-to-read code, to meet your brand needs.<p>A few months ago, I was asked by a client in my freelance work to integrate cryptocurrency payments in their marketplace website, I could find no solution, currently, we have solutions to accept cryptocurrency payments, of which none is non-custodial, none provides programmable payouts, none is developer-centric, none has subscriptions coming to them, that&#x27;s why we built Brix.<p>I&#x27;m currently working all my free time, to make the solution open to everyone, making it more secure, introducing new features, creating a distributed open-source layer 2 network, and preparing the documentation. So, if you&#x27;re interested in this you can sign-up for early access.<p>We&#x27;re open to suggestions, feedback, and I&#x27;m looking for two individuals to join me in building Brix (specifically: Rust, Go, Full Stack Devs), as a co-founder.<p>https:&#x2F;&#x2F;brixpayments.com",
      "time": 1641413463,
      "title": "Launch: Brix – Full stack crypto payments solution",
      "type": "story"
    },
    {
      "by": "tantaman",
      "descendants": 0,
      "id": 29814262,
      "score": 1,
      "time": 1641413403,
      "title": "The shortest TODO-MVC uses no frameworks",
      "type": "story",
      "url": "https://tantaman.com/2021-02-12-Todo-MVC/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29814247,
      "score": 2,
      "time": 1641413312,
      "title": "Twenty years of the International Space Station – but was it worth it? (2020)",
      "type": "story",
      "url": "https://www.theguardian.com/science/2020/oct/25/twenty-years-of-the-international-space-station-but-was-it-worth-it"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29814243,
      "score": 1,
      "time": 1641413300,
      "title": "Could the NYT make money from its scoops? (2012)",
      "type": "story",
      "url": "https://www.reuters.com/article/idUK385784028920120424"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29814200,
      "score": 1,
      "time": 1641413108,
      "title": "eBPF Foundation",
      "type": "story",
      "url": "https://ebpf.io/foundation/"
    }
  ]
}