{
  "stories": [
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 27743260,
      "score": 1,
      "time": 1625532640,
      "title": "List of P2P File Sending Tools",
      "type": "story",
      "url": "https://xosh.org/p2p-tools/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 27743251,
      "score": 1,
      "time": 1625532569,
      "title": "Designing a High-Resolution, Lego-Based Microscope for an Educational Setting",
      "type": "story",
      "url": "https://meridian.allenpress.com/the-biophysicist/article/doi/10.35459/tbp.2021.000191/466674/Designing-a-High-Resolution-LEGO-Based-Microscope"
    },
    {
      "by": "srl",
      "descendants": 0,
      "id": 27743236,
      "score": 2,
      "time": 1625532397,
      "title": "Do cosmic rays cause domain name bit-flips?",
      "type": "story",
      "url": "https://ineffectivetheory.com/cosmic-rays-dns-bitflips/"
    },
    {
      "by": "sova",
      "descendants": 0,
      "id": 27743232,
      "score": 1,
      "time": 1625532364,
      "title": "Mars Glowing Auroras",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-021-01811-4"
    },
    {
      "by": "hirundo",
      "descendants": 0,
      "id": 27743231,
      "score": 2,
      "time": 1625532360,
      "title": "America’s First Legal DAO Approved in Wyoming",
      "type": "story",
      "url": "https://decrypt.co/75222/americas-first-dao-approved-in-wyoming"
    },
    {
      "by": "exolymph",
      "descendants": 0,
      "id": 27743204,
      "score": 2,
      "time": 1625532147,
      "title": "Get Lucky",
      "type": "story",
      "url": "https://razib.substack.com/p/get-lucky"
    },
    {
      "by": "nitred",
      "descendants": 1,
      "id": 27743169,
      "kids": [
        27743195
      ],
      "score": 3,
      "text": "This is just me rambling but the thought of using natural physics to solve complex computation as described here [1] got me thinking about using humans to do complex computation as part of a neural net. Is it possible to create a neural net where the neurons or activation functions are humans and only the communication between the humans (i.e. the weights&#x2F;synapses) need to be optimized. Does anyone know if there&#x27;s experiments done for this? I know of one thought experiment which is similar but for another purpose called the China brain [2].<p>* The idea is that you can make an AGI out of a network of humans. The individual humans within the network needn&#x27;t know how they are contributing to the overall intelligence of the AGI.<p>* The communication between neighboring humans in the network can happen via sending emails, over hand help radios, yelling or even dockerized containers. The optimization algorithm determines to whom these messages are sent and with what &quot;weight&quot;.<p>* The inputs and outputs need not be trivial, they can be arbitrarily complex, such as numbers, theorems, songs or questions being posed and answered. These inputs and outputs need only be &quot;differentiable&quot; either numerically or even in a &quot;fuzzy&quot; sense in order to allow the communication to be optimized.<p>* An example could be a neural net of mathematicians who together produce a better mathematician who is able to solve a problem no one single mathematician within the network is able to solve. This neural net of mathematicians could be better than a group of mathematicians discussing amongst themselves. In a group discussion, human dynamics come into play, where one of the mathematicians becomes the leader and needs to act as a centralized consolidator and arbiter of information. Whereas in the neural net the algorithm&#x2F;weights determines how the mathematicians communicate with each other.<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27738029<p>[2] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;China_brain",
      "time": 1625531735,
      "title": "Ask HN: Can a neural network where the neurons are humans become AGI?",
      "type": "story"
    },
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 27743148,
      "score": 2,
      "time": 1625531483,
      "title": "Intrusive Thought",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Intrusive_thought"
    },
    {
      "by": "Austin_Conlon",
      "descendants": 0,
      "id": 27743086,
      "score": 3,
      "time": 1625530805,
      "title": "Office Assistant",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Office_Assistant"
    },
    {
      "by": "ghostmatt",
      "descendants": 2,
      "id": 27743060,
      "kids": [
        27743158,
        27743165
      ],
      "score": 2,
      "text": "Any good reads on how or where to find a Co-founder. I am non technical and need a technical co-founder. Not really sure where to start looking. An and all advice, links etc. would be greatly appreciated !",
      "time": 1625530476,
      "title": "Any tips on how to find a technical co-founder?",
      "type": "story"
    }
  ]
}