{
  "stories": [
    {
      "by": "fka",
      "descendants": 0,
      "id": 31987221,
      "score": 1,
      "time": 1657022991,
      "title": "macOS doesn't allow to create a new user called “sandbox”",
      "type": "story",
      "url": "https://twitter.com/fkadev/status/1544292286183473152"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31987210,
      "score": 1,
      "time": 1657022942,
      "title": "Subreply CSS: Simple, yet modern and beautiful classless CSS style",
      "type": "story",
      "url": "https://github.com/HoangTuan110/subreply-css"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31987206,
      "score": 1,
      "time": 1657022898,
      "title": "FlyURL – A simple, self-hosted URL shortener",
      "type": "story",
      "url": "https://github.com/HoangTuan110/flyurl"
    },
    {
      "by": "rrishi",
      "descendants": 0,
      "id": 31987190,
      "score": 1,
      "text": "Hello HN,<p>I have been a professional software engineer for four years. I also have a bachelors in CS.<p>During my career, I have found that there are some aspects of developing software that are incredibly boring to me.<p>I don&#x27;t enjoy debugging. Often times I have spent hours&#x2F;days hunting bugs that turn out to be annoyances rather than learning opportunities. This period tends to be a drab and very unstimulating.<p>I also don&#x27;t find the act of interacting with a screen very intimate. I would much prefer pen and paper over a computer screen.<p>Software development also often becomes an exercise in cobbling together a bunch of APIs to achieve a business requirement. This feels like I am accomplishing something for my company but not really adding or discovering new knowledge.<p>During university, I enjoyed theoretical Computer Science courses (ex. Automatons, Number Theory etc.) a lot more than the practical ones (ex. Networks, DB etc.). If I were to do everything over again, I would prefer to go into academia rather than software engineering. At this point going to academia isn&#x27;t feasible as I never developed relationships with profs to get a Letter of recommendation. My people skills are pretty poor but it is what it is.<p>Learning software engineering patterns and practices doesn&#x27;t feel &quot;profound&quot;. Instead it just feels trivial.<p>I am confused how to resolve this conundrum. \nA radical way would be to stop software career, take up math or theoretical CS and go into that. But this has some drawbacks. I am nearly 30 and going back to university at this point isn&#x27;t ideal. Plus, the money in software engineering helps me to be independent and be a pillar of support for my family.<p>Another way I could resolve this conundrum would be to take up math&#x2F;theoretical CS as a hobby. However, I am not sure if I will be able to dedicate enough time to it. Software engineering jobs can get taxing. Add to that the burden of doing basic household chores, exercising etc. the time to dedicate to theoretical CS&#x2F;math may get limited. But still, this alternative seems a lot more &quot;practical&quot; than giving up everything in my career and making a complete pivot.<p>What are your thoughts on this HN community?",
      "time": 1657022778,
      "title": "Software development tends to get mundane",
      "type": "story"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31987185,
      "score": 1,
      "time": 1657022760,
      "title": "Steve Wozniak a.k.a. “The Woz” – WebSite",
      "type": "story",
      "url": "http://www.woz.org"
    },
    {
      "by": "loudtdarrow",
      "descendants": 0,
      "id": 31987171,
      "score": 1,
      "time": 1657022656,
      "title": "The fear that trashy media will rot your brain goes way back",
      "type": "story",
      "url": "https://psyche.co/ideas/the-fear-that-trashy-media-will-rot-your-brain-goes-way-back"
    },
    {
      "by": "throw0101a",
      "descendants": 0,
      "id": 31987167,
      "score": 1,
      "time": 1657022630,
      "title": "Technological Utopianism",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Technological_utopianism"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 31987137,
      "score": 1,
      "time": 1657022367,
      "title": "Boxport congestion spreads across the globe again",
      "type": "story",
      "url": "https://splash247.com/boxport-congestion-spreads-across-the-globe-again/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31987128,
      "score": 1,
      "time": 1657022299,
      "title": "Large Hadron Collider discovers three new exotic particles",
      "type": "story",
      "url": "https://home.cern/news/news/physics/lhcb-discovers-three-new-exotic-particles"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 31987124,
      "kids": [
        31987134
      ],
      "score": 1,
      "time": 1657022283,
      "title": "Replika's AI (YC15) says it works for the KGB",
      "type": "story",
      "url": "https://mezha.media/en/2022/07/05/san-francisco-startup-replika-s-artificial-intelligence-says-it-works-for-the-kgb-and-blames-ukrainian-government-for-buch-atrocities/"
    }
  ]
}