{
  "stories": [
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 31886168,
      "score": 1,
      "time": 1656266042,
      "title": "The Five-Paragraph Fetish",
      "type": "story",
      "url": "https://aeon.co/essays/writing-essays-by-formula-teaches-students-how-to-not-think"
    },
    {
      "by": "thewebcount",
      "descendants": 0,
      "id": 31886161,
      "score": 1,
      "text": "I have an HBOMax account that was previously associated with my Gmail account. I stopped using my Gmail account several years ago and thought I had switched all of my services over to the new account. Going through my password manager, I realized that because of the name change from HBO Go to HBOMax I missed it and had never switched over my HBO account.<p>So I logged in with my old info and changed my address to my new one. I suddenly started receiving emails about new shows that I have no interest in. The emails have no unsubscribe link in them. I went back to the site to turn off all emails, and it turns out you can&#x27;t turn off emails from HBOMax, only from their &quot;partners&quot; (which I have done). I further discovered that the account for that email isn&#x27;t actually how I get HBOMax. I get it through my cable provider. When I log in with my (formerly) Gmail account, it tells me I don&#x27;t have a subscription. So now I&#x27;d just like to delete the account since I don&#x27;t want emails from them and it&#x27;s not associated with my actual ability to watch their shows. Searching their FAQs, there appears to be no way to delete your account and no way to turn off emails from them.<p>I&#x27;ve found various &quot;How To Delete Your HBOMax Account&quot; articles online (all of them terrible) [0], but the links they say to click on don&#x27;t exist anywhere on the web site anymore (at least coming from Safari on my Mac). Furthermore, they talk about first cancelling your subscription, but as mentioned, this account doesn&#x27;t actually have a subscription, so I can&#x27;t even perform that step. They also mention emailing your username <i>and password</i> to the help email, but that sounds like a terrible idea. There&#x27;s a phone number to call, but I don&#x27;t want to have to deal with a &quot;retention specialist&quot;, though maybe the fact that I&#x27;m not currently subscribed through that email and am not canceling my other subscription would help?<p>Has anyone successfully canceled their HBOMax account, and if so, what did it take?<p>[0]https:&#x2F;&#x2F;donotpay.com&#x2F;learn&#x2F;how-to-delete-hbo-max-account&#x2F;",
      "time": 1656266014,
      "title": "Ask HN: How to Delete an HBOMax Account?",
      "type": "story"
    },
    {
      "by": "mrcslws",
      "descendants": 0,
      "id": 31886144,
      "score": 1,
      "time": 1656265888,
      "title": "Bayesian Optimization Is More Basis-Dependent Than You Might Think",
      "type": "story",
      "url": "https://probablymarcus.com/blocks/2022/06/26/gaussian-processes-basis-dependent.html"
    },
    {
      "by": "e-clinton",
      "descendants": 0,
      "id": 31886136,
      "score": 1,
      "text": "With Roe v. Wade being reversed, it had me wondering: if “life” begins at conception, shouldn’t we get a social security number and tax benefits at conception? Perhaps a passport be required for traveling abroad? Why should we differentiate between in and out of utero?<p>Hoping for a philosophical discussion, not a political one.",
      "time": 1656265857,
      "title": "More Rights for the Unborn?",
      "type": "story"
    },
    {
      "by": "mliezun",
      "descendants": 0,
      "id": 31886130,
      "score": 2,
      "time": 1656265823,
      "title": "“I've never heard anyone say that they loved Java” (2001)",
      "type": "story",
      "url": "http://paulgraham.com/javacover.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31886129,
      "score": 1,
      "time": 1656265822,
      "title": "Defaultable-map: An Applicative wrapper for Maps",
      "type": "story",
      "url": "https://www.haskellforall.com/2022/06/defaultable-map-applicative-wrapper-for.html"
    },
    {
      "by": "remflight",
      "descendants": 0,
      "id": 31886123,
      "score": 1,
      "text": "This post (https:&#x2F;&#x2F;old.reddit.com&#x2F;r&#x2F;wallstreetbets&#x2F;comments&#x2F;vkncj5&#x2F;would_you_rather_get_a_guaranteed_million_dollars&#x2F;) showed up on wallstreetbets and the more interesting question to me that came up was: how much is this opportunity worth? There must be a way to calculate how much someone would pay for a 50&#x2F;50 chance to win $1 billion, so I’m curious how that would be calculated and what that dollar amount is?",
      "time": 1656265797,
      "title": "Ask HN: How much would you pay for a 50/50 chance to win $1B?",
      "type": "story"
    },
    {
      "by": "crproxy",
      "descendants": 0,
      "id": 31886120,
      "score": 5,
      "text": "CRProxy is a new reverse web proxy service.<p>We have a generous free plan that includes the ability to use custom domains and semi-custom sub-domains. We have reasonably priced plans with good bandwidth and no additional usage charges.<p>Please give it a try and let me know what you think.<p>Thank you,<p>David",
      "time": 1656265789,
      "title": "Show HN: CRProxy is a simple and affordable ngrok alternative",
      "type": "story",
      "url": "https://crproxy.com"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31886116,
      "score": 1,
      "time": 1656265766,
      "title": "What Happens When You Get Scammed by an Influencer",
      "type": "story",
      "url": "https://www.vice.com/en/article/8xym9x/instagram-influencer-scams-flat-tummy-tea-fyre-fest"
    },
    {
      "by": "congoe",
      "descendants": 0,
      "id": 31886057,
      "score": 2,
      "time": 1656265402,
      "title": "Self-host your blog on a Raspberry Pi",
      "type": "story",
      "url": "https://blog.ban.app/self-hosting-ghost-with-docker-compose/"
    }
  ]
}