{
  "stories": [
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30677560,
      "score": 1,
      "time": 1647288531,
      "title": "Russia is trying to Install pro-Kremlin Officials into occupied-Cities",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_7094bf11b48adf42b7dcb6f4726f7760"
    },
    {
      "by": "Ajs1",
      "descendants": 1,
      "id": 30677556,
      "kids": [
        30677561
      ],
      "score": 1,
      "text": "https:&#x2F;&#x2F;www.zebrium.com&#x2F;blog&#x2F;how-cisco-uses-zebrium-ml-to-analyze-logs-for-root-cause<p>Disclosure: I’m one of the co-founders behind the ML mentioned here. However the results in the link above were generated independently by Cisco.<p>There have been a number of write-ups and papers evaluating ML for logs over the last few years – by academics, engineers, and observability vendors. But these results have typically been limited to synthetic data sets (lab generated), or very limited in scope (a handful of real world data sets).<p>The Automation and Innovation team at Cisco just published test results from a study applying ML to a large corpus of actual software incidents. The goal was to test the efficacy of the ML in picking out root cause indicators from logs that spanned the duration of the problems.<p>Each problem’s log data set was run through the Zebrium ML engine, AND was also independently root caused by an engineer with expertise in that software. To be counted as a success, the summary ML output had to contain the same log event(s) as those that were picked out by the engineer during the manual analysis. Further, each report had to be concise and clear enough that the evaluating engineer found it to be a net advantage (as compared with their familiar workflow of searching through logs).<p>The underlying software products were diverse in nature – Webex client (collaboration), DNA Center (networking), ISE (security), and UCS (infrastructure).<p>Each data set was a few GB in size (10s of millions of log events), spanned anywhere from a dozen to hundreds of log types (hence the challenge of correlating across logs), and typically contained a few days of logs. An engineer troubleshooting a software problem typically uses this history to understand the baseline of normal events, as well as spot any outlier events that might be clues to the root cause. The unsupervised ML was not pretrained – it used the same history to train on as was available in the log datasets.<p>Given the sensitivity of the data sets, the raw data is not published, but more details are expected in a follow up white paper. In any case, the results showed an accuracy rate of 95.8% for using ML for logs.",
      "time": 1647288518,
      "title": "ML for logs – results from a large scale, real world study",
      "type": "story"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 30677553,
      "score": 2,
      "time": 1647288507,
      "title": "WikiLeaks Founder Julian Assange Denied Permission To Appeal Extradition",
      "type": "story",
      "url": "https://news.slashdot.org/story/22/03/14/203232/wikileaks-founder-julian-assange-denied-permission-to-appeal-extradition"
    },
    {
      "by": "agronaut",
      "descendants": 0,
      "id": 30677537,
      "score": 2,
      "time": 1647288437,
      "title": "Vibe, Mood, Energy",
      "type": "story",
      "url": "https://www.thedriftmag.com/vibe-mood-energy/"
    },
    {
      "by": "jamespwilliams",
      "descendants": 0,
      "id": 30677535,
      "score": 3,
      "time": 1647288435,
      "title": "“Posting it to you is secure, as it's illegal to open someone else's mail.”",
      "type": "story",
      "url": "https://twitter.com/virginmedia/status/1162756227132198914"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30677518,
      "score": 1,
      "time": 1647288371,
      "title": "Musicasa Concerts Growth Assistant",
      "type": "story",
      "url": "https://www.linkedin.com/mwlite/jobs/view/2942393921"
    },
    {
      "by": "empressplay",
      "descendants": 0,
      "id": 30677515,
      "score": 1,
      "time": 1647288350,
      "title": "Listen to This Article: Orwell Was Right",
      "type": "story",
      "url": "https://taibbi.substack.com/p/listen-to-this-article-orwell-was"
    },
    {
      "by": "wcerfgba",
      "descendants": 0,
      "id": 30677483,
      "score": 1,
      "text": "Hi all,<p>I am just curious if anyone is using any lock-based approaches to version control for collaborative production of software or other digital assets. It seems like the merge model, exemplified by Git, is ubiquitous to the point that nobody is experimenting with any other workflows.<p>I think lock-based version control would would very well with trunk-based development. Separate devs branch from mainline, files get locked for everyone else as they are edited, and so it is necessary to work in very tight iterations and merge back to mainline very frequently.<p>Is anyone working with a lock-based approach to version control, either for personal projects, or in an organisational setting?<p>Thanks :)",
      "time": 1647288206,
      "title": "Ask HN: Is anyone using lock-based version control?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30677477,
      "score": 1,
      "time": 1647288187,
      "title": "DataSkop: Simulating the Dynamics of Recommender Systems",
      "type": "story",
      "url": "https://algorithmwatch.org/en/dataskop-simulator-plattformdynamiken/"
    },
    {
      "by": "lululouise",
      "descendants": 0,
      "id": 30677471,
      "score": 3,
      "text": "My Google account was hacked, I was messaged by someone on Facebook and they demanded I give them money or they would post my private photos. They started posting my pictures and even sent them to my family and friends, dad included! They then changed all my passwords, restore email, phone number ect to their own email and number, so I can&#x27;t do anything. They wiped my phone and my son&#x27;s tablet completely, all my banking is gone, everything is gone. I&#x27;m now stuck in a foreign country away from my baby with no way to get money or access my email for my travel documents. I&#x27;m really scared and don&#x27;t know what to do. Google says they can&#x27;t do anything to help me! They can&#x27;t kick him off or disable my account, I just have to be harassed and blackmailed, and goodness knows what else. I&#x27;m a single mum and I&#x27;m in a different country to my baby, please can someone help me? I just want to get back.<p>Does anyone know how I can recover and secure my Google account? I&#x27;ve tried everything that I can find&#x2F;Google have told me to do.",
      "time": 1647288156,
      "title": "Ask HN: My Google account was hacked, Google says they can't help",
      "type": "story"
    }
  ]
}