{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30948300,
      "score": 1,
      "time": 1649355289,
      "title": "“Kanye West Is Not Picasso” by Leonard Cohen (2018)",
      "type": "story",
      "url": "https://twitter.com/amandashires/status/1050328471673688064"
    },
    {
      "by": "hackerdad",
      "descendants": 0,
      "id": 30948293,
      "score": 1,
      "time": 1649355247,
      "title": "Show HN: Create Conductor Workflows Using Code",
      "type": "story",
      "url": "https://github.com/Netflix/conductor/tree/main/java-sdk"
    },
    {
      "by": "noahbradley",
      "descendants": 0,
      "id": 30948272,
      "score": 1,
      "time": 1649355145,
      "title": "How I Became an Artist",
      "type": "story",
      "url": "https://noahbradley.com/how-i-became-an-artist/"
    },
    {
      "by": "digital55",
      "descendants": 0,
      "id": 30948260,
      "score": 1,
      "time": 1649355094,
      "title": "Newly Measured Particle Seems Heavy Enough to Break Known Physics",
      "type": "story",
      "url": "https://www.quantamagazine.org/fermilab-says-particle-is-heavy-enough-to-break-the-standard-model-20220407/"
    },
    {
      "by": "bdon",
      "descendants": 0,
      "id": 30948255,
      "score": 1,
      "time": 1649355077,
      "title": "Mantle – Serverless Maps Using Lambda or Cloudflare Workers",
      "type": "story",
      "url": "https://protomaps.com/blog/serverless-self-hosted-maps/"
    },
    {
      "by": "matt_d",
      "descendants": 0,
      "id": 30948211,
      "score": 2,
      "time": 1649354900,
      "title": "A Flexible Type System for Fearless Concurrency",
      "type": "story",
      "url": "https://www.cs.cornell.edu/andru/papers/gallifrey-types/"
    },
    {
      "by": "trishakothari",
      "descendants": 0,
      "id": 30948205,
      "score": 2,
      "time": 1649354885,
      "title": "Romance Fraud: Love, Lies, and Billions Lost",
      "type": "story",
      "url": "https://www.unit21.ai/blog/romance-fraud?utm_source=sales&utm_medium=cpc&utm_campaign=romance_fraud&utm_id=unit.salesromance&utm_term=aml%2Bfraud"
    },
    {
      "by": "brightball",
      "descendants": 0,
      "id": 30948201,
      "score": 3,
      "text": "I&#x27;m asked this question as a dev of 20+ years who found SAFe when trying to solve a communication problem. I&#x27;m now a certified SPC, RTE who can teach all the classes and lead engagements.<p>But I keep seeing comments on here from people talking about threatening to quit their jobs if SAFe is implemented or actively looking because of it...and I want to know where it&#x27;s all going wrong?<p>Examples from today: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30944386<p>Please discuss here or feel free to reach out on Keybase (in my profile). I want to understand and potentially write about it to help fix it.<p>I got into this thanks to a lot of guidance from Hacker News. Posted a long rant (https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17154355) about the state of all things agile (largely scrum based) and one of the commenters pointed me to a great book by Donald Reinertson called 2nd Generation Lean Product Development. It&#x27;s not process heavy, but it is math and theory heavy. I loved it and absolutely advocate for it. When I got a chance to use it with my team it was working great, but I realized I was falling very short with communicating with the rest of the business so I started looking for a more formal process based around his work and that&#x27;s how I found SAFe.<p>I went deep on the material because I needed to know how to trim the fat on the processes involved, because it&#x27;s too much for less than 50 people and I&#x27;m happy with the results I&#x27;ve seen.<p>What SAFe <i>should</i> result in...<p>- Developers setting the development schedule based on business priorities rather than being handed arbitrary deadlines<p>- Far fewer meetings because you&#x27;re trading the 2-3 day PI Planning meeting for dozens of smaller ones over the next quarter<p>- 2 separate backlogs with a 70% &#x2F; 30% capacity planning split. One for Product priorities (70%) and one for dev&#x2F;ops&#x2F;arch priorities (30%) to ensure that technical people don&#x27;t have to work with non-technical people to prioritize system level things that they KNOW need to be done.<p>- Avoidance of last second priority changes due to the agreed upon priorities and plan for the upcoming quarter<p>- No over-scheduling because SAFe calls for planning based on 2&#x2F;3 capacity estimate per team per 2 week iteration and then leaves the final two weeks of the PI entirely unplanned as buffer or a 20% time reward for teams who did finish on schedule. The goal is &quot;maximum sustainable pace&quot; and it&#x27;s one of the reason that &quot;iteration&quot; is used in place of &quot;sprint&quot; because by definition, a &quot;sprint&quot; is not a sustainable pace.<p>- Better coordination between multiple teams because they have a time to plan it out that doesn&#x27;t derail short sighted 2 week &quot;sprint&quot; processes<p>All of these things (and more) can only happen if leadership is in board. If company or product leadership is unwilling to trust their developers to relinquish this type of control and try to maintain a grip on the process, none of it&#x27;s going to work.",
      "time": 1649354870,
      "title": "Ask HN: Why do you hate SAFe (Scaled Agile Framework)?",
      "type": "story"
    },
    {
      "by": "krelian",
      "descendants": 0,
      "id": 30948196,
      "score": 2,
      "time": 1649354847,
      "title": "High-precision measurement of the W boson mass with the CDF II detector",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/science.abk1781"
    },
    {
      "by": "yumindev",
      "descendants": 0,
      "id": 30948185,
      "score": 1,
      "text": "I know a data point for Google L3 is 250K TC, while levels.fyi shows 191K.<p>And I don&#x27;t think it&#x27;s an abnormal data point, although it&#x27;s just ONE data point.",
      "time": 1649354786,
      "title": "Tell HN: Levels.fyi Is Not Accurate",
      "type": "story"
    }
  ]
}