{
  "stories": [
    {
      "by": "jverrecchia",
      "descendants": 0,
      "id": 29603808,
      "score": 1,
      "time": 1639828402,
      "title": "In Case I Die",
      "type": "story",
      "url": "https://www.verekia.com/in-case-i-die"
    },
    {
      "by": "GDC7",
      "descendants": 0,
      "id": 29603806,
      "score": 1,
      "time": 1639828396,
      "title": "Luxury Sees Billions in Rolex, Hermes and Gucci NFTs",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2021-12-17/luxury-brands-from-rolex-to-gucci-see-billions-in-metaverse-avatar-nft-economy"
    },
    {
      "by": "v_london",
      "descendants": 0,
      "id": 29603805,
      "score": 1,
      "text": "What caused you to move? Did COVID restrictions or the ability to work remotely play a part? Did moving improve your quality of life?",
      "time": 1639828389,
      "title": "Ask HN: Have you moved since the pandemic started?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29603804,
      "score": 1,
      "time": 1639828367,
      "title": "Rocket Report: SpaceX plans a Falcon 9 flurry, Bill Gates buys into rockets",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/12/rocket-report-spacex-plans-a-falcon-9-flurry-bill-gates-buys-into-rockets/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29603794,
      "score": 1,
      "time": 1639828261,
      "title": "Electric vehicles ask a lot of their tires",
      "type": "story",
      "url": "https://arstechnica.com/cars/2021/12/why-electric-vehicle-tires-are-challenging-to-make/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29603793,
      "score": 1,
      "time": 1639828253,
      "title": "Vectors, Accelerate and poor performance on M1 Macs",
      "type": "story",
      "url": "https://eclecticlight.co/2021/12/18/explainer-vectors-accelerate-and-poor-performance-on-m1-macs/"
    },
    {
      "by": "veggiesync",
      "descendants": 0,
      "id": 29603788,
      "score": 1,
      "text": "Hi everybody,<p>My name is Qing and I’m currently looking to provide pro bono services as a remote Scrum Master or Agile Project Manager~<p>I come from the beautiful panda city of Chengdu, China (the home of the famous Kung Fu Pandas and indeed they are super duper adorable~). Although my background is in Education (non-tech and non-manufacturing), ever since hearing and learning about Agile, Lean, DevOps, SaaS and Value Stream Mapping&#x2F;Management a few months ago, I&#x27;ve been totally obsessed with these subjects (even running sprints for my personal life) and have been learning so much about them very quickly. My big dream is to one day become a top-notch practitioner and leader in these subjects, diving deep into Servant Leadership, Systems Thinking, Lean Delivery, Continuous Improvement and Real-Time Value Stream Management (particularly for DevOps). I believe that with determination, perseverance, strategic prioritization, smart goal setting and hard work every one of us can achieve almost anything that we set our mind to.<p>Currently I’m looking to provide pro bono services as a remote Scrum Master or Agile Project Manager, because after a few months of intense learning, I feel that I’m at a point now where I could grow more quickly by entering the real world and gaining hands on experiences as opposed to simply learning theories and obtaining certifications. Please don’t get me wrong, I do think certifications are incredibly valuable (I hold PSM I, PSM II, PSPO I, PSPO II, PSD I and SPS), however more and more I’m starting to realize that actual experiences are far more important and beneficial for people trying to enter the fast-evolving tech industry (or perhaps any industry that moves at a rapid, innovative pace), so my focus from here on is to seek opportunities that will challenge me to the core and force me to maximize my learning through trial by fire. I’m willing to work in any time zone that’s comfortable for your team, wear multiple hats if needed (especially if it’s a startup environment), and am an exceptionally fast learner, so if you happen to be looking for a remote Scrum Master or Agile Project Manager that can adapt to your changing circumstances and goals, I sincerely hope to have an opportunity to join your team.<p>My LinkedIn profile is at: https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;qing-wang-sync&#x2F;<p>Thank you so much everyone for taking the time out of your busy schedule to read this, and please stay safe and healthy during these challenging times..<p>Gratefully yours,<p>Qing",
      "time": 1639828224,
      "title": "I'm providing pro bono service as a remote Scrum Master or Agile Project Manager",
      "type": "story"
    },
    {
      "by": "_djo_",
      "descendants": 0,
      "id": 29603756,
      "score": 1,
      "time": 1639827714,
      "title": "Botswana Gets WHO Award for Mother-to-Child HIV Prevention Milestone",
      "type": "story",
      "url": "https://www.voanews.com/a/botswana-gets-who-award-for-mother-to-child-hiv-prevention-milestone-/6338300.html"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29603755,
      "score": 1,
      "time": 1639827707,
      "title": "10 Made-In-India Reactors To Help Triple Nuclear Power Capacity By 2031",
      "type": "story",
      "url": "https://www.ndtv.com/india-news/10-made-in-india-reactors-to-help-triple-nuclear-power-capacity-by-2031-centre-2657913"
    },
    {
      "by": "heyarviind2",
      "descendants": 0,
      "id": 29603743,
      "score": 2,
      "time": 1639827574,
      "title": "Show HN: Increase SaaS revenue by recovering expired checkouts",
      "type": "story",
      "url": "https://convertx.io"
    }
  ]
}