{
  "stories": [
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 30240759,
      "score": 2,
      "time": 1644211310,
      "title": "Ask HN: Best Alternatives to Gofundme?",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30240733,
      "score": 1,
      "time": 1644211050,
      "title": "Open Source Security Podcast: #309 – The bright future of open source security",
      "type": "story",
      "url": "https://opensourcesecurity.io/2022/02/06/episode-309-the-bright-future-of-open-source-secuirty/"
    },
    {
      "by": "Nic0",
      "descendants": 0,
      "id": 30240729,
      "score": 1,
      "time": 1644210995,
      "title": "Is Devop a Real Job or Not",
      "type": "story",
      "url": "https://nsirap.com/posts/051-is-devops-a-real-job-or-not/"
    },
    {
      "by": "mrintellectual",
      "descendants": 0,
      "id": 30240726,
      "score": 1,
      "time": 1644210960,
      "title": "Microsoft Fends Off 3.47 Tbps DDoS Attack on Azure Servers",
      "type": "story",
      "url": "https://www.tomshardware.com/news/microsoft-mitigates-record-ddos-azure-attack"
    },
    {
      "by": "quantdaddy",
      "descendants": 0,
      "id": 30240715,
      "score": 1,
      "text": "Hey guys, I&#x27;ve been working on a GraphQL library for typescript that enables building event driven architecture using GraphQL schema. It can be used to publish and consume events in a type safe way using any message broker (Kafka, .RabbitMQ, PubSub etc). I built this library to scratch my own itch when I was trying to building a type safe event driven communication between microservices: JSON schema and protobuf didn&#x27;t feel elegant and were too verbose so I thought why not GraphQL. You can read more in my blog post here: https:&#x2F;&#x2F;graphql-eventbus.vercel.app&#x2F;blog<p>Youtube Intro Video: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=XLbShOmkKk0<p>Github: https:&#x2F;&#x2F;github.com&#x2F;skk2142&#x2F;graphql-eventbus<p>Docs: https:&#x2F;&#x2F;graphql-eventbus.vercel.app&#x2F;<p>I&#x27;d love to get your feedback!",
      "time": 1644210837,
      "title": "GraphQL for Event Driven Architecture",
      "type": "story"
    },
    {
      "by": "flurly",
      "descendants": 0,
      "id": 30240706,
      "score": 1,
      "time": 1644210742,
      "title": "Chess.com – Play Chess Online",
      "type": "story",
      "url": "https://www.chess.com/login"
    },
    {
      "by": "intrepidsoldier",
      "descendants": 0,
      "id": 30240699,
      "score": 1,
      "time": 1644210697,
      "title": "Which cloud computing service is best for your needs?",
      "type": "story",
      "url": "https://ramansharma.substack.com/p/multiple-stops-on-the-cloud-compute-continuum-all-with-their-own-merits-6b921ed82f2"
    },
    {
      "by": "fallat",
      "descendants": 0,
      "id": 30240688,
      "score": 1,
      "time": 1644210589,
      "title": "Show HN: Tell your terminal to say something",
      "type": "story",
      "url": "https://github.com/lf94/say"
    },
    {
      "by": "princevegeta89",
      "descendants": 0,
      "id": 30240609,
      "score": 6,
      "text": "Hi all<p>Sorry for the sad post at this time of the day. I am a new father who has been getting very busy with family&#x2F;work time lately and depression seems to have gotten the better of me.<p>For some background, I have always had the entrepreneurial spirit in me and I knew that path was something I loved the most ever since I was a little kid. When I was in college I had a couple of websites I owned that paid well, and that sort of reinforced my sentiment towards building my own business. Now fast forward to this day, where I am 33 years old and have welcomed a baby 3 months ago into this world.<p>I can clearly see that I enjoy spending time with the little guy but again I feel I am choked because of lack of availability of time to do anything else. I work on a regular Software Engineering job at a big company and I can tell you that I don&#x27;t enjoy it a single bit. I have had a few side-projects recently and they haven&#x27;t really grown that much. I have a ton of other ideas written down that I want to execute, however I don&#x27;t have any more savings than a mere $500k and am not in a financially self-sustaining position now that I have more liabilities than ever. I think I lost the energy to hustle between a dayjob and a side-project as well; I am only able to walk down one of these two paths at a given time. I can imagine these things get really easier if I were single, which at times makes me have second thoughts about the way I&#x27;ve setup my life (getting married + having kids etc.)<p>I am exhausted with the thought of not being able to pursue a career path that I really love, and it feels like it may only get more difficult say, 10 years later where I might have a lot of money saved.<p>Honestly I don&#x27;t know what to do anymore; I wake up smiling at the little guy for the first few minutes and later in the day, the career side of the life kicks in as well. It almost makes me want to end my life. I wanted to see if anyone of you guys have been in similar situations and if I can get some insight into how to deal with the new phase of my life I am crawling through everyday.<p>Thanks a lot!",
      "time": 1644209888,
      "title": "Ask HN: Feeling Depressed and Choked. How to handle it?",
      "type": "story"
    },
    {
      "by": "ashvardanian",
      "descendants": 0,
      "id": 30240594,
      "score": 1,
      "time": 1644209673,
      "title": "Google Chrome gets a new logo after 8 years",
      "type": "story",
      "url": "https://www.timesnownews.com/technology-science/article/google-chrome-gets-new-logo-after-8-years/856401"
    }
  ]
}