{
  "stories": [
    {
      "by": "m1nz1",
      "descendants": 0,
      "id": 28896223,
      "score": 1,
      "text": "Hello everyone, I am in a bit of a pickle. I just graduated as a math major with some experience as a data scientist at a small startup. I have been trying to get work as a software engineer or data scientist, but I lack some experience and knowledge of the former and the latter seems to primarily be looking to hire masters&#x2F;phds.<p>It isn’t ideal to me, but this has me considering applying to get a masters in CS. I went to a good school, had a strong gpa, and will score well on the gre. The tricky thing is that I am likely about to be offered another job. The job is part of a consultancy and I would be given the title data engineer. Based on the client list, I am expecting that my work would mostly be migration to the cloud and dashboard building. That is not exactly where I want my career to go, but it would be really nice to make money and work for a real company. I’m trying to weigh taking this role against continuing to self-learn while applying to jobs and grad school.<p>Factors I’m considering about the job:\n- The company appears to be just starting its US operation. There are 900+ employees in UK.\n- There isn’t a very clear guarantee of where I will be staffed. It says New York or tristate area…\n- The training program is 4 months in another country while getting paid (great!) but if you leave sooner than 2 years you have to pay back a large percentage of the salary you received during training (very odd to me). \n- The training will likely be somewhat repetitive for me and I could&#x2F;am learning that stuff online for free already. \n- The pay is standard entry level consultant pay.<p>Factors I’m considering about grad school:\n- I haven’t actually gotten into one yet and I dont have strong research\n- I can only start next year at this point which would mean a year long gap on my resume unless I can get an internship or I take an unrelated job\n- I worry that I will exit my masters as unattractive to employers as I currently seem to be<p>I’m really struggling with this and would appreciate any guidance from more experienced people. My main concern is that I end up stuck in this job I don’t like that leads me away from the career I want and ultimately ends up with me going to masters anyway. Alternatively I’m worried that if I don’t take this and then fail to get into a masters program I am really done for. I came very close in an interview for a company I really want to work for and the recruiter said to try again in 6 months because I was so close and they all want me there, but just need a bit stronger technical skills. She said to focus on personal projects and take more classes if I can. Taking this other job sortve feels like closing the door on those kinds of opportunities for at least a few years to me.",
      "time": 1634476464,
      "title": "Ask HN: Take job adjacent to goals or go to get masters?",
      "type": "story"
    },
    {
      "by": "_quarks_",
      "descendants": 0,
      "id": 28896155,
      "score": 1,
      "time": 1634475811,
      "title": "Zephyr OS adds support for technology-agnostic soft-core RISC-V SoC",
      "type": "story",
      "url": "https://docs.zephyrproject.org/latest/boards/riscv/neorv32/doc/index.html"
    },
    {
      "by": "juokaz",
      "descendants": 0,
      "id": 28896138,
      "score": 1,
      "time": 1634475519,
      "title": "Netflix Estimates ‘Squid Game’ Will Be Worth Almost $900M",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-10-17/squid-game-season-2-series-worth-900-million-to-netflix-so-far"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28896062,
      "score": 14,
      "time": 1634474660,
      "title": "Tesla's Musk invited to a video call into Volkswagen executive conference",
      "type": "story",
      "url": "https://www.reuters.com/article/volkswagen-tesla-video-call-idUSKBN2H60CF"
    },
    {
      "by": "toraritte",
      "descendants": 0,
      "id": 28896049,
      "score": 1,
      "time": 1634474529,
      "title": "Computational Reproducibility with BioNix",
      "type": "story",
      "url": "https://academic.oup.com/gigascience/article/9/11/giaa121/5987272"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28896040,
      "score": 2,
      "time": 1634474449,
      "title": "Hybiscus: Create Templated PDFs with JSON API",
      "type": "story",
      "url": "https://hybiscus.dev/"
    },
    {
      "by": "di",
      "descendants": 1,
      "id": 28896008,
      "kids": [
        28896042
      ],
      "score": 1,
      "time": 1634474109,
      "title": "Moving and Building Container Images, the Right Way",
      "type": "story",
      "url": "https://github.com/imjasonh/ImJasonH/tree/main/articles/moving-and-building-images"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28896007,
      "score": 2,
      "time": 1634474090,
      "title": "Physicists take a key step in correcting quantum computer errors",
      "type": "story",
      "url": "https://www.science.org/content/article/physicists-take-key-step-correcting-quantum-computer-errors"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 28896001,
      "kids": [
        28896002
      ],
      "score": 1,
      "time": 1634474033,
      "title": "The Case for File Cabinets",
      "type": "story",
      "url": "https://www.nytimes.com/2021/10/16/opinion/filing-cabinet-internet.html"
    },
    {
      "by": "coldcode",
      "descendants": 2,
      "id": 28895993,
      "kids": [
        28896110
      ],
      "score": 12,
      "time": 1634473899,
      "title": "Facebook is researching AI systems that see, hear, remember everything you do",
      "type": "story",
      "url": "https://www.theverge.com/2021/10/14/22725894/facebook-augmented-reality-ar-glasses-ai-systems-ego4d-research"
    }
  ]
}