{
  "stories": [
    {
      "by": "loudtdarrow",
      "descendants": 0,
      "id": 31671800,
      "score": 1,
      "time": 1654712354,
      "title": "Modern Activism Is Too Trendy to Get Anything Done",
      "type": "story",
      "url": "https://www.welltechnically.news/p/modern-activism-too-trendy-to-work"
    },
    {
      "by": "ryandotsmith",
      "descendants": 0,
      "id": 31671771,
      "score": 2,
      "time": 1654712223,
      "title": "HTTP Client for PostgreSQL",
      "type": "story",
      "url": "https://github.com/pramsey/pgsql-http"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31671763,
      "score": 1,
      "time": 1654712176,
      "title": "The Browser Company",
      "type": "story",
      "url": "https://thebrowser.company/"
    },
    {
      "by": "mfilion",
      "descendants": 0,
      "id": 31671751,
      "score": 1,
      "time": 1654712141,
      "title": "Alyssa Rosenzweig: Conformant open source support for Mali-G57",
      "type": "story",
      "url": "https://www.collabora.com/news-and-blog/news-and-events/conformant-open-source-support-for-mali-g57.html"
    },
    {
      "by": "throwaway_job_t",
      "descendants": 0,
      "id": 31671714,
      "score": 2,
      "text": "My career so far looks like this:<p>- First 3 years I have worked on a SaaS app (on and off, but I managed to get some 1.5 years of more than full time to work on it), was unsuccessful and quit it. First project, looking back, awful code quality,  VanillaJS and really messy, it was 2015 though. Got to the point of shipping an early access though.<p>- Next 2 years I work as a contractor adding custom functionality to client&#x27;s websites by developing WordPress plugins<p>- Next 2 years, I keep the contracting but decrease the hours by a lot. Starting to work on a desktop app. Fixing all the mistakes I made over the then 5 years of unsupervised development (starting to use version control, writing tests where applicable, learning how to structure things better so things are more decoupled, learning how to comment properly) + learning modern web tech like React and Typescript.<p>This year, I realized that the desktop app is going to take more time. I was barely getting by with the contracting, living at my parents&#x27;. (I was taking very small, unprofitable projects, to average about 20h&#x2F;week - so I could have 40h&#x2F;week for my app). Now knowing that it will take more time, I can&#x27;t follow this strategy anymore, it&#x27;s clear that I need to get a well paid full time job, work it a bit (some 2 years) and then life off the savings to prepare for the launch.<p>I&#x27;d prefer to not go for a full time PHP &#x2F; WP dev job. I&#x27;d rather aim to do work as a front-end developer or a full-stack developer, for which there&#x27;s much more job offers + the salaries are higher (money is literally time here). Obviously if it does not work out, I would take a PHP job, but it&#x27;s last resort.<p>So I was wondering, is it realistic for me to expect that I could get a remote front-end or full stack JS job in the US (I live in Europe) with my resume?<p>I can&#x27;t really say that I have been working for 2 years on a desktop app and in the next 2 years I will quit the job to launch it, but maybe I could add that I was working on a desktop app under an NDA as part of the contracting. I&#x27;m also planning a 3 - 4 month break from contracting where I could spend 700h to develop a simple web app . If time allows, I also have 2 ideas for front-end libraries I could develop or at least release a beta version of.<p>So for a summary, my resume would look like this:<p>- The 700h side project I yet have to develop<p>- 5 years contracting, WP plugin development, web app development, desktop app development (won&#x27;t hide that it was mostly WP plugin development, maybe add that I spent about 2,000h on a desktop app under an NDA)<p>- 3 years working on a SaaS app<p>So basically, do I even have a shot? Or is it not worth even trying, I should save myself time developing the side project and instead look for a lower paid WP dev job?<p>On a side note, what salaries could be expected from a remote full stack US dev job? Is 120k - 150k TC realistic?<p>Long term it does not matter that much, if the desktop app fails as a business, I will open source it and get some 5,000h worth of code published on GitHub + at least some 4 years experience working on a startup, surely enough to gain enough velocity to escape planet WP. However, getting a lower paid job means a lot more personal life sacrifices in the short term (I already sacrificed the past 2 years).",
      "time": 1654711970,
      "title": "Ask HN: Transition from PHP WordPress development to full stack JavaScript",
      "type": "story"
    },
    {
      "by": "sturza",
      "descendants": 1,
      "id": 31671703,
      "kids": [
        31671789
      ],
      "score": 1,
      "time": 1654711904,
      "title": "New TikTok Advertising Policy",
      "type": "story",
      "url": "https://imgur.com/a/mDpT83h"
    },
    {
      "by": "tumidpandora",
      "descendants": 0,
      "id": 31671697,
      "score": 1,
      "time": 1654711880,
      "title": "Playstation 5 sales reach 20M worldwide",
      "type": "story",
      "url": "https://www.gamesindustry.biz/articles/2022-06-03-playstation-5-sales-reach-20-million-worldwide"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31671618,
      "score": 1,
      "time": 1654711588,
      "title": "Salesforce takes crypto plunge with new NFT cloud",
      "type": "story",
      "url": "https://techcrunch.com/2022/06/08/salesforce-takes-crypto-plunge-with-new-nft-cloud/"
    },
    {
      "by": "wrycoder",
      "descendants": 0,
      "id": 31671602,
      "score": 1,
      "time": 1654711526,
      "title": "Lisp: Building Abstractions with Procedures (SICP)",
      "type": "story",
      "url": "https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-9.html#%_chap_1"
    },
    {
      "by": "ddrmaxgt37",
      "descendants": 0,
      "id": 31671560,
      "score": 1,
      "time": 1654711401,
      "title": "Eight lessons from founding to Series C",
      "type": "story",
      "url": "https://www.arun.is/blog/lessons-learned-carrot/"
    }
  ]
}