{
  "stories": [
    {
      "by": "ddalex",
      "descendants": 0,
      "id": 29038144,
      "score": 1,
      "time": 1635514268,
      "title": "Zillow’s Zeal to Outbid for Homes Backfires in Flipping Fumble",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-10-26/zillow-s-zeal-to-outbid-for-homes-backfires-in-flipping-fumble"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 29038140,
      "score": 1,
      "time": 1635514236,
      "title": "Building an Emacs Lisp VM in Rust",
      "type": "story",
      "url": "https://coredumped.dev/2021/10/21/building-an-emacs-lisp-vm-in-rust/"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 29038116,
      "score": 4,
      "time": 1635514083,
      "title": "The Self-Isolation of the American Left",
      "type": "story",
      "url": "https://www.nytimes.com/2021/10/28/opinion/school-culture-wars.html"
    },
    {
      "by": "tiahura",
      "descendants": 0,
      "id": 29038107,
      "score": 1,
      "time": 1635514003,
      "title": "Comparative Basic and Clinical Pharmacology of Molnupiravir and Ivermectin [pdf]",
      "type": "story",
      "url": "https://austinpublishinggroup.com/pharmacology-therapeutics/fulltext/ajpt-v9-id1149.pdf"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 29038098,
      "score": 1,
      "time": 1635513956,
      "title": "Hacker Attacker: The Full-Time Job No One Prepares You For",
      "type": "story",
      "url": "https://www.worth.com/hacker-attacker-full-time-job-no-one-prepares-you-cybersecurity/"
    },
    {
      "by": "Etai",
      "descendants": 0,
      "id": 29038087,
      "score": 1,
      "text": "Hey HN, we’re Etai and Andrew, and together with our team, we’re building Secoda (<a href=\"https:&#x2F;&#x2F;www.secoda.co\" rel=\"nofollow\">https:&#x2F;&#x2F;www.secoda.co</a>). We do search (that actually works!) for your company data. Hence, the name of our company, Secoda, stands for &quot;Searchable Company Data&quot;.<p>As a company grows, so does its data. Tables, metrics, queries, and dashboards often become isolated and are difficult to find. Even with great practices, organizations still struggle to get value out of their data - up to 73% of all enterprise data goes unused. One of the big contributors to this problem is that organizations create data silos by not documenting and centralizing their data knowledge in a single place where every employee can access information about data.<p>Andrew and I experienced this problem first hand at the last company we worked at. Andrew led the Product team and I led the Operations team and found that it was extremely difficult to find, understand and use data without looping in someone on the data team to help. The problem was that we only had 1 employee on the data team who supported over 100 employees asking questions about how to find and use company data, which meant that it would take around 2 weeks to get an answer to any data request.<p>Other data management tools focus on listing all data resources, regardless of their relevance or accuracy - you generally just get a list of what&#x27;s available, but not in a form that&#x27;s very meaningful. We adopted some of these tools in our last jobs but found that they created an overwhelming index of too many tables, dashboards and queries that weren’t relevant to most employees. This meant that even after adopting a tool to solve the problem, most employees still couldn’t use them to find, understand and use data.<p>Our approach to solving this problem is to build Secoda as a tool that helps data teams curate metadata for less technical employees. Instead of listing every resource, data teams can use our tool to curate and document data for specific departments or roles. As a result, employees who are less familiar with data will not be overloaded by information that is irrelevant or too technical. Our goal is basically to be like Google search for in-company data. You enter what you need and you get back the relevant information. We integrate into databases, data warehouses, BI, and transformation tools and offer both an on-prem and cloud-hosted deployment.<p>Over the last six months, our team has been improving our product closely with our early adopters to build a better product. Today, we’re excited to share the launch of our self-service product with the HN community. You can now sign up to Secoda, connect your database or data warehouse and start using Secoda without a sales call. We offer a free 14-day trial (no credit card required). After the free trial, we charge per editor, per month. If you’d like, you can also take a look at this video of us setting up our Secoda workspace:<p><a href=\"https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;f41b317441554a36930b9cfe4c91a45f\" rel=\"nofollow\">https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;f41b317441554a36930b9cfe4c91a45f</a><p>We’d love to hear about your experiences with data discovery and any ideas&#x2F;feedback&#x2F;questions you might have about what we’re building. We&#x27;re also hiring for a number of roles, which you can find here: <a href=\"https:&#x2F;&#x2F;www.workatastartup.com&#x2F;companies&#x2F;secoda\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workatastartup.com&#x2F;companies&#x2F;secoda</a>",
      "time": 1635513888,
      "title": "Launch HN: Secoda (YC S21) – Searchable Company Data",
      "type": "story"
    },
    {
      "by": "aloe_falsa",
      "descendants": 0,
      "id": 29038085,
      "score": 1,
      "time": 1635513882,
      "title": "“The 64-Square Madhouse” by Fritz Leiber (Chess Sci-Fi, 1962)",
      "type": "story",
      "url": "https://www.gutenberg.org/cache/epub/61213/pg61213-images.html"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29038071,
      "score": 1,
      "time": 1635513790,
      "title": "A Government Practitioner’s Guide to Countering Online Foreign Covert Influence",
      "type": "story",
      "url": "https://www.lawfareblog.com/government-practitioners-guide-countering-online-foreign-covert-influence"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 29038068,
      "score": 1,
      "time": 1635513783,
      "title": "Learning Graph Cellular Automata",
      "type": "story",
      "url": "https://twitter.com/riceasphait/status/1453731163592290306"
    },
    {
      "by": "chkas",
      "descendants": 0,
      "id": 29038061,
      "score": 1,
      "time": 1635513737,
      "title": "Show HN: Programming is fun",
      "type": "story",
      "url": "https://easylang.online/apps/progfun.html"
    }
  ]
}