{
  "stories": [
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 30542128,
      "score": 1,
      "time": 1646320751,
      "title": "Former Xamarin co-founder to leave Microsoft after six years",
      "type": "story",
      "url": "https://www.windowscentral.com/former-xamarin-co-founder-leave-microsoft-after-six-years"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30542120,
      "score": 1,
      "time": 1646320715,
      "title": "Airline software giant ends pact with Aeroflot, crippling ability to sell seats",
      "type": "story",
      "url": "https://www.cnbc.com/2022/03/03/airline-software-giant-sabre-ends-service-with-russias-aeroflot-crippling-carriers-ability-to-sell-seats.html"
    },
    {
      "by": "neverminder",
      "descendants": 0,
      "id": 30542119,
      "score": 1,
      "time": 1646320708,
      "title": "Why China Will Reclaim Siberia",
      "type": "story",
      "url": "https://www.nytimes.com/roomfordebate/2014/07/03/where-do-borders-need-to-be-redrawn/why-china-will-reclaim-siberia"
    },
    {
      "by": "synchton",
      "descendants": 0,
      "id": 30542104,
      "score": 1,
      "time": 1646320650,
      "title": "GitHub Finally releases (Beta) Tree view for changed files in a pull request",
      "type": "story",
      "url": "https://github.com/github/roadmap/issues/348"
    },
    {
      "by": "obilgic",
      "descendants": 0,
      "id": 30542096,
      "score": 1,
      "time": 1646320602,
      "title": "Fitbit recalls Ionic smartwatch after 78 reports of burns",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/2/22957989/fitbit-ionic-recall-burns-smartwatch-fitness-tracker-refund"
    },
    {
      "by": "telotortium",
      "descendants": 1,
      "id": 30542063,
      "kids": [
        30542116
      ],
      "score": 1,
      "text": "I got this email from him. Ordinarily I wouldn&#x27;t post this here, but maybe someone will see it and take action.<p>Subject: 4 independent sources I have say that the Russian border shuts down in &lt;48, probably less than 24 hours. If you are in Russia and you can leave, leave now.\nDate: 2022-03-02 9:09 UTC<p>Kamil Galeev was the first source 2 days ago, confirmed by 3 more (private) sources since then. Kamil:<p>Для россиян - очень скоро выезд перекроют. Сначала для мужчин сколько-нибудь призывных возрастов, потом для всех<p>Рассмотрите возможность вотпрямщас выехать в любую открытую страну (кроме Беларуси). Грузия, Армения, Азербайджан, Казахстан, Монголия и далее по списку. Сейчас такая возможность еще есть, но ее перекроют быстро и без предупреждения<p>Если вы хотите или считаете своим долгом оставаться в РФ, это ваш выбор. Но если жить в этом вы не желаете, валить надо немедленно, лучше сегодня<p>Положение РФ гораздо хуже чем в Холодную войну. Полный ад может наступить внезапно и без предупреждения. Что касается экономического коллапса, так он гарантирован. На это могу поставить достаточно уверенно, потому что паровой каток санкций уже поехал. Западные госаппараты более механистичны, а потому большей степени подвержены институциональной инерции чем российский. Их трудно сдвинуть с места, но как сдвинули, так они едут-едут-едут и так еще очень долго. Потому что их не только запустить, но и остановить трудно, не существует человека который мог бы отдать такой приказ<p>Если хотите уехать, уезжайте немедленно, чем быстрее тем лучше, в любую открытую страну кроме Беларуси. Долго прицениваться какая лучше смысла нет, главное пересечь границу, а там видно будет. Казахстан и прочие вряд ли будут перекрывать выезд, а РФ будет. Если пока не определились куда и что делать дальше можно в Стамбул - это крупнейший хаб и оттуда летают почти во все страны<p>Как пересечете можно думать над дальнейшими действиями. Они понятно зависят от ваших финансов, умений, нетворка и множества сопутствующих обстоятельств<p>Это рекомендация которую я могу дать всем кто думает об отъезде. Что касается более конкретных соображений, я пока не готов выкладывать их в открытый доступ (подписчики могут посмотреть здесь (https:&#x2F;&#x2F;www.patreon.com&#x2F;posts&#x2F;63248958)). Но в отличие от всех остальных запейволенных текстов, этот я открою как только сочту возможным<p>Для тех кто хочет уехать но не знает ситуацию на местах - вот список русскоязычных телеграм чатов по 105 странам мира. Можно почитать и если что непонятно уточнить детали у тех кто уже там https:&#x2F;&#x2F;telegra.ph&#x2F;chat360-10-14",
      "time": 1646320446,
      "title": "Alexey Guzey: Russian border shuts down in",
      "type": "story"
    },
    {
      "by": "codetrotter",
      "descendants": 0,
      "id": 30542042,
      "score": 1,
      "time": 1646320361,
      "title": "Lock Picking: An Inside Perspective",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=T_sy3dLwHkc"
    },
    {
      "by": "artistminute",
      "descendants": 0,
      "id": 30542015,
      "score": 1,
      "time": 1646320239,
      "title": "Reviewing Flippa Website for Sale (Smallhousedecor.com)",
      "type": "story",
      "url": "https://reviewley.com/review1-smallhousedecor-com-blog-about-decorating-tiny-houses/"
    },
    {
      "by": "ludovicianul",
      "descendants": 0,
      "id": 30542007,
      "score": 1,
      "text": "What do you recommend as best way to keep savings in order to prevent economic crashes that might arise after the consequences of Rusia&#x27;s invasion of Ukraine. \nIs it something like using e-money&#x2F;digital banking apps like Wise, Revolut, etc. enough? (keep money in different currencies which translates in accounts within different banks within different regions?)",
      "time": 1646320197,
      "title": "Ask HN: Best Way to Keep Savings",
      "type": "story"
    },
    {
      "by": "meistro",
      "descendants": 0,
      "id": 30542006,
      "score": 1,
      "time": 1646320188,
      "title": "There's No Reason to Write OpenAPI by Hand",
      "type": "story",
      "url": "https://apisyouwonthate.com/blog/theres-no-reason-to-write-openapi-by-hand"
    }
  ]
}