{
  "stories": [
    {
      "by": "Trasmatta",
      "descendants": 0,
      "id": 31043717,
      "score": 1,
      "text": "I&#x27;m 10 years into my career, and I&#x27;m very tired of team based software development. I still enjoy programming but I&#x27;ve come to dread almost everything surrounding it.<p>My work &#x2F; life balance is decent, I work for a pretty good company on a cool product, and my co-workers are good people. I have suffered from mild to moderate depression most of my life, but I&#x27;m doing my best to take care of the basics there, and I&#x27;m seeing a therapist. I&#x27;m beginning to see some of the classic signs of burnout, but I don&#x27;t think this is strictly a burnout question.<p>I work well on teams, my teammates like me, but I&#x27;ve always preferred solo work. I think this is a stable personality trait, as I remember feeling like this as early as kindergarten. Other factors include the already incredibly complex social problems that come from developing software with a team of humans, the monster that Agile &#x2F; Scrum have become, bizarre and poorly thought out technical decisions, failed projects, endless meetings, and being told what to do by people who have never written any code.<p>Anywhere, here are some of the possible ideas I&#x27;ve come up with, and my thoughts on them.<p><i>Make the most of what I already have</i> - I&#x27;m fully willing to admit that I may be in the best possible scenario already. The Hedonic Treadmill is real, and the grass is often not greener. I might just need to reframe how I think about it.<p><i>Find the perfect team</i> - Maybe if I job hop enough, I&#x27;ll land on the perfect team that actually fits my work style.<p><i>Consulting &#x2F; freelance</i> - I&#x27;m not sure if this is any better, because you have the constant pressure of needing to find and work with clients. There&#x27;s something to be said for having the freedom to only take on the projects that interest you (or pay the best), and to not be shackled to them forever. The freelancers I&#x27;ve talked with all seem to agree that your happiness in this path is largely contingent on your ability to find good clients.<p><i>Solo Founder &#x2F; Indie Hacker</i> - It sounds like a dream to have a small product that you build entirely yourself, that makes $100k-$200k&#x2F;year. There&#x27;s a lot of cool stories in that space, but I&#x27;ve also read a lot of stories of people working tirelessly for years on a project that never makes over $1k MRR. The thought of putting that much work into building something while also working full time just feels like too much to me.<p>One idea is to combine freelancing with being a solo founder: do enough freelancing to cover living expenses, then use the rest of the time to build your own things (with the hope to sell them).<p><i>Optimize for salary, and FIRE as quickly as possible</i> - I could just grind to get a job with the highest total compensation possible, work it for enough years to be able to FIRE, and then just code on my own terms. It mentally exhausts me just to think about doing this, though. I don&#x27;t want to go through the interview hazing followed by months of learning a company&#x27;s internal politics.<p><i>Get out of writing software as a career entirely, do it as a hobby only</i> - Maybe, but at the moment I don&#x27;t have anything else that I&#x27;m either skilled enough at to get a job for now, or interested enough to put the work into. But it&#x27;s something I can keep in the back of my mind.<p>--<p>The &quot;freelancing part time while working on my own product(s)&quot; seems like an interesting path to pursue. I&#x27;m being cautious though, and I don&#x27;t plan to make any big changes for 1 or 2 more years at least. I may find that I&#x27;m already in the best possible spot, and that this is just the Hedonic Treadmill at work.<p>Has anyone else here been going through a similar thought process? Or decided to take one of these paths (or another I haven&#x27;t thought of) already for similar reasons?",
      "time": 1650046802,
      "title": "Ask HN: Career paths when you've been disillusioned by the software dev process?",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31043701,
      "score": 1,
      "time": 1650046761,
      "title": "Quantum memristor: A memory-dependent computational unit",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/04/quantum-memristor-a-memory-dependent-computational-unit/"
    },
    {
      "by": "afkqs",
      "descendants": 0,
      "id": 31043695,
      "score": 1,
      "time": 1650046739,
      "title": "Wwwwwwwww.jodi.org",
      "type": "story",
      "url": "https://wwwwwwwww.jodi.org"
    },
    {
      "by": "sizzle",
      "descendants": 0,
      "id": 31043679,
      "score": 1,
      "time": 1650046663,
      "title": "Better Clouds Than Ever with New Exascale Computing-Ready Atmosphere Model",
      "type": "story",
      "url": "https://www.energy.gov/science/ber/articles/better-clouds-ever-new-exascale-computing-ready-atmosphere-model"
    },
    {
      "by": "systemvoltage",
      "descendants": 0,
      "id": 31043677,
      "score": 1,
      "time": 1650046652,
      "title": "Anger over Covid Lockdowns Mounts in Shanghai",
      "type": "story",
      "url": "https://www.wsj.com/articles/anger-over-covid-lockdowns-mounts-in-shanghai-11650039314"
    },
    {
      "by": "toricalea",
      "descendants": 0,
      "id": 31043676,
      "score": 1,
      "time": 1650046647,
      "title": "Honeypots to Honeybombs: Counter Attack as a Service",
      "type": "story",
      "url": "https://stakedy.com/long/honeypots-and-honeybombs-counter-attack-as-a-service.html"
    },
    {
      "by": "_cart",
      "descendants": 0,
      "id": 31043668,
      "score": 3,
      "time": 1650046595,
      "title": "Bevy 0.7: data oriented game engine built in Rust",
      "type": "story",
      "url": "https://bevyengine.org/news/bevy-0-7/"
    },
    {
      "by": "zepolud",
      "descendants": 0,
      "id": 31043662,
      "score": 1,
      "time": 1650046577,
      "title": "1111101000 Robots",
      "type": "story",
      "url": "https://archive.org/details/1111101000-robots"
    },
    {
      "by": "sizzle",
      "descendants": 0,
      "id": 31043661,
      "score": 1,
      "time": 1650046575,
      "title": "AI is explaining itself to humans. And it's paying off",
      "type": "story",
      "url": "https://www.reuters.com/technology/ai-is-explaining-itself-humans-its-paying-off-2022-04-06/"
    },
    {
      "by": "some_random",
      "descendants": 0,
      "id": 31043656,
      "score": 1,
      "time": 1650046569,
      "title": "Poisoned Candy Myths",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Poisoned_candy_myths"
    }
  ]
}