{
  "stories": [
    {
      "by": "muti",
      "descendants": 0,
      "id": 31890304,
      "score": 1,
      "time": 1656300727,
      "title": "Building a 34 Key Keyboard Layout",
      "type": "story",
      "url": "https://ryan.himmelwright.net/post/building-34-key-layout/"
    },
    {
      "by": "muti",
      "descendants": 0,
      "id": 31890294,
      "score": 1,
      "time": 1656300574,
      "title": "Miryoku – an ergonomic, minimal, orthogonal, and universal keyboard layout",
      "type": "story",
      "url": "https://github.com/manna-harbour/miryoku/tree/master/docs/reference"
    },
    {
      "by": "wallacrw",
      "descendants": 0,
      "id": 31890206,
      "score": 1,
      "text": "Doesn&#x27;t it seem fairly possible for a large company, or a DAO for that matter, to establish a foothold in a small town somewhere in a small state and create massive incentives for hipster coastals to move there?<p>Think of Marfa, TX, or Los Alamos, CA, or to take an older one, Yountville, CA.<p>It seems both potentially HUGELY profitable and politically meaningful to make it palatable for young coastal workers to congregate in a small town and revitalize it with urban tastes.<p>Things going for this strategy:<p>1. Work from anywhere policies not likely going anywhere.<p>2. Young families likely want more space, and many of these rural states have it in spades. What&#x27;s lacking is schooling, housing and entertainment, and much of this could likely be developed.<p>3. Small, rural towns have cheap real estate because of lack of opportunity. AL and WV are dirt cheap compared to the coasts, but if you’re honest with yourself, you probably haven’t bought there because there’s nothing enticing about it. No jobs, nowhere great to eat, nothing really to do. The land itself could be gorgeous, magestic even -- there&#x27;s very little difference between the landscape in Hudson Valley and the landscape in Appalachia. You just don&#x27;t want to be the first or only coastal elite to settle there (neither do I, and I grew up in rural GA).<p>4. Creatives love to congregate. If you could seed the town with hipster chefs, maybe a graphic designer-focused coworking facility, etc, then you&#x27;d have a good start. I’m thinking of how Richard Branson had that mansion in the English countryside where musicians preferred to record because they could spread out. Or how Francis Mallman has his isolated island where young, ambitious chefs apprentice under him to learn hyper-local cooking. If you had that initial draw, you could entice more builders who create restaurants, coffee houses, galleries and music venues. Money follows hipsters. Folks from places like LA, SF, NYC would LOVE the idea of spreading out. My guess is they&#x27;d swarm the open houses if you show them modern pre-fabs on 1+ acres with total privacy and a Blue Bottle and 10&#x2F;10 preschool down the street for under $1000&#x2F;sf.<p>5. First movers would stand to profit the most here. But you&#x27;d need a lot of capital and sufficient influence to bring a lot of people with you. If you had those, you could literally buy a few hundred acres around a town and then start to parcel it out to folks as they arrive. Massive profit incentive. I’m oversimplifying just about everything here, but this does seem like a good fit for a DAO…<p>My personal read, as an LA resident, is that a lot of young families would LOVE for this to happen. Leaving politics aside, what keeps most people I know from moving to, say, Montana is &quot;what kind of schools are there&quot; and “won’t we get bored after a few months?”<p>People live in cities for other people, for the entertainment, the restaurants, the vibe. But a lot of that can be developed. And some small towns have it despite not being big. Austin in the 90s, for example.<p>And, again, leaving the politics aside, this seems like a win-win — small towns don’t want to be left behind, but there also don’t seem to be a lot of developers stepping in and trying to give them a shot at the modern economy.<p>I would love to know who is doing this in small town America. Not just rebuilding or developing a slightly-less-shitty strip mall, but doing it with a deliberate strategy of making the town the next “it” destination for young families in America.",
      "time": 1656299477,
      "title": "Ask HN: Who is coordinating a plan to make small towns hipster?",
      "type": "story"
    },
    {
      "by": "herbertl",
      "descendants": 0,
      "id": 31890179,
      "score": 1,
      "time": 1656299142,
      "title": "A peek into our template creation process",
      "type": "story",
      "url": "https://pitch.com/blog/designing-presentation-templates"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31890175,
      "score": 2,
      "time": 1656299089,
      "title": "Entry-level M2 MacBook Pro has a slower SSD than M1 model",
      "type": "story",
      "url": "https://9to5mac.com/2022/06/26/m2-macbook-pro-slower-ssd/"
    },
    {
      "by": "lioeters",
      "descendants": 0,
      "id": 31890172,
      "score": 1,
      "time": 1656299048,
      "title": "Negentropy could help your life run smoother",
      "type": "story",
      "url": "https://phys.org/news/2021-03-concept-physics-negentropy-life-smoother.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31890148,
      "score": 1,
      "time": 1656298785,
      "title": "Event Related Potential measures of self-regulation do not predict goal pursuit",
      "type": "story",
      "url": "https://www.nature.com/articles/s41467-022-30786-7"
    },
    {
      "by": "AleksaGAVRIC",
      "descendants": 3,
      "id": 31890133,
      "kids": [
        31890134,
        31890153
      ],
      "score": 2,
      "time": 1656298663,
      "title": "I'm lazy so I built a rain notifier instead of checking for rain",
      "type": "story",
      "url": "https://ahra.in"
    },
    {
      "by": "hodgesrm",
      "descendants": 0,
      "id": 31890111,
      "score": 1,
      "time": 1656298402,
      "title": "Yann LeCun has a bold new vision for the future of AI",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/06/24/1054817/yann-lecun-bold-new-vision-future-ai-deep-learning-meta/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 31890106,
      "score": 1,
      "time": 1656298343,
      "title": "Britain’s National Culture Collections",
      "type": "story",
      "url": "https://www.economist.com/britain/2022/06/23/inside-britains-national-culture-collections"
    }
  ]
}