{
  "stories": [
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 28717695,
      "score": 1,
      "time": 1633091991,
      "title": "China's Geely to set up 5k battery swapping stations by 2025",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/chinas-geely-set-up-5000-battery-swapping-stations-by-2025-2021-09-26/"
    },
    {
      "by": "lando2319",
      "descendants": 0,
      "id": 28717693,
      "score": 1,
      "time": 1633091983,
      "title": "Bay Area elected officials battle health officers on Covid mask mandates",
      "type": "story",
      "url": "https://www.sfgate.com/bay-area-politics/article/Bay-Area-mask-mandate-COVID-delta-indoors-when-now-16491615.php"
    },
    {
      "by": "durmonski",
      "descendants": 0,
      "id": 28717683,
      "score": 1,
      "time": 1633091868,
      "title": "How I Finally Made Sense of Todoist’s Priority Levels",
      "type": "story",
      "url": "https://hulry.com/todoist-priority-levels-moscow/"
    },
    {
      "by": "haho4",
      "descendants": 0,
      "id": 28717646,
      "score": 1,
      "text": "I recently got laid off and I&#x27;ve been interviewing for dev positions for the past month.<p>I&#x27;m a developer with 12+ years of experience, working across multiple languages and a variety of technologies throughout my career.<p>I&#x27;ve not had to formally interview in a very long time, so now it&#x27;s shell shock for me.<p>It&#x27;s literally insane what these interviews are.<p>I feel like I&#x27;m taking a test, but I have no idea what the subject is.<p>One interviewer asked me leetcode questions. But he didn&#x27;t care about the thought process, he just wanted me to code the optimal solution as quickly as possible. When I got stuck for a minute, and I was trying to think it through, he just told me to code it. I don&#x27;t understand why I would want to work with someone like this?<p>Another interview, I went in thinking it would be leetcode questions, but the interviewer proceeded to ask me questions specifically pertaining to the language. He started asking me questions on syntax, how do I filter or group data sets using the language, how would I create threads, etc. Of course, he also wanted this all on Notepad. I was taken aback, as all of my focus was on studying algorithms.<p>On and on. There is no set format, I&#x27;m not told beforehand what I&#x27;d be asked about.<p>I&#x27;ve asked the recruiters what I&#x27;d be asked beforehand, and obviously not so helpful on that end.<p>How does one handle the variety of questions that you could possibly be expected to answer? I&#x27;m at the point where I just want to go do something else with my life.",
      "time": 1633091620,
      "title": "Dev Interviews",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28717597,
      "score": 2,
      "time": 1633091395,
      "title": "FAA reviewing Blue Origin safety allegations",
      "type": "story",
      "url": "https://spacenews.com/faa-reviewing-blue-origin-safety-allegations/"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 28717595,
      "kids": [
        28717611
      ],
      "score": 2,
      "time": 1633091383,
      "title": "‘Mandates Are Working’: Employer Ultimatums Lift Vaccination Rates, So Far",
      "type": "story",
      "url": "https://www.nytimes.com/2021/09/30/us/california-vaccine-mandate-health-care.html"
    },
    {
      "by": "itistricky",
      "descendants": 0,
      "id": 28717594,
      "score": 1,
      "text": "So, I&#x27;m job hunting and I bumped into next task:<p>[system description - you need about 2 mins just reading through it]<p>1. Implement a new SDK method [method description]. \n   A sort of graph search with limitations regarding scalability and space. Not trivial.<p>2. Write 1 simple unit-test and 1 simple happy-path integration test for the method above<p>3. Write a small technical design doc to formulate the technical problem and \n   document your approach to solving it. Discuss the estimated scale of the problem,\n   and propose an architecture for handling networks of such magnitude. Prove your hypothesis \n   with running time and memory complexity analysis of the average and worst cases.\n   How big do you think one&#x27;s network can be in the absolute worst case? Discuss \n   how you plan to engineer the SDK for testability.<p>[Another paragraph of hints&#x2F;tips&#x2F;dos&#x2F;dont&#x27;s that you need at best 5 mins to get through]<p>[And the punchline]<p>This is a small task (20-45 min)<p>-------<p>This is a small startup in Berlin. No huge salary. The best perk being remote working (which TBH post-covid is a given with most IT jobs).<p>I consider myself a fairly smart and competent dev but there&#x27;s no way this task would take me under 2 hours. So, what exactly is happening with recruiting these days? I mean, there are devs that can understand and pull this off in 20 mins but for the life of me I cannot understand why such devs would opt to work for a no-name start up and not go straight to a FAANG. What am I missing here?",
      "time": 1633091377,
      "title": "Is this typical of how start ups hire these days?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28717572,
      "score": 1,
      "time": 1633091292,
      "title": "Silicon’s 300% Surge Throws Another Price Shock at the World",
      "type": "story",
      "url": "https://finance.yahoo.com/news/silicon-300-surge-throws-another-032657665.html"
    },
    {
      "by": "GearRatio",
      "descendants": 0,
      "id": 28717567,
      "score": 1,
      "time": 1633091256,
      "title": "On Unbeatable Video Games: The Meaningless Challenges That Matter",
      "type": "story",
      "url": "https://residentcontrarian.substack.com/p/on-unbeatable-video-games"
    },
    {
      "by": "Decabytes",
      "descendants": 0,
      "id": 28717552,
      "score": 3,
      "time": 1633091156,
      "title": "The Emacs-28 release branch has been created",
      "type": "story",
      "url": "https://mail.gnu.org/archive/html/emacs-devel/2021-09/msg02290.html"
    }
  ]
}