{
  "stories": [
    {
      "by": "Schroedingers2c",
      "descendants": 0,
      "id": 31319085,
      "score": 1,
      "time": 1652126963,
      "title": "Burnout: The truth about overwork and what we can do about it",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Q98aCklzCBE"
    },
    {
      "by": "binarynate",
      "descendants": 0,
      "id": 31319083,
      "score": 1,
      "time": 1652126956,
      "title": "Inadvertent NFT creator is suddenly thrust into the world of NFT pump and dumps",
      "type": "story",
      "url": "https://www.thisamericanlife.org/769/the-reluctant-explorer"
    },
    {
      "by": "shubhamjain",
      "descendants": 0,
      "id": 31319073,
      "score": 1,
      "time": 1652126861,
      "title": "The Movie Man",
      "type": "story",
      "url": "https://shubhamjain.co/2021/11/11/movie-man"
    },
    {
      "by": "firstSpeaker",
      "descendants": 0,
      "id": 31319067,
      "score": 1,
      "time": 1652126846,
      "title": "Amazon fired two workers who helped organize its first union",
      "type": "story",
      "url": "https://www.engadget.com/amazon-labor-union-workers-fired-jfk8-182140546.html"
    },
    {
      "by": "helionsantos",
      "descendants": 0,
      "id": 31319037,
      "score": 1,
      "text": "Hi!<p>I am an 25 years old male, EU citizen  (Italian) born in Brazil. I am looking forward to study computer science somewhere in Europe. \nSo far I have started to study in Ireland, but I didn&#x27;t like the course for a few reasons. One of them was that the course was Computing Science instead of Computer Science. The only other university where my circumstances would allow me to study have a course in Information Technology (which is still not what I am looking for). \nWhile looking for somewhere to study, I stumbled Vrije Universiteit (by the way, seems to be a really good college), but it is full time (although I could apply for student finance, it seems that finding a part time job for students is not an easy task). To be honest, this is the one I am aiming for in the moment, but I still want to check other options.<p>I don&#x27;t want to sound choosy or anything, but I do have a few &quot;requirements&quot; regarding my studies:<p>A) It has to be Computer Science, not Computing Science or Information Technology or other overlapping course. The reason for this is that I am looking for a course that will give me good theoretical background, given that I am looking forward to work developing for embedded devices, Operating Systems, or work for trading firms.<p>B) The course is taught mainly using a low level programming language (C, C++, Rust). I understand that most courses will teach different languages, that is positive and I am happy with it, but I believe that these are better languages, specially for a course, given that they have fewer abstractions and are used in the field of work I am planning to work. The course I was studying was mostly Java (except the web development subjects). It seems rather difficult (if not impossible) to implement an OS or a low latency system in Java. \nC) It is affordable for the common folk, that is, a folk with a unskilled job, with no financial support from his family (but is single, healthy and ready for work) and no appropriate savings.\nD) It is in English or Portuguese (I do speak Spanish and Italian as well, the latter one not fluently and the first I don&#x27;t believe I have a level good enough for academic studies).<p>One thing I would like to mention is that I already know how to code (in C++), but it has been a little bit difficult to find a job given as I lack a degree. With or without a job or degree, I keep working on improving my skills as much as I can, through self learning (mainly using books).\nWith that in mind, what are my options?\nI am also open to suggestion regarding career choice. I kinda have a firm grip on what kind of things I want to work on, given that I am looking more for career satisfaction than money, but if is there any route that leads me there that I am not aware of, or given the supplied information, another career path that could bring equal career satisfaction, please, tell me!<p>I really appreciate if you have made this far and I am looking forward to hear your suggestions. \nThank you very much.",
      "time": 1652126703,
      "title": "Ask HN: Where to study Computer Science in Europe with a few constraints",
      "type": "story"
    },
    {
      "by": "carlycue",
      "descendants": 0,
      "id": 31318995,
      "score": 1,
      "time": 1652126454,
      "title": "Apple is a force in AR. It’s also been holding the technology back",
      "type": "story",
      "url": "https://www.protocol.com/entertainment/apple-webxr-ar-ios-iphone"
    },
    {
      "by": "l_eskenazi",
      "descendants": 0,
      "id": 31318992,
      "score": 2,
      "time": 1652126445,
      "title": "Join this open source project and fight climate change",
      "type": "story",
      "url": "https://boavizta.org/en/blog/boavizta-api-automated-evaluation-of-ict-impacts-on-the-environment"
    },
    {
      "by": "jjgreen",
      "descendants": 0,
      "id": 31318991,
      "score": 1,
      "time": 1652126442,
      "title": "Cahiers du Cinéma starts a digital edition",
      "type": "story",
      "url": "https://www.cahiersducinema.com/"
    },
    {
      "by": "Victerius",
      "descendants": 0,
      "id": 31318948,
      "score": 3,
      "time": 1652126223,
      "title": "Queen Elizabeth will not open UK Parliament this year, Buckingham Palace says",
      "type": "story",
      "url": "https://www.cnn.com/2022/05/09/uk/queen-elizabeth-opening-parliament-2022-intl/index.html"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31318871,
      "score": 1,
      "time": 1652125778,
      "title": "Document Liberation Project",
      "type": "story",
      "url": "https://www.documentliberation.org/"
    }
  ]
}