{
  "stories": [
    {
      "by": "fjd",
      "descendants": 0,
      "id": 31101944,
      "score": 1,
      "time": 1650483885,
      "title": "How the AI industry profits from catastrophe",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/04/20/1050392/ai-industry-appen-scale-data-labels/"
    },
    {
      "by": "hsnewman",
      "descendants": 0,
      "id": 31101936,
      "score": 1,
      "time": 1650483852,
      "title": "Pandemic Effects on War and Society",
      "type": "story",
      "url": "https://online.norwich.edu/academic-programs/resources/pandemics-effect-cause-war"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31101915,
      "score": 1,
      "time": 1650483743,
      "title": "Why male mosquitoes leave humans alone",
      "type": "story",
      "url": "https://www.rockefeller.edu/news/30149-male-mosquitoes-leave-humans-alone/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31101910,
      "score": 1,
      "time": 1650483730,
      "title": "Patches Updated for Linux to Enjoy Consoles Running at Full-Speed",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Printk-v3-Consoles-Full-Speed"
    },
    {
      "by": "yourabstraction",
      "descendants": 0,
      "id": 31101899,
      "score": 1,
      "text": "I&#x27;m in my late 30s, and over the last 10+ years I&#x27;ve grown increasingly pessimistic about the quality of care for chronic and degenerative conditions in the U.S. I&#x27;m reasonably well now, but I&#x27;ve had a number of issues I&#x27;ve had trouble shaking over the years. Things that are pretty common among my peers and others I talk to, like sleep issues, anxiety, depression, fatigue, digestive issues, autoimmune conditions, etc. Low grade stuff you can live with, but that bugs you for years while reducing quality of life. Doctors like to give vague sounding terms to these kind of things so they can convince the patient they know what the hell they&#x27;re doing, like IBS and major depressive disorder.<p>But from what I&#x27;ve seen via personal experience, hearing from friends and family, and from reading countless reports online, doctors don&#x27;t have a good handle on treating these chronic conditions. In fact, I&#x27;d say our treatment of chronic and degenerative disease is downright barbaric. And it doesn&#x27;t matter if you go the conventional medicine route or alternative, it&#x27;s a very crude system of diagnosis and treatment, barely better than guess and check with various interventions.<p>I group diagnosis and treatment into three different paths. 1) A normal doctor does a minimum number of tests, and prescribes pharmaceuticals, surgeries, and rarely lifestyle changes. 2) An alternative practitioner (naturopath, acupuncturist, etc.) does a minimal amount of testing and recommends herbs, supplements, body work, good vibes, and maybe lifestyle changes. 3) There&#x27;s also the self care route, where patients research their own condition and experiment with various supplements and lifestyle interventions. This is likely to rarely be successful, but sometimes patients will crack a condition that doctors have failed, because they stumble upon a tough to find root cause after months or years of self experimentation.<p>Given the state of technology in the world, why is the route of diagnosis and treatment for so many conditions so poor. Why do we think it&#x27;s acceptable to give people vague sounding diagnoses like IBS and major depressive disorder, that do nothing to get at what&#x27;s actually causing the symptoms. Why don&#x27;t doctors do way more tests to better diagnose what is actually causing these mystery syndromes?<p>I&#x27;ve personally found a number of nutrient excess and deficiency issues in myself, based on my own research and ordering my own labs online. These are things I was never tested for after 10+ years of seeing different doctors and naturopaths. I discovered I had high iron, a common cause of degenerative disease, and started donating blood. I discovered my zinc was low, while my copper was moderate, which is correlated with digestive issues and various mental health issues.<p>While this is definitely a rant (I&#x27;m frustrated and saddened), I also want to figure out how to improve things. I feel like we have the technology, it&#x27;s just not being properly applied. As someone who&#x27;s retired from tech, this is the kind of problem I&#x27;d love to sink my teeth into, but it feels too big and impossible. Is anyone around here working on this kind of stuff?",
      "time": 1650483663,
      "title": "Ask HN: How can we improve diagnosis and treatment of chronic health conditions?",
      "type": "story"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 31101897,
      "score": 2,
      "time": 1650483655,
      "title": "Hackers can use blank signatures to pass ECDSA verification checks in Java",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/04/major-crypto-blunder-in-java-enables-psychic-paper-forgeries/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31101896,
      "score": 1,
      "time": 1650483647,
      "title": "Stacking Up L2 Cache, Riken Shows 10x Speedup for A64FX by 2028",
      "type": "story",
      "url": "https://www.nextplatform.com/2022/04/08/stacking-up-l2-cache-riken-shows-10x-speedup-for-a64fx-by-2028/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31101895,
      "score": 1,
      "time": 1650483639,
      "title": "NASA’s next decade: Build a mission to an ice giant",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/04/nasas-next-decade-build-a-mission-to-an-ice-giant/"
    },
    {
      "by": "babelfish",
      "descendants": 0,
      "id": 31101894,
      "score": 1,
      "time": 1650483631,
      "title": "European politicians on the cusp of requiring USB-C in all smartphones",
      "type": "story",
      "url": "https://appleinsider.com/articles/22/04/20/european-politicians-on-the-cusp-of-requiring-usb-c-in-all-smartphones"
    },
    {
      "by": "avel",
      "descendants": 0,
      "id": 31101852,
      "score": 1,
      "time": 1650483482,
      "title": "Chase Ultimate Rewards and Travel Portal Down Since Early Wednesday",
      "type": "story",
      "url": "https://twitter.com/ChaseSupport/status/1516817189185150980"
    }
  ]
}