{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29609193,
      "score": 1,
      "time": 1639866397,
      "title": "On Code Reviews",
      "type": "story",
      "url": "https://henrikwarne.com/2021/12/13/on-code-reviews/"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29609162,
      "score": 1,
      "time": 1639866226,
      "title": "National Space-Based Positioning, Nav, Timing Advisory Meeting Presentations",
      "type": "story",
      "url": "https://www.gps.gov/governance/advisory/meetings/2021-12/"
    },
    {
      "by": "ibraheemdev",
      "descendants": 0,
      "id": 29609159,
      "score": 1,
      "time": 1639866199,
      "title": "Why Go and Rust are not competitors (2015)",
      "type": "story",
      "url": "https://dave.cheney.net/2015/07/02/why-go-and-rust-are-not-competitors"
    },
    {
      "by": "lai-yin",
      "descendants": 1,
      "id": 29609155,
      "kids": [
        29609194
      ],
      "score": 2,
      "text": "Between Nov 20 and Dec 14, someone with the IP address 34.66.115.47 has submitted 16 requests to join my email newsletter on my website form with nonsense email accounts like mphtnarrwqrs@gmail.com and qrzqoiakkubp@gmail.com. In one instance they used a real email address, so I have their name and know the company they work for (which is in my industry and we actually have mutual colleagues). What could this person possibly be doing with all these weird form submissions? I have a very basic, static website, do no A&#x2F;B testing, and haven&#x27;t made any updates to it in months. What do you think?",
      "time": 1639866185,
      "title": "Ask HN: What is this user doing?",
      "type": "story"
    },
    {
      "by": "actinium226",
      "descendants": 0,
      "id": 29609132,
      "score": 1,
      "text": "TL;DR I made a Chrome extension that changes the color of the notification badge on popular social media websites from red to gray: https:&#x2F;&#x2F;chrome.google.com&#x2F;webstore&#x2F;detail&#x2F;notification-badge-desens&#x2F;egihgffagcmekfdhcfckaaknpckokajp?hl=en<p>The social media companies have a taken a page from the casino&#x27;s playbooks, specifically the slot machine.<p>The slot machine doesn&#x27;t let you win every time, but it lets you win just often enough to keep you engaged, to keep you wanting more.<p>The notification bell on pages like Facebook, Youtube, and now even Netflix has one (what could Netflix possibly need to &quot;notify&quot; me about?), behaves exactly like a slot machine. It offers you a list of &quot;personalized&quot; notifications. At first it&#x27;s only relevant things, like when someone comments on your status. Just like a good slot machine will let you win a little more often at first. Then it starts getting filled with vacuous notifications while the ones you &quot;crave&quot; are interspersed, just like the slot machine again.<p>All the while the little red circle on that notification bell calls your attention. It&#x27;s red for a reason: we&#x27;re wired to respond to red. Maybe it&#x27;s because it&#x27;s the color of blood, maybe it&#x27;s because it&#x27;s the color of berries, I don&#x27;t know, but I do know that the red icon won&#x27;t leave me alone! I sometimes find myself clicking on it just to make it go away, even though I know there can&#x27;t possibly be any valuable notification there.<p>It&#x27;s time to fight back against the house. With the Chrome extension I linked above the color of this badge will go from red to gray on many popular social media websites. I&#x27;ve noticed this simple change has had a big impact. I no longer feel the need to check the bell. It&#x27;s still there, I mean it&#x27;s still occasionally useful, but it no longer demands my attention. The urgency is gone, and I can browse in peace.<p>If a site you visit is not supported by the app (currently supported are LinkedIn, Facebook, Youtube, and Netflix) please mention it in the comments below and we&#x27;ll add it to our list.",
      "time": 1639866023,
      "title": "Show HN: Battling the Red Notification Badge (Chrome Extension)",
      "type": "story"
    },
    {
      "by": "jamespwilliams",
      "descendants": 0,
      "id": 29609114,
      "score": 1,
      "time": 1639865891,
      "title": "Re: Flexible Function Naming",
      "type": "story",
      "url": "https://news-web.php.net/php.internals/70691"
    },
    {
      "by": "rsj_hn",
      "descendants": 0,
      "id": 29609109,
      "score": 1,
      "time": 1639865858,
      "title": "Fire Ants Form Rafts (2017)",
      "type": "story",
      "url": "https://daily.jstor.org/how-fire-ants-form-rafts/"
    },
    {
      "by": "MontagFTB",
      "descendants": 0,
      "id": 29609108,
      "score": 1,
      "time": 1639865842,
      "title": "Live BART status in LED hardware",
      "type": "story",
      "url": "https://www.traintrackr.io/product/bart2"
    },
    {
      "by": "bdcravens",
      "descendants": 0,
      "id": 29609105,
      "score": 1,
      "time": 1639865804,
      "title": "'A Scam': Fans Who Bought Tekashi 6ix9ine-Backed NFTs Are Pissed",
      "type": "story",
      "url": "https://www.rollingstone.com/culture/culture-news/tekashi-6ix9ine-trollz-nft-scam-hack-1272511/"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 29609098,
      "score": 1,
      "time": 1639865745,
      "title": "Bernard Rollin was a pioneer in animal rights, left with a scalding interview",
      "type": "story",
      "url": "https://nautil.us/issue/109/excavation/he-did-right-by-animals-and-didnt-take-bull-from-anyone"
    }
  ]
}