{
  "stories": [
    {
      "by": "i_cannot_hack",
      "descendants": 0,
      "id": 29298426,
      "score": 1,
      "text": "Sorry for the incoming rant, but this feature from Chrome is so ridiculous and user-hostile that I just need to get it off my chest somewhere. I&#x27;m sure people at Google reads this forum as well, so if someone from the Chrome team happens to read this and take the complaint to heart it would be an added bonus.<p>I have a personal website, let&#x27;s call it www.myname.com, that is visited somewhat frequently by various people. However, when they are sent to my website, will Chrome correctly inform them they are currently viewing www.myname.com? No. It (incorrectly and baselessly) assumes the www must be meaningless, and lies to the user by showing the website address as simply &quot;myname.com&quot; instead.<p>The crux of the issue is that the root domain myname.com does NOT point to my website, and will simply time out without a response. There is nothing I can do to fix this. My domain host does not allow ALIAS records on the root domain, only A records. Conversely, my server host (Heroku) does not allow A records for routing, only ALIAS. As such, I&#x27;m stuck with the www solution.<p>Basically, if a visitor tries to revisit the address Chrome shows them on my website, they will simply be sent into the void, with no idea of what is happening.<p>There is no justification for hiding the subdomain from the url. The subdomain and the root domain point to DIFFERENT locations, and Chrome will NEVER know if the difference is significant or not. Redirecting www to the root domain is just a cultural norm. What&#x27;s next? Showing &quot;fruit.com&quot; when you visit &quot;apple.com&quot; because it&#x27;s linguistically similar and maybe could point to the same place? Apparently showing the correct address of the website doesn&#x27;t matter, so I see no reason not to.<p>And what&#x27;s the potential upside for the user? Saving 3 characters and a dot in the address bar. Is it really worth breaking the domain name system for that?<p>Stop it, please.<p>P.S. Everything I&#x27;ve mentioned above applies to Safari as well.<p>P.P.S. I suspect people will tell me to change domain host or server host. I&#x27;m looking into it, but it&#x27;s a hassle and it would be nice to know Chrome isn&#x27;t trying to actively trick my visitors in the meantime.",
      "time": 1637519059,
      "title": "Rant HN: Chrome breaks my website by hiding www in address bar. Stop it, please",
      "type": "story"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29298416,
      "score": 1,
      "time": 1637518993,
      "title": "Controlling Your Dopamine for Motivation, Focus and Satisfaction",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=QmOF0crdyRU"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29298412,
      "score": 1,
      "time": 1637518973,
      "title": "Lawsuit: Tesla like a “frat house” with “frequent groping on the factory floor”",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/11/lawsuit-tesla-is-like-a-frat-house-with-frequent-groping-on-the-factory-floor/"
    },
    {
      "by": "mariojv",
      "descendants": 0,
      "id": 29298402,
      "score": 1,
      "time": 1637518909,
      "title": "More Americans say they’re not planning to have a child, U.S. birthrate declines",
      "type": "story",
      "url": "https://www.washingtonpost.com/nation/2021/11/21/americans-childless-pew-us-population/"
    },
    {
      "by": "kim0",
      "descendants": 0,
      "id": 29298387,
      "score": 1,
      "time": 1637518796,
      "title": "ZFS on Object Storage",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=opW9KhjOQ3Q"
    },
    {
      "by": "batguano",
      "descendants": 0,
      "id": 29298344,
      "score": 2,
      "time": 1637518519,
      "title": "Beaver Dams Mean No Love Lost for Canada’s Emblematic Animal",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/20/world/canada/canada-beaver-dams.html"
    },
    {
      "by": "haakonhr",
      "descendants": 0,
      "id": 29298329,
      "score": 1,
      "time": 1637518373,
      "title": "Best Selling Vehicles in the US by State",
      "type": "story",
      "url": "https://www.visualcapitalist.com/the-best-selling-vehicles-in-america-by-state/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29298315,
      "score": 2,
      "time": 1637518291,
      "title": "What's your favorite weird CPU instruction? any architecture, any time period",
      "type": "story",
      "url": "https://twitter.com/NoraDotCodes/status/1461908818414157825"
    },
    {
      "by": "ztc",
      "descendants": 0,
      "id": 29298313,
      "score": 1,
      "time": 1637518264,
      "title": "A Robot Wrote This Book Review",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/21/books/review/the-age-of-ai-henry-kissinger-eric-schmidt-daniel-huttenlocher.html"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29298312,
      "score": 1,
      "time": 1637518259,
      "title": "Hey, I want to buy your house: Homeowners besieged by unsolicited offers",
      "type": "story",
      "url": "https://text.npr.org/1056912546"
    }
  ]
}