{
  "stories": [
    {
      "by": "eslaught",
      "descendants": 0,
      "id": 31901726,
      "score": 1,
      "text": "Hi HN,<p>This has been bugging me for a while. We&#x27;ve got things like GPT-3 that can apparently create text out of whole cloth, and tools like Google Docs that provide the ability to complete sentences with the context of previous words before you even type the next word. And yet the swype-style completion on my smartphone continues to be consistently terrible.<p>As an example, just moments ago I was trying to type &quot;about&quot;, and none of the completion options started with &quot;a&quot; or ended with &quot;t&quot;, let alone resembled the semantic meaning of &quot;about&quot;. And this is not an infrequent occurrence for me; I probably get at most 85-90% accuracy on a good day. That means I&#x27;m missing a word almost every sentence, and the typos are so far off from what I intended that I often don&#x27;t even remember what I intended if I don&#x27;t stop immediately to fix them.<p>Maybe I just type poorly, but I&#x27;d think even a relatively poor input (with the context of previous words) would be good enough to make a pretty accurate keyboard.<p>Does anyone else have this experience? Any ideas why the state of practice isn&#x27;t more advanced at this point?<p>For reference: I&#x27;m on a Pixel device with stock Android keyboard, fully updated. But my experiences have generally been similar on other devices I&#x27;ve used.",
      "time": 1656368978,
      "title": "Ask HN: Why is mobile keyboard completion so bad?",
      "type": "story"
    },
    {
      "by": "mwcampbell",
      "descendants": 0,
      "id": 31901725,
      "score": 1,
      "time": 1656368974,
      "title": "Accessibility in Fedora Workstation",
      "type": "story",
      "url": "https://fedoramagazine.org/accessibility-in-fedora-workstation/"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 31901681,
      "score": 2,
      "time": 1656368726,
      "title": "Socially isolated people have differently wired brains and poorer cognition",
      "type": "story",
      "url": "https://theconversation.com/socially-isolated-people-have-differently-wired-brains-and-poorer-cognition-new-research-185150"
    },
    {
      "by": "samemail88",
      "descendants": 0,
      "id": 31901654,
      "score": 1,
      "text": "I&#x27;m curious if there are any technology based non-profits that are cater to direct consumers where their primary business is a website&#x2F;web business. The biggest one I can think of is Wikipedia; they are successful and have a very popular set of websites. Mozilla is another successful non-profit, but its primary business is not a website but a web application (Firefox). I&#x27;m not sure if Patreon is a non-profit or community benefit corporation. Do you know any others?",
      "time": 1656368563,
      "title": "Ask HN: Are there any successful Tech non-profits?",
      "type": "story"
    },
    {
      "by": "novateg",
      "descendants": 2,
      "id": 31901646,
      "kids": [
        31901701
      ],
      "score": 4,
      "text": "Today the first day of summer vacation. My kids, son and daughter decided to sell water in our front-yard. We bought 32 pack of water for $6.52. They sold each bottle for 50 cents. 20 bottles were sold on the first day, they decided to donate 30% of the revenue. I&#x27;m so proud!",
      "time": 1656368540,
      "title": "Tell HN: How to Start a Business as a Kid",
      "type": "story"
    },
    {
      "by": "pengstrom",
      "descendants": 0,
      "id": 31901615,
      "score": 1,
      "time": 1656368390,
      "title": "A Path Towards Autonomous Machine Intelligence",
      "type": "story",
      "url": "https://twitter.com/ylecun/status/1541491973290446850"
    },
    {
      "by": "linkdd",
      "descendants": 1,
      "id": 31901596,
      "kids": [
        31901666
      ],
      "score": 2,
      "time": 1656368280,
      "title": "Show HN: AirScript – Like Lua, but in Rust, and Different",
      "type": "story",
      "url": "https://github.com/linkdd/airscript"
    },
    {
      "by": "basicplus2",
      "descendants": 1,
      "id": 31901590,
      "kids": [
        31901601
      ],
      "score": 1,
      "time": 1656368238,
      "title": "Chlorine gas leak kills 10 injures 251 more after storage tank falls onto a ship",
      "type": "story",
      "url": "https://www.abc.net.au/news/2022-06-28/chlorine-gas-leak-kills-injures-people-at-aqaba-jordan-port/101188482"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31901526,
      "score": 2,
      "time": 1656367872,
      "title": "Apple Readies iPhone 14 and HomePod Upgrade in Flood of New Products",
      "type": "story",
      "url": "https://www.bloomberg.com/news/newsletters/2022-06-26/apple-aapl-plans-iphone-14-apple-watch-series-8-m2-macs-for-2022-and-2023-l4vd5unx"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 31901499,
      "score": 3,
      "text": "Maybe composing good music is more difficult than creating a quality painting regardless of whether it is done by a human being or computer?",
      "time": 1656367726,
      "title": "Ask HN: Why is computer generated music not as impressive as DALL·E 2?",
      "type": "story"
    }
  ]
}