{
  "stories": [
    {
      "by": "jasonhansel",
      "descendants": 0,
      "id": 29062091,
      "score": 1,
      "time": 1635729015,
      "title": "Ancient Greek Philosopher Pyrrho's Encounter with Early Buddhism in Central Asia [pdf]",
      "type": "story",
      "url": "http://assets.press.princeton.edu/chapters/s10500.pdf"
    },
    {
      "by": "wj",
      "descendants": 0,
      "id": 29062088,
      "score": 1,
      "time": 1635728974,
      "title": "Two of the biggest Bitcoin mining companies are in a small Texas town",
      "type": "story",
      "url": "https://www.cnbc.com/2021/10/31/bitcoin-mining-giants-bitdeer-riot-blockchain-in-rockdale-texas.html"
    },
    {
      "by": "redwoolf",
      "descendants": 0,
      "id": 29062079,
      "score": 1,
      "time": 1635728889,
      "title": "Why Do Rich People Love Endurance Sports?",
      "type": "story",
      "url": "https://www.outsideonline.com/health/training-performance/why-are-most-endurance-athletes-rich/"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 29062053,
      "score": 3,
      "time": 1635728555,
      "title": "Groundbreaking Simulator Generates an Indoor Ocean",
      "type": "story",
      "url": "https://www.wired.com/story/this-groundbreaking-simulator-generates-a-huge-indoor-ocean/"
    },
    {
      "by": "mattnigh",
      "descendants": 0,
      "id": 29062050,
      "score": 2,
      "time": 1635728546,
      "title": "Mistakes I’ve Made as an Engineering Manager – so you can avoid them",
      "type": "story",
      "url": "https://medium.com/leading-literally/mistakes-ive-made-as-an-engineering-manager-so-you-can-avoid-them-3391c5b63f66"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 29062043,
      "score": 1,
      "time": 1635728487,
      "title": "Domestic horses' mysterious origins may finally be revealed",
      "type": "story",
      "url": "https://www.nationalgeographic.co.uk/animals/2021/10/domestic-horses-mysterious-origins-may-finally-be-revealed"
    },
    {
      "by": "xqcgrek2",
      "descendants": 0,
      "id": 29062035,
      "score": 1,
      "time": 1635728394,
      "title": "Journalists Venture Beyond Their Newsrooms to Try to Cash In",
      "type": "story",
      "url": "https://www.wsj.com/articles/journalists-venture-beyond-their-newsrooms-to-try-to-cash-in-11635606509"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 29062033,
      "score": 1,
      "time": 1635728371,
      "title": "Speeding Up the OODA Loop with AI",
      "type": "story",
      "url": "https://www.japcc.org/speeding-up-the-ooda-loop-with-ai/"
    },
    {
      "by": "janmo",
      "descendants": 0,
      "id": 29062027,
      "score": 1,
      "time": 1635728282,
      "title": "HiQ Labs, Inc. vs. LinkedIn Appeal",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tUkoHeiPGQw"
    },
    {
      "by": "ruckadub",
      "descendants": 0,
      "id": 29062024,
      "score": 1,
      "text": "I&#x27;ve been coding and designing since 1997 and I&#x27;ve followed every internet iteration for 3 decades.  I&#x27;m the founder of a company that is in position to change a culture based industry, and throughout my decade plus of building this platform, I have determined that building opinionated software with &quot;old tech&quot; operated by highly ethically individuals or gatekeepers, is the middle ground to an equitable future for the Internet.<p>We&#x27;re all exhausted with big tech&#x27;s monopolized hold of the Internet, similar to how we&#x27;re also tired of corporations on wall street, or over hearing about people killed by guns.  As much as decentralizing big tech and replacing corporation with DeFi and confiscating all guns might seem like a great idea to some, the solution to all of this is simply becoming a better person.<p>The blockchain not only suffers from insurmountable scaling issues, but also enables humans to offload problems to tech that should be solved by humans, with humans.  I can only assume that proponents of the blockchain have already judged that most humans are greedy and untrustworthy, and it&#x27;s more realistic to try to code people out of the human network, instead of people becoming better humans.  Removing humans from a human network, only to be replaced by the promise of trust-less and anonymous transactions operated by nameless middle men, isn&#x27;t too far from where we&#x27;re at.<p>I am betting everything on humans, just like investors invest in people.  &quot;Old tech&quot; built by highly ethical people who build their ethics into their code and their corporation, can change human behavior to influence the outcome that blockchain promises by removing the human itself.   Human nature cannot be solved by math, but by true human to human experiences which changes how one views their own value within a network.  Tech should be used to help create closer trusted human relationships and incentivizes it&#x27;s features to ensure behavior that benefits the network.<p>The most dangerous thing a human can do is lose hope in humanity itself, it will lead to a nihilist approach to the Internet which will actually fast track the worst outcomes that people fear is happening on the centralized internet.  The irony.   When the blockchain is hacked and billions are stolen the entire network has to eat the losses, and all of that is on top of the speculative nature of the value itself.  As much as I despise banks, I do like the idea of getting my money back if my account experiences fraud, and knowing that the currency is stable enough to not have to check daily to see.<p>Instead of focusing on removing people from the human network we call the Internet, lets focus on making better people by making sure they&#x27;re included in our business models.  When people feel included people realize their purpose and they become better.  No blockchain needed.  Corporations can treat people fairly, but they haven&#x27;t been, and that long habit has made many thing that&#x27;s how it has to be. Corporations are like guitars played terribly for 100 years.  If someone asks you do you like guitars you&#x27;d be like they sound terrible.  It&#x27;s not the guitar.  Tech cannot fix this, and blockchain makes it easier for insiders to rob people without a trace.  The corporations that make their companies equitable to their customers will be the big winners in the future.<p>While I will cherry pick some of the cool <i>ideas</i> from blockchain to replicate with my &quot;old tech&quot; to create a best-of-all-worlds stack, it will ultimately be us good human beings in charge of our new corporations, our new popular tech companies, and that carry legal guns that will bring equitable outcomes and balance.<p>We spend a lot of time developing code, but we need to spend more time developing our human pact with each other.",
      "time": 1635728274,
      "title": "Blockchain vs. Becoming a Better Person",
      "type": "story"
    }
  ]
}