{
  "stories": [
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 31707448,
      "score": 1,
      "time": 1654975662,
      "title": "Researchers demo 40-channel optical comm link, capable of transmitting 400GB/SEC",
      "type": "story",
      "url": "https://phys.org/news/2022-06-channel-optical-link-capable-transmitting.html"
    },
    {
      "by": "samstave",
      "descendants": 0,
      "id": 31707429,
      "score": 2,
      "text": "I purchased 200 $1 solar rechargable garden lights at the dollar store.<p>I placed many about - but have a lot left.<p>They come with an LED, a solar panel, and a 400ma battery (AA sized) (super weak battery) - but they are cool...<p>I have more than I can use, I took a few and opened them up and replaced the AA sized 400ma batt with some other 1200ma&#x27;s and they were super brighter...<p>However.<p>I would like to harvest the parts from these solar lights (specifically the solar charging capability and attach them to a battery array with the solar array to a USB charging port as a way to learn how to do this.<p>Clueless.. I am seeking a mentor on how to do such, and I will send you a number of these devices to unlock yourself, but teach me how to harvest these objects and put them in series? to power &#x2F; charge other devices.<p>-<p>I have a few solar powered battery blocks, but I love the idea of using these little 1.5x1.5 inch solar panels to trickle a battery -- but more flexibly placed on something like a back pack or umbrella...<p>with the goal of teaching this to kids, but in this respect, I am a kid and would like to learn...<p>I don&#x27;t know about creating a new series of either batteries or series of solar panels.<p>(In a backpack, what I would like to do is get a few replacement iPad batteries and have them slotted into a backpack and have the cheapo solar cells charge the ipad batts in the backpack...)<p>I have around 100+ of these $1 garden lights... (I couldnt pass up buying a solar power, a nimh 400ma battery and LED with controller board for $1 each...)<p>But now I am looking to a solution for the problem of having all these devices I want to build something else from.<p>Anyone tinker like this?",
      "time": 1654975584,
      "title": "Ask HN: Harvesting LEDs,Solar panels,400ma batts of $1 solar garden lights, for?",
      "type": "story"
    },
    {
      "by": "anonymfus",
      "descendants": 0,
      "id": 31707418,
      "score": 1,
      "time": 1654975488,
      "title": "The derivative hellscape that is YouTube Shorts: emulating TikTok's toxicity",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=cCHGeqJvAsY"
    },
    {
      "by": "doener",
      "descendants": 1,
      "id": 31707411,
      "kids": [
        31707491
      ],
      "score": 3,
      "time": 1654975451,
      "title": "Tesla: Designing autopilot program to shut off less than a second before impact",
      "type": "story",
      "url": "https://twitter.com/muttgomery/status/1535353454905917446"
    },
    {
      "by": "krstak",
      "descendants": 0,
      "id": 31707396,
      "score": 2,
      "time": 1654975364,
      "title": "Product Owner vs. Developer: who is the boss?",
      "type": "story",
      "url": "https://www.cyberoutput.net/blog/product-owner-vs-developer"
    },
    {
      "by": "tempestn",
      "descendants": 5,
      "id": 31707349,
      "kids": [
        31707449,
        31707419,
        31707406,
        31707498
      ],
      "score": 15,
      "text": "Like many people, my wife and I use WhatsApp to keep in touch with various family and friends who prefer that platform.  I actually use it more than she does—she basically just chats with close family and a few friends from highschool.<p>A few days ago, she opened the app to find the message,<p>&gt; This account is not allowed to use WhatsApp\n&gt; Chats are still on this device.<p>This didn&#x27;t make any sense, as she only uses it to chat with family and friends and certainly hadn&#x27;t broken any terms.  Found the option to appeal and submitted that.  A day later, the app now says<p>&gt; This account cannot use WhatsApp\n&gt; We&#x27;ve completed our review and found this account&#x27;s activity goes against WhatsApp&#x27;s terms of service<p>There&#x27;s no way she&#x27;s actually broken any terms, so it appears this is some kind of mistake, but given the speed of the &quot;review&quot;, I doubt any human has actually looked at it.  She&#x27;s tried contacting them via their contact page, but given the review is already &quot;complete&quot;, I&#x27;m not too hopeful.<p>Our only guess as to what could have caused this is that a week or so before the ban she received a spam message sent to a giant group and marked it as spam.  Perhaps somehow all numbers in that group ended up associated with the spamming?  Regardless, pretty frustrating situation since she has a couple of long-running chats with family and friend groups that she can no longer participate in.  Always fun to be at the whims of the algorithm.<p>Posting in case there&#x27;s anything to the connection between marking a message as spam and getting blocked (maybe it&#x27;s safer to just mute spam messages instead), as well as on the off chance someone from Facebook ends up reading this and can help.",
      "time": 1654975048,
      "title": "Tell HN: My wife was banned from WhatsApp without reason or recourse",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31707312,
      "score": 3,
      "time": 1654974811,
      "title": "Neo-Nazis Tricked into Raising Thousands Against Themselves (2014)",
      "type": "story",
      "url": "https://www.rollingstone.com/culture/culture-news/neo-nazis-tricked-into-raising-thousands-for-anti-extremism-charity-168193/"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 31707266,
      "score": 2,
      "time": 1654974567,
      "title": "Reframing and simplifying the idea of how to keep a Zettelkasten",
      "type": "story",
      "url": "https://boffosocko.com/2022/06/10/reframing-and-simplifying-the-idea-of-how-to-keep-a-zettelkasten/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31707214,
      "score": 3,
      "time": 1654974291,
      "title": "Teaching Critical Thinking by Distinguishing Appropriate Types of Evidence(2011)",
      "type": "story",
      "url": "https://www.researchgate.net/publication/231756261_Taking_a_Step_Back_Teaching_Critical_Thinking_by_Distinguishing_Appropriate_Types_of_Evidence"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31707212,
      "score": 1,
      "time": 1654974254,
      "title": "A Preview of Things to Come",
      "type": "story",
      "url": "http://coding-unboxed.com/index.php/2022/05/30/a-preview-of-things-to-come/"
    }
  ]
}