{
  "stories": [
    null,
    {
      "by": "Erikun",
      "descendants": 0,
      "id": 30303196,
      "score": 1,
      "time": 1644596383,
      "title": "ArcFlash Labs' GR-1 Anvil Portable Gauss Rifle",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=eAHKS0nVlL4"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 30303190,
      "score": 1,
      "time": 1644596351,
      "title": "How the Physics of Resonance Shapes Reality",
      "type": "story",
      "url": "https://nautil.us/how-the-physics-of-resonance-shapes-reality-13915/"
    },
    {
      "by": "philipjoubert",
      "descendants": 0,
      "id": 30303159,
      "score": 1,
      "time": 1644596202,
      "title": "It’s better to be different than it is to be better",
      "type": "story",
      "url": "https://philipjoubert.com/positioning/"
    },
    {
      "by": "sirspacey",
      "descendants": 0,
      "id": 30303157,
      "score": 1,
      "text": "We’ve had success as a startup working with privately held companies, but our encountering things we’ve never dealt with before working with new clients that are owned by a holding company.<p>A few example challenges:<p>* an exec said they “didn’t understand what we do” but won’t take their team’s word on approving a project their team really wants<p>* we’ve demonstrated that we could save the business a significant amount of money, but there isn’t a pre-approved budget for them to spend so they don’t seem able to find budget<p>* when we introduce new tools, even established ones like Google Sheets, the IT dept at the holding company is almost hostile about allowing it<p>As a team, we’re familiar with helping companies identify problems, create budget to solve it, getting IT’s buy-in and then deliver great results.<p>That doesn’t seem to be the way to win the support from holding companies.<p>Questions we have are:<p>how do we get into a productive conversation with the people at holding companies?<p>How do we help team members at our client feel safe when the holding company is involved (they often do everything they can to avoid interacting with them)?<p>Is there some other way to approach these kinds of clients we aren’t seeing?<p>Or is this a kind of client we should simply avoid?<p>Would love to hear your stories, challenges, and advice. We’re interested in learning all we can!",
      "time": 1644596196,
      "title": "Ask HN: How do you work with holding companies?",
      "type": "story"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30303144,
      "score": 1,
      "time": 1644596157,
      "title": "Bolt’s 27-Year-Old Co-Founder Is Worth Billions and Going After the Valley Elite",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-02-11/bolt-s-founder-ryan-breslow-is-worth-billions-and-going-after-the-valley-elite"
    },
    {
      "by": "flreln",
      "descendants": 0,
      "id": 30303140,
      "score": 1,
      "time": 1644596141,
      "title": "Best company handbook I’ve seen",
      "type": "story",
      "url": "https://posthog.com/handbook"
    },
    {
      "by": "cliffordfajardo",
      "descendants": 1,
      "id": 30303129,
      "kids": [
        30303168
      ],
      "score": 2,
      "text": "What are other databases like SQlite, which dont require spinning up a server &amp; save data to disk instead? Does such a thing exist for specialized databases on a single disk (elastic search etc)?",
      "time": 1644596087,
      "title": "Ask HN: Any other databases on single disk file like SQLite exist?",
      "type": "story"
    },
    {
      "by": "onpedrof",
      "descendants": 1,
      "id": 30303118,
      "kids": [
        30303154
      ],
      "score": 2,
      "time": 1644596050,
      "title": "Hopin got 'Fastest Growing Product' Award, fires 12% due to unsustainable growth",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/10/virtual-events-platform-hopin-cuts-12-of-staff-citing-goal-of-sustainable-growth/"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30303091,
      "score": 3,
      "time": 1644595920,
      "title": "UK regulators accept Google's Privacy Sandbox promises",
      "type": "story",
      "url": "https://www.theregister.com/2022/02/11/uk_cma_google_cookies_assurances/"
    }
  ]
}