{
  "stories": [
    {
      "by": "mraza007",
      "descendants": 0,
      "id": 28533550,
      "score": 1,
      "text": "Hello HN\nI have been very curious to learn about how can you become a blockchain developer and what skills do you need",
      "time": 1631666339,
      "title": "Ask HN: How do you become blockchain developer",
      "type": "story"
    },
    {
      "by": "dustingetz",
      "descendants": 0,
      "id": 28533547,
      "score": 1,
      "time": 1631666328,
      "title": "Building Next Gen Applications on JVM with ZIO",
      "type": "story",
      "url": "https://www.capitalone.com/tech/software-engineering/building-on-jvm-with-zio/"
    },
    {
      "by": "dragonsh",
      "descendants": 0,
      "id": 28533544,
      "score": 1,
      "time": 1631666314,
      "title": "Apple's new iPhone 13 lineup and everything else announced today",
      "type": "story",
      "url": "https://www.cnet.com/tech/mobile/apples-new-iphone-13-lineup-everything-else-announced-today/"
    },
    {
      "by": "hncurious",
      "descendants": 0,
      "id": 28533539,
      "score": 1,
      "time": 1631666293,
      "title": "Medicate and Punish: For Boys, Schools Have Little to Offer",
      "type": "story",
      "url": "https://www.wsj.com/articles/boys-school-medicated-male-feminization-11631569079"
    },
    {
      "by": "dymione",
      "descendants": 0,
      "id": 28533517,
      "score": 1,
      "time": 1631666131,
      "title": "MovieBoxPro",
      "type": "story"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 28533508,
      "score": 1,
      "time": 1631666074,
      "title": "Scientists: Overeating Not Primary Obesity Cause, More Effective Weight Loss",
      "type": "story",
      "url": "https://scitechdaily.com/scientists-claim-overeating-is-not-the-primary-cause-of-obesity-point-to-more-effective-weight-loss-strategies/"
    },
    {
      "by": "AcquisitionNoob",
      "descendants": 0,
      "id": 28533500,
      "score": 1,
      "text": "I&#x27;m finishing development of the flagship product for my new sole-founder fully-bootstrapped startup in the USA (no outside funding).  I currently have enough knowledge about business, relationships, accounting, etc. to take this startup to an acquisition valuation of around $10MM USD in 5 years.  In other words, I can sit and write down all of the detailed steps that I would execute over the next 5 years in order to make that happen.  I can do that because I have enough knowledge and indirect experience to come up with those steps by thinking really hard.  This knowledge and experience comes from running an ongoing small software engineering consultancy with a revenue of a few million per year.  Actually identifying and then executing the steps for a $10MM valuation will be a challenge for me, but I believe with high confidence I have the capability to do so.<p>But here&#x27;s the thing:  I think someone else could take the same product and write down the steps to turn it into a $100MM or $250MM acquisition instead of a $10M acquisition.  Same starting point - very different ending.  And I predict, very different steps.<p>ASSUME that it&#x27;s a successful product that COULD result in a $250MM acquisition.  My problem is three-fold:<p>Problem 0: I&#x27;d like to perform the steps necessary for a $250MM acquisition;<p>Problem 1: I don&#x27;t know (and can&#x27;t derive by thinking really hard) the steps necessary to make that happen;<p>Problem 2: I don&#x27;t know the subject areas to study and learn in order to be able to derive the steps for Problem #1.<p>This is a problem of education, not a problem of intelligence or capability.<p>So, I would like to Ask HN:  What specific subjects should I learn that would lead me down the right path?  Which of these subjects should I do a deep-dive, and which should I do a shallow-dive?  Please help me solve problem #2 so that I can solve problem #1 myself, so that I can then execute and solve Problem #0 myself.  (Any non-trivial suggestions for Problem #1 are also welcomed)<p>Also, am I even asking the right questions in this post?  Am I correct to focus on education, or should I focus on something else such as building new kinds of relationships (if so what kind)?  What sorts of questions should I be asking instead of the ones in this post (and what are the answers to those questions)?<p>Thanks in advance to all that reply!",
      "time": 1631665931,
      "title": "Ask HN: 250MM Acquisition Instead of $10MM?",
      "type": "story"
    },
    {
      "by": "_delirium",
      "descendants": 0,
      "id": 28533497,
      "score": 2,
      "time": 1631665910,
      "title": "Three Former U.S. Intelligence Operatives Admit Hacking for United Arab Emirates",
      "type": "story",
      "url": "https://www.npr.org/2021/09/14/1037132503/us-charges-former-intelligence-operatives-hacking-for-uae"
    },
    {
      "by": "nomdep",
      "descendants": 0,
      "id": 28533458,
      "score": 2,
      "time": 1631665587,
      "title": "Designing Beautiful Shadows in CSS",
      "type": "story",
      "url": "https://www.joshwcomeau.com/css/designing-shadows/"
    },
    {
      "by": "8bitsrule",
      "descendants": 12,
      "id": 28533449,
      "kids": [
        28533526,
        28533521,
        28533568,
        28533565,
        28533566,
        28533518,
        28533546
      ],
      "score": 37,
      "time": 1631665501,
      "title": "Young People Are Anxious About Climate Change, Say Governments Are Failing Them",
      "type": "story",
      "url": "https://text.npr.org/1037023551"
    }
  ]
}