{
  "stories": [
    {
      "by": "oscar_austria",
      "descendants": 0,
      "id": 30797469,
      "score": 1,
      "text": "No code or images, just good ol&#x27; text.<p>There are 4 steps to hacking Amazon&#x27;s algorithm and I&#x27;ll summarize them here.<p>Step 1: finding products that can lead their categories.<p>There are two tools to do this, either JungleScout or Helium10, I personally like H10 better (both are paid for).<p>Look up a particular subcategory (e.g. bed sheets) and download the Excel containing the sellers and the sales amounts for the last 30 days.<p>The key to identifying good products and categories is: price point above US $20, last 30 days revenue for top 3 players above US $10,000, local rather than global players, big sales difference between top players and bottom players<p>When you identify products that have a good ticket size and few, local competitors, add up what the sum of all product sales is worth and you get your total addressable market. Quantify the % for the player #3 (best case), #10 (base case) and #25 (worst case). Do this exercise for 25 products and select the 3 you deem best.<p>Step 2: sourcing.<p>Easiest way to source is from Alibaba, otherwise try to find local suppliers (can be trickier). Always ask for samples!<p>Make sure you have a brand name and register it with the local authorities. For some products you&#x27;ll need a certificate. This takes time.<p>Create a logo. Send that logo to the suppliers.<p>Send production order for the amount of units the base case says you could sell. Bring 20% of units by plane, 80% by sea. Make sure you comply with the accounting and import laws (you&#x27;ll need an agente aduanal to help and make the payment for you)<p>In the production meantime prepare the images and set up marketplace accounts (Amazon + MELI).<p>Look up keywords to use on JungleScout.<p>Have everything set up.<p>Receive the goods in a warehouse until you get access to FBA.<p>Step 3: Sell (the hack!)<p>Assign a 50% ACOS at first to get high inorganic ranking, costly but worth it<p>Ask friends &amp; family to buy your product and rate it with 5 stars (not all reviews are shown by Amazon).. you can use coupon codes for this<p>Price high initially and set a 25% discount for the first 20 units<p>First weeks will be painful, but after the first 10 reviews on your product you will begin to see some traction, make sure 100% of deliveries are on time<p>Check your ranking vs competitors and measure your organic ranking (non-paid Ads)<p>The point of this game is to spend excessive money on Advertising so you rank higher inorganically to then rank higher organically.<p>Once you rank on page one organically you can lower ACOS to 40%, and once you are among top 20 to 30% and then to 20%, until you reach 15%, that&#x27;s what you should have once you stabilize.<p>Step 4: Next order<p>When you in fact see your sales adding up you need to order another batch. Be aggressive. Order enough inventory to be #3 in your category the next 6 months. Running out of stock screws your ranking.<p>The more you order the lower your COGS<p>Track your organic ranking everytime<p>Step 5: Win profitably<p>After a few months of doing this your P&amp;L should be EBITDA positive. 15% Ad spend, 30-40% COGS, 25% FBA + Amazon fee, 20-30% profit.<p>That&#x27;s how you hack it. By being more aggressive in Ad spend with a mid-term strategy than competitors.<p>The initial setup takes a lot of time, but this is a super scalable model. In 6 months I burnt $250k without income. By month 9 I had $420,000 in revenue with profit. It works!",
      "time": 1648168929,
      "title": "Hacking Amazon Algo in Latam",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30797460,
      "score": 1,
      "time": 1648168850,
      "title": "Biochar",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Biochar"
    },
    {
      "by": "BerislavLopac",
      "descendants": 0,
      "id": 30797427,
      "score": 1,
      "time": 1648168516,
      "title": "The Enterprise Developer from Hell (2014)",
      "type": "story",
      "url": "https://fsharpforfunandprofit.com/posts/property-based-testing/"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 30797425,
      "score": 4,
      "time": 1648168508,
      "title": "Lapsus$: Oxford teen accused of being multi-millionaire cyber-criminal",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-60864283"
    },
    {
      "by": "nmstoker",
      "descendants": 0,
      "id": 30797412,
      "score": 1,
      "time": 1648168423,
      "title": "Oh My Posh – Free Ukraine Theme",
      "type": "story",
      "url": "https://ohmyposh.dev/docs/themes#free-ukraine"
    },
    {
      "by": "makeworld",
      "descendants": 0,
      "id": 30797399,
      "score": 1,
      "time": 1648168293,
      "title": "Wordle on the Badger 2040",
      "type": "story",
      "url": "https://www.makeworld.space/2022/03/wordle_badger2040.html"
    },
    {
      "by": "nick__m",
      "descendants": 0,
      "id": 30797393,
      "score": 1,
      "time": 1648168259,
      "title": "Are advertisers going to infiltrate our dreams?",
      "type": "story",
      "url": "https://thehustle.co/are-advertisers-going-to-infiltrate-our-dreams/"
    },
    {
      "by": "geenew",
      "descendants": 0,
      "id": 30797392,
      "score": 1,
      "time": 1648168259,
      "title": "Inside China's electric drive for swappable car batteries",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/inside-chinas-electric-drive-swappable-car-batteries-2022-03-24/"
    },
    {
      "by": "AiFoGhost",
      "descendants": 0,
      "id": 30797381,
      "score": 6,
      "time": 1648168216,
      "title": "Building a No-Code Toxicity Classifier – By Talking to GitHub Copilot",
      "type": "story",
      "url": "https://www.surgehq.ai/blog/building-a-no-code-toxicity-classifier-by-talking-to-copilot"
    },
    {
      "by": "ivancho",
      "descendants": 0,
      "id": 30797360,
      "score": 2,
      "time": 1648168041,
      "title": "Communication in Times of Russian Invasion",
      "type": "story",
      "url": "https://docs.google.com/document/d/e/2PACX-1vS7Ftq_MsURVt9LoaSSpalZZLEJDugpgtO2FX73RirADUllpeVH9sYE9YRmC2LSpWN0ioTdHWzWvh0n/pub"
    }
  ]
}