{
  "stories": [
    {
      "by": "Bud",
      "descendants": 0,
      "id": 31705435,
      "score": 1,
      "time": 1654962881,
      "title": "Star Wars – The Genius of John Williams",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=v5ysBKUC4-w"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31705421,
      "score": 1,
      "time": 1654962783,
      "title": "You Can’t Remember Being Born: A Look at ‘Infantile Amnesia’",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/why-you-cant-remember-being-born-a-look-at-infantile-amnesia/"
    },
    {
      "by": "aruanavekar",
      "descendants": 0,
      "id": 31705405,
      "score": 1,
      "time": 1654962680,
      "title": "Coinbase CEO Tweets ‘Quit and Find a Company You Believe In’",
      "type": "story",
      "url": "https://www.forbes.com/sites/jackkelly/2022/06/11/coinbase-ceo-tweets-quit-and-find-a-company-you-believe-in-to-disgruntled-employees/"
    },
    {
      "by": "frogger8",
      "descendants": 1,
      "id": 31705368,
      "kids": [
        31705384
      ],
      "score": 2,
      "time": 1654962459,
      "title": "Feature rich WiFi network security tool, over 40M users",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=com.overlook.android.fing&hl=en_US&gl=US"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31705361,
      "score": 2,
      "time": 1654962426,
      "title": "Restoration of empire is the endgame for Russia's Vladimir Putin",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_a79f27045ae44a0d5166c14f7d968e04"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31705344,
      "score": 2,
      "time": 1654962310,
      "title": "Arrest warrants issued for 46 New Hampshire fraternity members",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_5eacd4902f21e346cf55e8add3f71c9b"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 31705292,
      "score": 1,
      "time": 1654961893,
      "title": "Forecourt fuel thefts rise as petrol prices soar",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/uk-61770710"
    },
    {
      "by": "jvanderbot",
      "descendants": 2,
      "id": 31705287,
      "kids": [
        31705409,
        31705427
      ],
      "score": 4,
      "text": "Emails that appear on https:&#x2F;&#x2F;haveibeenpwned.com&#x2F; and my public github are receiving emails from Truth Social bugging me to verify my &quot;new account&quot;.<p>I&#x27;ve tried to reset the password, log in, and close the account, but I never receive a password reset email.<p>Suggestions?",
      "time": 1654961866,
      "title": "Tell HN: My leaked emails are appearing on Truth Social",
      "type": "story"
    },
    {
      "by": "jamesofthedrum",
      "descendants": 3,
      "id": 31705284,
      "kids": [
        31705311,
        31705335
      ],
      "score": 2,
      "text": "Happy Saturday, folks! I curated this week&#x27;s archaeological news below:<p>[Prehistoric “Swiss Army knife” indicates early humans communicated](https:&#x2F;&#x2F;www.eurekalert.org&#x2F;news-releases&#x2F;955471)\nTL;DR A particular type of stone tool is found in southern Africa across large distances and multiple biomes, indicating that ancient peoples were communicating and sharing technology. The Howiesons Poort backed artifacts (“Howiesons Poort” being a Middle Stone Age cultural period), also known as “stone Swiss Army Knives”, were produced in huge quantities roughly 65,000 years ago. According to Paloma de la Peña, “While the making of the stone tool was not particularly difficult, the hafting of the stone to the handle through the use of glue and adhesives was hard, which highlights that they were sharing and communicating complex information with each other.” Interestingly, this supports one explanation of why the biggest exit out of Africa 60,000-70,000 years ago was so successful — that there was sufficient social connection for a large-scale exodus. “What was also striking was that the abundance of tools made in the same shape coincided with great changes in the climatic conditions. We believe that this is a social response to the changing environment across southern Africa.”<p>[How an ancient rice beer helped brew Chinese civilisation](https:&#x2F;&#x2F;www.scmp.com&#x2F;news&#x2F;people-culture&#x2F;environment&#x2F;article&#x2F;3180155&#x2F;how-ancient-rice-beer-helped-brew-chinese)\nTL;DR A new study showed that red rice beer created “cultural interactions” between autonomous neolithic peoples in China. These independent groups started blending together during the “interaction sphere”, beginning around 4,000 years ago, kicking off a new phase in Chinese history. The brew was brought to China by the Dawenku culture between 4,600 and 6,700 years ago. It is made in large clay basins called dakougangs, which were a big technological advancement in themselves. Being able to make large quantities of red rice beer for feasts provided individuals with prestige, and the realization that this technology would have helped people gain status may shed “new light on the intensified transregional interactions which contributed to the growth of social stratification at the dawn of Chinese civilisation.” As a side note, this was not merely because people liked to drink — the red hue of the beer likely made it a sacred ceremonial substance associated with blood.<p>[Industrial Manufacturing Of Wool And Wool Textiles In The Bronze Age Italy](https:&#x2F;&#x2F;archaeologynewsnetwork.blogspot.com&#x2F;2022&#x2F;06&#x2F;industrial-manufacturing-of-wool-and.html)\nTL;DR Montale in Northern Italy had some of the first wool production in Europe, and it may have even been done on an industrial scale. In a recent study, archaeologist Serena Sabatina made a case for this through the sheer quantity of textile tools found at the site, as well as the analysis of teeth. The latter showed that sheep and goats were raised and died in the same area, indicating that they were closely managed on site. The article goes on to say that it took over a year to get enough wool from 10 sheep to make a 3.5x3.5 meter cloth, hence the need for economically sustainable wool production. &quot;Thanks to particularly favorable social and environmental conditions, they were able to specialize in the production of wool and likely exported wool, wool yarn or perhaps even woven wool textiles. They were then able to trade wool and textiles for goods not available in the area.&quot;",
      "time": 1654961829,
      "title": "Archaeological news – this week's top three",
      "type": "story"
    },
    {
      "by": "BrianKMason",
      "descendants": 0,
      "id": 31705268,
      "score": 1,
      "time": 1654961650,
      "title": "Want a programming partner? Fill this out and we will find one for you",
      "type": "story",
      "url": "https://docs.google.com/forms/d/e/1FAIpQLSemGWtyKwjoZHAhsVKG6vwTbQRlp55E9e3I3Ag5_duTqGQV_Q/viewform?usp=send_form"
    }
  ]
}