{
  "stories": [
    {
      "by": "spaniard89277",
      "descendants": 1,
      "id": 31274864,
      "kids": [
        31274899
      ],
      "score": 2,
      "text": "It seems only Android or propuetary ereaders available. I&#x27;m missing something?",
      "time": 1651765658,
      "title": "Any Ereader with Linux?",
      "type": "story"
    },
    {
      "by": "activitypea",
      "descendants": 0,
      "id": 31274858,
      "score": 1,
      "time": 1651765614,
      "title": "Ask HN: How did Meta's Reality Labs lose $5B in 2022?",
      "type": "story"
    },
    {
      "by": "granto",
      "descendants": 0,
      "id": 31274848,
      "score": 2,
      "time": 1651765556,
      "title": "White House wants nation to prepare for cryptography-breaking quantum computers",
      "type": "story",
      "url": "https://therecord.media/biden-quantum-computing-national-security-memorandu/"
    },
    {
      "by": "orsol",
      "descendants": 0,
      "id": 31274831,
      "score": 1,
      "text": "This package that makes it easy to enable configuration of an app in one line of code. \nAll you need is to declare the struct that will hold values of your config and call Read method <a href=\"https:&#x2F;&#x2F;github.com&#x2F;num30&#x2F;config\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;num30&#x2F;config</a> . \nThen you can configure an app using ENV vars, File, or command line arg. \nThis project was born inside my current company where we have plenty of micro services that we want to be configured in different ways whether they run in K8s cluster or locally.\nI&#x27;d love to hear your feedback!",
      "time": 1651765474,
      "title": "Show HN: Dead easy configuration of apps in Go",
      "type": "story",
      "url": "https://github.com/num30/config"
    },
    {
      "by": "robg",
      "descendants": 2,
      "id": 31274748,
      "kids": [
        31274793
      ],
      "score": 2,
      "time": 1651765180,
      "title": "Kierkegaard’s Leap of Faith",
      "type": "story",
      "url": "https://academic.logos.com/kierkegaards-leap-of-faith/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31274709,
      "score": 3,
      "time": 1651765022,
      "title": "SQRL",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/SQRL"
    },
    {
      "by": "bikenaga",
      "descendants": 0,
      "id": 31274652,
      "score": 2,
      "time": 1651764782,
      "title": "Paranormal Beliefs and Cognitive Function",
      "type": "story",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0267360"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31274642,
      "score": 2,
      "time": 1651764721,
      "title": "Netflix’s Big Power Clash and Rivalries Behind the Crash",
      "type": "story",
      "url": "https://www.hollywoodreporter.com/business/digital/netflixs-big-wake-up-call-the-power-clash-behind-the-crash-1235136004/"
    },
    {
      "by": "sauldata",
      "descendants": 0,
      "id": 31274640,
      "score": 1,
      "text": "Dataplane is the data platform that makes it far easier for your data team to build and scale a data mesh with automated data pipelines and workflows.<p>It is early days for Dataplane with the first beta release. Still much to do! I would love to hear your thoughts and for you to get involved.<p>Go check out the demo at <a href=\"https:&#x2F;&#x2F;dataplane.app\" rel=\"nofollow\">https:&#x2F;&#x2F;dataplane.app</a> or use the quick start guide to install a cluster locally using either Docker Compose or Minikube.<p>Here are the highlights:<p>* Written in Golang and compiled to machine code for extreme performance with a low memory and CPU footprint. Front end built in React with secure JWT tokens, real-time Websockets and GraphQL.\n* No code drag and drop data pipeline builder.\n* Built in online Python code editor – no more configuring developer spec laptops for your data team to get going or to train new data team members.\n* Granular permissions for teams to collaborate with segregated access.\n* Secrets management with logging redaction allows team members to use secure resources without revealing passwords or API keys.\n* Scheduler with multiple time zone support and per second scheduling.\n* Setup isolated environments to develop, test &amp; deploy across data mesh domains.\n* Distributed computing with worker groups. You can configure different types of workers for different parts of a data pipeline, for example, NLP or AI deep learning workers versus vanilla Python with pandas data frame workers.\n* Monitor worker nodes in real-time resource usage and logging.\n* A Dataplane cluster can horizontally scale to many instances connected over a NATS message bus, providing self-healing, resilience and scale – this includes leader election and distribution locking for data pipeline run time safety.\n* Cloud native – deploy and scale on Kubernetes in your favourite cloud provider.",
      "time": 1651764706,
      "title": "Show HN: Dataplane – OSS data platform – build a data mesh with data pipelines",
      "type": "story",
      "url": "https://github.com/dataplane-app/dataplane"
    },
    {
      "by": "ttunguz",
      "descendants": 0,
      "id": 31274595,
      "score": 1,
      "time": 1651764509,
      "title": "Key Data Points about the Early Venture Market in Q1 2022",
      "type": "story",
      "url": "https://tomtunguz.com/angellist-q1-report/"
    }
  ]
}