{
  "stories": [
    {
      "by": "danfritz",
      "descendants": 0,
      "id": 30673336,
      "score": 1,
      "time": 1647270577,
      "title": "Unity Game: Farmers stealing tanks",
      "type": "story",
      "url": "https://pixelforest.itch.io/farmers-stealing-tanks"
    },
    {
      "by": "gbseventeen3331",
      "descendants": 0,
      "id": 30673321,
      "score": 1,
      "time": 1647270501,
      "title": "In Ukraine’s cyber-war with Russia, who is a civilian and what is a war crime?",
      "type": "story",
      "url": "https://restofworld.org/2022/in-ukraines-cyber-war-with-russia-who-is-a-civilian-and-what-is-a-war-crime/"
    },
    {
      "by": "lkrubner",
      "descendants": 0,
      "id": 30673282,
      "score": 2,
      "text": "I recall when git caught on, during the era 2010-2012. From 2005-2012 the companies I worked at used Subversion, but since late 2012, every company I&#x27;ve been at has used git. I used to ask, &quot;Will it be possible for everyone on the team to use this?&quot; and most proponents of git said &quot;Eventually we will develop easy GUIs so everyone can use it&quot; but it&#x27;s been more than 10 years now and it still hasn&#x27;t happened. git is popular with computer programmers, and it is only popular with computer programmers. I recall at the companies that used Subversion, it was the universal version control for everyone at the company: the CEO, the CFO, the graphic designers, the marketing team, the sales team -- anyone who had a document they wanted to save or share, they would just throw it into Subversion. On Windows, there was the TortoiseSVN client, which many people felt something akin to joy when they used.<p>I was concerned when git emerged because suddenly these organizations were riven across multiple version control systems. The CEO, the CFO, the graphic designers, the marketing team -- all of these people started using different tools, such as Basecamp or Google docs. And the computer programmers used git. I suspect this hurts an organization somewhat, chopping up its version control over so many different tools.<p>I&#x27;m curious if anyone thinks it is possible for git to ever catch up to Subversion in terms of ease of use?",
      "time": 1647270305,
      "title": "Ask HN: Can anything make Git as popular as Subversion?",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30673216,
      "score": 2,
      "time": 1647269998,
      "title": "Peter Thiel, Max Levchin, David Sacks, and Luke Nosek, with Author Jimmy Soni",
      "type": "story",
      "url": "https://www.callin.com/episode/peter-thiel-max-levchin-david-sacks-and-luke-cDnlAyufqw"
    },
    {
      "by": "deegles",
      "descendants": 0,
      "id": 30673205,
      "score": 1,
      "time": 1647269951,
      "title": "Look to the Stars: Navigating the Urbit",
      "type": "story",
      "url": "https://messari.io/article/look-to-the-stars-navigating-the-urbit"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 30673202,
      "score": 1,
      "time": 1647269927,
      "title": "Olympian Motors: Unique and High-End Electric Vehicles",
      "type": "story",
      "url": "https://olympianmotors.com/"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 30673195,
      "score": 5,
      "time": 1647269906,
      "title": "Meta narrows guidance to prohibit calls for death of a head of state",
      "type": "story",
      "url": "https://www.reuters.com/technology/meta-narrows-guidance-restrict-calls-death-head-state-2022-03-14/"
    },
    {
      "by": "jcuenod",
      "descendants": 1,
      "id": 30673193,
      "kids": [
        30673304
      ],
      "score": 1,
      "text": "I&#x27;m looking for the cheapest option for flying between three cities in the summer with relatively broad constraints. Google flights, which normally serves me quite well between two cities, is pretty rubbish on three and searching past HN discussions, the options seem to die (https:&#x2F;&#x2F;airx.mikface.com, https:&#x2F;&#x2F;fluugi.com, https:&#x2F;&#x2F;www.prestotrip.com).",
      "time": 1647269900,
      "title": "Ask HN: What multi-city flight finder do you use?",
      "type": "story"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 30673142,
      "score": 3,
      "time": 1647269636,
      "title": "Tiny Galaxies Reveal Secrets of Supermassive Black Holes",
      "type": "story",
      "url": "https://www.quantamagazine.org/tiny-galaxies-reveal-secrets-of-supermassive-black-holes-20220314/"
    },
    {
      "by": "kaboro",
      "descendants": 0,
      "id": 30673136,
      "score": 1,
      "time": 1647269610,
      "title": "If Your Grandmother Had Wheels – She Wouldn't Be a Bicycle",
      "type": "story",
      "url": "https://www.conradakunga.com/blog/if-your-grandmother-had-wheels-she-wouldnt-be-a-bicycle-its-always-harder-than-you-think/"
    }
  ]
}