{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27971762,
      "score": 1,
      "time": 1627390107,
      "title": "Failing to Fail: The Spiderweb Software Way (2018)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=stxVBJem3Rs"
    },
    {
      "by": "zero_billion",
      "descendants": 0,
      "id": 27971757,
      "score": 1,
      "text": "Hello HN, I&#x27;m Tejas from Atmana (<a href=\"https:&#x2F;&#x2F;atmana.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;atmana.org&#x2F;</a>). We have an app and community to help people cut back on their compulsive (or just excessive) use of pornography and other digital activities like social media and gaming. Our community currently has 100k members.<p>Compulsive porn usage is a taboo topic. Millions of people want to get away from this behavior, but it&#x27;s an embarrassing problem to discuss socially. Those who are struggling tend to get anxious and lonely which increases the chances that they further indulge in compulsive porn watching. This is the classic addictive cycle.<p>After discussing with many psychologists and psychiatrists, as well as our users, we have built features that help the user with: (1) Accountability: accountability to one&#x27;s goals is quite important to succeed. With this in mind, we have a buddy system. User adds a friend who controls the content allowed on the device and gets daily reports on what kind of content was accessed. (2) Judgement-free support: we have a community of over 100,000 people who are trying to overcome their porn problems. Users can participate anonymously in our community. This reduces shame&#x2F;stigma and helps users get support from peers. (3) Blocking: We have an inbuilt blocker in our app which cuts out all ways to access porn and we have built it quite robustly so that there are no easy ways for most users to bypass it.<p>I&#x27;ve spent the last 3.5 years working on apps to do with habits. Me along with a colleague got started with building apps that I myself needed to become healthy, like an app to gamify going to the gym everyday and an app to wake up early. After failing to monetize any healthy habit apps, I decided to take away harmful habits, hoping this would be easier to monetize. I had personally benefited by cutting down porn in my life and it was quite difficult to quit this behavior. I hence, decided to help others who had a similar problem. After an year of building many features, I closed it down due to lack of engagement. But after speaking to over 200 users of NoPo, I realized what our app didn’t do, which was: not showing user his&#x2F;her progress, not having a process to keep user accountable and not blocking porn on the device. After fixing all these issues, I launched BlockerX, my fifth app, which users are finding valuable in overcoming their porn related problems.<p>Blocking adult content effectively is quite challenging as users will always find ways to bypass the blocking. The difficulty is to make the blocking robust enough that the user can&#x27;t bypass it, but at the same time that the blocking only happens on adult content and not others (minimising false positives). We have done a bunch of optimisations on our android and iOS apps to make it just right – we consider multiple signals before blocking to ensure the blocking is accurate most of the time.<p>We have a freemium model. Advanced features on the app require a premium subscription (like ad free experience, unlimited blocking, syncing of preferences across devices). The main functionality, e.g. blocking of adult websites is free to use. Also, our marketing is currently oriented towards 18-to-30 year olds but this is just a starting point. We recognize that these problems are not limited to any age group and want to help everybody we can.<p>We would love to hear from all of you. If you have faced problems with porn or have seen someone you know face this problem, feel free to share your experiences and feedback. Thanks!",
      "time": 1627390079,
      "title": "Launch HN: Atmana (YC S21) app to help cut down on compulsive porn usage",
      "type": "story"
    },
    {
      "by": "MathisGJ",
      "descendants": 1,
      "id": 27971727,
      "kids": [
        27971737
      ],
      "score": 1,
      "time": 1627389846,
      "title": "Show HN: Show your favorite NFTs on Twitter",
      "type": "story",
      "url": "https://show-my-nft.com/"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27971724,
      "score": 1,
      "time": 1627389826,
      "title": "Wanted: Browsers to help investigate online search result bias",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/jul/27/wanted-browsers-to-help-uncover-the-truth-about-online-search-result-bias"
    },
    {
      "by": "retskrad",
      "descendants": 0,
      "id": 27971719,
      "score": 1,
      "time": 1627389777,
      "title": "Apple Business Model: A Naive Nostalgic Look",
      "type": "story",
      "url": "https://mondaynote.com/apple-business-model-a-naive-nostalgic-look-71b52addef04"
    },
    {
      "by": "Klyonova",
      "descendants": 0,
      "id": 27971712,
      "score": 1,
      "time": 1627389748,
      "title": "TSMC Evaluates Germany Plan, but Intel One Step Ahead",
      "type": "story",
      "url": "https://techtaiwan.com/20210727/tsmc-germany-intel/"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 27971709,
      "score": 1,
      "time": 1627389733,
      "title": "Horner's method: Algorithm for polynomial evaluation rediscovered multiple times",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zEvfkSuPqWk"
    },
    {
      "by": "chrismore",
      "descendants": 1,
      "id": 27971698,
      "kids": [
        27971699
      ],
      "score": 1,
      "time": 1627389679,
      "title": "Show HN: Fusebot – Ultimate developer bot for Discord and Slack",
      "type": "story",
      "url": "https://github.com/fusebit/fusebot/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27971688,
      "score": 4,
      "time": 1627389599,
      "title": "IBM Z/OS v2.5, Next-Gen Operating System Designed for Hybrid Cloud and AI",
      "type": "story",
      "url": "https://newsroom.ibm.com/2021-07-27-Announcing-IBM-z-OS-V2-5,-Next-Gen-Operating-System-Designed-for-Hybrid-Cloud-and-AI"
    },
    {
      "by": "chewz",
      "descendants": 0,
      "id": 27971686,
      "score": 2,
      "time": 1627389592,
      "title": "2021 Recovery Of Great Barrier Reef Coral Cover",
      "type": "story",
      "url": "https://www.aims.gov.au/reef-monitoring/gbr-condition-summary-2020-2021"
    }
  ]
}