{
  "stories": [
    {
      "by": "gainof-function",
      "descendants": 0,
      "id": 28885227,
      "score": 1,
      "time": 1634353718,
      "title": "How to Deal with Complexity Like a Pilot (Part 2)",
      "type": "story",
      "url": "https://franklinfaraday.medium.com/how-to-deal-with-complexity-like-a-pilot-part-2-8834613d4966"
    },
    {
      "by": "w1n7ermu73",
      "descendants": 0,
      "id": 28885223,
      "score": 1,
      "time": 1634353689,
      "title": "Odyssey – an experimental operating system for x86 and ARM",
      "type": "story",
      "url": "https://github.com/aweeraman/odyssey"
    },
    {
      "by": "jsperson",
      "descendants": 0,
      "id": 28885198,
      "score": 1,
      "time": 1634353275,
      "title": "The Complete Technical Guide for Adhesive Tape",
      "type": "story",
      "url": "https://www.echotape.com/blog/complete-technical-guide-adhesive-tape/"
    },
    {
      "by": "brazzy",
      "descendants": 0,
      "id": 28885189,
      "score": 1,
      "time": 1634353193,
      "title": "Fold a full Ryujin 3.5 with Orihime algorithm",
      "type": "story",
      "url": "https://origami.abstreamace.com/2021/10/13/fold-a-full-ryujin-3-5-with-orihime-algorithm/"
    },
    null,
    {
      "by": "Wowfunhappy",
      "descendants": 0,
      "id": 28885178,
      "score": 1,
      "time": 1634353084,
      "title": "Hollywood loves this creepy bird call [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=DVFBUIGfcJk"
    },
    {
      "by": "evo_9",
      "descendants": 1,
      "id": 28885145,
      "kids": [
        28885209
      ],
      "score": 2,
      "time": 1634352690,
      "title": "HTC Vive Flow Announced: Compact $499 6DOF VR Headset",
      "type": "story",
      "url": "https://uploadvr.com/htc-vive-flow-announced/"
    },
    {
      "by": "vaughan",
      "descendants": 0,
      "id": 28885144,
      "score": 2,
      "text": "Microsoft owns Github. Github maintains Electron. Microsoft are moving Teams to use WebView2, sharing a single Chromium instance for all apps, reducing memory usage, which is the most common complaint for Electron.<p>This architecture has been obvious to everyone for a long time. Every Electron app could essentially be a webpage but with enhanced native API access.<p>Electron&#x27;s future seems bleak. ESM support hasn&#x27;t materialized (https:&#x2F;&#x2F;github.com&#x2F;electron&#x2F;electron&#x2F;issues&#x2F;21457). WebView2 will not be available on macOS until late 2022 [it seems](https:&#x2F;&#x2F;github.com&#x2F;MicrosoftEdge&#x2F;WebView2Feedback&#x2F;issues&#x2F;645#issuecomment-921551618).<p>Seems we are in one of these awkward transition periods, where you are forced to start a project on technology that you know will be deprecated in the near future <i>sigh</i>.<p>Anyone have insight&#x2F;predictions?",
      "time": 1634352677,
      "title": "Ask HN: What does the future hold for Electron?",
      "type": "story"
    },
    {
      "by": "timpattinson",
      "descendants": 0,
      "id": 28885130,
      "kids": [
        28885135
      ],
      "score": 1,
      "time": 1634352400,
      "title": "Memory Forensics R&D Illustrated: Detecting Mimikatz's Skeleton Key Attack",
      "type": "story",
      "url": "https://volatility-labs.blogspot.com/2021/10/memory-forensics-r-illustrated.html"
    },
    {
      "by": "digitcatphd",
      "descendants": 0,
      "id": 28885129,
      "score": 1,
      "text": "TD;DR &#x2F;&#x2F; Does technological advancements bring about a higher quality of life offset the negative consequences of the modern concept of a &#x27;dystopian society&#x27; brought about by climate change and the replacement of the human workforce with AI?<p>If one accepts<p>(1) &#x27;chemical based happiness&#x27; arguments, and endorphins are triggered from pleasurable activities, while cortisol levels from suffering<p>(2) ones &#x27;quality of life&#x27; is measured by their happiness level<p>the question becomes<p>- are people in-fact &#x27;happier&#x27; or otherwise put &#x27;better off&#x27; from the advancement technology promises, or will a potentially &#x27;dystopian society&#x27; brought about by climate change and the diminishing relevancy of a human labor force leading to a demise of our overall &#x27;well being&#x27;, leading to an ironic mental health demise?<p>- there are two arguments for the ancestors &#x27;better off&#x27; belief (3) that those who lives before us, at any point in time, were happier. (4) that generally, over the long-term people in the future are happier based on (1)<p>- advancements in things like universal access to basic nutritional diets has never been more accessible, excluding societal structures and economic status, by observing the advancement of the global supply chain, which is something started to be appreciated during the Industrial Revolution and marginally so with the agrarian age before it, which is a point for (1)<p>(A) healthcare advancements are a recent development, a person born with something as mild as seasonal allergies and poor eyesight would not be afforded the luxuries of glasses and then later marginally so, laser eye surgery.<p>(B) a reasonable argument for (3), is that though many may be better off, most are in-fact living worse off in extreme poverty, to a degree in which they have less plentiful access to resources than their ancestors - if this argument is true, then we are arguably already there.<p>Among other reasons, if one agrees that they are, the question becomes does the advantage of these factors, to an extent that scaled will lead to the ability to regulate (1) completely and be in perfect health, outweigh the suffering from a dystopian society impacted by climate change and if not, will it for a period of time?<p>It is noted that technological advancement is not perfectly correlated to an environmental decline. Technology may advance at a far greater rate and solve these problems before they occur, or it could be drastically delayed and several generations may be worse off than prior generations - the same may be true for (1) given (A)",
      "time": 1634352397,
      "title": "Ask HN: Is a concept of a dystopian society necessarily negative?",
      "type": "story"
    }
  ]
}