{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28877058,
      "score": 1,
      "time": 1634301524,
      "title": "Bitcoin: Who owns it, who mines it, who’s breaking the law",
      "type": "story",
      "url": "https://mitsloan.mit.edu/ideas-made-to-matter/bitcoin-who-owns-it-who-mines-it-whos-breaking-law"
    },
    {
      "by": "miguelmurca",
      "descendants": 0,
      "id": 28877031,
      "score": 1,
      "time": 1634301242,
      "title": "Wikipedia: Bauhaus",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bauhaus"
    },
    {
      "by": "steve_g",
      "descendants": 0,
      "id": 28877028,
      "score": 1,
      "text": "I&#x27;m asking here because I know there are some smart optimization experts on HN.  I tried Reddit, but no joy.<p>In my production planning problem, I want to select around 1000 items from a set of 15000 items to process in a given day.  There are multiple constraints to satisfy and new items come in every day.  It’s very much like a multi-dimensional knapsack problem with some extra constraints.<p>Each item has its own identifier and they are truly unique items.  But they can be grouped for practical purposes so that (let’s say) 10 items could be represented by a single value and set of multi-dimensional costs.<p>I’d like to know whether it’s generally better for a MIP solver to represent selection of items by ten 0&#x2F;1 decision variables or one integer decision variable that must be &lt; 11 for ten items in a group.  I know if I use the ten variables I’d also need to do something to break symmetry of solutions – like maybe add a term to minimize items IDs in the objective function.<p>I’d appreciate any thoughts or pointers to good resources on this.  Thanks.",
      "time": 1634301219,
      "title": "Ask HN: 0/1 Decision variables vs. bounded integers for selection problem",
      "type": "story"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 28877024,
      "score": 1,
      "time": 1634301193,
      "title": "The case for minting a $1tn coin to deal with America’s debt ceiling",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2021/oct/15/the-case-for-minting-a-1tn-coin-to-deal-with-americas-debt-ceiling"
    },
    {
      "by": "sebisaacsinflow",
      "descendants": 0,
      "id": 28877003,
      "score": 1,
      "text": "Hey! We’re Seb, Levi, and George, co-founders of Inflow. We have built a self-help app for adults and adolescents to better manage ADHD.<p>Accessing treatment for ADHD is expensive, slow, and can be difficult for ADHD people to organize due to struggles with executive functioning. Inflow makes accessing many of the benefits of in-person ADHD therapy significantly more accessible and affordable.<p>Based on the principles of cognitive behavioral therapy, our app enables people to better understand ADHD and how it impacts them. It also gives people practical tools and helps them to develop the skills needed to better manage ADHD. This is combined with a welcoming community to share experiences and learnings.<p>Half of our team is neurodiverse and our co-founder Dr George Sachs, as well as having ADHD, has over 10 years of experience treating people with ADHD through CBT. Consequently, we are aware of the impact of ADHD on day-to-day life and how underserved the ADHD community has been in terms of accessible and affordable support. Levi also previously worked for Babylon Health to develop products for chronic condition management and saw how technology could enable access to care.<p>The core of the app is a CBT-based program that provides short, daily exercises as well as tools to develop helpful habits and skills. The program is broken down into different modules each focusing on specific areas ADHDers may find challenging such as time management, organization and impulsivity. Our community lets people connect with and learn from a range of other diverse individuals with ADHD in a safe and stigma-free environment. We offer daily live events with specialist ADHD psychologists and coaches including topic deep dives, Q&amp;A, coworking sessions and group meditations.<p>Other features include prioritization tools, which let you set daily goals to prioritize your most important tasks, and guided journaling—prompts and triggers to help you better understand yourself and your behaviors. We’re just getting started and have a range of exciting new features in the works including routine building tools, accountability check-ins with a real coach, progress tracking, group-based challenges, and more.<p>The average cost of an in-person ADHD CBT session in the US is $200-300 ($10k-$16k&#x2F;year). This is compared to Inflow’s cost of $95.99&#x2F;year. Of course, no app is a direct replacement for in-person therapy but it offers a far more accessible and cost effective solution which allows many more people to get the help that they need.<p>You can download our app here: <a href=\"https:&#x2F;&#x2F;inflow.app.link&#x2F;0FXmBEAWjkb\" rel=\"nofollow\">https:&#x2F;&#x2F;inflow.app.link&#x2F;0FXmBEAWjkb</a>. We offer a one-week free trial followed by a monthly or yearly subscription.<p>If you’ve been trying to or previously had difficulty accessing treatment for ADHD we’d love to learn about your experiences. If you do try the app, please let us know any improvements or additional features you’d like to have. Thank you!",
      "time": 1634300938,
      "title": "Launch HN: Inflow (YC S21) – Self-help app for ADHD people",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 28876992,
      "kids": [
        28876996
      ],
      "score": 2,
      "time": 1634300830,
      "title": "Reddit crowd's new tactic in war with Wall Street:cutting brokers out altogether",
      "type": "story",
      "url": "https://www.marketwatch.com/story/the-reddit-crowd-has-found-a-new-tactic-in-the-war-against-wall-street-cutting-brokers-out-altogether-11634250783"
    },
    {
      "by": "andras_gerlits",
      "descendants": 0,
      "id": 28876986,
      "score": 1,
      "text": "I&#x27;ve built software which can provide distributed global ordering and mutexes over even geographically distributed kafka topics.<p>I believe I can bring together the monolith-people with the microservice-people by reconciling the benefits of both approaches.<p>This is an &quot;easy to access&quot; article on my project:<p>https:&#x2F;&#x2F;medium.com&#x2F;me&#x2F;stats&#x2F;post&#x2F;6a1d11edc1cd<p>This is one on CAP Theorem and how it applies to us<p>https:&#x2F;&#x2F;andrasgerlits.medium.com&#x2F;cap-and-us-9e0734cbfe1e<p>AMA",
      "time": 1634300771,
      "title": "I automated my work as a distributed systems consultant by inventing new theory",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 28876976,
      "score": 1,
      "time": 1634300678,
      "title": "Uber Freight boss says 'We're living in shipping Armageddon'",
      "type": "story",
      "url": "https://www.businessinsider.com/shipping-crisis-supply-chain-uber-logistics-boss-armageddon-2021-10"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28876970,
      "score": 1,
      "time": 1634300636,
      "title": "Petition for Naturalization for Antonio Rudolfo Quinn",
      "type": "story",
      "url": "https://catalog.archives.gov/id/595184"
    },
    {
      "by": "kjhughes",
      "descendants": 0,
      "id": 28876951,
      "score": 1,
      "time": 1634300459,
      "title": "Work with PDF files right in the browser",
      "type": "story",
      "url": "https://blog.adobe.com/en/publish/2021/10/12/work-with-pdf-files-right-in-your-browser.html"
    }
  ]
}