{
  "stories": [
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31319959,
      "score": 1,
      "time": 1652131482,
      "title": "In wink to Ukraine, Britain, Macron suggests new European entity",
      "type": "story",
      "url": "https://www.reuters.com/world/europe/wink-ukraine-britain-macron-suggests-new-european-entity-2022-05-09/"
    },
    {
      "by": "ttyp3",
      "descendants": 0,
      "id": 31319948,
      "score": 1,
      "time": 1652131435,
      "title": "Bitcoin drops below $33,000 to hit lowest level since July 2021 after sell-off",
      "type": "story",
      "url": "https://www.cnbc.com/2022/05/08/bitcoin-drops-below-35000-over-the-weekend-extending-fridays-losses.html"
    },
    {
      "by": "yvana",
      "descendants": 0,
      "id": 31319942,
      "score": 1,
      "text": "Prêmio destaca profundo compromisso da OpenText com a parceria e a inovação e soluções que aprimoram a experiência do cliente<p>Ontário, 09 de maio de 2022 – A OpenText™ (NASDAQ: OTEX), (TSX: OTEX) recebeu o SAP® Pinnacle Award 2022 na categoria Partner Solution Success, reconhecendo as contribuições como parceiro SAP.<p>Anualmente, a SAP premia os principais parceiros que se destacaram no desenvolvimento e no crescimento de sua parceria com a empresa e em ajudar os clientes a funcionar melhor. Os vencedores e os finalistas em 22 categorias foram escolhidos com base em recomendações da SAP, feedback de clientes e indicadores de desempenho.<p>“Com o SAP Pinnacle Awards, reconhecemos os parceiros de alto desempenho que se destacaram em ajudar os clientes a se tornarem as empresas mais bem administradas”, comenta Christian Klein, CEO da SAP SE. “Os parceiros vencedores foram escolhidos com base em seu compromisso com a criação de valor para o cliente, crescimento exponencial e simplificação. Juntos, apoiamos nossos clientes em sua jornada para se tornarem empresas inteligentes e sustentáveis.”<p>“A OpenText e a SAP estão centradas em inovações baseadas em nuvem, ajudando as maiores organizações do mundo a se transformarem em negócios digitais, elevando todos por meio de informações”, destaca Mark J. Barrenechea, CEO e CTO da OpenText. “É uma honra receber novamente o SAP Pinnacle Award for Partner Solution Success. OpenText e SAP Clouds são as plataformas para o futuro, criando experiências atraentes aos clientes.”<p>O prêmio na categoria Partner Solution Success reconhece uma forte parceria no fornecimento de soluções que atendem às necessidades e desafios importantes dos clientes. As SAP Solution Extensions da OpenText ajudam os clientes a melhorar suas eficiências operacionais, ampliando o valor das soluções RISE with SAP e SAP® SuccessFactors®. Este é o 17º Prêmio Pinnacle da OpenText em 14 anos, demonstrando a dedicação da organização à parceria, experiência do cliente e excelência.<p>Os SAP Pinnacle Awards destacam parceiros ilustres para reconhecer sua dedicação ao trabalho em equipe, inovação excepcional e capacidade de ajudar os clientes a atingir seus objetivos.<p>Sobre a OpenText\nA OpenText, The Information Company™, permite que as organizações obtenham insights por meio de soluções de gerenciamento de informações líderes de mercado, fornecidas pelo OpenText Cloud Editions. Para obter mais informações sobre OpenText (NASDAQ: OTEX, TSX: OTEX), visite www.opentext.com.br.<p>Contato para imprensa\nVianews Comunicação\nYvana Crizanto – 91 98138-7691\nyvana.crizanto@vianews.com.br\nRosa Pellegrino – 11 99507-1184\nrosa.pellegrino@vianews.com.br",
      "time": 1652131420,
      "title": "OpenText é reconhecida por contribuições como parceiro com PRêmio SAP Pinnacle",
      "type": "story"
    },
    {
      "by": "steverydz",
      "descendants": 0,
      "id": 31319929,
      "score": 1,
      "time": 1652131356,
      "title": "Git commit messages: Why or what?",
      "type": "story",
      "url": "https://steverydz.com/2022/05/09/git-commit-messages:-why-or-what/"
    },
    {
      "by": "lalaland1125",
      "descendants": 2,
      "id": 31319920,
      "kids": [
        31319924,
        31319934
      ],
      "score": 3,
      "time": 1652131310,
      "title": "Day Trader Army Loses All the Money It Made in Meme-Stock Era",
      "type": "story",
      "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=0ba7046d-cfde-11ec-978a-494a4b575069&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNS0wOC9kYXktdHJhZGVyLWFybXktbG9zZXMtYWxsLXRoZS1tb25leS1pdC1tYWRlLWluLW1lbWUtc3RvY2stZXJh"
    },
    {
      "by": "ttyp3",
      "descendants": 0,
      "id": 31319916,
      "score": 1,
      "time": 1652131270,
      "title": "‘McEnroe vs. McEnroe’ the first tennis match between a person and their avatar",
      "type": "story",
      "url": "https://techcrunch.com/2022/05/07/espn-debuts-mcenroe-vs-mcenroe-the-first-ever-tennis-match-between-real-person-and-their-virtual-avatar/"
    },
    {
      "by": "airstrike",
      "descendants": 0,
      "id": 31319901,
      "score": 1,
      "time": 1652131213,
      "title": "Accidental Calling After Hanging Up on iPhone",
      "type": "story",
      "url": "https://discussions.apple.com/thread/253557809"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31319886,
      "score": 3,
      "time": 1652131095,
      "title": "Biden: High-speed internet is not a luxury. It’s a necessity",
      "type": "story",
      "url": "https://twitter.com/POTUS/status/1523735713245802500"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31319885,
      "score": 2,
      "time": 1652131090,
      "title": "AV1 Video Codec",
      "type": "story",
      "url": "https://aomedia.org/av1/"
    },
    {
      "by": "cyrksoft",
      "descendants": 0,
      "id": 31319863,
      "score": 1,
      "text": "If you had all the time in the world, how would learn Computer Science? Some people have recommended SICP, while others tell me to avoid it as a beginner.<p>I have a lot of free time and discipline is not an issue. I want to learn out of personal interest, but I am also interested in hearing opinions for a learning path with a good career outlook.",
      "time": 1652130979,
      "title": "Ask HN: How would you learn Computer Science if time was not an issue?",
      "type": "story"
    }
  ]
}