{
  "stories": [
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 27907060,
      "score": 1,
      "time": 1626878998,
      "title": "2020’s Covid-19 Recession Only Lasted 2 Months",
      "type": "story",
      "url": "https://www.thebalance.com/2020-covid-19-recession-only-lasted-2-months-5193380"
    },
    {
      "by": "_-david-_",
      "descendants": 0,
      "id": 27907026,
      "score": 1,
      "time": 1626878868,
      "title": "EU Passes Emergency Law Allowing Companies to Screen Messages for Child Abuse",
      "type": "story",
      "url": "https://www.forbes.com/sites/emmawoollacott/2021/07/07/eu-passes-emergency-law-allowing-tech-companies-to-screen-messages-for-child-abuse"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 27906977,
      "score": 1,
      "time": 1626878675,
      "title": "Strychnos Nux-Vomica",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Strychnos_nux-vomica"
    },
    {
      "by": "reidjs",
      "descendants": 0,
      "id": 27906975,
      "score": 1,
      "time": 1626878658,
      "title": "Show HN: Schedule Daily Tweets from Markdown Files",
      "type": "story",
      "url": "https://github.com/reidjs/markdown-tweet-scheduler"
    },
    {
      "by": "Akcium",
      "descendants": 0,
      "id": 27906936,
      "score": 2,
      "time": 1626878512,
      "title": "Rocking Websites",
      "type": "story",
      "url": "https://httpster.net/2021/jun/"
    },
    {
      "by": "seriousquestion",
      "descendants": 1,
      "id": 27906899,
      "kids": [
        27906992
      ],
      "score": 4,
      "time": 1626878350,
      "title": "Watching the Watchmen",
      "type": "story",
      "url": "https://www.buzzfeednews.com/article/kenbensinger/michigan-kidnapping-gretchen-whitmer-fbi-informant"
    },
    {
      "by": "chirau",
      "descendants": 0,
      "id": 27906895,
      "score": 1,
      "time": 1626878341,
      "title": "Same data, different conclusions in hypothesis testing",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S0749597821000200?via%3Dihub"
    },
    {
      "by": "kalleth",
      "descendants": 0,
      "id": 27906886,
      "score": 4,
      "time": 1626878326,
      "title": "Planning and estimating large-scale software projects",
      "type": "story",
      "url": "https://tomrussell.co.uk/writing/2021/07/19/estimating-large-scale-software-projects.html"
    },
    {
      "by": "shankarro",
      "descendants": 0,
      "id": 27906861,
      "score": 1,
      "time": 1626878213,
      "title": "One in four women with ADHD has attempted suicide",
      "type": "story",
      "url": "https://www.eurekalert.org/pub_releases/2020-12/uot-oif121520.php"
    },
    {
      "by": "llcrabtree",
      "descendants": 2,
      "id": 27906787,
      "kids": [
        27907047,
        27906916
      ],
      "score": 9,
      "text": "Hi HN, we’re Laura, Max, and Aaron, the founders of Epsilon3 (<a href=\"https:&#x2F;&#x2F;www.epsilon3.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.epsilon3.io&#x2F;</a>). We make software to help space companies run billion-dollar missions and avoid costly and disastrous mistakes.<p>When you&#x27;re building a rocket or satellite, you have written checklists and procedures for how to test and operate it. Believe it or not, most companies still do this on paper or Microsoft Word. We are making this digital. Think of it like supercharged checklists plus version control (like Asana + Github). This is useful for the space industry and anyone else with complex testing and operational workflows.<p>There is massive growth right now in the number of space startups and of spacecraft and people launching into space. Payloads are being launched multiple times per day; you don’t hear about most of those on the news. There are so many companies building amazing technology for space (hotels, debris removal, construction robots, etc.). But to support this growth and keep everyone safe, the industry needs massively better software than the inefficient and error-prone stuff that’s out there now. U.S. space mission failures have cost $18.6B ($31B worldwide), and the average company wastes $400,000 in engineering hours per year managing procedures inefficiently.<p>We are a team of engineering and design leaders from SpaceX, Google, Northrop Grumman, and Stanford. I spent 11 years at SpaceX and 5 years at Northrop working on spacecraft operations. I’ve taken part in over 100 launches and was the lead trainer for astronauts who went to the space station and back last year. I’ve seen what works and what doesn’t when it comes to software tools and managing operations.<p>Starting Epsilon3 came as a surprise—we were surprised that it was still necessary! I had always envisioned a unified set of tools to operate vehicles and complex engineering systems, and assumed that one existed that I just hadn’t come across yet. But after I left SpaceX and began talking to my colleagues and friends in the industry, it became clear that the tools they wanted (and that I wanted too) just didn’t exist yet. In calls with colleagues across the industry, I heard “I’d use that if it existed,” “I’ve looked for that but never found anything remotely close to what I’d want,” “If you build it, people will use it,” and “Wow, that would be great, tell me when you have an MVP.” So we were lucky to start from the beginning with the knowledge that people were in need of our platform.<p>Our software brings complex operational procedures into a modern web-based platform, built using React, Node, CouchDB, Flask, and Supabase, and running on AWS GovCloud for ITAR compliance. We support the entire life cycle of a project from integration and testing through live operations. With Epsilon3, you can create, revise, and track procedures online with critical mission data collaboratively, all in one place and in a standardized way. Real-time synchronization of procedure status and updates guarantee that everyone’s always on the same page and knows who is doing what, when, and where.<p>This may not sound like the hardest software problem out there, but this industry has a lot of challenges that more ordinary project management tools can’t handle, which is why these projects have stuck with Microsoft Word and spreadsheets (and even paper) for so long. Real-time synchronization of data and user interfaces across earth and space with low latency and high reliability is hard. Supporting complex workflows and detailed tracking while also maintaining simplicity and delightfulness of user experience is also hard. There is also a lot of telemetry and commanding data involved, and finding ways to display and visualize it is tricky. There are mission-critical security and reliability requirements. Finally, everyone’s workflows and data are in different formats and have different needs, and finding generalized solutions and methodologies to support all of them is challenging.<p>Our vision is that when operating your system, you’ll need only two tools to manage it: your C2 (command and control) system, and Epsilon3. You won’t need to communicate via email, chat, tickets, etc. anymore. You also won’t need to store your data on a hard drive or manage an Excel spreadsheet. This will not only simplify your operation, but it will make it easier for the next generation of operators to come up to speed quickly and enable future spacecraft automation.<p>While doing hot fire testing of new rocket engines, one of our customers said, “Epsilon3 makes some incredible software that we use for our engine test operations (among other things) to make sure we don’t blow ourselves up.” Running hardware testing for new robotics, transportation, and spacecraft hardware, another customer said, “It&#x27;s made running our tests much easier and more systematic.” Those sorts of comments are what we hope to achieve industry-wide!<p>A video demo is available at <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;3AItU2w\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;3AItU2w</a>. We’d love to hear your thoughts, feedback, and questions in this, uh, space!<p>p.s. There was a small HN thread about us a few months ago (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=26506819\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=26506819</a>). We’ve made significant progress since then.",
      "time": 1626877871,
      "title": "Launch HN: Epsilon3 (YC S21) – Software for spacecraft and complex operations",
      "type": "story"
    }
  ]
}