{
  "stories": [
    {
      "by": "drewmol",
      "descendants": 1,
      "id": 32007419,
      "kids": [
        32007420
      ],
      "score": 1,
      "time": 1657145152,
      "title": "The Riddle That Seems Impossible Even If You Know the Answer",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=iSNsgj1OCLA"
    },
    {
      "by": "vo2maxer",
      "descendants": 0,
      "id": 32007389,
      "score": 1,
      "time": 1657144997,
      "title": "Mirror neurons 30 years later: implications and applications",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S1364661322001346"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32007388,
      "score": 1,
      "time": 1657144992,
      "title": "Childcare: What the Science Says",
      "type": "story",
      "url": "https://criticalscience.medium.com/on-the-science-of-daycare-4d1ab4c2efb4"
    },
    {
      "by": "vo2maxer",
      "descendants": 0,
      "id": 32007360,
      "score": 1,
      "time": 1657144810,
      "title": "The Paradoxes of Nostalgia",
      "type": "story",
      "url": "https://ravenmagazine.org/magazine/the-paradoxes-of-nostalgia/"
    },
    {
      "by": "herbertl",
      "descendants": 0,
      "id": 32007342,
      "score": 1,
      "time": 1657144690,
      "title": "Dumb luck? No way. The billion-dollar smarts of the 'For Dummies' empire",
      "type": "story",
      "url": "https://www.smh.com.au/culture/books/more-than-dumb-luck-how-for-dummies-became-an-empire-by-showing-people-what-to-do-20200514-p54t3o.html"
    },
    {
      "by": "tommywiseausmom",
      "descendants": 0,
      "id": 32007336,
      "score": 1,
      "time": 1657144660,
      "title": "Virgin Galactic buys two more motherships",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/07/looking-to-the-future-virgin-galactic-purchases-2-more-motherships/"
    },
    {
      "by": "bradlys",
      "descendants": 0,
      "id": 32007321,
      "score": 1,
      "text": "I’m looking for a wife. I’ve basically lost all drive these last few months to go solo. I quit my job and started traveling with the intention of moving to NYC after I&#x27;m done traveling solely to find a partner. The stock market crash on growth stocks definitely hasn’t helped my enthusiasm here as it looks like I’m grinding <i>alone</i> for <i>another</i> decade. How does one go about finding a high earning partner? It doesn’t have to be in tech - I’m open to law, medicine, finance, etc. I’m looking for someone who is earning similar FAANG comp but I have no idea where to find these people. It seems like online dating has them <i>but</i> I’m not physically attractive enough for online dating. I don’t know if that’s a market I can actually get through to but I feel it’s my only real option. At this point - I’m thinking of forking over $50k on image consultation, photos, personal training, and surgery to get me closer. I have already had surgery but it seemed to be inconsequential - so, I am not optimistic here.<p>I’m practically ready to settle for someone who wears a bag over their face and is a mute in order to just get by in life as long as they can pay the bills but I can’t even find that. Where do these people exist? How do you find a high earning partner <i>who is single</i>? I’ve found many that aren’t single but none that are.<p>I’m also wanting kids and I’m totally willing to be a SAHP. If mommy wants to play corporate wargames, be my guest. I’ll even pay for a surrogate if she’s worried about pregnancy woes! (Please get me out of corporate wargames!)<p>I suspect many of you - like most of my peers - met your partner in college, grad school, or very shortly thereafter. For those who didn&#x27;t though (and in the last five years preferably since the dating market has changed drastically in the last 5-10 years) - any tips?",
      "time": 1657144603,
      "title": "Ask HN: Losing the drive to do everything alone",
      "type": "story"
    },
    {
      "by": "brunojppb",
      "descendants": 0,
      "id": 32007283,
      "score": 1,
      "time": 1657144349,
      "title": "Hobbies for the Hell of It",
      "type": "story",
      "url": "https://bradfrost.com/blog/post/hobbies-for-the-hell-of-it/"
    },
    {
      "by": "thepra",
      "descendants": 0,
      "id": 32007271,
      "score": 1,
      "text": "I just realized that I don&#x27;t have all the time in the world to test through the audience this newish private discussiosn concept behind this project&#x2F;platform&#x2F;PWA, so I decided to continue its support and development not for profit and see where it&#x27;ll lead, with a new experiment&#x2F;concept of confrontational contextual discussion coming soon called &quot;collAnon You&amp;Me&quot;",
      "time": 1657144301,
      "title": "Going Freemium with CollAnon v2.0.4",
      "type": "story"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 32007243,
      "score": 3,
      "time": 1657144102,
      "title": "Tech has made cars “a candy store of distraction”",
      "type": "story",
      "url": "https://finance.yahoo.com/news/killing-people-technology-made-car-120013196.html"
    }
  ]
}