{
  "stories": [
    {
      "by": "awb",
      "descendants": 0,
      "id": 30471593,
      "score": 1,
      "time": 1645818869,
      "title": "Turkey's inflation seen jumping to 53% in February",
      "type": "story",
      "url": "https://www.reuters.com/markets/asia/turkeys-inflation-seen-jumping-53-february-2022-02-25/"
    },
    {
      "by": "armagon",
      "descendants": 0,
      "id": 30471557,
      "score": 1,
      "text": "The gist of this question is, &quot;how does one prep to keep technology operable?&quot;<p>Imagine a disaster causes widespread collapse, where resources are no longer easily available, power and internet access is erratic or non-existent, and then things calm down enough to where the necessities of life are available and society tries to resume functioning.<p>Now, suppose you&#x27;d like to make computers work. What sort of things would you need?Power, obviously, or a way to charge batteries. What else?<p>What if you wanted to have communication with other people, or perhaps data communication? Would you want packet radio? HAM gear?<p>What if you want to repair equipment? I don&#x27;t know if the computers in cars &quot;break&quot;, for example [not that I imagine fuel being available]. I wonder about what sort of needs there might be to repurpose gear.<p>What if you need to keep an application running? Maybe you have a mesh network and people want a web app for some purpose. But, without documentation, it&#x27;d be incredibly tedious.<p>I can&#x27;t help but think I&#x27;ve seen a linux distro designed for this scenario, where you have binaries, and all the code, and all the toolchains, and all the documentation.<p>The right answer might be &quot;don&#x27;t bother&quot;, but I&#x27;m still curious.",
      "time": 1645818740,
      "title": "Ask HN: How to keep tech running in the apocalypse?",
      "type": "story"
    },
    {
      "by": "indigodaddy",
      "descendants": 1,
      "id": 30471546,
      "kids": [
        30471574
      ],
      "score": 1,
      "time": 1645818710,
      "title": "Useless use of cat isn’t useless",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=sAdmMoiz0SI"
    },
    {
      "by": "staccatomeasure",
      "descendants": 0,
      "id": 30471541,
      "score": 1,
      "time": 1645818694,
      "title": "Has Russia Launched a Cyber Attack?",
      "type": "story",
      "url": "https://twitter.com/MacaesBruno/status/1497296957957672970"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 30471539,
      "score": 1,
      "time": 1645818686,
      "title": "The Russian invasion of Ukraine will have myriad impacts on spaceflight",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/02/the-russian-invasion-of-ukraine-will-have-myriad-impacts-on-spaceflight/"
    },
    {
      "by": "samstave",
      "descendants": 1,
      "id": 30471534,
      "kids": [
        30471581
      ],
      "score": 1,
      "time": 1645818670,
      "title": "Interesting pod-cast discussing digital currency and vaccine passports goal",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9czRY-tWPiE"
    },
    {
      "by": "kaycebasques",
      "descendants": 0,
      "id": 30471497,
      "score": 1,
      "text": "In technical writing we have a concept of reviewing a draft in passes. First you review for technical accuracy. Then you review for completeness. Then you review for clarity. And so on. The key idea is that with each pass you only focus on that specific aspect of writing quality. I&#x27;m wondering if you all employ a similar technique for code reviews, what kinds of passes you do, and the usual order of passes?",
      "time": 1645818514,
      "title": "Ask HN: Do you review code in “passes”?",
      "type": "story"
    },
    {
      "by": "tasoeur",
      "descendants": 0,
      "id": 30471491,
      "score": 1,
      "text": "Hey HN crowd.<p>I&#x27;m a new manager in a relatively large company (think FAANG) and just went through a training for employee performance training.<p>For each direct report, we are expected to provide a rating (meet expectations, does not meet, exceed etc.), but in addition to that, we also need to &quot;rank&quot; each individual within each rating, with the goal of helping our director do a &quot;calibration&quot; that will basically curve overall ratings at the org&#x2F;company level (meaning that someone who meets expectations may be pushed down to &quot;does not meet&quot;, purely to match some statistics).<p>My knee jerk reaction here was that this was pretty unethical, after all, if someone does meet expectations and the data is there, it should be possible to give them the corresponding rating &#x2F; comp increase? But then after talking with other manager friends from other companies, it does seem to be something that a lot of companies do to some extent...<p>So here comes my question: what do you guys think of this practice? Is it an acceptable business practice? Should such companies be named and shamed?",
      "time": 1645818498,
      "title": "Ask HN: Thoughts on Stack Ranking for Perf Reviews?",
      "type": "story"
    },
    {
      "by": "matbatt38",
      "descendants": 0,
      "id": 30471485,
      "score": 1,
      "time": 1645818479,
      "title": "Anti-Authoritarian Perspectives in Ukraine",
      "type": "story",
      "url": "https://crimethinc.com/2022/02/15/war-and-anarchists-anti-authoritarian-perspectives-in-ukraine"
    },
    {
      "by": "MrYellowP",
      "descendants": 0,
      "id": 30471483,
      "score": 1,
      "time": 1645818477,
      "title": "Daily concurrence of global terrorism and solar-geomagnetic activity (1970-2018)",
      "type": "story",
      "url": "https://www.researchgate.net/publication/352197833_Geopsychology_of_instrumental_aggression_daily_concurrence_of_global_terrorism_and_solar-geomagnetic_activity_1970-2018"
    }
  ]
}