{
  "stories": [
    {
      "by": "janandonly",
      "descendants": 0,
      "id": 32011962,
      "score": 1,
      "time": 1657188239,
      "title": "The perfect playlist with music for programming or thinking, NO VOCALS",
      "type": "story",
      "url": "https://open.spotify.com/playlist/75DHV3ljSZdGdxzDbbYjmY"
    },
    {
      "by": "clove",
      "descendants": 0,
      "id": 32011926,
      "score": 1,
      "time": 1657187965,
      "title": "Boris Johnson to resign as UK prime minister",
      "type": "story",
      "url": "https://seekingalpha.com/news/3854862-boris-johnson-to-resign-as-uk-prime-minister"
    },
    {
      "by": "snird",
      "descendants": 0,
      "id": 32011919,
      "score": 1,
      "time": 1657187940,
      "title": "Crystal Lang 1.5.0 Released",
      "type": "story",
      "url": "https://github.com/crystal-lang/crystal/releases/tag/1.5.0"
    },
    {
      "by": "repox",
      "descendants": 0,
      "id": 32011905,
      "score": 1,
      "text": "Are anyone else experiencing issues with Apple Developer Enterprise Program renewals not being processed in time?<p>This morning we opened up roughly ~400 stores with iPad POS apps that couldn&#x27;t be started nor updated due to a delay in the processing of renewals for Apple Developer Enterprise Program. We have a external partner who is caught in the same sitation.<p>We&#x27;ve been in contact with Apple who tells us that they will give us an update latest next week.<p>Are we just unlucky or is this a bigger issue than I think?",
      "time": 1657187866,
      "title": "Ask HN: Apple Developer Enterprise Program renewals not being processed in time?",
      "type": "story"
    },
    {
      "by": "the-mitr",
      "descendants": 0,
      "id": 32011904,
      "score": 1,
      "time": 1657187858,
      "title": "First commercial sand battery begins energy storage in Finland",
      "type": "story",
      "url": "https://newatlas.com/energy/sand-battery-polar-night/"
    },
    {
      "by": "dragonsh",
      "descendants": 0,
      "id": 32011866,
      "score": 1,
      "time": 1657187567,
      "title": "Sonic-Pi release 4.0 – Get ready to Jam with v4 of Sonic Pi",
      "type": "story",
      "url": "https://github.com/sonic-pi-net/sonic-pi/releases/tag/v4.0.0"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32011853,
      "score": 1,
      "time": 1657187458,
      "title": "The deep, long-lasting, and sometimes bizarre symbolism of the Eye of Horus",
      "type": "story",
      "url": "https://www.zmescience.com/science/the-deep-long-lasting-and-sometimes-bizarre-symbolism-of-the-eye-of-horus/"
    },
    {
      "by": "tux1968",
      "descendants": 0,
      "id": 32011842,
      "score": 2,
      "time": 1657187374,
      "title": "Ruffle: WebAssembly Flash Player Emulator",
      "type": "story",
      "url": "https://ruffle.rs/demo/"
    },
    {
      "by": "heikrana",
      "descendants": 0,
      "id": 32011832,
      "score": 1,
      "time": 1657187281,
      "title": "Why its time to move away from Google Analytics",
      "type": "story",
      "url": "https://blog.simpleanalytics.com/why-its-time-to-move-away-from-google-analytics"
    },
    {
      "by": "Yamy",
      "descendants": 0,
      "id": 32011808,
      "score": 1,
      "text": "Recently, “Apache ShardingSphere: A Holistic and Pluggable Platform for Data Sharding”, co-authored by the Apache ShardingSphere community, SphereEx Lab and the Department of Computer Science of Chongqing University, has been accepted by The International Conference on Data Engineering (ICDE), one of the top international conferences on data engineering and databases. This conference paper is the first one focusing on data sharding in the database industry.<p>ICDE is a top-level academic conference on databases and data mining, as well as the flagship conference of the Institute of Electrical and Electronics Engineers (IEEE), the world’s largest technical professional organization for the advancement of technology. ICDE, ACM SIGMOD Conference and International Conference on Very Large Data Bases are known as the top three data management and database conferences in the world.<p>This paper&#x27;s publication represents the culmination of 5-year of R&amp;D and implementation testing for Apache ShardingSphere guided by its Database Plus development concept. The acceptance of this paper stands as a testament of the acknowledgment of Database Plus, Apache ShardingSphere’s enhanced computing engine and plugin-oriented architecture by the academic community.<p>Thanks to the acceptance of this paper, our community is proud to announce that our efforts have led to innovative breakthroughs in core database technologies.<p>In this paper, the co-authors propose that: considering that today relational databases that are not scalable and efficient enough to solve high concurrency problems still dominate online transaction processing and that NewSQL databases could lead to additional training costs, the database middleware Apache ShardingSphere becomes a very friendly and efficient way to connect and manage multiple databases.<p>Why Did We Choose to Improve the Database Ecosystem Rather Than Creating a New Database?<p>The aim of Apache ShardingSphere is to better utilize the computing and storage capabilities of relational databases in distributed scenarios, rather than implementing a new type of relational database.<p>So far, as relational databases are still the best choice for complete transactions, they are often used to handle online transaction processing. However, the relational database is designed for a single machine. In other words, at the initial stage developers did not take big data into account. In short, relational databases are less scalable to efficiently solve high concurrency problems.<p>In this context, NewSQL came into being. However, New means this type of database is developed from scratch. Although it is suitable for current application scenarios, it has not been tested in enough real production environments, and for enterprise maintainers, it has a steep learning curve.<p>Apache ShardingSphere just released its official version 5.1.0. With this update, Apache ShardingSphere has also shifted its positioning to Database Plus with the desire to build the standard and ecosystem above different databases. Apart from enhanced capabilities, the Database Plus architecture also opens up a highly scalable database ecosystem for developers and users.\nConclusion<p>Apache ShardingSphere has been adopted and tested by hundreds of enterprises, from the Internet, gaming, banking, insurance &amp; securities, manufacturing, telecommunications, new retail sectors to the public sector, etc., and has been tested in multiple production scenarios.<p>With its first paper being included in ICDE, Apache ShardingSphere’s concept has now been recognized by the academic community. The paper will provide new solutions for the development of the database industry and the improvement of data processing efficiency.\nWe hope this paper and Apache ShardingSphere’s exploration can inspire developers and scholars inthe database field to build databases into a data service platform that is closer to enterprise business scenarios.",
      "time": 1657187084,
      "title": "First Academic Paper by Apache ShardingSphere Accepted by ICDE",
      "type": "story"
    }
  ]
}