{
  "stories": [
    null,
    {
      "by": "herpderperator",
      "descendants": 0,
      "id": 29752839,
      "score": 1,
      "time": 1640987048,
      "title": "Bank accidentally deposits $176M into people's accounts on Christmas Day",
      "type": "story",
      "url": "https://www.cnbc.com/2021/12/31/santander-accidentally-put-millions-into-random-accounts-on-christmas-day.html"
    },
    {
      "by": "saiya-jin",
      "descendants": 0,
      "id": 29752830,
      "score": 1,
      "text": "Hi,\nCan somebody please explain&#x2F;point me to some tool that can explain what I saw today?<p>It was cca 17:20 CET local time, location is 49.054653, 20.212259, I was looking north with maybe 80° angle (so almost vertical but slightly towards north), and I&#x27;ve noticed a straight line of satellites, flying from west towards east. I could count at least 40 from the moment I&#x27;ve noticed them till the point a small cloud came and obscured that part of the sky. After it went away few minutes later, the show was over. No clue what was happening before I gazed randomly up and noticed it.<p>They were 100% satellites, uniform luminostity of all of them - cca like a faintly visible stars, they were spaced evenly in straight line and flew at same speeds(with some uniform gaps sometimes, so I saw exactly 1&#x2F;2 were missing&#x2F;non visible). Also the speed has been quite significant, a plane flying cca 11km above goes slower through the sky (there were few up there to compare).<p>In best case there were around 10 of them visible in the same time - a literal belt of lights moving across the sky, appearing on my left and disappearing on my right. It felt pretty surreal, like I&#x27;ve teleported 50 years into the future where this is common sight and sky is overcrowded.<p>Maybe some Starlink batch of satellites aligned before they disperse into their own orbits? Or did I miss something and this is pretty common these days?",
      "time": 1640987008,
      "title": "Ask HN: Just saw 40 satellites flying in straight line one after another",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29752826,
      "score": 1,
      "time": 1640986976,
      "title": "Archaeological Dig Reignites Debate over the Old Testament’s Historical Accuracy",
      "type": "story",
      "url": "https://www.smithsonianmag.com/history/archaeological-dig-reignites-debate-old-testament-historical-accuracy-180979011/"
    },
    {
      "by": "setgree",
      "descendants": 0,
      "id": 29752823,
      "score": 1,
      "time": 1640986961,
      "title": "A Series of Rooms Occupied by Ghislaine Maxwell",
      "type": "story",
      "url": "https://granta.com/rooms-occupied-by-ghislaine-maxwell-chris-dennis/"
    },
    {
      "by": "brian-discord",
      "descendants": 0,
      "id": 29752818,
      "score": 1,
      "time": 1640986940,
      "title": "JavaScript Utility For decibel-based Volume Controls",
      "type": "story",
      "url": "https://discord.github.io/perceptual/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29752813,
      "score": 1,
      "text": "Hey fellow HNers! Few hours and it will be 2022 for me (Europe). Of course, I have some resolutions for my 2022. I would love if you could provide some help and guidance on how to achieve my goals.<p>1. I want to learn basic Japanese. This is maybe the 3rd attempt in 10 years. I started again with some Hiragana and Katagana, but I haven&#x27;t found the perfect course (online? Book?) to get going.<p>2. I want to get back at programming. I studied CS, did a lot of programming in Assembly, Basic, C, C++, Fortran77, PHP 4 and 5, Python, Java, Javascript, Ruby from ~1990 to ~2015. In particular, though, I want to be able to build my own online, text-based strategy game (something like Paperclips or A Dark Room). What&#x27;s the best way for an ex-programmer to do that?<p>3. I want to get back in shape: good exercise, good diet. I&#x27;m now in my mid 40s, 94kg, my ideal weight is ~82kg, and I probably need 3-4kg of more muscle, so I need to lose at least 10kg, better if it&#x27;s 14-15kg. What&#x27;s the absolute best way not just to lose it, but to keep it? I&#x27;ve been going between 95kg and 82kg a few times in the past decade, but I can&#x27;t seem to be able to stay at 82kg.<p>4. I want to have more meaningful friendships. Because of my lifestyle (moved from Italy to Luxembourg to Singapore to San Francisco to Italy in the past ~14 years), I found it hard to maintain friendships. Any tips? Guidance?<p>5. I am also working on my romantic relationship, but on that front... I keep doing it, every year, as I think it&#x27;s the most important thing in your life. In any case, if you have a tip or a secret for long-lasting relationships, I am (and I guess we all are) all ears. You are never perfect, but you strive to be.<p>I guess this is enough for now.<p>Edit: ah, work: I decided to keep it out of this, for now. I&#x27;m doing ok on that front and I&#x27;d rather get good advice for my personal stuff :)",
      "time": 1640986897,
      "title": "Ask HN: Best advice to help me achieve my 2022 goals?",
      "type": "story"
    },
    {
      "by": "notmuffin",
      "descendants": 0,
      "id": 29752800,
      "score": 1,
      "time": 1640986814,
      "title": "Threads you must re-read",
      "type": "story",
      "url": "https://twitter.com/heyeaslo/status/1476916079859363846"
    },
    {
      "by": "eigenhombre",
      "descendants": 0,
      "id": 29752784,
      "score": 1,
      "time": 1640986708,
      "title": "2021 Rewind: A Lawyer Becoming a Software Developer",
      "type": "story",
      "url": "https://otee.dev/2021/12/31/looking-back-2021.html"
    },
    {
      "by": "moviewise",
      "descendants": 0,
      "id": 29752781,
      "score": 1,
      "time": 1640986675,
      "title": "How to Comfort Someone Who Is Sad",
      "type": "story",
      "url": "https://moviewise.substack.com/p/how-to-comfort-someone-who-is-sad"
    }
  ]
}