{
  "stories": [
    {
      "by": "eecc",
      "descendants": 0,
      "id": 29348100,
      "score": 1,
      "time": 1637911021,
      "title": "Programmers should stop celebrating incompetence",
      "type": "story",
      "url": "https://world.hey.com/dhh/programmers-should-stop-celebrating-incompetence-de1a4725"
    },
    {
      "by": "Ericson2314",
      "descendants": 0,
      "id": 29348087,
      "score": 1,
      "time": 1637910716,
      "title": "Does stringent monetary policy produce equality?",
      "type": "story",
      "url": "https://www.crisesnotes.com/rana-foroohars-strange-case-for-raising-interest-rates-does-stringent-monetary-policy-really-produce-equality/"
    },
    {
      "by": "caseyf7",
      "descendants": 0,
      "id": 29348085,
      "score": 1,
      "text": "Software, digital newsletters, premium access to websites, etc?",
      "time": 1637910692,
      "title": "Ask HN: Any Digital Black Friday Deals to Recommend?",
      "type": "story"
    },
    {
      "by": "trabant00",
      "descendants": 0,
      "id": 29348049,
      "score": 1,
      "text": "This comment was inspired by a submission that has been flagged. While the context of the article was about women, this is a generalized problem. Boys are just as much the victims of parent ambition as girls are. That said, here is my original comment:<p>One thing I do not understand regarding regarding college diplomas overproduction is the push for more women in IT. We all know over here that IT is not the sunshine and flowers industry it sometimes looks like from outside. There&#x27;s plenty of psychical and mental health hazards.<p>For the first time in 20 years I now have more women colleagues than man. Of course we should accept anybody who is passionate about IT into the field, but pushing people into it? In my team right now there&#x27;s an junior engineer girl who is absolutely WOW, I have only seen one more junior so bright and passionate in my career. But there&#x27;s also two junior engineer girls, the project owner and scrum master - both women - who are just miserable! They have no love for technology, quite the contrary: their phones, laptops, home wi-fi, are a source of stress for them. Which is especially bad now with work from home, no IT help desk. The 2 girls have been pushed into the industry by their parents who have a rosy distorted image of IT. The 2 women by the need for more money. This is not empowerment or equality or anything like that. Their lives are passing them by while they toil away at something they hate.<p>For my part I always try to also present the bad parts to parents who ask me about IT for their children. Having people who hate their work doesn&#x27;t do anybody any good.<p>This is a request for comments and also an attempt to make you aware when you will have the chance to have career discussions with parents and children.",
      "time": 1637910025,
      "title": "Pushing People into IT",
      "type": "story"
    },
    {
      "by": "dannyobrien",
      "descendants": 0,
      "id": 29348033,
      "score": 1,
      "time": 1637909750,
      "title": "A small scheme VM, compiler, and REPL in 4k",
      "type": "story",
      "url": "https://dl.acm.org/doi/10.1145/3486606.3486783"
    },
    {
      "by": "eionelk8s",
      "descendants": 0,
      "id": 29348028,
      "score": 1,
      "time": 1637909662,
      "title": "Access a fully hosted personal Kubernetes dev cluster",
      "type": "story",
      "url": "https://medium.com/k8slens/lens-5-3-released-a9c97c62b056"
    },
    {
      "by": "taraskuzyk",
      "descendants": 0,
      "id": 29348025,
      "score": 1,
      "text": "I have been looking to use lipsync for a project at work, and I have been horrified to see that the most used deepfake library [0] with over 30k stars has the word &quot;test&quot; mentioned in it a whopping 10 times. This naturally made me very hesitant to use this library as who (I guess no one, really) knows how unstable it may be.<p>Are there any examples of projects in ML (other than libs like pytorch) that do have test suites, and perhaps even enforce TDD? Would be very curious to know.<p>[0] DeepFaceLab https:&#x2F;&#x2F;github.com&#x2F;iperov&#x2F;DeepFaceLab",
      "time": 1637909580,
      "title": "Are there any open source ML libraries that have good (or any) test coverage?",
      "type": "story"
    },
    {
      "by": "tasubotadas",
      "descendants": 0,
      "id": 29348015,
      "score": 3,
      "time": 1637909407,
      "title": "Microsoft Windows 2021H2 update includes GPU support for WSL",
      "type": "story",
      "url": "https://support.microsoft.com/en-us/windows/inside-this-update-93c5c27c-f96e-43c2-a08e-5812d92f220d"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 29348013,
      "score": 1,
      "time": 1637909396,
      "title": "Decentralized Finance (DeFi) Can Improve Wholesale Clearing and Settlement",
      "type": "story",
      "url": "https://maroonmacro.substack.com/p/issue-31-how-decentralized-finance"
    },
    {
      "by": "wreckersworld",
      "descendants": 0,
      "id": 29347999,
      "score": 1,
      "time": 1637909095,
      "title": "- Nuke Your AWS Cloud [video]",
      "type": "story",
      "url": "https://collabnix.com/2-minutes-to-clean-up-your-aws-resources/"
    }
  ]
}