{
  "stories": [
    {
      "by": "logicalmonster",
      "descendants": 0,
      "id": 32111505,
      "score": 1,
      "text": "Just a small story that should serve as a reality check for me and perhaps others here.<p>As programmers and technology experts, we realize that most people do not understand machine-learning or other Computer Science things, but might assume that by CURRENT_YEAR working age people generally understand basic computer usage. Wow-oh-wow: no.<p>I&#x27;m currently visiting the parents for a mini-vacation for a couple of weeks. Since I&#x27;m the resident expert, my father asked me for some help with a computer task on his Mac. No problem.<p>In the process of talking him through the issue, I asked him to copy-and-paste some text. He didn&#x27;t understand what I meant. I&#x27;m not talking about not memorizing the keyboard shortcuts, but he was genuinely not understanding what copying and pasting even referred to. He was struggling with the mental concept of selecting and copying text in one program and pasting it for use elsewhere in another program.  Walking him through the process (which I&#x27;m certain he didn&#x27;t really understand) took several frustrating minutes. His best understanding of how to transfer text before this was to save a file in one program and try and open it in another program.<p>My father is not a techie by any means, but he&#x27;s used a computer daily for recreation at least the last 15 years on both Mac and Windows, managed the household technology stuff, and performed normal light office tasks in the course of his work—using the Internet, typing documents, and printing them out.<p>I assume very little from an average user, but this is a hell of a reminder that:<p>* the Least Common Denominator of users still has a minimal understanding of how to use a computer despite actually using it for productive work<p>* don&#x27;t understand the capabilities of their system<p>* feel incredibly frustrated when their UIs change in any way because they work by memorizing how to do tasks, not logical problem solving using their knowledge of the system<p>* most people still need to be protected from themselves and there&#x27;s a reason why by default many UIs are dumbed down to what we think is an absurdly basic level",
      "time": 1657910899,
      "title": "My father still doesn't know how to copy and paste text",
      "type": "story"
    },
    {
      "by": "behnamoh",
      "descendants": 1,
      "id": 32111431,
      "kids": [
        32111524
      ],
      "score": 3,
      "text": "Examples of tech&#x2F;customer support forums that are useless:<p>- Apple (see [1])<p>- Microsoft (see [2])<p>- Google (see [3])<p>I often find better answers on SO, SU, and other stack websites. Hell, even independent blogs have better solutions. Why, then, can&#x27;t these giant companies improve the quality of their forums?<p>[1]: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;iphone&#x2F;comments&#x2F;1nwpum&#x2F;why_are_the_official_apple_forums_so_unhelpful&#x2F;<p>[2]: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;windows&#x2F;comments&#x2F;g2nazh&#x2F;has_anyone_ever_found_a_useful_answer_in_the&#x2F;<p>[3]: https:&#x2F;&#x2F;support.google.com&#x2F;groups&#x2F;thread&#x2F;126332371?hl=en",
      "time": 1657910488,
      "title": "Ask HN: Why are the FAANG tech support forums often useless?",
      "type": "story"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 32111427,
      "score": 2,
      "time": 1657910468,
      "title": "FCC chair proposes raising broadband standard to 100Mbps",
      "type": "story",
      "url": "https://www.engadget.com/fcc-chairwoman-proposes-100mbps-broadband-standard-181617127.html"
    },
    {
      "by": "nhgiang",
      "descendants": 0,
      "id": 32111426,
      "score": 1,
      "time": 1657910463,
      "title": "Ask HN: SSD or HDD for data hoarding?",
      "type": "story"
    },
    {
      "by": "nhgiang",
      "descendants": 2,
      "id": 32111413,
      "kids": [
        32111459,
        32111434
      ],
      "score": 3,
      "time": 1657910393,
      "title": "Ask HN: Best Use of 900Mbps Internet?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32111411,
      "score": 1,
      "time": 1657910387,
      "title": "Spaceship Earth: The Science of Biogeography",
      "type": "story",
      "url": "https://www.directionsmag.com/article/11452"
    },
    {
      "by": "oumua_don17",
      "descendants": 1,
      "id": 32111408,
      "kids": [
        32111495
      ],
      "score": 6,
      "time": 1657910365,
      "title": "The first ever Red Extreme heat warning issued in UK",
      "type": "story",
      "url": "https://www.metoffice.gov.uk/about-us/press-office/news/weather-and-climate/2022/red-extreme-heat-warning"
    },
    {
      "by": "sksk",
      "descendants": 0,
      "id": 32111391,
      "score": 1,
      "time": 1657910247,
      "title": "How the Fed ended the last great American inflation – and how much it hurt",
      "type": "story",
      "url": "https://www.vox.com/future-perfect/2022/7/13/23188455/inflation-paul-volcker-shock-recession-1970s"
    },
    {
      "by": "uberdru",
      "descendants": 1,
      "id": 32111376,
      "kids": [
        32111409
      ],
      "score": 1,
      "time": 1657910134,
      "title": "Crypto Meltdown Claims Rolex and Patek Philippe as Victims",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-07-01/crypto-stock-meltdown-hits-rolex-patek-philippe-audemars-piguet-watches"
    },
    {
      "by": "albinsjolin",
      "descendants": 0,
      "id": 32111374,
      "score": 2,
      "time": 1657910114,
      "title": "I tasked AI on cancer using winter-fasting as a template. This is the result",
      "type": "story",
      "url": "https://www.cancer.com.ai/"
    }
  ]
}