{
  "stories": [
    {
      "by": "dreamer7",
      "descendants": 0,
      "id": 28942611,
      "score": 1,
      "time": 1634812580,
      "title": "Create and ship interactive animations to any platform",
      "type": "story",
      "url": "https://rive.app/"
    },
    {
      "by": "Aissen",
      "descendants": 0,
      "id": 28942600,
      "score": 1,
      "time": 1634812481,
      "title": "The Day I *Almost* Rage-Quit Amazon",
      "type": "story",
      "url": "https://index.medium.com/the-day-i-almost-rage-quit-amazon-5727ef4f71e1"
    },
    {
      "by": "DeathArrow",
      "descendants": 0,
      "id": 28942594,
      "score": 2,
      "time": 1634812419,
      "title": "Windows 11 will hobble gaming performance by default on some prebuilt PCs",
      "type": "story",
      "url": "https://www.pcgamer.com/windows-11-pcs-can-hobble-gaming-performance/"
    },
    {
      "by": "behindai",
      "descendants": 0,
      "id": 28942584,
      "score": 1,
      "time": 1634812362,
      "title": "We Should Not Back to the Offices Now",
      "type": "story",
      "url": "https://oleg.nu/dgqZXSbKA3W1d6"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28942550,
      "score": 1,
      "time": 1634812010,
      "title": "Magic Number",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Magic_number_(physics)"
    },
    {
      "by": "Max_Ehrlich",
      "descendants": 2,
      "id": 28942549,
      "kids": [
        28942586,
        28942568
      ],
      "score": 2,
      "text": "In high school, I was doing the International Baccalaureate Diploma. There are two Maths there -  one that was really difficult, and one that was easy.<p>I began with the higher-level Math, but it was really difficult. I also didn&#x27;t really have motivation to study it - not intrinsic (&quot;I love and am really good at Math!&quot;) or extrinsic (&quot;I will die to become an engineer&quot;).<p>The English students hardly studied, so I searched what lucrative career I could have if I took English instead.<p>That was Law. So I happily dropped this higher-level Maths. I have admission to Law at a prestigious London university.<p>Then I was conscripted in my country. This taught me the value of freedom. I swore I would never be any country&#x27;s bitch ever again. Multiple citizenships became a priority. I didn&#x27;t ever want to be any country&#x27;s bitch ever again. From what I understand, Law is heavily regulated. If I am an English lawyer, I am stuck in England or dependent on my employer to send me (a fresh-faced college grad with no experience) abroad whenever they see fit.<p>My outlook on career and higher education is just sive.rs&#x2F;balance + getting rich as the &quot;do what you love [your art]&quot;. I want to become a millionaire. Everyone wants to talk about passion and whether I will &quot;enjoy my career&quot;, but I think of it just as a head choice. I think the passion comes after you start getting good. Law, as you saw, is not my &quot;passion&quot;. I just thought it would be fun. My real passion is acting, but I don&#x27;t want to taint it by making money off it.<p>CS seems like the only field where I can make good money, it&#x27;s a white collar job, solid future, and it will even increase my chances of getting rich. I think the clearest (but still not easy) route to riches is going to Silicon Valley with a startup.<p>Another key thing with the &quot;never again a country&#x27;s bitch&quot; is, I&#x27;ve got a green card waiting for me as soon as I land in the USA. So the clock starts ticking the moment I land. Within five years, including university, I could become a citizen. So that&#x27;s just one year of real time. I won&#x27;t get such an opportunity ever again in my life (unless I get rich of course).<p>So CS seems ideal. Everything fits in perfectly.<p>But I have never in my life done anything related to CS or shown any &quot;passion&quot; for it. The most I&#x27;ve ever made is a static HTML personal website written by hand [which I enjoyed doing very much, for what it&#x27;s worth].<p>I am also not great at math. But I can learn. I have clear extrinsic motivation (getting rich).<p>Right now is US application time, so I don&#x27;t have the luxury of sponging around dabbling in CS to see whether I like it.<p>I&#x27;d really appreciate all you smart tech guys&#x27; advice on what to do with my life [I&#x27;m 20].",
      "time": 1634812007,
      "title": "Ask HN: Should I study CS or Law?",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 28942521,
      "score": 1,
      "time": 1634811761,
      "title": "The theory-practice gap in AI",
      "type": "story",
      "url": "https://www.lesswrong.com/posts/xRyLxfytmLFZ6qz5s/the-theory-practice-gap"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28942519,
      "score": 1,
      "time": 1634811747,
      "title": "Brazil’s Bolsonaro accused of “crimes against humanity” over Covid response",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/10/brazils-bolsonaro-accused-of-crimes-against-humanity-over-covid-response/"
    },
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 28942518,
      "score": 1,
      "time": 1634811740,
      "title": "On The Origin Of Minds",
      "type": "story",
      "url": "https://aeon.co/essays/the-study-of-the-mind-needs-a-copernican-shift-in-perspective"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28942507,
      "score": 1,
      "time": 1634811679,
      "title": "Make the perfect cup of tea, by the Royal society of chemistry (2003) [pdf]",
      "type": "story",
      "url": "https://web.archive.org/web/20140811033029/http://www.rsc.org/pdf/pressoffice/2003/tea.pdf"
    }
  ]
}