{
  "stories": [
    {
      "by": "harambae",
      "descendants": 0,
      "id": 27968369,
      "score": 1,
      "time": 1627357292,
      "title": "Housing boom is over as new home sales fall to pandemic low",
      "type": "story",
      "url": "https://www.cnbc.com/2021/07/26/housing-boom-is-over-as-new-home-sales-fall-to-pandemic-low.html"
    },
    {
      "by": "Lammy",
      "descendants": 0,
      "id": 27968360,
      "score": 1,
      "time": 1627357229,
      "title": "Budd–Michelin rubber-tired rail cars",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Budd%E2%80%93Michelin_rubber-tired_rail_cars#Silver_Slipper"
    },
    {
      "by": "bsoundarya",
      "descendants": 0,
      "id": 27968357,
      "score": 2,
      "time": 1627357162,
      "title": "4-Week live course on (21st century) GTD in Notion",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Mi6R2s9hPg4"
    },
    {
      "by": "psim1",
      "descendants": 0,
      "id": 27968339,
      "score": 2,
      "time": 1627356928,
      "title": "Comcast contributes a lot of open source",
      "type": "story",
      "url": "https://comcast.github.io"
    },
    {
      "by": "quickaskq",
      "descendants": 0,
      "id": 27968335,
      "score": 1,
      "text": "Hey HN, I’m a long (…long) time lurker, very occasional poster. I am starting my completely remote job soon and have hit a difficult problem that I am having a hard time figuring out: where to live. I have no S.O., no large family, no ethnic&#x2F;religious community (not trying to be melodramatic here, I’m quite content with my life), which means I have no ties to anywhere. Where do I live?<p>I love San Francisco. I love walking around Russian hill, Cole valley, Noe valley, getting a burrito in the mission, biking through golden gate park, chilling in Alamo square, etc.<p>Although I am a techie, I’ve grown away from associating with tech. It’s my 9-5, but afterwards I want to talk about anything else. I do read HN religiously though :)<p>I am still dating and am at a point in my life where this is very important. At a cis male what is the scene like?<p>I make good money, but I still have a deep sense of what something should be worth. Paying 2.8k for a 1 bedroom hurts but I can afford it. Otherwise the city seems expensive but not outrageous. I had a sushi roll for $15, which is like $3 more than it should be imo.<p>I could go on. What I would really appreciate is what long term SF residents think about SF life. Can I find friends here? Make a relationship? Will the insane beauty of twin peaks wear off?<p>Thanks HN",
      "time": 1627356909,
      "title": "Ask HN: Should I move to San Francisco?",
      "type": "story"
    },
    {
      "by": "phospine",
      "descendants": 0,
      "id": 27968329,
      "score": 1,
      "time": 1627356833,
      "title": "Show HN: App to keep your photos and videos safe and secure",
      "type": "story",
      "url": "https://sixbytes.io/safetyphoto/index.html"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 27968292,
      "score": 3,
      "time": 1627356373,
      "title": "Collision Detection Is Hard: The Story of Alf",
      "type": "story",
      "url": "https://nicole.express/2021/remember-alf.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27968265,
      "score": 1,
      "time": 1627356093,
      "title": "WebContent-EL1 LPE: OOBR in AppleCLCD / IOMobileFrameBuffer",
      "type": "story",
      "url": "https://saaramar.github.io/IOMobileFrameBuffer_LPE_POC/"
    },
    {
      "by": "antag0nist",
      "descendants": 2,
      "id": 27968255,
      "kids": [
        27968354,
        27968317
      ],
      "score": 2,
      "text": "I&#x27;m a machine learning engineer and the job requires a great deal of thinking and mental energy which I actually like. The problem is that I noticed that after work, I am not at all as chill as who I am on the weekends. Both my gf and mood tracker acknowledge that my mood is much more chill on the weekends.<p>Initially, I assumed this is because our projects are open-ended and after work, I&#x27;m still thinking about what to do tomorrow or some research ideas. This is partly correct but i tried 10 min meditation after work, 30 min reading a book and going out for 5 min to smoke. These helped not to think about work but I still feel that my &quot;thinking motor&quot; is still on and active. I think about a lot of things (this time not about work) and I am not at all as mindful and as chill as what I am on the weekends.<p>I noticed that on the weekends when I look at the flowers, i cherish the experience and enjoy this little thing. But after work, i still notice the beauty, but don&#x27;t feel that good experience of enjoying observing a beautiful flower. I think because I am not as mindful and as chill as what I am on the weekends.<p>Is it because deep down the work anxiety is still there? or scientifically we have a notion of &quot;thinking motor&quot; which we turn on during the day and it&#x27;s not clear how to turn it off? if we can turn it off and be like weekends, how?",
      "time": 1627355990,
      "title": "Ask HN: How do you chill your mind after work?",
      "type": "story"
    },
    {
      "by": "justicezyx",
      "descendants": 1,
      "id": 27968241,
      "kids": [
        27968346
      ],
      "score": 1,
      "time": 1627355824,
      "title": "US intelligence mistaken wind farm for missile silos",
      "type": "story",
      "url": "https://www.washingtonpost.com/national-security/china-nuclear-missile-silos/2021/06/30/0fa8debc-d9c2-11eb-bb9e-70fda8c37057_story.html"
    }
  ]
}