{
  "stories": [
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30981280,
      "score": 1,
      "time": 1649621973,
      "title": "Pinry: A Selfhosted Alternative to Pinterest",
      "type": "story",
      "url": "https://github.com/pinry/pinry"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 30981254,
      "score": 1,
      "time": 1649621823,
      "title": "Am I too old to become a professional programmer?",
      "type": "story",
      "url": "https://ehmatthes.github.io/pcc_2e/finding_employment/age_in_tech/"
    },
    {
      "by": "carlsonorozco",
      "descendants": 0,
      "id": 30981253,
      "score": 1,
      "time": 1649621820,
      "title": "Warm up that one conversation",
      "type": "story",
      "url": "https://warmup.one/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30981223,
      "score": 1,
      "time": 1649621647,
      "title": "We need tool support for keyset pagination",
      "type": "story",
      "url": "https://use-the-index-luke.com/no-offset"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30981118,
      "score": 1,
      "time": 1649620884,
      "title": "CI Chondrite",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/CI_chondrite"
    },
    {
      "by": "LeslieDewhurst",
      "descendants": 0,
      "id": 30981095,
      "score": 1,
      "text": "Not everyone will remember the 70’s Energy Crisis  when the real price of oil trebled - yes, trebled! - in less than three years. For Europeans, memories will include rostered blackouts, greatly reduced travel and clunky Tech that needed back-up power.. For North Americans, the abiding memory will be the 55 mph speed limit.<p>Fast forward half a decade and we’re there again, but this time in slightly better shape. The US is virtually self sufficient in oil and Europe has a more integrated and cleaner energy supply using LNG. That’s Russian LNG and as one trader suggested: “There’s nothing else like it out there.”  Hence the current crisis.<p>The other big difference between the two crises is the growth of Tech to become global, social and held in the palm of one’s hand. Getting tangible stuff out of the ground may be an integral part of American history, but it’s capital intensive, requires long pay-back times and is, we’re told, not good for the environment.<p>In these carbon sensitive times, Tech is emission-lite and has the credentials that at least placate environmental activists. The top 10 Tech companies account for 50% of the Fortune 500’s capitalisation, but only 5% of its emissions. Pretty stunning, that.<p>But energy self sufficiency is now the focus of Europe and the US and much as they would like to surf the low emissionTech wave, for the next few years the tangible stuff that comes out of the ground or Nuclear power plant is going be where investment will focus.<p>This means that Tech investments will need to demonstrate their worth far more quickly than anyone was expecting. Investors too, will be much more fussy about what’s on offer. The new Tech they’ll be looking for will help get more Black Gold out of the ground or manage its use. Personal Energy Apps will probably become  the next hot Tech products.<p>Other Techs such as Health-AI, Health Tech, FinTech and Tech Apps in general will still obtain finance and grow but gone will be those wild valuations from the era when Tech wrote the History of the world.<p>For bros on either side of the Pond in their local coffee house, sipping their 17-ingredient Frappuccinos and swapping their latest Wordle challenges; “Zuck Bucks” gossip and other Tech ephemera will become increasingly irrelevant.<p>In the next few years, energy exploration and management will resume its natural role in world History because for the foreseeable, we need barrels of oil and litres of LPG more than we need Tech.<p>@DewhurstLeslie",
      "time": 1649620752,
      "title": "Why Tech will quit writing history for the next few years",
      "type": "story"
    },
    {
      "by": "nowherebeen",
      "descendants": 0,
      "id": 30981085,
      "score": 3,
      "time": 1649620685,
      "title": "Zuckerberg plans to turn Instagram into NFT marketplace",
      "type": "story",
      "url": "https://nftnow.com/news/mark-zuckerberg-plans-to-make-instagram-into-an-nft-marketplace/"
    },
    {
      "by": "dimkr1",
      "descendants": 0,
      "id": 30981084,
      "score": 1,
      "time": 1649620671,
      "title": "Gemini client in 979 SLOC",
      "type": "story",
      "url": "https://github.com/dimkr/gplaces"
    },
    {
      "by": "thunderbong",
      "descendants": 1,
      "id": 30981047,
      "kids": [
        30981122
      ],
      "score": 2,
      "time": 1649620471,
      "title": "How the secretive billionaire quietly worked to give away $12B in 2 years",
      "type": "story",
      "url": "https://fortune.com/longform/mackenzie-scott-philanthropy-donations-wealth-net-worth-privacy/"
    },
    {
      "by": "tangjurine",
      "descendants": 1,
      "id": 30981032,
      "kids": [
        30981049
      ],
      "score": 1,
      "time": 1649620369,
      "title": "Ask HN: Any search engineers at Google see responses to the bad press?",
      "type": "story"
    }
  ]
}