{
  "stories": [
    {
      "by": "FrenchAmerican",
      "descendants": 0,
      "id": 31213133,
      "score": 2,
      "text": "Exodus privacy and TrackerControl apps on Android reveal that Dashlane tracks its paying customers and resell that data for targeting and&#x2F;or retargeting.<p>I wouldn&#x27;t have been surprised if that was the case for a free tool but I find it outrageous to discover that as a paying customer. I have been an early adopter of Dashlane, among the 10,000 first users and never regretted my choice. Until today. I feel betrayed.<p>I guess that was mentioned somewhere in the legalese that nobody reads.<p>Time to move to KPassX I guess.<p>Note: yes, I know that from a security point of view, using Daslane means trust them with your passwords - since I can&#x27;t tell if they really don&#x27;t keep a non-encrypted version of my data.",
      "time": 1651289703,
      "title": "Dashlane tracks its paying customers for ad (re)targeting",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31213120,
      "score": 1,
      "time": 1651289518,
      "title": "Privacy Washing: Do as I Say, Not as I Do",
      "type": "story",
      "url": "https://puri.sm/posts/privacy-washing-do-as-i-say-not-as-i-do/"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31213108,
      "score": 1,
      "time": 1651289350,
      "title": "Should we stop teaching the normal distribution?",
      "type": "story",
      "url": "https://blog.sesse.net/blog/tech/2022-04-29-19-59_should_we_stop_teaching_the_normal_distribution.html"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 31213103,
      "score": 2,
      "time": 1651289325,
      "title": "Dow plunges 900 points, Nasdaq suffers worst month since 2008",
      "type": "story",
      "url": "https://thehill.com/policy/finance/3472033-dow-plunges-900-points-nasdaq-suffers-worst-month-since-2008-after-brutal-april-selloff/"
    },
    {
      "by": "mrlou",
      "descendants": 0,
      "id": 31213100,
      "score": 1,
      "time": 1651289257,
      "title": "Demohub.dev Democratizing Access to Demos for Modern Data Teams",
      "type": "story",
      "url": "https://www.demohub.dev"
    },
    {
      "by": "Cauchon",
      "descendants": 0,
      "id": 31213075,
      "score": 3,
      "time": 1651288960,
      "title": "Hollywood’s Fight Against VPNs Turns Ugly",
      "type": "story",
      "url": "https://www.wired.com/story/hollywood-piracy-vpn-lawsuits/"
    },
    {
      "by": "altStoner",
      "descendants": 0,
      "id": 31213059,
      "score": 2,
      "time": 1651288726,
      "title": "Exposed by a Strava KOM: The Many Lives of a Fake Pro Cyclist",
      "type": "story",
      "url": "https://cyclingtips.com/2022/04/exposed-by-a-strava-kom-the-many-lives-of-a-fake-pro-cyclist/"
    },
    {
      "by": "_manots_",
      "descendants": 1,
      "id": 31213025,
      "kids": [
        31213062
      ],
      "score": 2,
      "text": "How do you (as a peer&#x2F;team lead&#x2F;manager) deal with team members that are seemingly not doing their job?<p>Some context:\n- we are a remote team of 4 engineers\n- we don&#x27;t have a engineering manager working with us directly\n- we are seemed as a &quot;high performing&quot; team to upper management, because, I guess, we somehow deliver without getting any major complaints from our users<p>---<p>I have been at my current company for almost a year, and the team&#x27;s lack of communication with each other and the product owner gets  ever more pronounced. And it seems to me certain individuals are consistently failing to do their job.<p>For example, two team members that were responsible for coordinating the production release never initiated the conversation. The product owner asked about the status and didn&#x27;t get an answer. I couldn&#x27;t stand by and see the team fail, so I asked in the channel in a neutral tone addressing to everyone (to try to not single anyone out) to see if we were still waiting on the fix of a bug (that one of the team members that&#x27;s responsible for setting up the release was trying to resolve since yesterday).\nThe person replied after a while and said he was still working on it. I wasn&#x27;t surprised, but I still wondered how come he didn&#x27;t communicate this with the product owner yesterday because our release was scheduled to be yesterday. As someone who is tasked to take care of the release, he should keep everyone in the loop if he is experiencing issues. If he needs help he can speak up.\nThis was not the first time this happened from him. He has failed to deliver quite a few simple tasks on time, only to tell the team about the status when we start to talk about preparation for production release. He also failed to reply to most questions I asked, even in DMs, in our year long &quot;collaboration&quot;.<p>The other subject is similar, poor communications. But I want to highlight his obvious attempts to fool the product owner - very often times, there are very simple tasks he would volunteer himself to do, and those tasks are extremely easy, especially for him, a senior engineer. It blew my mind today when he addressed to the product owner he is &quot;continuing&quot; to work on a task he started yesterday. The work involved in that task is as simple as dropping a constant into an array. If it takes an experienced engineer who worked on that area of the code, more than a few minutes, left alone a few hours, if he is not slacking off, tell me what is up with him?\nThis is just one of the many instances I&#x27;ve observed from him.<p>I am very disappointed that the team lead lets these people have their way.<p>I find myself cleaning up a lot of the messes these people make. I always was the first one attending to issues product owner found in their work and raise the concern in them because I don&#x27;t want to see the team I am in fail because of anyone&#x27;s inattention. I am not sure if I care too much but I know I certainly can&#x27;t let my team fail even if I am not in the lead position. I care not because I picked up the habit as a team lead in another company but because I genuinely want to see myself and the team success in our mission.\nMost of the time, I feel like I am talking to myself. I purposely asked a lot of open ended questions in hope I can spark constructive discussions to help us grow as engineers and to help the product we are building. Nevertheless, all I got was silence most of the time.<p>I don&#x27;t know how to help the team beyond making public suggestions to the team and the product team in our retrospective meetings that we should keep an open line of communications and keep everyone in the loop on any issues we may have so we can help each other. I&#x27;ve mentioned this at least four times, in different ways, but my messages never seemed to get across.<p>My answer to my question is that I should exit the team because I&#x27;ve done all things I could think of to help, and the reality is that no one needed help.<p>-M",
      "time": 1651288198,
      "title": "How do you deal with team members that are seemingly not doing their job?",
      "type": "story"
    },
    {
      "by": "jrvarela56",
      "descendants": 1,
      "id": 31213001,
      "kids": [
        31213016
      ],
      "score": 1,
      "time": 1651287933,
      "title": "Want to hangout with other HN users?",
      "type": "story",
      "url": "https://us02web.zoom.us/j/89412089581"
    },
    {
      "by": "grawprog",
      "descendants": 0,
      "id": 31212997,
      "score": 1,
      "time": 1651287897,
      "title": "New options for removing your personally identifiable information from Search",
      "type": "story",
      "url": "https://blog.google/products/search/new-options-for-removing-your-personally-identifiable-information-from-search/"
    }
  ]
}