{
  "stories": [
    {
      "by": "boomer918",
      "descendants": 0,
      "id": 29362535,
      "score": 1,
      "text": "Cloudflare Flexible SSL mode encrypts traffic between the client and Cloudflare but it forwards that data to the origin server unencrypted over the public internet.<p>Isn&#x27;t this misleading? The client thinks their traffic is safe, but it ends up being exposed? Doesn&#x27;t this defeat the purpose of SSL and browser certificate validation?",
      "time": 1638040116,
      "title": "Cloudflare “Flexible” SSL Misleading",
      "type": "story"
    },
    {
      "by": "throwawyfunder",
      "descendants": 0,
      "id": 29362519,
      "score": 2,
      "text": "Do any of you have any recommendations for tools and techniques to quickly validate startup ideas? Especially the ones that you don&#x27;t have connections for. I am interested in AI ideas that could potentially help other industries but I have no means to validate how painful the problem is. Some of the approaches that I am considering:<p>- Post a job posting to recruit some employees and gather information from them (and pay them for their time)\n- Create a landing page and advertise it to the right target audience\n- Reach out to people through LinkedIn<p>Any other tools, techniques, recommendations, etc., or even suggestions on how to make effective use of these strategies?<p>(throwaway because my main account is easily identifiable to work colleagues)",
      "time": 1638040012,
      "title": "Ask HN: Tools and techniques to quickly validate startup ideas",
      "type": "story"
    },
    {
      "by": "bsanr",
      "descendants": 1,
      "id": 29362509,
      "kids": [
        29362515
      ],
      "score": 1,
      "time": 1638039925,
      "title": "Affiliate marketing has destroyed tech journalism",
      "type": "story",
      "url": "https://www.theverge.com/"
    },
    {
      "by": "ScottMann",
      "descendants": 0,
      "id": 29362490,
      "score": 1,
      "time": 1638039827,
      "title": "The current inflation run is similar to other episodes in history",
      "type": "story",
      "url": "https://www.cnbc.com/2021/11/27/the-current-inflation-run-is-similar-to-other-episodes-in-us-history-but-with-important-differences.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29362487,
      "score": 1,
      "time": 1638039813,
      "title": "The TCP/IP Checksum (2012)",
      "type": "story",
      "url": "https://locklessinc.com/articles/tcp_checksum/"
    },
    {
      "by": "okareaman",
      "descendants": 0,
      "id": 29362469,
      "score": 1,
      "text": "I tried to explain NFTs and crypto to family on Thanksgiving, but I don&#x27;t think I was able to get it across across. I should have mentioned that many years before NFTs you could buy land on the Moon and get a certificate of ownership. There is no legal framework for owning land on the Moon, but that doesn&#x27;t have to stop you from setting up a market for Moon land with your friends and trading your Moon acres for goods and services. As long as a group of people decided to use Moon land as money, they can use it as a way of enabling transactions. Like Monopoly money, it&#x27;s essentially a way of keeping score of who owns what. Like casino chips, you might even be able to exchange them for dollars if the market owner (the casino) finds it profitable to maintain the illusion that they are real money. Just don&#x27;t try to buy groceries with casino chips.<p>The operative phrase is &quot;There is no legal framework,&quot; so if the Chinese decide to build a moon base on your land you&#x27;re out of luck because you never really owned any land on the Moon.<p>Any day now someone will try to sell an NFT of the Brooklyn Bridge. In other words, NFTs are just another vehicle to extract money from suckers.",
      "time": 1638039596,
      "title": "Ask HN: Trying to explain NFTs to family on Thanksgiving. Am I wrong?",
      "type": "story"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 29362428,
      "score": 2,
      "time": 1638039275,
      "title": "The metaverse is just the latest incarnation of Las Vegas",
      "type": "story",
      "url": "https://www.ft.com/content/739235bc-c418-4895-a426-3bd245ec6a00"
    },
    {
      "by": "vanusa",
      "descendants": 1,
      "id": 29362399,
      "kids": [
        29362536
      ],
      "score": 1,
      "time": 1638039049,
      "title": "Study shows believers in astrology are less intelligent and more narcissistic",
      "type": "story",
      "url": "https://phys.org/news/2021-11-people-astrology-tend-intelligent-narcissistic.html"
    },
    {
      "by": "pkrecker",
      "descendants": 0,
      "id": 29362391,
      "score": 1,
      "time": 1638038966,
      "title": "The Cagots of France",
      "type": "story",
      "url": "https://www.picciolettabarca.com/posts/beyond-thought-the-cagots-of-france"
    },
    {
      "by": "jackocoins",
      "descendants": 0,
      "id": 29362374,
      "score": 1,
      "text": "Does your team share Excel or Google sheets, where multiple people are entering information into the same document? Am I the only one losing control over input?",
      "time": 1638038861,
      "title": "Control over Input in Spreadsheets",
      "type": "story"
    }
  ]
}