{
  "stories": [
    {
      "by": "womitt",
      "descendants": 0,
      "id": 28168911,
      "score": 2,
      "time": 1628863145,
      "title": "Healthy Performance Reviews in Engineering: How to Deliver and Receive Feedback",
      "type": "story",
      "url": "https://codingsans.com/blog/performance-review"
    },
    {
      "by": "jmercouris",
      "descendants": 0,
      "id": 28168906,
      "score": 1,
      "time": 1628863124,
      "title": "Show HN: Nyxt transfers URLs to your phone via QR codes",
      "type": "story",
      "url": "https://nyxt.atlas.engineer/article/qr-url.org"
    },
    {
      "by": "Jeff_Brown",
      "descendants": 0,
      "id": 28168883,
      "score": 1,
      "time": 1628863033,
      "title": "Fast, accurate 3D-imaging for RNA",
      "type": "story",
      "url": "https://www6.slac.stanford.edu/news/2021-08-11-fast-accurate-system-quickly-solving-stubborn-rna-structures-pond-scum-sars-cov-2"
    },
    {
      "by": "ezekg",
      "descendants": 0,
      "id": 28168852,
      "score": 1,
      "text": "Heroku&#x27;s router seems to be logging intermittent H10 &quot;App Crash&quot; errors, but the apps are not crashed. I&#x27;ve been seeing the sporatic behavior for about 16 hours.<p>An SO user reported the same [0], and it seems others are effected [1] [2]. Heroku has not communicated an outage.<p>Anybody know what&#x27;s going on?<p>[0]: https:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;68764077&#x2F;heroku-h10-error-but-web-dynos-are-not-crashing<p>[1]: https:&#x2F;&#x2F;twitter.com&#x2F;jaredbrown&#x2F;status&#x2F;1426164985550475264<p>[2]: https:&#x2F;&#x2F;twitter.com&#x2F;Gemfury&#x2F;status&#x2F;1426154622645768192",
      "time": 1628862860,
      "title": "Ask HN: Is Heroku Having an Outage?",
      "type": "story"
    },
    {
      "by": "Shivamramphal",
      "descendants": 0,
      "id": 28168825,
      "score": 1,
      "time": 1628862740,
      "title": "Marketing a new startup tips and tricks",
      "type": "story",
      "url": "https://meetmaya.world/how-to-market-a-new-startup"
    },
    {
      "by": "edukodo",
      "descendants": 0,
      "id": 28168824,
      "score": 2,
      "text": "If your production website uses HTTPS, you want your local development site to behave like an HTTPS site.\nWith the new module for Devserver, it is possible to automatically create virtual hosts and certificates and then run a local development site with HTTPS. Virtual Hosts Manager : https:&#x2F;&#x2F;warehouse.easyphp.org&#x2F;inventory-devserver#devtools. It needs Apache 2.4.48.",
      "time": 1628862737,
      "title": "HTTPS for Local PHP Developement",
      "type": "story"
    },
    {
      "by": "codypilot",
      "descendants": 0,
      "id": 28168813,
      "score": 2,
      "text": "Hi, HN! I’m Cody Pawlowski and my co-founder is Chase Bonhag and we’re FirstIgnite (https:&#x2F;&#x2F;firstignite.com&#x2F;). We help researchers at universities connect with companies interested in funding or licensing their research.<p>Currently, a vast majority of all research goes uncommercialized. This includes everything from new cancer therapies to energy storage improvements and other solutions to universal problems. By connecting research to relevant companies, we increase the probability that research will be commercialized.<p>We met while I was running a natural language processing startup at the University of Illinois at Urbana-Champaign. Chase was working at Illinois Ventures, the venture capital arm of the university. U of I conducted over $900M a year worth of research, much of which was going uncommercialized.  Because university research portfolios are massive, diverse, and highly complex, it&#x27;s nearly impossible to figure out which companies to partner with for which research. We realized that we could apply NLP to the problem because it was written in scientific text via patents and publications!<p>We started by taking unpaid pilots from universities in fall of 2019. Seven schools gave us two pieces of research to match to industry. For 6 of the schools, we completely failed and were unable to connect any of their research to companies. But for one school, we managed to connect both of their technologies to 5 companies each. We learned that patent databases had company interest and activity in text format that matched well to research publications.  We also learned that matching to patents was not quite enough, but if we also looked at the competitors of those holding patents we were able to identify a large enough top-of-funnel to find success on almost any topic.  We built our initial product and process around that approach.<p>Researchers upload scientific documents describing their research and receive tailored lists of companies interested in that research. Using natural language processing and graph theory, our software analyzes the texts and matches their research to industry activity consisting of nearly 3 billion relationships stored across public and proprietary data.  We’ve had success mainly leveraging USPTO full-text and competitive intelligence data, with plans to bring in European patents, SBIR, clinical trials, job postings, corporate filings, press releases, social media, and any other text that hints at what a corporation is interested in.<p>What’s unusual is that we’re the only solution that allows you to upload a piece of research and receive a tailored list of companies and leads to contact.  We call this active marketing—helping researchers get in touch with those who are most likely to move their research forward—as opposed to a passive marketing approach, where researchers upload their technologies in hopes of companies reaching out to them (of course, they usually don’t). Our approach results in an average of 5 meetings with companies per scientific document vs our competitors&#x27; passive approach which is lucky to result in 1 meeting.  We currently make money by selling software and service subscriptions to universities.<p>Some examples: Professor Chou at the Children&#x27;s Hospital of Philadelphia uses our tool to identify companies working on cancer therapies and connect with them about potential research partnerships.  Carnegie Mellon University uses our software to market &quot;moonshot&quot; research topics to companies to identify future funding partners. UC Davis uses our tool to identify companies interested in licensing their intellectual property.<p>We’re really excited to share FirstIgnite with this community.  We’re open to all thoughts and ideas, we’d love to learn about experiences you’ve had working on research projects, things you know about university research or corporate R&amp;D, or anything else that can help us.  Thank you!",
      "time": 1628862701,
      "title": "FirstIgnite (YC S21) – Matching scientists with relevant businesses",
      "type": "story"
    },
    {
      "by": "eecc",
      "descendants": 0,
      "id": 28168794,
      "score": 1,
      "time": 1628862561,
      "title": "Gino Strada has died",
      "type": "story",
      "url": "https://www.ansa.it/english/news/general_news/2021/08/13/gino-strada-has-died-7_3c9669e3-6774-43e3-98dd-824a17231cba.html"
    },
    {
      "by": "willmadden",
      "descendants": 3,
      "id": 28168789,
      "kids": [
        28168790
      ],
      "score": 3,
      "time": 1628862549,
      "title": "ADE Detected in the Vaccinated (Preprint)",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/34384810/"
    },
    {
      "by": "lolski",
      "descendants": 0,
      "id": 28168783,
      "score": 1,
      "time": 1628862528,
      "title": "TypeDB Client for Julia",
      "type": "story",
      "url": "https://github.com/Humans-of-Julia/TypeDBClient.jl"
    }
  ]
}