{
  "stories": [
    null,
    {
      "by": "ContrarianBrit",
      "descendants": 0,
      "id": 30256633,
      "score": 1,
      "time": 1644314390,
      "title": "After pulling songs, Neil Young is telling Spotify employees to quit their jobs",
      "type": "story",
      "url": "https://www.theverge.com/22922714/neil-young-spotify-letter-ceo-daniel-ek-employees-joe-rogan"
    },
    {
      "by": "keewee7",
      "descendants": 0,
      "id": 30256631,
      "score": 1,
      "time": 1644314385,
      "title": "Paul Graham (YC) on NFTs",
      "type": "story",
      "url": "https://twitter.com/paulg/status/1490406747051286539"
    },
    {
      "by": "iamjfu",
      "descendants": 0,
      "id": 30256630,
      "score": 1,
      "time": 1644314382,
      "title": "Purchase Plan",
      "type": "story",
      "url": "https://www.purchaseplan.io"
    },
    {
      "by": "mbrodersen",
      "descendants": 0,
      "id": 30256613,
      "score": 1,
      "text": "What I mean by a &quot;full-stack in a box&quot; is a web client solution + server solution + DB solition that all work well together for a small to medium size business. Minimizing integration friction and maximising productivity. Is it Typescript&#x2F;C#&#x2F;Postgress? Elm&#x2F;Haskell&#x2F;MySQL? Clojurescript&#x2F;Clojure&#x2F;Datomic? Ruby on Rails&#x2F;? Or something else entirely?",
      "time": 1644314254,
      "title": "Ask HN: What is your preferred “full-stack in a box” solution and why?",
      "type": "story"
    },
    {
      "by": "isaac21259",
      "descendants": 0,
      "id": 30256599,
      "score": 1,
      "text": "I&#x27;m currently working on some software targeted at mathematicians. Part of this requires that the user can write parsers to parse custom notation. I would expect most mathematicians interested in this project to know at least some basic programming but I also think it would be too difficult to expect them to write a full recursive descent parser or similar for their own notation. My current plan is to expose a simple parser combinator library alternatively I was thinking of a parser generator instead. But I was wondering if there is an option which is even simpler for users. What is the simplest way to allow users to write custom parsers?",
      "time": 1644314055,
      "title": "Ask HN: What is the simplest way for users to write custom parsers?",
      "type": "story"
    },
    {
      "by": "Nokinside",
      "descendants": 0,
      "id": 30256589,
      "score": 1,
      "time": 1644313981,
      "title": "Physical Unclonable Functions,a unique, inborn, unclonable hardware level key",
      "type": "story",
      "url": "https://blog.pufsecurity.com/2021/12/20/pufrt-solving-chip-securitys-weakest-link/"
    },
    {
      "by": "m88m",
      "descendants": 0,
      "id": 30256528,
      "score": 3,
      "time": 1644313313,
      "title": "There is more to Scrum than Scrum itself",
      "type": "story",
      "url": "https://www.goretro.ai/post/scrum-beyond-scrum-guide"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 30256520,
      "score": 1,
      "time": 1644313231,
      "title": "SoftBank drops sale of Arm, plans IPO",
      "type": "story",
      "url": "https://apnews.com/article/technology-business-japan-initial-public-offerings-7175c4580e72c02a1c4bdcd5741538af"
    },
    {
      "by": "evaluator",
      "descendants": 0,
      "id": 30256516,
      "score": 1,
      "text": "I am a software developer in my 30s. It seems like in today&#x27;s market, my &quot;value&quot; (which translates to salary + benefits) to a company continues to increase as my years of experience grows. Right now, it seems like swapping companies every few years is a good way to &quot;accrue value&quot;.<p>Looking around at my current company, co-workers in their 50s seem resistant to job swap. I would guess this is because they require security before moving into retirement. Without moving, their &quot;value&quot; may continue to increase, but surely at a slower rate than the market.<p>At what point does your value to a company begin to stagnate&#x2F;decrease&#x2F;slow down? Is there a combination of age and experience where company swapping is not such a good idea? Does moving to management maximise value increase?",
      "time": 1644313196,
      "title": "Ask HN: At what point does your value to a company stagnate/decline?",
      "type": "story"
    }
  ]
}