{
  "stories": [
    {
      "by": "postgresqlDB",
      "descendants": 0,
      "id": 30377779,
      "score": 1,
      "time": 1645127387,
      "title": "pg-online-schema-change – tool for running safe schema changes in PostgreSQL",
      "type": "story",
      "url": "https://github.com/shayonj/pg-online-schema-change"
    },
    {
      "by": "jawerty",
      "descendants": 0,
      "id": 30377778,
      "score": 1,
      "time": 1645127384,
      "title": "The Destruction of the Male",
      "type": "story",
      "url": "https://telegra.ph/The-Destruction-of-the-Male-02-17"
    },
    {
      "by": "mkeespiet",
      "descendants": 0,
      "id": 30377762,
      "score": 1,
      "text": "He there!<p>During evenings we burn quit some candles in our living room. Our house is well isolated (we have a heat pump for heating our house), so we have to ventilate a lot.\nDuring evenings we notice we got sleepy very early in the evening. When we go to bed we stay awake for quit some time. This made me wonder if there was a coloration with the candles and us feeling sleepy early, so I bought a CO2 meter.<p>After a few test it became clear that after burning the candles for like 1,5 hours the CO2 level was already 2 to 3 times higher than before the candles burned.<p>Maybe an open door: if you burn a lot of candles or are with a lot of people in a smaller room, don’t forgot to ventilate! This will make you stay awake longer!",
      "time": 1645127316,
      "title": "Tell HN: Candles can make you feel tired",
      "type": "story"
    },
    {
      "by": "kungfudoi",
      "descendants": 0,
      "id": 30377755,
      "score": 1,
      "time": 1645127295,
      "title": "Apple boss Tim Cook faces backlash to £73m pay package",
      "type": "story",
      "url": "https://www.bbc.com/news/business-60403548"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 30377742,
      "kids": [
        30377743
      ],
      "score": 1,
      "time": 1645127212,
      "title": "They Tell Me the World Ends (2021) [audio]",
      "type": "story",
      "url": "https://newbooksnetwork.com/this-is-how-they-tell-me-the-world-ends"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 30377740,
      "score": 1,
      "time": 1645127186,
      "title": "Hey now, you’re an all-star",
      "type": "story",
      "url": "https://ericlippert.com/2021/02/09/hey-now-youre-an-all-star/"
    },
    {
      "by": "arxanas",
      "descendants": 0,
      "id": 30377739,
      "score": 1,
      "time": 1645127175,
      "title": "Jujutsu DVCS",
      "type": "story",
      "url": "https://github.com/martinvonz/jj"
    },
    {
      "by": "esparkify",
      "descendants": 0,
      "id": 30377723,
      "score": 1,
      "text": "We are currently looking for some Beta testers (preferably with Amazon selling experience) to give us some additional feedback on our product research tool.<p>Esparkify offers a suite of Amazon tools that help sellers discover winning product ideas, estimate sales, keyword optimization for listings, and spy on competitors all from a single dashboard. Our tools simplify the product research process and enable sellers of every caliber to stay competitive, save time, decrease risks, and make more informed decisions that are backed by real data extracted directly from Amazon.<p>Currently includes our flagship product research tool, with Amazon chrome extension and keyword research tool currently in development.<p>Sign up on https:&#x2F;&#x2F;esparkify.com&#x2F; to become a beta tester today, and get exclusive offers like free 3-month access and discount codes when we launch.",
      "time": 1645127076,
      "title": "Esparkify: Amazon Seller Tool looking for Beta Testers",
      "type": "story"
    },
    {
      "by": "throwawaynay",
      "descendants": 0,
      "id": 30377717,
      "score": 1,
      "text": "Besides the annoyance from all the recruiter spam, I&#x27;m also &quot;worried&quot; about the abysmal productivity of the average recruiter.<p>When I get contacted by headhunters I can&#x27;t count the number of times where I had to exchange 5, 6, 7 messages... to get maybe 20% of what&#x27;s on the real public job posting on the company&#x27;s website(and on top of that sometimes they give me incorrect information!), just to end up telling them that I&#x27;m not interested. Surely they can do better than that?<p>When I ask for more details about the mysterious jobs&#x2F;companies they&#x27;re hiring for they think answering stuff like &quot;they raised N millions and use Golang&quot; is a valid answer.<p>Also I can&#x27;t count how many times I got contacted for on-sites jobs when I only do full remote, for expert java jobs when I do JS, for senior roles when I&#x27;m a junior.(and some of those people were unicorns internal recruiters!!!)<p>How do these people stay in business?<p>How would you put them out of business?(or help them act less stupid, but I doubt that&#x27;s possible)<p>I honestly feel like I could do the jobs of 10 tech recruiters with a few well designed bots.",
      "time": 1645127053,
      "title": "Ask HN: How would you fix tech recruiting?",
      "type": "story"
    },
    {
      "by": "JNRowe",
      "descendants": 0,
      "id": 30377708,
      "score": 1,
      "time": 1645127023,
      "title": "Automatic Ring Solving",
      "type": "story",
      "url": "https://reasonablypolymorphic.com/blog/ring-solving/index.html"
    }
  ]
}