{
  "stories": [
    {
      "by": "jordanmorgan10",
      "descendants": 0,
      "id": 31534988,
      "score": 1,
      "text": "Hey HN -<p>I mostly stay in the shadows here, but for the one year anniversary of my first (ebook project)[1] I figured I&#x27;d write a blurb in case it&#x27;s interesting to anyone.<p>I&#x27;m terrible at launching things, and take years to ship my own apps. After my last app was acquired, I wanted to fulfill a &quot;moon shot&quot; goal of mine - write a book in any form. I settled on adapting one of my more popular [blog posts][2] that I keep updated through each version of iOS into a five book series (one for each topic of accessibility, design, UX, APIs and a catch all bonus one). So far it has sold 1,534 copies and has made over $124,000. Now that things have settled, it makes about $2k a month on average.<p>I learned from my own launch history and decide to launch it in &quot;early access&quot;, otherwise I&#x27;d never finish it. Launching it went great and was a day I&#x27;ll never forget, as to that point - I had never made close to that much money in one day.<p>CONS:\nIt&#x27;s not all rainbows and sunshine though. I used to read posts like this and my heart rate would shoot up, thinking &quot;What the heck - I could do that too!&quot; and make some good money. While it is true that the project has been great for me financially (I have a stay at home wife and three kids), honestly life is not any different. I just save most of it, spend it on the 1,000 school activities my kids have or whatever life throws at me. I didn&#x27;t make any splurge purchase.<p>I&#x27;ve also realized the real, grating reality of opportunity cost. At the one year mark, this book series is only half way done. I can&#x27;t put into words how much I miss making software, because now - all I do is write. That has been my main takeaway through all of this - your time is valuable, and I cosigned a ton of mine away the moment I decided to embark on this.<p>PROS:\nOn the positive side, I get messages from people starting out on iOS and veterans alike who are really enjoying the books. It&#x27;s hard to put into words how motivating that is, to fell like you are doing a tiny little thing that somewhat matters to some people. I also love teaching and writing, so the project does appeal to me - but I&#x27;ve learned I need a better balance. When I shipped apps, all I wanted to do was write. Now, the opposite is true.<p>Anyways, if you are considering launching a digital downloads type of product, I&#x27;d say go for it. Tech-wise, it was trivial to get started:<p>Gumroad for sales\nNetlify for deploys\nMade the site from scratch using Tailwind\nUlysses to write<p>I think in a world where there is a lot of &quot;grifting&quot; going on with courses, ebooks, etc - you can actually stand out if you stick to your word and show authenticity. For example, I promised updates every two weeks - and I&#x27;ve stuck to that, a year in.<p>TL&#x27;DR:\nLaunching your own thing and making money is neat, but at the end of the day life doesn&#x27;t really change at all. Consider your time investments. Try to truly help people.<p>Happy to answer any questions if you have any.<p>[1]: https:&#x2F;&#x2F;www.bestinclassiosapp.com\n[2]: https:&#x2F;&#x2F;www.swiftjectivec.com&#x2F;a-best-in-class-app&#x2F;",
      "time": 1653686032,
      "title": "Tell HN: My early access eBook over iOS made $120k in 1 year",
      "type": "story"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 31534972,
      "score": 1,
      "time": 1653685952,
      "title": "Why Do Action Figures All Look Like They’re Jerking Off?",
      "type": "story",
      "url": "https://melmagazine.com/en-us/story/action-figures-masturbating"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31534936,
      "score": 1,
      "time": 1653685808,
      "title": "GitTorrent: A Decentralized GitHub (2015)",
      "type": "story",
      "url": "https://blog.printf.net/articles/2015/05/29/announcing-gittorrent-a-decentralized-github/"
    },
    {
      "by": "dsco",
      "descendants": 0,
      "id": 31534934,
      "score": 1,
      "time": 1653685807,
      "title": "Web3 Was Supposed to Save the Internet. It Has a Long Way to Go",
      "type": "story",
      "url": "https://www.barrons.com/articles/web3-crypto-coins-startups-51653531787"
    },
    {
      "by": "clairity",
      "descendants": 0,
      "id": 31534888,
      "score": 1,
      "time": 1653685508,
      "title": "Private Click Measurement: Conversion Fraud Prevention, Replace Tracking Pixels",
      "type": "story",
      "url": "https://webkit.org/blog/12566/private-click-measurement-conversion-fraud-prevention-and-replacement-for-tracking-pixels/"
    },
    {
      "by": "joaoh82",
      "descendants": 0,
      "id": 31534863,
      "score": 1,
      "time": 1653685401,
      "title": "Mayor Run – Let's see how corrupt you are",
      "type": "story",
      "url": "https://www.playmayorrun.com"
    },
    {
      "by": "trauco",
      "descendants": 0,
      "id": 31534817,
      "score": 1,
      "time": 1653685213,
      "title": "Building and running WRF on a Raspberry Pi (2021)",
      "type": "story",
      "url": "http://chrisdearden.net/WRFRPi/"
    },
    {
      "by": "ramonrue",
      "descendants": 0,
      "id": 31534794,
      "score": 1,
      "time": 1653685106,
      "title": "Magic Doesn‘t Happen, Especially Not in Business",
      "type": "story",
      "url": "https://www.republik.ch/2022/05/26/magic-doesn-t-happen-especially-not-in-business"
    },
    {
      "by": "manholio",
      "descendants": 0,
      "id": 31534780,
      "score": 1,
      "time": 1653685029,
      "title": "A Bored Ape Lawsuit Won’t Set the NFT Precedent Seth Green Wants",
      "type": "story",
      "url": "https://www.wired.com/story/seth-green-bored-ape-nft-stolen/"
    },
    {
      "by": "kibaffo33",
      "descendants": 0,
      "id": 31534778,
      "score": 1,
      "time": 1653685027,
      "title": "Tempo, a lightweight timestamp decoder for macOS",
      "type": "story",
      "url": "https://github.com/kibaffo33/Tempo"
    }
  ]
}