{
  "stories": [
    {
      "by": "Lantt",
      "descendants": 0,
      "id": 31163709,
      "score": 1,
      "time": 1650944612,
      "title": "Learn Go with Tests",
      "type": "story",
      "url": "https://quii.gitbook.io/learn-go-with-tests/"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 31163704,
      "score": 1,
      "time": 1650944532,
      "title": "Probing My SSD's Latency",
      "type": "story",
      "url": "https://flak.tedunangst.com/post/probing-my-ssds-latency"
    },
    {
      "by": "cheerioty",
      "descendants": 0,
      "id": 31163692,
      "score": 1,
      "time": 1650944316,
      "title": "To be a generalist (Inside Industrial Light & Magic)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=nNZgG8htns0"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 31163688,
      "score": 1,
      "time": 1650944280,
      "title": "What a UX Career Looks Like Today",
      "type": "story",
      "url": "https://www.nngroup.com/articles/ux-career-advice/"
    },
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 31163683,
      "score": 1,
      "time": 1650944227,
      "title": "Open source, decentralized alternative to today’s privately owned public forums",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2LvbFg1aaFE"
    },
    {
      "by": "laurex",
      "descendants": 0,
      "id": 31163682,
      "score": 1,
      "time": 1650944224,
      "title": "Internet ‘algospeak’ is changing our language in real time",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2022/04/08/algospeak-tiktok-le-dollar-bean/"
    },
    {
      "by": "archeantus",
      "descendants": 0,
      "id": 31163681,
      "score": 1,
      "text": "I have spent my entire career in the app development industry. I have many years of experience as an engineer, and many years of experience as a manager of native app engineers. I’m very entrepreneurially minded and I’m always looking for an app to make that can give me a reason to quit my day job.<p>I recently connected with a very successful entrepreneur who is far more wealthy than I could ever hope to be and we’ve been riffing on an app idea for a few months and we’re to the point where we’re clear on what we want to build, and he’s willing to pay for the development costs while I manage the team of developers.<p>We’re excited and nearly ready to pull the trigger!<p>But…there’s this nagging detail about the current market not exactly being void of competition that is giving me pause. I recognize it’s impossible these days to enter a market and be the only player, but there are a good number of apps that do small portions of what we want to do. Our vision for this tool is to make a large app that brings all of the functionality our customer could want into one app. As it happens, most of the main features exist in smaller apps, in varying degrees, on the App Store today but they are all disjointed. For our customer to get the quality of experience we want to deliver they’d need like five different apps, and then even then the apps don’t communicate with each other. So the experience for the customer is not seamless or pleasant.<p>So my question is about our fundamental approach to strategy. We didn’t set out to make a mega app that incorporated all of these apps under one roof, rather, we dreamed up what the ultimate experience would be for our customer and we happened to discover that smaller players had developed some pieces already in separate apps.<p>What are some things to keep in mind when deciding to enter a market? Is it a red flag when most of what we want to do is mostly available today, just in a lower quality&#x2F;piece meal offering? If our value prop was to merely do everything well under one roof and for a reasonable price, is that enough to get compete against the smaller apps that already have a lead and somewhat of a following?<p>I love the vision we have for the product, but the existence of many smaller apps (many of which have not succeeded at all) give me reason to pause. But it very well could be the case that I’m being a scaredy-cat and I just need to plow through this.<p>Any thoughts or advice would be appreciated!",
      "time": 1650944220,
      "title": "Ask HN: What strategy should I use to determine whether to enter an app market?",
      "type": "story"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 31163675,
      "score": 1,
      "time": 1650944079,
      "title": "Mouse DPI, Sensitivity, and Precision",
      "type": "story",
      "url": "https://www.chockrickbeargaming.com/Articles/Mouse%20DPI%20and%20Sensitivity/"
    },
    {
      "by": "JNRowe",
      "descendants": 0,
      "id": 31163672,
      "score": 1,
      "time": 1650944068,
      "title": "A Driver on the GPU",
      "type": "story",
      "url": "https://www.basnieuwenhuizen.nl/a-driver-on-the-gpu/"
    },
    {
      "by": "nodesocket",
      "descendants": 0,
      "id": 31163657,
      "score": 1,
      "time": 1650943877,
      "title": "Biden reverses move to open up more oil drilling in Arctic",
      "type": "story",
      "url": "https://www.cnbc.com/2022/04/25/biden-reverses-trump-move-to-open-up-more-oil-drilling-in-arctic.html"
    }
  ]
}