{
  "stories": [
    {
      "by": "rapnie",
      "descendants": 0,
      "id": 32052684,
      "score": 2,
      "time": 1657518728,
      "title": "IETF Draft: Centralization, Decentralization, and Internet Standards",
      "type": "story",
      "url": "https://www.ietf.org/archive/id/draft-nottingham-avoiding-internet-centralization-05.html"
    },
    {
      "by": "tenfourty",
      "descendants": 0,
      "id": 32052679,
      "score": 1,
      "time": 1657518667,
      "title": "Five Reasons to Use Kubernetes",
      "type": "story",
      "url": "https://www.jeremybrown.tech/9-five-reasons-to-use-kubernetes/"
    },
    {
      "by": "anotherevan",
      "descendants": 0,
      "id": 32052669,
      "score": 3,
      "time": 1657518562,
      "title": "New in Calibre 6.0",
      "type": "story",
      "url": "https://calibre-ebook.com/new-in/fifteen"
    },
    {
      "by": "iflypropplanes",
      "descendants": 0,
      "id": 32052666,
      "score": 2,
      "text": "A few days ago, I was in the lobby of my hotel on a Greek island. A woman was at the front desk very upset about having not been upgraded. She was yelling at the staff and causing a real scene. She left with everyone visibly shaken.  Chatting with them a little after, this sounds like an all too common scene.<p>This morning, as promised, a 1 star rating shows up on every review platform. She claims the hotel is ugly, the staff was rude and racist, and even that someone had pushed her.<p>Everything about this claim is a lie. My partner and have been here 4 days and everything has been fantastic. Every single person on the staff goes out of their way to be helpful and the property is beautiful.<p>Looking more at their reviews online, there are a handful of 1 star reviews with some crazy claims. One even looks to have photoshopped an image to make the pool appear dirty. Almost every 1 star review mentioned not being upgraded.<p>I&#x27;ve become especially sensitive to this after listing a property on Airbnb last year. Almost all guests and reviews are wonderful, thoughtful comments about my home and it&#x27;s location. But then occasionally get a 3 star review with an explanation of something like &quot;the dryer vent had lint in it&quot;. Come on...you&#x27;re staying in a cabin in the woods, not the St Regis.<p>As a business owner and a technologist, I feel a ton of empathy for people that have it all on the line and can be so vulnerable. How can rating systems better account for&#x2F;normalize against this kind of behavior?",
      "time": 1657518493,
      "title": "Does the internet have a 1 star review problem?",
      "type": "story"
    },
    {
      "by": "leonry",
      "descendants": 0,
      "id": 32052661,
      "score": 1,
      "time": 1657518447,
      "title": "Evergrande unit Hengda's onshore bondholders reject repayment delay",
      "type": "story",
      "url": "https://asia.nikkei.com/Business/Markets/China-debt-crunch/Evergrande-unit-Hengda-s-onshore-bondholders-reject-repayment-delay"
    },
    {
      "by": "khushbu_m",
      "descendants": 0,
      "id": 32052652,
      "score": 1,
      "time": 1657518330,
      "title": "Understanding Monitoring and Observability and How to Implement for Your Company",
      "type": "story",
      "url": "https://www.crestdatasys.com/blogs/observability-vs-monitoring-quick-guide"
    },
    {
      "by": "irisedhaze",
      "descendants": 0,
      "id": 32052591,
      "score": 2,
      "text": "This is quite a personal post. I just want to ask this community&#x27;s advice because I feel like my life is going in a downward spiral already.<p>First off, I&#x27;m not from the US or any country which has a major impact on global tech development. Most tech jobs here are either in big local companies or in outsourcing.<p>I&#x27;m currently in my senior year but has been struggling to finish my senior project for more than two years already (yes, I&#x27;ve been a senior for that long) because I&#x27;m too afraid to graduate and enter the tech field. I&#x27;m actually losing interest in my project as time goes by and my passion for most things tech-related has been dwindling. Trying to do anything about it just makes me think how much &quot;I hate this work.&quot;<p>Some of my peers in other fields actually say they envy me for choosing this degree because based on their perception, it could lead me to a job that could make me well-off. However, seeing how much work I need to do (i.e. through constant studying and learning) just to have a steady career, it&#x27;s making me question if I really made the right choice in terms of my education and possible career paths. Moreover, I&#x27;m starting to feel the pressure of the job market seeing how more people are entering this field because &quot;this is where the money is.&quot; Not to mention the job cuts I&#x27;ve been hearing about because of global recession.",
      "time": 1657517667,
      "title": "Fear of failing in this field is giving me severe senioritis",
      "type": "story"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 32052475,
      "score": 1,
      "time": 1657516358,
      "title": "What Is Becovi Search?",
      "type": "story",
      "url": "https://thenewleafjournal.com/leaf/what-is-becovi-search/"
    },
    {
      "by": "samizdis",
      "descendants": 1,
      "id": 32052451,
      "kids": [
        32052474
      ],
      "score": 1,
      "time": 1657516135,
      "title": "UK response to China's tech ambitions labelled 'incoherent and muted'",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/11/tech_and_uk_foreign_policy/"
    },
    {
      "by": "kaycebasques",
      "descendants": 0,
      "id": 32052442,
      "score": 1,
      "time": 1657516066,
      "title": "Bay Area Vintage Base Ball",
      "type": "story",
      "url": "https://www.bavbb.com"
    }
  ]
}