{
  "stories": [
    {
      "by": "aaronng91",
      "descendants": 0,
      "id": 29690845,
      "score": 1,
      "time": 1640509507,
      "title": "Some Background on Our Views Regarding Advanced Artificial Intelligence",
      "type": "story",
      "url": "https://www.openphilanthropy.org/blog/some-background-our-views-regarding-advanced-artificial-intelligence"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29690835,
      "score": 1,
      "time": 1640509365,
      "title": "Measurable Function",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Measurable_function"
    },
    {
      "by": "JohannesEckert",
      "descendants": 0,
      "id": 29690803,
      "score": 1,
      "time": 1640508756,
      "title": "Climate Change Impacts on California Central Valley",
      "type": "story",
      "url": "https://cleantechnica.com/2021/12/18/climate-change-impacts-on-california-central-valley-warning-shot/"
    },
    {
      "by": "fatih-erikli",
      "descendants": 0,
      "id": 29690795,
      "score": 1,
      "time": 1640508632,
      "title": "Pattern Matching in TypeScript",
      "type": "story",
      "url": "https://github.com/fatih-erikli/pattern-select"
    },
    {
      "by": "Santosh83",
      "descendants": 0,
      "id": 29690775,
      "score": 5,
      "time": 1640508284,
      "title": "Desmond Tutu, anti-apartheid icon, dies at 90",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/dec/26/archbishop-desmond-tutu-giant-in-fight-against-apartheid-south-africa-dies-at-90"
    },
    {
      "by": "rognjen",
      "descendants": 0,
      "id": 29690769,
      "score": 2,
      "time": 1640508168,
      "title": "The Container Throttling Problem",
      "type": "story",
      "url": "https://danluu.com/cgroup-throttling/"
    },
    {
      "by": "ss108",
      "descendants": 0,
      "id": 29690759,
      "score": 1,
      "text": "I attended a top 5 law school and am currently a first-year in biglaw. Previously, I was a self-taught dev at small startups in LA. Nothing sophisticated, just standard MVC apps. I was mostly back-end (my front-end skills do include JavaScript, but not include CSS or ability to make things look pretty, etc) and I was able to maintain and deploy web apps all on my own. The last thing I did before law school was an accounting app I built from scratch and of which I was functionally the CTO. Technologies I used during my career: Python, NodeJS&#x2F;TypeScript, C#, React, Postgres.<p>I want to go back into tech. Assuming I want to be a software developer again:<p>1. What should I focus on learning to get a backend developer job that pays 180k+ in a major market (NY, LA, or SF)? Things I was starting to find interesting towards the end of the main part of my career include scripting to automate build processes, integration tests, and I guess what one could call crude architectural stuff that probably isn&#x27;t worth the name (Should I build the data layer using a &quot;repository manager&quot; class for each table and inheritance? At what point is it not over-engineering to bring in a cache?).<p>Trying to enumerate those examples brought home that I did not do anything remotely sophisticated during my career lol :( Maybe if I don&#x27;t know the answers to basic questions like that, those are the places to start.<p>Anyways, what are some of the next big things? One thing I think I might like is natural language processing, maybe I should start there.<p>2. Suppose I want to throw money at this (since I have some now)--is that even possible? For example, any recommendations for coding interview tutoring (which would be something to do near the end of the transition, after several months or more of self-learning)? I was pretty bad at dev interviews the last time I did them several years ago.<p>Please note:<p>Why I went into law in the first place and why I want to jump back into tech is not really something I want to hash out in this thread. Suffice to say, my interest in leaving is not because biglaw is awful or high-pressure or the people are toxic or anything like that, as some might think. I basically got very lucky: I am at one of the best firms in biglaw in terms of work-life balance and cordiality. It&#x27;s certainly the only one I know of that&#x27;s like this. My reasons for wanting to go back into tech have more to do with things that I miss about tech and business, such as the creative aspect of working on a product, the mission-orientation, etc. I know some of you will say &quot;reflect on why you stopped wanting to be a dev in the first place&quot;, but please suspend that argument for purposes of this thread.<p>Let&#x27;s assume for now that my timeline for leaving biglaw is probably about a year hence.<p>Thanks for all advice in advance.",
      "time": 1640508071,
      "title": "Ask HN: Was a dev. Became a lawyer. How do I become a dev again?",
      "type": "story"
    },
    {
      "by": "viebel",
      "descendants": 0,
      "id": 29690748,
      "score": 1,
      "time": 1640507887,
      "title": "Why Clojure in a single picture (with less than 1000 words)",
      "type": "story",
      "url": "https://orgpad.com/o/D6TrZny7tNhYqWygzax7Wx"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29690747,
      "score": 2,
      "time": 1640507880,
      "title": "An Ancient Greek Astronomical Calculation Machine Reveals New Secrets",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/an-ancient-greek-astronomical-calculation-machine-reveals-new-secrets/"
    },
    {
      "by": "anh_n",
      "descendants": 1,
      "id": 29690742,
      "kids": [
        29690757
      ],
      "score": 1,
      "time": 1640507812,
      "title": "Show HN: Workout Live – A new free app to view live heart rate from Apple Watch",
      "type": "story",
      "url": "https://apps.apple.com/us/app/workout-live-for-apple-watch/id1599604990"
    }
  ]
}