{
  "stories": [
    {
      "by": "adamdegas",
      "descendants": 0,
      "id": 31521217,
      "score": 1,
      "text": "For some reason, I can work all day from my Lenovo Ideapad 310 laptop, but, as soon as I moved my desktop and ASUS monitors into the room, I&#x27;ve been unable to work for more than an hour before eye strain kicks in.<p>I&#x27;ve been left with a choice: neck&#x2F;back strain from the laptop or premature aging&#x2F;eye strain&#x2F;lack of sleep from the desktop. I&#x27;ve chosen the neck&#x2F;back strain. I would like to be able to use the desktop because it&#x27;s far faster, has far more RAM, etc.<p>One of the desktop monitors is ASUS PB258Q. I can&#x27;t ID the other one, but it&#x27;s also ASUS. I wake up tired after using the desktop monitors, but it also coincides with my antihistamine intake due to spring&#x2F;summer season. I seem to be developing dark brown &quot;age spots&quot; after I wake up if I use the desktop monitors for a prolonged length of time (more than two hours), and I think it&#x27;s the combination of the monitors making me tired + the antihistamines making me more tired. I can&#x27;t tell if the dark brown spots will go away or if they&#x27;re permanent. They seem to be developing under the eyes and on my nose. They&#x27;re not baggy eyes; they&#x27;re smaller dark brown spots around the same region.<p>I&#x27;ve read that monitors can reflect the sunlight&#x27;s UV rays that causes skin damage. (The window is behind me.) I&#x27;ve just moved the desktop monitors out. I&#x27;ve tried every setting on the ASUS monitors: blue light filter (on every level), adjust brightness, adjust contrast, and so on.<p>Would love to be able to work from my desktop. Anyone else dealt with similar issues that can offer advice? Thank you!",
      "time": 1653586796,
      "title": "Ask HN: How to deal with eye strain and skin damage from computer monitors?",
      "type": "story"
    },
    {
      "by": "grogu88",
      "descendants": 0,
      "id": 31521200,
      "score": 1,
      "time": 1653586726,
      "title": "Pfizer to Sell Vaccines, Drugs at Low Prices to Poorer Countries",
      "type": "story",
      "url": "https://www.wsj.com/articles/pfizer-to-sell-vaccines-drugs-at-low-prices-to-poorer-countries-11653462180"
    },
    {
      "by": "angrygoat",
      "descendants": 0,
      "id": 31521196,
      "score": 1,
      "time": 1653586707,
      "title": "Firefox 86 Introduces Total Cookie Protection",
      "type": "story",
      "url": "https://blog.mozilla.org/security/2021/02/23/total-cookie-protection/"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31521162,
      "score": 1,
      "time": 1653586527,
      "title": "Windows Subsystem for Linux 2 splashes down on Win Server 2022",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/26/wsl2_windows_server_2022/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31521156,
      "score": 1,
      "time": 1653586511,
      "title": "Demonstration of fault-tolerant universal quantum gate operations",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-022-04721-1"
    },
    {
      "by": "akeck",
      "descendants": 0,
      "id": 31521147,
      "score": 3,
      "time": 1653586460,
      "title": "Ukraine invasion may be start of ‘third world war’, says George Soros",
      "type": "story",
      "url": "https://www.theguardian.com/business/2022/may/24/ukraine-invasion-may-be-start-of-third-world-war-says-george-soros"
    },
    {
      "by": "vyrotek",
      "descendants": 0,
      "id": 31521127,
      "score": 1,
      "time": 1653586364,
      "title": "Introducing port tunneling in Visual Studio for ASP.NET Core projects",
      "type": "story",
      "url": "https://devblogs.microsoft.com/visualstudio/introducing-private-preview-port-tunneling-visual-studio-for-asp-net-core-projects/"
    },
    {
      "by": "vfclists",
      "descendants": 1,
      "id": 31521124,
      "kids": [
        31521140
      ],
      "score": 3,
      "time": 1653586345,
      "title": "Amazon investors nuke ethics overhaul and say yes to $212m CEO pay",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/26/amazon_investors_kill_15_proposals/"
    },
    {
      "by": "TekMol",
      "descendants": 2,
      "id": 31521110,
      "kids": [
        31521159
      ],
      "score": 1,
      "text": "One of the main arguments against Bitcoin is its energy consumption.<p>On the other hand, it is often said that there will be no new blockchain that achieves what Bitcoin has achieved: Being distributed without a premine that makes the founders rich and with no way for the people in power to inflate the supply.<p>What would happen is an ERC-20 token would be created that is distributed just as Bitcoin. In a way that everyone who holds Bitcoin automatically owns the same amount of this token? A fork of Bitcoin on the Ethereum blockchain, so to say.",
      "time": 1653586268,
      "title": "Ask HN: Could Bitcoin be replaced by an ERC-20 token?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31521079,
      "score": 3,
      "time": 1653586125,
      "title": "Eric Schmidt’s Hidden Influence over US Defense Spending",
      "type": "story",
      "url": "https://www.techtransparencyproject.org/articles/eric-schmidts-unseen-influence-over-us-defense-spending"
    }
  ]
}