{
  "stories": [
    {
      "by": "aberoham",
      "descendants": 0,
      "id": 29731364,
      "score": 1,
      "time": 1640819572,
      "title": "ICANN is Blocking 23 gTLD transfers over blockchain fears",
      "type": "story",
      "url": "http://www.domainincite.com/27303-icann-is-blocking-23-gtld-transfers-over-blockchain-fears"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29731333,
      "score": 1,
      "time": 1640819369,
      "title": "GCC 12 Adds Support for Using the Mold Linker",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Mold-Linker"
    },
    {
      "by": "ak391",
      "descendants": 0,
      "id": 29731320,
      "score": 1,
      "time": 1640819305,
      "title": "Show HN: JoJoGAN, face to JoJo, Disney and Arcane style",
      "type": "story",
      "url": "https://huggingface.co/spaces/akhaliq/JoJoGAN"
    },
    {
      "by": "kevinslashslash",
      "descendants": 0,
      "id": 29731317,
      "score": 2,
      "text": "Just got this email from LastPass. I&#x27;m not satisfied with their explanation though.<p>As part of our ongoing commitment to security, we regularly monitor our services for actual, suspected, or attempted malicious or unusual activity. When our systems detect unusual login activity from different devices or locations we send an automated email for you to confirm the activity. Recently, you may have received one of these emails from us.<p>If the login attempt was you, and if you haven’t done so already, please make sure to verify your device and&#x2F;or location. You’ll continue to receive emails like this when, for example, you log in from new devices or locations in our effort to keep your information secure. We also encourage you to reference our blog for best practices for keeping your account secure.<p>If the login attempt was not you, allow us to explain what happened. We recently received reports of an uptick of users receiving blocked access emails. Our investigation found that some of these security alerts, which were sent to a limited subset of LastPass users, were likely triggered in error. As a result, we have adjusted our security alert systems and this issue has since been resolved.<p>At this time, there is no indication that your LastPass account or your credentials were breached or compromised. However, out of an abundance of caution, we recommend, if the login attempt was not you, that you reset your Master Password.<p>Lastly, it is important to remember that LastPass utilizes a zero-knowledge security model that is designed to ensure that customer data remains protected. When a LastPass user creates their Master Password, it’s used to generate a unique encryption key. The Master Password and the encryption key stay local on the user’s device – they are never sent to or shared with LastPass.<p>We apologize for any concern or inconvenience that these alerts may have caused. LastPass was built with security in mind and includes various features, including notifications for failed logins, trusted device verification, account recovery, and more. Read more about them on our blog.<p>Thank you for being a valued LastPass customer.",
      "time": 1640819263,
      "title": "LastPass Login Attempted Activity Blocked – More Information",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29731297,
      "score": 1,
      "time": 1640819107,
      "title": "Implant.ARM.iLOBleed.a",
      "type": "story",
      "url": "https://threats.amnpardaz.com/en/2021/12/28/implant-arm-ilobleed-a/"
    },
    {
      "by": "craigkerstiens",
      "descendants": 0,
      "id": 29731290,
      "score": 1,
      "time": 1640819059,
      "title": "Reversible vs. Irreversible Decisions",
      "type": "story",
      "url": "https://www.craigkerstiens.com/2021/12/29/guidance-for-scaling-reversible-vs.-irreversible-decisions/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29731288,
      "score": 2,
      "time": 1640819048,
      "title": "Bad reviews of Yankee Candle might predict waves of Covid-19",
      "type": "story",
      "url": "https://www.sfgate.com/shopping/article/reviews-of-Yankee-Candle-predict-waves-of-covid-16726068.php"
    },
    {
      "by": "amadeuspagel",
      "descendants": 0,
      "id": 29731286,
      "score": 1,
      "time": 1640819019,
      "title": "Startup Idea: A radio replacement based on podcasts",
      "type": "story",
      "url": "https://amadeuspagel.substack.com/p/startup-idea-a-radio-replacement"
    },
    {
      "by": "vardthomas",
      "descendants": 1,
      "id": 29731270,
      "kids": [
        29731278
      ],
      "score": 1,
      "time": 1640818940,
      "title": "The Collatz Conjecture: Finding Structure in the Randomness",
      "type": "story",
      "url": "https://drive.google.com/file/d/1VIdATCOduWarTSL3kK5TbEI40InywK1k/view"
    },
    {
      "by": "pkdpic",
      "descendants": 1,
      "id": 29731260,
      "kids": [
        29731319,
        29731261
      ],
      "score": 2,
      "time": 1640818864,
      "title": "Show HN: A Space for Art Made by Software Developers",
      "type": "story",
      "url": "https://tombetthauser.github.io/greensquare/"
    }
  ]
}