{
  "stories": [
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30191126,
      "score": 1,
      "time": 1643887478,
      "title": "Gee, I wonder how Apple Podcasts suddenly became a five-star app",
      "type": "story",
      "url": "https://www.theverge.com/2022/2/2/22914612/apple-podcasts-app-rating-user-reviews-problem"
    },
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 30191121,
      "score": 1,
      "time": 1643887461,
      "title": "The Digital Revolution",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Digital_Revolution"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 30191117,
      "score": 1,
      "time": 1643887429,
      "title": "Meta's miss creates Big Tech divide: who's got the data",
      "type": "story",
      "url": "https://www.reuters.com/technology/metas-miss-creates-big-tech-divide-whos-got-data-2022-02-03/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30191115,
      "score": 1,
      "time": 1643887420,
      "title": "I Feel, Therefore I Am",
      "type": "story",
      "url": "https://nautil.us/i-feel-therefore-i-am-13869/"
    },
    {
      "by": "JoelJacobson",
      "descendants": 0,
      "id": 30191108,
      "score": 1,
      "time": 1643887363,
      "title": "ISO Technical Outage",
      "type": "story",
      "url": "https://www.iso.org/home.html"
    },
    {
      "by": "jjgreen",
      "descendants": 0,
      "id": 30191102,
      "score": 1,
      "time": 1643887287,
      "title": "How the Establishment Functions",
      "type": "story",
      "url": "https://www.craigmurray.org.uk/archives/2022/02/how-the-establishment-functions/"
    },
    {
      "by": "coaltunbey",
      "descendants": 0,
      "id": 30191101,
      "score": 1,
      "time": 1643887286,
      "title": "How Micromobility Affects the Climate",
      "type": "story",
      "url": "https://ethz.ch/en/news-and-events/eth-news/news/2022/01/how-micromobility-affects-climate.html"
    },
    {
      "by": "estas",
      "descendants": 0,
      "id": 30191092,
      "score": 1,
      "time": 1643887179,
      "title": "Infrared Laser Spectroscopy at Your Fingertips",
      "type": "story",
      "url": "https://compoundsemiconductor.net/article/114145/Infrared_laser_spectroscopy_at_your_fingertips/technical"
    },
    {
      "by": "samuell",
      "descendants": 0,
      "id": 30191081,
      "score": 1,
      "text": "I have around 9 km to work, and bikes to work most days. I have a really hard time finding time to get out on runs often enough though, and so would like to run to work and back 1 or 2 days a week.<p>I can not really plan for each day if I will stay at home or be at work though, so I need to carry my laptop with me (a 14&quot; Dell Latitude with an SSD) in my backpack.<p>I was getting worried about the wear on the laptop because of the bouncing when running though, and so I was interested to hear others&#x27; experiences:<p>- Did you get any hardware problems from running with your laptop?<p>- Have you found any solution to minimize the bouncing?<p>- Are there certain laptops that are more suitable for this than others?",
      "time": 1643887042,
      "title": "Ask HN: Hardware problems from running with a laptop in a backpack?",
      "type": "story"
    },
    {
      "by": "cosmorocket",
      "descendants": 0,
      "id": 30191017,
      "score": 1,
      "text": "I am almost 40 and have been working as a fullstack and frontend web developer for last 12 years as a contractor or a full-time employee for different companies. I learnt and familiar with quite a bunch of tech stack, libraries and tooling around it, using them when needed.<p>During last 3-4 years I had to end my relationship with with 3 clients&#x2F;employers due to me being slow in producing code. The reason was always - I cannot deliver as much as my colleagues could or as the employer expected me to.<p>I am good at communication. People I work with always say I am nice to work with, adding vitality to the daily team work, but eventually things go worse as I am usually slower than my colleagues.<p>I sincerely love technology, web stuff, API, structuring, organising and connecting things together, but it ultimately takes more time for me to get things done than other people.<p>The problem is quite clear to me but I don’t see the way to improve the situation. I cannot deliver faster because I already optimise everything I can. Even during the tech interviews (one was just today) I see that I don’t achieve the expected result.<p>If the time pressure is lower, at the end I deliver high-quality readable code, but the time is always the part of the formula, and I understand it, because business needs everything to be delivered faster and sooner.<p>I feel quite sad and depressed when I see how easily and quickly my colleagues get into the problems and find solutions while I have to spend more time and as a result I question myself as a professional.<p>How can I improve or should I lower my expectations for the employers and look for less-demanding lower-paying clients&#x2F;companies? Should I switch to some other tech area where the time to deliver is not the key factor (are there any)? May be there are techniques to improve my thought process?<p>Any advise is appreciated as I feel like if things keep going this way, I won’t be able to keep staying on a par with other developers around.",
      "time": 1643886406,
      "title": "Ask HN: I am a slow developer. What can I do with this?",
      "type": "story"
    }
  ]
}