{
  "stories": [
    {
      "by": "stevesearer",
      "descendants": 0,
      "id": 30614692,
      "score": 1,
      "text": "One moment which sticks out was when I was about 12 years old.<p>My parents weren’t home and the phone rang. I picked up and the person said they were trying to reach my dad. I said they weren’t home and they asked me to take down their name and number.<p>As they were telling me their phone number I was saying “ok” after each pause but without writing the message down.<p>When we were done they politely asked me to read the number back.<p>After stammer and saying “uh” a bunch of times, they never addressed that I was lying to them and simply restarted. I took down their name and number this time.<p>25 years later, I still remember the feeling I had, but looking back am most impressed that the lesson didn’t actually take any words. Perhaps it was the lack of a lesson that made it stick.",
      "time": 1646835926,
      "title": "Ask HN: Times you’ve learned something without being taught?",
      "type": "story"
    },
    {
      "by": "karmaniak",
      "descendants": 0,
      "id": 30614687,
      "score": 1,
      "time": 1646835894,
      "title": "Apple turns monitor height adjustment into a $400 upsell",
      "type": "story",
      "url": "https://www.engadget.com/apples-400-height-adjustable-studio-display-stand-is-a-relative-bargain-222714407.html"
    },
    {
      "by": "kenarsa",
      "descendants": 0,
      "id": 30614682,
      "kids": [
        30614723
      ],
      "score": 2,
      "time": 1646835862,
      "title": "20MB is all you need for speech recognition",
      "type": "story",
      "url": "https://medium.com/picovoice/20-mb-is-all-you-need-for-speech-to-text-7e701b7f6bfc"
    },
    {
      "by": "softwarebeware",
      "descendants": 0,
      "id": 30614675,
      "score": 1,
      "time": 1646835846,
      "title": "Are there more wheels or doors in the world?",
      "type": "story",
      "url": "https://www.theguardian.com/technology/shortcuts/2022/mar/08/are-there-more-wheels-or-doors-in-the-world-why-we-cant-resist-an-internet-debate"
    },
    {
      "by": "intunderflow",
      "descendants": 1,
      "id": 30614673,
      "kids": [
        30614700
      ],
      "score": 1,
      "time": 1646835839,
      "title": "Show HN: Chat in Your Native Language",
      "type": "story",
      "url": "https://bilingual.chat"
    },
    {
      "by": "karmaniak",
      "descendants": 0,
      "id": 30614672,
      "score": 1,
      "time": 1646835837,
      "title": "Apple's pricey new monitor comes with a free 1m cable. A 1.8m cable costs $129",
      "type": "story",
      "url": "https://www.businessinsider.com/the-thunderbolt-4-pro-versions-pricer-at-129-or-159-2022-3"
    },
    {
      "by": "ScottWRobinson",
      "descendants": 0,
      "id": 30614647,
      "score": 1,
      "time": 1646835699,
      "title": "How to Do Single User Performance Testing – Performance Test Strategy",
      "type": "story",
      "url": "https://www.perfecto.io/blog/single-user-performance-testing"
    },
    {
      "by": "alicewinthrop",
      "descendants": 0,
      "id": 30614646,
      "score": 1,
      "text": "Finding a time to get together can turn into a flood of texts back and forth as people throw out times and shoot them down over and over again.<p>Frustrated by this, I started TimeCheck as a side project with the goal of making it easier to find a time to gather for drinks, a meeting, or to play games&#x2F;sports&#x2F;music.<p>TimeCheck takes a snapshot of each person&#x27;s availability for the selected dates, compares them, then presents the date&#x2F;times when all are free.<p>Everyone in the group can vote on a preferred time from the results and the person that created the TimeCheck confirms the final time.<p>Then you one-tap add the confirmed time to your iCal.<p>All via one app bubble inside an iMessage chat.<p>In the future I&#x27;d like to expand the scope so that TimeCheck works for iOS and Android users in the same chat, and make a WhatsApp version. The app already supports timezones but it only works for iCal right now.<p>TimeCheck is available for beta testing via Testflight.<p>If you would like to try it out please visit: https:&#x2F;&#x2F;timecheck.us<p>Feedback from early adopters will shape the next iteration so if this could possibly be useful to you please give it a try and let me know what I can do to make it better for your use case!<p>If you have comments on the merits of the idea, your pain points when scheduling, the landing page, experience with other scheduling apps... please share them here. Thank you!",
      "time": 1646835681,
      "title": "Show HN: TimeCheck compares availability to find times when everyone is free",
      "type": "story"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 30614626,
      "kids": [
        30614637
      ],
      "score": 1,
      "time": 1646835564,
      "title": "Twitter Spaces: Ask Ukrainian Open-Source Software Devs About War",
      "type": "story",
      "url": "https://twitter.com/i/spaces/1OyJADAEoAgGb/peek"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 30614623,
      "score": 1,
      "time": 1646835547,
      "title": "Some tiny personal programs I've written",
      "type": "story",
      "url": "https://jvns.ca/blog/2022/03/08/tiny-programs/"
    }
  ]
}