{
  "stories": [
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 30949588,
      "score": 1,
      "time": 1649361234,
      "title": "Pink Floyd – Hey Hey Rise Up (Feat. Andriy Khlyvnyuk of Boombox)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=saEpkcVi1d4"
    },
    {
      "by": "wppick",
      "descendants": 0,
      "id": 30949580,
      "score": 1,
      "text": "Want to just put this idea out there for the feasibility of a crypto currency backed not by solving hard computations, but instead for producing clean, pure water.<p>High quality water and availability seems to be trending in the direction of scarcity. You might think this is ridiculous, since there appears to be an unlimited supply of tap water, but how clean is that water? Tap water is increasingly becoming polluted in ways hard to clean. Microplastics, metals, hormones like estrogen, possible contamination by farming, industry.<p>What if the work done to mine the crypto currency was the cleaning of water. Either waste water, salt water, or tap water locally (in the home, or apartment complex, or neighbourhood level).<p>It would need a way to be cheat-proof, but there could be a water-exchange where you can consume or inject clear water and receive&#x2F;spend crypto-currency.<p>How harebrained of an idea is it? The fundamental problem is there, but the execution would need to be heavily regulated (possibly limited to highly trusted actors). What if a future fiat currency were not backed by something like gold, or Bitcoin, but clean water?",
      "time": 1649361205,
      "title": "Proposal: Crypto Mining for Clean Water",
      "type": "story"
    },
    {
      "by": "pwillia7",
      "descendants": 0,
      "id": 30949562,
      "score": 1,
      "time": 1649361103,
      "title": "Howard Zinn in his own words (2011)",
      "type": "story",
      "url": "https://blogs.umb.edu/joinercenter/2011/02/22/howard_zinn/"
    },
    {
      "by": "tooltower",
      "descendants": 0,
      "id": 30949545,
      "score": 1,
      "time": 1649361015,
      "title": "Tanis: Fossil of dinosaur killed in asteroid strike found, scientists claim",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-61013740"
    },
    {
      "by": "yagizc",
      "descendants": 0,
      "id": 30949534,
      "score": 1,
      "text": "Hi everybody,<p>I&#x27;m the founder of Phenixio - a real-time Bitcoin payments platform. We&#x27;ve been developing it for the last couple of years, and I am happy to announce that it is finally ready for a test drive.<p>We&#x27;ve built our services on top of Lightning Network. It is the Layer-2 solution for Bitcoin that makes real-time payments possible. These Bitcoin payments are almost faster than credit card processing and only take about 1-2 seconds.<p>With Phenixio, you will access this payments network without going through any protocol-level complexity. You could start accepting payments from anyone with a BTC&#x2F;LN wallet and from anywhere in the world.<p>It is still early days for us, and we are looking for pilot users who can provide some valuable feedback. Our API is quite simple, so you can easily integrate Bitcoin payments with your website. I should also mention that you don&#x27;t need any Bitcoin knowledge to use it.<p>Let me know if you are interested. I will give you access to our testnet API. API reference: <a href=\"https:&#x2F;&#x2F;testnet.phenixio.com&#x2F;api&#x2F;docs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;testnet.phenixio.com&#x2F;api&#x2F;docs&#x2F;</a>",
      "time": 1649360958,
      "title": "Show HN: Phenixio – Real-time Bitcoin payments platform [API]",
      "type": "story",
      "url": "https://phenixio.com/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30949533,
      "score": 1,
      "time": 1649360956,
      "title": "The True Story of Jody Harris, Con Artist Extraordinaire",
      "type": "story",
      "url": "https://www.trulyadventure.us/conwoman"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 30949530,
      "score": 1,
      "time": 1649360945,
      "title": "After GM, Ford, FCA Abandoned Cars, Toyota, Now #1 in the US",
      "type": "story",
      "url": "https://wolfstreet.com/2022/04/07/after-gm-ford-fca-abandoned-cars-toyota-becomes-1-in-the-us-rubs-in-their-monumental-blunder-publicly/"
    },
    {
      "by": "alanlammiman",
      "descendants": 1,
      "id": 30949514,
      "kids": [
        30949563
      ],
      "score": 1,
      "time": 1649360860,
      "title": "Apple Removes NFT Marketplace from App Store",
      "type": "story",
      "url": "https://techcrunch.com/2022/04/07/nft-app-sticky-kicked-out-of-apples-app-store-after-operating-for-months/"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 30949501,
      "score": 1,
      "time": 1649360766,
      "title": "How to Prevent a Repeat of the Cuban Missile Crisis",
      "type": "story",
      "url": "https://www.foreignaffairs.com/articles/ukraine/2022-04-05/putins-doomsday-threat"
    },
    {
      "by": "obiefernandez",
      "descendants": 1,
      "id": 30949497,
      "kids": [
        30949522
      ],
      "score": 2,
      "time": 1649360752,
      "title": "Stop, What's That Sound?",
      "type": "story",
      "url": "https://blog.rcrdshp.com/stop-whats-that-sound-b6912024a036?gi=4abbfa62a074"
    }
  ]
}