{
  "stories": [
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30516060,
      "score": 1,
      "time": 1646151574,
      "title": "Beyond sanctions: An off-ramp for post-Putin Russia",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/beyond-sanctions-an-off-ramp-for"
    },
    {
      "by": "softwarebeware",
      "descendants": 0,
      "id": 30516058,
      "score": 1,
      "time": 1646151570,
      "title": "A Mysterious Rocket Booster Is About to Crash into the Moon",
      "type": "story",
      "url": "https://www.mentalfloss.com/article/655655/rocket-booster-about-crash-moon"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30516049,
      "score": 2,
      "time": 1646151545,
      "title": "Conti ransomware gang chats leaked by pro-Ukraine member",
      "type": "story",
      "url": "https://therecord.media/conti-ransomware-gang-chats-leaked-by-pro-ukraine-member/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30516047,
      "score": 1,
      "time": 1646151540,
      "title": "The War in Ukraine, and One of Them Is a Consequence of American Imperialism",
      "type": "story",
      "url": "https://freddiedeboer.substack.com/p/the-war-in-ukraine-is-many-things"
    },
    {
      "by": "lbenes",
      "descendants": 0,
      "id": 30516036,
      "score": 1,
      "time": 1646151485,
      "title": "After Ukraine recruits an “IT Army,” dozens of Russian sites go dark",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/02/after-ukraine-recruits-an-it-army-dozens-of-russian-sites-go-dark/"
    },
    {
      "by": "kgoro",
      "descendants": 0,
      "id": 30516024,
      "score": 1,
      "time": 1646151445,
      "title": "Show HN: Sample Code for the Twitter OAuth2.0 Client (Node.js&TypeScript)",
      "type": "story",
      "url": "https://github.com/kg0r0/twitter-oauth2-client"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30516013,
      "score": 1,
      "time": 1646151408,
      "title": "The NBA Redrafted 2.0",
      "type": "story",
      "url": "https://pudding.cool/2022/02/redraft/"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 30515974,
      "score": 1,
      "time": 1646151274,
      "title": "Swiss to be the world’s first airline to use Synhelion solar fuel",
      "type": "story",
      "url": "https://synhelion.com/news/swiss-will-be-the-world-s-first-airline-to-use-synhelion-s-solar-fuels"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30515963,
      "score": 2,
      "time": 1646151237,
      "title": "Here Come the Underdogs of the Robot Olympics",
      "type": "story",
      "url": "https://www.wired.com/story/darpa-challenge-robot-olympics-underdog/"
    },
    {
      "by": "combat_wombat",
      "descendants": 0,
      "id": 30515940,
      "score": 4,
      "text": "Hi HN, Graham and Jeremy here - we are building GrowthBook is an open-source platform for feature flagging and A&#x2F;B testing. The repo is here: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;growthbook&#x2F;growthbook\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;growthbook&#x2F;growthbook</a> and our home page is <a href=\"https:&#x2F;&#x2F;www.growthbook.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.growthbook.io</a>. We did a Show HN 6 months ago (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28088882\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28088882</a>, which helped us get into YC) and have since added feature flagging.<p>Developers often launch a feature without understanding the impact it has on their users and business. This is a big deal, because only 1&#x2F;3 of product launches actually improve the desired metrics. Of the rest, 1&#x2F;3 have no effect, and the last 1&#x2F;3 actually hurt [1]. The best way to measure this is to use feature flags and controlled experiments (A&#x2F;B tests).<p>Jeremy and I worked together for 10 years at an ed-tech startup as CTO and software architect. We spent far too long just building and launching features without really knowing how they impacted our users and if they were adding value to the company. We had product analytics, but there was too much noise in the data to draw real conclusions. We knew the “right” way to do this was to build feature flags and run controlled experiments, but that was daunting for our small team.<p>We looked into 3rd party tools, but it bothered us that they didn&#x27;t use our existing data warehouse and metric definitions, and we really didn&#x27;t like the idea of adding an API call in the critical rendering path of our application. We also didn’t want to send our data to 3rd parties, didn’t feel good about vendor lock-in, plus the vendors were expensive. So, we did what any engineers would do—build it ourselves. After all, how hard could it be?<p>After a couple painful years, we hacked something together that (mostly) worked and used it to help grow revenue 10x. We started talking to other teams and realized just how many larger companies spend years building these feature flagging and experimentation platforms in-house because, like us, they couldn’t find any tools that met their needs. So we took everything we learned and built the tool we wish had existed back when we started.<p>GrowthBook is an open source platform for feature flagging and A&#x2F;B experimentation. Our SDKs are built to be fast and cache-friendly. We take data privacy seriously and don’t use cookies or deal with PII. We sit on top of your company’s existing data warehouse and metrics so you can maintain a single source of truth. We’re open source (MIT), so you can either self-host the platform (with Docker containers), or use our managed cloud offering.<p>In GrowthBook, feature flags are added and controlled within the UI. Engineers or PMs can add targeting rules (e.g.”beta users get feature X, everyone else does not”), do gradual rollouts, and run A&#x2F;B tests on the features. The current state of features are stored in a JSON file and exposed via an API or kept in-sync with a cache&#x2F;database using webhooks. Engineers install our SDK and pass in the JSON file. Then they can do feature checks throughout their code (e.g. `if feature.on { ... } else { ... }`).<p>For A&#x2F;B test analysis, a data analyst or engineer connects GrowthBook to their data warehouse, then they write a few SQL queries that tell GrowthBook how to query their experiment assignment and metric conversion data. After that initial setup, GrowthBook is able to pull experiment results, run it through our Bayesian stats engine, and display results. Users can slice and dice the data by custom dimensions and&#x2F;or export results to a Jupyter notebook for further analysis.<p>We’re used by over 60 companies in production. We have self-hosted and cloud versions (see our pricing here: <a href=\"https:&#x2F;&#x2F;www.growthbook.io&#x2F;pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;www.growthbook.io&#x2F;pricing</a>), and both are self-serve and simple to set up. We currently have SDKs for Javascript&#x2F;Typescript, React, PHP, Ruby, Python, Go, and Android with more in the works (C#, Java, Swift, and Elixir). We support all the major SQL data warehouses as well as Mixpanel and Google Analytics.<p>You can give it a spin at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;growthbook&#x2F;growthbook\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;growthbook&#x2F;growthbook</a>. Let us know what you think!  We would especially love feedback from anyone who has built platforms like this in the past.<p>----------<p>Footnotes:<p>[1] Online Experimentation at Microsoft: <a href=\"https:&#x2F;&#x2F;exp-platform.com&#x2F;Documents&#x2F;ExPThinkWeek2009Public.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;exp-platform.com&#x2F;Documents&#x2F;ExPThinkWeek2009Public.pd...</a>",
      "time": 1646151170,
      "title": "Launch HN: GrowthBook (YC W22) – Open-source feature flagging and A/B testing",
      "type": "story",
      "url": "https://www.growthbook.io/"
    }
  ]
}