{
  "stories": [
    {
      "by": "cbono1",
      "descendants": 0,
      "id": 31182208,
      "score": 1,
      "text": "Curious if there&#x27;s a turning point where this no longer scales, or if folks think this is acceptable for certain verticals or business cases.",
      "time": 1651077275,
      "title": "Ask HN: Should a VP of product and engineering be a single person?",
      "type": "story"
    },
    {
      "by": "bestcoder69",
      "descendants": 0,
      "id": 31182187,
      "score": 1,
      "time": 1651077197,
      "title": "Show HN: My GPT-3 chatbot, which allows chatters to customize its personality",
      "type": "story",
      "url": "https://old.reddit.com/r/GPT3/comments/ubm0hm/my_customizable_gpt3_chatbot_as_karl_marx_with_a/"
    },
    {
      "by": "AmIAnElitist",
      "descendants": 0,
      "id": 31182149,
      "score": 1,
      "text": "I&#x27;ve generally stuck to the mantra in life that &quot;If it smells like shit everywhere you walk, check your shoes&quot;. I&#x27;m currently a Junior in college - I&#x27;ve had an internship at Amazon last summer and now, for my final summer I have an internship at Google.<p>I go to a state school not really known for CS, although we have a huge CS undergraduate body. A lot of classes in CS require group work - which for the most part, I think is really helpful since most engineering in industry is done in teams.<p>I&#x27;ve had 3 classes where the majority of the grade is made up by projects, and many classes where we do many projects. In each class, I&#x27;ve had to carry the bulk (~90%?) of the workload - half the groups don&#x27;t know how to code (mostly webapps), and the other half don&#x27;t care to try.<p>I&#x27;ve tried many approaches - I find that if I recommend tech stacks that I&#x27;m comfortable with, most people won&#x27;t care enough to learn them, but when I let others select, the project ends up as a steaming pile of garbage that doesn&#x27;t work, and requires a rewrite the week before it&#x27;s due.<p>School Groups that are lacking are not the exception, they&#x27;re the rule - I haven&#x27;t had a group be able to get anything that&#x27;s runnable without almost taking over.<p>I thought that when I got to Amazon, things would be different: highly motivated people working on exceptional software. But the webapp I was working on (internal) was poorly held together, and the frontend had literally no tests and no way to get mock data locally - i.e. the engineers working on it were just guessing about the shapes of the DTO&#x27;s, pushing to their personal deployment of the app, and then testing in the cloud before pushing to production. The feedback loop was brutal.<p>I really try my hardest to do the best with what I have - I&#x27;ve never lost my cool and always try to have a cheery attitude. But when I sat down and git pulled what our group had been working on, and there were compile time errors in the main branch, sometimes I wonder if I&#x27;m just holding my peers to standards that are too high? Is it too much to expect tests? Is it too much to expect to be able to test full stack locally?<p>I&#x27;m beginning to think that I just need a reality check on what standards to hold others to - but at the same time, I can&#x27;t help but wonder how some of my peers are passing classes or getting hired.",
      "time": 1651077052,
      "title": "Ask HN: Am I an arrogant or am I surrounded by incompetent people?",
      "type": "story"
    },
    {
      "by": "timparsa",
      "descendants": 1,
      "id": 31182136,
      "kids": [
        31182212
      ],
      "score": 1,
      "text": "Looking to source some more good content. Here is my current roster:<p>Scott Adams (known best for Dilbert and predicting Trump win, check out his locals.com channel for live daily feed + micro-lessons on persuasion).<p>Russel Brand (once tabloid fodder for drug use and dating pop star Katy Perry, his youtube channel offers a wise and cogent analysis of current events).<p>Naval Ravikant (founder of Angel List-- podcast and associated blog are full of wisdom and deep dives into subjects like David Deutsch&#x27;s work and most recently Ethereum with Vitalik Buterin).<p>Mike Solana, Matt Taibbi, and Bari Weiss Substacks-- current events from an independent POV.<p>All-in Podcast for current events and tech from four distinct and often clashing, but always intellectually honest, perspectives.<p>Paul Graham Essays (this one is probably on all HN lists).<p>Milk Road crypto newsletter (short, punchy, often funny coverage of the wild west frontier that is crypto).<p>What&#x27;s in your media food pyramid?<p>Or do you all just graze Twitter?",
      "time": 1651077019,
      "title": "Independent Media Stack",
      "type": "story"
    },
    {
      "by": "sylvain_kerkour",
      "descendants": 0,
      "id": 31182128,
      "score": 1,
      "time": 1651076998,
      "title": "What a better Rust would look like",
      "type": "story",
      "url": "https://kerkour.com/what-a-better-rust-would-look-like"
    },
    {
      "by": "vasanthv",
      "descendants": 0,
      "id": 31182124,
      "score": 1,
      "time": 1651076976,
      "title": "Show HN: Blarb – Microblogging with a twist",
      "type": "story",
      "url": "https://blarb.co"
    },
    {
      "by": "alabhyajindal",
      "descendants": 0,
      "id": 31182102,
      "score": 1,
      "time": 1651076900,
      "title": "Show HN: Search Select – Navigate and view search results quickly with shortcuts",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/search-select/ijpalmkmpikekpglgjacfnaecdidhmgn"
    },
    {
      "by": "shaicoleman",
      "descendants": 0,
      "id": 31182099,
      "score": 1,
      "time": 1651076888,
      "title": "Running Containers on AWS Lambda",
      "type": "story",
      "url": "https://earthly.dev/blog/aws-lambda-docker/"
    },
    {
      "by": "amai",
      "descendants": 0,
      "id": 31182091,
      "score": 2,
      "time": 1651076863,
      "title": "A multi-voice TTS system trained with an emphasis on quality",
      "type": "story",
      "url": "https://github.com/neonbjb/tortoise-tts"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31182068,
      "score": 1,
      "time": 1651076755,
      "title": "Regular Expressions and Successive Approximation",
      "type": "story",
      "url": "https://www.johndcook.com/blog/2022/04/07/regex-approximation/"
    }
  ]
}