{
  "stories": [
    {
      "by": "nanoguy",
      "descendants": 0,
      "id": 31094968,
      "score": 1,
      "time": 1650451197,
      "title": "Intel patent suggests drones may be used to create mobile billboards",
      "type": "story",
      "url": "https://www.techspot.com/news/94140-intel-patent-suggests-drones-may-used-create-mobile.html"
    },
    {
      "by": "revolucien",
      "descendants": 0,
      "id": 31094958,
      "score": 1,
      "time": 1650451143,
      "title": "Le Corbusier's project Plan Voisin – a radical urban design for Paris from 1925",
      "type": "story",
      "url": "https://www.clemensgritl.com/video"
    },
    {
      "by": "damenci",
      "descendants": 0,
      "id": 31094936,
      "score": 1,
      "text": "In 2016 we started an exploration into the future of work here in India. Some of the concepts we were pursuing were radical and a bit early for its time. But 450 clients later, we felt we now have enough of a &quot;proof of concept&quot; to formally announce our exploration: Sanscubicle.com<p>Launch Notes: https:&#x2F;&#x2F;bit.ly&#x2F;3EvBQqd<p>Would love the HN communities thoughts. Thanks much for your time, we&#x2F;I sincerely appreciate it",
      "time": 1650450970,
      "title": "Show HN: Sanscubicle – A Community of service DAOs with India's finest minds",
      "type": "story"
    },
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 31094927,
      "score": 1,
      "time": 1650450935,
      "title": "Wide-Band WebSDR",
      "type": "story",
      "url": "http://websdr.ewi.utwente.nl:8901/"
    },
    {
      "by": "jn31415",
      "descendants": 0,
      "id": 31094899,
      "score": 1,
      "text": "One thing I noticed and that I haven&#x27;t been able to completely make sense of is why there aren&#x27;t any big price comparison portals that serve the U.S. market.<p>I&#x27;m from Switzerland. One of the first use cases of the internet for me was to use the local price comparison site comparis.ch to get the best deals on services like health insurance or broadband packages. Comparis is a hugely popular website in Switzerland. And that&#x27;s despite that fact that it&#x27;s much wealthier compared to say, Germany (where idealo.de is the dominant price comparison portal).<p>My understanding is that there are a lot niche comparison websites, such as CamelCamelCamel for setting price alerts on Amazon. There are also aggregators for travel and other verticals. However, there appears to be no one particular dominant one-stop type of portal offering comparisons across all kinds of product and service categories like Comparis or Idealo.<p>I do understand that the United States has one of the highest average incomes worldwide and the people there are more willing to part with their money than consumers in other places. However, there must still be a sizable addressable market here, just like there is in Switzerland, which is also a wealthy country. And yet, no dominant price comparison portal has emerged yet. Why is that?",
      "time": 1650450664,
      "title": "Ask HN: Why aren't price comparison websites big in the US?",
      "type": "story"
    },
    {
      "by": "offbeatport",
      "descendants": 0,
      "id": 31094893,
      "score": 1,
      "text": "Hello HN.<p>I’m working on a tool that aims to replace OSX&#x27;s Mission Control: https:&#x2F;&#x2F;www.switchcenter.app.<p>It will display the windows in a more orderly fashion and will also give you some control over them (i.e. you can close the windows or go full-screen).\nWhen released, it will be a paid-for tool with a trial version available to try it out.<p>I would very much appreciate if anyone would be willing and curious enough to try the alpha-preview version and provide some feedback.<p>If you want to participate please go to https:&#x2F;&#x2F;www.switchcenter.app to subscribe, or send me an email. I&#x27;ll then pick up to a dozen people and send the instructions over email.<p>Thank you in advance.",
      "time": 1650450637,
      "title": "Ask HN: Anyone willing to try a Mission Control alternative?",
      "type": "story"
    },
    {
      "by": "dragonsh",
      "descendants": 1,
      "id": 31094867,
      "kids": [
        31094954
      ],
      "score": 3,
      "time": 1650450418,
      "title": "Assange extradition order issued by UK court",
      "type": "story",
      "url": "https://www.rt.com/news/554209-london-court-assange-extradition/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31094809,
      "score": 1,
      "time": 1650449987,
      "title": "Discovery of bacteria linked to prostate cancer hailed as potential breakthrough",
      "type": "story",
      "url": "https://www.theguardian.com/society/2022/apr/20/discovery-of-bacteria-linked-to-prostate-cancer-hailed-as-potential-breakthrough"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31094773,
      "score": 2,
      "time": 1650449693,
      "title": "Uranus should be NASA’s top planetary target, influential report finds",
      "type": "story",
      "url": "https://www.science.org/content/article/uranus-should-be-nasa-s-top-planetary-target-influential-report-finds"
    },
    {
      "by": "eimrine",
      "descendants": 1,
      "id": 31094772,
      "kids": [
        31094921
      ],
      "score": 2,
      "text": "Imagine some changes in protocol which converts Bitcoin&#x27;s blockchain in some kind of AI which makes some decisions on humankind. Algorithmic part of questions may be ignored, this is a question about introducing a human values to Artificial Intelligence.",
      "time": 1650449673,
      "title": "Ask HN: If half of Bitcoin mining will go for charity, what needs to be funded?",
      "type": "story"
    }
  ]
}