{
  "stories": [
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 32197904,
      "score": 1,
      "time": 1658529236,
      "title": "A Cloud Never Dies – Thich Nhat Hanh Documentary",
      "type": "story",
      "url": "https://www.buddhanet.world/2022/07/20/a-cloud-never-dies-zen-master-thich-nhat-hanh-biography/"
    },
    {
      "by": "b8",
      "descendants": 0,
      "id": 32197898,
      "score": 1,
      "text": "I recently got fired from my job as a cybersecurity consultant at NCC Group for what I believed to be discrimination of my disability, Autism. So, I thought I&#x27;d tell HN about my experience in &quot;corporate america&quot;&#x2F;tech as a person with Autisim. I never knew that I had Autisim until I went to see a psychologist and took a test that indicated that I have Autism and that a past therapist suggested to get tested for it both while at NCC Group (almost no one else accepts medicaid which I was on before).<p>I had a hard time getting a job and took 6+ months to get an offer and hundreds of interviews etc. Recently got ghosted by all the jobs I applied to&#x2F;rejected from Amazon due to not enough experience (even though I did exactly that job before, and got a referral from someone on the team. I told the HM I had autism which I think is what got me rejected. Though I rock in my chair which might be an indicator). I&#x27;d always get rejected with some reason of &quot;business needs&quot;, or &quot;not a fit&#x2F;enough experience etc.). I got in to a top university, and got hired at 18 by two big tech companies but left after a short stint due to not being able to afford college, and feeling overqualifed etc. for those two jobs.<p>I felt that I was doing good at NCC Group, but my first manager left, and my old VP who felt like they really supported me left and then things started to go down hill. He gave me a meets expectations performance eval even though I delivered a lot of work even some solo and gave a talk at ncccon, and tried for a year + to get research stuff approved. Folks who joined as an associate got promoted before I did and were on less demanding&#x2F;varity work than I delivered on. The SVP of research made me cry because she berated me for reaching out to a client without her exact permission which I didn&#x27;t know that I needed. And the client bloged publicly about the thing I wanted to do research on, and seemed receptive. I think she got me fired. Even the account manager didn&#x27;t know why she &quot;gave me heat&quot; for it. My official firing reason was due to a violation of values which candidly no one complies with.<p>I&#x27;m not sure what to do honestly, and feel like I&#x27;m screwed. Chase etc. has neurodiverse hiring, but no one seems to hire me...<p>email: upsetguy@proton.me",
      "time": 1658529198,
      "title": "Tell HN: My Experience in Tech with Autism",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32197862,
      "score": 1,
      "time": 1658528923,
      "title": "List of WebAuthn and Passkey Awesomeness",
      "type": "story",
      "url": "https://github.com/herrjemand/awesome-webauthn"
    },
    {
      "by": "segfaultbuserr",
      "descendants": 0,
      "id": 32197830,
      "score": 1,
      "time": 1658528737,
      "title": "The insidious corruption of open access publishers",
      "type": "story",
      "url": "https://igorpak.wordpress.com/2022/01/09/the-insidious-corruption-of-open-access-publishers/"
    },
    {
      "by": "yentroc",
      "descendants": 1,
      "id": 32197825,
      "kids": [
        32197826
      ],
      "score": 1,
      "time": 1658528719,
      "title": "Leverage OPA Security Practices Pre-Deployment",
      "type": "story",
      "url": "https://kubeshop.io/blog/leverage-opa-security-practices-with-monokle"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 32197823,
      "score": 1,
      "time": 1658528711,
      "title": "Weird Places: UFO Crash at Aztec, New Mexico (2021)",
      "type": "story",
      "url": "https://basementofthebizarre.com/2021/04/12/weird-places-ufo-crash-at-aztec-new-mexico/"
    },
    {
      "by": "susam",
      "descendants": 0,
      "id": 32197791,
      "score": 1,
      "time": 1658528474,
      "title": "Fixing Races for Fun and Profit: How to use access(2) (2004) [pdf]",
      "type": "story",
      "url": "https://www.cs.ubc.ca/~ajh/mypapers/2004DH.pdf"
    },
    {
      "by": "batch12",
      "descendants": 1,
      "id": 32197782,
      "kids": [
        32197810
      ],
      "score": 3,
      "time": 1658528384,
      "title": "Hacker selling Twitter account data of 5.4M users for $30k",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/hacker-selling-twitter-account-data-of-54-million-users-for-30k/"
    },
    {
      "by": "SoftwarePatent",
      "descendants": 0,
      "id": 32197734,
      "score": 1,
      "time": 1658527962,
      "title": "Ramen profitable and your student loan",
      "type": "story",
      "url": "https://dennislibre.com/ramen-profitable-and-your-student-loan/"
    },
    {
      "by": "mooreds",
      "descendants": 1,
      "id": 32197731,
      "kids": [
        32197777
      ],
      "score": 1,
      "time": 1658527953,
      "title": "Removing a Feature Is a Change in Behavior",
      "type": "story",
      "url": "https://ted.dev//articles/2022/07/21/removing-a-feature-is-a-change-in-behavior/"
    }
  ]
}