{
  "stories": [
    {
      "by": "ramimac",
      "descendants": 0,
      "id": 29897211,
      "score": 1,
      "time": 1641932236,
      "title": "URL confusion vulnerabilities in the wild: Exploring parser inconsistencies",
      "type": "story",
      "url": "https://snyk.io/blog/url-confusion-vulnerabilities/"
    },
    {
      "by": "jamespwilliams",
      "descendants": 0,
      "id": 29897206,
      "score": 1,
      "time": 1641932218,
      "title": "Writing a Game Boy Emulator in OCaml",
      "type": "story",
      "url": "https://linoscope.github.io/writing-a-game-boy-emulator-in-ocaml/"
    },
    {
      "by": "JordanTen",
      "descendants": 0,
      "id": 29897197,
      "score": 2,
      "time": 1641932189,
      "title": "CNCF 2021 Annual Report",
      "type": "story",
      "url": "https://www.cncf.io/cncf-annual-report-2021/"
    },
    {
      "by": "CryptoGods",
      "descendants": 0,
      "id": 29897191,
      "score": 2,
      "text": "I have a vision to disrupt the oldest industry in the world. It is the Religion&#x2F;Gods&#x2F;Donations vertical.<p>I have already built the crude form of the app and its available on AppStore and PlayStore ( GodsDecentralized)<p>Now about the idea:<p>To bring the Popular and Mythological Gods to the Metaverse. Gods&#x2F;Religions are the second most important virtual construct (first one being money). They serve a purpose especially in mental or spiritual well being.<p>The market is a huge one (6 billion people out of the 7 billion are religious&#x2F;ritualistic folks). Donations to Gods&#x2F;Religions are also HUUUUUUGE. (400 billion dollars )<p>There is a B2C and B2B part of my vision. The B2C part is a gamified prayer app for the users. The B2B version includes onboarding churches and temples and being the platform they use to advertise their services and collect donations across the globe.<p>Despite Gods being a virtual construct like money formed in the human mind, they live as statues in temples and churches centralized by the powers that collect money in their name. This is the only vertical not disrupted by technology and the pandemic has created the ripe environment for this.<p>End goal is to bring the Gods as NFTs on the platform, making a decentralized worship protocol, onboard all churches and temples and make it easy for people to worship their Gods and send money to good causes in a transparent manner.<p>About me: I am technical and understand technology and the religion&#x2F;worship&#x2F;crypto markets fairly well.<p>What I need is a cofounder who  will compliment me on the marketing&#x2F;growth&#x2F;user acquisition&#x2F; community building side. Preferably you should have experience on that side, to grow the team, nurture talent. Location wise you should could be in USA or India as these are the markets which makes sense to start with.<p>I have a deep knowledge of technology and I can understand fluff from stuff and I am hands on. I can find the right people as we scale in each part of technology that is required. You should be the same on the user acquisition &#x2F; growth side.<p>If you are passionate about a decentralized world&#x2F; religion&#x2F;money and have a anarcho-capitalistic libertarian view of the future it will be great. Will be easier to gel from a thought perspective but that is not a must.<p>Building the app&#x2F; Raising money is not an issue. But changing human behaviour is hard.<p>So this is not at all going to be easy but I do have my sights set for first B2B church set with a 500,000 laity.<p>We can even decide if we want to apply for the summer YC batch. Maybe we might need to or can take this forward without YC.<p>If you are truly interested and think you are the right fit, shoot me an email to info@GodsDecentralized.com<p>If you are not the right person please upvote so that person can see this post.",
      "time": 1641932148,
      "title": "Looking for a Non-Tech CoFounder for an Already Built App",
      "type": "story"
    },
    {
      "by": "minimaxir",
      "descendants": 0,
      "id": 29897184,
      "score": 3,
      "time": 1641932122,
      "title": "“This guy shamelessly cloned Wordle as an F2P iOS game with IAP and is bragging”",
      "type": "story",
      "url": "https://twitter.com/waxpancake/status/1480990948972658689"
    },
    {
      "by": "coloneltcb",
      "descendants": 0,
      "id": 29897180,
      "score": 1,
      "time": 1641932106,
      "title": "Judge denies Facebook's motion to dismiss FTC antitrust case",
      "type": "story",
      "url": "https://www.documentcloud.org/documents/21177063-memorandum-opinion"
    },
    {
      "by": "gverrilla",
      "descendants": 0,
      "id": 29897173,
      "score": 1,
      "text": "I&#x27;m a founder at a stealth startup building a novel software for a specific industry, which in our tests have shown to be able to reduce costs for a specific budget anywhere between 20 and 35% for the client, which are very big private organizations, per annum. We&#x27;re about to go to the market for the first time after the tests, but we have been thinking about the best way to price for the annual billing.<p>Our line of reasoning right now is: if our tech will allow our clients to spend let&#x27;s say 1M&#x2F;y less than before, it would be perfectly fine for us to charge somewhere between 25-35% of the benefit (250k-350k&#x2F;y). Is this valid, in yours opinion?<p>We don&#x27;t have good estimates for what our real cost of service will be, but we&#x27;re sure we can make it work if we charged 25-35% of the benefit.<p>I think I should mention the cost for our client to adopt our technology is very very low compared to the benefit, so it&#x27;s not much of relevance in pricing.<p>Any ideas or resources for reading would be much appreciated. I&#x27;m sorry for not being able to tell all the relevant info, but I&#x27;m happy do discuss and answer questions.<p>Thank you!<p>PS: English is not my primary language.",
      "time": 1641932044,
      "title": "Ask HN: SaaS Princing Resources",
      "type": "story"
    },
    {
      "by": "YXNjaGVyZWdlbgo",
      "descendants": 0,
      "id": 29897166,
      "score": 1,
      "time": 1641932033,
      "title": "DXVK to accelerate DX9 games on Windows",
      "type": "story",
      "url": "https://rk.edu.pl/en/using-dxvk-on-windows-to-improve-final-fantasy-xiv-performance/"
    },
    {
      "by": "Gedxx",
      "descendants": 0,
      "id": 29897141,
      "score": 1,
      "time": 1641931906,
      "title": "Firefox Privacy – The Complete How-To Guide for 2022",
      "type": "story",
      "url": "https://restoreprivacy.com/firefox-privacy/"
    },
    {
      "by": "yepthatsreality",
      "descendants": 0,
      "id": 29897138,
      "score": 1,
      "time": 1641931889,
      "title": "Spotify shutting down founding podcast arm – report",
      "type": "story",
      "url": "https://seekingalpha.com/news/3787158-spotify-shutting-down-founding-podcast-arm-report"
    }
  ]
}