{
  "stories": [
    {
      "by": "monsieurpng",
      "descendants": 0,
      "id": 30837869,
      "score": 1,
      "time": 1648519115,
      "title": "The Metaverse and NFT Boom Is About to Go Bust",
      "type": "story",
      "url": "https://onezero.medium.com/the-metaverse-and-nft-boom-is-about-to-go-bust-b63c52c37c94"
    },
    {
      "by": "throwaway971608",
      "descendants": 0,
      "id": 30837836,
      "score": 2,
      "text": "TL;DR — Apple offered me USD $228k average annual total compensation (base + RSU + bonus), which is below the 25th percentile of ICT4-Senior according to Levels FYI (https:&#x2F;&#x2F;www.levels.fyi&#x2F;company&#x2F;Apple&#x2F;salaries&#x2F;Software-Engineer&#x2F;ICT4&#x2F;Canada&#x2F;). Are they low-balling me or am I being too greedy?<p>---<p>I am a Software Developer with over twelve (12) years of verifiable work experience as an individual contributor in Canada, US, and LATAM. University drop-out. I started in Web Development (full-stack), then Web Security (back-end and tooling) and, finally, Systems Programming in industries like InfoSec, Web Hosting, Gaming, Marketing, and Internet Services. I worked for two (2) Fortune Global 500 companies and have a passion for distributed systems.<p>---<p>Hello, HN.<p>I wonder if you can help me riddle this one out.<p>I have been doing interviews at dozens of medium and large companies for the last couple of years, mostly because 1) I want to keep my impostor syndrome at bay, 2) I want to practice my English as much as possible, 3) a manager taught me the best time to interview is when you don’t need a job, and 4) LeetCode and take-home exercises are equally fun to me.<p>Long story short, one of those interviews was at Apple (Canada). It was less technical than I expected, but still challenging, especially the one about Data Privacy and Security, which was the most entertaining interview I have had in years.<p>Unfortunately, the offer is several thousand dollars below what I expected (↓2x).<p>I feel like being a university drop-out and&#x2F;or keeping a Senior Software Developer role for so long without jumping into management may have contributed to the low offer.<p>I am not white, and I don’t think race or gender had anything to do with it. However, the last time I tried to negotiate the salary, they invited me to a video call and I was the only one with the camera on, which I thought was a bit disrespectful and disingenuous.<p>Now, you may ask <i>—Why didn’t you ask the (internal) recruiter?—</i>.<p>Well, I did.<p>They said that the range for base salaries is limited by the 75th percentile they pay in the city my team is located, which is determined by market rates. Then, paraphrasing, <i>—If we pay you the amount you expect, you’ll have a much higher salary than any of your team mates, and it will make it much more difficult to give you a raise in subsequent years.—</i>.<p>The answer didn’t make sense to me at all, but I did not have a good come back in English at the moment.<p>Today, I think, why is it my fault that my team members are also underpaid? Is not that a sign that the company needs to re-evaluate their salaries too? And lastly, why would I worry about future raises if you can’t even pay what I expect today?<p>What do you think HN community?",
      "time": 1648518748,
      "title": "Ask HN: Is Apple low-balling me or am I an impostor greedy bastard?",
      "type": "story"
    },
    {
      "by": "ani_obsessive",
      "descendants": 0,
      "id": 30837831,
      "score": 1,
      "time": 1648518663,
      "title": "The Debate over the Definition of “Anime”",
      "type": "story",
      "url": "https://animationobsessive.substack.com/p/how-do-you-define-anime"
    },
    {
      "by": "grecy",
      "descendants": 0,
      "id": 30837817,
      "score": 1,
      "time": 1648518521,
      "title": "Four Canadian provinces pushing ahead to build small nuclear power plants",
      "type": "story",
      "url": "https://www.cbc.ca/news/canada/saskatchewan/smr-nuclear-power-provinces-canada-1.6399928"
    },
    {
      "by": "joeyespo",
      "descendants": 0,
      "id": 30837816,
      "score": 1,
      "time": 1648518515,
      "title": "Transitional Architecture",
      "type": "story",
      "url": "https://martinfowler.com/articles/patterns-legacy-displacement/transitional-architecture.html"
    },
    {
      "by": "Jimmc414",
      "descendants": 0,
      "id": 30837809,
      "score": 1,
      "time": 1648518436,
      "title": "Naked Short Selling",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Naked_short_selling"
    },
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 30837805,
      "score": 1,
      "time": 1648518355,
      "title": "Nuclear fusion: Inside the construction of the world’s largest tokamak",
      "type": "story",
      "url": "https://www.sciencefocus.com/future-technology/nuclear-fusion-inside-the-construction-of-the-worlds-largest-tokamak/"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30837782,
      "score": 1,
      "time": 1648518102,
      "title": "The great Earl Scruggs, now ten years gone",
      "type": "story",
      "url": "https://bluegrasstoday.com/the-great-earl-scruggs-now-ten-years-gone/"
    },
    {
      "by": "kaycebasques",
      "descendants": 0,
      "id": 30837747,
      "score": 1,
      "time": 1648517860,
      "title": "Fuchsia's Documentation Types",
      "type": "story",
      "url": "https://fuchsia.dev/fuchsia-src/contribute/docs/documentation-types"
    },
    {
      "by": "kazperson",
      "descendants": 0,
      "id": 30837736,
      "score": 1,
      "time": 1648517781,
      "title": "Prioritize Connections with People over Companies",
      "type": "story",
      "url": "https://www.nikitakazakov.com/build-engineering-relationships"
    }
  ]
}