{
  "stories": [
    {
      "by": "FeaturelessBug",
      "descendants": 0,
      "id": 30876490,
      "score": 1,
      "time": 1648805325,
      "title": "Twitter user sentenced to 150 hours of community service in UK",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/31/23004339/uk-twitter-user-sentenced-grossly-offensive-tweet-tom-moore-joseph-kelly"
    },
    {
      "by": "letMeShowU",
      "descendants": 0,
      "id": 30876482,
      "score": 1,
      "time": 1648805201,
      "title": "GammaScript. Protect your JavaScript from cosmic rays",
      "type": "story",
      "url": "https://sebastiancarlos.medium.com/gammascript-protect-your-javascript-from-cosmic-rays-861b379db4fd"
    },
    {
      "by": "severine",
      "descendants": 0,
      "id": 30876465,
      "score": 2,
      "time": 1648804848,
      "title": "Working Rat",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Working_rat"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 30876456,
      "score": 2,
      "time": 1648804775,
      "title": "Capcom to Raise Its Employee Salaries by 30% in Japan",
      "type": "story",
      "url": "https://80.lv/articles/capcom-to-raise-its-employee-salaries-by-30-in-japan/"
    },
    {
      "by": "Subcap",
      "descendants": 0,
      "id": 30876454,
      "score": 1,
      "text": "Subcap is the best mobile app to automatically add captions to videos. Your videos will be much more valuable than ever. Connect with your viewers instantly to make more connections, increase engagement rates, and gain followers, all with an improved video experience.<p>Don&#x27;t waste time adding subtitles manually. Easily and automatically add captions to your videos, not only in English but also in 125 languages and variants.<p>FEATURES:<p>~ Record and caption videos instantly with your iPhone or iPad<p>~ Automatically transcribe videos up to 5 minutes<p>~ Change subtitles position, size, color, and style, or customize them<p>~ Use any size video you want<p>~ Save videos in 1080p or 720p quality with subtitles<p>~ Download the generated SRT file<p>~ Add subtitles manually, if needed<p>~ Share these videos on TikTok, Instagram, Snapchat, IGTV, Facebook, Twitter, Linkedin, Youtube, Youtube Shorts, Instagram Reels for video posts and stories, or via E-Mail, Whatsapp, etc.<p>~ Use these videos to increase social engagements as perfect content creators and influencers!<p>DEVELOPERS’ NOTE:<p>We’ve realized that making all videos readable would be great for not only the deaf community but also everyone who uses social media actively. We have discovered the need for such an application that makes auto subtitles easily and quickly and supports many languages. With all these thoughts and dreams, we have created this app.<p>What features would you like us to add to the app?<p>Please give us feedback on the comments<p>For more information, please contact us at mail: hello@subcap.app<p>Thank you for your comments and feedback.",
      "time": 1648804740,
      "title": "Show HN: Subcap – Captions for Videos CC",
      "type": "story",
      "url": "https://subcap.app/"
    },
    {
      "by": "JeroenKnoops1",
      "descendants": 0,
      "id": 30876422,
      "score": 1,
      "time": 1648804273,
      "title": "OCI as Attestations Storage for Your Packages",
      "type": "story",
      "url": "https://marcofranssen.nl/oci-as-attestations-storage-for-your-packages"
    },
    {
      "by": "jimsi",
      "descendants": 1,
      "id": 30876419,
      "kids": [
        30876471
      ],
      "score": 1,
      "text": "Recently I was reading logs on production machine and have seen line<p>&quot;pdns-recursor[2169088]: PowerDNS Security Update Mandatory: Upgrade now, see https:&#x2F;&#x2F;doc.powerdns.com&#x2F;recursor&#x2F;security-advisories&#x2F;powerdns-advisory-2022-01.html&quot;<p>I do not have any automatics to get important stuff from my logs, but this is another big question.<p>I have asked myself - is there any way to get security advisories in RSS-like fashion? Especially for PowerDNS I see only two options how to get them: webpage[1] and reading logs. Both those options are not such convenient as getting newsletter or even RSS.<p>Maybe you do know any services to get security advisories in RSS reader or at least by email subscription?<p>[1]: https:&#x2F;&#x2F;doc.powerdns.com&#x2F;authoritative&#x2F;security-advisories&#x2F;",
      "time": 1648804140,
      "title": "Ask HN: How do you get security advisories?",
      "type": "story"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30876395,
      "score": 2,
      "time": 1648803633,
      "title": "Linux for Networking Professionals",
      "type": "story",
      "url": "https://www.packtpub.com/product/linux-for-networking-professionals/9781800202399"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30876394,
      "score": 1,
      "time": 1648803629,
      "title": "Eth2 Book – A book about Ethereum",
      "type": "story",
      "url": "https://github.com/smartcontracts/eth2-book"
    },
    {
      "by": "arisAlexis",
      "descendants": 2,
      "id": 30876380,
      "kids": [
        30876476,
        30876433
      ],
      "score": 4,
      "text": "I just read that Russians are even more united in favor of Putin after the war started and made me despair.<p>I want to somehow help. What are some startups that try to solve the problem of disinformation? Maybe some open source projects I can contribute? I have donated some already but I&#x27;m not sure how it solves the problem. By problem I define lies told to the public by dictators (sometimes elected  too).<p>I am talking about projects trying to deliver messages to people to oppressed people through other means of media etc.",
      "time": 1648803411,
      "title": "Ask HN: How can I help against disinformation?",
      "type": "story"
    }
  ]
}