{
  "stories": [
    {
      "by": "febed",
      "descendants": 0,
      "id": 29728666,
      "score": 1,
      "text": "It seems to me that it&#x27;s harder to retain knowledge gained from audiobooks. Has this been scientifically validated? What&#x27;s your approach to counter this effect (if it exists)",
      "time": 1640805012,
      "title": "Does anyone else find it hard to remember information from audiobooks?",
      "type": "story"
    },
    {
      "by": "allynjalford",
      "descendants": 0,
      "id": 29728605,
      "score": 1,
      "text": "Wouldn’t it be nice if you could ask anyone and everyone to help you understand your code without being embarrassed of the codebase?<p>As a developer, you know that writing code is not easy. It is something that you put 100% into in order to make your vision come to life.<p>You spend lots of time writing code, but when it comes time to debug and understand it, well…that’s where things get hairy. I can’t stress how difficult finding smart developers are in this market.<p>I smell a huge opportunity here, which gets me here today to reach out to others in order to truly bring a solution for the community as a whole. Here is the link: https:&#x2F;&#x2F;www.explaincode.app&#x2F;",
      "time": 1640804758,
      "title": "Show HN: As a developer, you know explaining code to someone else is never easy",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29728594,
      "score": 1,
      "time": 1640804715,
      "title": "Why the C Language Will Never Stop You from Making Mistakes",
      "type": "story",
      "url": "https://thephd.dev/your-c-compiler-and-standard-library-will-not-help-you"
    },
    {
      "by": "milancurcic",
      "descendants": 0,
      "id": 29728585,
      "score": 1,
      "time": 1640804680,
      "title": "Fortran-Lang: 2021 in Review",
      "type": "story",
      "url": "https://fortran-lang.org/newsletter/2021/12/29/Fortran-lang-2021-in-review/"
    },
    {
      "by": "ddurru",
      "descendants": 0,
      "id": 29728576,
      "score": 1,
      "time": 1640804658,
      "title": "Show HN: A small site to share and explore New Year's resolutions",
      "type": "story",
      "url": "https://www.aimhighfive.com"
    },
    {
      "by": "kcarter80",
      "descendants": 0,
      "id": 29728561,
      "score": 1,
      "time": 1640804618,
      "title": "Riot Games agrees to pay $100M to settle gender discrimination lawsuit",
      "type": "story",
      "url": "https://www.nbcnews.com/tech/tech-news/riot-games-agrees-pay-100-mln-settle-gender-discrimination-lawsuit-rcna10175"
    },
    {
      "by": "kcarter80",
      "descendants": 0,
      "id": 29728550,
      "score": 1,
      "time": 1640804579,
      "title": "For ag tech, 2021 was a year of acquisitions, mergers and growing collaborations",
      "type": "story",
      "url": "https://www.agriculture.com/news/technology/for-ag-tech-2021-was-a-year-of-acquisitions-mergers-and-growing-collaborations"
    },
    {
      "by": "jckahn",
      "descendants": 0,
      "id": 29728530,
      "score": 1,
      "time": 1640804514,
      "title": "The Tao of HashiCorp",
      "type": "story",
      "url": "https://www.hashicorp.com/tao-of-hashicorp"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 29728516,
      "score": 1,
      "time": 1640804463,
      "title": "Minitel",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Minitel"
    },
    {
      "by": "voakbasda",
      "descendants": 0,
      "id": 29728483,
      "score": 2,
      "text": "My remote employer has horrible communication among developers.  Almost non-existent.  In the long term, this hurts both the company and its employees.  If it doesn’t change, I will be looking for a new position, as I am a senior&#x2F;staff level engineer and feel like my professional growth is stagnating.  That said, I still hope to learn a thing or two from this scenario, no matter the outcome.<p>To wit, I am looking for open source tools that can be used to increase communication and collaboration among my team and across the organization.   It needs to be OSS as it will be deployed on a spare machine as a side-project, in order to bootstrap management buy-in.  A prototype that yields proof will be worth more than a story.<p>I am looking for the virtual equivalent of trust falls, bridge building, and similar interpersonal relationship and team building scenarios.  What does your remote team do to onboard&#x2F;revitalize developer communication?  What solutions would you like to try or would be sure to avoid in the future?<p>To be clear, I do not want planning, scheduling, and other kinds of systems that would be useful if we actually communicated better.  We already use such systems, but their efficacy and utility would benefit tremendously from better overall communication.",
      "time": 1640804323,
      "title": "Ask HN: Virtual Team Building?",
      "type": "story"
    }
  ]
}