{
  "stories": [
    {
      "by": "mfilion",
      "descendants": 0,
      "id": 29625893,
      "score": 1,
      "time": 1640013857,
      "title": "Wxrd, a standalone Wayland compositor for xrdesktop",
      "type": "story",
      "url": "https://www.collabora.com/news-and-blog/news-and-events/wxrd-a-standalone-wayland-compositor-for-xrdesktop.html"
    },
    {
      "by": "WORMS_EAT_WORMS",
      "descendants": 0,
      "id": 29625888,
      "score": 1,
      "time": 1640013824,
      "title": "Ask HN: How do you manage the “Keeping Up with the Joneses” trap?",
      "type": "story"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 29625883,
      "score": 1,
      "text": "Products where reviews do not matter (to me)<p>- <i>Fiction books, movies, music</i>. These are such personal taste, I mostly read reviews <i>after</i> I read a book or watch a film to see what other people think of the book or film. Sometimes for movies, it might be the average rating rather than the individual reviews that influences.<p>When reviews do matter or influence purchasing<p>- <i>Non-fiction books</i>. Although it depends on the type of non-fiction book, I generally read reviews before purchasing.<p>- <i>Household appliances and electronics</i>. If the product is a known brand, I read the reviews and assume the reviews are not fake. I purchase a product even if there are only a few reviews.<p>When reviews <i>may</i> matter<p>- <i>Unbranded (&#x27;no-name&#x27;) electronics or products</i>. If it&#x27;s a low-cost item e.g. a &#x27;no-name&#x27; keyboard, then I&#x27;ll probably buy the item with a quick glance at the reviews or average rating. When I buy these items it&#x27;s always with a suspicion that some of the positive reviews are fake.<p>- <i>Travel&#x2F;Hotels</i>: Tend to look more at rating rather than individual reviews.<p>---<p>Although the problem of fake customer reviews remains, I can&#x27;t imagine purchasing a wide variety of products without reading (or watching) reviews.<p>When do customer reviews influence your purchases? And when do reviews <i>not</i> influence your purchases?",
      "time": 1640013801,
      "title": "Ask HN: Customer reviews – when do they influence you? When do they not?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29625856,
      "score": 1,
      "time": 1640013664,
      "title": "Madman, architect, carpenter, judge (1981)",
      "type": "story",
      "url": "https://sci-hub.st/https://www.jstor.org/stable/41962375"
    },
    {
      "by": "aniijbod",
      "descendants": 1,
      "id": 29625851,
      "kids": [
        29625892
      ],
      "score": 4,
      "time": 1640013652,
      "title": "Ask HN: Is there Distributed Ledger technology that's “better” than blockchain?",
      "type": "story"
    },
    {
      "by": "tswartz",
      "descendants": 0,
      "id": 29625846,
      "score": 2,
      "time": 1640013643,
      "title": "Five insights from 19 interviews with founders one year after their launch",
      "type": "story",
      "url": "https://www.readoneyearwiser.com/p/reflecting-back-on-2021"
    },
    {
      "by": "jbverschoor",
      "descendants": 1,
      "id": 29625834,
      "kids": [
        29625845
      ],
      "score": 1,
      "time": 1640013598,
      "title": "Human Brain Cells in a Dish Play 'Pong'",
      "type": "story",
      "url": "https://futurism.com/the-byte/brain-cells-play-pong"
    },
    {
      "by": "Terretta",
      "descendants": 0,
      "id": 29625810,
      "score": 2,
      "time": 1640013507,
      "title": "Tobias Schmidt’s most loved AWS developer tools and resources",
      "type": "story",
      "url": "https://hashnode.tpschmidt.com/my-most-loved-aws-developer-tools-and-resources"
    },
    {
      "by": "ajusa",
      "descendants": 0,
      "id": 29625803,
      "score": 2,
      "time": 1640013481,
      "title": "Building a simple typing test website using hyperscript",
      "type": "story",
      "url": "https://arhamjain.com/2021/12/18/hyperscript-simple-type.html"
    },
    {
      "by": "nullandvoid",
      "descendants": 0,
      "id": 29625800,
      "score": 1,
      "text": "With the year coming to an end, what&#x27;s on your reading list for the year ahead that you&#x27;re excited to get stuck into? Here&#x27;s a few of my own to start things off -<p>- Finish reading &quot;Code: The Hidden Language of Computer Hardware and Software&quot;. I&#x27;m hoping as I look to take an extended break from the 9-5 grind, I&#x27;ll be able to spend more time creating some fun projects off the back of the book, cementing what is taught.<p>- &quot;Project Hail Mary&quot; by Andy Weir. After enjoyed &quot;Martians&quot;, I&#x27;m keen to keep extending my fiction library (after largely focusing on non-fiction for the past few years).<p>- &quot;Exhalation&quot; by Ted Chiang. Last year I read &quot;Stories of your life and others&quot;, and can see the reason behind the hype for his work (his writing style is very unique), I&#x27;d like to continue to explore more work by Ted.<p>- &quot;Notes on a nervous planet&quot; by Matt Haig. Very relatable books so far (such as &quot;midsummer library&quot;), I&#x27;m looking forward to continue working through his catalogue.",
      "time": 1640013467,
      "title": "Ask HN: What's on your 2022 reading list?",
      "type": "story"
    }
  ]
}