{
  "stories": [
    {
      "by": "bsanr2",
      "descendants": 0,
      "id": 28113007,
      "score": 1,
      "text": "There is a general sentiment that Google&#x27;s search capability has degraded over the years. Many disagree, pointing to metrics that suggest an increase in utility and successful searches for the average user over time. For the instances where Google users have difficulty finding relevant results, the on-going battle with SEO practitioners is cited, with the difficulty of distinguishing legitimate pages from ad farms and the like suggested as an answer to the question of why we see such failures and an increasing reliance on big-name sites as a trustworthiness heuristic.<p>I want to sidestep that debate somewhat by describing my experience with a more controlled environment: voice searching for YouTube videos to play on my Google Home Mini device. Many will remember how remarkably accurate searches were at initial release c. 2017; songs could be found by reciting lyrics, humming melodies, or vaguely describing the thematic or narrative thrust of the song. The picture is very different today. It&#x27;s almost impossible to get the system to return even slightly obscure tracks, even if one opens YouTube and reads the title verbatim. Recently, I was trying to listen to a song from Neil Cicierega&#x27;s Mouth Dreams album, Aerolong. Just that one song. No combination of terms would bring it up. Several times, my Mini tried to play the entire album as a playlist. But just as often, it would return something that was just off (&quot;I Don&#x27;t Want to Miss a Thing&quot; by Aerosmith) or completely unrelated (Bohemian Rhapsody). We should be clear: this is an Alphabet-produced device and interface tapping into an Alphabet-built index with an Alphabet-developed search function and being absolutely incapable of returning the correct result. One may wonder if this might have something to do with the obscurity of the track in question, but Neil Cicierega is an artist of note, if not mainstream; and, besides, it <i>found the correct album</i> and, presumably, would have eventually gotten to the correct track while making its way through the playlist. But that&#x27;s not what I was asking for as a user; if the system found the correct track but insisted on not going directly to it, it&#x27;s making a decision for me that I did not ask it to. That would be a horrifying finding, if more evidence could be compiled to show that this, specifically, is what was happening. At this point, however, the only thing that can be definitively concluded is that Google searches are not returning results that they ought to; results that, by all accounts, they would have been able to a few years ago; and results that must not have bren influenced by efforts to eliminate the effects of abusive SEO practices. Something else is going on.",
      "time": 1628486829,
      "title": "It's not SEO: something is fundamentally broken in Google Search",
      "type": "story"
    },
    {
      "by": "jnoortheen",
      "descendants": 0,
      "id": 28113003,
      "score": 1,
      "time": 1628486793,
      "title": "Python: Easy Argparser",
      "type": "story",
      "url": "https://pypi.org/project/arger/"
    },
    {
      "by": "actually_a_dog",
      "descendants": 0,
      "id": 28112991,
      "score": 2,
      "time": 1628486615,
      "title": "Facebook shuts out NYU academics’ research on political ads",
      "type": "story",
      "url": "https://apnews.com/article/technology-business-5d3021ed9f193bf249c3af158b128d18"
    },
    {
      "by": "commoner",
      "descendants": 0,
      "id": 28112974,
      "score": 1,
      "time": 1628486402,
      "title": "Stingle is a privacy-focused, open source photo backup application",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/08/foss-mobile-app-stingle-wants-to-privately-securely-back-up-your-photos/"
    },
    {
      "by": "tartoran",
      "descendants": 0,
      "id": 28112969,
      "score": 3,
      "time": 1628486375,
      "title": "I covered Hong Kong for decades. Now I am forced to flee China’s ‘white terror’",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2021/aug/08/i-covered-hong-kong-for-decades-now-i-am-forced-to-flee-chinas-white-terror"
    },
    {
      "by": "bilater",
      "descendants": 0,
      "id": 28112953,
      "score": 1,
      "time": 1628486159,
      "title": "The Absolute Minimum Every Developer Must Know About Unicode and Character Sets",
      "type": "story",
      "url": "https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/"
    },
    {
      "by": "oblib",
      "descendants": 0,
      "id": 28112944,
      "score": 1,
      "time": 1628486086,
      "title": "All In: How gambling swallowed sports media",
      "type": "story",
      "url": "https://www.cjr.org/special_report/sports-betting.php"
    },
    {
      "by": "astlouis44",
      "descendants": 0,
      "id": 28112929,
      "score": 1,
      "time": 1628485901,
      "title": "The Metaverse will emerge from the World Wide Web",
      "type": "story",
      "url": "https://alexstlouis.medium.com/the-metaverse-or-should-i-say-the-immersive-web-b5bf7dcf6651"
    },
    {
      "by": "geekfun",
      "descendants": 0,
      "id": 28112928,
      "score": 1,
      "time": 1628485850,
      "title": "Channels in Go",
      "type": "story",
      "url": "https://go101.org/article/channel.html"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28112892,
      "score": 2,
      "time": 1628485416,
      "title": "Square Root of Any Number Mentally and Instantly – Cool Math Trick [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=XwwySb5-4Es&t=43s"
    }
  ]
}