{
  "stories": [
    {
      "by": "roschdal",
      "descendants": 0,
      "id": 27951088,
      "score": 1,
      "text": "I urgently need a hardware device to verify that my woman really is taking her contraceptive pills.",
      "time": 1627234075,
      "title": "Ask HN: Need a hardware device to verify that my woman is taking the pill",
      "type": "story"
    },
    {
      "by": "arunbahl",
      "descendants": 0,
      "id": 27951048,
      "score": 1,
      "time": 1627233833,
      "title": "Explosive spyware report shows limits of iOS, Android security",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/07/an-explosive-spyware-report-shows-limits-of-ios-android-security/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 27951018,
      "score": 2,
      "time": 1627233607,
      "title": "Why being wealthy seems so much rarer than being smart",
      "type": "story",
      "url": "http://greyenlightenment.com/2021/07/23/the-wealth-iq-perception-disconnect-why-being-wealthy-seems-so-much-rarer-than-being-smart/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 27951004,
      "score": 1,
      "time": 1627233491,
      "title": "Pacemaker",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Pacemaker_(running)"
    },
    {
      "by": "EGreg",
      "descendants": 2,
      "id": 27950951,
      "kids": [
        27951030,
        27950960
      ],
      "score": 1,
      "text": "Under a capitalistic system, we have very few incentives to investigate generic drugs as treatments for pandemics, compared to resemdivir and other patented drugs. With something like Ivermectin that can kill 99.9% of the virus in vitro, you’d think governments should want to push industry to investigate it in vivo. You’d be wrong.<p>https:&#x2F;&#x2F;c19ivermectin.com&#x2F;<p>Here is the largest compendium of studies on Ivermectin in one place. How many take place in the USA? All we see is small studies planned in clinicaltrials.gov and few results. But around the world, the results are finally coming in.<p>The fact is, the USA leads the world in two of the leading factors correlated to bad coronavirus outcomes — obesity and diabetes. The epidemic has been here for decades, with even CHILDREN experiencing both obesity and diabetes — largely as a result of the US food industry, with its genetically engineered crops, putting sugar and high fructose corn syrup in everything. The government actually subsidizes this crap. And to top it all off, the health insurance system in the USA is worse for these people than almost all developed countries in the world. In other countries, people go to the doctor when they feel like they should. In the USA many people don’t even get preventative checkups! 25% of diabetics report having to <i>ration their insulin</i>. This is the highest rate among any developed country. Yet we are also among the richest per capita.<p>Despite being mega rich, the USA has failed its population in terms of public health. Everyone, including children, is fed a diet that produces the highest rates of obesity and diabetes on the planet. And don’t get me started on the factory farms and the  overuse of antibiotics, to save a buck. The superbacteria this can lead to will represent another health crisis in hospitals that might dwarf this pandemic — I hope I am wrong.<p>Using Capitalism for everything is short sighted and bad for public health. Polluting your drinking water (I’m looking at you Michigan) or putting lead in pipes and asbestos in walls (Trump still loves the material) or switching to producing all your bottles from NON-biodegradeable plastic to save a buck, have long term consequences the market doesn’t worry about.",
      "time": 1627233165,
      "title": "The real epidemic in the USA: diabetes and obesity",
      "type": "story"
    },
    {
      "by": "myroon5",
      "descendants": 0,
      "id": 27950950,
      "score": 1,
      "time": 1627233164,
      "title": "Fastest growing occupations",
      "type": "story",
      "url": "https://www.bls.gov/emp/tables/fastest-growing-occupations.htm"
    },
    {
      "by": "limonod",
      "descendants": 0,
      "id": 27950948,
      "score": 3,
      "time": 1627233155,
      "title": "Service proxy, pod, sidecar, oh my",
      "type": "story",
      "url": "https://iximiuz.com/en/posts/service-proxy-pod-sidecar-oh-my/"
    },
    {
      "by": "apsec112",
      "descendants": 0,
      "id": 27950925,
      "score": 1,
      "time": 1627233010,
      "title": "Generation of ovarian follicles from mouse pluripotent stem cells",
      "type": "story",
      "url": "https://science.sciencemag.org/content/373/6552/eabe0237"
    },
    {
      "by": "billyharris",
      "descendants": 0,
      "id": 27950918,
      "score": 2,
      "time": 1627232975,
      "title": "NASA's Mars helicopter soars past 1-mile mark in 10th flight over Red Planet",
      "type": "story",
      "url": "https://www.space.com/mars-helicopter-ingenuity-completes-first-mile-10th-flight"
    },
    {
      "by": "hownottowrite",
      "descendants": 1,
      "id": 27950912,
      "kids": [
        27950928
      ],
      "score": 1,
      "time": 1627232952,
      "title": "At Walden, Thoreau Wasn’t Alone (2017)",
      "type": "story",
      "url": "https://www.nytimes.com/2017/07/10/opinion/thoreaus-invisible-neighbors-at-walden.html"
    }
  ]
}