{
  "stories": [
    {
      "by": "arathore",
      "descendants": 0,
      "id": 31780136,
      "score": 1,
      "time": 1655481498,
      "title": "Platformer Toolkit (interactive video essay)",
      "type": "story",
      "url": "https://gmtk.itch.io/platformer-toolkit"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31780128,
      "score": 2,
      "time": 1655481474,
      "title": "CreuSAT: Formally verified SAT solver written in Rust and verified with Creusot",
      "type": "story",
      "url": "https://github.com/sarsko/CreuSAT"
    },
    {
      "by": "WithinReason",
      "descendants": 0,
      "id": 31780123,
      "score": 1,
      "time": 1655481449,
      "title": "Ethereum Miners Spent $15B on GPUs Alone During Latest Cryptocraze",
      "type": "story",
      "url": "https://www.tomshardware.com/news/ethereum-miners-have-spent-15-billion-on-gpus"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31780109,
      "score": 1,
      "time": 1655481411,
      "title": "What Elon Musk just told Twitter employees",
      "type": "story",
      "url": "https://www.cnbc.com/2022/06/16/elon-musk-is-addressing-twitter-employees-live-updates-from-the-meeting.html"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31780107,
      "score": 1,
      "time": 1655481398,
      "title": "M2 MacBook Pro Is More Powerful Than Base Mac Pro, for $5k Less",
      "type": "story",
      "url": "https://petapixel.com/2022/06/17/m2-macbook-pro-is-more-powerful-than-base-mac-pro-for-5000-less/"
    },
    {
      "by": "jsfcoding",
      "descendants": 0,
      "id": 31780096,
      "score": 1,
      "time": 1655481379,
      "title": "Email service provider recommendations (2020)",
      "type": "story",
      "url": "https://drewdevault.com/2020/06/19/Mail-service-provider-recommendations.html"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 31780090,
      "score": 1,
      "time": 1655481361,
      "title": "Lessons from the GPT-4Chan Controversy",
      "type": "story",
      "url": "https://thegradient.pub/gpt-4chan-lessons/"
    },
    {
      "by": "stochastimus",
      "descendants": 0,
      "id": 31780076,
      "score": 3,
      "text": "Hey Folks – Larry, Ajay and Rod here!<p>We address the age old painful problem of digging through logs to find the root cause when a problem occurs. No-one likes searching through logs, and so we spent a few years analyzing 100’s of real world incidents to understand how humans troubleshoot in logs. And then we built a solution that automatically finds the same root cause indicators a human would have had to manually search for. We call it Root Cause as a Service. RCaaS works with any app and does not require manual training or rules. Our foundational thoughts and more details can be found here: https:&#x2F;&#x2F;www.zebrium.com&#x2F;blog&#x2F;its-time-to-automate-the-observer.<p>Obviously, everyone is skeptical when they hear about RCaaS. We encourage you try it yourself, but we also have a really strong validation point. One of our customers performed a study using 192 actual customer incidents from 4 different products and found that Zebrium correctly identified the root cause indicators in the logs in over 95% of the incidents – see https:&#x2F;&#x2F;www.zebrium.com&#x2F;cisco-validation.<p>For those that are interested, this is actually our second SHOW HN post, our first was last June - https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23490609. The link in that post points to our current home page but our initial comment was, &quot;We&#x27;re excited to share Zebrium&#x27;s autonomous incident detection software&quot;. At the time, our focus was on a tool that used unsupervised ML to automatically detect any kind of new or unknown software incident. We had done a lot of customer testing and were achieving &gt; 90% detection accuracy in catching almost any kind of problem. But what we underestimated is just how high the bar is for incident detection. If someone is going to hook you up to a pager, then even an occasional false positive is enough for a user to start cursing your product! And users quickly forget about the times when your product saved their bacon by catching problems that they would otherwise have missed.<p>But late last year we had a huge aha moment! Most customers already have monitoring tools in place that are really good at detecting problems, but what they don&#x27;t have is an automated way to find the root cause. So, we built some really elegant integrations for Datadog, New Relic, Elastic, Grafana, Dynatrace, AppDynamics and ScienceLogic (and more to come via our open APIs) so that when there&#x27;s a problem, you see details of the root cause directly on your monitoring dashboard. Here&#x27;s a 2 minute demo of what it looks like: https:&#x2F;&#x2F;youtu.be&#x2F;t83Egs5l8ok.<p>You&#x27;re welcome to sign-up for a free trial at https:&#x2F;&#x2F;www.zebrium.com and we&#x27;d love to hear your questions and feedback.",
      "time": 1655481321,
      "title": "Show HN: Root Cause as a Service – Never dig through logs again",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31780071,
      "score": 1,
      "time": 1655481313,
      "title": "The great 16th-Century black composer erased from history",
      "type": "story",
      "url": "https://www.bbc.com/culture/article/20220615-the-lost-16th-century-black-composer-vicente-lusitano"
    },
    {
      "by": "cpeterso",
      "descendants": 0,
      "id": 31780070,
      "score": 1,
      "time": 1655481310,
      "title": "Twitter is rolling out Agile with external consultants",
      "type": "story",
      "url": "https://twitter.com/gergelyorosz/status/1537066668186296320"
    }
  ]
}