{
  "stories": [
    null,
    null,
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30950326,
      "score": 2,
      "time": 1649365427,
      "title": "UCLA Wants to Hire an Adjunct. But the Pay Is Zero",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/06/us/ucla-adjunct-professor-salary.html"
    },
    {
      "by": "nightpool",
      "descendants": 0,
      "id": 30950317,
      "score": 1,
      "time": 1649365398,
      "title": "How I Won the Lottery",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=l_F9jxsfGCw"
    },
    {
      "by": "nobody9999",
      "descendants": 0,
      "id": 30950293,
      "score": 1,
      "text": "This is a rant of sorts, but I&#x27;m seeing this more and more, not just on HN, but in lots of places.<p>Folks will be discussing some topic (the genre doesn&#x27;t seem to matter) and a commenter will respond with something like, &quot;yeah, this is just like...&quot; or something similar, and include a youtube (or other video) link without any context or reason why it&#x27;s relevant or any inkling as to the content of such a video.<p>What then?  Now I either have to go off whatever site I&#x27;m <i>reading</i> and watch some video that may or may not have anything to do with the subject at hand.<p>Even worse, like most people I can read a lot faster than some talking head in a video can get to the point, thus wasting my time.<p>Or I can just move on to the next comment and ignore the video link.  Which might be rather unfortunate, as there may actually be something useful&#x2F;interesting&#x2F;informative going on.<p>For my own part, I may sometimes link to videos, but only in the context of a comment where I&#x27;m actually making the point <i>in the comment itself</i> and linking to the video to either support my point, provide additional context and&#x2F;or act as a citation of something I&#x27;ve quoted&#x2F;referenced in my comment.<p>Seeing stuff like &quot;This is why $issue is how it is&quot; or &quot;$RandomPerson will [blow your mind|explain everything|is so profound]&quot; with no context or other information really doesn&#x27;t add anything valuable to the discussion at hand.<p>For pity&#x27;s sake, if you&#x27;re on a <i>discussion</i> site, then discuss stuff!  If a video presents an interesting viewpoint or useful information, include it in your comment with a note that the linked video provides more informtion&#x2F;context&#x2F;argument, etc.<p>But a comment that contains nothing but &quot;this is amazing&quot; or &quot;$person nailed it here&quot; is, quite literally, clickbait.  And not even <i>good</i> clickbait.<p>I get that some folks aren&#x27;t native English speakers and may feel that the video will provide a much better explanation of their thoughts than the poster thinks they can exposit.  But please, at least provide some kind of context!<p>I come to discussion sites to <i>discuss</i>, not watch videos.  If I wanted to watch videos, I&#x27;d do that instead.<p>&#x2F;rant<p>I generally just ignore such links&#x2F;comments, because I&#x27;m here (and elsewhere) to discuss stuff.<p>Am I being overly judgemental here, or do others also feel that such &quot;comments&quot; reduce the value of a discussion if it&#x27;s necessary to go off-site to view (sometimes hours-long) videos just to figure out what the commenter is banging on about?<p>Your thoughts?",
      "time": 1649365222,
      "title": "Tell HN: I hate links to videos in discussions",
      "type": "story"
    },
    {
      "by": "isthispermanent",
      "descendants": 0,
      "id": 30950289,
      "score": 1,
      "time": 1649365201,
      "title": "The Business of Cell Towers",
      "type": "story",
      "url": "https://www.tiktok.com/@phlndrws/video/7081417563489586475"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 30950279,
      "score": 1,
      "time": 1649365137,
      "title": "Tablet Advertising That Can Also Issue Discipline",
      "type": "story",
      "url": "https://www.eff.org/deeplinks/2022/04/catalog-carceral-surveillance-tablet-advertising-can-also-issue-discipline"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 30950272,
      "score": 1,
      "time": 1649365109,
      "title": "Silicon Valley’s search for the next big tech platform",
      "type": "story",
      "url": "https://www.economist.com/leaders/2022/04/09/silicon-valleys-search-for-the-next-big-tech-platform"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 30950264,
      "score": 1,
      "time": 1649365069,
      "title": "Ghost Recon Breakpoint is a cautionary tale for game developers",
      "type": "story",
      "url": "https://www.axios.com/ghost-recon-breakpoint-cautionary-tale-ea9c3f49-54d7-461d-8837-e9c5d28d5b60.html"
    },
    {
      "by": "otterley",
      "descendants": 0,
      "id": 30950254,
      "score": 1,
      "time": 1649365008,
      "title": "The Bitcoin Bust That Took Down the Web’s Biggest Child Abuse Site",
      "type": "story",
      "url": "https://www.wired.com/story/tracers-in-the-dark-welcome-to-video-crypto-anonymity-myth/"
    }
  ]
}