{
  "stories": [
    {
      "by": "goplayoutside",
      "descendants": 0,
      "id": 32019884,
      "score": 1,
      "time": 1657230268,
      "title": "When “One Size Fits All” Fails: PostGIS Bounding Boxes for Maps",
      "type": "story",
      "url": "https://felt.com/blog/postgis-bounding-boxes-for-maps"
    },
    {
      "by": "dmcy22",
      "descendants": 0,
      "id": 32019868,
      "score": 1,
      "time": 1657230189,
      "title": "A data leak exposes China’s vast surveillance state",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/07/china-leak-police-database/"
    },
    {
      "by": "mikkergp",
      "descendants": 0,
      "id": 32019848,
      "score": 1,
      "text": "I&#x27;ve worked on both sides of the vendor relationship, and thought I&#x27;m always curious about how outages happen, I&#x27;ve rarely had a quantifiable reason for it.  If you&#x27;re in the habit of requesting RCA&#x27;s from vendors.  Why?  Have you gotten a tangible benefit from it?",
      "time": 1657230064,
      "title": "Ask HN: Why do you request an RCA?",
      "type": "story"
    },
    {
      "by": "polleyoo",
      "descendants": 0,
      "id": 32019840,
      "score": 1,
      "text": "I am currently enrolled in a summer session with San Diego State University.  As part of the Information Systems Analysis class, I’ve been assigned a group project to evaluate a specific technology.<p>The group have decided to use the subject of Platform as a Service (PaaS). Our setup is that we are hypothetical web startup, and we need to decide on which provider to go with (or manage ourselves through IaaS).<p>We are looking for professionals who have had to make this decision (or in the process of making this decision). Additionally, we need individuals who have expertise in this area.<p>Our team will develop some questions and conduct a short interview on this topic.<p>If this sounds like you, and your willing to help, please leave contact details or reach out via the email in my HN profile.<p>Thank you!",
      "time": 1657230029,
      "title": "Ask HN: Looking for PaaS professionals to be interviewed for summer project",
      "type": "story"
    },
    {
      "by": "sacrosanct",
      "descendants": 0,
      "id": 32019801,
      "score": 1,
      "time": 1657229850,
      "title": "Met Police UK Live Facial Recognition",
      "type": "story",
      "url": "https://www.met.police.uk/advice/advice-and-information/fr/facial-recognition"
    },
    {
      "by": "AdriaanvRossum",
      "descendants": 0,
      "id": 32019799,
      "score": 4,
      "time": 1657229841,
      "title": "EU moving closer to Facebook ban",
      "type": "story",
      "url": "https://blog.simpleanalytics.com/eu-moving-closer-to-facebook-ban"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32019773,
      "score": 1,
      "time": 1657229689,
      "title": "Quantifying Disease Risk Using Genomics: The New Paradigm",
      "type": "story",
      "url": "https://future.com/polygenic-risk-score-disease-genomics/"
    },
    {
      "by": "endorphine",
      "descendants": 0,
      "id": 32019736,
      "score": 1,
      "text": "For the past 6 years I&#x27;ve been uainn Debian. I love the stability and the values of the project, but sometimes I feel like the fact that versions of certain packages are old, is hurting my productivity more than the stability helps with it (old pulseaudio having problems with my Bluetooth headset is an example).<p>Now of course this is just a hypothesis, but I&#x27;m starting to consider evaluating other distros as well, just in case I&#x27;m missing something.<p>I&#x27;m a backend developer doing some system development as well.<p>My question: how would you go about evaluating alternative distros? Where would you look at first?",
      "time": 1657229469,
      "title": "Ask HN: How to Pick a Linux Distro?",
      "type": "story"
    },
    {
      "by": "etamponi",
      "descendants": 0,
      "id": 32019729,
      "score": 1,
      "time": 1657229440,
      "title": "Dimethylmercury",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Dimethylmercury"
    },
    {
      "by": "alexrustic",
      "descendants": 0,
      "id": 32019727,
      "score": 2,
      "time": 1657229432,
      "title": "Homeless Woman Has a Masters in Mathematics and Engineering [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=nT3VGI0V5Rs"
    }
  ]
}