{
  "stories": [
    {
      "by": "amadk",
      "descendants": 0,
      "id": 31225234,
      "score": 1,
      "time": 1651415056,
      "title": "Ask HN: In terms of design, what is your favorite app or website?",
      "type": "story"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 31225222,
      "score": 1,
      "time": 1651414933,
      "title": "Learn to Code (Gallup survey of survey of tech boot camp graduates)",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2022/04/learn-to-code.html"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 31225217,
      "score": 1,
      "time": 1651414889,
      "title": "You Hear the Musical Saw. These Mathematicians Heard Geometry",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/01/science/musical-saw-mathematics.html"
    },
    {
      "by": "WalterSobchak",
      "descendants": 0,
      "id": 31225215,
      "score": 2,
      "time": 1651414880,
      "title": "A YouTuber is promoting DDoS attacks on Russia – how legal is this?",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/a-youtuber-is-promoting-ddos-attacks-on-russia-how-legal-is-this/"
    },
    {
      "by": "simontrl",
      "descendants": 0,
      "id": 31225212,
      "score": 1,
      "text": "What&#x27;s the practical process I need to go through to create an Ltd company in the UK and move the above into it so there&#x27;s a clear personal&#x2F;business separation? Legally and also domain&#x2F;email sign up and transfer?<p>So I make ~£50K&#x2F;year doing consultancy work as a sole trader and ~£30K&#x2F;year from a web service I sell (the app requires maybe 1 day of work a month for email support and bug fixing) in the UK. I want to move from sole trader to Ltd to limit my liability and to be more flexible about when I can take the income. I use a web domain like myname.com for the consulting and myapp.com for the app.<p>1. How do I transfer the app into the Ltd? I found mentions of deeds of assignment, goodwill valuations and selling your app to the company (so your new company is paying you? where does the money come from?). And then I need to change the payment details for my app (I use Fastspring) to send all future payments to my Ltd business account, add the Ltd name to the myapp.com website terms, move the Git repo and domain name and hosting to an account owned by the Ltd, and I&#x27;m done?<p>2. I&#x27;d like to keep using myname.com&#x2F;email@myname.com for my consulting work as I am the brand here and I like the domain name. Is this a hopeless idea when I already have so many personal accounts&#x2F;shopping&#x2F;websites, and business correspondence linked to it? Or it&#x27;s not a problem as long as the contract is clear the consulting work is being signed to the Ltd and business payments&#x2F;insurance&#x2F;accounting stuff stays on an email address only used by the Ltd? I can&#x27;t think of a business name right now and want limited liability soon. I think I&#x27;m just going to register My Name Ltd as the name for now, register mynameltd@gmail.com for all business related sign ups, and think about a custom name and domain later.<p>4. Are there any good guides online about this? Most I&#x27;ve found talk about transferring property and not a single mention of apps, logins, emails, domains or code so something more tech centric would really help.<p>(Btw, I&#x27;ll talk to a lawyer and accountant but I want some base knowledge to question what they recommend. UK accountant&#x2F;laywer recommendations welcome.)",
      "time": 1651414860,
      "title": "Ask HN: Moving consulting work and SaaS income from sole trader to Ltd?",
      "type": "story"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 31225207,
      "score": 1,
      "text": "Don’t a lot more users know Python?",
      "time": 1651414831,
      "title": "Ask HN: Why do apps use scheme as a scripting language instead of Python?",
      "type": "story"
    },
    {
      "by": "danrl",
      "descendants": 0,
      "id": 31225195,
      "score": 1,
      "time": 1651414757,
      "title": "Asking for Compensation Strategy Changes",
      "type": "story",
      "url": "https://danrl.com/comp/"
    },
    {
      "by": "lastdong",
      "descendants": 0,
      "id": 31225193,
      "score": 1,
      "time": 1651414750,
      "title": "New from Anaconda: Python in the Browser",
      "type": "story",
      "url": "https://www.anaconda.com/blog/pyscript-python-in-the-browser"
    },
    {
      "by": "bemmu",
      "descendants": 1,
      "id": 31225189,
      "kids": [
        31225194
      ],
      "score": 1,
      "time": 1651414705,
      "title": "The free 30 day Build & Sell startup challenge",
      "type": "story",
      "url": "https://buildsell30.com"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 31225179,
      "score": 1,
      "time": 1651414623,
      "title": "Alterations in microbiota of Covid patients: Potential mechanisms and therapies",
      "type": "story",
      "url": "https://www.nature.com/articles/s41392-022-00986-0"
    }
  ]
}