{
  "stories": [
    {
      "by": "wjl",
      "descendants": 0,
      "id": 28358655,
      "score": 1,
      "time": 1630345848,
      "title": "Show HN: A Pythagorean Mosaic",
      "type": "story",
      "url": "https://wjlewis.github.io/pymos/"
    },
    {
      "by": "homarp",
      "descendants": 0,
      "id": 28358650,
      "score": 1,
      "time": 1630345819,
      "title": "How to Generate Secure License Keys in 2021",
      "type": "story",
      "url": "https://keygen.sh/blog/how-to-generate-license-keys-in-2021/"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 28358608,
      "score": 1,
      "time": 1630345664,
      "title": "The Music Industry Doesn't Understand Music; It Never Did",
      "type": "story",
      "url": "https://www.cracked.com/article_31118_the-music-industry-doesnt-understand-music-it-never-did.html"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 28358577,
      "score": 1,
      "time": 1630345561,
      "title": "Recreating Natural Voices for People with Speech Impairments",
      "type": "story",
      "url": "https://ai.googleblog.com/2021/08/recreating-natural-voices-for-people.html"
    },
    {
      "by": "HieronymusBosch",
      "descendants": 0,
      "id": 28358571,
      "score": 1,
      "time": 1630345534,
      "title": "Apple acquires classical music streaming service Primephonic",
      "type": "story",
      "url": "https://www.primephonic.com/"
    },
    {
      "by": "somebodyneedme",
      "descendants": 0,
      "id": 28358567,
      "score": 1,
      "text": "The really big thing that all the people who hate me don’t want to start asking is why S has not come out anonymously and signed a block or done something else that would discredit me if I am not S.<p>There is never any evidence or logical reason put forth. The entirety of the attacks against me are based on ad hominem and other logical fallacies. When I demonstrate errors in their arguments, we move into special pleading. They move the goalposts and avoids creating exceptions for when their claims are demonstrated to be false. When they talk about anything I’ve said, they make it into a strawman, which is a form of misrepresenting someone else’s argument to make it easier to attack.<p>They continually beg to create circular arguments about decentralization that include an appeal to (false) authority based on the premise that S must be a cypherpunk. Yet, no evidence was ever presented that S is a cypherpunk. Rather, they make easily debunked claims and then create a fallacy of composition and division where the creative assumption that what is true about one part of bitcoin must apply to all parts of bitcoin. That is, there is a component used in digital signature algorithms that also applies to cryptography, so therefore, it must be encrypted. But, such an assumption is false. For example, hashing is also used in managing databases, as are digital signature algorithms without these being encrypted.<p>The attacks against me being S form no true Scotsman arguments. If you say that I did something, I can’t be at or can’t be something because that’s not what a true believer would do.<p>The ad hominem attack also leads to the genetic attack. In this, the crypto-anarchists claim that because I’m bad (in their worldview), my arguments must be bad (for everybody). Yet, there is a reason why the genetic fallacy is a logical fallacy. Whilst I am not the character they want to make me into, the source of an argument isn’t a valid attack against an argument. So, for example, to say but Hitler was a vegetarian, so, therefore, vegetarians are wrong is not a good argument. Even the argument of personal incredulity is irrelevant because just because you don’t understand something does not make it false.<p>Even the move to appeal to emotion is itself a fallacy. This, in part, is used with a Tu quoque so that they can neglect to make an argument at all.<p>So very simple for them, they can claim that S might be dead. But, that claim comes with counter-attacks. It assumes that S has no family, nobody who cared for him, and that person was an isolated individual who left no evidence or people in that individual’s life who could know anything about bitcoin. They will claim Hal Finney, but there’s a problem with Hal Finney that can be easily demonstrated in court. Hal Finney wasn’t able to post throughout much of 2010. This was when I was most active as S online publicly. At times when direct updates were being made, Hal Finney was in an NMRi machine which precludes using a computer, of course.<p>Another all sorts of other claims of this sort, and all of those are easy to be discredited. But before you even get there, the assumption has a logical contradiction. They are assuming that somebody such as Hal Finney that is creating an evidence trail that can be used in collecting improving the proof of evidence over time as its extended, would also want to lie to their family. And this is a key point. Hiding that level of involvement in creating bitcoin from your family and all of the motions of how it was created and what you own is in fact a form of lying.",
      "time": 1630345521,
      "title": "Ask HN: How can I constructive to my peers?",
      "type": "story"
    },
    {
      "by": "swquinn",
      "descendants": 0,
      "id": 28358549,
      "score": 2,
      "text": "Hi! I’ve been reading HN for a while now, but this is the first time I’ve ever posted.<p>I have been doing some limited research recently, spurred on mostly out of curiosity, about how different companies approach software architecture teams and their philosophies behind them. Such as, the decision whether to have a team or not, how big the team is, what the team’s roles and responsibilities are within a company, etc.<p>From what I’ve found and from my own personal experience it seems that there is a strong correlation between software architects and software architecture teams and the way a company has organized their systems. This seems to support Conway’s Law[1].<p>In companies where the product or service was monolithic there was either one or relatively few software architects who mostly retained the broad strokes of the system in memory and act as a deciding factor in what and how features will be structured, engineered, etc. In these situations a software architect has more direct control over the software being built. It also doesn’t seem to scale as well.<p>In companies where the product is distributed, or divided into different domains or micro services, there is either no software architecture team or—like the company I’m at now—an architecture team that has a less well defined role. For instance, at the company I’m and and whose architecture team I’m a member of we have historically taken responsibility for defining how those services interface and communicate with one another and the other “interstitial” spaces between those services. Each team that owns one or more services is better versed in their service architectures than any one of us on the software architecture team could ever be.<p>The role and responsibilities of the software architecture team that I’m on today have never felt particularly well defined. I’m OK with ambiguity, but I’ve begun wondering recently how other organizations approach this space.<p>Does you company have a software architecture team? If so I’d love to learn more about how you operate. If you don’t have a software architecture team, I am equally—and maybe even more so—interested in why?<p>---<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Conway%27s_law",
      "time": 1630345458,
      "title": "Ask HN: Does your company have a software architecture team? What do they do?",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 28358533,
      "score": 3,
      "time": 1630345379,
      "title": "Covid: Delta variant patients twice as likely to need hospital care",
      "type": "story",
      "url": "https://www.bbc.com/news/health-58354342"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28358523,
      "score": 1,
      "time": 1630345325,
      "title": "DARPA Hopes a Plane-Boat Hybrid Can Solve The Pentagon’s Sealift Challenge",
      "type": "story",
      "url": "https://breakingdefense.com/2021/08/darpa-hopes-a-plane-boat-hybrid-can-the-pentagons-sealift-challenge/"
    },
    {
      "by": "vmoore",
      "descendants": 0,
      "id": 28358507,
      "score": 2,
      "time": 1630345226,
      "title": "Investigating and disabling hard-coded certificate pinning on Android",
      "type": "story",
      "url": "https://yingtongli.me/blog/2020/12/23/certificate-pinning.html"
    }
  ]
}