{
  "stories": [
    {
      "by": "aparsons",
      "descendants": 0,
      "id": 29896887,
      "score": 1,
      "text": "Hello HN,<p>I have been writing a technical book. It&#x27;s similar to Clean Code, but a little broader as it places a larger emphasis on systems over programs.<p>I&#x27;ve spent the last two years on the book, after being forced to change my typical outdoor fishing&#x2F;trekking&#x2F;hunting lifestyle due to COVID, mostly as a means to keep my sanity. As a very slow writer, I generally write about a page a day. At this rate, it will take me another year to feel the book has reached &#x27;completion&#x27;.<p>With restrictions in my state being lifted, my partner is less and less a fan of me working on the book for long hours at home (chuckle), and I have no good answer to the question of &quot;will anyone even buy this?&quot;.<p>Has anyone here had success selling a technical book like this? Was it lucrative? I&#x27;m not hurting for money, but it helps me answer some questions both for myself and my partner.",
      "time": 1641930852,
      "title": "Ask HN: How much money to realistically expect from a technical book?",
      "type": "story"
    },
    {
      "by": "dangle1",
      "descendants": 0,
      "id": 29896846,
      "score": 1,
      "time": 1641930697,
      "title": "Updated and outdated reservations re: resrch on stratospheric aerosol injection",
      "type": "story",
      "url": "https://link.springer.com/article/10.1007/s10584-021-03017-z"
    },
    {
      "by": "nixass",
      "descendants": 0,
      "id": 29896840,
      "score": 2,
      "time": 1641930657,
      "title": "Data centre outfit Interxion hit with outage at central London facility",
      "type": "story",
      "url": "https://www.theregister.com/2022/01/11/interxion_suffers_outage_at_central/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 29896838,
      "score": 1,
      "time": 1641930646,
      "title": "An atlas for endangered alphabets could save them from disappearing",
      "type": "story",
      "url": "https://www.zmescience.com/other/endangered-alphabets-saving-05012021/"
    },
    {
      "by": "timhrothgar",
      "descendants": 1,
      "id": 29896815,
      "kids": [
        29896849
      ],
      "score": 2,
      "text": "I have worked in tech for about 14 years at companies big and small. I&#x27;ve worked in startups, big tech, consultancies, and I&#x27;ve been a freelancer. The one thing that&#x27;s been pretty consistent is excessive technical complexity (aka tech debt). Probably &lt; 10% of codebases I&#x27;ve seen used proper abstractions and commonly accepted software engineering best practices. The exceptions to this are newer codebases (&lt; ~3 years old), smaller codebases (&lt; ~10,000 LOC), and smaller development teams (&lt; 10 contributors).<p>I&#x27;ve pondered this problem quite a bit. I initially perceived it as the result of engineers compromising in the face of business pressure or engineers making mistakes due to lack of experience or foresight. But as I&#x27;ve become more experienced (and worked as a manager), it seems like a tech business problem. Tech businesses face undesirable situations that result in low quality code as a side effect. Examples include critical employee departures, hyper growth, critical customer demands, and even changes in government regulatory requirements.<p>Can this be avoided for codebases that are old and large? Does anyone know of examples of codebases (public or private) that have maintained a high quality codebase that is large, old, or supported by a large number of contributors? If so, how is it done?",
      "time": 1641930547,
      "title": "Ask HN: Why is software quality always decreasing?",
      "type": "story"
    },
    {
      "by": "Jimmc414",
      "descendants": 0,
      "id": 29896810,
      "score": 1,
      "time": 1641930524,
      "title": "Congressional oversight committee releases new NIAID and NIH emails [pdf]",
      "type": "story",
      "url": "https://republicans-oversight.house.gov/wp-content/uploads/2022/01/Letter-Re.-Feb-1-Emails-011122.pdf"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 29896804,
      "score": 1,
      "time": 1641930484,
      "title": "Top colleges sued for alleged colluding on financial-aid practices",
      "type": "story",
      "url": "https://www.cnn.com/2022/01/11/us/college-admissions-antitrust-lawsuit/index.html"
    },
    {
      "by": "onatm",
      "descendants": 0,
      "id": 29896801,
      "score": 3,
      "time": 1641930477,
      "title": "Prometheus Stack Review – Operating metric system on a sizable K8s cluster",
      "type": "story",
      "url": "https://clux.github.io/probes/post/2022-01-11-prometheus-ecosystem/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29896795,
      "score": 1,
      "time": 1641930454,
      "title": "EyeCommander helps you communicate by blinking",
      "type": "story",
      "url": "https://github.com/AceCentre/EyeCommander"
    },
    {
      "by": "chapulin",
      "descendants": 0,
      "id": 29896786,
      "score": 1,
      "time": 1641930413,
      "title": "Why Covid Testing Is Still Difficult Two Years into the Pandemic",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tOU6uul6RYY"
    }
  ]
}