{
  "stories": [
    {
      "by": "zetalyrae",
      "descendants": 0,
      "id": 28463289,
      "score": 1,
      "time": 1631136489,
      "title": "Soar Cognitive Architecture",
      "type": "story",
      "url": "https://soar.eecs.umich.edu/"
    },
    {
      "by": "hackcasual",
      "descendants": 0,
      "id": 28463285,
      "score": 1,
      "time": 1631136468,
      "title": "Wells Notice",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Wells_notice"
    },
    {
      "by": "hncurious",
      "descendants": 0,
      "id": 28463277,
      "score": 1,
      "time": 1631136440,
      "title": "CDC tightened masking guidelines after threats from teachers union, emails show",
      "type": "story",
      "url": "https://www.foxnews.com/politics/cdc-tightened-masking-guidelines-after-threats-from-teachers-union.html"
    },
    {
      "by": "reedjosh",
      "descendants": 0,
      "id": 28463269,
      "score": 1,
      "time": 1631136378,
      "title": "Public Comment on Inflation Measurement",
      "type": "story",
      "url": "http://www.shadowstats.com/article/no-438-public-comment-on-inflation-measurement"
    },
    {
      "by": "sdht0",
      "descendants": 1,
      "id": 28463236,
      "kids": [
        28463301
      ],
      "score": 2,
      "time": 1631136194,
      "title": "Amazon slams SpaceX, tells FCC that Musk-led companies are rule-breakers",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/09/amazon-slams-spacex-tells-fcc-that-musk-led-companies-are-rule-breakers/"
    },
    {
      "by": "jhabdas",
      "descendants": 0,
      "id": 28463200,
      "score": 2,
      "text": "As if surveillance capitalism and track and trace wasn&#x27;t bad enough, now even so-called &quot;free&quot; dating sites are joining in on the madness by forcing users to provide government-issued identification just to find a date down the street. Where does this end? Or has it just begun? And why are so many willing to give up their freedoms in exchange for a little temporary convenience?",
      "time": 1631135936,
      "title": "Coffee Meets Bagel requests government IDs to date now",
      "type": "story"
    },
    {
      "by": "anigbrowl",
      "descendants": 0,
      "id": 28463195,
      "score": 1,
      "time": 1631135920,
      "title": "LAPD's social media monitoring documents",
      "type": "story",
      "url": "https://www.brennancenter.org/our-work/research-reports/lapd-social-media-monitoring-documents"
    },
    {
      "by": "cubano",
      "descendants": 0,
      "id": 28463162,
      "score": 1,
      "text": "Hi... cubano here on hackernews and at the risk of totally breaking all kinds of TOS agreements and such, I am declaring that I am totally flat broke at the moment [ https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28216714 ], and I am asking any kind souls here on HN if you could find it in your hearts and wallets to help me with...<p>1. paying my hosting fees on cloudcone.com as my CV and my LAMP-Stack showcase current project  [ lasvegasluxerealty.com ] are hosted there and I really need them to be available.<p>and<p>2. paying craigslist listing fees for my &quot;software tutoring offered&quot; listing [ https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;14XVErGa_UgY8DBsOB1n0mNKYwu1psH3-&#x2F;view?usp=sharing ] for my local area and as many other craigslist sites as I can afford, sorted by population (see below).<p>My monthly hosting fee is $18.42, and the craigslist &quot;services offered&quot; fee is $5 per, so the minimum I&#x27;m asking for is $23.42...for every $5 more, I will post on another craigslist local area, sorted descending by population size, so Los Angeles would come after my initial post, follow my New York City, then Chicago etc etc.<p>If anyone has better ideas about posting my tutoring ad in different places for free, please comment below and I&#x27;ll be more than happy to give it a try.<p>I feel that with my over 4000 points here on HN, that my request for small sum donations is at least somewhat justified as I have provided entertainment and insights (well, maybe I should stick to entertainment side of things) to the unwashed and unruly masses here.  Also, I see this as a type of experiment in exchanging social &quot;karma&quot; in relation to asking for monetary donations and plan on doing a full write-up with the results of the &quot;experiment&quot; (so again, I&#x27;m not really asking for a hand-out as I am promising a service in exchange for any donations).<p>I&#x27;ve recently explained here on HN , I am currently going thru some rough times financially [see above hackernews link] and all im asking is enough donations to pay my web-hosting and job-searching fees (although anything more will be used for various items moving up &quot;the pyramid&quot;, roughly, in relation to Maslow&#x27;s Hierarchy of Needs [ https:&#x2F;&#x2F;www.simplypsychology.org&#x2F;maslow.html ].<p>I quickly scanned the FAQ here and didn&#x27;t see anything that explicitly prevents me from asking for donations for this &quot;project&quot;, but I&#x27;ll admit, I didn&#x27;t look very hard...please forgive me (and if it makes you feel better, call me an asshole as well) if this post insults you in anyway, shape, or form, and ignore it ASAP.  For those who are kind enough to help me, God bless you or, if atheist, well God bless you, too.<p>My donation link is https:&#x2F;&#x2F;www.paypal.me&#x2F;MarkEnriquez.  I will post the results of this &quot;experiment&quot; in the next few days.",
      "time": 1631135739,
      "title": "Does Pre-Earned Karma on Social Blogs Have Latent Financial Value?",
      "type": "story"
    },
    {
      "by": "breck",
      "descendants": 0,
      "id": 28463153,
      "score": 1,
      "time": 1631135712,
      "title": "Research finally reveals ancient universal equation for the shape of an egg",
      "type": "story",
      "url": "https://www.kent.ac.uk/news/science/29620/research-finally-reveals-ancient-universal-equation-for-the-shape-of-an-egg"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28463113,
      "score": 2,
      "time": 1631135423,
      "title": "You Can Make a Netflix Style Doc About Literally Anything",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9BUrNe3Vhtk"
    }
  ]
}