{
  "stories": [
    {
      "by": "ajaalto",
      "descendants": 0,
      "id": 29576946,
      "score": 2,
      "time": 1639651274,
      "title": "Teuvo Kohonen Has Died",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Teuvo_Kohonen"
    },
    {
      "by": "9ranty",
      "descendants": 0,
      "id": 29576933,
      "score": 2,
      "time": 1639651089,
      "title": "Show HN: Tella for Chrome – a screen recorder with consecutive clip capture",
      "type": "story",
      "url": "https://www.tella.tv/chrome"
    },
    {
      "by": "DSpider",
      "descendants": 0,
      "id": 29576930,
      "score": 1,
      "time": 1639651062,
      "title": "Show HN: Towards a seamless multi-technology access network",
      "type": "story",
      "url": "https://hal.inria.fr/tel-01593255/"
    },
    {
      "by": "bronhy",
      "descendants": 0,
      "id": 29576920,
      "score": 1,
      "text": "So this is how I lost access to my AWS account.<p>So I was following AWS recommendation on activating the MFA and stupidly I saved my MFA code to google authenticator   which did not transfer the codes after I got my new Iphone which I restored from the previous one.<p>Although the account is created in Europe where we have strict GDPR laws somehow my data needs to be processed by Amazon in USA. They want me to verify the Identity Verification Form and Affidavit by a notary in Germany.<p>After I told them that this introduces high costs they told me that the form could be signed by my lawyer. Doing that and sending the copy of my identity card was still not enough since they went back to their previous demand that the form needs to be signed by the notary.<p>Now I have no access to the account and I guess if you want to be on the safe GDPR side one should just chose Hetzner.",
      "time": 1639650974,
      "title": "Maybe you should not choose AWS",
      "type": "story"
    },
    {
      "by": "fabrizio_italia",
      "descendants": 0,
      "id": 29576916,
      "score": 1,
      "time": 1639650959,
      "title": "Self-Attention does not need O(n^2) Memory",
      "type": "story",
      "url": "https://arxiv.org/abs/2112.05682"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 29576899,
      "score": 1,
      "time": 1639650803,
      "title": "Alternate Tools – Alternate Textbrowser",
      "type": "story",
      "url": "http://www.alternate-tools.com/pages/c_textbrowser.php?lang=ENG"
    },
    {
      "by": "SilentWorker",
      "descendants": 0,
      "id": 29576879,
      "score": 1,
      "text": "Yeah, I agree with you. The math used for credit scores is extremely effective but not easy to understand for the regular person.",
      "time": 1639650569,
      "title": "Re",
      "type": "story"
    },
    {
      "by": "lolftw",
      "descendants": 0,
      "id": 29576872,
      "score": 1,
      "text": "Hi,<p>I have a bachelors degree in a non-science related field so I have never conducted a research study myself. I find it very difficult to understand if the study I am reading is well thought out, with good practices or just comes from shady interests or publications.<p>How can I be better informed to distinguish between good and valid studies from the others?<p>How do I know if a study has been peer reviewed and what were the conclusions of those reviews?<p>How do I know if the methodology chosen for trials was right or flawed?<p>Is there any &quot;Research Studies for Dummies&quot; resource out there I can read to improve my knowledge on this?<p>Thank you",
      "time": 1639650470,
      "title": "Ask HN: How to better understand studies and papers?",
      "type": "story"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 29576820,
      "score": 1,
      "time": 1639649850,
      "title": "Launching Version 13.0 of Wolfram Language and Mathematica",
      "type": "story",
      "url": "https://writings.stephenwolfram.com/2021/12/launching-version-13-0-of-wolfram-language-mathematica/"
    },
    {
      "by": "daniaal",
      "descendants": 0,
      "id": 29576819,
      "score": 1,
      "time": 1639649847,
      "title": "Reddit: Social media platform files to go public",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-59678451"
    }
  ]
}