{
  "stories": [
    {
      "by": "jger15",
      "descendants": 0,
      "id": 29125890,
      "score": 1,
      "time": 1636155656,
      "title": "Crypto and the Conservation of Centralization",
      "type": "story",
      "url": "https://www.drorpoleg.com/conservation-of-centralization/"
    },
    {
      "by": "qualy",
      "descendants": 0,
      "id": 29125876,
      "score": 1,
      "text": "Looking for volunteers to be cloned.",
      "time": 1636155461,
      "title": "Would you be interested in being cloned by a company",
      "type": "story"
    },
    {
      "by": "kenarsa",
      "descendants": 0,
      "id": 29125873,
      "score": 1,
      "time": 1636155439,
      "title": "Octopus: Google Search for Voice",
      "type": "story",
      "url": "https://github.com/Picovoice/octopus"
    },
    {
      "by": "opless",
      "descendants": 0,
      "id": 29125839,
      "score": 2,
      "time": 1636154989,
      "title": "Upgrading an Amiga 500 for Today",
      "type": "story",
      "url": "https://benjamin.computer/posts/2021-09-30-amiga-upgrade.html"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29125831,
      "score": 2,
      "time": 1636154946,
      "title": "NASA, USGS Release First Landsat 9 Images",
      "type": "story",
      "url": "https://www.nasa.gov/press-release/nasa-usgs-release-first-landsat-9-images/"
    },
    {
      "by": "LeviathanCoding",
      "descendants": 1,
      "id": 29125826,
      "kids": [
        29125853
      ],
      "score": 2,
      "text": "I&#x27;m wanting to make a web app where there is a hotlist that will display trending topics first, kind of like how HN works.<p>I am using MongoDB for this and the data that effects each item is VIEWS, REVIEWS, and LIKES.<p>How can I calculate by how many likes, views, and reviews an item is getting to test if they are trending or not?",
      "time": 1636154929,
      "title": "Ask HN: How can I make a constantly-updating hotlist like HN?",
      "type": "story"
    },
    {
      "by": "andrewfromx",
      "descendants": 0,
      "id": 29125818,
      "score": 1,
      "text": "I heard the greatest little self-help trick the other day. You&#x27;ve\nprobably been doing this for years or it comes naturally to you. The\nidea is to think of taming a wild horse and how at first the horse\ndoesn&#x27;t trust you and it might not go in the direction you want to go.\nBut you go along for the ride, petting the horse, letting it decide\nwhere to go and being happy with any direction. With tons of patience\nyou keep at this for a long time until finally the horse has bonded\nwith you. He trusts you, and you can for the first time, carefully,\ngently, suggest he turn left or right. If you pull left or right too\nviolently or suddenly, you&#x27;ll spook the horse, lose his trust, and be\nback to having no control. So you have to make very gentle left or\nright suggestions. Over time you get better and better at it and at\nsome point you really can say you&#x27;ve &quot;tamed&quot; it and getting the horse\nto take you to your correct destination is no problem at all.<p>The horse is a metaphor for life and becoming a master at getting your\nlife to go the direction you want is the same process. But the way you\nslowly bond with life is to let life take you any direction it wants\nat first. The way you express you are okay with this is to be grateful\nfor anything life throws at you.  The way you &quot;spook the horse&quot; and\nhave to start all over again is to try and pick the direction too\nsoon. You have to bank tons and tons of gratitude for all sorts of\nlittle things before life will let you take the reins and suggest a\nnew course.<p>The challenge is to 180 your thinking when you are unhappy with any\nsituation and look for the good. Sometimes you have to resort to stuff\nlike &quot;well, I&#x27;m grateful there was hot water in the shower today.&quot; or\nother stuff we often take for granted. But over and over you don&#x27;t let\nyourself get down or depressed, you keep looking for ways to say\n&quot;thanks life! I&#x27;m super grateful for today&#x27;s direction!&quot; And just like\nwith the horse you have to be patient, only once you have enough\ngratitude banked do you dare suggest life go the way YOU want.<p>from https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=X64vpuY-Npg",
      "time": 1636154814,
      "title": "Influencing Life's Direction",
      "type": "story"
    },
    {
      "by": "markus_zhang",
      "descendants": 0,
      "id": 29125814,
      "score": 1,
      "text": "The thought came from reading this HN post:\nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29104047<p>I realized, while reading the post, that those programmers in JPM&#x2F;BAML&#x2F;etc. got the chance to do some really interesting system programming, including creating a whole new IDE, some hacky and brilliantly implemented heavy-weight libraries and frameworks. And the best thing is, they got adopted by thousands, if not tens of thousands of users without any marketing.<p>Look at it this way. Let&#x27;s say you got the chance to join the Visual Studio team, or Jetbrain, what is the probability that you are to work on AND own a brand new IDE? Probably ZERO. You might say, &quot;But I can put up my own and open-source it&quot;, my answer is &quot;You would be really lucky if three digits of users pick it up&quot;.<p>After some thoughts, I guess here is my conclusion. The following prerequisites must be satisfied if one wants to land in such a position:<p>- The company must be a &quot;closed-source&quot; company, i.e. open source can come in but the code doesn&#x27;t necessarily get out;<p>- The company must NOT have a ton of brilliant programmers, i.e. it increases the chance of someone, especially someone new to helm a new project.<p>- Extended from previous one: The company is NOT a technology company but it has to be a rich one (a bank for example). So that once it adopts something new it is willing to stick to it, regardless of the cost (Companies such as Google and Microsoft are less willing to do so, just look at how many products they drop)<p>- You must wait until the right moment to join (otherwise, if you joined earlier, you probably only got to maintain a shit mountain of COBOL code, and if you joined late, you probably only got to maintain a shit mountain of Python code)<p>- It is imperative that your Director wants some change in the IT system, either of political reason, or technical reason. The reason is not important, and whether the new system benefits the company is not important either. The important thing is some big shot wants some change, and you happen to be the one picked.<p>I guess this kind of one-time-in-life chance cannot be scientifically analyzed, but I think there might be a way to generalize the phenomenon and gives oneself a better career.<p>What&#x27;s your thoughts my friends?",
      "time": 1636154779,
      "title": "Weekend chat: What jobs give opportunities to do sys prog PLUS own the project?",
      "type": "story"
    },
    {
      "by": "dsdsdsJK",
      "descendants": 0,
      "id": 29125806,
      "score": 1,
      "time": 1636154682,
      "title": "Python for Beginners: Interpreting My Amazon Spending with a Repl",
      "type": "story",
      "url": "https://blog.replit.com/python-for-beginners"
    },
    {
      "by": "birriel",
      "descendants": 0,
      "id": 29125794,
      "score": 1,
      "time": 1636154597,
      "title": "Why the Lucky Stiff Documentary [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=64anPPVUw5U"
    }
  ]
}