{
  "stories": [
    {
      "by": "mtlynch",
      "descendants": 0,
      "id": 30162509,
      "score": 1,
      "time": 1643724281,
      "title": "My Fourth Year as a Bootstrapped Founder",
      "type": "story",
      "url": "https://mtlynch.io/solo-developer-year-4/"
    },
    {
      "by": "cosmic_quanta",
      "descendants": 0,
      "id": 30162497,
      "score": 1,
      "time": 1643724220,
      "title": "Underlining the Bugs",
      "type": "story",
      "url": "https://reasonablypolymorphic.com/blog/underline-bugs/"
    },
    {
      "by": "iordachej",
      "descendants": 0,
      "id": 30162494,
      "score": 1,
      "text": "When incorporating a C-corp, should the Partner Agrement contain the details about the share splitting with all their terms about vesting and others? I found a template online having no such details and I wonder if it should or not.<p>Thanks",
      "time": 1643724214,
      "title": "Should the stock details be part of the partner agrement document in a startup?",
      "type": "story"
    },
    {
      "by": "vitaprince",
      "descendants": 0,
      "id": 30162473,
      "score": 1,
      "text": "Hello everyone, \nI&#x27;m the individual researcher of computer vision major in medical imaging as a five-year Python engineer and a two-year data engineer. I uploaded some educational videos of build machine learning pipelines and train models since last year, and some customers told me that they have no experience of engineering as they still want the customized model can work on their devices. Therefore, I have an idea about build a platform to help them apply the model on their devices built from their own datasets, and meanwhile, the tasks are commonly show up in terms of object detection(face recognition), voice classification, text translation,etc. As I have experience of engineering about server-side engines, data analysing and machine learning modelling, I would like to connect with a sort of engineers and colleagues not only focused but also whom brought ideas and thoughts are welcomed. Be aware, the project are intended as volunteering till now, but I promise we definitely will discuss the salary once we have got any of long-term supports, funding or subscribers.<p>The initial idea is :\nIt&#x27;s an online services like the PaaS structure. We provide a web labelling system to support users do label their datasets online or upload their offline labelled data from kinds of tools like labelme on images, then we provide the defined pipeline to preprocess the labelled data, in terms of verification, augmentation and standardized. Once the data are prepared, we let users to choose which model they want to train and put it into the automatic and adapted training loop, initially we provide limited computation resources to the free users and more resource among more flexibility to subscribers later on. At last, the model can be exported as an app after quantized and optimized or a simple testing website which consists the similar template. The app can be decided by functions or user interfaces.<p>If someone interested in, please contact me. (no matter degrees, religions, areas, we prefer work remotely and flexible)\nE-mail: nolan.w.sf@gmail.com (preferable)\nDiscord: https:&#x2F;&#x2F;discord.gg&#x2F;AZvGknYs99",
      "time": 1643724091,
      "title": "Startup project of applied machine learning platform",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30162467,
      "score": 1,
      "time": 1643724068,
      "title": "The Spotify boycott will likely be short-lived",
      "type": "story",
      "url": "https://news.yahoo.com/spotify-boycott-likely-short-lived-105513048.html"
    },
    {
      "by": "sdeframond",
      "descendants": 0,
      "id": 30162466,
      "score": 1,
      "time": 1643724066,
      "title": "Progressive Web Apps for Firefox",
      "type": "story",
      "url": "https://addons.mozilla.org/en-US/firefox/addon/pwas-for-firefox/"
    },
    {
      "by": "anais9",
      "descendants": 0,
      "id": 30162461,
      "score": 1,
      "time": 1643724022,
      "title": "Open-source wallpaper generator to make your MacBook/iPhone notch disappear",
      "type": "story",
      "url": "https://github.com/alexdredmon/notchbegone"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30162448,
      "score": 1,
      "time": 1643723961,
      "title": "Government agencies are tapping a facial recognition company to prove you’re you",
      "type": "story",
      "url": "https://theconversation.com/government-agencies-are-tapping-a-facial-recognition-company-to-prove-youre-you-heres-why-that-raises-concerns-about-privacy-accuracy-and-fairness-175817"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 30162446,
      "score": 1,
      "time": 1643723959,
      "title": "Marina Business Gets Lift from Pandemic Boat Sales",
      "type": "story",
      "url": "https://www.wsj.com/articles/marina-business-gets-lift-from-pandemic-boat-sales-11643720403"
    },
    {
      "by": "keiferski",
      "descendants": 0,
      "id": 30162441,
      "score": 1,
      "time": 1643723939,
      "title": "Interview with Dune Concept Designer",
      "type": "story",
      "url": "https://1granary.com/fashion-image/adam-middleton-an-interview-with-the-concept-designer-of-dune/"
    }
  ]
}