{
  "stories": [
    {
      "by": "tomrod",
      "descendants": 0,
      "id": 29786857,
      "score": 1,
      "time": 1641243826,
      "title": "MLOps.Community – secret powerhouse of MLOps folks",
      "type": "story",
      "url": "https://mlops.community/"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29786849,
      "score": 1,
      "time": 1641243802,
      "title": "World’s Largest Floating Photovoltaic (PV) Plant Goes Online in China",
      "type": "story",
      "url": "https://www.pv-magazine.com/2022/01/03/worlds-largest-floating-pv-plant-goes-online-in-china/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29786838,
      "score": 1,
      "time": 1641243751,
      "title": "A macOS system monitor in your menu bar",
      "type": "story",
      "url": "https://github.com/exelban/stats"
    },
    {
      "by": "lisper",
      "descendants": 0,
      "id": 29786828,
      "score": 1,
      "text": "I&#x27;m writing a book about the scientific method targeted to a lay audience.  As part of the dramatic narrative I came up with the following puzzle: imagine you have built a time machine and you want to go back to ancient Greece and try to convince someone that you are from the future.  The time machine operates under Terminator rules: it can only transport your body, no artifacts.   (Some provision is made for you to acquire period clothing once you arrive, but that&#x27;s it.)  So the only thing you can take back with you is information that you are able to memorize.  You can study for as long as you want before you go (so, for example, you can, and probably should, learn to speak ancient Greek) but once you go there is no coming back.<p>Mark Twain used a similar scenario as a plot point in his book, &quot;A Connecticut Yankee in King Arthur&#x27;s Court.&quot;  In that book the protagonist solves the problem by predicting an eclipse of the sun, but that isn&#x27;t very interesting so I am adding the following two conditions to the puzzle:<p>1.  There is some uncertainty about exactly when and where you will arrive.  The time uncertainty is many decades, and the space uncertainty is many tens of kilometers.<p>2.  You have to convince them within a small number of weeks, otherwise they will just decide you are crazy and throw you in the loony bin.<p>So predicting a solar eclipse doesn&#x27;t work because solar eclipses are very rare at any particular point on the ground, so the odds of you appearing someplace where there will be a solar eclipse to predict are vanishingly small.  Even if you did get lucky enough to end up somewhere that an eclipse would happen within a few weeks, you would have to either memorize the exact time and location of <i>all</i> of the solar eclipse events in Greece over a multi-decade period, or learn how to calculate them on the fly by hand.  You would also have to somehow figure out exactly when and where you had arrived.  You can&#x27;t just go buy a newspaper and look at the masthead.<p>Some other things that won&#x27;t work:<p>1.  Predicting a lunar eclipse.  The ancient Greeks knew how to do that so this would not impress them.<p>2.  Predicting a historical event, for all of the same reasons that predicting a solar eclipse wouldn&#x27;t work.<p>The puzzle is designed to nudge you towards an approach where you try to reproduce some scientific or technological advance towards which you can leverage the knowledge you bring with you from the future.<p>I have not been able to come up with a solution.",
      "time": 1641243692,
      "title": "Challenge HN: Convince an ancient Greek that you are from the future",
      "type": "story"
    },
    {
      "by": "diggan",
      "descendants": 0,
      "id": 29786802,
      "score": 2,
      "time": 1641243609,
      "title": "CCC – Hacker Ethics",
      "type": "story",
      "url": "https://www.ccc.de/en/hackerethics"
    },
    {
      "by": "axiomdata316",
      "descendants": 0,
      "id": 29786749,
      "score": 2,
      "time": 1641243372,
      "title": "Ebikes Are Scarce. Maybe You Should Build One (2021)",
      "type": "story",
      "url": "https://www.nytimes.com/wirecutter/blog/build-ebike/"
    },
    {
      "by": "Someone",
      "descendants": 0,
      "id": 29786743,
      "score": 2,
      "time": 1641243348,
      "title": "Paper Railroad Wheels? (2016)",
      "type": "story",
      "url": "https://www.cupery.net/wheels.html"
    },
    {
      "by": "hwers",
      "descendants": 0,
      "id": 29786736,
      "score": 1,
      "text": "We clearly can create bigger and stronger CPUs and GPUs. The highest end stuff Nvidia creates (like the V100) are amazing. I can&#x27;t imagine the actual manufacturing cost of these things are particularly high, so that leads me to wonder: Is the only reason we&#x27;re seeing stagnant growth because Nvidia et al has a monopoly on the IP to make these things? What&#x27;s your take?",
      "time": 1641243308,
      "title": "Ask HN: Is the death of Moore's Law just the consequence of no competition?",
      "type": "story"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 29786734,
      "score": 2,
      "time": 1641243287,
      "title": "Winnie the Pooh should have been free decades ago: Copyrights should be shorter",
      "type": "story",
      "url": "https://fullstackeconomics.com/winnie-the-pooh-should-have-been-free-decades-ago/"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 29786725,
      "score": 2,
      "time": 1641243251,
      "title": "Biggest change to trash since the ’80s. Hint: It’s all about composting",
      "type": "story",
      "url": "https://www.sfchronicle.com/projects/2022/california-compost-law-climate-change-effect/"
    }
  ]
}