{
  "stories": [
    {
      "by": "JNRowe",
      "descendants": 0,
      "id": 30915222,
      "score": 1,
      "time": 1649132013,
      "title": "Claws Mail 3.19.0 / 4.1.0 released",
      "type": "story",
      "url": "https://www.claws-mail.org/news.php"
    },
    {
      "by": "joshbochu",
      "descendants": 0,
      "id": 30915210,
      "score": 1,
      "time": 1649131867,
      "title": "Ask HN: What do you hate about remote work?",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30915207,
      "score": 1,
      "time": 1649131834,
      "title": "As Russia Plots Its Next Move, an AI Listens to the Chatter",
      "type": "story",
      "url": "https://www.wired.com/story/russia-ukraine-war-ai-surveillance/"
    },
    {
      "by": "gnodar",
      "descendants": 0,
      "id": 30915196,
      "score": 1,
      "time": 1649131733,
      "title": "Think DSP: An Introduction to Digital Signal Processing in Python",
      "type": "story",
      "url": "https://github.com/AllenDowney/ThinkDSP"
    },
    {
      "by": "f0e4c2f7",
      "descendants": 0,
      "id": 30915169,
      "score": 1,
      "time": 1649131443,
      "title": "Windows 95 Launch Found Footage (1995)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_JzfROUDsK0"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30915159,
      "score": 1,
      "text": "Maybe this was obvious to some people but I just realized it. Reading an article that was interesting and I was learning from I realized there were two other links in that article of concepts that I didn&#x27;t understand so I had opened them up in other tabs. And I realized that in order to get the full picture of what I was reading I would need to read those other two links as well. And that&#x27;s because of hyperlinks there&#x27;s always more information and you&#x27;re never finished reading the story. So I kind of realized the corollary of that is maybe that information expands to fill our time but our time to actually do anything with it and act on that information contracts. so the result is that we&#x27;re chronically inattentive to what&#x27;s actually happening in our lives and to the actions we could take to improve things, to the extent that we are engaged with this exponentially expanding field of information. And also we&#x27;re not actually putting it into practice because we&#x27;re spending so much time absorbing the full picture. While an extreme that reflects not how everybody engages with information online all the time tho I think it&#x27;s representative enough of a serious aspect of that, so it does play into our experience these days. And maybe that is one of the reasons that people are feeling less happy even though they have more solutions to all the things that they could improve: because the lack of attention budget means people are less likely to be able to be mindful and less likely to be able to actually take actions to create those improvements, because they&#x27;re constantly learning what actions they could possibly take.<p>Anyway that&#x27;s just my take on this exponential medium thing. I thought it was an interesting characterization of the internet and I&#x27;d never heard it phrased in that way where it&#x27;s exponential in the sense that it relates to your reading input.",
      "time": 1649131213,
      "title": "Tell HN: The Internet Is an Exponential Medium",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30915138,
      "score": 1,
      "time": 1649130872,
      "title": "R128gain – Fast audio loudness scanner and tagger (ReplayGain v2 / R128)",
      "type": "story",
      "url": "https://github.com/desbma/r128gain"
    },
    {
      "by": "cellis",
      "descendants": 0,
      "id": 30915124,
      "score": 1,
      "time": 1649130713,
      "title": "What Happened to BTC-E?",
      "type": "story",
      "url": "https://cryptoassetrecovery.com/2021/04/22/what-happened-to-btc-e/"
    },
    {
      "by": "dragonsh",
      "descendants": 0,
      "id": 30915100,
      "score": 1,
      "time": 1649130428,
      "title": "LXD 5.0 LTS has been released",
      "type": "story",
      "url": "https://discuss.linuxcontainers.org/t/lxd-5-0-lts-has-been-released/13723"
    },
    {
      "by": "porjo",
      "descendants": 0,
      "id": 30915085,
      "score": 2,
      "time": 1649130227,
      "title": "Don’t Use Periods in Your Phone Number (2011)",
      "type": "story",
      "url": "https://www.lee.org/blog/2011/10/22/dont-use-periods-in-your-phone-number/"
    }
  ]
}