{
  "stories": [
    {
      "by": "shardullavekar",
      "descendants": 0,
      "id": 31286126,
      "score": 2,
      "text": "Hi All, this is Shardul here - I am the co-founder of Videobug.<p>https:&#x2F;&#x2F;bug.video<p>We are super excited to share Videobug with you. Videobug records run time code execution so that developers can watch it line by line as frequently as they want, right in their IDE. It takes away the pain of recreating exact conditions that led to a bug and saves developer time in every bug squash.<p>Parth (my co-founder) and I have worked on multiple production grade applications in startups and enterprises.<p>We used Logrocket, Sentry, and Datadog for logging and found ourselves adding more logs after a bug is found.<p>Adding accurate logs required disciplined engineering and collaboration across teams. Time to connect these logs to what’s wrong in the code, took quite sometime.<p>Videobug logs everything automatically. We are super psyched to launch our offline version. We plan to launch a fully self hosted version in 4 weeks from now, which will allow you to record and replay code executions in your staging and production environments.<p>We are looking for product feedback.<p>Here is a 2 min demo explaining how to use Videobug.<p>https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=U53IQifMt54<p>Join our discord channel to share your feedback or in case you need support.<p>https:&#x2F;&#x2F;discord.gg&#x2F;Hhwvay8uTa<p>P.S. Please note that we collect the following analytics data from your IDE: Your computer hostname, debugging events such as “started debugger”, “fetched exceptions” and “searched for code execution”.",
      "time": 1651850021,
      "title": "Show HN: Videobug – The time travel debugger for JVM",
      "type": "story"
    },
    {
      "by": "plam503711",
      "descendants": 0,
      "id": 31286103,
      "score": 5,
      "time": 1651849885,
      "title": "My vision for Open Source pro support",
      "type": "story",
      "url": "https://xcp-ng.org/blog/2022/05/06/my-vision-for-open-source-pro-support/"
    },
    {
      "by": "gs01han",
      "descendants": 1,
      "id": 31286065,
      "kids": [
        31286067
      ],
      "score": 1,
      "time": 1651849692,
      "title": "Help looking for a edge gateway manufacturing partner",
      "type": "story",
      "url": "http://aredgroup.com/"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 31286055,
      "score": 2,
      "time": 1651849658,
      "title": "PromQL Compliance Test Results",
      "type": "story",
      "url": "https://promlabs.com/promql-compliance-tests/"
    },
    {
      "by": "croes",
      "descendants": 1,
      "id": 31286032,
      "kids": [
        31286080
      ],
      "score": 2,
      "time": 1651849551,
      "title": "ISPs stop fighting California net neutrality law",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/05/stung-by-3-court-losses-isps-stop-fighting-california-net-neutrality-law/"
    },
    {
      "by": "cgenschwap",
      "descendants": 1,
      "id": 31286023,
      "kids": [
        31286026
      ],
      "score": 1,
      "time": 1651849512,
      "title": "Show HN: Open-source API-only Builders Forum (beta)",
      "type": "story",
      "url": "https://youonlygetanapi.com/public/index.html"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31286022,
      "score": 1,
      "time": 1651849508,
      "title": "Don't click profile photo [You Tube]",
      "type": "story",
      "url": "https://www.youtube.com/channel/UCxqEnDzC3Hd5LZEcIfMNrnQ"
    },
    {
      "by": "Famskiii",
      "descendants": 1,
      "id": 31286000,
      "kids": [
        31286034
      ],
      "score": 2,
      "text": "I’m building a tool that makes the connection between employee growth and company growth visible.<p>With this tool, you can use several types of cards on a whiteboard to visualize how your company strategy and goals intertwine with the personal goals of your team members. Founders can add the company strategy and goals, and team members can add team- and personal goals. By connecting them, it gets clear how these are related. Team Leads can use these insights to guide their team members in their growth and maximize this way both personal and company growth.<p>When using this tool during communication moments with your team members, for instance, during team sessions, 1:1’s, strategy updates or onboarding sessions, you can optimize alignment and engagement in your company. Team members are easily updated when there are strategy changes and see at the same time how their own work contributes to the bigger picture of the company.<p>Really curious about what you guys think about the tool. Do you see potential? And what would make the tool better? Thanks for your feedback!",
      "time": 1651849397,
      "title": "Show HN: I'm building a workspace where companies can map out their Strategy",
      "type": "story",
      "url": "https://www.kinety.app/"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31285993,
      "score": 1,
      "time": 1651849379,
      "title": "My testing strategy for serverless applications",
      "type": "story",
      "url": "https://theburningmonk.com/2022/05/my-testing-strategy-for-serverless-applications/"
    },
    {
      "by": "dSebastien",
      "descendants": 0,
      "id": 31285978,
      "score": 2,
      "time": 1651849284,
      "title": "The LIFT principle is not only awesome for code",
      "type": "story",
      "url": "https://dsebastien.net/blog/2022-04-26-lift"
    }
  ]
}