{
  "stories": [
    {
      "by": "Media_aspiring",
      "descendants": 0,
      "id": 29563053,
      "score": 1,
      "text": "rct AI, the provider of AI solutions for the video game industry based off LA, has announced completion of $10M+ Series A-3 funding led by Yuanyuzhou Ventures and Springwind Ventures.<p>rct AI is a tech-driven project that builds the true Metaverse with AI-generated content for gaming and blockchain. Since establishment in 2018, they have partnered with 20+ game studios and served 200M+ users worldwide. In this round, they raised funds from Yuanyuzhou Ventures, Springwind Ventures, Galaxy Interactive, Bonfire Union, Everest Ventures Group, FBG Capital, Folius Ventures, Hash Global, HashKey Capital, Mr. Liang Xinjun (co-founder of Fosun Group), Lucid Blue Ventures, Mask Network, PKSHA SPARX Algorithm Fund, SNZ, and Zonff Partners — powerful VCs from the US, China, Japan, etc. countries &amp; regions very active in gaming, AI, and blockchain.<p>They attracted the attention of the mainstream media and were chosen a TechCrunch favorite startup. The unconventional vision helped rct AI raise funds from acclaimed investment institutions. Sky Saga Capital and Y Combinator led two of their Seed rounds, while Makers Fund and Galaxy Interactive led the two previous Series A round.<p>One of rct AI’s core products is Deterrence, the world’s first AI layer powering intelligent NFTs. Deterrence is integrated with AI conversation models, AI intent recognition, and AI motion generation to create cognitively aware virtual beings.<p>According to rct AI, now each intelligent NPC and virtual being can sense state changes in digital environments. Thus, player interactions are no longer limited to fixed and repetitive dialogues and choices. The innovation does not end here, since together with AI-to-earn (AI yield farming), Deterrence opens new possibilities for all play-to-earn games.<p>Cutting-edge is the second name of rct AI. They developed the world’s first AAA play-to-earn game and the NPC response and storyline generator Morpheus AI engine backed by the Chaos Box algorithm, which is connected and empowered by Deterrence to provides AI utility and experience to all users.<p>Besides the gamefi automated yield framing, these include higher liquidity of NFTs and higher revenue for NFT owners. NFTs are another key area of interest and business expansion for rct AI.<p>They developed the world’s first intelligent NFT and a series of boutique play-to-earn games. Intelligent NFTs are designed using the world’s first intelligent NFT chip, a standardized product powered by Deterrence that helps individual creators and teams build all kinds of high-quality and life-like intelligent virtual beings and creatures. rct’s first collection of intelligent tokens called Mirror NFT opened the boutique gamefi project Mirror World which helped rct AI find partners among notable blockchain projects and communities. As of now, Mirror NFT owners have performed millions of transactions with their tokens.<p>rct AI CEO Yuheng Chen stated “What lies ahead of us is an unprecedented endeavor in human history. As we live together with truly intelligent virtual beings and intelligent NFTs to move forward and develop the vast and multitudinous Metaverse, we are also refreshing our understanding and knowledge of life itself.”",
      "time": 1639553550,
      "title": "Rct AI Closed Series A-3 Funding",
      "type": "story"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 29563030,
      "score": 1,
      "time": 1639553344,
      "title": "Homunculus Revolts: Re-Figuring the Neurological Subject",
      "type": "story",
      "url": "http://somatosphere.net/2019/homunculus-revolts-re-figuring-the-neurological-subject.html/"
    },
    {
      "by": "detaro",
      "descendants": 0,
      "id": 29563028,
      "score": 1,
      "time": 1639553310,
      "title": "Administrative fine – Grindr LLC ($7.1M) [pdf]",
      "type": "story",
      "url": "https://www.datatilsynet.no/contentassets/8ad827efefcb489ab1c7ba129609edb5/administrative-fine---grindr-llc.pdf"
    },
    {
      "by": "FastEatSlow",
      "descendants": 0,
      "id": 29563027,
      "score": 2,
      "time": 1639553304,
      "title": "Writing a self-modifying x86 factorial program",
      "type": "story",
      "url": "https://brianstadnicki.github.io/posts/asm-self-modifying-factorial/"
    },
    {
      "by": "barry-cotter",
      "descendants": 0,
      "id": 29563018,
      "score": 1,
      "time": 1639553144,
      "title": "Why it's so much harder to get your first job as a junior engineer",
      "type": "story",
      "url": "https://www.austenallred.com/why-its-so-much-harder-to-get-your-first-job-as-a-junior-engineer/"
    },
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 29563000,
      "score": 2,
      "time": 1639552918,
      "title": "Customizing FreeBSD Ports and Packages",
      "type": "story",
      "url": "https://klarasystems.com/articles/customizing-freebsd-ports-and-packages/"
    },
    {
      "by": "s1291",
      "descendants": 0,
      "id": 29562999,
      "score": 1,
      "time": 1639552910,
      "title": "Vector Graphics Terminal",
      "type": "story",
      "url": "https://ctx.graphics/"
    },
    {
      "by": "vo2maxer",
      "descendants": 0,
      "id": 29562996,
      "score": 1,
      "time": 1639552887,
      "title": "Parker Solar Probe Enters the Magnetically Dominated Solar Corona",
      "type": "story",
      "url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.127.255101"
    },
    {
      "by": "superasn",
      "descendants": 0,
      "id": 29562994,
      "score": 1,
      "time": 1639552878,
      "title": "CSS pseudo-elements vs pseudo-selectors (double colon vs single colon)",
      "type": "story",
      "url": "https://css-tricks.com/to-double-colon-or-not-do-double-colon/"
    },
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 29562979,
      "score": 1,
      "time": 1639552728,
      "title": "Sysinfo: Version 0.22 and FreeBSD Support",
      "type": "story",
      "url": "https://blog.guillaume-gomez.fr/articles/2021-12-14+sysinfo%3A+version+0.22+and+FreeBSD+support"
    }
  ]
}