{
  "stories": [
    {
      "by": "jger15",
      "descendants": 0,
      "id": 31685392,
      "score": 1,
      "time": 1654801395,
      "title": "Escape from Hell World",
      "type": "story",
      "url": "https://hamish.substack.com/p/escape-from-hell-world"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 31685388,
      "score": 1,
      "time": 1654801377,
      "title": "Ray Camden: Digging into Alpine.js",
      "type": "story",
      "url": "https://verpex.com/blog/website-tips/digging-into-alpine-js"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31685386,
      "score": 1,
      "time": 1654801368,
      "title": "A human-in-the-loop workflow for creating HD images from text",
      "type": "story",
      "url": "https://github.com/jina-ai/dalle-flow"
    },
    {
      "by": "sruh",
      "descendants": 0,
      "id": 31685384,
      "score": 1,
      "time": 1654801364,
      "title": "Building a statically linked 32-bit Wine",
      "type": "story",
      "url": "https://github.com/MIvanchev/static-wine32"
    },
    {
      "by": "albingroen",
      "descendants": 0,
      "id": 31685383,
      "score": 1,
      "time": 1654801362,
      "title": "React-cmdk – Build your dream command palette",
      "type": "story",
      "url": "https://react-cmdk.com/"
    },
    {
      "by": "iamjohncobalt",
      "descendants": 0,
      "id": 31685354,
      "score": 1,
      "text": "Its 2022 &amp; we are entering a phase of technology where digital data is more popular than the traditional data. Surprisingly in this arena of learning, the major problem is data!<p>In 2020 when I first came across data science, I was overwhelmed.<p>Now you might be asking, &quot; What is my benefit in learning Data Science? &quot;<p>Well the answer- Salary Rs.698,412 per year<p>What is data science?<p>In simple words, data science is the field where data is cleaned, analyzed and present it in a format that is understood. Businesses use them to structure the data that is unstructured and use them to scale their business.<p>Well for the first part, you can learn about data science by reading multiple blogs and articles. The questions how to find the right blogs to read!<p>Hence at Allin1hub, collected all the blogs for data science at one place for you!<p>With over 100+ best blogs from all over the internet, we have created a community of data science.<p>You can find career guides, roadmaps, interview questions, and many more. This will solve your problem of finding the right data science blogs.<p>After going through the blogs, you need to take action!<p>The question is what? What is first step should I take?<p>Courses are the best and easiest way to take your first step towards learning data science. As you can see, there are millions of courses available on the internet.<p>Question is again the same- How do I find the right data science courses?<p>We have collected over Free 100+ courses on Data Science from Microsoft, IBM, and more. The courses are specifically designed in a way that will give foundation level knowledge to you.<p>And there&#x27;s more...<p>Once you have learnt Data science from the right courses, its time to put what you have learnt to test. Now you might think, why do I need to do that? The straight answer is Practice makes you better.  As cliché as it might sound, it is true!<p>With that in mind we have collected 100+ test that you can take to get better, rough up your knowledge and also develop projects.<p>And there is one more thing ( Credit: Apple )<p>You can learn anything you want from Ai, Data Science, Python, Java and more under 30 seconds. And this the big part, there are interview questions as well!!<p>This is BCTI method- Blogs, Courses, Test, Interview Questions.<p>What are you waiting for?<p>Start your journey now with the best resources from all over the internet at Allin1hub!",
      "time": 1654801236,
      "title": "Here how creator economy is helping you lean Data Science with BCTI",
      "type": "story"
    },
    {
      "by": "jsfcoding",
      "descendants": 0,
      "id": 31685330,
      "score": 1,
      "time": 1654801125,
      "title": "StumpWM",
      "type": "story",
      "url": "https://stumpwm.github.io"
    },
    {
      "by": "arbesman",
      "descendants": 0,
      "id": 31685322,
      "score": 1,
      "time": 1654801102,
      "title": "Alternate Histories and GPT-3",
      "type": "story",
      "url": "https://arbesman.substack.com/p/-alternate-histories-and-gpt-3"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31685306,
      "score": 2,
      "time": 1654801028,
      "title": "$100M to Cut the Time Tax",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2022/04/code-for-america-time-tax/629655/"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 31685277,
      "score": 2,
      "time": 1654800826,
      "title": "Be This Tall to Write Multi-Threaded Code",
      "type": "story",
      "url": "https://bholley.net/blog/2015/must-be-this-tall-to-write-multi-threaded-code.html"
    }
  ]
}