{
  "stories": [
    {
      "by": "sickeythecat",
      "descendants": 0,
      "id": 30107689,
      "score": 1,
      "time": 1643321860,
      "title": "Get Paid: Kaggle Competitors Contribute to Open Source Kubeflow ML Project",
      "type": "story",
      "url": "https://www.arrikto.com/blog/help-wanted-kaggle-competitors-to-contribute-to-the-open-source-kubeflow-machine-learning-project/"
    },
    {
      "by": "harmonicseq",
      "descendants": 0,
      "id": 30107687,
      "score": 2,
      "time": 1643321844,
      "title": "Masterclass on mathematical thinking by Terrence Tao",
      "type": "story",
      "url": "https://terrytao.wordpress.com/2022/01/27/masterclass-on-mathematical-thinking/"
    },
    {
      "by": "blewboarwastake",
      "descendants": 0,
      "id": 30107686,
      "score": 1,
      "time": 1643321841,
      "title": "Toward an Ethics and Etiquette for Electronic Mail (1984) [pdf]",
      "type": "story",
      "url": "https://www.rand.org/content/dam/rand/pubs/reports/2007/R3283.pdf"
    },
    {
      "by": "prionassembly",
      "descendants": 0,
      "id": 30107674,
      "score": 1,
      "time": 1643321778,
      "title": "University mandates sensitivity course that uses redacted slurs",
      "type": "story",
      "url": "https://www.thefire.org/lawsuit-professor-suspended-for-redacted-slurs-in-law-school-exam-sues-university-of-illinois-chicago/"
    },
    {
      "by": "diodorus",
      "descendants": 0,
      "id": 30107669,
      "score": 2,
      "time": 1643321753,
      "title": "Long-lost sphinxes of Egyptian king Amenhotep III unearthed at Luxor",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/01/long-lost-sphinxes-of-egyptian-king-amenhotep-iii-unearthed-at-luxor/"
    },
    {
      "by": "cdahmedeh",
      "descendants": 0,
      "id": 30107653,
      "score": 1,
      "text": "I’ve made this excuse before: I’m busy. However, I actually do have quite a bit of free time not having any serious commitment other than my career and errands. No relationships. No family. No activism. No religion.<p>My time tracking software is ManicTime mainly for keeping tabs on my work hours. It has advanced tagging and report features that I used often. As time accumulates, the software gathers more and more data about my habits and what I do on my computer.<p>This morning, I decide to run a statistics report to see what I do the most and what web pages and documents I spend the most time on. I wasn’t happy with what I saw realizing that it was all my fault.<p>The report was limited to this month of January that is nearly ending. I’ve spent 80% of my time in a web browser but decided to look deeper into the websites I was visiting the most often. I wasn’t shocked so to speak, but it hit me like a rock anyways about how much of my short life was spent doing insipid things.<p>Sixty-percent of my web browsing time was spent on Reddit but not partaking in the discussion oriented forums or the likes. I just visited the main page over and over again to keep scrolling and scrolling getting my dopamine rush in cycles. Picking the subreddits to follow put me in a social bubble only seeing what I know and experiencing the same type of content over and over again.<p>Next on the list was YouTube. I’m not using it to watch informative videos or documentaries, but rather non-beneficial content that only passed the time. I binged and at times watched the same content several times in a week. Wikipedia was far down from the top five.<p>Looking at these reports put me into a downward spiral and gave me a revelation. I was in disbelief even though I knew this all along. I mocked those who spend hours on social websites like Facebook, Twitter, Tik Tok, Instagram and so on. But I just was one of them. I know these things are designed to steal my attention but I’m supposed to be stronger than that.<p>Like many of us, I made promises to myself for the new year. However, 3 weeks later, I haven’t followed up on any of them. I wanted to read more books, volunteer more, focus more on my work, see family and friends and so on. I even wanted to play more video games and watch more movies. I wanted to write more and blog more. Partake in my hobbies and make things.<p>Instead, I’m paralyzed by the bad habits I’ve formed for myself. My boredom is the catalyst for these habits. I keep lying to myself that I’ll do these things later when the moment is right. However, I push my time forward further ahead until it hits my bedtime and knock myself out.<p>I’m not the type who will find ways to block my avenues to limit myself from certain activities. Instead, I try to build habits that are strong and regular and instead provide a ‘natural’ way to stay away from these distractions.<p>Although I think it’s important to have rest and even lazy moments, I aspire to spend my time doing fruitful things or beneficial passive activities. My potential is so much more than what I’m doing now. I’ve mocked people for being stuck to their phones and living their lives online, but I’m one of them too.<p>I know I can do better than this. I have strong organizational skills but I’m not taking advantage of them. I’m awake of what a productive life looks like. It’s not impossible.",
      "time": 1643321713,
      "title": "I’m busy wasting my time",
      "type": "story"
    },
    {
      "by": "siftrics",
      "descendants": 0,
      "id": 30107611,
      "score": 1,
      "time": 1643321549,
      "title": "Learn Solana with Flash Cards and Spaced Repetition",
      "type": "story",
      "url": "https://libre.study/courses/28/"
    },
    {
      "by": "dgellow",
      "descendants": 0,
      "id": 30107607,
      "score": 1,
      "time": 1643321540,
      "title": "A Democratic Scandal Is Unfolding in Denmark",
      "type": "story",
      "url": "https://politiken.dk/udland/art8587872/A-Democratic-Scandal-is-Unfolding-in-Denmark"
    },
    {
      "by": "stoicanalyst",
      "descendants": 0,
      "id": 30107603,
      "score": 1,
      "time": 1643321533,
      "title": "Forensic Watermarking for Pre-Release Content",
      "type": "story",
      "url": "https://pacgenesis.com/forensic-watermarking-for-pre-release-content/"
    },
    {
      "by": "eecc",
      "descendants": 0,
      "id": 30107583,
      "score": 1,
      "time": 1643321462,
      "title": "Parser Combinators: Parsing for Haskell Beginners",
      "type": "story",
      "url": "https://two-wrongs.com/parser-combinators-parsing-for-haskell-beginners"
    }
  ]
}