{
  "stories": [
    {
      "by": "edward",
      "descendants": 0,
      "id": 28141464,
      "score": 1,
      "time": 1628686774,
      "title": "Google may cut pay of staff who work from home",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-58171716"
    },
    {
      "by": "CoffeePython",
      "descendants": 0,
      "id": 28141462,
      "score": 1,
      "text": "Hi HN, I&#x27;m Kenneth and I&#x27;m the founder of Slip (<a href=\"https:&#x2F;&#x2F;www.slip.so\" rel=\"nofollow\">https:&#x2F;&#x2F;www.slip.so</a>), a marketplace for programmers to build and sell courses, including interactive elements like in-browser code execution, popular programming embeds (CodeSandbox, StackBlitz, Replit repls (Coming soon)), and videos.<p>Instead of spending 3 or more months building their own course platform, developers can use Slip to create engaging interactive courses and make more money faster from their knowledge<p>In January, I built vim.so in 3 days, and made $11k in my first month. I even did a Show HN for it (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=25846347\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=25846347</a>). I was able to do it in 3 days because I had previously spent 3 months building an interactive course for Python fundamentals. That previous experience reduced the time it took me to build a new course, which was the only reason it made sense to do. 3 days of hacking was low-risk enough that when I had the idea for vim.so, it made sense to actually try and see.<p>The results blew me away and actually changed my life. If sales continue at the current rate, I&#x27;ll make about $50k this year with vim.so. This experience gave me confidence that I could build something and sell it on the internet. It helped give me credibility as a developer, and got me connected with lots of other cool folks building cool things.<p>After launching vim.so, I started getting lots of inbound requests to build other interactive courses on various topics: Ruby, Git, Bash, etc. At first I thought I&#x27;d just build all these myself but quickly realized other folks could teach these topics at a much deeper level than I could. But why weren&#x27;t they building these courses? It&#x27;s because it&#x27;s currently too hard to make an interactive programming course. After maybe the 5th Twitter DM asking me for an interactive Git course, I decided to start a platform that helps other devs do the same thing I did with vim.so.<p>The main tool in Slip is an online course editor that allows you to build a course with a variety of &quot;block types&quot;. You can use markdown, videos, code snippets, figma embeds, CodeSandbox Embeds, and executable code snippets. Code executions happen in remote one-off Docker containers. Code snippets are built using the open-source Ace Editor react component.<p>The editor is free to use. We take a 10% cut of sales made via our site (plus processing fees). We handle payments via Stripe and accept and remit VAT taxes for the author. Slip also has features to help authors make more money with their courses. For selected courses, we can run a presale campaign. We also publish and feature courses directly on our site that meet a certain quality bar.<p>Some devs who have rolled their own interactive course platform have spent more than 6 months just on that part! If we can remove that 6 months of non-content work, more devs will be able to build better educational materials. I&#x27;ve met multiple folks making over 6 figures a year teaching programming courses. Slip will be a success if we can help many more people do that, a lot more easily.<p>If you have any experience building educational programming courses or ideas on what programming courses are lacking today, or have any thoughts to share, I&#x27;d love to hear from you!",
      "time": 1628686770,
      "title": "Launch HN: Slip (YC S21) – Build and sell interactive programming courses",
      "type": "story"
    },
    {
      "by": "digestives",
      "descendants": 0,
      "id": 28141460,
      "score": 1,
      "time": 1628686745,
      "title": "Bee Home Design Generator",
      "type": "story",
      "url": "https://www.beehome.design/"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 28141430,
      "score": 1,
      "time": 1628686511,
      "title": "We Become What We Behold",
      "type": "story",
      "url": "https://ncase.itch.io/wbwwb"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28141420,
      "score": 1,
      "time": 1628686444,
      "title": "Update on NIST’s Champlain Towers South Investigation",
      "type": "story",
      "url": "https://www.nist.gov/news-events/news/2021/08/aug-11-2021-update-nists-champlain-towers-south-investigation"
    },
    {
      "by": "wilbert_abreu",
      "descendants": 0,
      "id": 28141414,
      "score": 1,
      "time": 1628686397,
      "title": "Loading 3rd-Party JavaScript (Like a Boss)",
      "type": "story",
      "url": "https://wilbertabreu.com/post/perf-tips-3rd-party-scripts"
    },
    {
      "by": "Dutiap",
      "descendants": 1,
      "id": 28141406,
      "kids": [
        28141407
      ],
      "score": 1,
      "time": 1628686362,
      "title": "Dutiap – Do you think I am pretty?",
      "type": "story",
      "url": "https://dutiap.com/ru/"
    },
    {
      "by": "nanis",
      "descendants": 0,
      "id": 28141397,
      "score": 2,
      "time": 1628686300,
      "title": "College lecturer charged with starting blaze near Dixie Fire",
      "type": "story",
      "url": "https://www.sfgate.com/bayarea/article/Dixie-Fire-Gary-Maynard-arson-Lassen-County-16378399.php"
    },
    {
      "by": "PokemonNoGo",
      "descendants": 0,
      "id": 28141368,
      "score": 2,
      "time": 1628686075,
      "title": "The Hunt for Vulcan, the Planet That Wasn’t There",
      "type": "story",
      "url": "https://www.nationalgeographic.com/science/article/151104-newton-einstein-gravity-vulcan-planets-mercury-astronomy-theory-of-relativity-ngbooktalk"
    },
    {
      "by": "danny00",
      "descendants": 0,
      "id": 28141365,
      "score": 1,
      "time": 1628686054,
      "title": "Kind: A Modern Proof Language",
      "type": "story",
      "url": "https://github.com/uwu-tech/kind"
    }
  ]
}