{
  "stories": [
    {
      "by": "LeslieDewhurst",
      "descendants": 0,
      "id": 29132659,
      "score": 1,
      "text": "Not everyone who’s using digital tech is thinking about the environment as they use it. As developers of Digital Health Tech, we’re focusing on at least a basic measure of what we’re using in terms of the environment. Health-AI is a start-up and so we’re navigating week to week, making it difficult to pin down any trends in our environmental consumptions and emissions.<p>ESG,  Environment, Social and Corporate Governance is an investment hot topic. Although there’s been massive inflows into  ESG-targeting funds over the last two decades, their performance has not been measurably superior to other funds out there. As we’re a start-up we’re going to bake-in our Governance as we grow and prosper and build our Social framework as we go (there must already be some good practice out there), but it’s our environmental credentials that we’ll be watching most closely.<p>Tech, in general, has good environmental credentials. The 5 biggest US Tech companies have a combined carbon intensity (net carbon emissions per unit sales) of slightly less than 3% of the S&amp;P 500 average. That’s impressive and has been achieved by doing absolutely nothing; in fact, just being. \nIf you’re a Tech start-up like Health-AI, you’ll want to build on Tech’s credentials.<p>The way we think that best serves the environment, as well as our passion for data and measuring stuff, is to adopt Zero Based Environmental Budgeting (ZBeeB). The idea’s straightforward:<p>• If you’re a start-up, get to minimum viable size where you’re making sales, have a working team and hopefully are generating positive cash flow. If you’re an established business choose a year in which to start\n• Set this as the base line year and work all additional net environmental consumption  from that point\n• Choose what can be measured whenever possible and estimate what cannot. When there’s data there’s a discussion to be had. Where there’s none there should be silence\n• Examine the contributors to net consumption and ask the obvious questions: do we need it? Could we do it a better way? Note that we’re not budgeting here so the Can we get it for cheaper question doesn’t count, though the Can we source a greener version e.g. Electricity, most certainly would\n• Each time a new base line is established, publish the budget results on the Site.<p>If you’re an accountant, you’ll recognise this as Zero Based Budgeting for the environment and you’ll immediately recall those poor souls at Kraft-Heinz who are forced into ZBB every year to little useful effect. So learn from them and reset the base line every few years. Perhaps every five years for a public company and two for a young business.<p>And the business benefits? Openness and possibly new ways of digitally measuring consumption. Businesses that openly publish their internal data are usually better run, managed and trusted. Data driven Tech businesses that are often opaque in the data that they publish would benefit greatly from the trust created here. Ones that can devise new digital ways of measuring environmental consumption as well, will be afforded a magnanimous approbation.<p>What’s not to like?<p>@DewhurstLeslie",
      "time": 1636223681,
      "title": "Why Tech Businesses may wish to adopt an environmental measure such as ZBeeB",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 29132646,
      "score": 1,
      "time": 1636223629,
      "title": "A Deep Dive into Serverless UI with TypeScript",
      "type": "story",
      "url": "https://www.smashingmagazine.com/2021/11/deep-dive-into-serverless-ui-typescript/"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29132640,
      "score": 1,
      "time": 1636223550,
      "title": "Japan's Skyscraper Factories",
      "type": "story",
      "url": "https://constructionphysics.substack.com/p/japans-skyscraper-factories"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29132639,
      "score": 2,
      "time": 1636223549,
      "title": "Notes for UI designers who have lost their way",
      "type": "story",
      "url": "https://twitter.com/octothorpe/status/1456805254436204549"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29132625,
      "score": 2,
      "time": 1636223451,
      "title": "How profitable was/is tobacco?",
      "type": "story",
      "url": "https://genehoots.substack.com/p/how-profitable-wasis-tobacco"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 29132624,
      "score": 1,
      "time": 1636223443,
      "title": "How the outhouse helped save the South (2012)",
      "type": "story",
      "url": "https://www.sabin.org/updates/blog/how-outhouse-helped-save-south-and-what-it-can-do-worlds-bottom-billion"
    },
    {
      "by": "LeslieDewhurst",
      "descendants": 1,
      "id": 29132616,
      "kids": [
        29132617
      ],
      "score": 1,
      "time": 1636223394,
      "title": "Why Tech Businesses may wish to adopt an environmental measure such as ZBeeB",
      "type": "story",
      "url": "https://www.health-ai.co.uk"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29132586,
      "score": 1,
      "time": 1636223232,
      "title": "Godot Engine – Godot 3.4 is released with major features and UX polish",
      "type": "story",
      "url": "https://godotengine.org/article/godot-3-4-is-released"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 29132577,
      "score": 2,
      "time": 1636223145,
      "title": "The Surprising Thing I’ve Learned from Investing in 200 Startups (2016)",
      "type": "story",
      "url": "https://capitalandgrowth.org/paul-buchheit/"
    },
    {
      "by": "anglinb",
      "descendants": 0,
      "id": 29132572,
      "score": 3,
      "time": 1636223103,
      "title": "Spending $5k to learn how database indexes work",
      "type": "story",
      "url": "https://briananglin.me/posts/spending-5k-to-learn-how-database-indexes-work/"
    }
  ]
}