{
  "stories": [
    {
      "by": "2pEXgD0fZ5cF",
      "descendants": 0,
      "id": 30134291,
      "score": 1,
      "time": 1643520000,
      "title": "Greater Fool Theory",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Greater_fool_theory"
    },
    {
      "by": "geojacobm6",
      "descendants": 0,
      "id": 30134270,
      "score": 2,
      "text": "Tips to prepare yourself before setting up your gig and how to achieve long-term clients!<p>Note: This post is especially for beginners who are struggling to earn their first dollar as a freelancer.<p>Things To Be Taken Care Before Entering To Freelancing World<p>Default requirement as always: Be focused and achieve good knowledge about what you are going to deliver to the client. How do I do that?. No worries, we will discuss it below.<p>Be active on community forums. (I have subscribed to django user groups and have been continuously reading emails coming to the group in my initial time) This literally helped me to understand the problems faced by other developers. Now a days Discord is one of the best tool getting popular for these.<p>Focus on a single skill while submitting a proposal for a project (Initially I was focusing only on Python&#x2F;Django projects) as i was experienced in creating web applications using python and django framework.<p>Use Github to showcase your expertise, and how much you are passionate about what you are doing. Create some sample applications and start contributing to open source projects regularly. Contributing to open source will surely increase your knowledge and network.<p>Be active on stackoverflow.com, Earn reputations by asking and answering questions. Literally I was filtering the tags #django and #python on stackoverflow.com and kept on refreshing the browser to answer the next immediate question. It really helped me to increase my knowledge as a developer.<p>Submit your proposal with less price&#x2F;no cost. Initially focus only on good reviews from clients; money will follow you once you start delivering quality work.<p>Be ready to spend a few hours a day continuously and submit your proposal immediately when it gets listed on the platform. As a beginner, I was spending hours on Upwork to get my first project.<p>Always include your Github and stackoverflow.com profile while submitting the project proposal. This actually increased my chances of getting the project.<p>Special Tricks For Beginners:<p>Try to apply for projects listed on new freelancing platforms, as there will be less competitors while applying for a project.<p>Always ask the customer to provide some reviews after successfully delivering the project, but don&#x27;t force them.<p>Make sure to switch on the notification on mobile&#x2F;web and reply to messages whenever client asks something. Delaying reply, may lose your chance.<p>Finally, the important one is, whenever you learn new skills, showcase it always. Github is one of the best place.<p>How To Achieve A Long Term Client:<p>Being irreplaceable is the best strategy to follow while working on a project.<p>Put all your valuable time into understanding the project.<p>Don&#x27;t leave your client because of the complexity of work.<p>Follow these steps, clients will face difficulty in finding you a replacement and as an outcome you&#x27;ll surely earn a long term client.",
      "time": 1643519749,
      "title": "How I got my first freelancing project!",
      "type": "story"
    },
    {
      "by": "peterburkimsher",
      "descendants": 0,
      "id": 30134261,
      "score": 1,
      "time": 1643519659,
      "title": "Correlation: Atomic Numbers, Weights in Periodic Table with Sierpinski Triangle",
      "type": "story",
      "url": "http://www.orientjchem.org/vol33no2/study-of-correlation-between-the-atomic-numbers-and-the-atomic-weights-of-elements-in-the-periodic-table-with-sierpinski-triangle-fractals/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30134242,
      "score": 1,
      "time": 1643519425,
      "title": "Handful of Countries Stall Plans to Reform WHO Finance",
      "type": "story",
      "url": "https://healthpolicy-watch.news/countries-stalled-over/"
    },
    {
      "by": "rasulkireev",
      "descendants": 0,
      "id": 30134240,
      "score": 1,
      "time": 1643519413,
      "title": "Ask HN: What's your Django side project?",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30134217,
      "score": 1,
      "time": 1643519132,
      "title": "Graphics Flight Recorder – unknown but handy tool to debug GPU hangs",
      "type": "story",
      "url": "https://blogs.igalia.com/dpiliaiev/google-flight-recorder/"
    },
    {
      "by": "KETpXDDzR",
      "descendants": 1,
      "id": 30134205,
      "kids": [
        30134206
      ],
      "score": 2,
      "time": 1643519015,
      "title": "Plunge Protection Team",
      "type": "story",
      "url": "https://www.investopedia.com/terms/p/plunge-protection-team.asp"
    },
    {
      "by": "colinarms",
      "descendants": 0,
      "id": 30134171,
      "score": 1,
      "time": 1643518599,
      "title": "Can Medieval Sleeping Habits Fix America’s Insomnia?",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2022/01/medieval-sleeping-habits-insomnia-segmented-biphasic/621372/"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 30134135,
      "score": 2,
      "time": 1643518143,
      "title": "RIP Stack Overflow Jobs",
      "type": "story",
      "url": "https://blog.tdwright.co.uk/2022/01/29/only-the-great-die-at-11-rip-stack-overflow-jobs/"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30134114,
      "score": 2,
      "time": 1643517899,
      "title": "Unicode Strikethrough Text Tool",
      "type": "story",
      "url": "https://adamvarga.com/strike/"
    }
  ]
}