{
  "stories": [
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 28508704,
      "score": 1,
      "text": "I have remained loyal to Firefox since the earliest time (think eff-ing <i>Phoenix</i>) but lately, changes are really going on my nerves (latest: replacing the reload button on Firefox for iOS with the &quot;Home&quot; screen for whatever reason). I am certainly not averse to change but I don&#x27;t like change as a purpose in itself instead of for the better. Unfortunately, a lot of changes nowadays feel like they are solely to keep the UX team employed. Losing Firefox just for that would be a bad bargain. Gecko is the only decent non-chrome&#x2F;ium browser engine that is left and Firefox is the only browser that is using it. We sorely need this remaining bit of diversity! It <i>needs</i> to survive. Despite that, the current leadership of Mozilla is either hell-bent on actively running it into a brick wall or outright ignorant of the fact that this is actually happening for a while already.<p>Do you think they will somehow turn the corner or is Firefox inevitably going to die? I cannot see how they could possibly avoid it if they keep on doing what they currently are doing.<p>(As sad as it is but I wouldn&#x27;t even put it past them to read one day that &quot;sustaining a browser with a low digit marketshare is not a reasonable use of our resources anymore&quot; and that &quot;Mozilla is glad to announce that from now on, we rather focus on the broader mission instead&quot;).",
      "time": 1631517613,
      "title": "Ask HN: Where do you see Firefox going?",
      "type": "story"
    },
    {
      "by": "foothebar",
      "descendants": 1,
      "id": 28508699,
      "kids": [
        28508700
      ],
      "score": 1,
      "time": 1631517558,
      "title": "Covid-19 Graphs Germany",
      "type": "story",
      "url": "https://jalsti.github.io/cov19de/pages/Deutschland.html"
    },
    {
      "by": "Kohzam",
      "descendants": 0,
      "id": 28508697,
      "score": 1,
      "text": "moh covid - 19 vaccination",
      "time": 1631517530,
      "title": "Libtransmission/Watchdir-Win32.cc",
      "type": "story"
    },
    {
      "by": "adibalcan",
      "descendants": 0,
      "id": 28508696,
      "score": 1,
      "time": 1631517529,
      "title": "App for Customer Review Monitoring",
      "type": "story",
      "url": "https://review-monitoring.com"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 28508689,
      "score": 1,
      "time": 1631517455,
      "title": "One-Sentence Email Tips",
      "type": "story",
      "url": "https://joshspector.com/one-sentence-email-tips/"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 28508687,
      "score": 1,
      "time": 1631517435,
      "title": "I made my own protocol",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=46pBeyHKQuQ"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28508683,
      "score": 1,
      "time": 1631517404,
      "title": "The spy writer who held a grudge against Le Carré comes in from the cold",
      "type": "story",
      "url": "https://www.theguardian.com/books/2021/sep/12/spy-writer-held-grudge-against-le-carre-comes-in-from-cold-willem-frederik-hermans"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28508682,
      "score": 1,
      "time": 1631517395,
      "title": "The Dark Morality of Fairy-Tale Animal Brides (2017)",
      "type": "story",
      "url": "https://www.theatlantic.com/entertainment/archive/2017/03/marrying-a-monster-the-romantic-anxieties-of-fairy-tales/521319/"
    },
    {
      "by": "oscar_franco13",
      "descendants": 0,
      "id": 28508663,
      "score": 1,
      "text": "Hi Hacker News! I&#x27;m Oscar!<p>I do a lot of react native and web development, therefore I mostly code in JavaScript, however some of the new technologies coming up such as web assembly and the react-native JSI require knowledge of low level languages.<p>In order to leverage this new tech I had to learn C++ and it was not an easy path, a lot of the documentation and knowledge out there is way too hard or in depth for my purposes, I just want to use C++ as fast as I can to achieve my own goals.<p>Therefore I want to make the path easier for other developers, in just a couple of hours I&#x27;m trying to cover the most interesting parts of C++, the 20% that will allow you to achieve 80% of what is possible.  Course is completely free, hosted on youtube, if you like it I would ask you to subscribe or to follow me on twitter! feedback is of course welcome!<p>https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YOsCv4_vMgo&amp;list=PLanS_SVm5swgrFrqo-NTITZxud4KRmZgB",
      "time": 1631517247,
      "title": "Show HN: The C++ Guide for JavaScript Developers",
      "type": "story"
    },
    {
      "by": "dragonsh",
      "descendants": 0,
      "id": 28508650,
      "score": 1,
      "time": 1631517099,
      "title": "Singapore’s new law for internet platforms and network providers",
      "type": "story",
      "url": "https://www.straitstimes.com/singapore/politics/proposed-law-seeks-to-counter-foreign-interference-in-spore-politics-measures"
    }
  ]
}