{
  "stories": [
    {
      "by": "A4ET8a8uTh0",
      "descendants": 0,
      "id": 30214656,
      "score": 1,
      "time": 1644015470,
      "title": "Joint Statement of the Russia and China on the International Relations",
      "type": "story",
      "url": "http://en.kremlin.ru/supplement/5770"
    },
    {
      "by": "karlzt",
      "descendants": 0,
      "id": 30214654,
      "score": 1,
      "time": 1644015469,
      "title": "Google Releases “Disable 2g” Feature for New Android Smartphones",
      "type": "story",
      "url": "https://www.eff.org/deeplinks/2022/01/victory-google-releases-disable-2g-feature-new-android-smartphones"
    },
    {
      "by": "hnthrow_asdf",
      "descendants": 0,
      "id": 30214652,
      "score": 1,
      "text": "Hi HN, hope this topic is ok. I&#x27;m looking for commentary or advice from readers familiar with ad systems.<p>A few years ago I got involved with the wrong wealthy, connected crowd and many weird&#x2F;violent things happened. The story is strange, so people assume mental illness. I&#x27;m seeing a counselor, taking pills that don&#x27;t seem to help except make me fat and sleepy, and doing my best to get back to dev work before my funds run out.<p>I wanted to talk about my internet experience, though. I used to get ads for food, clothes, consumer tech. Now I get strange ads which are really not helping my situation.<p>On Twitter, ad with only a few views about &quot;losing a game, checkmate the cost is your soul&quot;.<p>On IG, which I use to look at cat pictures and my friends, I get ads for Freemasonic end-of-life care, occult ritual materials, bizarre poetry sometimes containing my name&#x2F;usernames, artwork with the tagline &quot;Maybe you aren&#x27;t paranoid and people are following you ;)&quot;, going blind, car accidents, ALS, cancer, organ failure. Or, my personal favorite when I&#x27;ve managed to distract myself from my troubles for a few hours, paraphrased &quot;DID SOMETHING EXTREMELY BAD HAPPEN TO YOU AND YOU CAN&#x27;T STOP THINKING ABOUT IT?&quot;. I usually see that one multiple times a day.<p>I&#x27;ve shown these ads to other people; I don&#x27;t have any history of seeing physical things others don&#x27;t. I try to scroll past them fast but usually still see what they say. I usually don&#x27;t take screenshots because I don&#x27;t want the pause to register as engagement.<p>I get that most people would just ignore this stuff. I would have in the past. I don&#x27;t know how to explain the change in perspective after you&#x27;ve been in life-threatening situations, had your windows smashed, or had weird totems left in your yard, etc etc. It&#x27;s not a stretch to think &quot;maybe this IS relevant to me, or a message warning me: bad thing going to happen!&quot;. Regardless, I want to avoid interacting with content like this.<p>I have long been opted out of search history or ad personalization on G&#x2F;FB&#x2F;AMZN&#x2F;Twitter&#x2F;Instagram&#x2F;Verizon, and have repeatedly clicked &quot;hide ad - irrelevant or not interested&quot;. &quot;Why am I seeing this ad?&quot; says &quot;(wide age group) in your area&quot;, yet I&#x27;ve asked and my peers don&#x27;t get ads like this.<p>I think I&#x27;m privacy savvy somewhat. Logged out, incognito&#x2F;Ublock&#x2F;Ghostery. Few apps, all permissions denied. DDG. Unique usernames, lurking or throwaways. No prescription rewards. I only visit a few websites. I don&#x27;t share my computer. No other devices listening in the house.<p>The only information leaks I can think of are: \n* credit card billed for telehealth\n* short text journal on dropbox\n* friends may have discussed me&#x2F;topic in their chats\n* a friend asked on Messenger why I disappeared, I said something like &quot;I might have schizophrenia. Some violent situations happened and I&#x27;m struggling now.&quot;<p>I know, Messenger wasn&#x27;t E2E, but I didn&#x27;t realize it might flag me so easily. I haven&#x27;t done anything else to indicate my interest in this topic; it&#x27;s not like I&#x27;m posting in &quot;targeted person&quot; forums, buying anything other than groceries, or watching horror movies.<p>Even if the explanation is just &quot;machine learning black box parses chat, determines unlabeled cluster demonstrates increased engagement with thrilling, morbid, suggestive, edgy content&quot;, well, I explicitly rejected opting-in to that. The supposed &quot;opt-outs&quot; have little effect, at best hiding one specific ad but not actually updating to the point of &quot;I don&#x27;t want to see ads about PTSD, dismemberment, horror, paranoia, accidents, tragedy, eschatology, or the occult, please start showing me only normie ads again&quot;.<p>I&#x27;m not sure what to think at this point, short of going offline or quitting social media. I did that in the past but I am trying to keep my weak network alive. Anyway, I&#x27;m curious to hear if anyone has feedback or advice on this situation. Am I missing something, mistaken, doing something wrong? Thanks!",
      "time": 1644015460,
      "title": "Ask HN: Is mental illness an ad-targeting category?",
      "type": "story"
    },
    {
      "by": "MrWiffles",
      "descendants": 0,
      "id": 30214644,
      "score": 1,
      "text": "Lately my internet connection has been going offline for a few minutes at a time several times a day (like, 3-5, minimum). Most of the time the ISP doesn&#x27;t acknowledge anything is going on, and by the time I get on a phone call with them and wait on hold for some mindless drone to answer the phone, the connection will be re-established.<p>If this was only once in a blue moon it wouldn&#x27;t bother me much, but this has been a daily occurrence now for at least the last 3 weeks and it&#x27;s driving me nuts.<p>So before I contact the FCC - because that seems to be the only way to cut through the hordes of mindless, clueless idiots who try to block your ability to talk to anyone who knows what the hell they&#x27;re doing - I&#x27;d like to have some proof. Some log data that shows the connection dropped offline at time X and came back at Y.<p>Now, I <i>could</i> try to build something like this myself, but before I do that I&#x27;d like to ask here: is there already a well-known, widely recognized&#x2F;respected tool out there that does this? Bonus points if it&#x27;s something my ISP (Spectrum) is likely to be familiar with. Imagine how they&#x27;ll react if I tell them I wrote my own code that proves the service has been unreliable: &quot;well, it must be your fault&quot;. But if it&#x27;s something they&#x27;ve heard of, they&#x27;ll be more likely to take the data seriously.<p>Thanks for your suggestions.<p>(Oh, and if this is a &quot;just google it&quot; sorta thing, what do you call this kind of tool? &quot;Network Monitoring&quot; is way, WAY too generalized a term to be useful, and I&#x27;m not sure what else this might fall under.)",
      "time": 1644015411,
      "title": "Ask HN: Recommended tools/approaches for continuously monitoring my flaky ISP?",
      "type": "story"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30214557,
      "score": 1,
      "time": 1644015056,
      "title": "Why Menlo Ventures Invested in Julia Computing",
      "type": "story",
      "url": "https://medium.com/@timtullydevnull/why-menlo-ventures-invested-in-julia-computing-e0e3633d85a5"
    },
    {
      "by": "mzs",
      "descendants": 0,
      "id": 30214555,
      "score": 2,
      "time": 1644015052,
      "title": "NASA and SpaceX investigating parachute issue on Dragon spacecraft",
      "type": "story",
      "url": "https://www.floridatoday.com/story/tech/science/space/2022/02/04/nasa-and-spacex-investigating-dragon-parachute-issue-crew-4-target/6664110001/"
    },
    {
      "by": "nonrandomstring",
      "descendants": 0,
      "id": 30214548,
      "score": 1,
      "time": 1644015020,
      "title": "Designing devices for long-term care and reuse",
      "type": "story",
      "url": "https://cheapskatesguide.org/articles/uncharitable.html"
    },
    {
      "by": "ayvacs",
      "descendants": 0,
      "id": 30214540,
      "score": 5,
      "time": 1644014990,
      "title": "For some searches the whole screen on Google is now ads",
      "type": "story",
      "url": "https://twitter.com/i/status/1489480845979095040"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30214534,
      "score": 1,
      "time": 1644014910,
      "title": "The open-source language for data privacy",
      "type": "story",
      "url": "https://ethyca.com/fides/"
    },
    {
      "by": "mzs",
      "descendants": 0,
      "id": 30214510,
      "score": 2,
      "time": 1644014808,
      "title": "Images combining X-ray data from Chandra with those from other telescopes",
      "type": "story",
      "url": "https://www.nasa.gov/mission_pages/chandra/news/an-expanse-of-light.html"
    }
  ]
}