{
  "stories": [
    {
      "by": "TripleH",
      "descendants": 0,
      "id": 28457512,
      "score": 1,
      "time": 1631111187,
      "title": "Retro of vaccination booking service special night after French president speech",
      "type": "story",
      "url": "https://medium.com/doctolib/monday-july-12-at-doctolib-a-retrospective-9ac15c46ac19"
    },
    {
      "by": "mrtb",
      "descendants": 1,
      "id": 28457499,
      "kids": [
        28457580
      ],
      "score": 1,
      "text": "I&#x27;m preparing a ≈20min talk about opportunities in software to give at a London school with students aged 14-18. I want to give insights into the software industry which are relevant to the decisions students will be making: which subjects to study or focus on at school, whether to go to uni, but more generally how to invest time well by learning valuable skills and discovering what their strengths are and what they might like to do in the future. As part of my preparation, I&#x27;d like to collect some real examples of journeys people make from their teens into professional software roles, but also how programming skills may have served you well as a hobby or in roles that aren&#x27;t primarily about developing software. What&#x27;s your story?<p>Some questions I&#x27;m interested in are:\nHow did you first get into programming? Were any books, blogs, forums, or people particularly helpful for your growth? What is it about coding that got you hooked?<p>What is your experience with university? Did you get a degree, was it worth it, do you think it helped you find work, what did you love&#x2F;hate about uni?<p>How did you get your first paid work (family &amp; friends, internship, freelance, full-time)?<p>What do you do now and what do you love&#x2F;hate about your job?<p>------\nI work back end in Golang at a fintech, but I got into programming when I was homeschooled with ROBLOX and making iOS games with cocos2d before doing an MEng in Computing at Imperial College London. I really like making things, intellectual work, and collaborating with other people. I like the pay, that I can find remote work or move country if I want, that I&#x27;m always learning, and I have enough time and energy to pursue various hobbies. Sometimes work is tedious and I don&#x27;t like sitting at a desk for 8 hours, but overall I love my job and want to help others find their way into similar roles if it&#x27;s right for them.",
      "time": 1631111152,
      "title": "How did you become a software engineer?",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28457490,
      "score": 1,
      "time": 1631111128,
      "title": "Howard University cancels classes after ransomware attack",
      "type": "story",
      "url": "https://www.cnbc.com/2021/09/08/howard-university-cancels-classes-after-ransomware-attack.html"
    },
    {
      "by": "fractalb",
      "descendants": 0,
      "id": 28457485,
      "score": 1,
      "time": 1631111091,
      "title": "Deeply Rooted Tradition: One Man’s Long Fight to End Illegal Dowries in India",
      "type": "story",
      "url": "https://www.theguardian.com/global-development/2021/sep/08/deeply-rooted-tradition-one-mans-long-fight-to-end-dowries-in-india"
    },
    {
      "by": "Jugurtha",
      "descendants": 0,
      "id": 28457477,
      "score": 1,
      "time": 1631111057,
      "title": "One-liner for DoD clearance rejections' most common reasons between 1996-2016",
      "type": "story",
      "url": "https://twitter.com/Andrew___Morris/status/834466461234126848"
    },
    {
      "by": "Gravityloss",
      "descendants": 0,
      "id": 28457474,
      "score": 1,
      "time": 1631111053,
      "title": "Two-Wheeled, Self-Balancing Gyro-X vehicle from 1967 in action",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=TTCVn4EByfI"
    },
    {
      "by": "7Pyziuh",
      "descendants": 0,
      "id": 28457471,
      "score": 1,
      "time": 1631111045,
      "title": "Never trust a clown to secure your connection strings",
      "type": "story",
      "url": "https://twitter.com/troyhunt/status/1435015619045257222"
    },
    {
      "by": "andybak",
      "descendants": 0,
      "id": 28457450,
      "score": 1,
      "text": "I don&#x27;t normally browse &#x2F;newest but happened to pass by just now and was surprised by the quantity of innocuous posts that seem to be flagged or dead. What&#x27;s the difference? Is this normal? Am I misunderstanding how HN is meant to work?",
      "time": 1631110983,
      "title": "Ask HN: Is there usually this many [dead] posts on /newest?",
      "type": "story"
    },
    {
      "by": "redm",
      "descendants": 0,
      "id": 28457447,
      "score": 1,
      "time": 1631110977,
      "title": "Coinbase Says SEC Plans Enforcement Action over Crypto Lending Program",
      "type": "story",
      "url": "https://www.wsj.com/articles/coinbase-says-sec-plans-enforcement-action-over-crypto-lending-program-11631110478"
    },
    {
      "by": "fireball_blaze",
      "descendants": 0,
      "id": 28457435,
      "score": 2,
      "time": 1631110941,
      "title": "Largest pinball museum in the world closing for good; 1000 games to be auctioned",
      "type": "story",
      "url": "https://www.nbclosangeles.com/news/local/arcade-games-auction-museum-of-pinball/2687397/"
    }
  ]
}