{
  "stories": [
    {
      "by": "bogidon",
      "descendants": 0,
      "id": 30430599,
      "score": 1,
      "time": 1645550288,
      "title": "T-Mobile Forum: I was promised a third line for free and didn't receive it",
      "type": "story",
      "url": "https://community.t-mobile.com/accounts-services-4/i-was-promised-a-third-line-for-free-and-didn-t-receive-it-38728"
    },
    {
      "by": "abarrak",
      "descendants": 1,
      "id": 30430594,
      "kids": [
        30430596
      ],
      "score": 1,
      "time": 1645550273,
      "title": "Linux Sysops Handbook",
      "type": "story",
      "url": "https://abarrak.gitbook.io/linux-sysops-handbook"
    },
    {
      "by": "ra7",
      "descendants": 0,
      "id": 30430569,
      "score": 2,
      "time": 1645550152,
      "title": "Utilizing key point and pose estimation for the task of autonomous driving",
      "type": "story",
      "url": "https://blog.waymo.com/2022/02/utilizing-key-point-and-pose-estimation.html"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 30430566,
      "score": 1,
      "time": 1645550148,
      "title": "Who Hacked the DAO on Ethereum? Here’s How We Jumped Past One Critical Step",
      "type": "story",
      "url": "https://medium.com/@laurashin/who-hacked-the-dao-on-ethereum-heres-how-we-jumped-past-one-critical-step-60aec489a127"
    },
    {
      "by": "lsiunsuex",
      "descendants": 0,
      "id": 30430553,
      "score": 3,
      "text": "UI Lead here - managing a few projects at any given time, mentoring junior developers, working with the backend team on endpoints, etc... most of you know the drill.<p>Pulled master branch, no build errors, Angular isn&#x27;t complaining but I know the problem is in the UI side, probably with graphQL (angular apollo). I cannot get a single VSCode extension to work to help debug it so a junior is going through and commenting out code they changed to try to find it.<p>There is no way this project is done on time and the entire software department is looking at it. I&#x27;m 1 of 3 leads on it.<p>Quite literally just gave myself a panic attack thinking about it and the looming deadline.<p>This isn&#x27;t the first time; I&#x27;ve been dealing with this for months now. It went away for a bit (2-3 months) and now it&#x27;s back. I&#x27;ve been drinking all kinds of clamming teas, supplements, trying to change my diet, walk more, etc...<p>I just can&#x27;t stop them :( 99% of the time it&#x27;s chest pain or back pain or etc... every once in a while it escalates into a panic attack.<p>I keep trying to tell myself f&#x27; it - it doesn&#x27;t matter. Fire me if you want to; we&#x27;re doing the best we can. But it&#x27;s not sinking in...<p>I.do.not.know.what.to.do.anymore. Vacation? FMLA? Career change? wtf would I do if not web development (been doing it 20+ years)<p>help.",
      "time": 1645550089,
      "title": "Ask HN: I just gave myself a panic attack. How do I stop this?",
      "type": "story"
    },
    {
      "by": "werner",
      "descendants": 0,
      "id": 30430541,
      "score": 1,
      "time": 1645550009,
      "title": "Curious about Quantum",
      "type": "story",
      "url": "https://www.allthingsdistributed.com/2022/02/curious-about-quantum-computing.html"
    },
    {
      "by": "taylodl",
      "descendants": 0,
      "id": 30430537,
      "score": 1,
      "text": "My company&#x27;s management desires for us to be &quot;cloud agnostic&quot; - without having a firm definition of what that actually means. Lots of people in my company think &quot;cloud agnostic&quot; means you &quot;containerize&quot; your solutions and run them on Kubernetes. Then you can pick and move your application from cloud to cloud as desired. That seems extremely limited to me. To me that thinking exemplifies the cloud as being &quot;someone else&#x27;s computer&quot; rather than seeing the cloud as an application platform in and of itself.<p>What does HN think about this? Is there a way of looking at &quot;cloud agnostic&quot; that still allows you to look at the cloud as an application platform and not just as a platform for running Kubernetes? Is there another way to think about this?",
      "time": 1645549982,
      "title": "Ask HN: Is Kubernetes the only alternative for being cloud agnostic?",
      "type": "story"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 30430534,
      "score": 1,
      "time": 1645549972,
      "title": "Uswnt, U.S. Soccer Federation settle equal pay lawsuit for $24M",
      "type": "story",
      "url": "https://www.espn.com/soccer/united-states-usaw/story/4599482/uswntus-soccer-federation-settle-equal-pay-lawsuit-for-$24-million"
    },
    {
      "by": "jonas_kgomo",
      "descendants": 0,
      "id": 30430501,
      "score": 1,
      "text": "I am curious about how people submit papers for conferences, or journals in general, without a particular advisor or institution helping them.\nWhat process do such people follow. Any examples of self-directed research?",
      "time": 1645549786,
      "title": "Ask HN: How can you write a paper without an advisor?",
      "type": "story"
    },
    {
      "by": "NmAmDa",
      "descendants": 0,
      "id": 30430472,
      "score": 1,
      "time": 1645549645,
      "title": "Everware, a Notebook environment to allow people to reproduce your research",
      "type": "story",
      "url": "https://github.com/everware/everware"
    }
  ]
}