{
  "stories": [
    {
      "by": "anonymoushn",
      "descendants": 0,
      "id": 31968278,
      "score": 1,
      "time": 1656861011,
      "title": "Data Alignment and Caches",
      "type": "story",
      "url": "http://danluu.com/3c-conflict/"
    },
    {
      "by": "akhmatova",
      "descendants": 0,
      "id": 31968268,
      "score": 1,
      "time": 1656860926,
      "title": "Scientists Begin to Understand Covid ‘Brain Fog’",
      "type": "story",
      "url": "https://www.wired.com/story/the-secrets-of-covid-brain-fog-are-starting-to-lift/"
    },
    {
      "by": "spac_throwawayy",
      "descendants": 0,
      "id": 31968258,
      "score": 1,
      "text": "I’m a former employee of a company which recently went public through a SPAC. I had no lockup but communication from the company and setup were extremely poor so I was not able to sell my stock immediately. Accounts weren’t set up in advance. Tax info wasn’t in accounts. It was impossible to sell in the first week for everyone. Most people didn’t get access to shares for weeks. The price went down significantly in that time. Should I sue for some sort of damages? Maybe negligence or fiduciary duty? (Could have even been intentionally but I have no proof.)<p>Should we sue as a class or individuals? One law firm is interested in the case if class damages are over $10M (they are). My damages are ~$1M which seems to be on the bubble for suing as an individual. Either way, I’m not sure the potential downsides. From past examples I assume the company will make the case very hard for us and try to bleed us dry. Seems like it could also have negative career implications.",
      "time": 1656860871,
      "title": "Ask HN: Sue after poorly managed SPAC?",
      "type": "story"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 31968245,
      "score": 1,
      "time": 1656860792,
      "title": "How the climate crisis is forever changing our national parks",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/02/us/national-parks-climate-extreme-weather-impacts/index.html"
    },
    {
      "by": "codingclaws",
      "descendants": 0,
      "id": 31968242,
      "score": 1,
      "time": 1656860779,
      "title": "Ask HN: How meticulously do you keep track of your money?",
      "type": "story"
    },
    {
      "by": "hefferbub",
      "descendants": 0,
      "id": 31968223,
      "score": 1,
      "text": "I know that righteous indignation is the new national pastime, but I would find it a lot more interesting to hear a more nuanced discussion from this community on the topic of self-driving.<p>Some questions that come to mind:<p>- Would it contribute positively to our world if competent self driving existed?<p>- What are the various approaches to get from here to there, and what are their relative merits and risks?<p>- Assuming some approach showed promise, how should we expose it to real world conditions to allow for validation and ongoing improvement?<p>- Do the technically-savvy folks on this list think that a heuristic approach (i.e. a bunch of rules written by humans) could ever succeed at effective self driving in diverse conditions?  Or is the machine learning + massive data approach more likely to solve it?  Or do you consider it fundamentally unsolveable?<p>- What interesting moral and legal questions arise if effective self-driving becomes available?<p>- What might be the economic and environmental ramifications of a world with ubiquitous “robotaxis”?<p>Anyone care to pick one and take a swing at it?",
      "time": 1656860620,
      "title": "Can we have a less flamey discussion of self driving cars?",
      "type": "story"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31968221,
      "score": 1,
      "time": 1656860612,
      "title": "El Salvador’s Bitcoin Paradise Is a Mirage",
      "type": "story",
      "url": "https://www.nytimes.com/2022/07/02/opinion/bitcoin-el-salvador-bukele-crypto.html"
    },
    {
      "by": "hkc",
      "descendants": 0,
      "id": 31968210,
      "score": 1,
      "time": 1656860509,
      "title": "Apple purchase sharing is not working in India",
      "type": "story",
      "url": "https://old.reddit.com/r/apple/comments/uuruxs/apple_purchase_sharing_not_working_in_india/"
    },
    {
      "by": "kinoro",
      "descendants": 0,
      "id": 31968204,
      "score": 1,
      "time": 1656860420,
      "title": "Show HN: API 2 KPI – a simple KPI dashboard solution for Startups/Side projects",
      "type": "story",
      "url": "https://www.api2kpi.co"
    },
    {
      "by": "leobg",
      "descendants": 7,
      "id": 31968169,
      "kids": [
        31968271,
        31968238,
        31968196,
        31968247,
        31968225,
        31968199
      ],
      "score": 1,
      "text": "If you could never read a new book in your life, and only had one book to re-read once a year, which would you pick, and why?<p>(Feel free to substitute “the next 10 years“ for “the rest of your life“.)",
      "time": 1656860171,
      "title": "Ask HN: Which book would you pick to re-read for the rest of your life?",
      "type": "story"
    }
  ]
}