{
  "stories": [
    {
      "by": "lometogo",
      "descendants": 0,
      "id": 28993977,
      "score": 1,
      "text": "Love HN, but as a tech copyeditor&#x2F;writer, I find it&#x27;s dev ops-heavy, not content dev, marketing related.<p>What&#x27;s the best place for a highly experienced tech editor&#x2F;writer to get in front of the startup crowd?",
      "time": 1635200928,
      "title": "Content-related opps with startup community",
      "type": "story"
    },
    {
      "by": "onmyway133",
      "descendants": 0,
      "id": 28993974,
      "score": 1,
      "time": 1635200900,
      "title": "Show HN: Hide the Notch on Mac",
      "type": "story",
      "url": "https://twitter.com/GetAlmighty/status/1452763794078375945"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 28993904,
      "score": 2,
      "time": 1635200514,
      "title": "Work, Leisure, and Family: From the Silent Generation to Millennials",
      "type": "story",
      "url": "https://research.stlouisfed.org/publications/review/2021/10/18/work-leisure-and-family-from-the-silent-generation-to-millennials"
    },
    {
      "by": "epaga",
      "descendants": 0,
      "id": 28993901,
      "score": 1,
      "time": 1635200502,
      "title": "14-Inch MacBook Pro",
      "type": "story",
      "url": "https://daringfireball.net/2021/10/the_2021_14-inch_macbook_pro"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28993899,
      "score": 3,
      "time": 1635200498,
      "title": "System Sniffs Out Hardware Trojans in Electromagnetic Emissions",
      "type": "story",
      "url": "https://spectrum.ieee.org/hardware-trojan"
    },
    {
      "by": "rchaudhary",
      "descendants": 0,
      "id": 28993862,
      "score": 1,
      "time": 1635200257,
      "title": "First Levers (How to start building Leverage)",
      "type": "story",
      "url": "https://www.ejorgenson.com/blog/50-first-levers"
    },
    {
      "by": "666b20753a29",
      "descendants": 2,
      "id": 28993832,
      "kids": [
        28994009,
        28993941
      ],
      "score": 3,
      "text": "I&#x27;m a 20 y&#x2F;o bootcamp grad with no college degree and 6 months of professional experience. I&#x27;ve been out of employment since May this year, and since mid-September I&#x27;ve been applying for software engineering positions across the US. Also I&#x27;m from Europe and I&#x27;m currently living in SF on a tourist visa, meaning I would need sponsorship for an H-1b work visa.<p>Let&#x27;s assume for a moment that I&#x27;m job searching correctly; I&#x27;m applying to places that I would actually want to work at with a relevant resume and a well-written cover letter, I&#x27;m networking on Linkedin and setting up phone calls with engineers and recruiters, I&#x27;m leveraging my existing network and reaching out to almost everyone I know, etc.<p>So far I&#x27;ve had zero responses, despite me having referrals to a bunch of companies. After getting speedily rejected from FB, even with a relatively strong recommendation, I managed to get feedback from the engineer that it&#x27;s basically because companies aren&#x27;t willing to sponsor for entry-level positions, especially if the candidate doesn&#x27;t have a degree. Is this true? Is there a limiting factor of my situation here? Why am I being ignored?<p>My resolve is starting to break because I have zero visibility on _what_ exactly is going wrong. If it&#x27;s something about my situation that doubles the bar, then that&#x27;s fine– I&#x27;ll go work in Europe for a few years, and I&#x27;ll be back in the US soon. No hard feelings. But because I know that I&#x27;m more than competent enough to hold down the positions I&#x27;m applying for, I wonder if it&#x27;s something about my situation or something that I&#x27;m doing wrong.<p>What are the conditions that companies offer sponsorship on? Is there a hard limit on the # of times a company can sponsor? Am I not being taken seriously because I&#x27;m too young? Or because my only experience was a 6 months? Is my job gap a problem?<p>Fuck all these questions though, my single biggest fear is that I&#x27;m wasting my time. I don&#x27;t care about comp or prestige, I just want to work and build things. But I&#x27;ve had to instead spend the last few months writing fucking cover letters, using all the businessy buzzwords. It&#x27;s so cringe and debilitating to me.<p>Am I doomed? Or am I being too fragile? Should I keep calm and carry on? I can do that, but I have a vauge sense of angst that I could be wasting my time without knowing it.<p>What do?",
      "time": 1635200093,
      "title": "Is my job search situation doomed? I'm losing hope and getting desperate",
      "type": "story"
    },
    {
      "by": "rrauenza",
      "descendants": 0,
      "id": 28993814,
      "score": 3,
      "time": 1635199988,
      "title": "Extreme couponers were sent to prison in $31.8M fraud scheme",
      "type": "story",
      "url": "https://www.cnn.com/2021/10/25/business/extreme-couponer-sentencing/index.html"
    },
    {
      "by": "telotortium",
      "descendants": 6,
      "id": 28993752,
      "kids": [
        28993915
      ],
      "score": 19,
      "time": 1635199719,
      "title": "Jury Hands Victory to Facebook and Oculus VR Founder in Rift Ownership Trial",
      "type": "story",
      "url": "https://lawstreetmedia.com/news/tech/jury-hands-victory-to-facebook-and-oculus-vr-founder-in-rift-ownership-trial/"
    },
    {
      "by": "arduinomancer",
      "descendants": 0,
      "id": 28993731,
      "score": 1,
      "time": 1635199602,
      "title": "Taxicab Geometry",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Taxicab_geometry"
    }
  ]
}