{
  "stories": [
    {
      "by": "div3rs3",
      "descendants": 0,
      "id": 30369018,
      "score": 1,
      "time": 1645066403,
      "title": "LicenseKit: Protect Swift apps and libraries with commercial license",
      "type": "story",
      "url": "https://github.com/danielsaidi/LicenseKit"
    },
    {
      "by": "TimLeland",
      "descendants": 0,
      "id": 30369010,
      "score": 1,
      "time": 1645066337,
      "title": "Show HN: GooReddit",
      "type": "story",
      "url": "https://gooreddit.com/"
    },
    {
      "by": "DamianEscobedo",
      "descendants": 1,
      "id": 30368997,
      "kids": [
        30369025
      ],
      "score": 1,
      "text": "I recently spent a lot of time updating my resume that made me think to try to build a tool to make updating resumes less time-consuming, with the design of the resume already taken care of.<p>Also, I&#x27;ve read that it is useful to tailor resumes to job applications, so I was thinking of adding a feature where you can create &quot;branches&quot; from resumes to tailor specifically for a position&#x2F;area I just don&#x27;t know if that would be something useful or if there is already something to do it.<p>I know people usually make a resume in LaTeX and commit it to a git repository, but seems like a massive time investment to learn LaTeX just to make a resume there.",
      "time": 1645066204,
      "title": "Ask HN: How do you guys keep your resumes updated?",
      "type": "story"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 30368991,
      "score": 2,
      "time": 1645066153,
      "title": "SEC is probing Wall Street trades in large blocks of shares",
      "type": "story",
      "url": "https://www.reuters.com/business/us-sec-is-probing-wall-street-trades-large-blocks-shares-2022-02-15/"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 30368983,
      "score": 1,
      "time": 1645066121,
      "title": "Google plans privacy change similar to Apple’s",
      "type": "story",
      "url": "https://www.cnbc.com/2022/02/16/google-plans-android-privacy-change-similar-to-apples.html"
    },
    {
      "by": "yantalnka",
      "descendants": 0,
      "id": 30368980,
      "score": 1,
      "text": "Hi, I’m Jane, founder of Memory Cards.I made an application to learn a new vocabulary. \nDon’t need to learn some suggested words, we will never use, only your own list. Make a custom list on google spreadsheet, fetch it on iphone, practice, share with friends.<p>I run into this problem in my English school. After each lesson I had many new phrases I needed to learn by heart until the next class. I could’t use other applications because they suggest learning their vocabulary, not mine.<p>That’s why I created my own mobile application, where I can make a custom vocabulary list, take different tests to remember it. I repeat it again and again by speaking, reading, writing, and listening. Honestly I am not very good at learning so I need to repeat it very many times to remember.<p>What’s more - I’m traveling around a word, stay on each place 1-2 months, so I need to know some basic words on local language, I don’t want to learn new language every month, but I need to know some words like: ‘hi’, ‘thank you’, ‘what’s the price’, ‘can you make discount’ - you know prices for tourists are always higher. Only I  know what phrases I use more often than others. So I have these words translated on my phone, just to be able any time to have a tip on how to say it. Different lists for different languages and I can check it any time, no internet connection needed.<p>One phone is one account. Here you could ask if I am able to  restore my list after removing the application? - No, I couldn’t, but…<p>But I can synchronize my vocabulary list with google spreadsheets. From the technical side it would be easier for me to make a backend and save everything there, however I want people to use services that they know well. Most of us know how google spreadsheets work, how to create, edit, share documents and so on. That’s why I added synchronization with google drive. Yes, it wasn’t easy to get verification to use it. They have strict rules, and a long approval process. I went through it not once and not even twice, literally showing each step how I use data and why I need it. This process requires very many patients from both sides. In the end I did it and can use it now.<p>How to use it? Open google spreadsheets, write down all new words, move to application - tap on ‘download’. Ready, can start to practice. The best thing here is I can download any shared spreadsheet and I can share my list with everyone. For me it means if I skip a lesson, I don’t need to ask for a copybook or something, I just fetch my friend&#x27;s vocabulary on my phone and practice.<p>Application is free, no ads, doesn’t need internet connection, no sign-up. I need sign-in only if I want to sync files to your google drive. It’s optional, no restrictions. Do it  only if you want to.<p>First of all I made this application to use it myself, later I released it to Appstore to share it with other people, now I can see that most people who download the application use it again and again.It looks they found it useful, it inspires me to develop application, add new features, share to more people.\nAppstore url: \nhttp:&#x2F;&#x2F;itunes.apple.com&#x2F;app&#x2F;id1485265975\nYoutube url:\nhttps:&#x2F;&#x2F;youtu.be&#x2F;ljrJD0QpSMM<p>Thank you everyone who read the whole text. Any suggestions, improvements, just chat?",
      "time": 1645066095,
      "title": "Show HN: Memory Card (YC W22) – iOS application to learn new vocabulary",
      "type": "story"
    },
    {
      "by": "addaon",
      "descendants": 0,
      "id": 30368978,
      "score": 1,
      "time": 1645066073,
      "title": "Nvidia Grace CPU and Hopper GPU Make Exascale Supercomputer Debut",
      "type": "story",
      "url": "https://www.tomshardware.com/news/atos-exascale-supercomputer-platform-bullsequana-xh3000"
    },
    {
      "by": "xixixao",
      "descendants": 0,
      "id": 30368973,
      "score": 1,
      "time": 1645066045,
      "title": "From Languages to Language Sets",
      "type": "story",
      "url": "https://gist.github.com/xixixao/8e363dbd3663b6729cd5b6d74dbbf9d4"
    },
    {
      "by": "etothepii",
      "descendants": 0,
      "id": 30368956,
      "score": 1,
      "time": 1645065899,
      "title": "Patrick Stewart on Picard",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9JsMtqTioOE"
    },
    {
      "by": "Bostonian",
      "descendants": 1,
      "id": 30368925,
      "kids": [
        30368994
      ],
      "score": 1,
      "time": 1645065596,
      "title": "Antidote to the Great Resignation and a plunging birthrate is a robot revolution",
      "type": "story",
      "url": "https://www.city-journal.org/why-the-robot-revolution-doesnt-mean-the-end-of-work"
    }
  ]
}