{
  "stories": [
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 31266072,
      "score": 1,
      "time": 1651699674,
      "title": "India's Heatwaves Are Testing the Limits of Human Survival",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-05-03/india-s-heatwaves-are-testing-the-limits-of-human-survival"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 31266062,
      "score": 1,
      "time": 1651699588,
      "title": "Forrester: 96% of Businesses Have Had Cloud Security Probs",
      "type": "story",
      "url": "https://thenewstack.io/forrester-96-of-businesses-have-had-cloud-security-probs/"
    },
    {
      "by": "josephcsible",
      "descendants": 0,
      "id": 31266050,
      "score": 1,
      "time": 1651699513,
      "title": "Dumping Encrypted-at-Rest Firmware of Xiaomi Smart Kettle",
      "type": "story",
      "url": "https://hackaday.com/2022/05/04/dumping-encrypted-at-rest-firmware-of-xiaomi-smart-kettle/"
    },
    {
      "by": "msgboard",
      "descendants": 0,
      "id": 31266032,
      "score": 1,
      "text": "Hello,\nI have deployed few hardware devices (All based on Raspi4) in field running Go code. When there is an error in operation, I want the device to be able to ring an audible tone on my mobile phone (a ring or a beep). Is there a cooked solution to be able to do this with least effort (or no code).<p>Another option is to play a sound on some rasp4 at my office. This raspi may expose an api endpoint which the troubled device in field can call.<p>Any suggestion&#x2F;feedback&#x2F;criticism is welcome.",
      "time": 1651699360,
      "title": "Ask HN: Ping/Ring back my Phone in case of error",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 31266005,
      "kids": [
        31266018
      ],
      "score": 1,
      "time": 1651699183,
      "title": "Text Neck, Pinkie Pain and Other Ways Phones Can Wreck Our Bodies",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/28/well/live/neck-joint-pain-phone.html"
    },
    {
      "by": "alexevans",
      "descendants": 0,
      "id": 31266004,
      "score": 1,
      "text": "Database Developer<p>At Presage Biosciences, you&#x27;ll have a chance to make a real impact in cancer research. As our database developer, you&#x27;ll work directly with scientists and lab technicians on our mission to revolutionize drug development and patient care. This is a very independent position where you will decide how best to meet the organization’s growing and shifting data needs, all while making a name for yourself in Seattle&#x27;s rapidly expanding biotech community.<p>Our Company\nPresage Biosciences, Inc. is an innovative oncology company with an entirely novel platform for assessing new drugs and combinations to treat solid tumors. Our proprietary technology platform, CIVO®, simultaneously analyzes multiple cancer drug candidates and drug combinations within a single living tumor.<p>Presage is a growing, privately held company led by an experienced management team and is headquartered in the vibrant South Lake Union area of Seattle, WA.<p>Key Responsibilities\n• Design, develop, deploy, maintain, support, and extend database applications\n• Create scripts for data integration, data maintenance, or bug fixes \n• Develop proactive working relationships with employees in determining business and functional requirements\n• Identify solutions to resolve the data needs of employees \n• Design user interfaces\n• Prototype new applications to refine requirements \n• Provide technical consulting and respond to error reports, problems, or questions \n• Provide data integration solutions for imaging processes \n• Review, analyze, and document data and workflow processes\n• Assist with administrative maintenance of relational database including backup&#x2F;recovery, schedule jobs, problem diagnosis, and performance fine tuning  \n• Design and implement data models\n• Assist with database capacity issues, replication, and other distributed data issues \n• Manage schedule for expected resolution of changes\n• Build consensus on priorities for creating potential solutions and resolving problems\n• Develop enterprise strategy for data management\n• Define and implement software development life cycle\n• Automate diagnostics of deployed systems\n• Research third-party solutions as an alternative to development\n• Support data analysis efforts by other employees\n• General information technology duties as necessary\n• Other duties as requested<p>Qualifications\n• A Bachelor’s Degree in Computer Science or Informatics, or equivalent experience \n• Three years of experience developing relational database applications \n• Two years of experience developing front and back ends of web-based applications \n• Experience providing software support and advocating for users \n• Experience deploying software and data fixes \n• Demonstrated ability to implement a software development life cycle \n• Excellent written and verbal communication skills \n• Ability to learn and model complex domain knowledge \n• Ability to self-manage and prioritize assigned tasks \n• Experience negotiating requirements and priorities with users and stakeholders \n• Experience with some or all of the following technologies: C#, ASP.NET, MVC, SQL Server, Transact SQL, HTML5&#x2F;CSS, Active Directory, jQuery, JavaScript, IIS, Entity Framework, Windows Server, Git, JIRA, Visual Studio, SSDT, NuGet \n• Experience with most of the following concepts: object-oriented programming, MVC, extract&#x2F;transform&#x2F;load processes, application logging, exception handling, audit tracking, attribution, issue tracking, version control, release management<p>Work Environment\nIn-office<p>Join Us!\nIf you enjoy a stimulating office environment, are based in the Seattle area, and most importantly, have a passion for improving the lives of patients with cancer, come join us!<p>To apply for this position, please send your CV with cover letter to:<p>E-mail: hr@presagebio.com<p>Presage Biosciences, Inc. is an Equal Opportunity Employer.",
      "time": 1651699174,
      "title": "Database Developer",
      "type": "story"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 31266002,
      "score": 2,
      "time": 1651699164,
      "title": "Zap: The delightful package manager for AppImages",
      "type": "story",
      "url": "https://github.com/srevinsaju/zap"
    },
    {
      "by": "bradwoodsio",
      "descendants": 0,
      "id": 31265993,
      "score": 1,
      "time": 1651699100,
      "title": "Show HN: How to use a displacement map in SVG",
      "type": "story",
      "url": "https://garden.bradwoods.io/notes/svg-fe-displacement-map"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 31265975,
      "score": 1,
      "time": 1651699018,
      "title": "Bat: A cat(1) clone with syntax highlighting and Git integration",
      "type": "story",
      "url": "https://github.com/sharkdp/bat"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31265973,
      "score": 1,
      "time": 1651699012,
      "title": "CSSplus: A Family of CSS Reprocessor Plugins",
      "type": "story",
      "url": "https://csspl.us/"
    }
  ]
}