{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29263415,
      "score": 1,
      "time": 1637224963,
      "title": "Native Implementation of Mutable Value Semantics",
      "type": "story",
      "url": "https://arxiv.org/abs/2106.12678"
    },
    {
      "by": "jocho12",
      "descendants": 0,
      "id": 29263407,
      "kids": [
        29263430
      ],
      "score": 1,
      "time": 1637224883,
      "title": "LG Releases the First and Only Rollable TV",
      "type": "story",
      "url": "https://www.lg.com/us/tvs/lg-oled65r1pua-signature-oled-4k-tv"
    },
    {
      "by": "schizopathch",
      "descendants": 0,
      "id": 29263387,
      "score": 3,
      "time": 1637224667,
      "title": "How I Made 3k Followers on Medium in (A Little over) a Week",
      "type": "story",
      "url": "https://th340d.medium.com/how-i-made-3-000-followers-on-medium-in-a-week-8d26a6090f9b"
    },
    {
      "by": "hdjjhhvvhga",
      "descendants": 1,
      "id": 29263373,
      "kids": [
        29263388
      ],
      "score": 1,
      "time": 1637224515,
      "title": "JK Rowling will NOT be featured in Harry Potter 20th anniversary",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10211245/JK-Rowling-NOT-featured-Harry-Potter-20th-anniversary-special-controversial-tweets.html"
    },
    {
      "by": "geocrasher",
      "descendants": 0,
      "id": 29263369,
      "score": 1,
      "time": 1637224464,
      "title": "Top Most Common Password List 2021",
      "type": "story",
      "url": "https://nordpass.com/most-common-passwords-list/"
    },
    {
      "by": "nudpiedo",
      "descendants": 0,
      "id": 29263367,
      "score": 1,
      "text": "I am not aware of any web online blockchains could prevent being the next host of pedophilic contents, piracy or way to permanently difamate people publicly.<p>Is anyone aware on how such moral issues can be prevented in the direction the whole web3&#x2F;blockchain trend is going? Is there any out of the box solution or voting in the network the only current solution?<p>I know it is a hard topic, this question is mostly regarding how to use technology to prevent part of the warranties it brings us, in a jugdement that often is totally subjective, and even sometimes doesn&#x27;t have social consensus.<p>The other open question I see is: how to prevent mobs of people trying to censore´contents they do not want to exist in a decentraized network? this problem is specially important when differences between human morals and values arise, such as in politics and religious believes.",
      "time": 1637224453,
      "title": "Is there any effort to prevent using web3/blockchain to host ilegal content?",
      "type": "story"
    },
    {
      "by": "jiscariot",
      "descendants": 1,
      "id": 29263365,
      "kids": [
        29263424
      ],
      "score": 1,
      "text": "Anyone have an experience with a cloud provider deleting your instances, volumes, resources, etc?<p>I work for a small org that utilizes a cloud provider (not top 3, but top 10).  Yesterday we noticed that all our instances, attached volumes, sec groups, network resources, from our Test and PROD environments had disappeared.  After scrambling we found an audit trail, that showed all the deletes were from an SRE working for the provider.  Apparently they were doing &quot;cleanup&quot; and somehow our account number became part of that.<p>We were told we needed to recreate everything from scratch shortly after opening a ticket.  Luckily we host our Terraform and config management on-prem, and a few snapshots and volumes they weren&#x27;t successful in deleting.  Still a lot of manual rebuilding as not everything is automated.<p>Two of us have been working to recover things for many hours.  Lower environments will likely take a lot longer.<p>Just curious if anyone else has had something like this occur.  I have a hard time gauging if this because our provider is lacking, of if this stuff occurs in top three as well.  Any recourse with the provider?  We are small potatoes (probably 100-120 hosted resources) so don&#x27;t have a lot of institutional weight to use.<p>The nonchalance coming from the vendor (at least initially) was pretty infuriating.  After that it was putting bodies on a zoom call, which were not much help for the most part.",
      "time": 1637224441,
      "title": "Ask HN: Cloud provider accidentally deletes instances",
      "type": "story"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 29263359,
      "score": 1,
      "time": 1637224335,
      "title": "Recruit, World’s Top Job Finder, Wants to Get Rid of Resumes",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-11-17/the-world-s-top-recruitment-website-wants-to-get-rid-of-resumes"
    },
    {
      "by": "_Microft",
      "descendants": 2,
      "id": 29263338,
      "kids": [
        29263398,
        29263350
      ],
      "score": 6,
      "time": 1637223979,
      "title": "Biomarker predicts severity of Covid-19 infection early on",
      "type": "story",
      "url": "https://www.mpg.de/17722615/1021-pfor-biomarker-predicts-severity-of-covid-19-infection-early-on-149770-x"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29263334,
      "score": 2,
      "time": 1637223933,
      "title": "How bad is the Pacific north-west flooding and what caused it?",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/nov/17/pacific-north-west-flooding-british-columbia-washington-state-canada"
    }
  ]
}