{
  "stories": [
    {
      "by": "JProthero",
      "descendants": 0,
      "id": 28292143,
      "score": 1,
      "time": 1629826195,
      "title": "Eavesdropping on the Taliban",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/08/what-i-learned-while-eavesdropping-on-the-taliban/619807/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28292103,
      "score": 1,
      "time": 1629826041,
      "title": "Italy’s famous dome is cracking, and cosmic rays could help save it (2018)",
      "type": "story",
      "url": "https://arstechnica.com/science/2018/08/cosmic-rays-could-help-unlock-the-secrets-of-brunelleschis-dome/"
    },
    {
      "by": "koolba",
      "descendants": 0,
      "id": 28292104,
      "score": 1,
      "time": 1629826041,
      "title": "New CDC studies point to waning immunity from vaccines",
      "type": "story",
      "url": "https://www.politico.com/news/2021/08/24/cdc-studies-vaccine-immunity-506782"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28292100,
      "score": 1,
      "time": 1629826032,
      "title": "Is there any way I can alter my driving behaviour to help reduce traffic? (2016)",
      "type": "story",
      "url": "https://www.reddit.com/r/AskEngineers/comments/4e80uu/traffic_engineers_is_there_any_way_i_can_alter_my/d1y78fb"
    },
    {
      "by": "jetblowfish",
      "descendants": 0,
      "id": 28292078,
      "score": 3,
      "text": "Hey Hacker News, We’re Vlad, Molly, and Asa from Level (<a href=\"https:&#x2F;&#x2F;trylevel.app&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;trylevel.app&#x2F;</a>). We allow lending companies to trade their loan receivables into upfront working capital that gets them off the ground and grows with them as they scale.<p>Building a lending company is challenging because it requires a lot of capital to get started. You need lending history to access capital, but you can’t access capital until you have a history of lending. To get around this, founders traditionally raise a large dilutive equity round and then lend off their balance sheet, or they find a family office or credit fund willing to offer a loan, which usually comes with high interest rates, warrants, and covenants. Even once your company succeeds in reaching the scale necessary to secure a traditional loan, the process takes at least 3 to 6 months and costs &gt;$100k in legal fees to set up.<p>We didn’t think to work on this problem until it came to us. During a process of pivoting from a different business, a lot of fintechs were asking for help with raising debt from our CEO Vlad, who was a venture debt banker at Silicon Valley Bank (SVB). Vlad provided connections to traditional debt providers, but these startups were turned down because traditional debt providers don’t work with pre-seed or seed stage startups—the deals are just too small. Since a  lot of these startups were showing solid progress, and were being turned down for reasons having nothing to do with how good their business was, we decided that this was a good problem to tackle.<p>Also, companies like Pipe and Capchase turn MRR receivables into upfront capital for companies with recurring revenue. It seemed to us that the same principle could be applied to the loan receivables of lending companies, where the problem is even more painful.<p>Our solution is to purchase loans that lending startups have originated at a discounted rate, then forward the customer’s loan payments to Level as they come in. If you are familiar with financial arrangements, it’s similar to a forward flow agreement (<a href=\"https:&#x2F;&#x2F;www.finleycms.com&#x2F;what-is-forward-flow\" rel=\"nofollow\">https:&#x2F;&#x2F;www.finleycms.com&#x2F;what-is-forward-flow</a>). It’s different, though, in that we calculate the discount of purchasing loans by integrating directly into a company&#x27;s ongoing bank balance and loan performance. This enables companies to get a lower cost of capital as they become a stronger lender and more stable business.<p>We integrate with a startup’s banks via integrations similar to Plaid, making it possible to track the company’s cash position and burn rate. In addition, we integrate with their loan management system to watch loan performance over time. In the event of default or prepayment, the company can buy back the non-performing loan or substitute in a new one. We allow a startup to sell more loans as its loan book grows and becomes more predictable, providing a flexible alternative to costly warehouse facilities. We make money by buying loan receivables at a discount from the total value of the receivables we collect.<p>If lending startups get better access to capital at the earliest stages, more companies will enter the market and drive competition based on the merits of the financial services they provide. This is good for existing borrowers and opens up new finance options for the underbanked and unbanked.<p>We’re building Level so that innovative founders can responsibly scale up a lending business without traditional constraints. We’d love to hear the community’s ideas, experiences, and feedback so we can do our best on this problem. Thanks!",
      "time": 1629825965,
      "title": "Launch HN: Level (YC S21) – Flexible financing for early-stage lending startups",
      "type": "story"
    },
    {
      "by": "retskrad",
      "descendants": 0,
      "id": 28292076,
      "score": 1,
      "time": 1629825963,
      "title": "Tim Cook reshaped Apple in his first decade as CEO",
      "type": "story",
      "url": "https://appleinsider.com/articles/21/08/24/how-tim-cook-reshaped-apple-in-his-first-decade-as-ceo"
    },
    {
      "by": "Akcium",
      "descendants": 0,
      "id": 28292058,
      "score": 1,
      "time": 1629825913,
      "title": "UX Designer vs. Product Designer",
      "type": "story",
      "url": "https://uxdesign.cc/the-clear-cut-difference-between-ux-design-and-product-design-explained-74350b34cdda"
    },
    {
      "by": "colinmcd",
      "descendants": 0,
      "id": 28291980,
      "score": 1,
      "time": 1629825613,
      "title": "SweetGreen acquires robotic kitchen startup Spyce",
      "type": "story",
      "url": "https://www.fastcompany.com/90668523/sweetgreen-acquires-spyce-a-boston-based-robotic-kitchen-startup"
    },
    {
      "by": "sss111",
      "descendants": 1,
      "id": 28291956,
      "kids": [
        28291968
      ],
      "score": 2,
      "text": "At my school, I&#x27;ve the opportunity to pick the Intelligence thread, I&#x27;m really passionate about it. But after coming across threads here about the great stagnation and Deep Learning jobs collapsing, I have to ask is investing money &amp; time to study this field worth it anymore?",
      "time": 1629825522,
      "title": "Ask HN: As an undergrad, should I study ML or is the field too saturated?",
      "type": "story"
    },
    {
      "by": "Nickybert",
      "descendants": 0,
      "id": 28291954,
      "score": 1,
      "time": 1629825519,
      "title": "Africa's Newest Unicorn",
      "type": "story",
      "url": "https://feeds.startuplagos.net/softbank-makes-the-first-bet-on-africa-raising-opay-to-unicorn-status/"
    }
  ]
}