{
  "stories": [
    {
      "by": "rwesterdahl",
      "descendants": 0,
      "id": 28061725,
      "score": 4,
      "text": "Hi HN, we&#x27;re Ryan, Tyler, and Patryk, the founders of Turion Space (<a href=\"https:&#x2F;&#x2F;www.turionspace.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.turionspace.com&#x2F;</a>). We&#x27;re building spacecraft to remove orbital debris and provide services to existing satellites.<p>Orbital debris poses a significant risk to mankind&#x27;s future in space. There are currently over 250k objects in space that would destroy a satellite if a collision were to occur. Large uncontrolled objects like depleted rocket upper stages and dead satellites pose the greatest risk because of the potential to break upon impact with small debris into thousands of smaller pieces. There is currently no system in operation that can deorbit large amounts of space debris. If this problem is not addressed in the next 5-10 years, it could render entire orbits unusable for generations.<p>Our spacecraft (which we’ve decided to call the “Droid”, shoutout to Star Wars!) aims to remove debris by docking with it using robotic arms and dragging the debris to a lower orbit using the ion propulsion system we are developing under a NASA technology transfer license. Once the debris is in a low enough orbit, upper atmospheric drag will cause the debris to naturally decay in altitude until it burns up during atmospheric reentry. Critically, the Droid would undock with the debris after dragging it to a low orbit, then orbit-raise, and go on to perform other missions. In other words, our solution is a reusable approach, designed from the beginning to complete multiple missions during its lifetime.<p>Our team encountered this problem when brainstorming ideas to answer the question, &quot;with the rapidly declining cost of getting things into space, what can we do now that has never before been possible?&quot; Asteroid mining seemed like the obvious answer, but the capital required to start a business on that premise seemed like a longshot to say the least. We found the most important problem we could solve while building the foundation to asteroid resource extraction was to create a satellite system capable of removing orbital space debris.<p>Our team has extensive experience working on operational space flight hardware and building software products from the ground up. Ryan comes from an 8.5-year run at SpaceX, working primarily on propulsion development and dynamics analysis of the Merlin, Superdraco, and Raptor engines. Tyler comes most recently to ATA engineering, working as a consultant for various aspects of thermal, structural, and dynamics analysis across a wide range of now-operational space-flight projects. He also worked at Electroimpact, where he designed and built aerospace-assembly-automation systems using robotic arms. Patryk comes most recently from Marshall Reddick real estate where he developed the company’s in house CRM that was vital to the company&#x27;s growth over the last 5 years.<p>We expect to begin servicing sometime in 2024.  We have gained interest in several use cases through conversations with customers to complement our orbital debris removal efforts, beginning with low-earth-orbit operations. For low-earth-orbit satellite operators, we can raise their altitude or modify the inclination of their orbit.  We have also partnered with launch providers to expand their mission capabilities by offering our last mile tug service for their payloads. For example, suppose a small launcher can only lift a 200 kg satellite into a 500km orbit altitude, but that payload wishes to end up at a 1200km altitude. In that case, we can dock with the payload once it has been deployed from the launch vehicle and bring it to its final orbit.<p>Check out the services section of our website at <a href=\"https:&#x2F;&#x2F;turionspace.com&#x2F;satellite-tracker\" rel=\"nofollow\">https:&#x2F;&#x2F;turionspace.com&#x2F;satellite-tracker</a> and track satellites or get pricing estimates for different mission scenarios! We&#x27;d love to hear feedback and chat about orbital debris removal!",
      "time": 1628088960,
      "title": "Launch HN: Turion Space (YC S21) – Space debris removal and satellite servicing",
      "type": "story"
    },
    {
      "by": "egfx",
      "descendants": 0,
      "id": 28061707,
      "score": 1,
      "time": 1628088878,
      "title": "A Doomsday Covid Variant Worse Than Delta and Lambda May Be Coming",
      "type": "story",
      "url": "https://www.newsweek.com/2021/08/13/doomsday-covid-variant-worse-delta-lambda-may-coming-scientists-say-1615874.html"
    },
    {
      "by": "emptybits",
      "descendants": 0,
      "id": 28061699,
      "score": 1,
      "time": 1628088828,
      "title": "Huawei exec returns to court in Canada for final weeks of extradition proceeding",
      "type": "story",
      "url": "https://www.cbc.ca/news/canada/british-columbia/meng-wanzhou-extradition-final-weeks-1.6128105"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 28061697,
      "score": 1,
      "time": 1628088816,
      "title": "Assessing the impact of drones in the global Covid response",
      "type": "story",
      "url": "https://www.brookings.edu/techstream/assessing-the-impact-of-drones-in-the-global-covid-response/"
    },
    {
      "by": "app4soft",
      "descendants": 0,
      "id": 28061693,
      "score": 1,
      "time": 1628088806,
      "title": "The Government of Quebec Announced Producing of Ukrainian Antonov An-74TK-200",
      "type": "story",
      "url": "https://capitalhillgroup.ca/antonov-and-the-quebec-government/"
    },
    {
      "by": "AHappyCamper",
      "descendants": 0,
      "id": 28061680,
      "score": 1,
      "text": "I remember back in Jan 2018 when Bitcoin took off - everyone believed that it would replace fiat.<p>Now it’s several years later and you still can’t buy groceries with it at most major supermarkets and you can’t pay rent with it 99.999% of the time.<p>If fact, there are very few things that you can do with BTC besides trade it for other cryptos.<p>So when does this grand financial revolution happen? Or can we conclude that if it hasn’t happened yet, then it likely won’t happen at all?",
      "time": 1628088734,
      "title": "Why Aren’t We Trading with Bitcoin Yet?",
      "type": "story"
    },
    {
      "by": "0_____0",
      "descendants": 0,
      "id": 28061640,
      "score": 1,
      "time": 1628088573,
      "title": "Drake's Plate of Brass",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Drake%27s_Plate_of_Brass"
    },
    {
      "by": "billyharris",
      "descendants": 0,
      "id": 28061636,
      "score": 2,
      "time": 1628088559,
      "title": "Linux kernel and its toolchains are underinvested by at least 100 engineers",
      "type": "story",
      "url": "https://www.theregister.com/2021/08/04/google_linux_kernel_security/"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 28061630,
      "score": 1,
      "time": 1628088533,
      "title": "Dark patterns explained by online media expert",
      "type": "story",
      "url": "https://techxplore.com/news/2021-08-dark-patterns-online-media-expert.html"
    },
    {
      "by": "ramimestiri",
      "descendants": 0,
      "id": 28061560,
      "score": 1,
      "time": 1628088157,
      "title": "KPLG method or How to make money on day 1",
      "type": "story",
      "url": "https://www.indiehackers.com/post/the-kplg-method-or-how-to-make-money-online-fast-45618f489c"
    }
  ]
}