{
  "stories": [
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 30809200,
      "score": 1,
      "time": 1648268355,
      "title": "'The Prisoner' – now free with ads on YouTube",
      "type": "story",
      "url": "https://www.youtube.com/show/SCBV7jxZB68fiVhFTE-zMz8w?sbp=GhoSGFVDQlY3anhaQjY4ZmlWaEZURS16TXo4dw%253D%253D"
    },
    {
      "by": "thisisseb",
      "descendants": 0,
      "id": 30809190,
      "score": 1,
      "time": 1648268154,
      "title": "Play the chords to all major and minor keys in the browser",
      "type": "story",
      "url": "https://muted.io/chords-in-keys/"
    },
    {
      "by": "mgarciaisaia",
      "descendants": 0,
      "id": 30809188,
      "score": 1,
      "time": 1648268123,
      "title": "Taylor Hawkins, Foo Fighter's drummer, dies at 50",
      "type": "story",
      "url": "https://twitter.com/foofighters/status/1507552958988255234"
    },
    {
      "by": "tusslewake",
      "descendants": 0,
      "id": 30809159,
      "score": 1,
      "time": 1648267648,
      "title": "A Nineteenth-Century Pandemic May Be a Window into Coronaviruses",
      "type": "story",
      "url": "https://thewalrus.ca/invisible-siege/"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 30809149,
      "score": 1,
      "time": 1648267527,
      "title": "In Internet’s Winner Takes All Model, We End Up as Losers",
      "type": "story",
      "url": "https://www.news18.com/news/opinion/zomato-to-swiggy-in-internets-winner-takes-all-model-we-end-up-as-losers-4905839.html"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 30809137,
      "score": 1,
      "time": 1648267376,
      "title": "Emerging Architectures for Modern Data Infrastructure",
      "type": "story",
      "url": "https://future.a16z.com/emerging-architectures-modern-data-infrastructure/"
    },
    {
      "by": "hsnewman",
      "descendants": 0,
      "id": 30809132,
      "score": 1,
      "time": 1648267241,
      "title": "Is E8 Lattice the True Nature of Reality? Or Theory of Everything?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=aR88KR4sg-w"
    },
    {
      "by": "explorefriendly",
      "descendants": 0,
      "id": 30809129,
      "score": 1,
      "text": "I&#x27;ve found myself in this weird position in which I&#x27;m spending more than the median US income on just eating and was wondering if there&#x27;s any way out.<p>As far as I can tell it&#x27;s the most economically rational thing for me to do, as my income is well into the six-figures and so as I don&#x27;t particularly enjoy grocery shopping, cooking or cleaning it&#x27;s a better use of my time to work and pay as much as I currently am ($2700 &#x2F;month) to meet my daily nutritional needs. And yet, the situation seems insane to me from a common sense perspective and I&#x27;m trying to figure out if I&#x27;m missing something really obvious or doing something terribly stupid.<p>The market for food delivery, both at the facilitator and provider level, is so fragmented I don&#x27;t really see there being much room for prices to be lower. Restaurants struggle, workers aren&#x27;t paid very well, and the apps don&#x27;t even make money. So maybe it&#x27;s just as simple as that, the cost of living a cooking and cleaning free life in a high cost of living area is more than the median national income. But I have to wonder, as surely I&#x27;m not the only one in this conundrum [1], is there another way?<p>Cafeterias? Partner up with someone that likes cooking? Some sort of community meal thing? I&#x27;m open to any ideas or experiences people have navigating early adult life in this domain.<p>[1] I understand that this isn&#x27;t a <i>real</i> problem, in the sense that many people struggle to cover the basic costs of food and other necessities, and that this could very well come off as elitist and out-of-touch privilege. But I&#x27;d love to live in a world where those that don&#x27;t like to cook and clean dishes don&#x27;t have to be rich, and the only way [2] to make that a reality is to raise people&#x27;s income or make it more affordable—the focus of this question being on the latter.<p>[2] The only capitalistic way. There may be creative solutions involving the reorganization of people outside of the economic system to solve this, but the only one I&#x27;ve heard about that happens at scale is to partner up with someone willing to take on that role.",
      "time": 1648267203,
      "title": "Ask HN: How does one affordably eat without cooking or cleaning?",
      "type": "story"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 30809075,
      "score": 1,
      "time": 1648266152,
      "title": "List of Unsolved Problems in Biology",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_biology"
    },
    {
      "by": "snvzz",
      "descendants": 0,
      "id": 30809073,
      "score": 2,
      "time": 1648266147,
      "title": "High Noon for Daylight Savings Time",
      "type": "story",
      "url": "https://hackaday.com/2022/03/25/high-noon-for-daylight-savings-time/"
    }
  ]
}