{
  "stories": [
    null,
    {
      "by": "adellantado",
      "descendants": 0,
      "id": 29392561,
      "score": 1,
      "time": 1638283185,
      "title": "Turn Your Google Form into a Telegram Chatbot",
      "type": "story",
      "url": "https://old.reddit.com/r/TelegramBots/comments/r5of2j/turn_your_google_form_into_a_telegram_chatbot/"
    },
    {
      "by": "marianabeldi",
      "descendants": 0,
      "id": 29392555,
      "score": 1,
      "time": 1638283149,
      "title": "The Vite Ecosystem",
      "type": "story",
      "url": "https://patak.dev/vite/ecosystem.html"
    },
    {
      "by": "eatonphil",
      "descendants": 1,
      "id": 29392517,
      "kids": [
        29392549
      ],
      "score": 2,
      "text": "I&#x27;m trying to get more familiar with the options that exist for open source auth providers that provide similar service to Auth0 or Google Accounts. I&#x27;m aware of Keycloak, Kanidm, SuperTokens, Ory, FusionAuth.<p>Are there any other open source auth providers I should look into?",
      "time": 1638282920,
      "title": "Ask HN: What are the major open source alternatives to Auth0?",
      "type": "story"
    },
    {
      "by": "dorafmon",
      "descendants": 0,
      "id": 29392505,
      "score": 1,
      "time": 1638282873,
      "title": "Why would you choose Golang for your company?",
      "type": "story",
      "url": "https://csgrinding.xyz/why-golang/"
    },
    {
      "by": "jpmonteiro",
      "descendants": 0,
      "id": 29392502,
      "score": 1,
      "time": 1638282856,
      "title": "Codd's Dream: A tribute to the father of relational databases",
      "type": "story",
      "url": "https://jpmonteiro.substack.com/p/codds-dream"
    },
    {
      "by": "stremovsky",
      "descendants": 0,
      "id": 29392488,
      "score": 1,
      "time": 1638282737,
      "title": "Show HN: Practical GDPR Compliance Guide for Startup Founders",
      "type": "story",
      "url": "https://privacybunker.io/blog/gdpr-guide-for-startup-founders/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 1,
      "id": 29392485,
      "kids": [
        29392546
      ],
      "score": 2,
      "time": 1638282718,
      "title": "Auto executives expect EVs will own half of U.S., China markets by 2030",
      "type": "story",
      "url": "https://www.reuters.com/markets/deals/auto-executives-expect-evs-will-own-half-us-china-markets-by-2030-survey-2021-11-30/"
    },
    {
      "by": "cschiller",
      "descendants": 1,
      "id": 29392454,
      "kids": [
        29392551
      ],
      "score": 7,
      "text": "Hi HN, I’m Christian and here together with my co-founder Christian (no typo!), we are the founders of Kitchenful (<a href=\"https:&#x2F;&#x2F;www.kitchenful.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kitchenful.com</a>). Kitchenful is an app for personalized recommendations of recipes that also gets you the ingredients delivered from a local grocery store.<p>My girlfriend and I asked ourselves the question “What should we have for dinner?” nearly every day. It was annoying for both of us, and on top of that, after a long discussion about what to cook, I was the one who would go out and get the groceries. We never managed to meal plan a couple of days in advance, so the situation repeated itself every 1-2 days, and the result was often to either eat the same meals over and over again, or do impulsive shopping that would include unhealthy snacks or expensive takeout orders.<p>Our first breakthrough was to sketch meal plans on the weekend and order via REWE (largest German grocer) for home delivery. This changed our whole mood and feeling throughout the week. We had recipes ready to go and the question was answered immediately each day what we could do. We found ourselves eating better and feeling better in the process. However, meal planning and placing the related order still took me hours. With a technical background, I was interested in automating the process as much as possible so we could stick with it.<p>I worked at HelloFresh (a popular meal kit service) for over 4 years, but as a customer I found the offering wasn’t flexible enough to support our specific dietary needs and it didn’t relieve us of shopping for breakfast, snacks, beverages etc. at the grocery store. Since I’ve spent my professional life so far in the startup space, it came naturally to start a company to tackle this problem.<p>Our users receive a curated menu of recipes according to their dietary preferences and requirements each week. These recommendations are made based on information from the user (diet, ingredient preferences, nutrition goals, location, grocery options, etc.). Users can easily choose recipes and add additional products from their grocer’s inventory to the cart (you can also deselect ingredients which you already have at home). Our team takes care of organizing a grocery delivery from your favorite grocer. In the process, we optimize for reduced food waste&#x2F;leftovers and the best price&#x2F;quality ratio by choosing the most suitable products for the required ingredients.<p>Making good dinner recommendations is a surprisingly complex problem. Factors include the user’s mood and energy, not wanting to overwhelm them, and also understanding that even if they aim to live healthier, comfort food is sometimes needed. We therefore include real humans in verifying and quality-checking the suggestions that are made. Additionally, learning fast about the individual user is tricky: what do they like, how experienced are they with cooking, etc. so that we can recommend recipes which are similar to their favorites but not the same. Similarity to the user&#x27;s tried-and-tested recipes is important to capitalize on existing cooking skills and taste preferences.<p>We’ve partnered with grocers such as Walmart, Kroger, and Target to be able to handle order placement and to know which products are currently available via their partner APIs. To map ingredients from recipes to suitable products we’ve created mapping tables which we use to generate shopping carts. As inventories don’t change that often, we match products to ingredients via scripts, but are able to review those mappings manually.  We are fans of the Spoonacular API which helps us to parse structured recipe data. We are in the process of building a recommendation engine to create weekly menus for each of our users. Right now, those suggestions are created by rules using tags on the recipe data, and then reviewed and edited by our culinary experts.\nWe launched our service in Berlin&#x2F;Germany over the summer as part of the YC S21 batch, and were fortunate to get a lot of early adopters using Kitchenful as their weekly solution for meal planning and grocery shopping. We have now started serving US customers.<p>We’ve also set up a 14-Day free trial period for everyone who’s interested so you can try it out: <a href=\"https:&#x2F;&#x2F;www.kitchenful.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kitchenful.com</a>.<p>By helping people to eat better <i>and</i> save time and energy on meal planning and grocery shopping, we believe we can help them feel better and have more energy for family, friends, work, and hobbies.<p>We’d love to hear about your own experiences with cooking at home throughout the week and discovering new dishes. Any ideas&#x2F;feedback&#x2F;questions you might have about what we’re building are more than welcome! Thank you!",
      "time": 1638282560,
      "title": "Launch HN: Kitchenful (YC S21) – Weekly recipes with integrated shopping",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29392453,
      "score": 2,
      "time": 1638282550,
      "title": "Spike: Artificial intelligence scheduling for Hubble space telescope",
      "type": "story",
      "url": "https://ntrs.nasa.gov/citations/19900017961"
    }
  ]
}