{
  "stories": [
    {
      "by": "leros",
      "descendants": 0,
      "id": 29864014,
      "score": 1,
      "text": "I&#x27;m a developer and product manager, about ten years into my career and making $300-400k a year.<p>I&#x27;m curious to explore if contracting makes sense as an alternative to full time employment. How do I start? How do I price myself?",
      "time": 1641741882,
      "title": "Ask HN: How do you start contracting?",
      "type": "story"
    },
    {
      "by": "AntonioMcNice",
      "descendants": 0,
      "id": 29864003,
      "score": 1,
      "time": 1641741811,
      "title": "Manhattan District Attorney Copies the San Francisco Playbook on Crime",
      "type": "story",
      "url": "https://www.contemporaryidiot.com/p/hamsterdam-ny"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 29863994,
      "score": 1,
      "time": 1641741728,
      "title": "EevBLAB 92 – The Wealth Equation [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=7Gd4iprcNPU"
    },
    {
      "by": "burnoutgal",
      "descendants": 0,
      "id": 29863974,
      "score": 1,
      "text": "When I first started my career everything was great - I did some internships at small local companies and got terrific feedback. I loved computers and would identify problems and dive into solving them enthusiastically. In hindsight a lot of the stuff I did was basically prototyping that never made it into production, but it felt great and my bosses loved it.<p>After a couple years I hit the big time and got a job at a tech startup that was blowing up. There was one really successful project I worked on, and otherwise I didn&#x27;t really accomplish much - the whole organization I was in was very dysfunctional and we churned through management and new projects really quickly, but nothing really landed. During this time our stock price went crazy, and I sold all my stock to make a down payment on a house and max out my retirement savings. Eventually the mismanagement got to me - every project seemed doomed to fail, and I was paralyzed with indecision daily. They promoted me to the level where I was supposed to propose and run projects, and I hated it.<p>To try and get back to building things, I joined a small startup around the time the pandemic started. Everyone there gave me great feedback, but there was no product focus, very little management, and ultimately it still felt like the things I was working on didn&#x27;t matter or lead to anything. The product itself was hard to use and had so many problems that I couldn&#x27;t imagine trying to untangle them all, so I left after a year.<p>At this point I was terrified that I just couldn&#x27;t work in tech anymore. I had developed medical problems from stress, and took months of time off to try and recover. There was nothing else I wanted to do for work, but the thought of sitting down and building anything was terrible.<p>Fast-forward to today - I applied for and got my dream job, working at another very successful startup that has a lot of high-performing people. They get things done, and the product is great. It&#x27;s been a couple months and I have achieved <i>nothing</i>. Not a single PR merged. I came in with all the momentum from my unemployment, all the enthusiasm and energy I could muster, and proposed a bunch of projects. Nothing landed. My manager left a few weeks after I started, my onboarding buddy has been absent, and the fear has started creeping in again that I&#x27;m alone and can&#x27;t hack it in this high performing team. If I can&#x27;t work in the tech industry it would completely upend my entire life.<p>Does anyone have any advice from a similar situation? I think I need more support and guidance but my experience has been that tech companies don&#x27;t really offer that, and also that everyone seems happy and successful regardless.",
      "time": 1641741641,
      "title": "Ask HN: How do I get over constant failure?",
      "type": "story"
    },
    {
      "by": "amosj",
      "descendants": 1,
      "id": 29863968,
      "kids": [
        29863969
      ],
      "score": 1,
      "time": 1641741598,
      "title": "Show HN: Combat social media addiciton with foreign wikipedias",
      "type": "story",
      "url": "https://github.com/volund/wikireader"
    },
    {
      "by": "carlycue",
      "descendants": 0,
      "id": 29863967,
      "score": 1,
      "time": 1641741593,
      "title": "Steve Jobs unveiled the first iPhone 15 years ago",
      "type": "story",
      "url": "https://appleinsider.com/articles/19/01/09/when-apple-introduced-the-iphone-on-jan-9-2007-it-was-the-ultimate-computer-for-the-rest-of-us"
    },
    {
      "by": "kkcorps",
      "descendants": 0,
      "id": 29863940,
      "score": 1,
      "text": "Suppose 10 days were allotted to add a feature on which solely you are working on. How many days will you allot to create class&#x2F;architecture designs, coding and testing the feature.\nFeel free to elaborate the approach for each although not necessary.",
      "time": 1641741400,
      "title": "Ask HN: How do you split time between design, coding and testing for a feature?",
      "type": "story"
    },
    {
      "by": "adarnon",
      "descendants": 1,
      "id": 29863920,
      "kids": [
        29863933
      ],
      "score": 3,
      "time": 1641741286,
      "title": "Deepchecks: Open-source tool for high standard validation of ML Models and Data",
      "type": "story",
      "url": "https://github.com/deepchecks/deepchecks"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 29863919,
      "score": 1,
      "time": 1641741281,
      "title": "Kazakhstan unrest: At least 164 killed in crackdown on protests, reports say",
      "type": "story",
      "url": "https://www.bbc.com/news/world-asia-59927267"
    },
    {
      "by": "nkurz",
      "descendants": 0,
      "id": 29863917,
      "score": 2,
      "time": 1641741278,
      "title": "In Defense of Bradford Pear",
      "type": "story",
      "url": "https://www.thefruitexplorers.com/blog/2021/03/29/defenseofbradfordpear"
    }
  ]
}