{
  "stories": [
    {
      "by": "xappmess",
      "descendants": 0,
      "id": 30720634,
      "score": 1,
      "time": 1647601319,
      "title": "Research suggests that last year, WhatsApp users tried to leave but failed",
      "type": "story",
      "url": "https://medium.com/@carlagriggio/the-great-messaging-app-migration-that-didnt-really-happen-56af637bc5d8"
    },
    {
      "by": "punnerud",
      "descendants": 0,
      "id": 30720627,
      "score": 2,
      "time": 1647601238,
      "title": "Clip-Frequency on movies for children. Good vs. bad",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Xn0YzYMhmQE"
    },
    {
      "by": "arobakid",
      "descendants": 0,
      "id": 30720623,
      "score": 5,
      "text": "Hi HN, we are Ana and Maria, co-founders of Theneo, an AI tool that generates Stripe-like API docs (<a href=\"https:&#x2F;&#x2F;theneo.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;theneo.io&#x2F;</a>). Our ML models take care of tedious manual work in generating and publishing API docs, making them much easier to produce—less technically demanding for writers, and less writing-intensive for developers.<p>I’ve been working with APIs for the past seven years, and the documentation process has been consistently the most painful. Nobody wants to have to do it, it’s filled with gruntwork and repetition, and takes a ton of time. Developers are not technical writers and documenting is never their priority, let alone making docs look nice. But for the reader—often the very same developers, when they’re consuming others’ work—it makes such a difference. How many times have you just looked at the API doc and decided “nope not going to integrate”? That was the case for me and my team many times.  Developer communities often complain that even the most well-known companies’ public API docs are incomprehensible, and internal API docs are neglected even more.<p>The gruntwork and repetition are clues that there’s room for software to do a lot of this work, and particularly for ML models to help produce the content.<p>We want to allow anyone to create great docs without having a whole team of writers and designers, so we researched what makes Stripe, Square, and a few other API docs so great.  First, it was definitely the content. Second, it was the user-friendly interface: layout, colors, scrolls, how easy it was to find information and give feedback. We talked to developers and technical writers to understand their pain points. Then we took all that research along with Maria’s experience as an ML Engineer at Microsoft, Deepmind, Google, and Facebook to come up with Theneo, a Technical Writer AI Assistant.<p>Theneo is like having a technical writer next to you. You upload your API collection (JSON, YAML, etc.). Our models automatically load and analyze API requests, methods, endpoints, request body, parameters, etc., then run some quality checks (e.g. for grammar errors) and give you content suggestions for the section names and descriptions.<p>API docs generated by Theneo are user-friendly, beautiful and interactive. we automatically generate all of your API requests in multiple languages and make it interactive for the reader. Here is an example: <a href=\"https:&#x2F;&#x2F;app.theneo.io&#x2F;demo&#x2F;theneo\" rel=\"nofollow\">https:&#x2F;&#x2F;app.theneo.io&#x2F;demo&#x2F;theneo</a><p>For internal API docs, we created several integrations that make it easy to create and maintain API documentation: Postman Integration - you can pull all of your collections and use them in Theneo; Github Actions - you can define how and when you want API docs to be updated automatically (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;marketplace&#x2F;actions&#x2F;theneo-api-documentation);\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;marketplace&#x2F;actions&#x2F;theneo-api-documentat...</a>  \nVisual Studio Code (coming soon) - by the end of this month you will be able to create and preview your API documentation right in your IDE. We do not use your private API docs for ML training.<p>You can see a quick overview of how our setup works here: <a href=\"https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;792fc6008a914d068ff8b34994fbc467\" rel=\"nofollow\">https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;792fc6008a914d068ff8b34994fbc467</a><p>We are coming up with a lot of new integrations and features to make it easy for developers to generate and maintain internal or public-facing API docs. We would love to hear from you, what you are currently using, what you love or don’t love about those solutions, what stops you from having high-quality docs for your APIs, and anything else you’d like to share!",
      "time": 1647601191,
      "title": "Launch HN: Theneo (YC W22) – Generate Stripe-Style API Docs",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 30720619,
      "score": 1,
      "time": 1647601147,
      "title": "What happened to performance engineering in the cloud?",
      "type": "story",
      "url": "https://www.infoworld.com/article/3654295/what-happened-to-performance-engineering-in-the-cloud.html"
    },
    {
      "by": "karlicoss",
      "descendants": 0,
      "id": 30720609,
      "score": 1,
      "time": 1647601066,
      "title": "Open APIs are a start, Open Standard is better",
      "type": "story",
      "url": "https://interoperability.news/2022/02/open-apis-are-a-start-open-standard-is-better/"
    },
    {
      "by": "cloudcoders",
      "descendants": 0,
      "id": 30720602,
      "score": 1,
      "time": 1647601014,
      "title": "How to implement NextAuth credentials provider with external API and login page",
      "type": "story",
      "url": "https://cloudcoders.xyz/blog/nextauth-credentials-provider-with-external-api-and-login-page/"
    },
    {
      "by": "brikka",
      "descendants": 0,
      "id": 30720599,
      "score": 1,
      "time": 1647600988,
      "title": "Hack-Tic (Dutch hacker magazine)",
      "type": "story",
      "url": "https://archive.org/search.php?query=creator%3A%22Hack-tic%22"
    },
    {
      "by": "ekianjo",
      "descendants": 0,
      "id": 30720597,
      "score": 2,
      "time": 1647600977,
      "title": "Many (1400) Games on the Steam Deck, Including Doom (2016)",
      "type": "story",
      "url": "https://boilingsteam.com/1400-games-on-the-steam-deck-including-doom-2016/"
    },
    {
      "by": "tony-allan",
      "descendants": 0,
      "id": 30720591,
      "score": 1,
      "text": "Am I the only person who is pissed off by clicking on a link to read a story and then having to click twice or get out because of a sneaky redirect?<p>For example https:&#x2F;&#x2F;www.tomshardware.com&#x2F;news&#x2F;apple-m1-ultra-rtx-3090-benchmarks has a more stories before you go page (which at least the are honest about and signal clearly)",
      "time": 1647600911,
      "title": "One click in … two to get out",
      "type": "story"
    },
    {
      "by": "ajdude",
      "descendants": 0,
      "id": 30720580,
      "score": 1,
      "time": 1647600825,
      "title": "Goodbye HTML. Hello Canvas",
      "type": "story",
      "url": "https://scribe.rip/goodbye-html-hello-canvas-part-1-92f750961666"
    }
  ]
}