{
  "stories": [
    {
      "by": "jdthedisciple",
      "descendants": 0,
      "id": 31284802,
      "score": 1,
      "text": "I have a Bachelor&#x27;s Degree in Electrical Engineering and Information Technology from a top #3 University in Germany. After my Bachelors I switched to a Masters of Science program in Informatics &#x2F; Computer Science at that same University. I am still in my 1st year of the masters (about 25% of the way through). I have gathered 2-3 years of Software Enginnering experience on the side and consider myself a junior software engineer.<p>I dread the world of academia, I don&#x27;t wanna become a researcher and really just wanna go full time into software enginnering at some reputable company and contribute to some interesting project(s).<p>A bit more about myself: I think I am a decent developer, always eager to learn, and I feel I am very good at selling my skills to companies as I have a rather high application-to-job-offer-ratio so to say. I guess part of it is that I display a lot of confidence in my abilities outwardly.<p>Here is the problem though: I am and want to be a software engineer, but if I drop out now my only degree will be in electrical engineering and NOT computer science. So I fear that I will never be considered a real software engineer based on my academic title.<p>I have swayed back and forth multiple times and am currently kind of half-heartedly still doing my courses and everything.<p>Would it be a good idea to drop out? Again, I frankly hate academic life and love creating stuff NOT for university credits but for an actual purpose. What would people experienced in the field advise me to do?<p>Thanks a lot",
      "time": 1651843445,
      "title": "Ask HN: Should I quit my CS Masters Program?",
      "type": "story"
    },
    {
      "by": "jsherry",
      "descendants": 0,
      "id": 31284799,
      "score": 1,
      "time": 1651843437,
      "title": "Deliberate Culture vs. Passive Culture",
      "type": "story",
      "url": "https://jonathansherry.medium.com/deliberate-culture-vs-passive-culture-37eaece6a9f1"
    },
    {
      "by": "giorgosera",
      "descendants": 0,
      "id": 31284779,
      "score": 1,
      "text": "If you work at a healthtech company how do you de-identify PHI in your data? Do you use any homegrown, commercial or open source tools?",
      "time": 1651843268,
      "title": "Ask HN: What tools do you use to de-identify PHI data?",
      "type": "story"
    },
    {
      "by": "natly",
      "descendants": 0,
      "id": 31284778,
      "score": 1,
      "time": 1651843259,
      "title": "Jelly simulation in WebGL (MLS-MPM)",
      "type": "story",
      "url": "https://oimo.io/works/jelly/"
    },
    {
      "by": "thejokersthief",
      "descendants": 0,
      "id": 31284758,
      "score": 1,
      "time": 1651843117,
      "title": "The Importance of a Golden Path",
      "type": "story",
      "url": "https://iamevan.me/blog/the-importance-of-a-golden-path"
    },
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 31284747,
      "score": 1,
      "time": 1651843063,
      "title": "Why half a million people watch me study on TikTok",
      "type": "story",
      "url": "https://www.bbc.com/news/education-61305442"
    },
    {
      "by": "taybrutal",
      "descendants": 0,
      "id": 31284735,
      "score": 1,
      "text": "Moving from the comfortable procedural and functional paradigms, my code feels so much more structured with OOP. I find it very difficult to name something I would not consider an “object” as an object. How do you name your “hard-to-name” objects? Examples would be great.",
      "time": 1651843002,
      "title": "Ask HN: How do you name your objects?",
      "type": "story"
    },
    {
      "by": "ttybird2",
      "descendants": 0,
      "id": 31284718,
      "score": 1,
      "time": 1651842872,
      "title": "Flutter Issue: Disable Analytics by Default – Respect EU/ECC Laws (GDPR)",
      "type": "story",
      "url": "https://github.com/flutter/flutter/issues/73657"
    },
    {
      "by": "reckel",
      "descendants": 0,
      "id": 31284710,
      "score": 1,
      "time": 1651842824,
      "title": "The science behind ultrasonic motion sensing for Echo",
      "type": "story",
      "url": "https://www.amazon.science/blog/the-science-behind-ultrasonic-motion-sensing-for-echo"
    },
    {
      "by": "curtisblaine",
      "descendants": 1,
      "id": 31284688,
      "kids": [
        31284729
      ],
      "score": 3,
      "time": 1651842672,
      "title": "Musk calls for investigation into groups controlling access to information",
      "type": "story",
      "url": "https://www.dailywire.com/news/musk-calls-for-investigation-into-far-left-groups-trying-to-control-your-access-to-information"
    }
  ]
}