{
  "stories": [
    {
      "by": "microflash",
      "descendants": 0,
      "id": 31633469,
      "score": 1,
      "text": "Last year, my cheap HP mouse started giving me a huge amount of pain in the arm. It was tiny and I had a really poor grip on it most of the times (I have long fingers).<p>So, I started searching for a replacement. My criteria were that the new mouse should be ergonomic, large and wired. I scoured the review sites, shopping sites, the whole shebang.<p>I couldn&#x27;t find a single mouse that fits all the criteria. Hence the question.<p>P.S.<p>1. I eventually bought a wireless mouse, an ASUS MW203. It is reasonably large and it has helped reduce my pain a lot. But sadly, I couldn&#x27;t get my hands on it&#x27;s mythical wired version.\n2. It is surprisingly hard to find a large mouse in the sea of compact and portable (read: small) ones.\n3. I prefer going wired when it comes to electronics and stuff. They are ready to repair and disengage (you just have to pull the wire). It is just a preference and not a crusade against wireless devices.",
      "time": 1654452880,
      "title": "Ask HN: Is there any good wired mouse in the market?",
      "type": "story"
    },
    {
      "by": "devilkin",
      "descendants": 0,
      "id": 31633461,
      "score": 1,
      "time": 1654452834,
      "title": "tt-rss Android client no longer published to play store",
      "type": "story",
      "url": "https://community.tt-rss.org/t/i-no-longer-publish-anything-on-google-play/5408"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 31633427,
      "score": 1,
      "time": 1654452595,
      "title": "Researcher sheds light on mystery African samurai Yasuke made famous by Netflix",
      "type": "story",
      "url": "https://mainichi.jp/english/articles/20220603/p2a/00m/0et/026000c"
    },
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 31633424,
      "score": 1,
      "text": "I’m curious if anyone has experience getting into graduate programs matter having done an undergrad program online.<p>There are some decent online undergrad degrees nowadays, but when I look at graduate programs they tend to want letters of recommendation and many prefer at least some from academic sources.<p>But if you’ve completed you’re undergrad degree in an online program, you’re not likely to have built any significant relationship with any professors, at least not in a way they’d be comfortable recommending you.<p>Are online undergrad programs just no good if you want to be able to consider further education or am I missing something?",
      "time": 1654452587,
      "title": "Ask HN: Online undergraduate programs and graduate education?",
      "type": "story"
    },
    {
      "by": "FeaturelessBug",
      "descendants": 0,
      "id": 31633420,
      "score": 2,
      "time": 1654452561,
      "title": "'Several Active shooters' in Philadelphia area 3 dead and 11 others wounded",
      "type": "story",
      "url": "https://www.cnn.com/2022/06/05/us/philadelphia-south-street-shooting/index.html"
    },
    {
      "by": "kibaffo33",
      "descendants": 0,
      "id": 31633409,
      "score": 1,
      "time": 1654452450,
      "title": "GBoard Session Data (mobile forensics)",
      "type": "story",
      "url": "https://kibaffo33.data.blog/2022/06/05/omgboard/"
    },
    {
      "by": "captainchris",
      "descendants": 0,
      "id": 31633384,
      "score": 1,
      "text": "Hi HN:\nI am back in a hole ready to hang myself.<p>Criminal psyops platform Google hoards data on Americans that they don&#x27;t disclose. They then abuse that data for malicious psychological operations. This included Susan Wojcicki-led @youtube maliciously targeting me during the suicide of a childhood friend.<p>Now, youtube uses their text to image preview matching psyops targeting apparatus to perform realtime stream of consciousness psyops. The message is clear: &quot;Hey a$&amp;h0le, we dont care that we are rich and powerful, and that you, a homeless loser who broke down due to being unable to handle our psyops targeting program, might KILL YOURSELF in part from our filtering program. Take it or leave it. Submit to being in a surv society that we abuse to condition ppl to accept this new status quo, or don&#x27;t. We don&#x27;t care. Go hang yourself, bc you are a white male college dropout homeless loser anyway. We had employees deploy racial justice algos against white male dropouts like u internally during the Trump admin, and we covered it up. We will not stop targeting you with data abuse practices, no matter how many times you complain.&quot;<p>I bet that the fact that I was placed on an FBI watch list in 1997 newark (due to hanging around the Gambino north jersey defacto street boss while David Chase and other Sopranos cast conceived their love and passion for jazz drummers) made for quite the inspiration in laughing about power abuse over a targeting fodder plaything.<p>My response is simple. I will commit suicide in protest this week. Plz do not help me at all. I will never goddamn program again, ever. This species is lying corrupt thieving self serving cowards. I&#x27;d rather die than code ever again.<p>sv, pg and others should be ashamed for significantly contributing to a machine that lacks accountability<p>all those trillions in support from the cia&#x2F;nsa&#x2F;.gov complex come at the expense of some random fodder who resist and hang themselves with a goddamn rope. that machine is incentivized to allow me to hang myself then allow the &quot;he&#x27;s delusional&quot; narrative to overpower the obvious truth - there is no privacy, accept it or you&#x27;ll wind up like &quot;captainchris&quot;<p>Aloha.",
      "time": 1654452332,
      "title": "Tell HN: Suicide in protest of SV data abuse practices",
      "type": "story"
    },
    {
      "by": "yonibot",
      "descendants": 1,
      "id": 31633369,
      "kids": [
        31633408
      ],
      "score": 1,
      "time": 1654452194,
      "title": "Diabetes drug leads to notable weight loss in people with obesity – study",
      "type": "story",
      "url": "https://www.theguardian.com/science/2022/jun/05/diabetes-drug-tirzepatide-leads-to-notable-weight-loss-in-people-with-obesity-study"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31633351,
      "score": 1,
      "time": 1654452056,
      "title": "First 1 petabit/second transmission in a standard cladding diameter fiber",
      "type": "story",
      "url": "https://www.nict.go.jp/en/press/2022/05/30-1.html"
    },
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 31633339,
      "score": 1,
      "time": 1654451989,
      "title": "Woodpecker CI – Community Fork of the Drone CI System",
      "type": "story",
      "url": "https://woodpecker-ci.org/"
    }
  ]
}