{
  "stories": [
    {
      "by": "frankiesardo",
      "descendants": 0,
      "id": 29153133,
      "score": 1,
      "time": 1636399587,
      "title": "Hydrogen: A React Framework for Dynamic, Contextual and Personalized E-Commerce",
      "type": "story",
      "url": "https://www.smashingmagazine.com/2021/11/hydrogen-react-framework-dynamic-contextual-personalized-ecommerce/"
    },
    {
      "by": "CaliforniaKarl",
      "descendants": 0,
      "id": 29153130,
      "score": 1,
      "time": 1636399565,
      "title": "I tried out T-Mobile this summer; avoid them if you can [Tweet thread]",
      "type": "story",
      "url": "https://twitter.com/sgtmuffin/status/1457706226230378499"
    },
    {
      "by": "nicksiscoe",
      "descendants": 0,
      "id": 29153123,
      "score": 1,
      "text": "I&#x27;m working on an application that will provide appointment scheduling to many B2B clients. Each of our (siloed) clients will provide unique scheduling options to their customers, meaning that each of our clients requires different appointment types and availability configuration options.<p>Basically, we need to provide a Calendly-like platform to each of our clients. Are there any existing providers that are built for this?<p>Ideally we&#x27;d be interfacing with a simple API that handles all the hard parts of scheduling. Bonus points if the provider has some pre-built elements that make building client-facing availability configuration really easy.",
      "time": 1636399523,
      "title": "Ask HN: Know any Calendly-as-a-Service providers?",
      "type": "story"
    },
    {
      "by": "mauerbac",
      "descendants": 0,
      "id": 29153112,
      "score": 2,
      "time": 1636399472,
      "title": "Drivers of Digital Attention [pdf]",
      "type": "story",
      "url": "http://www.guyaridor.net/files/jmp_latest.pdf"
    },
    {
      "by": "damir",
      "descendants": 0,
      "id": 29153107,
      "score": 1,
      "time": 1636399411,
      "title": "Learn Lua in 15 Minutes",
      "type": "story",
      "url": "http://tylerneylon.com/a/learn-lua/"
    },
    {
      "by": "rel2thr",
      "descendants": 1,
      "id": 29153097,
      "kids": [
        29153129
      ],
      "score": 1,
      "time": 1636399383,
      "title": "The University of Austin",
      "type": "story",
      "url": "https://www.uaustin.org"
    },
    {
      "by": "remix2000",
      "descendants": 0,
      "id": 29153087,
      "score": 1,
      "time": 1636399315,
      "title": "Glewlwyd SSO Server",
      "type": "story",
      "url": "https://babelouest.github.io/glewlwyd/"
    },
    {
      "by": "andrewljohnson",
      "descendants": 0,
      "id": 29153028,
      "score": 1,
      "time": 1636398902,
      "title": "The Random Number Generator Hypothesis",
      "type": "story",
      "url": "https://lacker.io/physics/2021/11/08/the-random-number-generator-hypothesis.html"
    },
    {
      "by": "UncleOxidant",
      "descendants": 0,
      "id": 29153025,
      "score": 1,
      "time": 1636398891,
      "title": "What's an Operating System? (MirageOS library operating system discussion)",
      "type": "story",
      "url": "https://signalsandthreads.com/what-is-an-operating-system/"
    },
    {
      "by": "natgordon",
      "descendants": 0,
      "id": 29153024,
      "score": 4,
      "text": "Hi HN! In February 2011 I launched a side project on Hacker News. The HN post was #1 for about a day and was titled: “I’m a pregnant hacker. Here is my side project” https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=2175757<p>Babylist has grown since that launch day into a $250M&#x2F;year revenue business. We announced our first significant funding round yesterday: https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;tanyaklich&#x2F;2021&#x2F;11&#x2F;04&#x2F;babylist-raises-40-million-expects-to-hit-250-million-in-annual-revenue&#x2F;<p>I wanted to say thank you. Our very earliest adopters came from that post. We’ve hired amazing team members through HN Who’s Hiring over the years.<p>I wrote that post on Feb 3 2011 and had my son two weeks later. Being home with a newborn was difficult for me -- in reality it was isolating and boring. Being able to work on Babylist for 45 minutes a day used my brain in a needed way. Through that first year Babylist scaled to about $3,000&#x2F;month with an affiliate business model. Babylist was then what it is now: A better baby registry that works across retailers.<p>Over the years we’ve made our experience and offering better and better. We’ve launched amazing products, we’re both a vertical marketplace and e-commerce company, we have the best content to make product decisions and most recently are creating amazing product recommendations via our data and machine learning. Years ago we made an explicit decision that we weren’t a registry company, we were all about this monumental life stage and serve a baby’s entire community.<p>The journey from engineer to CEO of a growing 100+ person organization has been challenging and amazing. I stopped coding many years ago and bite my tongue when I have technical suggestions. I have given our Engineering Culture interview to almost every hire we’ve made until very recently.<p>I’m happy to talk about any part of this journey with y’all. I’m very grateful to this community. I would love to read your feedback or answer questions. (We’re also hiring remote engineers and happy to answer any questions about that.)",
      "time": 1636398882,
      "title": "Follow up to Show HN: I’m a pregnant hacker. Here is my side project",
      "type": "story"
    }
  ]
}