{
  "stories": [
    null,
    {
      "by": "jb1991",
      "descendants": 0,
      "id": 30189215,
      "score": 1,
      "time": 1643868156,
      "title": "Twitter reportedly working on new feature to let users write full articles",
      "type": "story",
      "url": "https://9to5mac.com/2022/02/02/twitter-reportedly-working-on-new-feature-to-let-users-write-full-articles/"
    },
    {
      "by": "Archelaos",
      "descendants": 0,
      "id": 30189183,
      "score": 1,
      "time": 1643867736,
      "title": "Research project: a solar roof for the autobahn",
      "type": "story",
      "url": "https://innovationorigins.com/en/research-project-on-the-a81-autobahn-solar-roof-over-the-highway/"
    },
    {
      "by": "ablazeexportpvt",
      "descendants": 0,
      "id": 30189182,
      "score": 1,
      "text": "Ablaze Export Pvt. Ltd. is an innovative leader and developer of the new generation of pilot plants used by chemists and researchers in laboratory and on commercial scale.<p>We provide superior quality chemical process systems. Backed by 34 years of experience of working with customers across India, we are now a Leading Manufacturer and Supplier of reactors and accessories made of borosilicate glass right from R&amp;D scale to pilot plant, and finally production scale.<p>We specialize in designing, fabrication, engineering, supply &amp; installation Of equipment &amp; plant made of Borosilicate Glass 3.3 (Including Pilot Plant &amp; kilo labs &#x2F; Mini Plant Teaching Units all Glass Equipment complies with ISO 3585&#x2F;3586) meant for the chemicals pharmaceutical industries and R &amp; D and laboratory and petrochemicals usage. Our unit can be supplied with the most advanced real-time automation system like SCADA.<p>As regards the quality and services offered by Ablaze &amp; provide not only state of the art equipment but also the services of installation, operation and maintenance along with the expertise of our its technical team.<p>Our Products:<p>- Glass Reactor\n- Lab Rotary Evaporator\n- Rotary Film Evaporator\n- Dry HCL gas Generator\n- High Pressure Reactor\n- Agitated Nutsche Filter\n- Bromine Recovery Plant\n- Industrial Glassware\n- Shell and Tube Heat Exchanger\n- Molecular&#x2F;Short Path Distillation System\n- Wiped Film&#x2F;Thin Film Evaporator<p>Visit our website: https:&#x2F;&#x2F;www.ablazeexport.com&#x2F; or call us on  919377552542 for more information.Ablaze Export Pvt. Ltd.",
      "time": 1643867727,
      "title": "Ablazeexportpvt",
      "type": "story"
    },
    {
      "by": "jb1991",
      "descendants": 0,
      "id": 30189173,
      "score": 1,
      "time": 1643867609,
      "title": "Teen's Tesla hack shows how vulnerable third-party apps may make cars",
      "type": "story",
      "url": "https://www.cnn.com/2022/02/02/cars/tesla-teen-hack/index.html"
    },
    {
      "by": "deepmistry",
      "descendants": 1,
      "id": 30189162,
      "kids": [
        30189176
      ],
      "score": 1,
      "time": 1643867544,
      "title": "Meta shares plummet 20% after posting rare profit decline",
      "type": "story",
      "url": "https://www.cnn.com/2022/02/02/tech/facebook-earnings-q4-2021/index.html"
    },
    {
      "by": "oxplot",
      "descendants": 0,
      "id": 30189159,
      "score": 2,
      "time": 1643867527,
      "title": "Starlink Coverage Tracker",
      "type": "story",
      "url": "https://starlink.sx/"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 30189158,
      "score": 2,
      "time": 1643867524,
      "title": "Self-description, based on an Xkcd comic",
      "type": "story",
      "url": "https://twitter.com/etiennejcb/status/1488935615697723393"
    },
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 30189154,
      "score": 1,
      "text": "New York (CNN Business)Robinhood is still losing money. The platform reported a drop in the number of monthly active users in its most recent quarter. Is it time for the struggling online broker to consider a sale?<p>Even though Robinhood&#x27;s stock has rebounded a bit in the past few days after reporting its latest financial results, it is still trading at only around $14 a share — more than 60% below the initial public offering price of $38 last year.\nAnalysts at Goldman Sachs and Citigroup slashed their price targets on Robinhood following the earnings report. The woeful post-IPO performance for the platform is a sign it may be better off as part of a larger firm, especially given the massive consolidation in the business.\nMorgan Stanley (MS) now owns E-Trade and Charles Schwab (SCHW) has gobbled up TD Ameritrade.\nAnd the deals keep coming. UBS (UBS) just bought roboadvisor Wealthfront (which is popular with millennials and Gen Z investors) last week for $1.4 billion.\nThere&#x27;s little reason for Robinhood investors to be merry\nThere&#x27;s little reason for Robinhood investors to be merry\nSo here&#x27;s a thought: Could Robinhood be a potentially good fit for a company like PayPal (PYPL), which also has a large base of younger customers and is looking to step up its game in investing?\n&quot;Where does Robinhood go from here? I can see them getting bought out or taken private,&quot; said Hugh Tallents, a partner with consulting firm cg42. &quot;But they wouldn&#x27;t be interesting to big banks, Schwab or Morgan Stanley. A wild card could be PayPal.&quot;\nThe case for a PayPal deal\nTallents notes that PayPal plans to introduce more investing features. The company hired an executive who formerly was president at Ally Invest (ALLY), Rich Hagen, to lead a new Invest at PayPal unit last summer.\nPayPal&#x27;s user base, especially the younger adopters of its Venmo service, could fit well with Robinhood, too.\n&quot;Robinhood has over 20 million accounts and the customers are young and active traders,&quot; noted John Wu, president of Ava Labs, a cryptocurrency trading platform. &quot;It&#x27;s an attractive demographic.&quot; Wu added that Robinhood&#x27;s near-term woes could make it a good deal at the right price.\nWall Street seems certain that PayPal is willing to spend to grow. There were rumors last year that the payment portal made a reported $45 billion takeover offer for social media firm Pinterest (PINS). With its current market value of about $12 billion, Robinhood would be a much smaller deal.\nRobinhood CEO: We&#x27;re relentlessly focused on the long-term<p>Robinhood CEO: We&#x27;re relentlessly focused on the long-term 03:41\nPayPal, which will report its latest earnings after the closing bell Tuesday, had no comment when asked by CNN Business if it has any interest in acquiring Robinhood.\nBut PayPal president and CEO Dan Schulman has acknowledged that the company is looking to diversify and add more investing products, such as stock trading, to go along with its crypto services.\n&quot;We expect to launch more features next year, including equity investing capabilities,&quot; Schulman said during a conference call with investors after PayPal reported earnings in November. &quot;It&#x27;s quite exciting to see the initial positive reaction to our app, and we will continue to refine and expand its functionality to help consumers navigate an increasingly digital and connected lifestyle.&quot;\nFor its part, Robinhood chief financial officer Jason Warnick has said that the company is not interested in selling itself.\n&quot;We&#x27;ve made massive investments in the last year around our infrastructure and our team. We&#x27;ve never been better positioned,&quot; Warnick told reporters on a call after last week&#x27;s earnings. &quot;We think the opportunity is big in front of us and we fully intend to pursue it as an independent company.&quot;",
      "time": 1643867494,
      "title": "Should PayPal Buy Robinhood?",
      "type": "story"
    },
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 30189143,
      "score": 1,
      "text": "Right now, there&#x27;s a shortage of truck drivers in the US and worldwide, exacerbated by the e-commerce boom brought on by the pandemic.<p>One solution to the problem is autonomous trucks, and several companies are in a race to be the first to launch one. Among them is San Diego-based TuSimple.\nFounded in 2015, TuSimple has completed about 2 million miles of road tests with its 70 prototype trucks across the US, China and Europe. Although these are simply commercially available trucks retrofitted with its technology, TuSimple has deals in place with two of the world&#x27;s largest truck manufacturers -- Navistar in the US and Traton, Volkswagen&#x27;s trucking business, in Europe -- to design and build fully autonomous models, which it hopes to launch by 2024.",
      "time": 1643867387,
      "title": "There's a shortage of truckers, but TuSimple thinks it has a solution",
      "type": "story"
    }
  ]
}