{
  "stories": [
    {
      "by": "stigma",
      "descendants": 0,
      "id": 31440067,
      "score": 1,
      "time": 1652993847,
      "title": "Practice secure coding with OWASP’s secure coding dojo",
      "type": "story",
      "url": "https://securecodingdojo.owasp.org/public/index.html"
    },
    {
      "by": "mc4ndr3",
      "descendants": 0,
      "id": 31440066,
      "score": 1,
      "text": "As a backend service engineer, I feel it is my contractual duty to assist the frontend developer, in order that their frontend needs are met in a reliable, efficient manner. That the data models and request structures are designed for the kinds of operations that the frontend needs for common user actions.<p>(Or substitute another backend developer for frontend developer, in the case of deep backend-to-backend services.)<p>It would seem logical, therefore, that most backend teams should treat the frontend developer as their customer client. Because the frontend dev will know best what is required to build and what is required not to build. Yet no software firm in my experience ever organizes the work this way. Why?<p>Is it frontend&#x27;s stigma as a &quot;less technical&quot; role, an assumption which is patently false?<p>Is it the administrative incentive to insert ever more middlemen and middlewomen in between the core parties? Surely there are other places to stick people, perhaps above to over-manage the frontend team. But why the incredible disconnect between frontend and backend teams? Who often report to distant chains of command.",
      "time": 1652993840,
      "title": "Why don't back end engineers report to front end engineers?",
      "type": "story"
    },
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 31440058,
      "score": 1,
      "text": "I follow Dall-e generated imagery on Twitter and Reddit in awe. But now every time I see an image with a caption I try to find the little imperfections it usually has only to realize many seconds later that it&#x27;s a real photo. Most photos now stop me to question if they real. Random photos never took that much time before, now they do.<p>Are you also doing this?<p>P.S. Photoshop happened gradually, and it takes lot of effort to do it correctly, same goes for Photorealistic 3d renders. They are indistinguishable when done perfectly which is not that often. Therefore I think it&#x27;s very different from photoshop or realistic 3d renders.",
      "time": 1652993810,
      "title": "Ask HN: Is there a DALL-E effect in place?",
      "type": "story"
    },
    {
      "by": "dpbigler",
      "descendants": 0,
      "id": 31440049,
      "score": 2,
      "time": 1652993757,
      "title": "Show HN: Trybsync – A Social RSS Aggregator",
      "type": "story",
      "url": "https://www.trybsync.com/"
    },
    {
      "by": "baal80spam",
      "descendants": 0,
      "id": 31440040,
      "score": 1,
      "time": 1652993712,
      "title": "Bill Gates AMA",
      "type": "story",
      "url": "https://old.reddit.com/r/IAmA/comments/ut7yj0/im_bill_gates_cochair_of_the_bill_and_melinda/"
    },
    {
      "by": "webmobdev",
      "descendants": 0,
      "id": 31440032,
      "score": 1,
      "time": 1652993661,
      "title": "India’s real fintech user base is just 10-15 crore: Zerodha’s Nithin Kamath",
      "type": "story",
      "url": "https://twitter.com/Nithin0dha/status/1527213271295852546"
    },
    {
      "by": "sophiewang",
      "descendants": 0,
      "id": 31439994,
      "score": 1,
      "time": 1652993473,
      "title": "Erlang OTP-25.0 Highlights",
      "type": "story",
      "url": "https://www.erlang.org/blog/my-otp-25-highlights/"
    },
    {
      "by": "rocketdey",
      "descendants": 1,
      "id": 31439966,
      "kids": [
        31440054
      ],
      "score": 1,
      "time": 1652993304,
      "title": "Scrape Audited Coins from CertiK",
      "type": "story",
      "url": "https://serpapi.com/blog/scrape-audited-coins-from-certik/"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 31439917,
      "score": 3,
      "time": 1652992995,
      "title": "Why Do We Swallow What Big Oil and the “Green” Movement Tell Us?",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/17/opinion/russian-oil-green-energy.html"
    },
    {
      "by": "escot",
      "descendants": 0,
      "id": 31439871,
      "score": 2,
      "time": 1652992728,
      "title": "Sit on the Floor, Improve Your Health (2020) [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=6iNrgkZ-TeI"
    }
  ]
}