{
  "stories": [
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 31258143,
      "score": 1,
      "time": 1651654139,
      "title": "Replit Is Now Free for Educators",
      "type": "story",
      "url": "https://blog.replit.com/teamsforedu_free"
    },
    {
      "by": "doppp",
      "descendants": 0,
      "id": 31258141,
      "score": 1,
      "time": 1651654106,
      "title": "SoundCloud acquires Musiio, an AI music curator, to improve discovery",
      "type": "story",
      "url": "https://techcrunch.com/2022/05/03/soundcloud-acquires-musiio-ai-music-discovery/"
    },
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 31258136,
      "score": 1,
      "time": 1651654068,
      "title": "Effective Security by Obscurity [pdf]",
      "type": "story",
      "url": "https://arxiv.org/abs/2205.01547"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 31258135,
      "score": 1,
      "time": 1651654051,
      "title": "Web Developers Form Advocacy Group to Allow Other Browser Engines on iOS",
      "type": "story",
      "url": "https://www.macrumors.com/2022/03/02/web-devs-advocacy-group-browser-engines-ios/"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 31258132,
      "score": 1,
      "time": 1651654030,
      "title": "Changelog Podcast: Securing the open source supply chain",
      "type": "story",
      "url": "https://changelog.com/podcast/482"
    },
    {
      "by": "sph",
      "descendants": 0,
      "id": 31258129,
      "score": 1,
      "time": 1651653992,
      "title": "Sticky Bit",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Sticky_bit"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 31258128,
      "score": 1,
      "time": 1651653978,
      "title": "Cookies at the Edge: Not a Baking Blog Post",
      "type": "story",
      "url": "https://austingil.com/cookies-at-the-edge/"
    },
    {
      "by": "dz0ny",
      "descendants": 0,
      "id": 31258126,
      "score": 2,
      "text": "I am a bit in a pickle. Looks like I cannot trust or even use Heroku any more. The trust is broken a bit because of how they are handling the breach, that they had.\nThe &quot;use&quot; is even more complicated. I&#x27;ve used review apps extensively with their pipeline, and since they revoked GitHub integration 2&#x2F;3 of Heroku are non-functional for me (no review apps, no staging migration pipeline).<p>I&#x27;ve been looking for alternatives and found them severely lacking in security scope or basic functionality.<p>Render.com<p>- There is no concept of read&#x2F;manage permissions. Anyone who is invited into a team can delete the team, all apps, services etc. By design of their UI also possibly by mistake. Support responded that they have been working on this the last 2 years or something like that.<p>- &#x2F;tmp folders are misconfigured. This means that if you send a large enough POST and the web server stores the payload into a temp folder, that seek file is lost. I noticed this after a week of random EOF errors that the web server reported. The support responded I should just use their disk offering and that ephemeral services should not use temp folders, mind that Heroku is also ephemeral but &#x2F;tmp folder can still be used because otherwise you have above problem.<p>- GitHub integration. The problem is that only one team&#x2F;user can link the app to the entire platform. This means that if other team members visit the &quot;Blueprint Sync&quot; page, they will see an error that GitHub integration is broken. And for every team that you have, you would have to create a new GitHub user, just to set up sync and only that user can then see sync status.<p>I feel they are working hard and are closest to the Heroku. Yet I feel they are not up to the task that Heroku was&#x2F;is, in particular I think they are not using the service themselves otherwise they would fix these shortcomings a long time ago.<p>Railway.app<p>They have Teams properly solved, and GitHub integration also works as expected. But they have issues elsewhere.<p>- Builder is slow as hell. For example, 200mb bundle needed 6 minutes to be deployed (they don&#x27;t have build cache) and I was able to do it only once. The second attempt resulted in timeout (builds in 179s on Heroku and on Render in ~30s).<p>- No support for scheduled executions. This is a feature that both Heroku (Scheduler) and Render (Cron Jobs) provide. What it does, it spins the bundle&#x2F;container and executes something at specific interval, you pay extra, but that&#x27;s the whole point so that you can run more demanding tasks. I would have to rewrite everything into fake web cron of PHP era.<p>Do you know any alternatives besides these two? What are your plans with Heroku?",
      "time": 1651653916,
      "title": "Ask HN: Alternative to Heroku",
      "type": "story"
    },
    {
      "by": "surrTurr",
      "descendants": 0,
      "id": 31258109,
      "score": 1,
      "time": 1651653736,
      "title": "YouCode: You.com Code Search Engine",
      "type": "story",
      "url": "https://you.com/code"
    },
    {
      "by": "epaga",
      "descendants": 0,
      "id": 31258106,
      "score": 1,
      "time": 1651653634,
      "title": "A Whiter White",
      "type": "story",
      "url": "https://kidi.ng/wanna-see-a-whiter-white/"
    }
  ]
}