{
  "stories": [
    {
      "by": "harscoat",
      "descendants": 0,
      "id": 31346516,
      "score": 1,
      "time": 1652306971,
      "title": "“What I did to destroy Russian pantonne bridge over Siverskyi Donets”",
      "type": "story",
      "url": "https://twitter.com/kms_d4k/status/1524506104192974849"
    },
    {
      "by": "_cbdev",
      "descendants": 0,
      "id": 31346514,
      "score": 1,
      "time": 1652306954,
      "title": "Tachyum Announces World’s First Universal Processor",
      "type": "story",
      "url": "https://www.tachyum.com/de/media/press-releases/2022/05/11/tachyum-delivers-the-highest-ai-and-hpc-performance-with-the-launch-of-the-worlds-first-universal-processor/"
    },
    {
      "by": "yllek",
      "descendants": 0,
      "id": 31346481,
      "score": 1,
      "time": 1652306762,
      "title": "The Cloud Native Community Needs to Talk about Testing",
      "type": "story",
      "url": "https://thenewstack.io/the-cloud-native-community-needs-to-talk-about-testing/"
    },
    {
      "by": "yllek",
      "descendants": 0,
      "id": 31346473,
      "score": 1,
      "time": 1652306696,
      "title": "Kubernetes Manifest Life Cycle",
      "type": "story",
      "url": "https://thenewstack.io/the-kubernetes-manifest-life-cycle-too-often-overlooked/"
    },
    {
      "by": "pepys",
      "descendants": 0,
      "id": 31346467,
      "score": 1,
      "time": 1652306663,
      "title": "When Did the Medieval Period End?",
      "type": "story",
      "url": "https://www.historytoday.com/archive/head-head/when-did-medieval-period-end"
    },
    {
      "by": "thenaturalist",
      "descendants": 0,
      "id": 31346451,
      "score": 1,
      "text": "Hi HN crowd,<p>asking out of curiosity and in searching for a potential solution to the mess that is the YT frontpage content reco algorithm. Is it bad for others as well? If so what could be the cause? Has anyone found an alternative to discovering good content?<p>For a bit of context I am typically logged in with a Google account in all browsers I use YT with. I have 5 private playlists with just a few videos each, ca. 30 subscribed channels (mix of coding, comedy, news, bands, woodworking).<p>I do watch YT videos frequently, and in the past quarter have mostly watched videos of US or German comedy, woodworking and of course news and longer political discussions or tactical analysis on the war in Ukraine.<p>I can safely say that my frontpage does not reflect my viewing history. The videos recommended are often far out of context, vary greatly in topical focus and age demographic. It&#x27;s gotten so bad the recommendations drive me away from opening YT and I try to use Reddit as a frontend to videos. In my experience it has a much higher signal to noise ratio and much better clustering in terms of topic and demographic of the content. I generally discover new and interesting videos I wouldn&#x27;t have otherwise.<p>Let me give you some specific examples on what lands on my YT frontpage:<p>- &quot;Random&#x2F; Out of the box&quot;: My frontpage regularly recommends low quality produced (German) video channels ranging from gangster rapper music or lifestyle videos to scripted reality shows a la BigBrother, to early twenties couple vlogs. Regular recos around soccer, Formula1, white dude luxury car channels. Recos for KPop or other music I have not watched videos on.\nI have 0 interest in any of this. None. And it is reflected in my viewing history. \nAlso now, in May, recos of Minecraft and other mass game Let&#x27;s Plays. I watch some Let&#x27;s Plays from two channels, generally in winter.<p>- &quot;One time channel&quot;: Sometimes I stumble across a new channel and watch one or a few videos. For example, the Austrian army has posted fantastic in-depth military analysis on the Ukraine war which all have several 100Ks of views. My front page is plastered with completely random (and old) videos from the channel of the Austrian army with views in the low thousands - for days.<p>- &quot;One time context&quot;: The other day, to relax after a longer day I watched something I never watched before: a livestream of birds. Never done it before nor do I think I will do it more regularly. I have recommendations for 10 different bird livestreams again for days after.<p>Initially to improve the situation I tried to play nice and flagged videos as uninteresting or excluded the entire channel from recos. None of this has any noticeable effects, the patterns described above keep repeating. Tune the frontpage, hit reload, full of bad results from the three categories above again.<p>I would assume there are all the ingredients needed to create much better recos.<p>Staying in the example of the channel of the Austrian army, a super simple algo could be:\n1. This channel contains several recent videos with view counts several standard deviations above the median view count per video. This account hasn&#x27;t watched all of them yet, let&#x27;s recommend those. \n2. Let&#x27;s go through the topical graph of viewers of videos from 1. and check for channels with view counts in a similar ballpark range, similar length (and maybe recency) and recommend those.<p>I would be really interested in discovering good stuff on YT which I assume exists givent the scale of the platform.<p>Does YT have to deal with &quot;too much&quot; data, i.e. there are just so many features and such a gigantic variety of content that their reco models simply cannot cope and the output is a generalized &quot;one size fits all&quot; reco that just has a little bit of everything?<p>Also if anyone has a strategy or tips for finding great content beyond using Subreddits, I would be really, really interested.",
      "time": 1652306590,
      "title": "Ask HN: What is happening with YouTube's recommendation algorithm?",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31346409,
      "score": 1,
      "time": 1652306315,
      "title": "AMD Secure Processor for Confidential Computing Security Review [pdf]",
      "type": "story",
      "url": "https://storage.googleapis.com/gweb-uniblog-publish-prod/documents/AMD_GPZ-Technical_Report_FINAL_05_2022.pdf"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31346384,
      "score": 2,
      "time": 1652306176,
      "title": "On-device voice control on Sonos speakers",
      "type": "story",
      "url": "https://tech-blog.sonos.com/posts/on-device-voice-control-on-sonos-speakers/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31346369,
      "score": 1,
      "time": 1652306050,
      "title": "Changes in the global hydrological cycle and rainfall patterns",
      "type": "story",
      "url": "https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000029"
    },
    {
      "by": "timmytokyo",
      "descendants": 0,
      "id": 31346363,
      "score": 1,
      "time": 1652306021,
      "title": "The Crash of Crypto's Perpetual Wealth Machine",
      "type": "story",
      "url": "https://nymag.com/intelligencer/2022/05/the-crash-of-cryptos-perpetual-motion-machine.html"
    }
  ]
}