{
  "stories": [
    {
      "by": "fspacef",
      "descendants": 0,
      "id": 28346186,
      "score": 1,
      "time": 1630240236,
      "title": "Biden to attend dignified transfer at Dover Air Force Base",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/29/politics/biden-dover-afghanistan-service-members-killed/index.html"
    },
    {
      "by": "asicsp",
      "descendants": 0,
      "id": 28346176,
      "score": 1,
      "time": 1630240174,
      "title": "Reverse engineering software licencing from early-2000s abandonware – Part 1",
      "type": "story",
      "url": "https://yingtongli.me/blog/2021/08/29/drm5-1.html"
    },
    {
      "by": "simplegeek",
      "descendants": 0,
      "id": 28346158,
      "score": 2,
      "time": 1630239972,
      "title": "Work-life balance: A perspective from one of the finest sportsmen",
      "type": "story",
      "url": "https://wyounas.com/2021/08/work-life-balance-a-perspective-from-one-of-the-finest-sportsmen/"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 28346133,
      "score": 2,
      "time": 1630239706,
      "title": "China's Nightmare: Meet the Fearsome Nimitz-Class Carriers",
      "type": "story",
      "url": "https://nationalinterest.org/blog/reboot/chinas-nightmare-meet-fearsome-nimitz-class-carriers-192431"
    },
    {
      "by": "fspacef",
      "descendants": 0,
      "id": 28346126,
      "score": 1,
      "time": 1630239665,
      "title": "Police raid unearths prehistoric flying reptile in remarkable condition",
      "type": "story",
      "url": "https://www.cnet.com/news/police-raid-unearths-prehistoric-flying-reptile-in-remarkable-condition/"
    },
    {
      "by": "JoshuaWisdom",
      "descendants": 0,
      "id": 28346106,
      "score": 1,
      "time": 1630239485,
      "title": "Ask HN: Any startup that allows founders to hire experts and pay with equity?",
      "type": "story"
    },
    {
      "by": "nsomaru",
      "descendants": 0,
      "id": 28346090,
      "score": 1,
      "time": 1630239274,
      "title": "Encrypted devices unravel knots of worldwide organised crime",
      "type": "story",
      "url": "https://www.dailymaverick.co.za/article/2021-08-28-no-business-like-blow-business-encrypted-devices-unravel-knots-of-worldwide-organised-crime/"
    },
    {
      "by": "tkiolp4",
      "descendants": 0,
      "id": 28346085,
      "score": 2,
      "text": "Been working as a developer for enough time to put on my CV the word “senior”, and I’m looking for another gig. My usual tactic when finding a new job is:<p>- play their game: do countless interviews (phone, hangouts, pair programming, you name it)\n- excel in each part of the interview \n- once they know I’m a good fit for their company, I ask more than they usually pay for whatever the role I am applying for. Sometimes I ask for more vacation days or other similar perks<p>Now, I have to say that my tactic has worked out so far so good. Recently, though, I have been hitting a wall: oncall rotations. I reject any kind of work besides the usual 9-5; it’s nonnegotiable for me. I don’t need more money (it’s not that I’m earning a lot either), but even if I would needed it, I would prefer to work “harder” (smarter?) during the usual 9-5 hours.<p>The stress of potential incidents occurring during the night or on weekends gives me anxiety and no amount of money can fix that. Unfortunately, companies these days require senior software engineers to be oncall from time to time because, well, their culture says so, or something like that (“In this company every team owns their products from conception to deployment and maintenance. We expect from engineers to have a business mindset, to be proficient using a variety of tech stacks, and to be there to keep the software up and running in case of unexpected failure”).<p>Is this a trend or I just got bad luck in my recent findings?",
      "time": 1630239193,
      "title": "Ask HN: I can’t do oncall rotations. Am I done as a SE?",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28346082,
      "score": 1,
      "time": 1630239158,
      "title": "Freelance Falcon – Easiest way to create an agreement for website or software",
      "type": "story",
      "url": "https://www.freelancefalcon.com/"
    },
    {
      "by": "daviddisco",
      "descendants": 0,
      "id": 28346044,
      "score": 2,
      "time": 1630238723,
      "title": "Banach-Tarski and the Paradox of Infinite Cloning",
      "type": "story",
      "url": "https://www.quantamagazine.org/how-a-mathematical-paradox-allows-infinite-cloning-20210826/"
    }
  ]
}