{
  "stories": [
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30600636,
      "score": 1,
      "time": 1646751838,
      "title": "Senators look to lock down Russia's gold reserves",
      "type": "story",
      "url": "https://www.axios.com/scoop-senators-look-to-lock-down-russias-gold-reserves-04c6c7bb-cc32-4e72-981e-fa972c31a1a4.html"
    },
    {
      "by": "blackbrokkoli",
      "descendants": 0,
      "id": 30600622,
      "score": 1,
      "text": "Hi HN,<p>a while ago I discovered a problem with problem with personal productivity tools: Every time you find a tool that works well in one regard (say, habit tracking), you neglect your previously working systems (say, your to do list system).<p>So I set about to build a system which unifies all the different aspects of personal productivity. Everything is represented in cards (like flash cards) which are defined in Markdown. The following types of cards exist:<p>* <i>Learning</i>: Classic front&#x2F;back prompts to memorize things. Think &quot;What is the capital of Argentina?&quot; on the front and &quot;Buenos Aires&quot; on the back. Works with a spaced repetition algorithm so time between prompts is optimized.<p>* <i>Habits</i>: Recurring actions you want to do - you can set the frequency individually. For example &quot;Stand up and walk around your room&quot; every two hours.<p>* <i>Checks</i>: Recurring prompts, similar to habits, but always questions referring to the past. For example a daily &quot;Did you drink enough today?&quot; prompt<p>* <i>To do</i>: One time actions that are deleted upon completion.<p>* <i>Reading List</i>: Used for books, articles, talks etc. There are always a limited number of reading list items active, which will prompt you to read a page a day until you are done with the given book.<p>* <i>Other</i>: Everything else - interesting websites, quotes, art or even memes that you will occasionally see.<p>The idea is that there is a single queue for all types of cards, only ever showing you one item that&#x27;s due next - whether habit, learning prompt or a random note. This prevents choice fatigue, the dread of lengthy to-do lists and the boredom of endless dry learning prompts.<p>I&#x27;ve been using the app successfully for myself for quite some time now but would love external feedback. You can check it out at https:&#x2F;&#x2F;kaado.io. It&#x27;s currently completely free (and in fairly early stage development). Simple email signup is needed but you won&#x27;t get any unprompted mails.<p>Apart from that I would love your takes and ideas regarding personal productivity and what works for you.",
      "time": 1646751758,
      "title": "Show HN: Kaado.io – Unifying Personal Productivity",
      "type": "story"
    },
    {
      "by": "Friday_",
      "descendants": 0,
      "id": 30600616,
      "score": 1,
      "time": 1646751708,
      "title": "White Noise Improves Learning",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/24345178/"
    },
    {
      "by": "thomasyoung99",
      "descendants": 0,
      "id": 30600615,
      "score": 1,
      "time": 1646751707,
      "title": "QuizBreaker – icebreaker quizzes for your team",
      "type": "story",
      "url": "https://www.quizbreaker.com"
    },
    {
      "by": "jorangreef",
      "descendants": 0,
      "id": 30600602,
      "score": 1,
      "time": 1646751650,
      "title": "Flexible Quorums for Better SuperBlock Resiliency",
      "type": "story",
      "url": "https://twitter.com/TigerBeetleDB/status/1501207802072780812"
    },
    {
      "by": "galaxyLogic",
      "descendants": 0,
      "id": 30600582,
      "score": 2,
      "time": 1646751538,
      "title": "Tinder “Feedback Loop” Forces Men and Women into Extreme Strategies",
      "type": "story",
      "url": "https://www.technologyreview.com/2016/07/15/158803/how-tinder-feedback-loop-forces-men-and-women-into-extreme-strategies/"
    },
    {
      "by": "madamdo",
      "descendants": 0,
      "id": 30600570,
      "score": 1,
      "time": 1646751477,
      "title": "Inspiring Women in Tech",
      "type": "story",
      "url": "https://twitter.com/se_unlocked/status/1501196533244600329"
    },
    {
      "by": "arifszn",
      "descendants": 1,
      "id": 30600568,
      "kids": [
        30600571
      ],
      "score": 2,
      "text": "ezProfile is an easy-to-customize personal dev portfolio builder that is created with React.js. When you manage the code in a GitHub repository, it will automatically render a webpage with the owner&#x27;s profile information, including a photo, bio, and public repositories. Also, it includes space to highlight your details, job history, education history, skills, and recent blog posts.<p>https:&#x2F;&#x2F;github.com&#x2F;arifszn&#x2F;ezprofile",
      "time": 1646751464,
      "title": "Kickstart your personal portfolio with GitHub API and blog",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30600539,
      "score": 3,
      "time": 1646751254,
      "title": "Lead Exposure in Last Century Shrunk IQ Scores of Half of Americans",
      "type": "story",
      "url": "https://today.duke.edu/2022/03/lead-exposure-last-century-shrunk-iq-scores-half-americans"
    },
    {
      "by": "jasim",
      "descendants": 0,
      "id": 30600525,
      "score": 4,
      "time": 1646751223,
      "title": "WebGPU – All of the cores, none of the canvas – surma.dev",
      "type": "story",
      "url": "https://surma.dev/things/webgpu/"
    }
  ]
}