{
  "stories": [
    {
      "by": "intellaughs",
      "descendants": 0,
      "id": 27986504,
      "score": 1,
      "time": 1627493398,
      "title": "Biologists suppressed alcoholism in mice with a mixture of two drugs",
      "type": "story",
      "url": "https://freenews.live/biologists-from-the-united-states-suppressed-alcoholism-in-mice-with-a-mixture-of-two-drugs/"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 27986476,
      "score": 1,
      "time": 1627493349,
      "title": "An Introduction to Cache-Oblivious Data Structures",
      "type": "story",
      "url": "https://rcoh.me/posts/cache-oblivious-datastructures/"
    },
    {
      "by": "ycnews",
      "descendants": 0,
      "id": 27986393,
      "score": 1,
      "time": 1627493031,
      "title": "Benchmarking the Beast (nim-lang.org and rust-lang)",
      "type": "story",
      "url": "https://nim-lang.org/blog/2021/07/28/Nim-Efficient-Expressive-Elegant-Benchmarking.html"
    },
    {
      "by": "teddyh",
      "descendants": 0,
      "id": 27986386,
      "score": 1,
      "time": 1627493012,
      "title": "Elastic tabstops – a better way to indent and align code",
      "type": "story",
      "url": "https://nickgravgaard.com/elastic-tabstops/"
    },
    {
      "by": "okl",
      "descendants": 0,
      "id": 27986385,
      "score": 2,
      "time": 1627493010,
      "title": "Worse Is Better",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Worse_is_better"
    },
    {
      "by": "kfiven",
      "descendants": 0,
      "id": 27986376,
      "score": 1,
      "time": 1627492984,
      "title": "Show HN: A web-based matrix client: Cinny",
      "type": "story",
      "url": "https://github.com/ajbura/cinny/releases/tag/v1.0.0"
    },
    {
      "by": "est31",
      "descendants": 0,
      "id": 27986370,
      "score": 2,
      "time": 1627492957,
      "title": "Stack Overflow not reachable via IPv6",
      "type": "story",
      "url": "https://meta.stackoverflow.com/a/348224"
    },
    {
      "by": "davidajackson",
      "descendants": 0,
      "id": 27986336,
      "score": 1,
      "text": "Blocktimize (https:&#x2F;&#x2F;www.blocktimize.io&#x2F;) is a no-code web app that allows you to connect your smart contracts to your servers and analytics services in less than 5 minutes.<p>Using blocktimize, you can receive:<p>1. Webhooks for smart contract events, instead of having to write event parsing code in your server.<p>2. Have events formatted and sent directly to analytics services like Amplitude. Events are segmented by user wallet, so you can create retention and user funnels for your Defi application. Use this to measure analytics, optimize costs, and focus on building instead of writing boilerplate code.<p>3. Receive Daily or Weekly reports on your smart contracts.<p>You can use Blocktimize for Ethereum mainnet contracts by going to blocktimize.io<p>To use blocktimize on the Ropsten testnet, create an account on testblocktimize.io<p>The first month on Blocktimize is totally free, provided you are running low traffic connections! I will reach out if you’ve spun up higher traffic connection(s), so don’t worry about going overboard. After that, we can work out affordable pricing on a 1 on 1 basis, based on API + node usage.<p>You can also use Blocktimize to extract analytics and data on ERC20 tokens&#x2F;services. This can allow you to see trends before others.<p>For questions or feedback, please email david@blocktimize.io<p>Are you an investor and interested in this product? Email me at david@blocktimize.io<p>Are you building smart contract products and need general or consulting help? Always happy to talk about architectural or code-level decisions — I’ve been a smart contract engineer for multiple YC companies and focus on fintech.",
      "time": 1627492789,
      "title": "Show HN: Blocktimize – Connect Smart Contracts to Servers and Analytics",
      "type": "story"
    },
    {
      "by": "nyx",
      "descendants": 0,
      "id": 27986316,
      "score": 1,
      "time": 1627492675,
      "title": "From Stolen Laptop to Inside the Company Network",
      "type": "story",
      "url": "https://dolosgroup.io/blog/2021/7/9/from-stolen-laptop-to-inside-the-company-network"
    },
    {
      "by": "Wowfunhappy",
      "descendants": 0,
      "id": 27986290,
      "parts": [
        27986291,
        27986292,
        27986293,
        27986294,
        27986295,
        27986296,
        27986297
      ],
      "score": 1,
      "text": "For all the talk about remote work on HN, I was curious how many people&#x27;s companies have actually changed their policies!<p>Please vote based on your current company&#x27;s pre-pandemic and post-pandemic policies, for people in your position. In other words, if you quit your job at Remote Work Skeptics Inc last December for a new position at Remote Work Rules LLC, please choose &quot;My job was fully remote before the pandemic&quot;, and not &quot;rarely remote &#x2F; fully remote&quot;.<p>(My reasoning for doing it this way: some people may be planning to switch jobs, and some plans will pan out, and others won&#x27;t. Both questions are interesting, but I had to pick one, and this seemed more reliable.)",
      "time": 1627492590,
      "title": "Poll: Remote work changes at your company",
      "type": "poll"
    }
  ]
}