{
  "stories": [
    {
      "by": "branko_d",
      "descendants": 0,
      "id": 31100079,
      "score": 1,
      "time": 1650475023,
      "title": "Psychology “Incompatible with Hypothesis-Driven Theoretical Science”",
      "type": "story",
      "url": "https://www.madinamerica.com/2022/04/psychology-incompatible-hypothesis-driven-theoretical-science/"
    },
    {
      "by": "jensneuse",
      "descendants": 0,
      "id": 31100061,
      "score": 2,
      "time": 1650474939,
      "title": "API Design Best Practices for Long-Running Operations: GraphQL vs. REST",
      "type": "story",
      "url": "https://wundergraph.com/blog/api_design_best_practices_for_long_running_operations_graphql_vs_rest"
    },
    {
      "by": "webscout",
      "descendants": 0,
      "id": 31100060,
      "score": 1,
      "time": 1650474936,
      "title": "Amazon's main European retail business reports $1.26B of losses in 2021",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-04-20/amazon-europe-unit-paid-no-taxes-on-55-billion-sales-in-2021"
    },
    {
      "by": "yminsky",
      "descendants": 0,
      "id": 31100023,
      "score": 2,
      "time": 1650474792,
      "title": "State Machine Replication, and Why You Should Care",
      "type": "story",
      "url": "https://signalsandthreads.com/state-machine-replication-and-why-you-should-care/"
    },
    {
      "by": "skanderbm",
      "descendants": 0,
      "id": 31100022,
      "score": 1,
      "time": 1650474788,
      "title": "Proper Breathing Brings Better Health",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/proper-breathing-brings-better-health/"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 31100011,
      "score": 2,
      "time": 1650474723,
      "title": "A university pays $400K to professor who refused to use a student's pronouns",
      "type": "story",
      "url": "https://www.npr.org/2022/04/20/1093601721/shawnee-state-university-lawsuit-pronouns"
    },
    {
      "by": "datproto",
      "descendants": 1,
      "id": 31099993,
      "kids": [
        31100042
      ],
      "score": 1,
      "text": "Hey HN,<p>this is my first post on HN. After reading many posts and submits as well as success stories, I thought to give this a shot.<p>Situation is the following: \nMy team and I are hacking away different projects for a couple of years by now. We have been active primarily in the Gaming and Esport Market and build products for problems we were seeing. In September&#x2F; October 2021 we went ahead and entered the Blockchain Crazyness (investors since 2016, but going full-time from a business&#x2F; entrepreneurial perspective in 2021).<p>We started off with a NFT project and, being very community driven, had the community vote on the chain we will be launching on. This vote ended us being voted on Hedera HashGraph, a Top 30 Blockchain with NFT Infrastructure in Place since about 6 months. Hedera is a Distributed Ledger Technology and is traded among the best chains when it comes to fast transactions and environment friendliness.\nTo give the NFTs more utility, we&#x27;ve started building up the first NFT Marketplace on Hedera HashGraph. Quickly, we&#x27;ve reached almost a thousand users and a couple of thousands revenue generated.<p>While we said mentally goodbye to VCs after former products and with the beauty of the blockchain ecosystem (we are crowdfunding with NFTs, early investors are sort-of early backers), this changed: We talked to one single VC and got a termsheet on our table.<p>After discussing it team internally, if we want to go that route, we decided to do it. If we say yes to something, we are doubling down on that like crazy. We are working non-stop and keep building and shipping.<p>What a bummer it was, after we crashed through the Tech Due Dilligence, reason for that: We do not have a Computer Science graduate on the team.<p>We have been presented a timeline that we need to find a Technical Co-Founder until next Monday (5 days from writing) to have that deal working. While finding Co-Founders is sometimes difficult, we were thinking about the old Brian Armstrong, finding his Co-Founders only few hours before joining YC. Great companies are build by the madness of time constraint sometimes. Thus, this post.<p>We are looking for a Technical Co-Founder ASAP.<p>Few details: \nYou should be able to build WebApplications, our techstack is React and Typescript. \nBlockchain Knowledge is appreciated, but not required. \nWe are based in Berlin, Germany - being in similar timezones (+-3 hours) is benefitial, but not required.<p>To us: \nWe are having a large vision, building the whole NFT Infrastructure for Hedera (think OpenSea, RarityTools, Icy.Tools, NFTBank - together)\nWe are hardworking and ultra-commited\nWe know what we are doing but never stop learning\nWe are building user-centric and community-first<p>If this sounds interesting to you and you want to join a venture-backed startup, please reach out via the mail in my profile and we schedule a meeting ASAP.<p>Fingers crossed!",
      "time": 1650474659,
      "title": "Looking for Technical Co-Founder ASAP",
      "type": "story"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 31099982,
      "score": 2,
      "time": 1650474607,
      "title": "The war in Ukraine is changing – and the West now faces a stark choice",
      "type": "story",
      "url": "https://www.cbc.ca/news/politics/ukraine-russia-zelensky-putin-mariupol-1.6423886"
    },
    {
      "by": "petepete",
      "descendants": 0,
      "id": 31099973,
      "score": 1,
      "time": 1650474573,
      "title": "A History of Eve Database Server Hardware",
      "type": "story",
      "url": "https://www.eveonline.com/news/view/a-history-of-eve-database-server-hardware"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 31099970,
      "score": 2,
      "time": 1650474561,
      "title": "Applied Materials: America's Biggest Semiconductor Equipment Maker",
      "type": "story",
      "url": "https://asianometry.substack.com/p/applied-materials-americas-biggest"
    }
  ]
}