{
  "stories": [
    {
      "by": "justinzollars",
      "descendants": 0,
      "id": 31886259,
      "score": 1,
      "time": 1656266551,
      "title": "Hourly Electric Grid Monitor",
      "type": "story",
      "url": "https://www.eia.gov/electricity/gridmonitor/dashboard/electric_overview/US48/US48"
    },
    {
      "by": "shubhamjain",
      "descendants": 0,
      "id": 31886256,
      "score": 2,
      "time": 1656266545,
      "title": "Why Paul Graham Is Wrong About Choosing an Esoteric Language (2018)",
      "type": "story",
      "url": "https://shubhamjain.co/2018/12/01/why-paul-graham-wrong/"
    },
    {
      "by": "alibova",
      "descendants": 0,
      "id": 31886231,
      "score": 1,
      "text": "I&#x27;ve written up a few projects for the Twilio blog (https:&#x2F;&#x2F;www.twilio.com&#x2F;blog&#x2F;author&#x2F;acohen) but the majority of my projects aren&#x27;t Twilio related, is there something like that (not just a personal blog) for random fun side projects? I usually make a combination of hardware and software (programmable robot for toddlers, automatic reader bee for baby, etc.)",
      "time": 1656266391,
      "title": "Ask HN: Where do you publish projects?",
      "type": "story"
    },
    {
      "by": "LordNibbler",
      "descendants": 0,
      "id": 31886228,
      "score": 1,
      "time": 1656266375,
      "title": "Algolens – Algorithm Lessons",
      "type": "story",
      "url": "https://algolens.xyz/"
    },
    {
      "by": "WorldDev",
      "descendants": 0,
      "id": 31886227,
      "score": 1,
      "text": "I am looking for the most secure browser for daily  browsing. Excluding any other parameter like privacy or functionality.<p>Chrome : the privacy breaches seem to be large enough to actually become a security threat as well. Is that a fair statement?<p>Firefox : seemed pretty good to me until I read this article https:&#x2F;&#x2F;madaidans-insecurities.github.io&#x2F;firefox-chromium.html. It claims that Firefox is more insecure than Chrome&#x2F;Chromium, in large part because of a weaker sandboxing mechanism. Even if this mechanism seems to be catching up, this points to a significant lag in Firefox&#x27;s security<p>Safari : is it secure?<p>Chromium : it seems to be the best bet to me, because it seems to contain the best security mechanisms, without the Google spyware. However:\n    1) it does not seem to provide an automatic update system\n    2) I read that it&#x27;s unstable because it contains bleeding edge code. That actually sounds like it&#x27;s less safe than chrome because of that =&gt; is there a way to know which Chromium version Chrome is using, and just using this version?<p>I am grateful for any thoughts.",
      "time": 1656266374,
      "title": "Ask HN: Most Secure Browser? Chromium?",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31886181,
      "score": 1,
      "time": 1656266130,
      "title": "Democracy Under Attack: Challenges of Addressing Ethical Issues of AI, Big Data",
      "type": "story",
      "url": "https://www.frontiersin.org/articles/10.3389/fpos.2021.682945/full"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 31886168,
      "score": 1,
      "time": 1656266042,
      "title": "The Five-Paragraph Fetish",
      "type": "story",
      "url": "https://aeon.co/essays/writing-essays-by-formula-teaches-students-how-to-not-think"
    },
    {
      "by": "thewebcount",
      "descendants": 1,
      "id": 31886161,
      "kids": [
        31886193
      ],
      "score": 1,
      "text": "I have an HBOMax account that was previously associated with my Gmail account. I stopped using my Gmail account several years ago and thought I had switched all of my services over to the new account. Going through my password manager, I realized that because of the name change from HBO Go to HBOMax I missed it and had never switched over my HBO account.<p>So I logged in with my old info and changed my address to my new one. I suddenly started receiving emails about new shows that I have no interest in. The emails have no unsubscribe link in them. I went back to the site to turn off all emails, and it turns out you can&#x27;t turn off emails from HBOMax, only from their &quot;partners&quot; (which I have done). I further discovered that the account for that email isn&#x27;t actually how I get HBOMax. I get it through my cable provider. When I log in with my (formerly) Gmail account, it tells me I don&#x27;t have a subscription. So now I&#x27;d just like to delete the account since I don&#x27;t want emails from them and it&#x27;s not associated with my actual ability to watch their shows. Searching their FAQs, there appears to be no way to delete your account and no way to turn off emails from them.<p>I&#x27;ve found various &quot;How To Delete Your HBOMax Account&quot; articles online (all of them terrible) [0], but the links they say to click on don&#x27;t exist anywhere on the web site anymore (at least coming from Safari on my Mac). Furthermore, they talk about first cancelling your subscription, but as mentioned, this account doesn&#x27;t actually have a subscription, so I can&#x27;t even perform that step. They also mention emailing your username <i>and password</i> to the help email, but that sounds like a terrible idea. There&#x27;s a phone number to call, but I don&#x27;t want to have to deal with a &quot;retention specialist&quot;, though maybe the fact that I&#x27;m not currently subscribed through that email and am not canceling my other subscription would help?<p>Has anyone successfully canceled their HBOMax account, and if so, what did it take?<p>[0]https:&#x2F;&#x2F;donotpay.com&#x2F;learn&#x2F;how-to-delete-hbo-max-account&#x2F;",
      "time": 1656266014,
      "title": "Ask HN: How to Delete an HBOMax Account?",
      "type": "story"
    },
    {
      "by": "mrcslws",
      "descendants": 0,
      "id": 31886144,
      "score": 1,
      "time": 1656265888,
      "title": "Bayesian Optimization Is More Basis-Dependent Than You Might Think",
      "type": "story",
      "url": "https://probablymarcus.com/blocks/2022/06/26/gaussian-processes-basis-dependent.html"
    },
    {
      "by": "e-clinton",
      "descendants": 0,
      "id": 31886136,
      "score": 1,
      "text": "With Roe v. Wade being reversed, it had me wondering: if “life” begins at conception, shouldn’t we get a social security number and tax benefits at conception? Perhaps a passport be required for traveling abroad? Why should we differentiate between in and out of utero?<p>Hoping for a philosophical discussion, not a political one.",
      "time": 1656265857,
      "title": "More Rights for the Unborn?",
      "type": "story"
    }
  ]
}