{
  "stories": [
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 29431072,
      "score": 1,
      "time": 1638545239,
      "title": "How to Become a Crypto Person: A Normie’s Guide",
      "type": "story",
      "url": "https://nymag.com/intelligencer/article/crypto-nft-twitter-discord-guide.html"
    },
    {
      "by": "retskrad",
      "descendants": 0,
      "id": 29431069,
      "score": 1,
      "time": 1638545206,
      "title": "Intel Eager to Avoid Clashes with Apple as It Looks to Secure TSMC's 3nm Chips",
      "type": "story",
      "url": "https://www.macrumors.com/2021/12/03/intel-tsmc-closer-ties-3nm-avoid-apple-clash/"
    },
    {
      "by": "akshay_s",
      "descendants": 0,
      "id": 29431055,
      "score": 1,
      "time": 1638545157,
      "title": "Show HN: Built a GitHub star ranking app for public repositories",
      "type": "story",
      "url": "https://app.tooljet.io/applications/github-star-ranking"
    },
    {
      "by": "gokulprabh",
      "descendants": 0,
      "id": 29431044,
      "score": 7,
      "text": "Hi Hacker News! We’re Gokul, Dhanush, and Pete from Demigod (<a href=\"https:&#x2F;&#x2F;apps.apple.com&#x2F;us&#x2F;app&#x2F;demigod&#x2F;id1501287553\" rel=\"nofollow\">https:&#x2F;&#x2F;apps.apple.com&#x2F;us&#x2F;app&#x2F;demigod&#x2F;id1501287553</a>). We were inspired by atomic habits to build a system for progressing towards your goals.<p>We help you be more effective with your time by adding habits and tasks to your calendar. We pair that with data reports, sharing with friends, and a professional coach in the loop to review and reset goals.<p>While working on an earlier version of our startup with unstructured time, ambitious goals, and an uncertain path, we realized getting started and being consistent with creative projects is daunting. We needed a system to guarantee consistent progress and avoid random procrastinating. We found James Clear’s Atomic Habits [1] and it just clicked.<p>With the pandemic and shutdown, everyone’s regular routines were thrown off. We were forced to think about what we had been doing and if it resonated with our real goals versus what addiction engineering [2] was prescribing. We took the chance to rebuild our system with intention.<p>We’re starting with the Calendar (a first order approximation of how you spend your time). We’re adding levers to make it easy to be intentional with your time and hit goals. We begin by prompting you to plan your day. We add weekly data summaries with habit progress data to help  visualize progress. We also include friend challenges and completion wagers for accountability. Finally, we offer a weekly call with a coach to review your data and plan your next week. (<a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;qKqGLhOZmfE\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;qKqGLhOZmfE</a>)<p>Setting goals, seeing progress, and making material changes to your external reality are crucial for your wellbeing. This is how we&#x27;ve designed the experience:<p>Step 1: Describe your objectives - Set up comfortable daily flow (personalized onboarding call available)  \nStep 2: Add your calendar - Link all of your calendar account and swipe through your day with the slick controls\nStep 3: Add habits you want to cultivate - for example: sleep schedule, reading, meditation, deep work&#x2F;emails, exercise, planning sessions, or just having free time.\nStep 4: Make them easy - Start with the smallest unit of progress for each habit you create. Shape your environment, stack habits, and reward completions. \nStep 5: Set up your system - Add you friends for accountability to build durable streaks. Weekly check-ins to increment, decrement, remove, or create habits. Easy resets for when you fall off.<p>Our first engineering challenge was adding complex metrics for goal tracking into a functional calendar. Our vision for the future is that everyone will have a context aware conversational assistant that is proactive rather than reactive. We think that the rapid advances in generative language models like GPT-3 will power a new way of interacting with our data and devices.<p>We’re excited to share what we’ve been building with you! We want to hear about the systems you use to get organized and stay productive. Let us know any other thoughts or ideas, and we’ll be active in the comments today.<p>[1] <a href=\"https:&#x2F;&#x2F;expertprogrammanagement.com&#x2F;2018&#x2F;11&#x2F;book-summary-atomic-habits-clear&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;expertprogrammanagement.com&#x2F;2018&#x2F;11&#x2F;book-summary-ato...</a><p>[2] <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;naval&#x2F;status&#x2F;1084739181593559040?s=20\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;naval&#x2F;status&#x2F;1084739181593559040?s=20</a>",
      "time": 1638545096,
      "title": "Launch HN: Demigod (YC S19) – Build compounding habits with a dedicated coach",
      "type": "story"
    },
    {
      "by": "marvindanig",
      "descendants": 0,
      "id": 29431018,
      "score": 1,
      "time": 1638544955,
      "title": "EndOffice – Colocated Personal Cloud",
      "type": "story",
      "url": "https://endoffice.com/index.html"
    },
    {
      "by": "hlenke",
      "descendants": 0,
      "id": 29431010,
      "score": 2,
      "time": 1638544923,
      "title": "Show HN: A small utility to generate the web vitals you want",
      "type": "story",
      "url": "https://github.com/checkly/vitals-tester"
    },
    {
      "by": "4monthsaway",
      "descendants": 0,
      "id": 29431003,
      "score": 1,
      "time": 1638544855,
      "title": "On Going Viral",
      "type": "story",
      "url": "https://jjpryor.substack.com/p/a-pryor-life-42-on-going-viral"
    },
    {
      "by": "JoshuaMulliken",
      "descendants": 0,
      "id": 29431000,
      "score": 1,
      "time": 1638544845,
      "title": "Intercepting SSL Pinned Connections on Android",
      "type": "story",
      "url": "https://mulliken.net/blog/intercepting-ssl-pinned-connections-on-android"
    },
    {
      "by": "JumpCrisscross",
      "descendants": 0,
      "id": 29430962,
      "score": 2,
      "time": 1638544656,
      "title": "BuzzFeed Suffers Wave of SPAC Investor Withdrawals Before Going Public",
      "type": "story",
      "url": "https://www.wsj.com/articles/buzzfeed-suffers-wave-of-spac-investor-withdrawals-before-going-public-11638472756"
    },
    {
      "by": "openmmlab",
      "descendants": 1,
      "id": 29430950,
      "kids": [
        29430951
      ],
      "score": 2,
      "time": 1638544598,
      "title": "MMHuman3D",
      "type": "story",
      "url": "https://github.com/open-mmlab/mmhuman3d"
    }
  ]
}