{
  "stories": [
    {
      "by": "iberinger",
      "descendants": 0,
      "id": 31456570,
      "score": 1,
      "time": 1653126410,
      "title": "Traffic Congestion and City Design",
      "type": "story",
      "url": "https://caseyhandmer.wordpress.com/2022/05/21/traffic-congestion-and-city-design/"
    },
    {
      "by": "Thystler",
      "descendants": 0,
      "id": 31456564,
      "score": 1,
      "text": "Hi,<p>I am looking for people who want to grow and build an incentivized community with me that aims to fundamentally change the way that we work. Core DAO is in the early stages of development at the moment and we are looking for people who want to join the pilot program. Core DAO is a network of people working on projects (Creating products, Creating websites, hugging people…etc) in which the funds generated by the projects are spread fairly to the people who contributed value to the project.<p>Users within the network can slip in and out of projects allowing them to always grow and provide a more specialized service. Users providing their services get paid in a combination of two assets; a stable coin backed by local currencies (USD, RUP, EUR), as well as stake in the project, worked on. Stake in a project pays off in the long term because every time the project makes money the stakeholders are rewarded. This leads to passive income which could set stakeholders up for long-term financial security. Finally, Core DAO would make it possible to work with a wide variety of highly qualified professionals from across the world, with incredibly flexible hours and being able to work from home.<p>Users more committed to individual projects benefit from the use of Core as they have access to a large skill pool which requires less upfront capital (pay people at stake). This skill pool can scale and de-scale quickly as workers are not under contract. The paying of dividends results in aligned objectives of committed and non-committed users as both want the project to succeed.<p>All of this results in highly competitive projects which are able to efficiently scale, require less capital to start and motivate collaboration. Growth is no longer incentivized if it comes at the cost of lots of labor as any further labor performed lowers the payout per unit of stake. This means that businesses will try to keep their work low and their value high resulting in highly automated, lean projects that are sustainable. Lastly, as the network grows projects will interact with the services and needs of other projects creating a highly interconnected web of value creation.<p>The collaborative nature of Core requires transparency and democracy. Each of these principles is baked into the foundation of the network. The way that Core develops is voted on by the community and aimed at making this the workplace of the future. Any transactions can be verified and are posted publicly making the identification of bad eggs within the system simple and incentivized.<p>The Core pilot program invites up to 3 people to join core early and have a hands-on role in developing a system that provides the labourer with the means of production. The programme would begin onboarding in early June. The initial pilots would set up their own projects, collaborate on other projects for the stake, and have other people join them on their projects. I am looking for people who are passionate about making the world a more beautiful and nicer place.<p>I know that you will bring great work, creativity, and community to the Core network, and would love to see you there. If you are interested send me a DM!<p>Best Regards,\nAnton",
      "time": 1653126370,
      "title": "Pilot program for decentralized builder community (MAX 3 people)",
      "type": "story"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 31456557,
      "score": 2,
      "time": 1653126239,
      "title": "Techno-Globalism, Content Moderation, and Decentralization",
      "type": "story",
      "url": "https://themarkup.org/mark-as-read/2022/05/20/techno-globalism-content-moderation-and-decentralization"
    },
    {
      "by": "yeputons",
      "descendants": 0,
      "id": 31456550,
      "score": 2,
      "time": 1653126088,
      "title": "Language Design in the Real World",
      "type": "story",
      "url": "https://blog.sigplan.org/2022/05/19/language-design-in-the-real-world/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31456528,
      "score": 1,
      "time": 1653125714,
      "title": "iGPU Cache Setups Compared, Including M1",
      "type": "story",
      "url": "https://chipsandcheese.com/2022/05/21/igpu-cache-setups-compared-including-m1/"
    },
    {
      "by": "URfejk",
      "descendants": 0,
      "id": 31456521,
      "score": 1,
      "time": 1653125604,
      "title": "Russian nuclear-capable missiles seen moving in video to Finland border",
      "type": "story",
      "url": "https://nationalpost.com/news/russian-nuclear-capable-missiles-seen-moving-in-video-to-finland-border"
    },
    {
      "by": "aarobot",
      "descendants": 0,
      "id": 31456518,
      "score": 1,
      "time": 1653125575,
      "title": "Dumb Laws (USA, 2011) [pdf]",
      "type": "story",
      "url": "https://forestgrove.pgusd.org/documents/Computer-Lab/Strange-State-Laws.pdf"
    },
    {
      "by": "wg0",
      "descendants": 0,
      "id": 31456487,
      "score": 1,
      "text": "I read Wireguard white paper lately and later discovered tailscale. This Software defined Networking&#x2F;VPN kind of domain was really interesting to me and upon exploring further, I came across following interesting projects:<p>- tailscale (WireGuard)<p>- innernet (Wireguard)<p>- headscale (Wiregarud, control server for tailscale)<p>- nebula<p>- ZeroTier (virtual ethernet)<p>- weron (WebRTC for SDN)<p>What other interesting SDN&#x2F;VPN projects are out there that you find very interesting&#x2F;magical?<p>(edit to fix formatting)",
      "time": 1653125130,
      "title": "Ask HN: Interesting SDN/VPN Projects?",
      "type": "story"
    },
    {
      "by": "donttellmom",
      "descendants": 1,
      "id": 31456463,
      "kids": [
        31456574
      ],
      "score": 2,
      "text": "I made a landing page for my startup, and I&#x27;ve so many things to do, so I&#x27;d prefer to save up energy and not setup Mailgun, a separate db table for emails, form validation and all that. Maybe there is a service that provides an iframe for email submission so that I could slap it on my landing page, and get my future users&#x27; emails in Airtable or something?",
      "time": 1653124732,
      "title": "Ask HN: Is there a web app to collect emails?",
      "type": "story"
    },
    {
      "by": "my123",
      "descendants": 0,
      "id": 31456450,
      "score": 2,
      "time": 1653124617,
      "title": "Running PyTorch on the M1 GPU",
      "type": "story",
      "url": "https://sebastianraschka.com/blog/2022/pytorch-m1-gpu.html"
    }
  ]
}