{
  "stories": [
    {
      "by": "yvana",
      "descendants": 0,
      "id": 30943680,
      "score": 1,
      "text": "Novas equipes são recebidas no ambiente virtual em planta real do escritório da companhia reproduzida no metaverso<p>São Paulo, 04 de abril de 2022 – A Semantix, primeira plataforma SaaS integrada de dados da América Latina, promove uma experiência digital a quem chega para atuar na empresa: o Onboarding é totalmente realizado no Metaverso, em ambiente que reproduz a estrutura do prédio físico da companhia na cidade de São Paulo. Além disso, os novos integrantes podem interagir em uma cidade com perspectivas que facilitam a interação com escritórios de clientes da companhia.\n“O Metaverso é muito atual e faz parte de nossa rotina. Em um mundo cada vez mais híbrido, esse é um lugar que vai além de um espaço virtual de trabalho, e passa a ser um ponto de conexão e relacionamento”, afirma Enio Moraes, Data Operations Director da Semantix. \nNo Metaverso, as equipes têm acesso aos links de intranet, canais privados de áudios em salas exclusivas, interagem com palmas ou outros gestos e também podem escolher avatares que os representam, assim como valorizam causas de diversidade e inclusão. “O avatar pode ser parecido com quem você é fisicamente, mas podem ter características de representatividades como portadores de deficiência física em cadeiras de rodas, pessoas com vitiligo ou como LGBTIA+”, explica Rafael Nicoletti, programador analista da Semantix. \nA tecnologia não é recente. A expressão foi cunhada pelo escritor Neal Stephenson em seu romance de 1992, “Snow Crash”. Depois, Ernest Cline usou o mesmo conceito para criar o Oásis em seu romance “Ready Player One”, que virou filme de Steven Spielber. A disrupção digital acelerada pela pandemia nos últimos dois anos consagrou o Metaverso como opção para que as corporações mantivessem um relacionamento próximo entre seus times e seus clientes. \nNovas profissões já estão se desenhando e se valorizando no mercado, garante Enio. Projetistas 3D, metaverse builder, entre outras, devem se fortalecer no mercado, e a Semantix acompanha os avanços com novos produtos em tecnologia. “Nossa solução em Metaverso é acessível para qualquer pessoa, com requisitos mínimos para funcionamento em qualquer desktop.<p>Sobre a Semantix\nFundada em 2010, a Semantix  é uma empresa brasileira na América Latina especializada em big data, analytics e inteligência artificial, com atuação na América Latina e nos Estados Unidos por meio de escritórios em São Paulo (matriz), Miami, Cidade do México e Bogotá. A marca possui mais de 300 clientes em mais de 20 países atendendo as necessidades analíticas de empresas no varejo, financeiro, saúde, telecomunicações e indústria 4.0.<p>Informações para a Imprensa: Vianews Hotwire\nJoseane Carmo – (11) 99112-2580 | joseane.carmo@vianews.com.br\nYvana Crizanto – (91) 98138-7691 | yvana.crizanto@vianews.com.br",
      "time": 1649335489,
      "title": "Semantix inova com Onboarding no Metaverso",
      "type": "story"
    },
    {
      "by": "flomo101",
      "descendants": 0,
      "id": 30943676,
      "score": 1,
      "time": 1649335483,
      "title": "Show HN: flomo-A free API-based tool to fast capture and review ideas via TG",
      "type": "story",
      "url": "https://flomoapp.com/?language=en"
    },
    {
      "by": "dmitrytsepelev",
      "descendants": 0,
      "id": 30943641,
      "score": 2,
      "time": 1649335193,
      "title": "Why Ruby Has Symbols",
      "type": "story",
      "url": "https://dmitrytsepelev.dev/why-has-ruby-symbols"
    },
    {
      "by": "alexrustic",
      "descendants": 0,
      "id": 30943601,
      "score": 1,
      "time": 1649334872,
      "title": "Expanding Play’s Target Level API Requirements to Strengthen User Security",
      "type": "story",
      "url": "https://android-developers.googleblog.com/2022/04/expanding-plays-target-level-api-requirements-to-strengthen-user-security.html"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 30943590,
      "score": 3,
      "time": 1649334810,
      "title": "The Chinese Room Thinks",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2022/04/the-chinese-room-thinks.html"
    },
    {
      "by": "haack",
      "descendants": 0,
      "id": 30943569,
      "score": 2,
      "time": 1649334601,
      "title": "Improbable raises US$150m to establish a metaverse network",
      "type": "story",
      "url": "https://www.improbable.io/blog/improbable-raises-usd150m-to-establish-metaverse-network-and-ecosystem/"
    },
    {
      "by": "iamacyborg",
      "descendants": 0,
      "id": 30943568,
      "score": 1,
      "time": 1649334596,
      "title": "Marketing and the Modern Data Stack",
      "type": "story",
      "url": "https://www.jacquescorbytuech.com/writing/marketing-modern-data-stack"
    },
    {
      "by": "throwlllllllll",
      "descendants": 0,
      "id": 30943556,
      "score": 1,
      "text": "Mentors have helped many of us succeed, and I want to create more opportunities to pay it forward. I have found supporting juniors very fulfilling.\nAre you interested in serving as a mentor?\nAre you ready to commit an hour a week to helping a junior?<p>Please comment with any stories about mentorship, requests, offers, etc.\nThis is a temperature check before I set up something more formal.",
      "time": 1649334515,
      "title": "Ask HN: Interested in mentorship? Building community, paying it forward",
      "type": "story"
    },
    {
      "by": "Overtonwindow",
      "descendants": 3,
      "id": 30943530,
      "kids": [
        30943658,
        30943553,
        30943617
      ],
      "score": 2,
      "text": "I’ve seen quite a bit of discussion on inflation, as a result of an increased supply of money in the system. Some have suggested that the stimulus checks increased the supply of money which may have, in part, led to inflation. I’m curious, if the government instituted a universal basic income, would this lead to inflation?",
      "time": 1649334379,
      "title": "Would a universal basic income lead to inflation?",
      "type": "story"
    },
    {
      "by": "jeremylevy",
      "descendants": 0,
      "id": 30943526,
      "score": 1,
      "time": 1649334353,
      "title": "A complete computer science study plan to become a software engineer",
      "type": "story",
      "url": "https://github.com/jwasham/coding-interview-university"
    }
  ]
}