{
  "stories": [
    {
      "by": "OrderOfChaos",
      "descendants": 0,
      "id": 31901846,
      "score": 1,
      "time": 1656369600,
      "title": "How to Weigh Truth with a Balance Scale",
      "type": "story",
      "url": "https://www.quantamagazine.org/puzzles-on-weighing-truth-with-a-balance-scale-20220627/"
    },
    {
      "by": "codingsett",
      "descendants": 0,
      "id": 31901843,
      "score": 1,
      "time": 1656369590,
      "title": "Qwik: Front end framework reimagined for the edge",
      "type": "story",
      "url": "https://qwik.builder.io"
    },
    {
      "by": "mezod",
      "descendants": 0,
      "id": 31901828,
      "score": 1,
      "time": 1656369501,
      "title": "Ask HN: What are you currently excited about?",
      "type": "story"
    },
    {
      "by": "charxyz",
      "descendants": 0,
      "id": 31901819,
      "score": 1,
      "text": "The rare occasions I interact with other developers, I tend to leave with a few new ideas and&#x2F;or tools to add to my workflow. However, these conversations are pretty hard to come by since I work remotely and my company is relatively small. How do you handle networking and natural conversation with other developers &#x2F; engineers?",
      "time": 1656369441,
      "title": "Ask HN: How do you network with other developers?",
      "type": "story"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 31901747,
      "score": 1,
      "time": 1656369091,
      "title": "Building a NanoPi M4V2 Based All-in-One Linux PC Running Armbian (Ubuntu/Debian)",
      "type": "story",
      "url": "https://www.cnx-software.com/2022/01/24/building-nanopi-m4v2-all-in-one-linux-pc-running-armbian-ubuntu-debian/"
    },
    {
      "by": "eslaught",
      "descendants": 1,
      "id": 31901726,
      "kids": [
        31901830
      ],
      "score": 1,
      "text": "Hi HN,<p>This has been bugging me for a while. We&#x27;ve got things like GPT-3 that can apparently create text out of whole cloth, and tools like Google Docs that provide the ability to complete sentences with the context of previous words before you even type the next word. And yet the swype-style completion on my smartphone continues to be consistently terrible.<p>As an example, just moments ago I was trying to type &quot;about&quot;, and none of the completion options started with &quot;a&quot; or ended with &quot;t&quot;, let alone resembled the semantic meaning of &quot;about&quot;. And this is not an infrequent occurrence for me; I probably get at most 85-90% accuracy on a good day. That means I&#x27;m missing a word almost every sentence, and the typos are so far off from what I intended that I often don&#x27;t even remember what I intended if I don&#x27;t stop immediately to fix them.<p>Maybe I just type poorly, but I&#x27;d think even a relatively poor input (with the context of previous words) would be good enough to make a pretty accurate keyboard.<p>Does anyone else have this experience? Any ideas why the state of practice isn&#x27;t more advanced at this point?<p>For reference: I&#x27;m on a Pixel device with stock Android keyboard, fully updated. But my experiences have generally been similar on other devices I&#x27;ve used.",
      "time": 1656368978,
      "title": "Ask HN: Why is mobile keyboard completion so bad?",
      "type": "story"
    },
    {
      "by": "mwcampbell",
      "descendants": 0,
      "id": 31901725,
      "score": 2,
      "time": 1656368974,
      "title": "Accessibility in Fedora Workstation",
      "type": "story",
      "url": "https://fedoramagazine.org/accessibility-in-fedora-workstation/"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 31901681,
      "score": 3,
      "time": 1656368726,
      "title": "Socially isolated people have differently wired brains and poorer cognition",
      "type": "story",
      "url": "https://theconversation.com/socially-isolated-people-have-differently-wired-brains-and-poorer-cognition-new-research-185150"
    },
    {
      "by": "samemail88",
      "descendants": 1,
      "id": 31901654,
      "kids": [
        31901812
      ],
      "score": 3,
      "text": "I&#x27;m curious if there are any technology based non-profits that are cater to direct consumers where their primary business is a website&#x2F;web business. The biggest one I can think of is Wikipedia; they are successful and have a very popular set of websites. Mozilla is another successful non-profit, but its primary business is not a website but a web application (Firefox). I&#x27;m not sure if Patreon is a non-profit or community benefit corporation. Do you know any others?",
      "time": 1656368563,
      "title": "Ask HN: Are there any successful Tech non-profits?",
      "type": "story"
    },
    {
      "by": "novateg",
      "descendants": 2,
      "id": 31901646,
      "kids": [
        31901701
      ],
      "score": 4,
      "text": "Today the first day of summer vacation. My kids, son and daughter decided to sell water in our front-yard. We bought 32 pack of water for $6.52. They sold each bottle for 50 cents. 20 bottles were sold on the first day, they decided to donate 30% of the revenue. I&#x27;m so proud!",
      "time": 1656368540,
      "title": "Tell HN: How to Start a Business as a Kid",
      "type": "story"
    }
  ]
}