{
  "stories": [
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 31847416,
      "score": 1,
      "time": 1655982284,
      "title": "Dolt Is Git for Data",
      "type": "story",
      "url": "https://github.com/dolthub/dolt"
    },
    {
      "by": "throwaway4good",
      "descendants": 0,
      "id": 31847413,
      "score": 1,
      "time": 1655982258,
      "title": "US Sanctions Help China Supercharge Its Chipmaking Industry",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-06-20/us-sanctions-helped-china-supercharge-its-chipmaking-industry"
    },
    {
      "by": "thematrixturtle",
      "descendants": 0,
      "id": 31847406,
      "score": 1,
      "time": 1655982192,
      "title": "The tale of a whale who took Solend’s money",
      "type": "story",
      "url": "https://amycastor.com/2022/06/20/the-tale-of-a-whale-who-took-solends-money/"
    },
    {
      "by": "hellokittycity",
      "descendants": 0,
      "id": 31847399,
      "score": 4,
      "time": 1655982153,
      "title": "A Brief History of Media – Can You Always Trust Media?",
      "type": "story",
      "url": "https://dailyedit.com/blog/a-brief-history-of-media-can-you-always-trust-media/"
    },
    {
      "by": "vonadz",
      "descendants": 0,
      "id": 31847397,
      "score": 1,
      "time": 1655982148,
      "title": "Show HN: Grow your newsletter audience fast and free with cross promotions",
      "type": "story",
      "url": "https://crosspromote.io/"
    },
    {
      "by": "limoce",
      "descendants": 0,
      "id": 31847376,
      "score": 1,
      "time": 1655981909,
      "title": "CCZoo provides confidential computing solutions based on Intel SGX, TDX, HEXL",
      "type": "story",
      "url": "https://github.com/intel/confidential-computing-zoo"
    },
    {
      "by": "firstSpeaker",
      "descendants": 0,
      "id": 31847360,
      "score": 1,
      "time": 1655981816,
      "title": "The World Will Store 200 Zettabytes of Data by 2025",
      "type": "story",
      "url": "https://cybersecurityventures.com/the-world-will-store-200-zettabytes-of-data-by-2025/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31847355,
      "score": 1,
      "text": "Normally I am pretty ok in doing tests, but I was told this was a 3 hour test. I believe I am reasonably good at the technologies used. I believe it is probably a day or maybe two days.<p>Build a styled select drop down component in React, you are not allowed to use a component library.<p>Code should production ready. They will check both usability and technical aspects of solution. Include unit tests and keyboard navigation.<p>Of course should include readme instructing how to run and reasons for things etc.<p>The drop down is not going to just work with a select box but is going to have to be HTML mimicking select because the entries in the select all have styled fonts and different icons before each entry etc.<p>Up Down arrow on right end of select to show when select box Open Closed.<p>Left hand of entry in dropdown has icon, right entry has two lines of person being searched for - top line name bottom line job title.<p>on click event in search field, see full list of managers in dropdown, otherwise hidden.<p>two people are shown at a time, the rest can be scrolled to.<p>you should be able to search to filter and get people in this dropdown.<p>People are filtered on both first and last name.<p>filtering is case insensitive.<p>Filtering can happen across names so if you search for nras, bryan rasmussen should show up.<p>Bonus - when user clicks selection the dropdown closes and the name is in the select box.<p>Bonus - Selections navigable with up down keys.<p>On Blur: drop down closes but the last entered value is still in the search box.<p>on Focus: dropdown shown with available people matching the filter in the search field.<p>Data to populate field is in a json format that should be requested not hard coded in solution.<p>actually thinking about it again, and needing to be production ready, the search rules etc. probably 3 days.",
      "time": 1655981787,
      "title": "Ask HN: How Many hours would you rate this test",
      "type": "story"
    },
    {
      "by": "throwaway4good",
      "descendants": 0,
      "id": 31847349,
      "score": 1,
      "time": 1655981740,
      "title": "Samsung reportedly holding 50M unsold phones at distributors",
      "type": "story",
      "url": "https://www.androidauthority.com/samsung-unsold-phones-3178597/"
    },
    {
      "by": "simple_ton",
      "descendants": 0,
      "id": 31847344,
      "score": 1,
      "time": 1655981717,
      "title": "How to Plan the Architectural Attributes?",
      "type": "story",
      "url": "https://kalali.blog/2022/06/software-architecture-attributes-how-to-decide/"
    }
  ]
}