{
  "stories": [
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 30421421,
      "score": 1,
      "time": 1645481942,
      "title": "Trump’s Truth Social App Launches Without a Social Network",
      "type": "story",
      "url": "https://nymag.com/intelligencer/2022/02/trumps-truth-social-app-launches-without-a-social-network.html"
    },
    {
      "by": "sbmthakur",
      "descendants": 0,
      "id": 30421401,
      "score": 1,
      "time": 1645481840,
      "title": "Examine why HashMap is slow (2015)",
      "type": "story",
      "url": "https://github.com/vavr-io/vavr/issues/571"
    },
    {
      "by": "mrzool",
      "descendants": 0,
      "id": 30421399,
      "score": 1,
      "time": 1645481833,
      "title": "I have no capslock and I must scream",
      "type": "story",
      "url": "https://memex.marginalia.nu/log/48-i-have-no-capslock.gmi"
    },
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 30421370,
      "score": 1,
      "text": "Everywhere I travel, people everywhere have the same concerns: earn enough money, raise a family, enjoy life. They don’t want these conflicts. So why does it happen?<p>The Russian security council has just unanimously voted to recognize the Russian-speaking breakaway regions of Ukraine as independent. While it’s tempting for many to explain it all as “Putin is behind every decision in Russia and eveyone is a puppet”, this is a more serious situation. What was Putin suppossed to do, ignore them? When the US congress pushed Obama to intervene in Syria, or pushed Trump slap sanctions on Russia, they resisted for a while. But the problem is actually far deeper and more systemic. Almost always, is the combination of two things that lead to escalating conflicts in the world:<p>1) A discrete (usually binary) choice between status A and B for people on the ground<p>2) An absurd concentration of power in a state, federation, corporate industry, etc.<p>Together, they use mass media to pit regular people against each other on one or another side of an issue, keeping them divided rather than working together to fix the system upstream.<p>I have written about it in many areas of life, and once you see it, you can’t unsee it (links in the comments below)<p><pre><code>  Factory Farming [1]\n  Plastic [1]\n  Fossil Fuels [1]\n  Vaccines [1]\n  Party Poliics [2]\n  Presidential Elections [2]\n  Net Neutrality [3]\n  Women in Tech [4]\n  Israeli-Palestinian Conflict [5]\n</code></pre>\nI could go on… but let me just suggest an obvious solution. Make a UN treaty (like nuclear non-proliferation) committing to gradual transitioning to a system where each region could vote for its membership in neighboring states, and the results would be continuous, eg 30% membership in A, 60% in B, and 10% in a nascent independent state C. This would be reflected in regional arrangements. Separatists among Tamil Tigers, PKK, PLO, Hamas, Catalonians, Kurds, would have had less to fight about.<p>As it is, systems resist change and people are pushed by mass media and culture to ostracize those who push for the system to change, as “traitors” who ”side with the enemy”. Meanwhile, by insisting on 1) consensus on discrete outcomes and 2) concentrations of power on both sides, they just paint themselves into a corner, and could lead to nuclear armaggedon. All for what? The inability to improve the current international system.<p>(1 and 2 is also, incidentally, why blockchains don’t scale as well as almost all other Internet protocols).",
      "time": 1645481731,
      "title": "Tell HN: How to Fix the International System",
      "type": "story"
    },
    {
      "by": "VHRanger",
      "descendants": 0,
      "id": 30421346,
      "score": 1,
      "time": 1645481627,
      "title": "John Conway: The Free Will Lectures",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tmx2tpcdKZY"
    },
    {
      "by": "dxbydt",
      "descendants": 0,
      "id": 30421262,
      "score": 1,
      "time": 1645481186,
      "title": "Chessle",
      "type": "story",
      "url": "https://jackli.gg/chessle/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30421246,
      "score": 1,
      "time": 1645481132,
      "title": "Study shows journalists tend to temper–not exaggerate–scientific claims",
      "type": "story",
      "url": "https://phys.org/news/2022-02-journalists-tend-tempernot-exaggeratescientific.html"
    },
    {
      "by": "brundolf",
      "descendants": 0,
      "id": 30421225,
      "score": 1,
      "text": "I&#x27;m interested in using Cloudflare to serve up some code modules for others to download. I&#x27;m having some difficulty figuring out which product I should be looking at; I&#x27;m not even 100% sure that Cloudflare is where I should be looking in the first place:<p>- R2 is supposed to be their version of S3. But the materials are focused on storing large blobs, etc, which sounds like it might be overkill. I also would want my resources to end up on a CDN, and I don&#x27;t know if R2 is the route you&#x27;re supposed to take for that.<p>- Pages: obviously intended for serving a static site, but I&#x27;m wondering if it could be used&#x2F;would make sense to use for smallish non-web text files<p>- Cloudflare CDN: it&#x27;s hard to tell whether this is something you use directly, or whether it gets layered on top of other things like Pages and R2. It has some sort of API, but I couldn&#x27;t find anything in the docs about how to &quot;just upload a file&quot;.<p>This isn&#x27;t really my area so any help is appreciated. Just want to serve up some files, distribute them via CDN, and occasionally push up new ones from CI.",
      "time": 1645481024,
      "title": "Ask HN: Cloudflare for Hosting Code Files?",
      "type": "story"
    },
    {
      "by": "prostoalex",
      "descendants": 1,
      "id": 30421210,
      "kids": [
        30421329
      ],
      "score": 1,
      "time": 1645480941,
      "title": "Rents reach 'insane' levels across US with no end in sight",
      "type": "story",
      "url": "https://apnews.com/article/business-lifestyle-us-news-miami-florida-a4717c05df3cb0530b73a4fe998ec5d1"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30421204,
      "score": 2,
      "time": 1645480914,
      "title": "Play Money and Reputation Systems",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/play-money-and-reputation-systems"
    }
  ]
}