{
  "stories": [
    {
      "by": "Tozen",
      "descendants": 0,
      "id": 31586233,
      "score": 1,
      "time": 1654108750,
      "title": "Elon Musk to Employees: 'Remote Work Is No Longer Acceptable",
      "type": "story",
      "url": "https://gizmodo.com/elon-musk-tesla-return-to-work-remote-work-1849000568"
    },
    {
      "by": "maverick2007",
      "descendants": 0,
      "id": 31586232,
      "score": 1,
      "time": 1654108741,
      "title": "Spanish government proposes law banning automated customer service",
      "type": "story",
      "url": "https://www.euronews.com/2022/05/31/spanish-government-proposes-law-banning-automated-customer-service"
    },
    {
      "by": "synack",
      "descendants": 0,
      "id": 31586222,
      "score": 1,
      "time": 1654108703,
      "title": "DCPU-16 assembly programming puzzles",
      "type": "story",
      "url": "https://dcpu16.pages.dev/"
    },
    {
      "by": "throwaway888abc",
      "descendants": 0,
      "id": 31586221,
      "score": 1,
      "time": 1654108702,
      "title": "Lago, the Open Source Stripe Billing Alternative",
      "type": "story",
      "url": "https://www.getlago.com/"
    },
    {
      "by": "tommywg7",
      "descendants": 0,
      "id": 31586140,
      "score": 1,
      "time": 1654108392,
      "title": "Elon asks Tesla employees to return to office or quit",
      "type": "story",
      "url": "https://finance.yahoo.com/news/musk-memo-tesla-staff-return-122137034.html"
    },
    {
      "by": "lizimo",
      "descendants": 0,
      "id": 31586103,
      "score": 2,
      "time": 1654108256,
      "title": "ArcadeDB – Multi-Model Database Supporting Graphs, KV, Documents and Time-Series",
      "type": "story",
      "url": "https://arcadedb.com/"
    },
    {
      "by": "ChadNauseam",
      "descendants": 0,
      "id": 31586077,
      "score": 1,
      "text": "I&#x27;ve been diagnosed with ADHD, but I don&#x27;t like Adderall much because when I come down I get very irritable.<p>I&#x27;ve been able to manage it and be productive of work, but I get distracted so often that I end up having to &quot;work&quot; 10 hours a day to get a few hours of actual work done.<p>I&#x27;ve recently started taking Modafinil, and it works much better and with way fewer sides than Adderall, but I don&#x27;t want to take it more than once a week because I&#x27;m afraid of tolerance. From [0]:<p>&gt; Anecdotally, the real troll under the bridge for modafinil seems to be that one can develop tolerance, where it no longer has the stimulant or anti-sleep effects that made it so awesome (it has been speculated to be related to liver metabolism). For example, poker player Paul Phillips took 2-300mg daily for a long period and said the effects “have attenuated over time. The body is an amazing adjusting machine, and there’s no upside that I’ve been able to see to just taking more.” (Such comments are common online among those who have used modafinil heavily, to the point where I have successfully predicted tolerance for such users, and I carefully avoid using modafinil more than weekly, if that.) The lack of academic support for these observations of tolerance is a little strange—users hardly have any incentive to make up downsides about their favorite drug.<p>But Modafinil makes me so much more productive that it&#x27;s easily the best day of my week when I take it. I get all my work done in a normal amount of time and then I have plenty of time at the end of the day to relax and hang out with my friends and family. I&#x27;m really desperate for a way to have that level of productivity without medication. Does anyone have any advice?<p>[0]: https:&#x2F;&#x2F;www.gwern.net&#x2F;Modafinil#tolerance",
      "time": 1654108179,
      "title": "Ask HN: How to Deal with ADHD?",
      "type": "story"
    },
    {
      "by": "stevekemp",
      "descendants": 0,
      "id": 31586076,
      "score": 1,
      "time": 1654108174,
      "title": "Show HN: A collection of sysadmin utilities, in a single binary",
      "type": "story",
      "url": "https://github.com/skx/sysbox"
    },
    {
      "by": "night-rider",
      "descendants": 2,
      "id": 31586066,
      "kids": [
        31586216,
        31586134
      ],
      "score": 1,
      "text": "As I understand it, cable trunk lines are easy to intercept, but what about Musk’s Starlink? Is it a burden to intercept or even easier? I ask because he made a joke about CIA surveillance recently.",
      "time": 1654108141,
      "title": "Ask HN: Is Starlink secure against eavesdropping?",
      "type": "story"
    },
    {
      "by": "babak_ap",
      "descendants": 0,
      "id": 31586063,
      "score": 2,
      "time": 1654108135,
      "title": "101.0 Firefox Release Notes",
      "type": "story",
      "url": "https://www.mozilla.org/en-US/firefox/101.0/releasenotes/"
    }
  ]
}