{
  "stories": [
    {
      "by": "ohiovr",
      "descendants": 0,
      "id": 29324997,
      "score": 1,
      "text": "These are things the Romans are experts at:<p>wheat flour - bakers were some of the highest paid tradesmen, Rome thought often of bread. Wheat flour is a toughener. Gluten when mineralized, fossilized, and hardened is very tough.<p>ash – fossilizer they lived in a volcanic region<p>slacked lime and concentrated urea (like mule urine) – hardener and calcifier<p>porous volcanic rock filler – makes it more economical, it improves compressive strength<p>red cabbage juice – neutrality indicator – an emperor once abdicated his throne to grow cabbages.<p>water - They were on a long thin peninsula and watched water a lot<p>The preparation process:<p>Add 1 parts slacked lime 4 parts sifted, Italian volcanic ash to enough water to make a crumbly paste in the mixer.  Add enough durum wheat flour in the mixer to make a heavy rustic dough consistency. Mix in some porous rock. It will begin to harden all by itself so don’t let it stand too long.  Quickly add and mix enough urea to make cabbage test water blue. Test every 10th of the way. Add enough water now to make a workable cookie dough consistency mix (with the chunks of rock in there). Pour and shape into your form.<p>Explanation:<p>Urea is toxic to life because it aids calcification. https:&#x2F;&#x2F;atlasofscience.org&#x2F;urea-is-truly-toxic-the-empire-strikes-back&#x2F;<p>Calcium supplies the mineralization process via quicklime. Durum wheat flour has a lot of gluten in it that get denatured by urea and mineralized by quicklime. It is then fossilized by the ash. Gluten when turned into rock is very tough and hard. For even harder and more durable concrete use collagen instead of durum wheat flour or to a degree as economics afford. You must use durum wheat flour, no other flour will work. Durum flour is the bare minimum protein ratio flour you may use. Adding gluten flour may enhance toughness. Unfortunately for us as we age, aragonite crystals grow in Cartilage causing arthritis but calcium transposition in denatured protein can make exceptional concrete. And Co2 gas neutral to boot.<p>This is very expensive concrete however it will last longer than you will if you get the technique right. The great wall of china was mortared in rice and roman concrete is even better!<p>[ this is a hoax, how do you know I’m right? ]",
      "time": 1637710492,
      "title": "Show HN: Recipe for Roman Concrete",
      "type": "story"
    },
    {
      "by": "gilad",
      "descendants": 0,
      "id": 29324964,
      "score": 1,
      "time": 1637710248,
      "title": "Tiptop – Command-line system monitoring",
      "type": "story",
      "url": "https://github.com/nschloe/tiptop"
    },
    {
      "by": "dhosek",
      "descendants": 0,
      "id": 29324963,
      "score": 2,
      "time": 1637710247,
      "title": "Something interesting: Two sides of a story",
      "type": "story",
      "url": "https://dahosek.substack.com/p/something-interesting-eda"
    },
    {
      "by": "SQL2219",
      "descendants": 0,
      "id": 29324866,
      "kids": [
        29324994
      ],
      "score": 1,
      "time": 1637709816,
      "title": "US to Require Vaccines for All Border Crossers in January",
      "type": "story",
      "url": "https://www.usnews.com/news/politics/articles/2021-11-23/us-to-require-vaccines-for-all-border-crossers-in-january"
    },
    {
      "by": "cocked_pistol",
      "descendants": 0,
      "id": 29324833,
      "score": 1,
      "time": 1637709611,
      "title": "Should the Fed IPO?",
      "type": "story",
      "url": "https://seekingalpha.com/article/4471621-bitcoin-and-cbdc-should-the-fed-ipo"
    },
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29324820,
      "score": 2,
      "time": 1637709527,
      "title": "Why I Will Never Have a Girlfriend",
      "type": "story",
      "url": "https://logological.org/girlfriend"
    },
    {
      "by": "bitbro",
      "descendants": 0,
      "id": 29324802,
      "score": 2,
      "time": 1637709422,
      "title": "Mediacloud: An open source news analysis platform",
      "type": "story",
      "url": "https://mediacloud.org"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29324783,
      "score": 1,
      "time": 1637709329,
      "title": "Napster v2.0 is now available (1999)",
      "type": "story",
      "url": "https://web.archive.org/web/19991012205725/http://napster.com/"
    },
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29324774,
      "score": 2,
      "time": 1637709278,
      "title": "Subpixel Text Encoding",
      "type": "story",
      "url": "http://www.msarnoff.org/millitext/"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 29324756,
      "score": 1,
      "time": 1637709198,
      "title": "DAOs, a Canon – Future",
      "type": "story",
      "url": "https://future.a16z.com/dao-canon/"
    }
  ]
}