{
  "stories": [
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 29444061,
      "score": 1,
      "time": 1638650073,
      "title": "NIST Recommends Steps to Boost Resilience of U.S. Timekeeping",
      "type": "story",
      "url": "https://www.nist.gov/news-events/news/2021/11/nist-recommends-steps-boost-resilience-us-timekeeping"
    },
    {
      "by": "Vanzi",
      "descendants": 0,
      "id": 29444049,
      "score": 1,
      "text": "This article is highly subjective, so please read with caution.\nHidden dangers are more dangerous than open fires, and thinking you&#x27;re safe is the least safe.\n12&#x2F;4&#x2F;2021 Telegram officially discontinued the old version of Client and required all third-party Clients to receive AD.\n9&#x2F;19&#x2F;2021 Telegram opened up groups with read records accurate to members (smaller groups)\netc.\nThese are signs that Telegram is opening up more resources to advertisers. Even though Pavel Durov says we don&#x27;t provide data to advertisers, it doesn&#x27;t mean that advertisers won&#x27;t collect it themselves?\nTelegram was scathing about Ghost Mode. It reported it to the point that the app was taken down from the Play Store, and even threatened developers with the deactivation of API_ID.\nThese are all signs that Telegram is not actively providing information, but constantly ensuring that it can be captured in large quantities by advertisers in an easier way.\nWhat&#x27;s the point of having reads like this when Telegram collects more and more bots and even users don&#x27;t even know who is there to collect them? It&#x27;s not even listed in the read history if it&#x27;s captured in a small group. In that case, what is the use of this feature? How is it different from Anom, except that it is convenient for advertisers and stalkers?\nTelegram&#x27;s online time privacy is even more funny, when speaking will become Online mode, this point is captured by the bot will not be able to get the user online time information?\nPavel Durov: No!\nWhatsApp at least shows where the information is going, WeChat at least knows it&#x27;s a Chinese product and is therefore wary of it.\nTelegram is doing something completely unprivate under the banner of privacy.\nWhatsApp and WeChat get the user&#x27;s device identification number, and Telegram does it too, and I don&#x27;t blame him for that, he can say it&#x27;s for user safety.\nWhatsApp and WeChat have asked for address book, Telegram also did, I do not blame him, he can say that the cell phone number is not for social?\nWhatsApp and WeChat have the ability to find friends by address, and Telegram does too, and I don&#x27;t blame him for that, he can say it&#x27;s convenient to find new friends.\nTo sum up: WhatsApp=WeChat=Telegram\nBut.\nTelegram&#x27;s main focus is privacy chat. Online time privacy set to No User, it does show to all people as Last seen recently, but once spoken again will become Online, for BOTs, got online information, however 1 BOT set to Everyone, but can see all users set to Everyone&#x27;s online information.\nSome groups can get read records, if the bot listens to enough (Telegram has many index bots, half of which are commercially run), is not the same as being able to post portraits of all members?\nTelegram&#x27;s security, on the other hand, is at the bottom of the list.\nThere may be errors or unclear logic in this article, feel free to tell me.",
      "time": 1638650021,
      "title": "I think Telegram is more dangerous than WhatsApp or even WeChat",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29444042,
      "score": 1,
      "time": 1638649954,
      "title": "Fraidycat",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zgA4GzRsldI"
    },
    {
      "by": "kvmxsh",
      "descendants": 0,
      "id": 29444005,
      "score": 1,
      "text": "I&#x27;m looking for a community where a bunch of people are working on their startups after work hours&#x2F;weekends, almost like a co-working space with a community feel - ideally people in their 20s&#x2F;30s. Does something like this exist in San Francisco?",
      "time": 1638649605,
      "title": "Ask HN:Does a startup community like this exist in SF?",
      "type": "story"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 29443979,
      "score": 1,
      "time": 1638649469,
      "title": "My Mid-Life Crisis M1 MacBook Pro",
      "type": "story",
      "url": "https://taoofmac.com/space/blog/2021/12/04/1950"
    },
    {
      "by": "gkop",
      "descendants": 0,
      "id": 29443977,
      "score": 1,
      "time": 1638649466,
      "title": "Better.com fired 900 workers after getting $750M from SoftBank",
      "type": "story",
      "url": "https://www.protocol.com/bulletins/better-com-layoffs"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29443976,
      "score": 1,
      "time": 1638649437,
      "title": "Sex Ratios at Birth Linked to Pollutants",
      "type": "story",
      "url": "https://www.the-scientist.com/news-opinion/sex-ratios-at-birth-linked-to-pollutants-69485"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 29443972,
      "score": 1,
      "time": 1638649393,
      "title": "Currency Converter: 1270–2017",
      "type": "story",
      "url": "https://www.nationalarchives.gov.uk/currency-converter/"
    },
    {
      "by": "lumenwrites",
      "descendants": 0,
      "id": 29443949,
      "score": 1,
      "time": 1638649190,
      "title": "Ask HN: What tech/startup-related newsletters are you subscribed to?",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29443945,
      "score": 1,
      "time": 1638649150,
      "title": "The Hierarchy of Cringe",
      "type": "story",
      "url": "https://aelkus.github.io/culture/2019/10/21/hierarchy-of-cringe.html"
    }
  ]
}