{
  "stories": [
    {
      "by": "jasbirb",
      "descendants": 0,
      "id": 29080595,
      "score": 1,
      "text": "Why this job’s a big deal:\nBuild the next exciting new product or feature that will ultimately help millions of people experience the world.<p>Our team of engineers, at all levels, work with the business leaders in defining the product roadmap and come up with innovative solutions to grow the future of travel. We design and develop our back end systems and REST APIs that serve hundreds of millions of searches a day, collecting and parsing data across thousands of partners to get the best deals for our customers.<p>In this role you will get to:\n• Drive mission critical projects with direct impact on the evolution of Priceline&#x27;s business.\n• Innovate with a cross-functional agile team that continuously experiments, iterates and delivers on new product objectives.\n• Showcase fluency and development skills of Core Java or similar programming languages.\n• Apply your programming skills towards building low latency and high throughput transactional services with continuous integration and automation testing.\n• Implement SQL composition skills that collects and queries data for investigation and analysis in real time from our applications.\n• Influence and communicate team development efforts. Influence what the best solutions are and communicate your findings to key business stakeholders.<p>Who you are: \n• Bachelor’s degree or higher in Computer Science or related field\n• 7+ years of experience in software engineering and development\n• Exceptional coding experience with Core Java \n• An interest in being a mentor and influencing best practices with less experienced developers.\n• Confident with the utilization of Spring Frameworks,  Web Services and APIs\n• Established and proven expertise with server side Javascript\n• An Influencer of the use of Git and Gitflow\n• Experience with developing on Cloud, especially GCP and AWS\n• Experience in Microservices, Kubernetes (GKE preferable), and Dockers\n• Proven ability in Design and Architecture of complex, highly scalable and performance driven applications<p>Who We Are:<p>WE ARE PRICELINE.\nOur success as one of the biggest players in online travel is all thanks to our incredible, dedicated team of talented employees. Priceliners are focused on being the best travel deal makers in the world, fueled by our passion to help everyone experience the moments that matter most in their lives. Whether it’s a dream vacation, your cousin’s graduation, or your best friend’s wedding – we make travel affordable and accessible to our customers.<p>Our culture is unique and inspiring (that’s what our employees tell us). We’re a grown-up, startup. We deliver the excitement of a new venture, without the struggles and chaos that can come with a business that hasn’t stabilized.  \nWe’re on the cutting edge of innovative technologies. We keep the customer at the center of all that we do. Our ability to meet their needs relies on the strength of a workforce as diverse as the customers we serve. We bring together employees from all walks of life and we are proud to provide the kind of inclusive environment that stimulates innovation, creativity and collaboration.<p>Priceline is part of the Booking Holdings, Inc. (Nasdaq: BKNG) family of companies, a highly profitable global online travel company with a market capitalization of over $80 billion. Our sister companies include Booking.com, BookingGo, Agoda, Kayak and OpenTable.<p>If you want to be part of something truly special, check us out!<p>Diversity, Equity and Inclusion – Our Commitment<p>Priceline ensures equal employment opportunity to all employees and applicants without discrimination or harassment based on race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions, or any other classification protected by governing law.",
      "time": 1635858329,
      "title": "Senior Java Engineer",
      "type": "story"
    },
    {
      "by": "chennaiapp",
      "descendants": 0,
      "id": 29080589,
      "score": 1,
      "time": 1635858287,
      "title": "Marketing Video Maker App",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=marketing.video.maker.rey&amp;hl=en_US&amp;gl=US"
    },
    {
      "by": "imsnif",
      "descendants": 0,
      "id": 29080561,
      "score": 2,
      "time": 1635858113,
      "title": "Anatomy of a Terminal Emulator",
      "type": "story",
      "url": "https://www.poor.dev/terminal-anatomy/"
    },
    {
      "by": "dougcalobrisi",
      "descendants": 0,
      "id": 29080505,
      "score": 1,
      "time": 1635857801,
      "title": "EDB Announces BigAnimal, PostgreSQL Database in the Cloud",
      "type": "story",
      "url": "https://www.enterprisedb.com/products/biganimal-cloud-postgresql"
    },
    {
      "by": "wagslane",
      "descendants": 0,
      "id": 29080487,
      "score": 1,
      "time": 1635857675,
      "title": "Product Managers Have Terrible Ideas",
      "type": "story",
      "url": "https://qvault.io/misc/the-best-product-managers-have-terrible-ideas/"
    },
    {
      "by": "tysone",
      "descendants": 0,
      "id": 29080484,
      "score": 3,
      "time": 1635857671,
      "title": "Facebook Makes Us Know Too Much About Each Other",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/01/opinion/facebook-social-media-problems.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29080479,
      "score": 1,
      "time": 1635857635,
      "title": "Notability Users Frustrated by Switch to Subscription Model",
      "type": "story",
      "url": "https://www.macrumors.com/2021/11/02/notability-users-frustrated-subscription-model/"
    },
    {
      "by": "fitzn",
      "descendants": 0,
      "id": 29080472,
      "score": 1,
      "time": 1635857602,
      "title": "Example of Selenium 4's BiDi Protocol",
      "type": "story",
      "url": "https://reflect.run/articles/selenium-4-events/"
    },
    {
      "by": "AuthorizedCust",
      "descendants": 0,
      "id": 29080398,
      "score": 1,
      "time": 1635857234,
      "title": "Pixel 6 review: Google Hardware finally lives up to its potential",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/11/pixel-6-review-google-hardware-finally-lives-up-to-its-potential/"
    },
    {
      "by": "mkeeter",
      "descendants": 0,
      "id": 29080360,
      "score": 2,
      "time": 1635857016,
      "title": "What Is the Inverse of a Vector?",
      "type": "story",
      "url": "https://mattferraro.dev/posts/geometric-algebra"
    }
  ]
}