{
  "stories": [
    {
      "by": "stickyricky",
      "descendants": 0,
      "id": 29183937,
      "score": 1,
      "text": "Forgive me if the following is treading over old ground.  I&#x27;m too afraid to google the keywords.<p>My mother posted an update on Instagram.  Shes on vacation in some beach town.  Because of this she tagged her location.  The location was weird.  It wasn&#x27;t &quot;Miami&quot; or &quot;Los Angeles&quot;.  Searching either of those tags reveals pages of adults doing adult things.  Typical Instagram content.<p>No the location was something like &quot;ABC Seaview Inlet&quot;.  I have no idea where that is so naturally I click it.  What do I find?  A page filled <i>exclusively</i> with underage girls in bikinis.  Some 15-16 but others much younger.  Possible 12.  Not a single picture of my mother who had tagged her location in several.<p>Now viewed in the right context, by family or friends, these photos would be acceptable.  Not something you would show your grandmother but not illegal.  And if you were on the beach that day you would of course have seen these girls in bikinis.  But there&#x27;s something deeply unsettling about indexing these young girls for the general public to see, collect, and interact with.  Anyone can comment on these photos and start an interaction with children.<p>I&#x27;m certain none of those girls wanted me, a 30 year old man, to see their vacation pictures.  Instagram&#x27;s default privacy settings should reflect that.  And further, Instagram should seek to reduce the total reach of an underage person so I (a person completely unrelated to them) can never see them.<p>Do you agree or am I over-reacting?",
      "time": 1636599296,
      "title": "Tell HN: Instagram is promoting inappropriate photos of underage girls",
      "type": "story"
    },
    {
      "by": "GaryTang",
      "descendants": 0,
      "id": 29183902,
      "score": 1,
      "time": 1636599070,
      "title": "DeSantis says he’ll send migrants to Delaware if any more are flown into FL",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10188293/Ron-DeSantis-says-send-migrants-Delaware-flown-Florida-secret-flights.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29183893,
      "score": 1,
      "time": 1636599020,
      "title": "NFT Artist Beeple Sells Latest Work for $29M at Auction",
      "type": "story",
      "url": "https://decrypt.co/85704/nft-artist-beeple-sells-latest-work-29-million-auction"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 29183892,
      "score": 2,
      "time": 1636599016,
      "title": "Would the world be better if it was run by teenagers?",
      "type": "story",
      "url": "https://www.bbc.com/news/business-59219148"
    },
    {
      "by": "prathyvsh",
      "descendants": 0,
      "id": 29183890,
      "score": 2,
      "time": 1636599000,
      "title": "Chu Spaces: A Visual Introduction",
      "type": "story",
      "url": "http://adelelopez.com/chu-are-you"
    },
    {
      "by": "amenghra",
      "descendants": 0,
      "id": 29183875,
      "score": 1,
      "time": 1636598855,
      "title": "ChaosDB Explained: Azure's Cosmos DB Vulnerability Walkthrough",
      "type": "story",
      "url": "https://www.wiz.io/blog/chaosdb-explained-azures-cosmos-db-vulnerability-walkthrough"
    },
    {
      "by": "BracketMaster",
      "descendants": 0,
      "id": 29183874,
      "score": 1,
      "text": "I have a lot of high end(recent) FPGAs and server blades sitting around that I can&#x27;t easily sell or give out...<p>I&#x27;m wondering what I should do with them instead of having them collect dust - if anyone has any ideas...<p>HN may actually not be the right place to ask, but I&#x27;m on HN fairly frequently - so I&#x27;d thought I&#x27;d give it a shot.",
      "time": 1636598839,
      "title": "Lots of FPGAs and Server Blades",
      "type": "story"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 29183852,
      "score": 1,
      "time": 1636598672,
      "title": "“Where’s My Swap Line?”: A Money View of International Lender of Last Resort [pdf]",
      "type": "story",
      "url": "https://www.bu.edu/gdp/files/2021/10/GEGI_WP_053_FIN.pdf"
    },
    {
      "by": "stevenhubertron",
      "descendants": 1,
      "id": 29183792,
      "kids": [
        29183870,
        29183802
      ],
      "score": 1,
      "text": "I recently moved to a new house that has a radon mitigation system that was poorly installed. For example there was no pit underneath the foundation just some gravel. I know this because I had a plumbing issue and had to rip up the floor. The system is still running, as well as a ventilation fan to clear the air by the boiler but my numbers in my basement are still generally above 4.0. I don’t want to pay someone to fix this because I’m pretty handy and want to fix it myself. Has anyone done this or have any pointers for what I can look at to learn more about effective ways to mitigate radon in an older home?",
      "time": 1636598228,
      "title": "DIY Radon Mitigation Strategies?",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29183786,
      "score": 2,
      "time": 1636598138,
      "title": "Origins of ‘Transeurasian’ languages traced to Neolithic millet farmers",
      "type": "story",
      "url": "https://www.theguardian.com/science/2021/nov/10/origins-of-transeurasian-languages-traced-to-neolithic-millet-farmers"
    }
  ]
}