{
  "stories": [
    {
      "by": "lkrubner",
      "descendants": 0,
      "id": 30848082,
      "score": 1,
      "time": 1648586407,
      "title": "Permanent disequilibrium models will alter the way we see history",
      "type": "story",
      "url": "https://demodexio.substack.com/p/permanent-disequilibrium-models-plus"
    },
    {
      "by": "lizparody23",
      "descendants": 0,
      "id": 30848071,
      "score": 1,
      "time": 1648586366,
      "title": "Create an Interactive Image Carousel in Slack",
      "type": "story",
      "url": "https://fusebit.io/blog/slack-interactive-image-carousel/"
    },
    {
      "by": "chanind",
      "descendants": 0,
      "id": 30848067,
      "score": 1,
      "time": 1648586347,
      "title": "Remote working, bargaining power and productivity",
      "type": "story",
      "url": "https://bankunderground.co.uk/2022/03/29/remote-working-bargaining-power-and-productivity/"
    },
    {
      "by": "eliudprom1",
      "descendants": 0,
      "id": 30848066,
      "score": 1,
      "text": "About GIT365 (girl in tech 365)  is an online and off platform created by KIVUHUB with the goal of empowering women entrepreneurs, local community and young girls and women in technology , information access and innovation. For our goal of 2022-2025 is to create a path towards equality, quality education, reducing inequality our projects to actively contribute to SDG 5 ( Gender equality will help women to have the right skills promote gender-based initiative  ) and SDG 4(Quality education which will allow women and girls to be competitive in market) in the DR.Congo a specially in the East .\nOur project focus on building the capacity in the ICT ,access to information and entrepreneurship sector which will open more opportunity for women to be skills with new technology of information and communication for social and economic empowerment and community transformation as well self-employment. Access to information is a key factor in achieving our goal.  \nWe acknowledge that the process toward  gender equality and quality education is just started and it is long but our contribution to that cause will bring a new breath to those will join our program as well as impact their community in matters of information access, resources access, community development, job creation, women right, and others aspect of the society.",
      "time": 1648586344,
      "title": "GIT365 by Kivuhub",
      "type": "story"
    },
    {
      "by": "lizparody23",
      "descendants": 0,
      "id": 30848064,
      "score": 1,
      "time": 1648586336,
      "title": "Misinformation is derailing renewable energy projects across the United States",
      "type": "story",
      "url": "https://www.npr.org/2022/03/28/1086790531/renewable-energy-projects-wind-energy-solar-energy-climate-change-misinformation"
    },
    {
      "by": "denimboy",
      "descendants": 0,
      "id": 30848056,
      "score": 1,
      "time": 1648586311,
      "title": "Is the madness ever going to end?",
      "type": "story",
      "url": "https://www.unixsheikh.com/articles/is-the-madness-ever-going-to-end.html"
    },
    {
      "by": "syed_ahmed",
      "descendants": 0,
      "id": 30848032,
      "score": 1,
      "text": "Hacker Health is a community for hackers, by hackers who want to get serious about their physical&#x2F;mental health. On my journey to creating a profitable business, I&#x27;ve found that it&#x27;s incredibly easy to slip into bad habits and not take care of yourself properly. I want to change that by creating a community of people that will hold each other accountable and celebrate victories together.",
      "time": 1648586207,
      "title": "Show HN: Hacker Health",
      "type": "story",
      "url": "https://www.notion.so/strazzud/Hacker-Health-2e62471a1e18440b8040a0104420353c"
    },
    {
      "by": "axiomdata316",
      "descendants": 0,
      "id": 30847998,
      "score": 1,
      "time": 1648585988,
      "title": "Comma.ai likely to remove support from C2 before promised July 2022",
      "type": "story",
      "url": "https://twitter.com/comma_ai/status/1508889382601691140"
    },
    {
      "by": "program",
      "descendants": 0,
      "id": 30847995,
      "score": 1,
      "time": 1648585967,
      "title": "Chris Sawyer FAQ",
      "type": "story",
      "url": "http://www.chrissawyergames.com/faq3.htm"
    },
    {
      "by": "wallfacer77",
      "descendants": 0,
      "id": 30847990,
      "score": 1,
      "text": "I have some side projects that I&#x27;d like to sell as commercial applications. These don&#x27;t really provide any &quot;ongoing service&quot;, so I&#x27;d feel bad with asking for a subscription fee, meaning ideally a small flat fee per license should suffice.<p>How does one achieve this in a sane, reasonable way in 2022? I don&#x27;t want to ship an annoying &quot;activator&quot; program like something from Autodesk or Adobe, which goes against the idea of my simpler applications.<p>On the other side of the spectrum I feel like I could just provide a link to a zip on an S3 on the payment confirmation email, but that is easily shareable and looks unprofessional.<p>Is there something that can be done with encryption&#x2F;activation keys that would not require the program to phone home to validate itself every time its launched?<p>How do you people earn money from your desktop applications?",
      "time": 1648585938,
      "title": "Ask HN: What is the sensible way to sell offline desktop applications?",
      "type": "story"
    }
  ]
}