{
  "stories": [
    {
      "by": "raldu",
      "descendants": 0,
      "id": 29300749,
      "score": 1,
      "time": 1637536463,
      "title": "Game Theory Icons",
      "type": "story",
      "url": "http://dragice.fr/gameicons/"
    },
    {
      "by": "KhoomeiK",
      "descendants": 0,
      "id": 29300719,
      "score": 1,
      "time": 1637536237,
      "title": "Seventy Year history of Bikini Atoll resident relocations by the US Government",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bikini_Atoll"
    },
    {
      "by": "HMH",
      "descendants": 0,
      "id": 29300710,
      "score": 1,
      "text": "Recently I helped a friend getting some scientific software running on an HPC system a little on the smaller side. The software is written in C++ and uses cmake for building. And to be honest, the experience was rather subpar.<p>All HPC systems I have worked on have been using Lmod [1] to manage the environment and enable building with say Intel&#x27;s compiler or some specific MPI version.<p>Now one of the concrete problems I hit was the following: Loading the latest version of cmake using Lmod pulls in the latest version of gcc&#x27;s libstdc++ as cmake is dynamically linked against that. But if you try to build said software with the Intel toolchain which pulls an older version of libstdc++ into the environment, suddenly cmake breaks with a rather cryptic symbol not found error.<p>This is what got me thinking: On HPC systems you typically need to have lots of libraries&#x2F;software with oftentimes many and conflicting versions installed, so your users can use what they need. I have not yet tried Nix(OS) myself, but what I described does very much sound like the problem it is intended to solve.<p>Thus my question: Has anyone tried Nix(OS) on an HPC system, how did it go? Otherwise, are there (better) alternatives to Lmod?<p>[1]: https:&#x2F;&#x2F;lmod.readthedocs.io",
      "time": 1637536196,
      "title": "Ask HN: Nix(OS) for HPC?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29300685,
      "score": 3,
      "time": 1637535911,
      "title": "Nuclear Power and Climate Change",
      "type": "story",
      "url": "https://www.wren.co/blog/posts/nuclear-power-and-climate-change"
    },
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 29300653,
      "score": 2,
      "time": 1637535696,
      "title": "Library Athena",
      "type": "story",
      "url": "http://www.libraryathena.com/"
    },
    {
      "by": "cgb223",
      "descendants": 0,
      "id": 29300638,
      "score": 3,
      "time": 1637535567,
      "title": "Ask HN: If you could work remote in any city in the US, where would live? Why?",
      "type": "story"
    },
    {
      "by": "ogcricket",
      "descendants": 0,
      "id": 29300607,
      "score": 1,
      "time": 1637535396,
      "title": "Passwordless authentication platform Stytch raises $90M",
      "type": "story",
      "url": "https://venturebeat.com/2021/11/18/passwordless-authentication-platform-stytch-raises-90m/"
    },
    {
      "by": "obiefernandez",
      "descendants": 0,
      "id": 29300598,
      "score": 2,
      "time": 1637535321,
      "title": "Knockoff NFTs",
      "type": "story",
      "url": "https://medium.com/@a.howitt/knockoff-nfts-are-the-best-blockchain-art-49caf8399fee"
    },
    {
      "by": "nojs",
      "descendants": 0,
      "id": 29300593,
      "score": 1,
      "time": 1637535225,
      "title": "Ball’s Pyramid",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ball%27s_Pyramid"
    },
    {
      "by": "alexandrerond",
      "descendants": 1,
      "id": 29300587,
      "kids": [
        29300600
      ],
      "score": 2,
      "text": "I want to buy and download music albums, usually commercial and famous bands, to my computer. MP3s are ok, although I would not mind FLAC etc.<p>I don&#x27;t want subscriptions, apps, recommendations, IA, PC apps, surround sound, IA or whatever, I just want to search for an album, pay and download what I purchased.<p>I was using Amazon because it gave me a .ZIP file directly after purchase, but now they made it horrible, forced me into logging into Amazon Music, which does not support browsers on Linux or mobile, and eventually (as long as it thinks some other browser is &quot;playing&quot;), only lets me download purchased songs one by one, from a very specific page which took me 45 minutes to find, and asking me every time if I really do not want to do it on their app.<p>I was wondering if there is a service out there that would just take my money and let me easily download the music in a legal fashion, similar to Bandcamp, but also for commercial artists etc.",
      "time": 1637535184,
      "title": "Ask HN: Best Service to Download Music?",
      "type": "story"
    }
  ]
}