{
  "stories": [
    {
      "by": "vnorilo",
      "descendants": 0,
      "id": 30398114,
      "score": 1,
      "time": 1645286944,
      "title": "Technology of the Oppressed",
      "type": "story",
      "url": "https://mitpress.mit.edu/books/technology-oppressed"
    },
    {
      "by": "digitalsanctum",
      "descendants": 0,
      "id": 30398106,
      "score": 1,
      "text": "How would you implement a service mesh for a large enterprise that already has hundreds of microservices? For some background, the existing microservices are deployed in a variety of ways (VMs, containers and serverless) and primarily use HTTP&#x2F;JSON to communicate. Although the services are primarily hosted in AWS the implementation must be cloud-agnostic.",
      "time": 1645286871,
      "title": "Ask HN: How would you implement service mesh in a large enterprise?",
      "type": "story"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 30398105,
      "score": 1,
      "time": 1645286864,
      "title": "I Knew How to Validate an Email Address Until I Read the RFC (2007)",
      "type": "story",
      "url": "http://haacked.com/archive/2007/08/21/i-knew-how-to-validate-an-email-address-until-i.aspx/"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 30398086,
      "score": 3,
      "time": 1645286743,
      "title": "Was Sweden right about Covid all along?",
      "type": "story",
      "url": "https://www.telegraph.co.uk/news/2022/02/13/sweden-right-covid-along/"
    },
    {
      "by": "dondraper36",
      "descendants": 0,
      "id": 30398085,
      "score": 1,
      "text": "I have a dream job in terms of work-life balance so I don&#x27;t even have to think about it on the weekend. In theory, this is the right time to relax, do whatever is not job-related, enjoy the time with family, friends, etc.<p>That said, recently I have some strange discomfort inside when, for example, watching a movie in the evening. It feels wrong to spend time this way when there are so many things I still don&#x27;t know or understand in computer science, software engineering and related fields.<p>Even though I do enjoy reading technical books and learning new things, it feels stressful at time when you would like to do something else, but it feels stressful and, well, &quot;wrong&quot;.<p>Probably, someone has experienced the same and can share their take on that.<p>I realize how stupid that might sound, but this is what it is :)",
      "time": 1645286742,
      "title": "Ask HN: How to stop thinking about work and software engineering on the weekend?",
      "type": "story"
    },
    {
      "by": "mongol",
      "descendants": 0,
      "id": 30398060,
      "score": 1,
      "time": 1645286540,
      "title": "The Darwinian Interlude (2006) by Freeman Dyson",
      "type": "story",
      "url": "https://www.technologyreview.com/2006/02/16/229657/the-darwinian-interlude/"
    },
    {
      "by": "GlenTheMachine",
      "descendants": 0,
      "id": 30398057,
      "score": 1,
      "text": "My 21 year old daughter has come to realize she doesn’t like her chosen profession (nursing) and wants to become a mechanical engineer. She’s started to take introductory math and engineering classes. And to this end, she wants to spend the summer teaching herself to code, and asked me which language she should learn.<p>When I code in anger I use Julia, but that isn’t what I’m recommending for her. The obvious answer here is python, but I wanted to make sure I wasn’t missing anything.",
      "time": 1645286509,
      "title": "Ask HN: Best first language for a budding MechE",
      "type": "story"
    },
    {
      "by": "gkrishna",
      "descendants": 0,
      "id": 30398053,
      "score": 1,
      "time": 1645286452,
      "title": "Ask HN: Have you tried Meta's VR for work? Is it better than other alternatives?",
      "type": "story"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30398048,
      "score": 1,
      "time": 1645286424,
      "title": "Production Quality contracts under open source licenses",
      "type": "story",
      "url": "https://github.com/CosmWasm/cw-plus"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30398029,
      "score": 1,
      "time": 1645286331,
      "title": "A simple, clean, and minimal Jekyll Blog Template – easy deploy to GitHub Pages",
      "type": "story",
      "url": "https://oinam.github.io/oinam-jekyll/"
    }
  ]
}