{
  "stories": [
    {
      "by": "robinhood",
      "descendants": 0,
      "id": 31928292,
      "score": 1,
      "time": 1656557610,
      "title": "Moving a Laravel Webpack Project to Vite",
      "type": "story",
      "url": "https://christoph-rumpel.com/2022/6/moving-a-laravel-webpack-project-to-vite"
    },
    {
      "by": "LordNibbler",
      "descendants": 0,
      "id": 31928283,
      "score": 1,
      "time": 1656557477,
      "title": "Sorting Algorithms: Speed Is Found in the Minds of People – Andrei Alexandrescu",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=FJJTYQYB1JQ"
    },
    {
      "by": "thiefmeister",
      "descendants": 0,
      "id": 31928282,
      "score": 1,
      "time": 1656557461,
      "title": "Clinic that did not pay their developer",
      "type": "story",
      "url": "http://shenoaclinic.com/"
    },
    {
      "by": "dwrodri",
      "descendants": 0,
      "id": 31928280,
      "score": 1,
      "time": 1656557423,
      "title": "The Gateway PC Brand Returns with New Laptops",
      "type": "story",
      "url": "https://www.pcmag.com/news/the-gateway-pc-brand-returns-with-new-laptops"
    },
    {
      "by": "citguru",
      "descendants": 0,
      "id": 31928266,
      "score": 1,
      "text": "Its been about 10 hours now that our core business operations is down because AWS security system decided that our account has unauthorized service usage and place a restriction on some part of services we can have access to.<p>One of them is obviously AWS Lambda. Two weeks ago we started processing large volume of transactions (We provide wallet and digital assets infrastructure for businesses) and needed to increase our services performance from request time out to memory to even our RDS instance to be able to accommodate the kind of requests we are currently processing.<p>However yesterday (29th of July) at around 5:04PM we got an email from AWS about unautorized service charges due to some unauthorized activity and could be a potential account hack or compromise.<p>My heart first sank because I was just waking up from a nap after reviewing the new lambda functions the teams worked on and planning to promote to production and staging server.<p>The second is this is a very high risk security issues and could be a potential hack. We primarily use MPC base vault to securely store and process transactions. Regardless, this is a very a big issue and had to respond by first of all changing the root passwords, deactivating all API keys, disabling console login access for all other users and removing any type of old keys.<p>After doing this will at least help secure our account for the main time. But then I was curious as well since the suspected activity is because of the unauthorized service charge, decided to go check all services from each region and end up checking our AWS Bill and carefully looking at the bill.<p>At the end it&#x27;s a bill the team expected following our new changes from increasing our lambda function memory to time out and upgrading our RDS instance, the bill basically makes sense. AWS must have mistakenly detected this as unauthorized charge.<p>However the issue here is it&#x27;s been 10 hours, and we have literally lost access to AWS Lambda functions the moment they notified us of this issues and one of our core business solutions is down because AWS shut it down.<p>The customer support experience from the AWS support team is the worst I have seen in my entire life. This is outrageous and never wished anyone to experience this. For over 10 hours, our customers (businesses such as payment gateway and exchanges) can&#x27;t run some business operations because the lambda service (which cant be easily migrated to another alternative service) is down.<p>Their team keep saying they are waiting for their internal team response for over hours and no good response yet. They didn&#x27;t provide a valid reason nor why this is taking too much time to fix. Its like they are lack of empathy and just robots behind the keyboards.<p>The AWS Support team are very heartless with no sense of urgency and this is not the first time such encounter is happening.<p>This has taught us a lesson not to build our product to be tightly locked with a cloud provider as migrating would be like starting from scratch and be more complicated.<p>If you work in AWS, the technical support team or customer support team and you would like to help us get past this. Please you can reach out here: hi[[at]]powr[[dot]]finance.<p>Thanks.",
      "time": 1656557269,
      "title": "Worst AWS service and support team experience",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31928259,
      "score": 1,
      "time": 1656557209,
      "title": "Brazil wants special treatment for its nuclear submarine program–like Australia",
      "type": "story",
      "url": "https://thebulletin.org/2022/06/brazil-wants-special-treatment-for-its-nuclear-submarine-program-just-like-australia/"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 31928248,
      "score": 1,
      "time": 1656557105,
      "title": "Retracted “zombie papers” by notorious fraudster still cited years later",
      "type": "story",
      "url": "https://www.science.org/content/article/zombie-papers-wont-die-retracted-papers-notorious-fraudster-still-cited-years-later"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31928235,
      "score": 1,
      "time": 1656556908,
      "title": "William Herschel Is Famous for Science. What About Music?",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/27/arts/music/william-herschel-astronomy-music.html"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31928216,
      "score": 1,
      "time": 1656556683,
      "title": "Google’s ‘deceptive’ account sign-up process targeted with GDPR complaints",
      "type": "story",
      "url": "https://techcrunch.com/2022/06/29/google-account-gdpr-complaint/"
    },
    {
      "by": "react_burger38",
      "descendants": 1,
      "id": 31928202,
      "kids": [
        31928209
      ],
      "score": 1,
      "text": "I used to really like the WSJ, and am a paid subscriber, but recently they put up some script that makes me disable my adblocker. Anyone have a way to get around that with uBlock origin or anything else? Some of the ads are very annoying.",
      "time": 1656556500,
      "title": "Ask HN: uBlock Origin Filters for WSJ?",
      "type": "story"
    }
  ]
}