{
  "stories": [
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 32094153,
      "score": 1,
      "time": 1657794492,
      "title": "It's All Just an Old Videogame",
      "type": "story",
      "url": "https://www.ioann.xyz/p/its-all-just-an-old-videogame"
    },
    {
      "by": "SQL2219",
      "descendants": 0,
      "id": 32094150,
      "score": 1,
      "time": 1657794439,
      "title": "Solar electric installed nine years ago is down",
      "type": "story",
      "url": "https://kunstler.com/clusterfuck-nation/its-not-working/"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 32094143,
      "score": 1,
      "time": 1657794357,
      "title": "Tech CEO charged for 1992 Murder",
      "type": "story",
      "url": "https://www.nytimes.com/2022/07/13/us/laurie-houts-arrest-murder-california.html"
    },
    {
      "by": "AndrewDucker",
      "descendants": 0,
      "id": 32094142,
      "score": 1,
      "time": 1657794350,
      "title": "Crypto Winter, or Crypto Ice Age?",
      "type": "story",
      "url": "https://www.technollama.co.uk/crypto-winter-or-crypto-ice-age"
    },
    {
      "by": "Maf1",
      "descendants": 0,
      "id": 32094140,
      "score": 1,
      "time": 1657794326,
      "title": "BMW locks heated-seats behind paywall",
      "type": "story",
      "url": "https://uk.pcmag.com/cars-auto/141437/bmw-tests-locking-vehicle-features-like-heated-seats-behind-a-paywall"
    },
    {
      "by": "prasenjit_pro",
      "descendants": 1,
      "id": 32094136,
      "kids": [
        32094159
      ],
      "score": 1,
      "text": "1. It gives you an understanding of the evolution of the web\nAs a web crawler, the web is a scary place. It is like landing a spaceship on an asteroid. It is because the original web browsers like Internet Explorer were very lenient on poorly written HTML, so many of the pattern matching techniques keep failing. You learn to appreciate technologies like Beautiful Soup to help tame rouge HTML.<p>2. It helps you understand web servers.<p>Web servers use several ‘tells’ to detect that you are not human. It is a bit like a game of Cat and Mouse.<p>3. It might teach you a new language<p>If you want pure power, sooner or later, you will realize the power of Scrapy, especially when combined with Scrapyd. A long, long time ago, I had to learn Python to get all the advantages Scrapy gives me, which is easily offset by the disadvantages of having to learn something new.<p>4. It tests your ability to think out of the box<p>Each website is different, has AJAX-based content; pagination comes in all shapes and sizes. You have to ‘crack’ each website separately many times as there is no one size fits all.\n5. It challenges you to work at scale<p>What works when you are in the development mode very often crash lands when you run it at scale. To use concurrency, scale spiders, handle large amounts of data, maximize the throughput of a server or several servers, use rotating proxies to overcome IP blocks like Proxies API. Coding is only the first step.\n6. It allows you to tame the chaos<p>It is what most of your code does. You are trying to get data out of something that wasn’t built for your bots. Most of the time, it is not easy to domesticate them.<p>7. It teaches you to work with frameworks<p>Scrapy on Scrpayd along with file pipelines if you have to download images. CSS&#x2F;XPath Selectors to make scraping more predictable. Rate limiting, session handling, and concurrency — You will learn all this by trial and error.<p>8. It teaches you the importance of creating checks and balances<p>Once you have deployed the code, a single rogue javascript might bring down your project. The website changes the HTML, and the code may no longer work. Your machine has no network, but if there is no check for this, you will end up with several thousand empty documents. You will learn to anticipate, put in checks and alerts to immediately know, and debug if there is something wrong in your workflow.\nThe author is the founder of Proxies API (https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;), a proxy rotation api service.<p>This article originally appeared here:https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;blog&#x2F;Why-Every-Programmer-Should-Learn-How-To-Scrape-The-Web.php",
      "time": 1657794272,
      "title": "Why Every Programmer Should Learn How to Scrape the Web",
      "type": "story"
    },
    {
      "by": "abhayit2000",
      "descendants": 0,
      "id": 32094113,
      "score": 1,
      "time": 1657794047,
      "title": "Mobile Testing Techniques Every QA Person Must Know",
      "type": "story",
      "url": "https://www.applause.com/blog/must-know-mobile-qa-testing-techniques"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 32094110,
      "score": 1,
      "time": 1657793998,
      "title": "70% of Ethereum Nodes Are Hosted on Centralized Services",
      "type": "story",
      "url": "https://decrypt.co/44321/70-of-ethereum-nodes-are-hosted-on-centralized-services"
    },
    {
      "by": "zw123456",
      "descendants": 0,
      "id": 32094075,
      "score": 2,
      "time": 1657793701,
      "title": "Homophobic Telescope Reveals First Hi-Res Images of Deep Space",
      "type": "story",
      "url": "https://www.intomore.com/other/homophobic-telescope-reveals-first-hi-res-images-deep-space/"
    },
    {
      "by": "czernobog",
      "descendants": 2,
      "id": 32094048,
      "kids": [
        32094126,
        32094079
      ],
      "score": 1,
      "text": "Hello, I recently joined a new startup and I am new to the IT field. I am tasked to look for a service which has backend access to all the laptops given to our employees. If someone installs anything even remotely suspicious I should know about it. All the laptops are running Ubuntu. I am okay if it&#x27;s a paid service. Any suggestions?",
      "time": 1657793354,
      "title": "Ask HN: Looking for a back end service to manage work computers",
      "type": "story"
    }
  ]
}