{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32211830,
      "score": 1,
      "time": 1658656213,
      "title": "Coffee’s health benefits aren’t as straightforward as they seem (2021)",
      "type": "story",
      "url": "https://theconversation.com/coffees-health-benefits-arent-as-straightforward-as-they-seem-heres-why-172907"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32211828,
      "score": 1,
      "time": 1658656205,
      "title": "Ten Considerations Before You Create Another Chart About Covid-19 (2020)",
      "type": "story",
      "url": "https://medium.com/nightingale/ten-considerations-before-you-create-another-chart-about-covid-19-27d3bd691be8"
    },
    {
      "by": "blopeur",
      "descendants": 0,
      "id": 32211826,
      "score": 1,
      "time": 1658656159,
      "title": "The Missing Profits of Nations",
      "type": "story",
      "url": "https://www.restud.com/paper/the-missing-profits-of-nations/"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 32211825,
      "score": 1,
      "time": 1658656157,
      "title": "M2 MacBook Air – How to Fix Fast Overheating for $15",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=BSkcMwzZEFo"
    },
    {
      "by": "markomunich",
      "descendants": 0,
      "id": 32211822,
      "score": 1,
      "time": 1658656118,
      "title": "Memphis Message broker written in Golang",
      "type": "story",
      "url": "https://github.com/memphisdev/memphis-broker"
    },
    {
      "by": "simjue",
      "descendants": 0,
      "id": 32211819,
      "score": 1,
      "time": 1658656091,
      "title": "Link Lock is a tool for adding a password to a link",
      "type": "story",
      "url": "https://jstrieb.github.io/link-lock/"
    },
    {
      "by": "akolbe",
      "descendants": 0,
      "id": 32211816,
      "score": 1,
      "time": 1658656066,
      "title": "Zhemao hoaxes",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Zhemao_hoaxes"
    },
    {
      "by": "2517AD",
      "descendants": 0,
      "id": 32211805,
      "score": 2,
      "time": 1658655866,
      "title": "How Can We Make Robotics More Like Generative Modeling?",
      "type": "story",
      "url": "https://evjang.com/2022/07/23/robotics-generative.html"
    },
    {
      "by": "hestefisk",
      "descendants": 0,
      "id": 32211789,
      "score": 1,
      "time": 1658655711,
      "title": "Prima: Cross-platform GUI toolkit written in Perl",
      "type": "story",
      "url": "https://github.com/dk/Prima"
    },
    {
      "by": "gwnywg",
      "descendants": 0,
      "id": 32211787,
      "score": 1,
      "text": "Hi,<p>I work a lot on images processing and extracting insights from it. There seems to be demand for this kind of service.\nMy university background is closer to time series data, i.e. digital signals processing and modelling, I was wondering if same methods can be applied here. In industrial processes it makes sense to try to model various parts of the process to be able to predict possible fault. This is cool and complicated, and also there are no industrial plants in my environment to go and explore real life data to work with.<p>The other application of modelling based on time series is within financial markets speculation (forex, stock exchange etc.), though I am not partucularly interested in this area, it appears to me a bit like gambling and as such not something I would like to be involved in.<p>So I wonder what other use cases for time series modelling are. I have two ideas to build something that may turn out to be useful.<p>1. I was reading it is possible to find correlations between time series streams, and this could maybe lead to a model that suggests to turn some equipment off because it is not required (based on availability of electrical consumption data)<p>2. Processing of audio streams and building generative model to create some interesting sound effects (not necessarily music); or the other way around, to detect some events based on sound (i.e. car accident)<p>Do you know interesting projects that apply machine learning methods to process time series data to do something useful with it? Or maybe you wish a project existed for some particular problem you feel is worth solving?",
      "time": 1658655671,
      "title": "Ask HN: Is there any real value in applying ML to process time series data?",
      "type": "story"
    }
  ]
}