{
  "stories": [
    {
      "by": "haltingproblem",
      "descendants": 0,
      "id": 29876443,
      "score": 1,
      "time": 1641829037,
      "title": "Worst NYC fire in 30 years was caused by faulty space heater",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10384341/People-seen-jumping-windows-Bronx-apartment-building-fire.html"
    },
    {
      "by": "roboben",
      "descendants": 0,
      "id": 29876438,
      "score": 2,
      "time": 1641829017,
      "title": "Looking for a marketing co-founder for a regenerative gardening platform",
      "type": "story",
      "url": "https://permapeople.org/blog/2022/01/02/marketing-cofounder.html"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29876432,
      "score": 1,
      "time": 1641829006,
      "title": "Quantifying social organization and political polarization in online platforms",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-021-04167-x"
    },
    {
      "by": "wrycoder",
      "descendants": 0,
      "id": 29876426,
      "score": 1,
      "time": 1641828979,
      "title": "Stabilizing the Temperature of an NTP Server with Repurposed Bitcoin Miners",
      "type": "story",
      "url": "https://vanheusden.com/texts/usb-asic-miner-heater/"
    },
    {
      "by": "agrinman",
      "descendants": 0,
      "id": 29876424,
      "score": 1,
      "time": 1641828974,
      "title": "Building a Decentralized ID Verification System on Solana",
      "type": "story",
      "url": "https://alexgrinman.com/posts/building-decentralized-identity-verification-system-on-solana/"
    },
    {
      "by": "metalised",
      "descendants": 0,
      "id": 29876423,
      "score": 1,
      "text": "About a month ago, a malicious actor filed and succeeded in making an ownership claim on my Facebook page. I had given some background to this previously on HN, a few weeks back [0].<p>As a follow-up to [0], after several unsuccessful attempts to restore my rights and ownership to the page, the scammer recently reasserted their claim to my page: see screenshot [1]. Meanwhile, it&#x27;s been over a month, and facebook has not responded to my numerous messages, and I doubt any human will ever see those messages anyway.<p>I don&#x27;t know how the scammers did it, but I assume either my personal credentials were hacked (I have since updated all relevant passwords), or, more likely, it was something along the lines of [2]: i.e. they created a dummy entity and then claimed that my page was a duplicate of their business. Which means that, even though it would be instantly obvious to any <i>human</i> moderator checking the page&#x27;s history and contents (e.g.from [3]), that the scammer&#x27;s ownership claim is unfounded, since my page is not, and was never backed by a commercial business entity, whatever useless &#x27;proof&#x27; they offered as a business will likely still pass Facebook&#x27;s <i>automated</i> processes for ownership claims.<p>It seems the scammers have now moved to phase two of their scam. An account misleadingly named &#x27;Facebook Verifications&#x27; recently sent me this message on facebook, along with a list of other facebook pages that were presumably also scammed (in which I recognise other famous names in the heavy metal scene, e.g. Richard Henshall from Haken) [4][5][6].<p>Also, a random etsy shop&#x27;s facebook page supposedly selling earings has linked to their &#x27;metalised&#x27; earrings, nonsensically linking to my page (presumably because of its large readership), though this may be an unrelated stunt [7].<p>I&#x27;m reaching out to the HN community. If anyone has any ideas how I could fight the scammers and get my page back, please help a metalhead out!<p>[0] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29706571<p>[1] https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;yuWvu.jpg<p>[2] https:&#x2F;&#x2F;www.techprevue.com&#x2F;how-to-claim-a-facebook-page&#x2F;<p>[3] https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;5ux4s.png<p>[4] https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;spwK2.jpg<p>[5] https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;LPw59.jpg<p>[6] https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;X8xpg.jpg<p>[7] https:&#x2F;&#x2F;www.facebook.com&#x2F;mumzele.lilly&#x2F;photos&#x2F;pcb.3075592826045948&#x2F;3076311139307450",
      "time": 1641828969,
      "title": "Ask HN: A scammer claimed ownership of my Facebook page. How do I get it back?",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29876420,
      "score": 1,
      "time": 1641828960,
      "title": "China targets 2023-2025 for recovery in international air travel",
      "type": "story",
      "url": "https://www.reuters.com/world/china/china-targets-over-270-civil-airports-by-2025-aviation-regulator-2022-01-07/"
    },
    {
      "by": "XE3BZiC5J4CAAx",
      "descendants": 0,
      "id": 29876412,
      "score": 1,
      "text": "I&#x27;m in some kind of personal hell and I have no idea what to do anymore.<p>About 4 months ago I was approached by an angel investor to found a software startup based on some work I had done for his friend. I&#x27;ve been helping said friend on his projects for over a year for little to no pay because I liked his ideas and wanted to support him in some way, as well as potentially find some opportunities.<p>Well it seemed that an opportunity had arisen, and I&#x27;ve been trying to start my own business for a little while with rapidly dwindling finances. So, I agreed to an arrangement of a three-way split (including the friend as idea guy) if they could give me some &quot;breathing room&quot; to work on a pitch demo&#x2F;MVP for a few months. They said that they wouldn&#x27;t have too much time to dedicate to the project but that they trusted me and they&#x27;d try to support me however they could. We agreed and all was good.<p>Over the few months that I&#x27;d been building the project, I&#x27;d been sending frequent updates and deployments for them to check out and give feedback on. Most of the time they&#x27;d quickly look at it, say &quot;this is good&quot;, maybe have an idea or two, then disappear. I had a lot of questions that went unanswered, and the feedback I did get was mostly me trying to judge whether they actually liked it by gauging their enthusiasm. I decided it wasn&#x27;t good enough and went back to the drawing board a few times, but each time I came back with an update it&#x27;d be the same reaction. It felt like they never got serious about the project, and I still think maybe it&#x27;s because it&#x27;s not that good.<p>The stress of not knowing if they&#x27;re really on board, knowing I&#x27;m running out of money, and yet having a project that <i>I think</i> would be useful for people (and make us all money) if given enough love, really started getting to me.<p>So, I got frustrated and tried to manage the team. I asked everyone if they were willing to adopt certain roles on the project that could help me, maintain a Google doc for async discussion, and be available for a meeting once a week. I was a bit flustered so I didn&#x27;t do it quite so succinctly and was very wordy with everything, and I managed to get the ideas guy to flip out at me - where he told me he thought he was contributing just fine, that he wouldn&#x27;t be willing to do anything else, and that he told me that he wouldn&#x27;t have much time to dedicate to the project at the start.<p>We hashed it out a bit, and he said that I should just call him if I have anything to talk about for the project. I agreed to, because I kind of wanted to end on a good note - but I honestly can&#x27;t think of a reason to call him for anything at this point, considering he doesn&#x27;t know much about the project and he&#x27;s never given an indication of what he could even help me with.<p>Since then, I&#x27;ve delivered a version of the app that I think could work as a pitch demo. They both looked at it, said it&#x27;s great and that they agreed it would work. I asked for a meeting to properly go over the features and talk about next steps, they both agreed then disappeared.<p>Now I&#x27;m sitting here waiting for them to get back to me, so that I can find out whether this project is going to continue at all, and whether they&#x27;ll support me with a cash injection for the next couple of months as we start doing the business side, polishing the app, and pitching it to investors.<p>The way it feels, I depend on them to survive right now. We have a good project that could make me stop needing to depend on them, and would even let me pay them back. But, I don&#x27;t know if it&#x27;ll ever get there, I&#x27;m already dreading having to ask for more money, and if they decide not to give me any cash I might end up having to beg my parents for help because I can only survive like this for another month, max.<p>Does anyone have some ideas of what I can do here? I&#x27;m not sure how much of this situation is my fault.",
      "time": 1641828917,
      "title": "Ask HN: Stressed by Cofounders",
      "type": "story"
    },
    {
      "by": "vitaut",
      "descendants": 0,
      "id": 29876390,
      "score": 1,
      "time": 1641828846,
      "title": "James Web Space Telescope runs on C++ code",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=hET2MS1tIjA"
    },
    {
      "by": "EvgeniyZh",
      "descendants": 0,
      "id": 29876355,
      "score": 1,
      "time": 1641828735,
      "title": "Harvard Went Woke",
      "type": "story",
      "url": "https://spectatorworld.com/topic/harvard-went-woke-ruth-wisse/"
    }
  ]
}