{
  "stories": [
    {
      "by": "kylebenzle",
      "descendants": 0,
      "id": 28933274,
      "score": 1,
      "time": 1634750308,
      "title": "Adding an air purifier is the most important thing you can do for your health",
      "type": "story",
      "url": "https://kylebenzle.medium.com/adding-an-air-purifier-to-your-home-is-the-single-most-important-thing-you-can-do-to-improve-your-4b9568c8056e"
    },
    {
      "by": "Nathanwl",
      "descendants": 0,
      "id": 28933259,
      "score": 1,
      "time": 1634750221,
      "title": "Retool's org chart and how Retool started off as a fintech",
      "type": "story",
      "url": "https://www.headsup.ai/blog/retool-org-chart/"
    },
    {
      "by": "undefinednull",
      "descendants": 0,
      "id": 28933258,
      "score": 1,
      "time": 1634750215,
      "title": "Google News Showcase",
      "type": "story",
      "url": "https://www.blog.google/outreach-initiatives/google-news-initiative/licensing-program-support-news-industry-/"
    },
    {
      "by": "solarmist",
      "descendants": 0,
      "id": 28933255,
      "score": 1,
      "time": 1634750200,
      "title": "The four energies you can tap into to make your writing interesting",
      "type": "story",
      "url": "https://austinkleon.com/2021/09/29/the-four-energies/"
    },
    {
      "by": "Ihechi",
      "descendants": 1,
      "id": 28933253,
      "kids": [
        28933281
      ],
      "score": 1,
      "text": "About Ulula\nUlula is  a certified B-Corp that equips organizations with technology, data and analytics to monitor risks of human rights abuses in order to create more responsible supply chains. Our mandate is to improve working conditions in mining, manufacturing and agribusiness by sourcing and processing accurate and timely insights directly from workers across the globe. We have projects across the globe including India, Peru, South Africa and China with clients ranging from NGOs to government departments to household name brands.<p>About the Role\nWe are searching for an experienced Lead Software Developer to join our growing team in Toronto. The successful candidate will be: \nLiaising between the team of developers, QA and the Product Team to build and implement functional programs with best practices. \nDeveloping software with clean, efficient code.\nMentor and coach team members\nIn this role, you should be a team player with excellent communication skills, a keen eye for detail and problem-solving skills.<p>What you’ll do:\nWork closely with senior stakeholders to understand business requirements and help translate these into technical requirements for the development team\nWork with the development and product teams in the design, development, coding, testing and debugging of applications\nWrite testable, scalable and efficient code based on specifications\nConduct code reviews\nCollaborate with other teams in the development and execution of User Acceptance Tests\nIntegrate software components and third-party programs\nVerify and deploy programs and systems\nTroubleshoot, debug and upgrade existing software\nGather and evaluate user feedback\nRecommend and execute improvements\nCreate technical documentation for reference and reporting<p>Your preferred profile:\n8+ years proven experience as a Technical Team Lead and  Software Engineer\nExperience with software design and development in a test-driven environment\nSolid experience with PHP, Laraval, VueJS\nExperience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate)\nExcellent communication skills\nResourcefulness and troubleshooting aptitude\nAttention to detail\nBSc&#x2F;BA in Computer Science, Engineering or a related field<p>What sets you apart: \nProven experience successfully mentoring, coaching and leading Software Development teams.<p>Company perks and culture:\nCompetitive compensation and employee stock option plan \nGenerous benefits package including dental and eye care\nWork on a high achieving and driven multi-cultural team in a fast-paced environment\nInteract with global companies and organizations<p>If the role sounds like a great fit and you are interested, please send us your CV to info@ulula.com or ihechi@ulula.com",
      "time": 1634750192,
      "title": "Lead Software Developer Role",
      "type": "story"
    },
    {
      "by": "Corrado",
      "descendants": 1,
      "id": 28933252,
      "kids": [
        28933275
      ],
      "score": 1,
      "time": 1634750187,
      "title": "Tesla’s Elon Musk shares cool detail about Cybertruck’s side mirrors",
      "type": "story",
      "url": "https://www.teslarati.com/tesla-cybertruck-side-mirror-update/"
    },
    null,
    null,
    {
      "by": "gabor-boros",
      "descendants": 0,
      "id": 28933197,
      "score": 1,
      "time": 1634749895,
      "title": "Show HN: Minutes, a Go CLI tool for synchronizing worklogs",
      "type": "story",
      "url": "https://github.com/gabor-boros/minutes"
    },
    {
      "by": "jmsflknr",
      "descendants": 0,
      "id": 28933193,
      "score": 1,
      "time": 1634749867,
      "title": "Twitter acquires group chat app Sphere",
      "type": "story",
      "url": "https://techcrunch.com/2021/10/20/twitter-acquires-group-chat-app-sphere/"
    }
  ]
}