{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28293002,
      "score": 1,
      "time": 1629830052,
      "title": "Jessamyn West, Technology Lady (2015)",
      "type": "story",
      "url": "https://medium.com/@jessamyn/transcription-jessamyn-west-technology-lady-6c6f5fefa507"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28292999,
      "score": 1,
      "time": 1629830043,
      "title": "I’m a nuclear armageddon survivor: Ask me anything (2017)",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2017/11/im-a-nuclear-armageddon-survivor-ask-me-anything/"
    },
    {
      "by": "diplodocusaur",
      "descendants": 0,
      "id": 28292993,
      "score": 1,
      "time": 1629830014,
      "title": "Why Insulin Is Expensive",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=7Ycd8zEdoVk"
    },
    {
      "by": "guardiangod",
      "descendants": 0,
      "id": 28292984,
      "score": 1,
      "time": 1629829944,
      "title": "Blue Origin's secret response to SpaceX Starship captured on photos",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/08/first-images-of-blue-origins-project-jarvis-test-tank/"
    },
    {
      "by": "jb1991",
      "descendants": 0,
      "id": 28292981,
      "score": 1,
      "time": 1629829934,
      "title": "Possible Havana syndrome incident delayed Harris flight to Vietnam",
      "type": "story",
      "url": "https://edition.cnn.com/2021/08/24/politics/kamala-harris-vietnam/index.html"
    },
    {
      "by": "teichmann",
      "descendants": 0,
      "id": 28292978,
      "score": 1,
      "time": 1629829931,
      "title": "Kindle Vella – publish serial stories with Kindle Direct Publishing",
      "type": "story",
      "url": "https://www.amazon.com/b?node=21613975011"
    },
    {
      "by": "eth0up",
      "descendants": 0,
      "id": 28292966,
      "score": 1,
      "text": "In attempt to expand a list of ubiquitous and less conspicuous infectious diseases, especially those with significant asymptomatic instances and therefore less public awareness, I hope to extend that below with help -- preferably with a focus on extant or emergent (possibly future pandemic), more <i>pan</i> rather than <i>en</i>demic examples. I&#x27;ve embellished some with notes, and some of that listed below may not quite (yet?) deserve the title of Ubiquitous, or necessarily, a place in the list itself, though I&#x27;ve bolded some that do. Due to the popular awareness and many extensive discussions on corona viruses, please consider abstaining. Thanks in advance to those who share their knowledge.<p>###Approximate percent of infection for global population in parentheses - (%)<p><i>H-Pylori (50%)</i>\nExtremely prevalent and often asymptomatic. All positive cases result in inflammation and increased risk of cancer. Treatment is complicated by biofilms and ubiquity of bacteria; eg raw vegetables, oral route via hands, shared utensils, etc. Previous antibiotic usage might increase vulnerability.<p><i>Tuberculosis (25%)</i>\nGenerally asymptomatic and non-infectious in latent stage, but quite pervasive and extremely easy to spread when active. Treatment requires an almost impractically long duration of antibiotics and resistance is a substantial risk.<p>MRSA and fellow mutants (?%)<p><i>Toxoplasma Gondii (50%?)</i>\nThere have been a few interesting threads on HN, with a significant number of comments expressing surprise and previous ignorance of this terrible creature, specifically its proposed ability to alter behaviour in hosts, including schizophrenia. Also notable are its presence in many households by route of cat (non-culinary) or rare beef (non-ornamental) and a typically dormant but voracious appetite for the heart and brain when inspired by circumstances.<p>HPV (?%)<p>Candida; eg Candida Auris (?%) - Emergent?<p>C-Difficile (5%)\nAlthough infectious, many may carry it asymptomatically until aggravated through antibiotics. Percentage of infected varies wildly, dependent on environment, eg hospitals. Complications have a significant mortality rate.<p>Herpes Variants; eg EBV, etc. (?%)<p>CJD Variants, TSE, etc. (?%)\nI&#x27;ve included this due to zoonotic variants, eg CWD, Scrapie, BSE, etc. Worth noting is the unusually long dormancy potential of related diseases and absence of any treatment.<p>Pinworms (11.4%) Incident Rate in USA and much higher elsewhere\nApparently a universal rite of passage<p>Finally, if I&#x27;ve presented something stupidly, constructive clarification is preferable to Hanlon&#x27;s Truncheon. \n*Hanlon&#x27;s Truncheon: Attribute malice to and hastily beat the living hell out of anything that seems unintelligent or confused.",
      "time": 1629829885,
      "title": "Ask HN: Ubiquitous Less-Conspicuous Infectious Diseases",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28292964,
      "score": 1,
      "time": 1629829880,
      "title": "Tech Against Terrorism calls for removal of Taliban content on online platforms",
      "type": "story",
      "url": "https://www.techagainstterrorism.org/2021/08/24/statement-tech-against-terrorism-calls-for-removal-of-taliban-produced-content-on-online-platforms-noting-challenges-for-smaller-tech-companies/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28292958,
      "score": 1,
      "time": 1629829842,
      "title": "Countermeasures Injury Compensation Program (CICP) for Covid-19 Vaccine Injury",
      "type": "story",
      "url": "https://www.hrsa.gov/cicp/faq#covid"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28292946,
      "score": 1,
      "time": 1629829766,
      "title": "I Don’t Fuckn Get It",
      "type": "story",
      "url": "https://theirrelevantinvestor.com/2021/08/23/i-dont-fckn-get-it/"
    }
  ]
}