{
  "stories": [
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 31543083,
      "score": 1,
      "text": "I saw this https:&#x2F;&#x2F;www.latimes.com&#x2F;world-nation&#x2F;ns3x8ftkqoe-123 and the mother of the Texas School Shooter asks us not to judge him and that ‘he had his reasons’.<p>My jaw dropped to the floor. I don’t know if something is lost in translation. I still hear on social media and comments that the state of Texas and the police there is to be blamed. And that the shooter is really the victim for not getting adequate mental health intervention.<p>As I think more about it, when should the help really come? Shouldn’t it actually go to the parents even before the child is born? Most parents will admit that children don’t come with an instruction manual.<p>Maybe they should and they should get it before the child is born just like expectant mothers get medical and dietary counsel. In earlier days, it was community and family.<p>With nuclear families, they are often isolated from community and in countries like America with a large immigrant population but often blended, there is no access or support from ‘people just like us’.<p>I say this as an immigrant because I have a lot of friends from diff cultural backgrounds, but when it comes to food or lifestyle or entertainment, I reach out to those from my own background because I feel like I can relate more with them..to be able to speak in my own language and eat the same food and have the same faith etc.<p>While first generation families still maintain ties, with the second generation, the children look different but feel like they are American. In public schools where child rearing is seemingly outsourced to, they seem to be doing an awful job. And no surprise..because they are not equipped to deal with this level of diversity and those who can’t conform are alienated.<p>So it has to be parents who raise children and not state run schools. But how do we go about this? This school shootings phenomenon seems to be uniquely American and this is how I am trying to rationalize it.<p>So we have to come up with an American solution to an American problem. It has to start before birth and it has to be towards parents so they understand the unique challenges of raising children in America as Americans. We can’t import what some other country is doing wrt education or parenting.<p>I would appreciate any respectful thoughts and discussions that introduce solutions to this problem.",
      "time": 1653766783,
      "title": "Ask HN: Should expectant parents get evaluation/counseling for child rearing",
      "type": "story"
    },
    {
      "by": "SenHeng",
      "descendants": 0,
      "id": 31543054,
      "score": 2,
      "time": 1653766574,
      "title": "System Font Stack",
      "type": "story",
      "url": "https://systemfontstack.com"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 31543034,
      "score": 1,
      "time": 1653766319,
      "title": "Black Mirror Returns: New Series in the Works at Netflix",
      "type": "story",
      "url": "https://variety.com/2022/tv/global/black-mirror-season-6-netflix-1235266891/"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31543009,
      "score": 1,
      "time": 1653766208,
      "title": "Maximator: European signals intelligence cooperation (2020)",
      "type": "story",
      "url": "https://www.tandfonline.com/doi/full/10.1080/02684527.2020.1743538"
    },
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 31543003,
      "score": 1,
      "time": 1653766163,
      "title": "VirusTotal",
      "type": "story",
      "url": "https://www.virustotal.com/gui/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 31542968,
      "score": 1,
      "time": 1653765936,
      "title": "You shouldn't envy the wealth of Musk, Bezos or Gates",
      "type": "story",
      "url": "https://www.axios.com/2022/05/28/stocks-wealth-musk-bezos-gates"
    },
    {
      "by": "metadat",
      "descendants": 1,
      "id": 31542953,
      "kids": [
        31543067
      ],
      "score": 1,
      "time": 1653765822,
      "title": "Lawsuit: Mollusk manipulated Twitter stock price in attempt to renegotiate sale",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/05/lawsuit-musk-manipulated-twitter-stock-price-in-attempt-to-renegotiate-sale/"
    },
    {
      "by": "Figgy24",
      "descendants": 0,
      "id": 31542932,
      "score": 1,
      "time": 1653765643,
      "title": "One engineer got a job at Microsoft",
      "type": "story",
      "url": "https://discord.com/invite/NKFGEzav5M"
    },
    {
      "by": "dotnet00",
      "descendants": 0,
      "id": 31542927,
      "score": 1,
      "time": 1653765602,
      "title": "Reconnaissance Blind Chess",
      "type": "story",
      "url": "https://rbc.jhuapl.edu/"
    },
    {
      "by": "metadat",
      "descendants": 1,
      "id": 31542919,
      "kids": [
        31542937
      ],
      "score": 1,
      "time": 1653765565,
      "title": "Elizabeth Holmes Urges Judge to Overturn Verdict and Acquit Her",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-05-28/elizabeth-holmes-urges-judge-to-overturn-verdict-and-acquit-her"
    }
  ]
}