{
  "stories": [
    {
      "by": "SaarRyan",
      "descendants": 0,
      "id": 31440746,
      "score": 1,
      "time": 1652997893,
      "title": "New discord server for Open source MQ project. Looking for contributors",
      "type": "story",
      "url": "https://discord.com/invite/3E6QddcKJN"
    },
    {
      "by": "adrien_toler",
      "descendants": 0,
      "id": 31440742,
      "score": 1,
      "text": "* A rant post, but that&#x27;s the only option I&#x27;ve got left\nTL;DR - FedEx charged me for fees that they shouldn&#x27;t have, Digikey told me that if and after I&#x27;ll pay they will resolve it but ditched me right after<p>FedEx:\nIt all started as a regular order from Digikey, International shipping, small package, low price ($74~, $29 shipping)\nThe price is set this way for a reason - this is the limit that is a tax free package locally.<p>The package arrived to the country  , and call me to ask for another payment, $62~ for a $74 package.<p>They said that they labeled it as a commercial package, and that&#x27;s why\nonly $20 if for tax and the other is for FedEx (which is outraging by itself, to electrically fill a form that is already half automated, there is no law restricting them or enable competition)<p>I told them they made a mistake, declaring it as a commercial import, which is definitely not, they told me some bushtit about if its more then 3 items its commercial (which is not true, and there is a component of knowledge of the tax reviewer on the specific subject to determine if its an unreasonable amount, for anyone that know something about the subject, a few ring terminals and connectors and not a business )<p>A concrete example: A few months before that I ordered from Digikey a $200 order, and payed a total of $80 tax and fees total, and yes - they declared it as private (UPS)<p>They didn&#x27;t want to acknowledge that, so obviously I told them its outrages and I wont accept it and return it, They said ok and hang up immediately.\nI sent them an email telling them again that they are wrong and make it right, or update me on how the return goes - they didn&#x27;t reply.<p>After asking around in local groups, I&#x27;ve become aware this is a recurring practice of FedEx Israel, as it already happened in additional cases I know of, extract more money per shipment.<p>Digikey:\nA local representative called me, saying that FedEx will charge me $300 for a return, I push him on that and he lied about it, because the truth is they will charge digikey (FedEx also have no way of charging me)<p>He told me that and then continue and said that if I pay them (which will save Digikey the hassle) they will &quot;make it right&quot;, and deal with FedEx.<p>I obliged, believing him even if he lied to fix their problem\nNext day he called and asked if I payed, and told me that in the future every time I make an order I will call them and they will give me a small discount until I recoup my $62<p>Its a classic &quot;Hard to redeem benefit so they are not gonna use it, wont worth the hassle&quot;, and also will take ages to redeem. I told him that I have no plans on any order in the near future, this was for a specific project that is now done.<p>A few hours later I got an email from him (now that he knows that he successfully resolved the issue for Digikey) and told me that they wont help me dealing with Fedex, and that the only thing he can offer is the small discounts<p>And that&#x27;s it.<p>Digikey is a nice place to buy from, good search, good selection of components and low minimum, that&#x27;s why it&#x27;s also overpriced with crazy margins, and with the over the top packaging that sometimes the nylon it comes with worth more then the content, we pay for all that.\nAnd its fine if you at least get a decent treatment when edge cases happens.<p>Before Digikey came into the picture it was just Fedex with a somewhat dishonest mistake, but then it got weird<p>I feel cheated, I paid so much for so little, and I shouldn&#x27;t have, I dont got any leverage, so a post is the only thing that I got left<p>Agree with me or not, it was a bad experience for me",
      "time": 1652997833,
      "title": "Sharing my experience with Digikey and FedEx",
      "type": "story"
    },
    {
      "by": "shortformblog",
      "descendants": 0,
      "id": 31440711,
      "score": 1,
      "time": 1652997657,
      "title": "How the Association for Computing Machinery Is Opening the Doors to Its Archives",
      "type": "story",
      "url": "https://associationsnow.com/2022/05/the-way-things-were-why-open-access-to-the-acm-digital-library-matters/"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 31440710,
      "score": 1,
      "time": 1652997653,
      "title": "Massive Drone Swarm over Strait Decisive in Taiwan Conflict Wargames",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/massive-drone-swarm-over-strait-decisive-in-taiwan-conflict-wargames"
    },
    {
      "by": "van239439",
      "descendants": 0,
      "id": 31440687,
      "score": 2,
      "time": 1652997534,
      "title": "Can we always solve Wordle “offline” with fixed guesses?",
      "type": "story",
      "url": "https://www.poirrier.ca/notes/wordle-fixed/"
    },
    {
      "by": "vfclists",
      "descendants": 0,
      "id": 31440682,
      "score": 1,
      "text": "The title should be &quot;FairEmail developer &quot;rage quits&quot; because of unappreciative cheapskate  Android users&quot; but I have to reconsider for falling foul of HN moderators, and even then I don&#x27;t think this will last.<p>Many HN users interested in FairEmail would have seen these threads by now<p>https:&#x2F;&#x2F;forum.xda-developers.com&#x2F;t&#x2F;app-5-0-fairemail-fully-featured-open-source-privacy-oriented-email-app.3824168&#x2F;page-1087<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31432334<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31433051<p>and a few more related threads.<p>They all dwell at some length on Google&#x27;s tortuous, Byzantine, capricious, whimsical, Kakfaesque, Heath Robinsonian (running out of adjectives here - will come up with few more) (dis-)approval process, but Google is Google and will never stop being Google anymore than Apple will stop being Apple.<p>I think we need to face some facts here. With over 5 million+ downloads there are not enough people upgrading to the paid version or donating to him to make it worth his while. Saying that Google is the only culprit here isn&#x27;t entirely quite true, but this act on their part may be the straw that broke the camel&#x27;s back.<p>We have to acknowledge that a lot of users take free software developers for granted as a lot of software developers acknowledge. Even Google and a lot of major tech companies are guilty of this, taking advantage of a lot of software developed for free by part-timers and enthusiast without giving anything in return. OpenSSL anyone?<p>This discussion should turn into one about how free software developers can be compensated for the time and effort into their product, even if they are not in it for the money.<p>I am a user of FairEmail and I haven&#x27;t paid for it or donated to the developer and had I known that something like this was in the offing I may have donated to it or paid for the upgrade earlier. I could argue that the interface wasn&#x27;t exactly to my liking and was looking to see some changes but that doesn&#x27;t cut it. I benefit from it and the price of the upgrade is about the same of my mobile phone subscription which I don&#x27;t use much and even less than the price of takeaway meal at my local greasejoints.<p>Let us talk more about how we compensate developers for their efforts which we benefit from. I have some ideas about this, especially in relation to software that is automatically downloaded assuming they haven&#x27;t been mooted by others before, but going into that will make this post too long. That will be another post, hopefully sooner rather than later.",
      "time": 1652997509,
      "title": "FairEmail developer quits because of unappreciative cheapskate users",
      "type": "story"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31440681,
      "score": 1,
      "time": 1652997504,
      "title": "Several ways sci-fi imagines data storage",
      "type": "story",
      "url": "https://www.hpe.com/us/en/insights/articles/8-ways-sci-fi-imagines-data-storage-1903.html"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 31440663,
      "score": 1,
      "time": 1652997386,
      "title": "Atlas V Launches Starliner's Orbital Flight Test 2 (OFT-2)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_5KGePUTq_g"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31440644,
      "score": 1,
      "time": 1652997267,
      "title": "Terraform Back End: Role-Based Access Control – Part 1",
      "type": "story",
      "url": "https://www.bti360.com/terraform-backend-rbac-pt-1/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31440640,
      "score": 2,
      "time": 1652997246,
      "title": "Great Zimbabwe",
      "type": "story",
      "url": "https://www.nationalgeographic.org/encyclopedia/great-zimbabwe/"
    }
  ]
}