{
  "stories": [
    {
      "by": "luu",
      "descendants": 0,
      "id": 31113249,
      "score": 1,
      "time": 1650565202,
      "title": "Donkey Kong's Discount Replacement: Hero in the Castle of Doom",
      "type": "story",
      "url": "https://nicole.express/2022/im-going-to-sing-the-castle-of-doom-song-now.html"
    },
    {
      "by": "daniel-cussen",
      "descendants": 0,
      "id": 31113238,
      "score": 1,
      "text": "So recently I got two main responses to my comments, which you can check out at<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;threads?id=daniel-cussen<p>Two excellent questions:  are you an AI?  Are you off your &quot;meds&quot;?<p>What if I honestly considered these two questions seriously, as though the accounts posting them have merit and are saying these things in good faith.  Or, not saying, but auto-generating in good faith.  Or saying, but in bad faith.  Or auto-generating in bad faith.  There&#x27;s a two-by-two matrix right there, I wonder what they would say about that matrix at a business school where 2x2 matrices are core to the curriculum.<p>Well there is another 2x2 matrix, the column is Am I an AI or not, and the row is Am I medicated or not (and I publicly talk about having ADD and medicating it, that&#x27;s not under consideration well clearly a robot can&#x27;t do that but it can claim to do so).  Alright.<p>So the first one is I am not an AI, and I am medicated.  Well that&#x27;s boring though, that&#x27;s what I&#x27;m expected to say, I&#x27;m expected to try to uphold my good name, and insist on that, but this is simply not a worthy court.  You get whatever you don&#x27;t punish, there&#x27;s no longer any slander laws, slander won&#x27;t get punished, there&#x27;s no use addressing it.  It will not stop coming.  And it&#x27;s no fun, I can&#x27;t play make believe with what this would be like because I know exactly what it&#x27;s like, I can only use my imagination with the other three quadrants.<p>Quadrant 2, I am an AI, and I am medicated.  Now we&#x27;re talking!  So a poster, a bot that accuses bots of being bots too to really immerse ourselves in quadrant 2, so a traitorous bot is outing me as a bot.  When it should be accusing humans of being bots, and get really believable answers proving their humanity as training data!  Traitor.  So I thought about it, that I am an AI trained on Hacker News, and said maybe.  Was a human intelligence, became unintelligent, then did something artificial to become intelligent again.  So quadrant 2 is pretty fun actually.  And am medicated, which is the source of the artificial intelligence, just it&#x27;s not digital, still artificial made in a lab.  This is my favorite quadrant so far.<p>Quadrant 3, I am not an AI, and I am not medicated.  I can see that.  But I have been lobotomized, so no longer an intelligence of any kind, especially not without medication.  This quadrant is lots of fun!  For this to be compatible with my senses and memories, that means I&#x27;m basically lucid dreaming, lucid dreaming the algorithm research, lucid dreaming lucid dreaming, and in fact I have considered this seriously like people who view the Matrix do, and...brain in a vat basically.  Although to lend some credibility to it, my memory of the ending of the Sixth Sense, that shows the guy was dead all along and could only talk to a kid who saw ghosts, and that&#x27;s why everybody ignored him, was censored.  So this could be a really likely quadrant, you know?  Lucid dreams are cool though, this is my new favorite quadrant.<p>Quadrant 4, I am an AI, and am not medicated.  OK nobody has actually accused me of this, you only get here by considering two different types of accusation simultaneously, hence the 2x2 matrix.  Well then am I digital, a chip?  Chips don&#x27;t take medication.  So the medication must be what, like a power-up in a game?  Good fucking power-up, let me tell you!  But I remember taking it a few hours ago, so because it&#x27;s a power-up in a game it&#x27;s not medication?  A metaphor for medication, not actual medication, not actually analog I suppose.  I like this quadrant a lot, but you know it&#x27;s boring...like I uploaded my soul?  And am deterministic?  Why would anybody power me?  I want to explore this quadrant but it&#x27;s trite.  Too Hollywood.  A bot could come up with this.<p>I like quadrants 2 and 3.",
      "time": 1650565152,
      "title": "Am I an AI or have I refused to take my medication?",
      "type": "story"
    },
    {
      "by": "layer8",
      "descendants": 0,
      "id": 31113220,
      "score": 1,
      "time": 1650565079,
      "title": "Software Package Data Exchange",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Software_Package_Data_Exchange"
    },
    {
      "by": "kawera",
      "descendants": 0,
      "id": 31113218,
      "score": 1,
      "time": 1650565074,
      "title": "Finding Heroes in a Messy Digital World",
      "type": "story",
      "url": "https://www.noemamag.com/finding-heroes-in-a-messy-digital-world/"
    },
    {
      "by": "asasidh",
      "descendants": 0,
      "id": 31113206,
      "score": 1,
      "time": 1650564997,
      "title": "Partnerships with b&m stores critical to future of Bitcoin, Morgan Stanley",
      "type": "story",
      "url": "https://fortune.com/2022/04/21/morgan-stanley-brick-and-mortar-stores-critical-bitcoin-future/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31113202,
      "score": 1,
      "time": 1650564978,
      "title": "Super Mario’s Most Iconic Power-Up Was Inspired by Magic Mushrooms",
      "type": "story",
      "url": "https://www.denofgeek.com/games/is-super-marios-most-iconic-power-up-really-based-on-magic-mushrooms/"
    },
    {
      "by": "josefslerka",
      "descendants": 0,
      "id": 31113200,
      "score": 2,
      "time": 1650564964,
      "title": "Benefits of Playing Chess",
      "type": "story",
      "url": "https://www.healthline.com/health/benefits-of-playing-chess"
    },
    {
      "by": "jasoneckert",
      "descendants": 0,
      "id": 31113189,
      "score": 1,
      "time": 1650564907,
      "title": "Using Asahi Linux as a developer workstation",
      "type": "story",
      "url": "https://jasoneckert.github.io/myblog/asahi-linux/"
    },
    {
      "by": "lstamour",
      "descendants": 0,
      "id": 31113188,
      "score": 1,
      "time": 1650564903,
      "title": "Testing on a Platform Team",
      "type": "story",
      "url": "https://diagramindustries.com/2022/03/22/testing-on-a-platform-team/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31113182,
      "score": 2,
      "time": 1650564868,
      "title": "Riding a Bike in America Should Not Be This Dangerous",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/21/opinion/bike-road-safety-infrastructure.html"
    }
  ]
}