{
  "stories": [
    {
      "by": "stichers",
      "descendants": 0,
      "id": 31259269,
      "score": 1,
      "time": 1651665495,
      "title": "Scientific collaborations are precarious territory for women",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01204-1"
    },
    {
      "by": "Mordisquitos",
      "descendants": 0,
      "id": 31259252,
      "score": 2,
      "text": "There has been a lot of news lately regarding Pegasus spyware, whose devices were found to have been infected, whether it was via 0-click exploits or spear-phishing, as well as speculations on the guilty part(y|ies), etc. Also, I&#x27;m sure there&#x27;s a lot of discussion going around in IT security communities regarding this or that CVE that was exploited and how.<p>However, I&#x27;m really missing something in between: moderately in-depth technical explanations aimed at non-security-professionals, i.e. something that the &quot;educated layperson&quot; may find interesting.<p>Is there anything of the sort, for those of us who are curious as to what Pegasus does and how, and how it has been detected, but who are neither satisfied with the mainstream news glossing over any technical detail nor have the time or the knowledge to delve into detailed professional analyses? Or is it all being handled at such levels that there&#x27;s nothing really approachable at the moment?",
      "time": 1651665352,
      "title": "Ask HN: Do you know of any good sources on the technical side of Pegasus?",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 31259226,
      "score": 1,
      "time": 1651665149,
      "title": "Bootstrapping with Ruby on Rails Generators and Templates",
      "type": "story",
      "url": "https://blog.appsignal.com/2022/05/04/bootstrapping-with-ruby-on-rails-generators-and-templates.html"
    },
    {
      "by": "Kaibeezy",
      "descendants": 0,
      "id": 31259211,
      "score": 2,
      "time": 1651665022,
      "title": "The QE Tube: What’s in a Name?",
      "type": "story",
      "url": "https://www.londonreconnections.com/2016/the-qe-tube/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31259208,
      "score": 1,
      "time": 1651664986,
      "title": "Project Gemini",
      "type": "story",
      "url": "https://gemini.circumlunar.space/"
    },
    {
      "by": "tejinderss",
      "descendants": 0,
      "id": 31259206,
      "score": 2,
      "text": "I cannot help but wonder, where is our software industry heading? There are overly complicated solutions to simple problems, huge push for moving to fancy stacks just for the sake of moving. Distributed systems? Kubernetes? Rust for CRUD apps? Blockchain, NoSql, crypto, micro-frontends and the list goes on and on. Its gone too extreme to the point where no one is exempt from these things anymore. Couple of years ago, I thought, its fine as long as I am not involved in this complexity, I can turn a blind eye towards it. But now, this unnecessary complexity has seeped in my day job as well. Managers start talking about &quot;micro services&quot;, &quot;writing&quot; kubernetes operators in Go, moving away from python (because its too &quot;slow&quot;); someone recently gave a talk in my company, how to make a 500 line python script (which heavily involves in-efficient handling of IO) go faster with Rust.\nSomeone else talks about that we need to move our poly repos into mono-repo because that where the leaders of the industry are moving to.\nI cannot help but wonder, that we have possibly screwed ourselves pretty bad, and there is no escape from it. The vocal minority tries to push these overly complex solutions down everyone&#x27;s throats, and management loves this, because it creates &quot;work&quot; for the sake of it, but it doesn&#x27;t add any real business value.<p>What are your thoughts on this? Will industry move towards simple solutions after experiencing this churn down the line or are we doomed forever?",
      "time": 1651664972,
      "title": "Ask HN: Have we screwed ourselves as software engineers?",
      "type": "story"
    },
    {
      "by": "edent",
      "descendants": 0,
      "id": 31259201,
      "score": 2,
      "time": 1651664919,
      "title": "How should user comments be marked up in HTML5?",
      "type": "story",
      "url": "https://shkspr.mobi/blog/2022/05/how-should-user-comments-be-marked-up-in-html5/"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31259195,
      "score": 1,
      "time": 1651664889,
      "title": "Vtm: Terminal multiplexer with window manager and session sharing",
      "type": "story",
      "url": "https://github.com/netxs-group/vtm"
    },
    {
      "by": "car_analogy",
      "descendants": 0,
      "id": 31259180,
      "score": 2,
      "time": 1651664771,
      "title": "What does it mean for your computer to be loyal?",
      "type": "story",
      "url": "https://www.gnu.org/philosophy/loyal-computers.html"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31259166,
      "score": 1,
      "time": 1651664672,
      "title": "Server-side vs. Client-side Analytics",
      "type": "story",
      "url": "https://daverupert.com/2022/04/server-side-vs-client-side-analytics/"
    }
  ]
}