{
  "stories": [
    {
      "by": "axiomdata316",
      "descendants": 0,
      "id": 31732881,
      "score": 1,
      "time": 1655161746,
      "title": "Homebrew an OS from Scratch",
      "type": "story",
      "url": "https://hackaday.com/2022/06/11/homebrew-an-os-from-scratch-snowdrop-shows-how-its-done/"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 31732872,
      "score": 1,
      "time": 1655161675,
      "title": "AeroPress Championship Winner, 2017",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=NVcgSBJFhgM"
    },
    {
      "by": "ruraltech",
      "descendants": 0,
      "id": 31732856,
      "score": 1,
      "text": "There has to be a way to block Automatic Content Recognition (ACR). While I don&#x27;t have a Roku any longer, I do have a Firestick, which I&#x27;m sure gathers similar data. The more we learn, the more we learn we&#x27;re being tracked. I know FreeTube allows you to proxy your connection to prevent YouTube from seeing who you are (I don&#x27;t trust this 100%). Any thoughts on defeating ACR other than the increasingly-rare non-smart TV. Maybe a computer and large TV not internet enabled.<p>https:&#x2F;&#x2F;www.nasdaq.com&#x2F;articles&#x2F;1-big-reason-why-roku-wants-you-to-buy-a-roku-tv",
      "time": 1655161549,
      "title": "Why Roku wants you to buy a Roku TV",
      "type": "story"
    },
    {
      "by": "samilAyoub",
      "descendants": 1,
      "id": 31732841,
      "kids": [
        31732842
      ],
      "score": 1,
      "time": 1655161461,
      "title": "The Best Code Is No Code",
      "type": "story",
      "url": "https://www.vianocode.com/"
    },
    {
      "by": "lopatin",
      "descendants": 1,
      "id": 31732823,
      "kids": [
        31732836
      ],
      "score": 2,
      "time": 1655161308,
      "title": "Another algorithmic stablecoin loses its peg as Tron’s USDD falls",
      "type": "story",
      "url": "https://fortune.com/2022/06/13/algorithmic-stablecoin-usdd-loses-peg-justin-sun-tron-decentralized-usd/"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 31732790,
      "score": 1,
      "time": 1655161045,
      "title": "Ancient South Arabian Script",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ancient_South_Arabian_script"
    },
    {
      "by": "martin_a",
      "descendants": 2,
      "id": 31732767,
      "kids": [
        31732807
      ],
      "score": 1,
      "text": "I&#x27;ve been sick two weeks ago and had lots of time to spare while laying on the couch. I used that for viewing too much stuff on YouTube.<p>Here are some findings (German user) and I&#x27;d like your experience on this. Maybe it&#x27;s anecdotal but I&#x27;ve got the feeling YouTube is really going down the drain.<p>- _lots of_ ads everywhere<p>- I got unskippable 15 second pre-roll ads on 17 second videos<p>- I got three pre-roll ads regularly, even on short videos and smaller channels<p>- I got lots of post-roll ads, too<p>- I&#x27;ve got lots of video ads where pharmaceutical companies are promoting to &quot;talk to your doctor about the vaccine for XY&quot; - wtf, is this even legal?<p>- Ads load better than the video<p>- In-App ads are directly from the shady&#x2F;scummy section: &quot;get rich quick&quot;-schemes&#x2F;courses, cartoonish erotic apps, phone optimizer apps, &quot;lose 30 pounds in 30 days&quot;-fitness apps, &quot;free&quot; book downloads with signup pages from hell, probably fake IPO signups, crypto investment apps... the list goes on...<p>- after reporting too many of those ads, I&#x27;ve lost the function to report any ad at all. I&#x27;m not kidding, the menu item is just gone.<p>- recommendations are showing me lots of videos I&#x27;ve watched before OR are totally unrelated to what I&#x27;m interested in<p>- recommendations are often filled with videos from 6 to 10 years ago<p>All in all YouTube seems to be a total shitshow and it feels like they don&#x27;t care anything at all about the user experience.<p>With all those scummy ads I felt like 15 years ago on some crazy &quot;free movie downloadz&quot;-website but not on THE biggest video platform of the world.<p>Does Google&#x2F;YT care so little? Have they automated and laid off everybody who could veto against all those &quot;create your sexy arabian princess and play with her&quot;-apps or all the &quot;phone optimizers&quot; who are going to do god knows what with your phone?<p>What&#x27;s your experience on YT these days? Is it similar to mine or totally different?<p>I really like lots of the content, but the surroundings...",
      "time": 1655160866,
      "title": "Ask HN: How broken is YouTube these days?",
      "type": "story"
    },
    {
      "by": "khoobid_shoma",
      "descendants": 0,
      "id": 31732765,
      "score": 1,
      "time": 1655160859,
      "title": "Libgccjit.so: GCC as a Just-In-Time compilation library",
      "type": "story",
      "url": "https://gcc.gnu.org/wiki/JIT"
    },
    {
      "by": "skibz",
      "descendants": 0,
      "id": 31732747,
      "score": 1,
      "time": 1655160706,
      "title": "Firefox OS",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Firefox_OS"
    },
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 31732716,
      "score": 1,
      "time": 1655160494,
      "title": "Cat Lady AI",
      "type": "story",
      "url": "https://nothingeverhappensto.me/cat-lady-ai/"
    }
  ]
}