{
  "stories": [
    {
      "by": "svenfaw",
      "descendants": 0,
      "id": 28224836,
      "score": 2,
      "time": 1629309574,
      "title": "Apple’s biggest problem is only getting bigger",
      "type": "story",
      "url": "https://www.macworld.com/article/353387/macalope-apple-app-store-monopoly-developers-congress.html"
    },
    {
      "by": "mikeweiland",
      "descendants": 0,
      "id": 28224792,
      "score": 5,
      "text": "Hi, we&#x27;re Mike, Jon and Nick, founders of Govly (<a href=\"https:&#x2F;&#x2F;www.govly.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.govly.com</a>). We’re building a place for companies, resellers, and distributors to work together to bid on government contracts.<p>The U.S. government buys lots of things. In 2021, over $218B will be spent purchasing technology products alone. The problem is, it&#x27;s super confusing to participate in the market.\nYou have to understand the rules, have the right connections to government contractors, have a record of strong performance selling to the government, and usually a sales force focused specifically on government sales. This friction leads to fewer companies (especially smaller companies) participating, less competition, and ultimately the government buying the loudest or most insider-connected products instead of the best or most innovative.<p>Mike and Jon have been experiencing this problem for the last 15 years at various technology manufacturers, technology resellers and government contractors. As we saw little improvement in the process throughout this time, we ultimately decided to try to improve it ourselves with Govly.<p>Currently, Govly serves as a platform where all the stakeholders in government procurement (manufacturers, distributors, value added resellers, prime contractors and government agencies) can securely share information about things the government wants to buy and then collaborate on fulfilling those purchases (talk through specs, iterate on quotes, etc.).  Most people don’t realize, but the vast majority of government opportunities are only released to a subset of organizations called “prime contractors”. Govly has created a network of these prime contractors who are ingesting their “private” opportunities into our application. These opportunities can then be shared to other stakeholders in the network via &quot;Govly partnerships&quot;, which are like friend requests between the different organizations, e.g. prime contractor → manufacturer.<p>We&#x27;ve also built automation tools that help prime contractors stay compliant in their work and with the agencies they work with. Many government opportunities are required to go through a specific channel called a &quot;contract vehicle&quot; which are typically managed by specific agencies.  For example, one of the largest and oldest contract vehicles is managed by NASA and is called NASA SEWP (Scientific and Engineering Workstation Procurement). This is actually how you become a &quot;prime contractor&quot; in the first place: if you apply for access to a contract vehicle, and you&#x27;re selected, you&#x27;re a prime contractor. Once you are a prime contractor, you&#x27;re required to do various reporting tasks in order to stay compliant on your contracts. As you can imagine, there is a <i>lot</i> of bureaucratic detail with that. We&#x27;ve built automations to make it easier.<p>This space is exceedingly complicated and confusing but it also has a ton of room for tech-enabled efficiency, transparency, and growth. We plan to chip away at the problems we find until we can change the system into the simpler, fairer, more efficient system we know it can be...or at least bite off some pieces that can.<p>On the technical side, we’ve had fun solving some low hanging fruit that has made a huge difference in the lives of our customers. For example, the way that opportunities on contract vehicles are distributed is mostly via email. Companies were managing this by receiving thousands of emails per day and creating email filters to try to filter down to opportunities of interest. The first iteration of our product allowed them to redirect emails to our system so they could be parsed and indexed in Elasticsearch. We then helped them build specific queries as saved searches so they could get instant notifications when a new match hit, or a digest of match activity for the day. It was cool to create such a simple solution that immediately provided substantial value for end users.<p>Anyways, thanks for taking the time to read our story. There is a free version of Govly that you can poke around if you&#x27;d like. It essentially scrapes public opportunities from <a href=\"https:&#x2F;&#x2F;sam.gov\" rel=\"nofollow\">https:&#x2F;&#x2F;sam.gov</a> and provides our search and saved search interface on top of the data. To be honest, it probably is not of much interest to the readers here <i>and</i> the public version has not been a priority (so it&#x27;s not that good...) Regardless, if you want to check us out at <a href=\"https:&#x2F;&#x2F;www.govly.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.govly.com</a>, any and all feedback is appreciated!",
      "time": 1629309368,
      "title": "Launch HN: Govly (YC S21) – Where companies collaborate on government contracts",
      "type": "story"
    },
    {
      "by": "gautamsomani",
      "descendants": 0,
      "id": 28224785,
      "score": 1,
      "time": 1629309344,
      "title": "A Beginner’s Introduction to Python Web Frameworks",
      "type": "story",
      "url": "https://stxnext.com/blog/2018/09/27/beginners-introduction-python-frameworks/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28224783,
      "score": 1,
      "time": 1629309342,
      "title": "Why is it so hard to investigate the rare side effects of Covid vaccines?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-021-00880-9"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28224760,
      "score": 1,
      "time": 1629309255,
      "title": "Kasm Workspaces – Streaming containerized apps and desktops to end-users",
      "type": "story",
      "url": "https://www.kasmweb.com/"
    },
    {
      "by": "spullara",
      "descendants": 0,
      "id": 28224759,
      "score": 1,
      "time": 1629309252,
      "title": "Bitcoin Mixing CEO Harmon Pleads Guilty to US Money-Laundering Charge",
      "type": "story",
      "url": "https://finance.yahoo.com/news/bitcoin-mixing-ceo-harmon-pleads-151634034.html"
    },
    {
      "by": "gautamsomani",
      "descendants": 0,
      "id": 28224751,
      "score": 1,
      "time": 1629309206,
      "title": "Introduction to LaTeX",
      "type": "story",
      "url": "https://www.overleaf.com/learn/latex/Learn_LaTeX_in_30_minutes"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 28224743,
      "score": 1,
      "time": 1629309160,
      "title": "We Need a Statue of Responsibility",
      "type": "story",
      "url": "https://ryanholiday.net/why-we-need-a-statue-of-responsibility"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 28224740,
      "score": 2,
      "time": 1629309140,
      "title": "C++20 Modules with GCC11",
      "type": "story",
      "url": "https://blog.feabhas.com/2021/08/c20-modules-with-gcc11/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28224736,
      "score": 1,
      "time": 1629309122,
      "title": "The Path to Basecamp 4",
      "type": "story",
      "url": "https://world.hey.com/jason/the-path-to-basecamp-4-7516ee5b"
    }
  ]
}