{
  "stories": [
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 29118803,
      "score": 1,
      "time": 1636118435,
      "title": "Brexit red tape knocks £17bn off UK trade with EU in just three months",
      "type": "story",
      "url": "https://www.independent.co.uk/news/uk/politics/brexit-red-tape-trade-b1951627.html"
    },
    {
      "by": "jes",
      "descendants": 0,
      "id": 29118790,
      "score": 1,
      "time": 1636118399,
      "title": "C++ String Benchmark: STL vs. ATL vs. Custom Pool Allocator",
      "type": "story",
      "url": "https://blogs.msmvps.com/gdicanio/2021/11/04/c-string-benchmark-stl-vs-atl-vs-custom-pool-allocator/"
    },
    {
      "by": "lordleft",
      "descendants": 0,
      "id": 29118788,
      "score": 1,
      "time": 1636118385,
      "title": "Spinoza's Ethics 2.0 – A new way to read Spinoza",
      "type": "story",
      "url": "https://ethics.spinozism.org/"
    },
    {
      "by": "hamaluik",
      "descendants": 2,
      "id": 29118785,
      "kids": [
        29118786,
        29118799
      ],
      "score": 1,
      "time": 1636118362,
      "title": "Show HN: My wife is pregnant; naturally I made a baby-name app to prepare",
      "type": "story",
      "url": "https://nomdebebe.app/"
    },
    {
      "by": "dcedrych",
      "descendants": 1,
      "id": 29118764,
      "kids": [
        29118769
      ],
      "score": 2,
      "text": "Hi everyone! My co-founder posted a react dev job offer here yesterday and received lots of feedback (mostly negative, yet super helpful).<p>I hire a UI designer now, here&#x27;s my job offer, would love to hear your thoughts!<p>-- JOB OFFER STARTS BELOW---<p>We&#x27;re looking for a UI designer who gets chills anytime they interact with a beautifully designed app&#x2F;product and can spark this delight by their designs too!<p>About us<p>We&#x27;re a creative team of supertalented individuals crafting supreme exp...haha, kidding. We hate this kind of fluff too, let&#x27;s be short and sweet instead!<p>We design and build cool stuff for badass companies. Why badass?<p>No name dropping, but here are a few random things our clients do:<p>- Measure brain gamma waves to help you get into the flow state\n- Build a neobank for e-commerce\n- Invest in autonomous aircrafts and blockchain protocols\n- Write famous business newsletter sent daily to 2.5M users<p>We make no promises here, but chances to work on yet another pizza delivery app are low  (But acutally you never know, possibilites to innovate are infinite)<p>About you<p>First and foremost, UI skills! We use Figma whenever possible so prior experience with this nifty tool is needed. Second, English (B2+, best C1+). You are ready to work in EU time zones, with occasional calls in the evening with our American folks (ET&#x2F;PT)<p>Also, you are able (and like) to take the lead. That&#x27;s you!<p>Here is a full list of some other desired skills. \nYOU DON&#x27;T HAVE TO TICK ALL THE BOXES.<p>UX Research\nBuilding wireframes&#x2F;wireflows\nUser interviews\nDesign systems\nInteraction&#x2F;Motion Design (Principle or similar)\nAnimation Design (After Effect, Haiku or similar)\nPrototyping (Figma, InVision or similar)\nIllustration Design\nCopywriting\nLogo&#x2F;Branding\nLow-code frontend development (Webflow)<p>What this is not<p>This is not a graphic designer role who spends most of their time creating assets for social media or funny posters. Sometimes we will need your help with Dribbble posts, case studies etc. but your primary focus will be user interface design.\nThis is not for UX designers aspiring to learn UI design. While your UX skills or willingness to learn it will be a huge advantage, we want you to be a master of sleek and crips UI design in the first place.<p>Why you might be excited about us<p>Work atmosphere. While EVERY company says they are an awesome workplace filled with amazing people, we state it with full self-awareness that you&#x27;ll love working with our team.\nOpportunity to network with founders of the hottest US and Canada based startups\nOccasional deep dives into domains like crypto &amp; web3, fintech, biotech, space and much more<p>Why You Might NOT Be Excited About Us<p>You should be comfortable with just a dash of chaos. This is not the kind of job where you show up and we tell you exactly what to do every day.\n{COMPANY} is a shamelessly pro-startup, pro-tech organization. If that’s not your thing, this place might not be your dream job.<p>Nitty Gritty<p>We enjoy remote work, but if you like to work at our office in Katowice (Poland), you are more than welcome to do so!<p>Shoot us a message below and tell us:<p>What you are good at\nWhat you are not so good at but would love to improve\nWho&#x2F;What inspires you in the UI domain\nWhat is not your cup of tea<p>Provide some background, showcase your previous work, and tell what we can do to make this collaboration fun! Btw, if you start your message with the word &quot;bananas&quot; you&#x27;ll get extra points for making it all the way here:) Also, if you use twitter and hate traditional hiring processes, you can DM us {OUR TWITTER HANDLE} and we will take it from there!<p>We&#x27;re excited to meet you! :)<p>--END---<p>Salary range, years of experience are listed as well.<p>What do you think?",
      "time": 1636118230,
      "title": "Roast My Job Offer",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 29118752,
      "score": 2,
      "time": 1636118189,
      "title": "If the universe is a giant computer simulation, how many bits would be required?",
      "type": "story",
      "url": "https://www.livescience.com/how-many-bits-in-the-universe"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 29118744,
      "score": 2,
      "time": 1636118155,
      "title": "What happens if Mark Zuckerberg right about Metaverse?",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2021/11/05/metarverse-future-innovations-proteus-effect/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29118736,
      "score": 2,
      "time": 1636118118,
      "title": "IPv6 Adoption by Country",
      "type": "story",
      "url": "https://www.google.com/intl/en/ipv6/statistics.html#tab=per-country-ipv6-adoption"
    },
    {
      "by": "FridayoLeary",
      "descendants": 0,
      "id": 29118734,
      "score": 1,
      "time": 1636118106,
      "title": "Apple’s Federighi delivers dramatic speech on dangers of sideloading",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/11/apples-federighi-delivers-dramatic-speech-on-dangers-of-sideloading/"
    },
    {
      "by": "blacktulip",
      "descendants": 0,
      "id": 29118729,
      "score": 1,
      "time": 1636118091,
      "title": "3nm Mac and iPhone chips coming in 2023",
      "type": "story",
      "url": "https://9to5mac.com/2021/11/05/mac-iphone-apple-silicon-future/"
    }
  ]
}