{
  "stories": [
    {
      "by": "onmyway133",
      "descendants": 0,
      "id": 30654757,
      "score": 1,
      "time": 1647118149,
      "title": "Test of PastePal, a clipboard manager that I can no longer do without",
      "type": "story",
      "url": "https://leblogducuk.ch/2022/03/04/test-de-pastepal-un-grand-presse-papiers-dont-je-ne-peux-plus-me-passer/"
    },
    {
      "by": "brokencode",
      "descendants": 0,
      "id": 30654744,
      "score": 1,
      "text": "I’ve been getting emails from recruiters at big tech companies multiple times a month now, and salaries have been increasing by crazy amounts. Amazon in particular seems like they have incredible hiring needs, and I hear from a different Amazon recruiter at least once a month, despite telling them “no thanks” every time.<p>With all this insatiable demand for talent, what are the working conditions like at these big tech companies? Is everybody working overtime to keep up amidst staff shortages, or have they been able to maintain a decent work&#x2F;life balance?<p>I’m asking because I feel very tempted by the booming salaries at big tech companies, but I’m more than a little worried that there is a reason these companies seem to be having a hard time acquiring or keeping talent.",
      "time": 1647118041,
      "title": "How is the work/life balance at big tech companies these days?",
      "type": "story"
    },
    {
      "by": "pirminj",
      "descendants": 0,
      "id": 30654719,
      "score": 1,
      "text": "Hey,<p>Some prose first, questions at the end.<p>After over two years I quit my student job. Besides the weekly meeting I was pretty much 100 percent of the time writing a frontend in flutter. In the beginning it was quite fun - lot&#x27;s of new stuff to learn and quick progress. But it recently evolved into this boring feature implementation treadmill where things got ever more complex, brittle, and having this falls-apart-when-you-look-at-it-wrong attitude. I got bored from it.<p>It really reduced my interest in all the other computing stuff I’ve been playing around with. So since four or five months I haven’t cared much and did just the bare baseline amount of work - But it helped a lot! Started learning how people use tmux as a window manager, what makes vim addictive to learn, why some people can’t stop talking about clojure (reading about clojure and its ecosystem, I love it), what gnu is and software ideologies&#x2F;licenses there are, people printing their own parametrized split ortho colemak keyboard. Fine stuff! Not advanced, but I&#x27;m eager understand all the parts.<p>I&#x27;m doing my masters degree in aerospace engineering, but I&#x27;m thinking more and more of putting that on pause and working in Software for some time. Having no formal software education, I want to learn new stuff. Is there enough demand for engineers that companies are willing to pay for one learning “it” on the go? If yes, what field is it? Trying to avoid cruft and mundane tasks: What kind of companies to look for and which ones to avoid? And on a more philosophical note: Can a hobby be a job without losing the fun part?",
      "time": 1647117836,
      "title": "Ask HN: Writing Software – Is it boring or am I bored?",
      "type": "story"
    },
    {
      "by": "marcobambini",
      "descendants": 0,
      "id": 30654707,
      "score": 2,
      "time": 1647117765,
      "title": "SQLite 3.8.1",
      "type": "story",
      "url": "https://sqlite.org/releaselog/3_38_1.html"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 30654704,
      "kids": [
        30654742
      ],
      "score": 1,
      "time": 1647117742,
      "title": "#RussianWarCrimes",
      "type": "story",
      "url": "https://warcrimes.gov.ua"
    },
    {
      "by": "JNRowe",
      "descendants": 0,
      "id": 30654694,
      "score": 1,
      "time": 1647117644,
      "title": "The hard part of type-checking Nix",
      "type": "story",
      "url": "https://www.haskellforall.com/2022/03/the-hard-part-of-type-checking-nix.html"
    },
    {
      "by": "mathieutd",
      "descendants": 0,
      "id": 30654693,
      "score": 1,
      "time": 1647117634,
      "title": "The Case for Induction Cooking",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/11/dining/induction-cooking.html"
    },
    {
      "by": "quercusa",
      "descendants": 0,
      "id": 30654668,
      "score": 1,
      "time": 1647117347,
      "title": "ADHD Drugs Are Convenient to Get Online. Maybe Too Convenient",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2022-03-11/cerebral-app-over-prescribed-adhd-meds-ex-employees-say"
    },
    {
      "by": "GordonS",
      "descendants": 0,
      "id": 30654629,
      "score": 2,
      "time": 1647117049,
      "title": "Hydrogen fuel could change the way aircraft work, and look",
      "type": "story",
      "url": "https://www.popsci.com/technology/hydrogen-power-reshapes-aircraft-work/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30654622,
      "score": 1,
      "time": 1647117014,
      "title": "Josephus Problem",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Josephus_problem"
    }
  ]
}