{
  "stories": [
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31838661,
      "score": 1,
      "time": 1655917223,
      "title": "Latvian Army Ready for War? Avg. Infantryman Analysis",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=VRhZATLOtsA"
    },
    {
      "by": "rmilyushkevich",
      "descendants": 0,
      "id": 31838628,
      "score": 1,
      "time": 1655917126,
      "title": "Benefits of Web Scraping for Real Estate",
      "type": "story",
      "url": "https://scrape-it.cloud/blog/benefits-of-web-scraping-for-real-estate"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31838623,
      "score": 1,
      "time": 1655917113,
      "title": "Mullvad VPN axes recurring subscriptions in the name of privacy",
      "type": "story",
      "url": "https://www.techradar.com/news/mullvad-vpn-axes-recurring-subscriptions-in-the-name-of-privacy"
    },
    {
      "by": "echen",
      "descendants": 0,
      "id": 31838620,
      "score": 1,
      "time": 1655917098,
      "title": "Meta has built a new language AI–and it’s giving it away for free",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/05/03/1051691/meta-ai-large-language-model-gpt3-ethics-huggingface-transparency/"
    },
    {
      "by": "LawrenceJ82",
      "descendants": 0,
      "id": 31838609,
      "score": 1,
      "time": 1655917042,
      "title": "How to Pick Stocks for the Long Term: A Brief Overview",
      "type": "story",
      "url": "https://www.linkedin.com/pulse/how-pick-stocks-long-term-brief-overview-lawrence-jean-louis"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31838585,
      "score": 2,
      "time": 1655916937,
      "title": "Cosmo Let AI Design Its Latest Magazine Cover",
      "type": "story",
      "url": "https://www.adweek.com/media/cosmo-let-ai-design-its-latest-magazine-cover/"
    },
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 31838573,
      "score": 1,
      "text": "Growing up in India, saving is second nature to me. It was so ingrained that I brought this to the States as my immigrant inheritance.<p>It is reflected in everything I do. I judge people who don’t ‘save for a rainy day’. I am fiscally conservative and I vote on this basis. I will totally jump entire oceans between political parties on this criteria alone. My political angst stems from mismanagement of state coffers rather than social issues.<p>I am risk averse and this too reflects in every aspect of my life..not just money. Although I can’t be accused of being ‘penny wise pound foolish’, I will walk away from adrenaline rush hooks. So I almost wear it like a badge of merit. Like it’s a secret I brought to this country and that I share with other immigrants.<p>Until it just struck me today..perhaps Americans ‘live pay check to pay check’ because they never had to save. Saving is an off shoot from uncertainty and instability. India when I was growing up was not a bed of political and economic stability. Even though we were comfortably middle class, the national anxiety seeps into homes. We also saw this here recently during the great covid toilet paper scarcity and hoarding phenomena.<p>Citizens of wealthy nations don’t save because they don’t have to as there is sufficient trust in the government. Saving is a reaction to scarcity.<p>I stopped saving a while ago, but now watching the interest rate goat rodeo, I have started thinking about it again.<p>Curious about other saving philosophies and how the latest bank shenanigans will influence ingrained stances about money at every level.",
      "time": 1655916886,
      "title": "On ‘Saving for a Rainy Day’",
      "type": "story"
    },
    {
      "by": "MarkovChain242",
      "descendants": 0,
      "id": 31838558,
      "score": 1,
      "time": 1655916854,
      "title": "A Roadmap to Zero Trust Architecture",
      "type": "story",
      "url": "https://zerotrustroadmap.org/"
    },
    {
      "by": "kjksf",
      "descendants": 0,
      "id": 31838542,
      "score": 1,
      "text": "Oh, hello. I didn&#x27;t see you there.<p>Did you ever wonder what it takes to build and launch a software product from scratch?<p>Not a high-level summary. Not a short essay that describes a year of development.<p>Detailed, day to day activities. A captain&#x27;s log.<p>Mistakes and pivots. Technology choices. Marketing activities. Design considerations.<p>You might know me as the creator of SumatraPDF.<p>I&#x27;m starting a new software product from scratch and I decided to make it an experiment of building in public.<p>I hope to inspire others to build more software by de-mystifying the process of creation.<p>I&#x27;m on day 14. It&#x27;s early but that is the point: you can follow along.<p>Here&#x27;s the daily dev diary: https:&#x2F;&#x2F;blog.kowalczyk.info&#x2F;article&#x2F;30da6655040f47e693f8e66eacd308c1&#x2F;diary-of-a-solo-dev-building-a-web-app.html<p>The product is Filerion, a web-based file browser &#x2F; file manager with support for s3, Dropbox etc.<p>I&#x27;ll be posting updates to https:&#x2F;&#x2F;twitter.com&#x2F;kjk but don&#x27;t just follow along. Start building your own stuff as well. The world needs more great software.",
      "time": 1655916783,
      "title": "Show HN: Diary of building software startup from scratch",
      "type": "story"
    },
    {
      "by": "MuchoMaas",
      "descendants": 0,
      "id": 31838529,
      "score": 1,
      "time": 1655916730,
      "title": "Voyager shares crash after warning of Three Arrows crypto loss",
      "type": "story",
      "url": "https://www.ft.com/content/d75801c9-b9dd-4f90-b012-6948cca680d0"
    }
  ]
}