{
  "stories": [
    {
      "by": "smasher164",
      "descendants": 0,
      "id": 31066100,
      "score": 1,
      "time": 1650242957,
      "title": "Project Everest: Provably Secure Communication Software",
      "type": "story",
      "url": "https://project-everest.github.io/"
    },
    {
      "by": "KarlKemp",
      "descendants": 0,
      "id": 31066098,
      "score": 1,
      "time": 1650242953,
      "title": "Censorship battles’ new frontier: Your public library",
      "type": "story",
      "url": "https://www.washingtonpost.com/nation/2022/04/17/public-libraries-books-censorship/"
    },
    {
      "by": "cam0",
      "descendants": 1,
      "id": 31065906,
      "kids": [
        31065989
      ],
      "score": 1,
      "text": "I hope this doesn&#x27;t come across as too tone deaf, but as a tech worker in the Bay Area who drives an electric car, I&#x27;ve experienced a very insignificant impact from inflation so far. Inflation is clearly real and doesn&#x27;t seem to be transitory, but even at 7(ish)% I honestly can&#x27;t say I&#x27;ve felt it. I&#x27;m very aware of the $6&#x2F;gallon gas signs around the city, but I drive an electric car and my power bill isn&#x27;t noticeably higher over the past 12-18 months. Some of the coffee shops and restaurants I frequent have raised prices very slightly, but not enough to make any real impact in my quality of life or savings rate. Inflation news articles and discussions are more and more noticeable around me, but practically speaking my life is no different than it was a year, or two, or three years ago. Am I just in a bubble?",
      "time": 1650241255,
      "title": "I've hardly noticed inflation. Am I in a bubble?",
      "type": "story"
    },
    {
      "by": "techgermy",
      "descendants": 0,
      "id": 31065901,
      "score": 1,
      "time": 1650241221,
      "title": "How to Mute Someone's Message Notification and Audio on Discord",
      "type": "story",
      "url": "https://techgermy.com/mute-someone-discord/"
    },
    {
      "by": "ImaCake",
      "descendants": 0,
      "id": 31065886,
      "score": 1,
      "time": 1650241024,
      "title": "The Latest Computer Vision Model Updates (iNaturalist)",
      "type": "story",
      "url": "https://www.inaturalist.org/blog/63931-the-latest-computer-vision-model-updates"
    },
    {
      "by": "guilhermejordan",
      "descendants": 0,
      "id": 31065885,
      "score": 1,
      "time": 1650241022,
      "title": "Crushing Krisis, the longest continuously-running blog in Philadelphia",
      "type": "story",
      "url": "https://www.crushingkrisis.com/about/"
    },
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31065876,
      "score": 4,
      "text": "Ok this is quite a different kind of Ask HN, but I just can&#x27;t help but feel saddened whenever I come across personal posts about how someone is lost, confused, stuck in a situation, feel lonely, uncertain what to do about xyz, etc.. What&#x27;s more surprising to me, is how the comments mostly center around <i>external</i> solutions. I love the HN community and how good you folks are at helping people navigating the world. But, sometimes, <i>at least sometimes</i>, what we&#x27;re missing is a way of navigating the <i>inner</i> world.<p>And surprisingly (or not surprisingly), the conventional methods like self-help advice or even therapy sometimes don&#x27;t seem to help. I know this feeling, and had to explore around to find the tools and perspectives that finally made a difference.<p>Now I don&#x27;t mean any kind of mystic &#x2F; uber-spiritual stuff. I&#x27;m a pretty realistic guy; I just think a lot and feel a lot and had to go through a lot of inner work &#x2F; personal development to get to where I am today. (If you want an idea what kind of person I am in real life, my personal instagram is https:&#x2F;&#x2F;www.instagram.com&#x2F;samhuang.sh&#x2F;)<p>To get to my point, I want to start some kind of service&#x2F;platform where people can come to talk things through and have a sustained conversation about their experience of feeling lost, confused, stuck. (I won&#x27;t be charging for this <i>ever</i>, because I don&#x27;t believe in that. Though I&#x27;ll probably have donations set up, but that&#x27;s technicalities.)<p>I&#x27;ve been giving some people at work some advice and perspectives, and they were positively surprised by the things I talked about and it seemed to help them at least get out of the cloud of confusion. I&#x27;m not trained with any formal credentials, but somehow I&#x27;ve developed enough wisdom in this area to have useful things to say.<p>The problem is, because I don&#x27;t quite know where my &quot;strengths&quot; and &quot;expertise&quot; are yet, I don&#x27;t wanna just start some Substack and make a fool out of myself pretending to be some guru when I don&#x27;t know what I&#x27;m doing yet.<p>So here in this thread, I&#x27;m hoping to invite people who are struggling with feeling lost, confused, stuck, for whatever reason, to come and seek help. And I&#x27;ll do my best to see if I can offer perspectives that may be useful. It&#x27;ll be a place where we can go deeper into some issues and have a sustained conversation about it all. And it would also be tremendously helpful to me to get some feedback on whether it did or did not help.<p>Much love,\nSam",
      "time": 1650240957,
      "title": "Ask HN: Are you lost / confused / stuck? I can try to help",
      "type": "story"
    },
    {
      "by": "pavillian",
      "descendants": 3,
      "id": 31065863,
      "kids": [
        31065884,
        31065881,
        31065933
      ],
      "score": 2,
      "text": "Why do large venues throttle reception at entrances to events? Surely if it’s for an attack vector people can just use long distance radios - 5g works inside the event, so it’s probably not a technical limitation. Im at coachella, and we cant even call an uber or lyft to get out at the end of the night. Im with somebody that works in management at a large nightclub in toronto, and she said they do this also in Toronto. What is the reasoning?",
      "time": 1650240834,
      "title": "Ask HN: Why does police limit reception at large event entrances",
      "type": "story"
    },
    {
      "by": "xqcgrek2",
      "descendants": 0,
      "id": 31065810,
      "score": 2,
      "time": 1650240425,
      "title": "Goldman Sachs Sees U.S. Recession Odds at 35% in Next Two Years",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-04-17/goldman-sachs-sees-u-s-recession-odds-at-35-in-next-two-years"
    },
    {
      "by": "AbanoubRodolf",
      "descendants": 0,
      "id": 31065790,
      "score": 1,
      "time": 1650240259,
      "title": "Artive",
      "type": "story",
      "url": "https://artivetech.com/"
    }
  ]
}