{
  "stories": [
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28772775,
      "score": 1,
      "time": 1633526244,
      "title": "Russia tells its space reporters to stop reporting on the space program",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/10/russia-tells-its-space-reporters-to-stop-reporting-on-the-space-program/"
    },
    {
      "by": "mr2loco",
      "descendants": 0,
      "id": 28772765,
      "score": 1,
      "time": 1633526205,
      "title": "Sono and Ari Motors present self charging solar-powered electric utility vehicle",
      "type": "story",
      "url": "https://wegoelectric.net/sono-ari-motors-present-self-charging-solar-powered-electric-utility-vehicle/"
    },
    {
      "by": "womitt",
      "descendants": 0,
      "id": 28772744,
      "score": 3,
      "time": 1633526068,
      "title": "The Importance of Writing in Software Engineering",
      "type": "story",
      "url": "https://codingsans.com/blog/importance-of-writing"
    },
    {
      "by": "EastOfTruth",
      "descendants": 0,
      "id": 28772743,
      "score": 1,
      "time": 1633526067,
      "title": "Two Scientists Win Chemistry Nobel for Elegant Tool for Building Molecules",
      "type": "story",
      "url": "https://www.npr.org/2021/10/06/1043612705/two-scientists-win-nobel-prize-in-chemistry-for-new-way-of-building-molecules"
    },
    {
      "by": "ikegittlen",
      "descendants": 0,
      "id": 28772729,
      "score": 1,
      "text": "We just learned her name.  It’s Frances Haugen, the ex-Facebook software engineer&#x2F;whistleblower who testified in Congress that her former employer is a greedy toad of a company that exploits our divisions and does known harm to our children.  This isn’t exactly a startling revelation by itself.  Most of us observing social media can see how it escalates issues.  Parents who are even a bit aware, realize young girls are obsessively hooked on the “look” promoted by social media.   What makes Ms. Haugen’s testimony much more potent is that on her way out the door, she grabbed thousands of pages of internal human behavior studies that FB had conducted.  Apparently, the documents show conclusively that not only had FB quantified the damage it was doing, but used the information to ramp up the hate and body shaming to increase usage and thereby advertising revenue.  According to Ms. Haugen and her purloined records, FB intentionally stoked our hatreds and the insecurities of our teen girls for money, money, money.<p>Congress is in bi-partisan full pack howl over all of this.  We’ve got big hearings, calls for FB to divest itself of some of its monopoly assets and promises that FB will be brought to heel.  Never mind that Congress can’t seem to handle a current crop of problems of its own makings, let alone effectively determine proper oversight of a private company that is exploiting technology that most in Congress will never understand.  They’ve found a new scapegoat that diverts attention away from the mess under the national Dome.<p>It’s not like Congress hasn’t been on this hunt before.  “Big Tech” has been hauled in front of Congressional Committees and lambasted repeatedly.  Beyond the jawboning, Zuckerberg, Dorsey and the host of other CEO’s have gone on, after their verbal whippings, unencumbered and fancy free.  The truth is that our political leadership not only isn’t sure what to do, but they’re scared of “Big Tech”.  With so many of us using these platforms, a mis-step and lots of votes could be lost.  While other nations are moving aggressively to regulate FB and other social media, the company is probably safe from much oversight in the land of the brave and home of the free.<p>One of the most telling of Ms. Haugen’s revelations was that “we estimate that we may action as little as 3-5% of hate and ~0.6% of V&amp;I [Violence and Incitement] on Facebook despite being the best in the world at it”.   She also testified that in the runup to the January 6th Capitol insurrection, FB actually reduced its policing of hate content.  Ms. Hauge’s assertion is that FB really has no intention of eliminating either hate content or reduce body shaming.  In fact, FB was planning an exclusive site for pre-teens to exploit that age group further.  Profits have both blinded and deafened social media.<p>Of course, we could stop being social media click bait.  We don’t have to conduct ourselves like playground bullies every time we are on social media.  We also could block the teen-harmful sites on our kids’ computers and cell phones.   Want FaceBook to do better?  Reduce our collective usage until they do.  A good old consumer boycott that can be pretty effective.  Or is social media just to powerful an influence on the human psyche and too pervasive in our lives, that it is an addition without a cure?  As we continuously fail to breech our divides and the suicide rates of our kids mounts, we need to control this technology.  Left totally to the private sector, Ms. Haugen has shown that we’re sitting ducks.<p>ihg  10-6-2021<p>If you like these commentaries, join my blog for free at: https:&#x2F;&#x2F;ikegittlen.substack.com&#x2F; and share. Let’s see what we can build together",
      "time": 1633526007,
      "title": "On Facebook Makes Us Do It",
      "type": "story"
    },
    {
      "by": "anarkafkas",
      "descendants": 0,
      "id": 28772721,
      "score": 1,
      "time": 1633525973,
      "title": "Proficient: AI assistants that help you with your job applications",
      "type": "story",
      "url": "https://proficientai.com"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 28772697,
      "score": 2,
      "time": 1633525836,
      "title": "Chinese companies are suing Amazon after getting banned for paid reviews",
      "type": "story",
      "url": "https://www.theverge.com/2021/9/29/22701144/amazon-chinese-companies-lawsuit-paid-reviews"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28772689,
      "score": 1,
      "time": 1633525788,
      "title": "Sandia Creates Global Archive of Historical Renewable Energy Documents",
      "type": "story",
      "url": "https://newsreleases.sandia.gov/csp_archive/"
    },
    {
      "by": "winternett",
      "descendants": 0,
      "id": 28772675,
      "score": 2,
      "text": "Nobody seems to remember the time back when FaceBook forced everyone on the platform to use their real name... It was exactly the point their plan to gather data matured I believe.<p>This is also why many sites and apps offer verification programs as well in my understanding... Verifying a user&#x27;s ID has been a practices for ages now, but it did nothing to stop the growth of disinformation because that&#x27;s not what verification was for IMO.<p>An unregulated private company asking you for official government documentation and your real name is definitely tracking you in my opinion. Even friends commenting with your name and family associations&#x2F;connections on your account can easily ID everyone.<p>They are not a government agency with the authority to ask people for government ID, but somehow they convinced everyone to use their real name, and it didn&#x27;t stop the decay of conduct decorum on the platform, it only served to track information more accurately.<p>Even people who have never registered for FB are indexed by them based on tagged photos and in posts that others have made about them using their names.<p>They also track people based on interactions across other apps entirely not associated with FB... That&#x27;s IMO why certain sites slowed and faulted mysteriously when their domain went offline.<p>I am willing to bet that they have a really interesting Splunk (or similar tech) dashboard they can look at and search any time they want full of analytics based on almost every human on earth.<p>Account privacy settings have always been a very ambiguous &quot;shell game&quot; with FB and other social apps, and often do not work properly, what makes anyone think a &quot;delete account&quot; request would ever be honored by such a company that manipulates it&#x27;s user base?<p>I also suspect that each of the major social platforms do the same type of info gathering to varying extents as well.<p>This is some serious &quot;James Bond island cave villain&quot; stuff, and whatever congressional action comes next (if anything does) may tell us where the future is going for our privacy and personal info rights...<p>The only possible way people can protect themselves from being tracked and indexed by social app companies is by not sharing their data at all, by telling friends and family to not share info about them online, and by obeying all (government) laws.<p>Imagine a future where location tracking, where your phone is a device that you paid a lot for, but it secretly shares information with companies that you visit a specific donut shop, and in turn for that your health insurance provider has access to that information to guide them in charging you higher insurance rates, or as an excuse to deny your clam... That is only a light scenario of how your data can be unknowingly be used against you and nobody knows you&#x27;re saving location data even when the setting is disabled.",
      "time": 1633525697,
      "title": "Some serious “James Bond island cave villain” stuff",
      "type": "story"
    },
    {
      "by": "slategruen",
      "descendants": 0,
      "id": 28772667,
      "score": 1,
      "time": 1633525621,
      "title": "Ask HN: Why does Apple lag behind fast charging technology?",
      "type": "story"
    }
  ]
}