{
  "stories": [
    {
      "by": "screeny05",
      "descendants": 0,
      "id": 29242966,
      "score": 1,
      "time": 1637081976,
      "title": "NPM fixes private package names leak, serious authorization bug",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/npm-fixes-private-package-names-leak-serious-authorization-bug/"
    },
    {
      "by": "zhoujianfu",
      "descendants": 0,
      "id": 29242946,
      "score": 1,
      "time": 1637081914,
      "title": "Samba TV S-1",
      "type": "story",
      "url": "https://www.sec.gov/Archives/edgar/data/0001542022/000119312521330633/d179999ds1.htm"
    },
    {
      "by": "holonomically",
      "descendants": 0,
      "id": 29242934,
      "score": 1,
      "time": 1637081861,
      "title": "Social Media: Influences and Impacts on Culture",
      "type": "story",
      "url": "https://link.springer.com/chapter/10.1007/978-3-030-52249-0_33"
    },
    {
      "by": "sigfriedcub1990",
      "descendants": 1,
      "id": 29242928,
      "kids": [
        29242929
      ],
      "score": 1,
      "time": 1637081836,
      "title": "Webpack-Config-Plugins",
      "type": "story",
      "url": "https://github.com/merkle-open/webpack-config-plugins"
    },
    {
      "by": "jaxxstorm",
      "descendants": 0,
      "id": 29242914,
      "score": 1,
      "time": 1637081809,
      "title": "Infrastructure as Code – Crash Course",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=EtEb40LE5zQ"
    },
    {
      "by": "oblib",
      "descendants": 0,
      "id": 29242910,
      "score": 1,
      "time": 1637081789,
      "title": "Personality Type, as Well as Politics, Predicts Who Shares Fake News",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/personality-type-as-well-as-politics-predicts-who-shares-fake-news/"
    },
    {
      "by": "SquibblesRedux",
      "descendants": 0,
      "id": 29242905,
      "score": 1,
      "time": 1637081770,
      "title": "Amazon push for lower prices could be bad for shoppers everywhere",
      "type": "story",
      "url": "https://techxplore.com/news/2021-11-amazon-prices-bad-shoppers.html"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 29242904,
      "score": 1,
      "time": 1637081761,
      "title": "German Ministry of Information Security leaked one of its PGP private keys",
      "type": "story",
      "url": "https://twitter.com/seecurity/status/1460518804690194432"
    },
    {
      "by": "lauriswtf",
      "descendants": 2,
      "id": 29242872,
      "kids": [
        29242897
      ],
      "score": 1,
      "text": "We&#x27;re two software geeks trying to build our own trading simulator app for beginners which could teach some basics of technical analysis and won&#x27;t be too boring.<p>You can join the early test program here if interested:\nhttps:&#x2F;&#x2F;threeinvesteers.com&#x2F;<p>Do you think this is a decent idea?<p>So far we&#x27;ve solved the main technical challenges and built a solid backend solution for real-time prices, and also got the first feedback regarding the concept from some early users.<p>We&#x27;ve polished the idea slightly using the feedback but still have some open questions.<p>Would be great to hear your feedback.<p><i>The problem we&#x27;d like to solve</i><p>Traditional paper trading is nice to test out a platform, but apart from that, it doesn&#x27;t teach you much.<p>If you can go all-in without consequences, there is no reason not to just “gamble”.<p>Nothing to win, nothing to lose creates totally different psychology from real trading.<p><i>Here&#x27;s our upgraded idea</i><p>A trading simulator for beginners with real-time market prices (stocks, FX, crypto) where users have limited chances to perform wild YOLO bets and are motivated to learn something.<p><i>How we could do it</i><p>1. Motivation. To boost motivation, three top-performing users receive real money prizes (probably Amazon gift cards) each week.<p>2. YOLO management. To avoid users making reckless  bets that leave the results almost essentially resting on luck rather than skills, we could implement the following things:\nTrade size capped to a max of X% of available cash.\nLeaderboard rank not using plain returns, but risk-adjusted returns or&#x2F;and by setting a max drawdown limit.<p>3. Learning.\nUsers gain initial &amp; extra game money by completing educational quizzes.\nInteractive pattern recognition training module, where users are presented with selected trading setup ideas on live charts (pattern, S&amp;R levels, trendlines, MAs, etc.) and can test them by placing simulated trades. This way beginner users could learn a thing or two of what goes in a trading setup. Also, they could get a reality check when seeing that even good-looking setups can often fail... without burning their student loan.<p><i>What I&#x27;m still not sure about</i><p>To pay for the market data and prize money we would obviously need some form of paid features.<p>What could be a good and fair option, in your opinion?<p>A small participation fee or perhaps some in-app purchases like more education materials and quizzes, a wider choice of assets, extra leverage,...?",
      "time": 1637081640,
      "title": "Show HN: Early version of trading simulator game. Would love your feedback",
      "type": "story"
    },
    {
      "by": "zoobab",
      "descendants": 0,
      "id": 29242870,
      "score": 1,
      "time": 1637081637,
      "title": "EPP oppose mandatory interoperability of Facebook Twitter in DMA directive",
      "type": "story",
      "url": "https://twitter.com/why0hy/status/1459984805106434048"
    }
  ]
}