{
  "stories": [
    {
      "by": "Ahmedb",
      "descendants": 0,
      "id": 30014550,
      "score": 1,
      "time": 1642711128,
      "title": "Ganache 7 Ethereum Simulator",
      "type": "story",
      "url": "https://trufflesuite.com/blog/introducing-ganache-7/"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30014548,
      "score": 1,
      "time": 1642711120,
      "title": "Postnatal depression in dads: The science underlining this overlooked condition",
      "type": "story",
      "url": "https://www.sciencefocus.com/news/postnatal-depression-in-dads-the-science-underlining-this-overlooked-condition/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30014483,
      "score": 1,
      "time": 1642710906,
      "title": "Apple Should Bring Back Dashboard",
      "type": "story",
      "url": "https://512pixels.net/2022/01/apple-should-bring-back-dashboard/"
    },
    {
      "by": "edtechdev",
      "descendants": 0,
      "id": 30014482,
      "score": 1,
      "time": 1642710906,
      "title": "With Covid-19, Air Is Both the Problem and the Solution",
      "type": "story",
      "url": "https://www.mcgill.ca/oss/article/covid-19/covid-19-air-both-problem-and-solution"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30014478,
      "score": 1,
      "time": 1642710903,
      "title": "Reverse Engineering 101",
      "type": "story",
      "url": "https://malwareunicorn.org/workshops/re101.html#0"
    },
    {
      "by": "jen20",
      "descendants": 0,
      "id": 30014469,
      "score": 1,
      "time": 1642710880,
      "title": "Gotta-watch-em-all: Memory usage monitor for process trees",
      "type": "story",
      "url": "https://github.com/AaronFriel/gotta-watch-em-all"
    },
    {
      "by": "realseannewman",
      "descendants": 0,
      "id": 30014465,
      "score": 1,
      "time": 1642710874,
      "title": "Ask HN: What’s your take on unlimited vacation?",
      "type": "story"
    },
    {
      "by": "craigc",
      "descendants": 0,
      "id": 30014463,
      "score": 1,
      "time": 1642710858,
      "title": "Infantilizing the Computing Public",
      "type": "story",
      "url": "https://lapcatsoftware.com/journal/1.html"
    },
    {
      "by": "tayllan",
      "descendants": 0,
      "id": 30014461,
      "score": 2,
      "text": "Hey HN,<p>Software Debugging is to me the funnest part of software development, and it occurred to me to write a book on it, adding some of my experience to the area.<p>As an entry point to the book, I thought of writing a Review Paper on the subject, and as such, I have to read as many papers as I can find to review. So my question is: do you have a paper recommendation on Software Debugging that&#x27;s not in the list below? Any other tips or advice on writing a paper are also welcome. Thanks much.<p>BIG LIST FOLLOWS:<p>Application of Dynamic Slicing in Program Debugging<p>Automatic Debugging Approaches: A Literature Review<p>Debugging and the the Experience of Immediacy<p>Debugging Scandal: The Next Generation<p>Designing the Whyline: A debugging interface for asking questions about program behavior<p>Generalized Algorithmic Debugging and Testing<p>Fostering Debugging Communities on the Web<p>If I Only Changed the Software, Why Is the Phone on Fire?<p>Interprocedural Slicing Using Dependence Graphs<p>Introduction to the Special Issue on the Debugging Scandal<p>&quot;My Hairiest Bug&quot; War Stories<p>Performance Debugging for Distributed Systems of Black Boxes<p>Programming on an Already Full Brain<p>Research Issues in Software Fault Categorization<p>Scalable Omniscient Debugging<p>Software debugging, testing, and verification<p>Software Visualization for Debugging<p>Techniques for Debugging an Application (US 8,966,448 B2 patent)<p>The Errors of TEX<p>Thrown from Kansas into Oz: Collaborative Debugging when a Shared World Breaks<p>Toward a Theory of Computer Program Bugs: An Empirical Test (tho I couldn&#x27;t this one anywhere)<p>Towards a Theory of Software Development Expertise<p>Using Program Slicing In Software Maintenance<p>Yesterday, My Program Worked. Today, It Does Not. Why?<p>All from this list: https:&#x2F;&#x2F;www.monperrus.net&#x2F;martin&#x2F;empirical-studies-on-bugs<p>---<p>I also intent to read a couple of these books:<p>Debug It!<p>Debugging by Thinking<p>Debugging: The 9 Indispensable Rules<p>The Practice of Programming<p>Reversing: Secrets of Reverse Engineering<p>Why Programs Fail",
      "time": 1642710850,
      "title": "Ask HN: Software Debugging Papers?",
      "type": "story"
    },
    {
      "by": "friendlydog",
      "descendants": 0,
      "id": 30014450,
      "score": 1,
      "text": "If the technology for sound hound exists why can&#x27;t the major telecoms detect spam calls and forward to the appropriate FBI or other agencies for known robocalls?",
      "time": 1642710811,
      "title": "Ask HN: Why do we still get Spam Voicemail",
      "type": "story"
    }
  ]
}