{
  "stories": [
    {
      "by": "DemiGuru",
      "descendants": 0,
      "id": 30675908,
      "score": 2,
      "time": 1647281655,
      "title": "Microsoft is testing ads in the Windows 11 File Explorer",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-testing-ads-in-the-windows-11-file-explorer/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30675907,
      "score": 1,
      "time": 1647281654,
      "title": "Upcoming Documentary Kart Kids Der Film Tracks Germany's Future Racers (2016)",
      "type": "story",
      "url": "https://www.theverge.com/2016/6/4/11859004/kart-kids-der-film-go-karting-documentary"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30675902,
      "score": 1,
      "time": 1647281643,
      "title": "Trevor Noah’s feud with France over race, identity, and Africa, explained (2018)",
      "type": "story",
      "url": "https://www.vox.com/policy-and-politics/2018/7/19/17590302/trevor-noah-france-french-ambassador-araud-world-cup"
    },
    {
      "by": "isaacaggrey",
      "descendants": 0,
      "id": 30675882,
      "score": 2,
      "time": 1647281539,
      "title": "U.S. drivers should think in gallons per mile: report (2008)",
      "type": "story",
      "url": "https://www.reuters.com/article/us-fuel-efficiency-idUSN1925607520080619"
    },
    {
      "by": "hochmartinez",
      "descendants": 0,
      "id": 30675879,
      "score": 1,
      "time": 1647281534,
      "title": "Ketamine for the acute treatment of severe suicidal ideation",
      "type": "story",
      "url": "https://www.bmj.com/content/376/bmj-2021-067194"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30675868,
      "score": 2,
      "time": 1647281485,
      "title": "Playback (Technique)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Playback_(technique)"
    },
    {
      "by": "fbriggs",
      "descendants": 0,
      "id": 30675861,
      "score": 4,
      "text": "Hi HN, I’m Forrest of Lifecast (<a href=\"https:&#x2F;&#x2F;www.lifecastvr.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lifecastvr.com</a>), with my co-founder Mateusz. We make software to create 3D video for VR, robotics simulation, and virtual production. We convert any VR180 video or photo into our 6DOF VR video format, or into meshes compatible with Unreal Engine. Our 3D reconstruction is based on computer vision for dual fisheye lenses and deep learning.<p>VR video can be categorized as 3DOF (three degrees of freedom) or 6DOF (six degrees of freedom). 3DOF responds only to rotation, while 6DOF responds to both rotation and translation—meaning you get to move your head. VR games are 6DOF, but most VR videos are 3DOF. 3DOF can cause motion sickness and eye strain due to incorrect 3D rendering. 6DOF VR video fixes these problems for a more comfortable and immersive experience, but it is harder to make because it requires a 3D model of each frame of video.<p>There are some prototypes for 6DOF VR video systems in big tech, but they typically involve arrays of many cameras, so they are expensive, not very portable, and generate an impractical amount of data. Because of these challenges, 6DOF hasn&#x27;t been widely adopted by VR video creators.<p>In 2015 I was working on ads at Facebook, but I was more excited about VR. I built 3D cameras out of legos and GoPros, showed some of this at a hackathon, and eventually they let me do that as my day job. I was the first engineer on Facebook&#x27;s 3D VR camera team, which made Surround 360 (an open-source hardware&#x2F;software 3D VR camera), and Manifold (a ball of 20+ cameras for 6DOF). After Facebook, I was a tech lead on Lyft&#x27;s self-driving car project, and Google X&#x27;s everyday robot project.<p>I started Lifecast because I wasn&#x27;t satisfied with the progress on 6DOF VR video since I left Facebook. I learned new ideas from robotics which can improve VR video. The Oculus Quest 2 has just enough power to do something interesting with 6DOF. There have also been advances in computer vision and deep learning in the last few years that make it possible to do 6DOF better.<p>Our software makes it simple to create 6DOF VR video using any VR180 camera. It&#x27;s a GUI for Mac or Windows, which takes VR180 video or photos as input, and produces Lifecast&#x27;s 6DOF VR video format (more info: <a href=\"https:&#x2F;&#x2F;fbriggs.medium.com&#x2F;6dof-vr-video-from-vr180-cameras-2e17805ef3bc\" rel=\"nofollow\">https:&#x2F;&#x2F;fbriggs.medium.com&#x2F;6dof-vr-video-from-vr180-cameras-...</a>). VR180 video can be created with any VR180 camera; the Canon R5 is one of the best on the market right now. We make a video player for WebVR which runs on desktop, mobile or VR. Playing the videos on the Quest 2 doesn&#x27;t require installing any software, just visiting a web page in the Oculus Browser.<p>In addition to our 6DOF format, the software can also output point clouds (.pcd) or triangle meshes (.obj) compatible with Unreal Engine. We are seeing interest in using this for virtual production (2D film-making in a game engine), and creating environments for robotics simulation.<p>This recent video review&#x2F;tutorial does a nice job of explaining our tech: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_4a-RnTLu-I\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_4a-RnTLu-I</a> (video by Hugh Hou, not us). For something more interactive, the thumbnails on <a href=\"https:&#x2F;&#x2F;lifecastvr.com\" rel=\"nofollow\">https:&#x2F;&#x2F;lifecastvr.com</a> are links to demos that run in browser&#x2F;VR.<p>6DOF VR video is one piece of a larger puzzle. We envision a future where people wear AR glasses with 3D cameras, and use them to record and live-stream their experience. 3DOF is not sufficient for this because it causes motion sickness if the camera moves. We have prototypes which fix motion sickness in 3D POV VR video from wearable cameras. Watching the videos in VR feels like reliving a memory. Here&#x27;s a demo: <a href=\"https:&#x2F;&#x2F;lifecastvr.com&#x2F;trickshot.html\" rel=\"nofollow\">https:&#x2F;&#x2F;lifecastvr.com&#x2F;trickshot.html</a><p>You can download a free trial from <a href=\"https:&#x2F;&#x2F;lifecastvr.com\" rel=\"nofollow\">https:&#x2F;&#x2F;lifecastvr.com</a> after entering your email address, but do not need to create a full account. The free trial is not limited in any way other than putting a watermark on the output.<p>We’d love to hear your thoughts and experiences about VR video, virtual production and robotics.",
      "time": 1647281461,
      "title": "Launch HN: Lifecast (YC W22) – 3D video for VR",
      "type": "story"
    },
    {
      "by": "the_decider",
      "descendants": 0,
      "id": 30675860,
      "score": 2,
      "time": 1647281461,
      "title": "Ukraine has started using Clearview AI’s facial recognition during war",
      "type": "story",
      "url": "https://www.cnbc.com/2022/03/13/ukraine-has-started-using-clearview-ais-facial-recognition-during-war.html"
    },
    {
      "by": "11001100",
      "descendants": 0,
      "id": 30675856,
      "score": 1,
      "time": 1647281438,
      "title": "SpaceX Celebrates 20th Anniversary",
      "type": "story",
      "url": "https://twitter.com/SpaceX/status/1503380291976531968"
    },
    {
      "by": "supercoder9",
      "descendants": 0,
      "id": 30675855,
      "score": 1,
      "time": 1647281432,
      "title": "Show HN: Free Online Crypto Profit Calculator",
      "type": "story",
      "url": "https://cryp-tools.herokuapp.com/"
    }
  ]
}