{
  "stories": [
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 28461848,
      "score": 2,
      "time": 1631129067,
      "title": "LAPD officers told to collect social media data on every civilian they stop",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2021/sep/08/revealed-los-angeles-police-officers-gathering-social-media"
    },
    {
      "by": "alexandru84",
      "descendants": 0,
      "id": 28461845,
      "score": 1,
      "time": 1631129064,
      "title": "Show HN: AI batch background remover and auto image enhancement",
      "type": "story",
      "url": "https://dropbg.com"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 28461825,
      "score": 1,
      "time": 1631128955,
      "title": "The Other Sara Morrisons are ruining my inbox",
      "type": "story",
      "url": "https://www.vox.com/recode/22620276/what-to-do-when-you-get-someone-elses-email-security-vulnerabilities-gmail-inbox-invasion"
    },
    {
      "by": "iot_devs",
      "descendants": 0,
      "id": 28461815,
      "score": 1,
      "text": "Hey HN,<p>I just got an email from Google stating that they would be unable to secure myself, an European, a working visa.<p>This is before any interview.<p>I am wondering if big tech have just stopped offering H1B, if it is just Google, or maybe the period of the year which is bad, or maybe COVID?<p>Any of you got any insight?<p>Cheers",
      "time": 1631128912,
      "title": "Ask HN: Are big tech companies not sponsoring H1B anymore?",
      "type": "story"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 28461794,
      "score": 2,
      "time": 1631128786,
      "title": "Wake Up Sailors, Scurvy Is a Hoax",
      "type": "story",
      "url": "https://www.mcsweeneys.net/articles/wake-up-sailors-scurvy-is-a-hoax"
    },
    {
      "by": "Voynov",
      "descendants": 0,
      "id": 28461792,
      "score": 1,
      "text": "Hi everyone!\nI’m excited to introduce you to our product, LeaksID: https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;leaksid<p>⌛ Background\nSeveral years ago, I was confronted with a leak of a confidential document. Although the document was stored in secure file storage and a minimal circle of people had access, someone took a photo of it and put it on the network. Unfortunately, I never found out who did it. But this failure led me to the idea of   creating a solution that could protect other people (and me) from such leaks. I wanted this solution to be able to keep my documents confidential and prevent the spread of my trade secrets and intellectual property beyond the circle to which I entrusted them.<p>Solution\nWe have created a solution called LeaksID that converts any document to PDF format, enriching it with invisible steganographic marks. Absolutely everything that is on the document will be marked with the LeaksID system!<p><pre><code>  How does LeaksID work?</code></pre>\nEvery time someone opens a confidential document, they will receive a unique copy of it. Then, if someone leaks even a small fragment of it, even one drawing or table, even a paper version, even a photograph of it on a smartphone, then upon discovering such a leak, LeaksID will unambiguously determine the identity of the offender.<p>Why are we here?\nWe understand that such a solution is more interesting for large corporations and government organizations. However, we know that small startups also have something to protect from leaks: your inventions, financial statements, and other sensitive documents. Therefore, we made it possible for everyone to use our fully functional version of LeaksID for free.<p><pre><code>  Store your documents in the systems you’re used to, use mail systems and instant messengers that you trust, but before sending documents to someone, run them through LeaksID, enrich them with anti-leak marks, and prevent illegal publication of your trade secrets.\n</code></pre>\nWe would be happy to receive any feedback from you to improve LeaksID!<p>I will be happy to answer any questions you may have.",
      "time": 1631128750,
      "title": "LeaksID – protects docs with invisible anti-leak marks against photo/publishing",
      "type": "story"
    },
    {
      "by": "cellsNFT",
      "descendants": 0,
      "id": 28461791,
      "score": 1,
      "time": 1631128747,
      "title": "Show HN: My No-code NFT project",
      "type": "story",
      "url": "https://docs.google.com/spreadsheets/d/e/2PACX-1vR23bVs1Z6c-CHBoIWgnNGNktRMXgw8_nsr8uvDpu9iZVs_QM6tKRSDJFVQNeq7IU9hWyKpM1PXwUti/pubhtml#"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 28461790,
      "score": 1,
      "time": 1631128747,
      "title": "EXCLUSIVE: A Closer First Look at iPhone 14",
      "type": "story",
      "url": "https://www.frontpagetech.com/2021/09/08/exclusive-a-closer-first-look-at-iphone-14/"
    },
    {
      "by": "thechangelog",
      "descendants": 0,
      "id": 28461789,
      "score": 1,
      "time": 1631128740,
      "title": "BC Vaccine Passport Data Format",
      "type": "story",
      "url": "https://dunae.ca/notes/2021/09/08/bc-vaccine-passport-format.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28461776,
      "score": 1,
      "time": 1631128666,
      "title": "There's the Wrong Way and Jacques Pépin's Way (2011)",
      "type": "story",
      "url": "http://www.nytimes.com/2011/10/19/dining/jacques-pepin-demonstrates-cooking-techniques.html"
    }
  ]
}