{
  "stories": [
    {
      "by": "MarcellusDrum",
      "descendants": 0,
      "id": 31191621,
      "score": 1,
      "time": 1651148541,
      "title": "Are there planets in our solar system with Earth-like solar eclipses?",
      "type": "story",
      "url": "https://old.reddit.com/r/askscience/comments/ud5dj5/is_there_any_other_place_in_our_solar_system/"
    },
    {
      "by": "sean_ruffatti",
      "descendants": 0,
      "id": 31191620,
      "score": 1,
      "text": "Good morning, we are working to migrate our microservices to containers by the end of the year.<p>How do developers work with containers in their local development environment? What workstation are you using? What IDE? What kind of software are you running locally? I am part of the team leading the charge. We will eventually have to roll this out to a couple hundred developers and what to get an idea of what people are doing.<p>Thank you!",
      "time": 1651148540,
      "title": "Ask HN: Local Development Environment with Containers",
      "type": "story"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 31191611,
      "score": 1,
      "time": 1651148496,
      "title": "Aware Announces Earnings, Beats Estimates by $0.03 EPS",
      "type": "story",
      "url": "https://www.defenseworld.net/2022/04/27/aware-nasdaqawre-announces-earnings-results-beats-estimates-by-0-03-eps.html"
    },
    {
      "by": "donutshop",
      "descendants": 0,
      "id": 31191610,
      "score": 1,
      "time": 1651148494,
      "title": "Russian-Born Billionaire Yuri Milner P Ledges $100MM to Help Ukrainian Refugees",
      "type": "story",
      "url": "https://www.forbes.com/sites/jemimamcevoy/2022/04/28/russian-born-billionaire-yuri-milner-pledges-100-million-to-help-ukrainian-refugees/"
    },
    {
      "by": "HumanReadable",
      "descendants": 0,
      "id": 31191599,
      "score": 1,
      "time": 1651148404,
      "title": "Snakebites kill 100k people every year, here's what you should know",
      "type": "story",
      "url": "https://forum.effectivealtruism.org/posts/WyqGircJgCBG9ivNL/snakebites-kill-100-000-people-every-year-here-s-what-you"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31191580,
      "score": 1,
      "time": 1651148241,
      "title": "Where Do Research Problems Come From?",
      "type": "story",
      "url": "https://tratt.net/laurie/blog/2022/where_do_research_problems_come_from.html"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 31191577,
      "score": 2,
      "time": 1651148183,
      "title": "Applied for Student Aid Online? Facebook Saw You",
      "type": "story",
      "url": "https://themarkup.org/pixel-hunt/2022/04/28/applied-for-student-aid-online-facebook-saw-you"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31191557,
      "score": 1,
      "time": 1651147990,
      "title": "Fedora dev team starts to simplify Linux graphics handling",
      "type": "story",
      "url": "https://www.theregister.com/2022/04/27/fedora_starts_to_simplify_linux/"
    },
    {
      "by": "iivorator",
      "descendants": 0,
      "id": 31191555,
      "score": 1,
      "text": "Hello dear reader,\nTLDR: Learn to make time to consider things properly.\nmy name is Iivo Huttunen (not really) and I am workaholic in withdrawal.\n(Hello Iivo)<p>I have word hard for 14 years now. I fucked up and now I wonder what to do with all this time \nunemployed people have. So, I practice typing, a thing I never found time for.<p>But why I am talking about that, instead of telling you how great things I did through my career, list my successes and so on?<p>Lessons learned – best lessons are learned by witnessing, experiencing things which go wrong. \nWisdom is often acquired the hard way.<p>Honesty is the basis of trust, and trust is the basis of any meaningful communication, and \nmeaningful communication is the basis of awareness, and awareness is the basis of success.\nHow could I expect honesty, if I do not practice it myself?<p>How can one judge risks and make informed decisions if another is deceiving by omission (or worse)?<p>So to “speed things” up, I’ll fast forward to the part of what a good leader is in my opinion. The \nleader I strive to be.<p>Before everything, a leader must be aware – or strive to be as aware as possible. Aware of the \ncommon issues with the industry. Aware of existing ways to mitigate them. Aware if the method is yielding the intended result. Aware of the team capabilities, morale and general situation.<p>Considerate of things and people. “Barking up the wrong tree” is rarely a wining move. It is not \nenough to be aware and have access to information. The information must be given due \nconsideration, and discussion. Of course, time is limited, we must be considerate of that as well.<p>Reasonable. People often try to “renegotiate reality”. Thus, they often dismiss truthful, important (but “uncomfortable”) - information having effect on outcome. This \ninevitably leads to decrease in awareness as people communicate what others want to hear. \nI believe that “yesmanship” is highly harmful to a product and organization.<p>Open minded – that helps immensely with above mentioned points. Technology is complex – people \neven more so. A good leader must be ready to consider unorthodox approach, sometimes.<p>To “quickly” mention few common problems I am painfully aware of, have explored, discussed and \nconsidered for years, have reasonable expectations towards, and remained open minded to new solutions. Things which are often sacrificed on the altar of “timely delivery” – yet essential for said delivery, general productivity, cost and so on.<p>Continuous skill development. Tech skills have a rather short expiration date. Many possible ways to mitigate that, but an eternal struggle – especially who will bear the costs of it. The “company” always end up paying the lion’s share of it indirectly. I think accepting that and having a coherent approach to that is better.<p>Onboarding. You can have person with decades of experience fail miserably due to improper \nonboarding. Improper onboarding can be horribly costly. Very complex topic, but documentation, \ntest coverage, building trust helps.<p>Maintenance, testing and maintainability – another thing which is often neglected, as its value is not immediate obvious. It is somehow assumed developers take care of it “on the side” at no cost.<p>Scope management – this is probably the holy grail of software development. Plans and estimations will eventually need to survive contact with reality. They will need to be adjusted; this is something we simply must accept.<p>Team morale and communication – impatient often goes with unreasonable and unfair. Even the \nmost cooperative people have their limits. In my experience it’s not so much about how good or bad \ncommunicators people are, but what information they are willing to communicate.  Some of the least structured “messy” communications often yield the most valuable insight.",
      "time": 1651147981,
      "title": "Thougths on SW development leadership and workaholism",
      "type": "story"
    },
    {
      "by": "hjxgoliath",
      "descendants": 1,
      "id": 31191551,
      "kids": [
        31191625,
        31191553
      ],
      "score": 4,
      "time": 1651147938,
      "title": "Show HN: A Python Web Framework with Rust Runtime",
      "type": "story",
      "url": "https://www.sanskar.me/hello_robyn.html"
    }
  ]
}