{
  "stories": [
    {
      "by": "bakuninsbart",
      "descendants": 0,
      "id": 29464801,
      "score": 1,
      "text": "The darkest time of the year is upon us, at least in the northern hemisphere, and this usually means consuming a lot more art and entertainment, while cozying up at home or going to meet family. What are your strongest recently published recommendations when it comes to books, movies, games etc.?",
      "time": 1638820770,
      "title": "Ask HN: What is your favorite piece of entertainment of the last three years?",
      "type": "story"
    },
    {
      "by": "okozzie",
      "descendants": 0,
      "id": 29464785,
      "score": 1,
      "time": 1638820702,
      "title": "Show HN: I redesigned my landing page to be as unprofessional as possible",
      "type": "story",
      "url": "https://straw.page?ref=hn"
    },
    {
      "by": "MadsRC",
      "descendants": 0,
      "id": 29464760,
      "score": 1,
      "text": "I was recently in a discussion with what I consider like-minded individuals. The conversation happened upon AWS accounts and how one should structure it (besides running it in an AWS Organisation... that is a no-brainer).<p>One side of the discussion meant that one should limit the amount of AWS accounts one had, due to the risk of account sprawl.<p>The other side meant that one should not impose such a restriction, as AWS accounts come with no cost and tools exists for managing them.<p>Now, I am convinced that one should use AWS accounts to house individual workloads if possible. There are of course exceptions to this, but overall I think it&#x27;s the right way to do it. With the soft limitations AWS puts in place on the number of VPCs and such, I get the feeling that AWS feels the same way. They also seem to mention something about using accounts as security barriers in their best practices.<p>I&#x27;m also convinced that plenty of organisations deal with hundreds, if not thousands of AWS accounts on a daily basis without too much issue. Now, I have no data to back this up, hence why I submitted this.<p>Could people, in rough estimates, answer this simple questions: How many AWS accounts does your organisation have?<p>50, 100, 200, 500, 1000, 1000+?<p>I&#x27;ve been in organisations with ~500 and in organisations with ~50.",
      "time": 1638820620,
      "title": "Ask HN: How many AWS accounts does your organisation have?",
      "type": "story"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29464754,
      "score": 1,
      "time": 1638820608,
      "title": "Tweeting Behavior of S&P 1500 Firms’ Executives (CEOs and CFOs)",
      "type": "story",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3975995"
    },
    {
      "by": "starwind",
      "descendants": 0,
      "id": 29464747,
      "score": 1,
      "text": "I know hn has a pretty low opinion of antivirus software. Is XProtect and a skeptical view towards links and software enough to keep it secure, or should I do something else?",
      "time": 1638820587,
      "title": "Ask HN: What's the best way to keep my Mac secure?",
      "type": "story"
    },
    {
      "by": "sschueller",
      "descendants": 0,
      "id": 29464736,
      "score": 2,
      "time": 1638820547,
      "title": "Elon Musk Demanded Cameras over Radar in Self-Driving Cars",
      "type": "story",
      "url": "https://www.businessinsider.com/elon-musk-demanded-cameras-over-radar-in-self-driving-cars-nytimes-2021-12"
    },
    {
      "by": "GSGBen",
      "descendants": 0,
      "id": 29464719,
      "score": 2,
      "time": 1638820482,
      "title": "Show HN: t2md – convert Trello to markdown folders on disk, fast",
      "type": "story",
      "url": "https://github.com/GSGBen/t2md"
    },
    {
      "by": "atomashpolskiy",
      "descendants": 0,
      "id": 29464707,
      "score": 1,
      "time": 1638820417,
      "title": "Bt 1.10 and a Thank You to contributors",
      "type": "story",
      "url": "https://atomashpolskiy.github.io/bt//2021/12/05/release_1.10/"
    },
    {
      "by": "mortenjorck",
      "descendants": 1,
      "id": 29464684,
      "kids": [
        29464698
      ],
      "score": 1,
      "time": 1638820306,
      "title": "Inside Tesla as Elon Musk Pushed an Unflinching Vision for Self-Driving Cars",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/06/technology/tesla-autopilot-elon-musk.html"
    },
    {
      "by": "ian-bateman",
      "descendants": 1,
      "id": 29464674,
      "kids": [
        29464720
      ],
      "score": 4,
      "time": 1638820257,
      "title": "Show HN: Incoggo – Free Adblocker for Paywalls",
      "type": "story",
      "url": "https://incoggo.com/"
    }
  ]
}