{
  "stories": [
    null,
    {
      "by": "jventura",
      "descendants": 0,
      "id": 30027925,
      "score": 1,
      "text": "I did ask the same question in 2016 [1] and got some really interesting answers.<p>I&#x27;m still chasing the dream of having a side-business and earning some side money, but with web apps it means mostly SaaS. Personally I hate rent-seeking behaviors (I&#x27;m not alone, it seems - &quot;Tell HN: A Conversation Needs to Be Had over Subscription Software&quot; [2]), so I&#x27;m trying to know what people are doing regarding desktop apps.<p>Are people still building desktop apps? More specifically, can you make a living (or earn some side money) in 2022 by selling a desktop app?\nPlease share it with us, or are we doomed to build web apps and SaaS for the foreseeable future?<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11658873<p>[2] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30021404",
      "time": 1642790054,
      "title": "Ask HN: Anyone making a living building desktop applications?",
      "type": "story"
    },
    {
      "by": "orkes",
      "descendants": 0,
      "id": 30027918,
      "score": 1,
      "time": 1642790045,
      "title": "How to design sales inventory Microservice based on event-driven architecture?",
      "type": "story",
      "url": "https://medium.com/deutsche-telekom-gurgaon/how-to-design-sales-inventory-microservice-based-on-event-driven-architecture-e6f67e3a2e91"
    },
    {
      "by": "birriel",
      "descendants": 0,
      "id": 30027916,
      "score": 1,
      "time": 1642790036,
      "title": "Quantum computing in silicon hits 99 per cent accuracy",
      "type": "story",
      "url": "https://newsroom.unsw.edu.au/news/science-tech/quantum-computing-silicon-hits-99-cent-accuracy"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 30027906,
      "score": 1,
      "time": 1642789998,
      "title": "A16Z Seeks Record-Breaking $4.5B for Crypto Funds",
      "type": "story",
      "url": "https://cryptobriefing.com/a16z-seeks-record-breaking-4-5b-for-crypto-funds/"
    },
    {
      "by": "mindcrime",
      "descendants": 0,
      "id": 30027870,
      "score": 2,
      "time": 1642789834,
      "title": "GNU Hyperbole: The Everyday Hypertextual Information Manager",
      "type": "story",
      "url": "https://www.gnu.org/software/hyperbole/"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 30027861,
      "score": 1,
      "time": 1642789782,
      "title": "Australia turns to backpackers as Omicron devastates workforce",
      "type": "story",
      "url": "https://www.ft.com/content/484d5c9a-826d-46da-a6ad-8003cfca01ff"
    },
    {
      "by": "saaspirant",
      "descendants": 0,
      "id": 30027857,
      "score": 1,
      "time": 1642789767,
      "title": "Free Home Snowmaking Machine Plans",
      "type": "story",
      "url": "http://snsnowmaking.com/"
    },
    {
      "by": "edjoe",
      "descendants": 0,
      "id": 30027847,
      "score": 1,
      "text": "Good is definitely the enemy of great.<p>Over the past decade, I have had a B2I EdTech company that has provided me a comfortable living without investors on my back, but for the life of me I cannot grow!<p>It was never my intention to create something big. I just wanted to live in the Caribbean, kitesurfing every day, and earn ~$4,000 per month without working too much.<p>My plan worked out and I spent a tremendous 10+ years living like a grasshopper, traveling the world, working a few hours a week and finally settling down in a beach house.<p>The problem began when I fell in love with a local girl...\nHer job was in finance for a hotel where she earned $400 a month, but she proved to be a math whiz. As she worked her way up in corporate America (online), within a couple of years of getting married, she got a job offer for a six-figure salary in Boston, where we bought a house and had a child.<p>While this may sound like a great story, my $4k&#x2F;m has recently shrunk to $3k. I have lived a decent life on the island with that money but in Boston, I am struggling to get by. Over the last couple of years, I have been searching for ways to increase my revenue but to no avail, which is why I am seeking advice from this great community.<p>About my company<p>- EdTech &#x2F; B2I (schools) &#x2F; Online tutoring &amp; OPM\n- We solve an important and interesting problem in our industry.\n- Excellent moat. Sophisticated software.\n- Very long sales cycle but very long contracts\n- 6 school partners (non-us) \n- 100% bootstrapped\n- 2 employees &#x2F; full time, offshore (developers)\n- 0 growth &#x2F; main problem: no established sales channel.<p>About me<p>White-male, 40+yo, non-English native. I grew up in a low middle class family in the middle of nowhere. My degree is from a community college. Needless to say, I am not part of any influential circles.<p>What I tried<p>1. VC &#x2F; Angels\nThe only way I could approach VC&#x2F;Angels was by cold emails. A few third-tier investors responded. They liked our mission, business model, revenue, client&#x27;s list… but we always failed their ultimate question, &quot;who is your lead investor?&quot;. \nI felt that rather than having a genuine interest in the company they are considering, most seed investors hope that the founder will introduce them to more prominent investors.\nhttps:&#x2F;&#x2F;twitter.com&#x2F;Jai__Malik&#x2F;status&#x2F;1351363787614523395?s=20<p>2. Boston seed stage\nI am aware that Boston is the 3rd startup hub but I soon realized that 90% of that money goes to MIT&#x2F;Harvard founders and&#x2F;or &gt; Series A. \nSeed round for non-MIT&#x2F;Harvard is close to non-existent.<p>3. Accelerators\nI interviewed for the TS, 500, and YC accelerators. They all rejected me. I’ve been accepted by 2nd tier accelerators but I spoke with previous founders who revealed that their entire cohort did not raise a single dollar.<p>4. Meetups\nDue to COVID, there are not many edtech meetups. Connecting with other founders did not produce any significant results.<p>5. Revenue share\nNot enough revenue.<p>What I think would work.<p>Our US competitors are all getting new contracts through RFPs.\nEach of these companies is well funded, so they hired a team of RFP experts.\nI participated in a few (it takes about 2 months) and lost them all to companies with inferior products, higher bids, but better presentations. \nRFP specialists are not motivated by equity from a bootstrapped startup. Even if they are very excited about the idea, they would not take a leap of faith.<p>...any advice?",
      "time": 1642789740,
      "title": "Ask HN: What would you do with a low income but profitable startup?",
      "type": "story"
    },
    {
      "by": "robertelder",
      "descendants": 0,
      "id": 30027804,
      "score": 1,
      "time": 1642789594,
      "title": "DIY Raspberry Pi Spectrometer Guide",
      "type": "story",
      "url": "https://github.com/leswright1977/PySpectrometer"
    }
  ]
}