{
  "stories": [
    {
      "by": "slyzmud",
      "descendants": 0,
      "id": 29617841,
      "score": 1,
      "text": "I&#x27;m a staff engineer with almost 10 years of experience working on projects that successfully saved 500k+ dollars annually. Last week I finished interviews with a well-known tech company that I would love to work for. The problem is that they made me a really low offer (45k annually) because I live in a &quot;low-cost country&quot;. I am currently making double than that and I even have another offer for 10% more than my current salary.<p>The position is for senior IC and I would love to work there because the work is super interesting and would look very well in my resume. However, the company says they can&#x27;t pay more in my country even though there&#x27;s no single employee here and they pay higher salaries in other places. What is the best strategy to convince them to pay what I think I&#x27;m worth?",
      "time": 1639944690,
      "title": "Ask HN: How to negotiate salary with a remote distributed company?",
      "type": "story"
    },
    {
      "by": "johanam",
      "descendants": 0,
      "id": 29617823,
      "score": 1,
      "time": 1639944627,
      "title": "Someone attached an Apple AirTag to the underside of my front wheel well",
      "type": "story",
      "url": "https://twitter.com/elsiejlee/status/1472617145519558657"
    },
    {
      "by": "dricornelius",
      "descendants": 0,
      "id": 29617815,
      "score": 1,
      "time": 1639944584,
      "title": "His body has been viewed by millions, but we don’t even know his name",
      "type": "story",
      "url": "https://www.smh.com.au/national/his-body-has-been-viewed-by-millions-but-we-don-t-even-know-his-name-20181219-p50n56.html"
    },
    {
      "by": "syllogism",
      "descendants": 0,
      "id": 29617811,
      "score": 1,
      "time": 1639944558,
      "title": "Healthsea: An end-to-end spaCy pipeline for exploring health supplement effects",
      "type": "story",
      "url": "https://explosion.ai/blog/healthsea/"
    },
    {
      "by": "neongreen",
      "descendants": 0,
      "id": 29617810,
      "score": 1,
      "time": 1639944555,
      "title": "Quotes from 'The Business of America Is Lobbying'",
      "type": "story",
      "url": "https://windofchange.me/ShowCard?cardId=6d6a06d3-9be4-4df0-a772-0cc7a6ef136a"
    },
    {
      "by": "jacobmartin",
      "descendants": 0,
      "id": 29617799,
      "score": 1,
      "text": "Hi all,<p>I graduated college from MIT in Mathematics in 2018, but since then, I&#x27;ve mostly done odd jobs like tutoring or playing the organ for churches. When my daughter was born, with the cost of childcare, it just made sense for me to stay at home. It&#x27;s nice to be at home, but to be honest, this was never really my plan. My GPA was poor (2.9&#x2F;4.0); I wasn&#x27;t motivated in college and didn&#x27;t &#x27;apply myself.&#x27; I never did any internships, for instance. And my mental health was so poor, in addition to these hurdles, that I could never really motivate myself to find a &#x27;real job&#x27; after graduation.<p>That being said, I&#x27;ve done a lot of work on myself and have been doing a lot better over the past year or so. My wife and I are going to have another baby in March, and I want to use the time she has off to really work and try to pivot into software engineering (or a similar technical role). I think this will be important for my &#x27;personal development.&#x27;<p>I&#x27;m somewhat familiar with programming, but not much:<p><pre><code>  - I took 6.01 (intro to EE&#x2F;CS) at MIT, so A\\* search is probably the most &#x27;complex&#x27; thing I&#x27;ve ever done.\n  - The other day I wondered how a JIT compiler works. So I made a tiny C program (and used `man`) to find out about the system calls I would need to use to map memory twice to get around W^X protection and copy some simple instructions over and execute them. It was fun, but it was just a toy exercise.\n  - That&#x27;s basically the extent of all the programming I&#x27;ve ever done--toy exercises. I&#x27;ve never worked on a large codebase, or even written a program with more than a few hundred lines of code.\n  - I recently got to final round interviews at Google (cold call from a recruiter who saw my resume in their slush pile), but I didn&#x27;t get an offer. I was able to solve all of the problems (in Python), but apparently, my solutions were inefficient, or I otherwise didn&#x27;t explain them well enough.\n</code></pre>\nConstraints for a job:<p><pre><code>  - Probably, at least $100k salary. That being said, I would be willing to work for less for a smaller amount of time (like a 3-month internship or similar), if it had a high probability of giving me the opportunity to make more in the future.\n  - Work that doesn&#x27;t violate my conscience. So, probably not defense. I would be fine working in finance, though.\n  - Work in Boston area or remote.\n</code></pre>\nConstraints for the &#x27;pivot work&#x27;:<p><pre><code>  - The bulk would need to take around 16 weeks starting in March, in Boston or remote.\n  - A budget of, at most, $20k, though less is obviously better.\n  - Not completely self-guided work. I&#x27;m not good at motivating myself to do personal projects, and I find it difficult to convince myself to give them the time that they need. So I would need something with concrete deadlines, etc. I&#x27;ve had the opportunity to make a big &#x27;personal project&#x27; since I was in middle school, but I haven&#x27;t done so yet.\n</code></pre>\nWhat would you recommend for somebody with a moderate technical background pivoting to SWE? What would be good for a resume and coding interviews? Is one of these &#x27;coding bootcamps&#x27; worthwhile? Is there something like a programming tutor who could motivate me to work on something to gain a good bit of experience?",
      "time": 1639944490,
      "title": "Ask HN: How do I pivot into SWE from being a stay-at-home dad?",
      "type": "story"
    },
    {
      "by": "WolfOliver",
      "descendants": 0,
      "id": 29617794,
      "score": 2,
      "time": 1639944453,
      "title": "The Big DevOps Misunderstanding",
      "type": "story",
      "url": "https://wolfoliver.medium.com/the-big-devops-misunderstanding-8435a910a5fd"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29617786,
      "score": 1,
      "time": 1639944375,
      "title": "Women Know Cyber: The Documentary [Video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Kpc31WJ6l2M"
    },
    {
      "by": "jkuria",
      "descendants": 1,
      "id": 29617779,
      "kids": [
        29617859
      ],
      "score": 7,
      "time": 1639944339,
      "title": "Fish sausages: Ugandan CEO taps into demand",
      "type": "story",
      "url": "https://www.howwemadeitinafrica.com/fish-sausages-ugandan-ceo-taps-into-demand-for-fish-products/134985/"
    },
    {
      "by": "42jd",
      "descendants": 1,
      "id": 29617767,
      "kids": [
        29617778
      ],
      "score": 1,
      "time": 1639944249,
      "title": "The US Mountain West Could Soon Face Snowless Winters",
      "type": "story",
      "url": "https://www.wired.com/story/the-us-mountain-west-could-soon-face-snowless-winters/"
    }
  ]
}