{
  "stories": [
    {
      "by": "srcoder",
      "descendants": 0,
      "id": 28537127,
      "score": 1,
      "time": 1631699130,
      "title": "Mage Open Source Community Alliance – The Future of Magento",
      "type": "story",
      "url": "https://www.mage-os.community/blog/the-future-of-magento"
    },
    {
      "by": "another_why",
      "descendants": 0,
      "id": 28537124,
      "score": 1,
      "text": "When it comes to climate change everyone here knows how to fix it: stop eating cows, use solar batteries, build you own windmill, grow your own food, jog... and other simple things. But I rarely see(if ever) that for achieving those things at once, lets say 10 years, taxes of most countries, including relatively rich European countries, will have to be channeled from social security to this noble cause. Therefore, European elders will lose several years of their life while people in the third world countries, the ones who will pay for the bigger part of this banquet,  will have to eat less. Greater good and all.<p>Everyone is waiting until &quot;stupid and corrupted politicians&quot; will realize how important this threat is, but they won&#x27;t. Their job is not evaluating environmental threats, it&#x27;s evaluating of how much corporations can take at the moment without people going too angry about that and being reelected so they could continue that the next year. There is only one way of influencing it - you should stop being calm about that and then they will realize that it&#x27;s important. No researches, graphs and posts on forums can do that.<p>Many of you have relatively high salaries which cover all their basic needs:time, good food, shelter, clothes, personal transport, even kids(now THAT is a real luxury). So where do you spend the rest of your resources? I understand that reducing your carbon footprint, designing and building a house on a renewable energy(with a windmill) makes you feel like you did something useful, but it&#x27;s no different than growing a beautiful tree in your garden while looking how a whole forest is burning to the ground nearby. &quot;I made a difference! Everyone should do like me!&quot; But they wont, they dont have access to the same resources as you do - education, money and time. If you are THAT uninterested in doing something for the thing which you consider important, then you would&#x27;ve better donated all that for a medical research.<p>With the set of skills and resources people have here a real thing can be done, main thing, when it comes to influencing people:activism and propaganda. But you waste your resources on sorting trash.",
      "time": 1631699117,
      "title": "Climate change, simple things and hypocrisy",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28537109,
      "score": 1,
      "time": 1631698940,
      "title": "First commercial cultured meat production facility operational in Singapore",
      "type": "story",
      "url": "https://www.straitstimes.com/singapore/environment/worlds-first-commercial-cultured-meat-production-facility-operational-in"
    },
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 28537098,
      "score": 1,
      "time": 1631698811,
      "title": "FreeBSD SSH Hardening",
      "type": "story",
      "url": "https://gist.github.com/koobs/e01cf8869484a095605404cd0051eb11"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28537097,
      "score": 1,
      "time": 1631698809,
      "title": "The Nastiest Feud in Science",
      "type": "story",
      "url": "https://www.theatlantic.com/magazine/archive/2018/09/dinosaur-extinction-debate/565769/"
    },
    {
      "by": "jonjnash",
      "descendants": 1,
      "id": 28537094,
      "kids": [
        28537095
      ],
      "score": 1,
      "time": 1631698785,
      "title": "Free Democracy",
      "type": "story",
      "url": "https://docs.google.com/document/d/1YUQH9Q7As8-eMhGFcNXCymyXtyR7o6AvppSGou3Id4s/edit?usp=sharing"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 28537083,
      "score": 1,
      "time": 1631698657,
      "title": "The Minimum Viable Testing Process for Evaluating Startup Ideas",
      "type": "story",
      "url": "https://review.firstround.com/the-minimum-viable-testing-process-for-evaluating-startup-ideas"
    },
    {
      "by": "achirie",
      "descendants": 0,
      "id": 28537068,
      "score": 1,
      "time": 1631698552,
      "title": "Efficient Tech Watch for Developers",
      "type": "story",
      "url": "https://newzy.io"
    },
    {
      "by": "hochmartinez",
      "descendants": 0,
      "id": 28537065,
      "score": 1,
      "time": 1631698513,
      "title": "On Set with iPhone 13 Pro Featuring 2x Oscar Winner Kathryn Bigelow",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=c3CZX-lnAIc&list=PLHFlHpPjgk706qEJf9fkclIhdhTkH49Tb"
    },
    {
      "by": "pitapoison",
      "descendants": 0,
      "id": 28537062,
      "score": 1,
      "time": 1631698486,
      "title": "Magic (Programming)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Magic_(programming)"
    }
  ]
}