{
  "stories": [
    {
      "by": "timvdalen",
      "descendants": 1,
      "id": 28188264,
      "kids": [
        28188267
      ],
      "score": 1,
      "time": 1629030891,
      "title": "Show HN: Portfolio site for my RPG side projects",
      "type": "story",
      "url": "https://rpg.timvdalen.nl/"
    },
    {
      "by": "nauman",
      "descendants": 0,
      "id": 28188255,
      "score": 1,
      "time": 1629030822,
      "title": "Rails 6 with Webpacker 6, Tailwind 2 with JIT, Postcss 8 and some default setup",
      "type": "story",
      "url": "https://nauman.medium.com/my-rails-project-default-setup-a577677703d2"
    },
    {
      "by": "boshomi",
      "descendants": 0,
      "id": 28188253,
      "score": 1,
      "time": 1629030817,
      "title": "California's dry season is turning into a permanent state of being",
      "type": "story",
      "url": "https://phys.org/news/2021-08-california-season-permanent-state.html"
    },
    {
      "by": "segfaultbuserr",
      "descendants": 0,
      "id": 28188251,
      "score": 1,
      "time": 1629030795,
      "title": "How can I get this 8 year old VBA 64-bit compiler bug fixed?",
      "type": "story",
      "url": "https://stackoverflow.com/questions/68034271/how-can-i-get-this-8-year-old-vba-64-bit-compiler-bug-fixed"
    },
    {
      "by": "dondraper36",
      "descendants": 0,
      "id": 28188247,
      "score": 1,
      "text": "Long story short, after being assigned a few purely backend-related tasks, I realized that this appeals to me much more than data science. It turned out pretty naturally that within my current team I can gradually become more of a backend engineer (we use Go). \nIn general, I have had experience (mostly with Python though) with web-frameworks, used SQL a lot, Docker, CI&#x2F;CD, even some Kubernetes, but I cannot get rid of the feeling that there are still so many foundational gaps in my knowledge that it&#x27;s only a matter of time when I say or, even worse, do something stupid that will sabotage my chances of being considered a backend engineer. I am, however, really willing to fill all those gaps.<p>Can you please recommend a really short list of books that are must-reads in your opinion?<p>It&#x27;s no secret that Designing Data-Intensive Applications by is a gem. I have read around half of it and it has greatly improved my understanding of the basic concepts.<p>I am also thinking of watching the CMU&#x27;s course on database design by Andy Pavlo. It has great review and I notice more and more frequently that a decent understanding of databases is something that helps you stand out and impress interviewers.<p>It also seems a good idea to read Computer Systems: A Programmer&#x27;s Perspective by Bryant and Helleron to cover the fundamentals of hardware and software. Even though I have a master&#x27;s degree in computer science and mathematics, the focus was really much more on the math side so I guess that would help.<p>I am wondering whether I should read something on operating systems. Based on the contents, the book by Bryant and Hallaron covers the basics of operating systems so probably that could be enough so that I am not a total noob in how operating systems work under the hood. Need your advice here.<p>Currently, I am also reading A Philosophy of Software Design. It&#x27;s a great read and I have noticed many times that it&#x27;s considered to be a less radical and more modern alternative to Clean Code.<p>What should I read on software architecture and design? I wanted to start with the traditionally recommended Clean Architecture by Uncle Bob, but then after reading a series of posts on why the book shouldn&#x27;t be recommended anymore, I am no longer sure. What are less controversial options to cover this area?<p>Thanks in advance!",
      "time": 1629030773,
      "title": "Fill knowledge gaps in the data scientist-back end developer transition",
      "type": "story"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 28188187,
      "score": 1,
      "time": 1629030282,
      "title": "The Rise of DOS: How Microsoft Got the IBM PC OS Contract",
      "type": "story",
      "url": "https://www.pcmag.com/news/the-rise-of-dos-how-microsoft-got-the-ibm-pc-os-contract"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28188150,
      "score": 2,
      "time": 1629029960,
      "title": "Afghanistan's Angry Neighbor",
      "type": "story",
      "url": "https://www.nzz.ch/international/pakistan-afghanistans-wuetender-nachbar-ld.1640223"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 28188146,
      "score": 2,
      "time": 1629029874,
      "title": "Thousands of Kindergartners No-Show",
      "type": "story",
      "url": "https://www.washingtonexaminer.com/news/thousands-kindergartners-no-show-putting-futures-risk"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28188145,
      "score": 2,
      "time": 1629029861,
      "title": "Debian GNU/Hurd 2021 released",
      "type": "story",
      "url": "https://lists.debian.org/msgid-search/20210813220130.bqo6spytsy33gbgt@begin"
    },
    {
      "by": "stereoradonc",
      "descendants": 0,
      "id": 28188141,
      "score": 1,
      "time": 1629029834,
      "title": "Microsoft Envisions a Blockchain-Based Bounty System to Catch Pirates",
      "type": "story",
      "url": "https://torrentfreak.com/microsoft-envisions-a-blockchain-based-bounty-system-to-catch-pirates-210815/"
    }
  ]
}