{
  "stories": [
    {
      "by": "GMRapp",
      "descendants": 1,
      "id": 30048640,
      "kids": [
        30048641
      ],
      "score": 1,
      "time": 1642961640,
      "title": "“Fine Print” by Matt Zandstra (Free Radicals Magazine)",
      "type": "story",
      "url": "https://freeradicalsmagazine.com/read-free-radicals"
    },
    {
      "by": "aratob",
      "descendants": 0,
      "id": 30048633,
      "score": 1,
      "time": 1642961592,
      "title": "OneDNA – We've Standardised the NDA",
      "type": "story",
      "url": "https://onenda.org"
    },
    {
      "by": "JaimeThompson",
      "descendants": 0,
      "id": 30048625,
      "score": 1,
      "time": 1642961557,
      "title": "Big Tech Is About to Make Our Terrible Health Care System Even Worse",
      "type": "story",
      "url": "https://jacobinmag.com/2022/01/nurses-travel-apps-uber-flexibility-lean-production"
    },
    {
      "by": "0x62",
      "descendants": 0,
      "id": 30048606,
      "score": 1,
      "text": "I have various small projects and home automation systems that I want to be able to invoke remotely and receive alerts from, without setting up a web server and UI.<p>I used to use Notify17 for receiving alerts, but since this shut down I&#x27;ve been forced back to email, and am now looking for a solution to cover both receiving alerts and sending basic commands.<p>These are the options I&#x27;ve considered already:<p>* Pushover - Fine for receiving alerts, multiple recipients supported. No options to respond to them.<p>* Telegram - Sending + receiving. Might be a bit heavy for my use case, and would be better not having the bot publicly accessible. Also makes managing notifications (DND etc) more difficult when also receiving human messages.<p>* Gotify - No iOS app.<p>Essentially what I&#x27;m looking for is an app with a chat-like UI which converts messages to a webhook, and allows me to send responses via an API.<p>On a related note, if anyone else is missing Notify17 and thinking about building a replacement I&#x27;d be willing to pay up to $15&#x2F;mo for a tool that ingests webhooks, allows me to reformat the response with a templating language and sends notifications to my phone.",
      "time": 1642961460,
      "title": "Ask HN: Simple developer-friendly chat app for home automation?",
      "type": "story"
    },
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 30048561,
      "score": 2,
      "time": 1642961272,
      "title": "Netherlands: Organic growers ask for geothermal heat",
      "type": "story",
      "url": "https://www.hortidaily.com/article/9390686/netherlands-organic-growers-ask-for-geothermal-heat/"
    },
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 30048545,
      "score": 1,
      "time": 1642961204,
      "title": "My Month Deep in NFTs",
      "type": "story",
      "url": "https://www.wordimagedesign.com/deep-in-nfts/"
    },
    {
      "by": "thazework",
      "descendants": 0,
      "id": 30048542,
      "score": 2,
      "time": 1642961203,
      "title": "Taxing Extreme Wealth",
      "type": "story",
      "url": "https://inequality.org/great-divide/tax-the-rich-global-wealth-report/"
    },
    {
      "by": "notamy",
      "descendants": 0,
      "id": 30048515,
      "score": 2,
      "time": 1642961043,
      "title": "Bitcoin drops to six-month low as investors dump speculative assets",
      "type": "story",
      "url": "https://www.ft.com/content/28286423-66a8-432d-8a1e-b37fd5e2a74d"
    },
    {
      "by": "epistasis",
      "descendants": 0,
      "id": 30048503,
      "score": 1,
      "text": "Since the introduction of USB-C, I have looked for the USB-C analog of the venerable USB-A hub:  multiple expansion ports with a single connector back to the host computer.<p>My application is being able to plug in multiple USB devices with USB-C cables. I can find guns with USB-C to multiple USB-A ports, but then I lose the benefit of being able to plug in the connector on the first try, without trying three orientations.<p>The only USB-C &quot;hubs&quot; I can find are expensive docking stations that have Ethernet, HDMI, etc. but do not significantly expand the number of USB-C ports.<p>Is there a technical reason for this, or is it just a product marketing choice by manufacturers?",
      "time": 1642960990,
      "title": "Ask HN: Why aren't there any USB-C hubs with only USB-C connectors?",
      "type": "story"
    },
    {
      "by": "daitangio",
      "descendants": 0,
      "id": 30048440,
      "score": 1,
      "text": "I was searching some way to publicize my blog article. I was searching a simple solution, not necessary free, to integrate with social media.\nIn the past days I tried Zapier, Microsoft Power Automate and IFTTT (f this, then that).<p>My budget is around 5 euros&#x2F;month given the simple task (I could be able to do it on myself but I will need to register on the various services my library, be careful not to get banned etc).\nSo a ready-made solution seems a good idea.<p>I am not an expert on this field but I was shocked by the cost of Zapier and Power Automate, given the complexity to do simple things like publicizing posts or creating keyword alert.<p>I know they are complex tools but...<p>IFTTT seems more focused, easy to use and cheap so the question is: what do you suggest for this task?<p>There is some open source library I can mock or IFTTT is a good candidate?\nDid I miss some other option?\nThank you!",
      "time": 1642960590,
      "title": "Ask HN: Social media publicize in a cheap and cloud way",
      "type": "story"
    }
  ]
}