{
  "stories": [
    {
      "by": "lstamour",
      "descendants": 0,
      "id": 30982727,
      "score": 1,
      "time": 1649632551,
      "title": "TypeScript 4.7 Beta",
      "type": "story",
      "url": "https://devblogs.microsoft.com/typescript/announcing-typescript-4-7-beta/"
    },
    {
      "by": "Crystalin",
      "descendants": 2,
      "id": 30982689,
      "kids": [
        30982756,
        30982740
      ],
      "score": 1,
      "text": "I find myself reading the comments on HN before the articles most of the time...\nIt usually brings a better&#x2F;shorter description and decent reaction.<p>Only when I don&#x27;t fully understand the arguments then I read the article",
      "time": 1649632242,
      "title": "Ask HN: I read comments before the article, do you?",
      "type": "story"
    },
    {
      "by": "RadixDLT",
      "descendants": 0,
      "id": 30982687,
      "score": 1,
      "time": 1649632241,
      "title": "Coding vs. programming: What is the difference?",
      "type": "story",
      "url": "https://www.livescience.com/coding-vs-programming-what-is-the-difference"
    },
    {
      "by": "andreyk",
      "descendants": 2,
      "id": 30982655,
      "kids": [
        30982703,
        30982674
      ],
      "score": 2,
      "text": "It&#x27;s very common for people to complain about how many things clutter the screen in &#x27;the modern web&#x27;, and this has definitely comes up on HN. People seem to strongly dislike cookie prompts, and I wonder what people on here think. I don&#x27;t mind them for the following reasons:<p>For one, it&#x27;s a tiny point of friction - if the site is optimized it shows up quickly and you can click OK in a second. Are we so sensitive to minor inconvenience? I thought about this just now while opening a site and having to accept cookies, and it being really quick if slightly annoying.<p>Second, is this not a good inconvenience to have? Another common complaint about the modern web is the lack of privacy and sites being heavy with reliance on JS and just not being optimized. Having these toggles means the site presumably has to work without cookies, which seems good?<p>If nothing else, it&#x27;s a reminder about data about you being stored, and isn&#x27;t the current paradigm of near zero privacy the results of us just not thinking about privacy and giving it up for the sake of convenience?<p>Lastly, the laws that require this represent protection of our data. While cookies may not be a huge deal, I do think acceptance of such measures could enable further requirements about what data is collected and can be deleted. Is this too optimistic?<p>If you hate them &#x2F; think they suck, could you comment on the above points?",
      "time": 1649631953,
      "title": "Ask HN: Do you think cookie prompts on websites are a bad thing?",
      "type": "story"
    },
    {
      "by": "launchiterate",
      "descendants": 0,
      "id": 30982642,
      "score": 1,
      "time": 1649631863,
      "title": "Can you buy a Silicon Valley? Maybe. by Paul Graham",
      "type": "story",
      "url": "http://paulgraham.com/maybe.html"
    },
    {
      "by": "turduckenish",
      "descendants": 0,
      "id": 30982639,
      "score": 1,
      "text": "I recently enabled email forwarding from Gmail to Slack in an attempt to make life easier for our team. I also forwarded my own email to a private channel for similar reasons. The problem with this, is that when you receive an email and it gets forwarded to Slack, Slack then notifies you by email that you have an unread chat message, which in turn notifies you in Slack that you have an unread email, which...    OK you get the point!",
      "time": 1649631840,
      "title": "Slack is Slack is Slack is Slack",
      "type": "story"
    },
    {
      "by": "kloch",
      "descendants": 0,
      "id": 30982625,
      "score": 2,
      "time": 1649631754,
      "title": "A Girl From Ipanema is a far weirder song than you thought",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=OFWCbGzxofU"
    },
    {
      "by": "andromaton",
      "descendants": 0,
      "id": 30982619,
      "kids": [
        30982646
      ],
      "score": 1,
      "time": 1649631709,
      "title": "BBC Micro at 40 – Conrad Wolfram (2021)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=IokPiTFX8-E"
    },
    {
      "by": "belter",
      "descendants": 2,
      "id": 30982564,
      "kids": [
        30982565,
        30982597
      ],
      "score": 1,
      "time": 1649631279,
      "title": "Watermarked ReRAM: A Technique to Prevent Counterfeit Memory Chips",
      "type": "story",
      "url": "https://arxiv.org/abs/2204.02104"
    },
    {
      "by": "qualudeheart",
      "descendants": 0,
      "id": 30982538,
      "score": 1,
      "time": 1649631109,
      "title": "Cambridge Centre for Carbon Credits",
      "type": "story",
      "url": "https://4c.cst.cam.ac.uk/"
    }
  ]
}