{
  "stories": [
    {
      "by": "dominickmarino",
      "descendants": 0,
      "id": 29029646,
      "score": 1,
      "time": 1635446132,
      "title": "Hot Rodding Decentralized Storage Part 1",
      "type": "story",
      "url": "https://storj.io/blog/hot-rodding-decentralized-storage"
    },
    {
      "by": "whinvik",
      "descendants": 0,
      "id": 29029635,
      "score": 1,
      "text": "During my PhD I decided to use a C++ library to build my simulation app. One of the reasons I decided to use that particular library was that it was small and that it compiled quickly! That was very useful because my workflow in understanding the code was go through examples, change a line here, put a print statement there, compile and run. It was fine back then, because I had a lot more time to concentrate on a single task, but it did take quite some time. So I basically used git, vim and make.<p>Now, I am doing something similar but I don&#x27;t really have the same amount of time. The 2 things I have added to my usual process is to use a debugger (lldb) and document all my findings using Dropbox Paper. I feel that this is definitely much better than before but I am sure that this could be made much more efficient. So the question is what types of tools&#x2F;workflows are more widely used?",
      "time": 1635446097,
      "title": "Ask HN: What tools and workflow do you use to understand new libraries",
      "type": "story"
    },
    {
      "by": "cateof",
      "descendants": 0,
      "id": 29029630,
      "score": 1,
      "time": 1635446089,
      "title": "GitHub Actions: Secure Cloud Deployments with OpenID Connect",
      "type": "story",
      "url": "https://github.blog/changelog/2021-10-27-github-actions-secure-cloud-deployments-with-openid-connect/"
    },
    {
      "by": "yewenjie",
      "descendants": 0,
      "id": 29029622,
      "score": 1,
      "time": 1635446065,
      "title": "Lsp-gitpod: One-click Emacs web IDE",
      "type": "story",
      "url": "https://github.com/emacs-lsp/lsp-gitpod"
    },
    {
      "by": "bkmn",
      "descendants": 0,
      "id": 29029616,
      "score": 1,
      "time": 1635446043,
      "title": "Meta",
      "type": "story",
      "url": "https://www.theverge.com/2021/10/28/22745234/facebook-new-name-meta-metaverse-zuckerberg-rebrand"
    },
    {
      "by": "ibejoeb",
      "descendants": 0,
      "id": 29029612,
      "score": 2,
      "time": 1635446015,
      "title": "Sun fired off an X1-class solar flare, possible wide-area radio blackout",
      "type": "story",
      "url": "https://www.space.com/sun-unleashes-major-x-class-solar-flare-october-2021"
    },
    {
      "by": "glitcher",
      "descendants": 0,
      "id": 29029572,
      "score": 1,
      "text": "My apologies for this not being directly tech related, but I know there are many people here on HN with domain expertise in a broad array of industries.<p>A family member is experiencing new symptoms that were the precursor to discovering their cancer originally. Unfortunately at diagnosis, they were already stage 4.<p>The oncologist ordered a specific scan, the insurance company denied it, and then required a &quot;peer to peer&quot; meeting with the doctor. They forced the doctor&#x27;s hand to accept a different type of scan, which at an earlier point of treatment had returned a false negative for us. And the process is also causing, and has caused in the past, delays to treatment in an extremely time sensitive situation.<p>What can I possibly do about this peer to peer theater? There is absolutely no way the insurance companies&#x27; &quot;peer&quot; knows the latest details about the ever evolving treatment the oncologist is using. And this &quot;peer&quot; certainly knows nothing about my family member&#x27;s specifics when it comes to their treatment history.<p>How is this stuff even legal? I googled around and found this disturbingly similar situation blogged by a Dr. Rick Boulay in 2017:\nhttps:&#x2F;&#x2F;www.kevinmd.com&#x2F;blog&#x2F;2017&#x2F;09&#x2F;dear-insurance-doctor-not-peer.html<p>Then I stumbled upon an old New York Times article that quoted him, about how doctors are sometimes lying to insurance agencies in order to get the treatment their patients desperately need:\nhttps:&#x2F;&#x2F;www.nytimes.com&#x2F;2018&#x2F;06&#x2F;21&#x2F;well&#x2F;the-strategic-lies-of-oncologists.html\n(archive: https:&#x2F;&#x2F;archive.md&#x2F;5lfkU#selection-505.42-505.45)<p>What the hell is going on? This is absolute madness.",
      "time": 1635445863,
      "title": "Ask HN: Advice dealing with Insurance denying Oncologist's recommendations?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29029565,
      "score": 1,
      "time": 1635445850,
      "title": "AbstractEmu: New rooting malware distributed on Google Play",
      "type": "story",
      "url": "https://blog.lookout.com/lookout-discovers-global-rooting-malware-campaign"
    },
    {
      "by": "perfunctory",
      "descendants": 0,
      "id": 29029513,
      "score": 3,
      "time": 1635445728,
      "title": "European Investment Bank to end all loans to oil and gas firms",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/oct/28/european-investment-bank-to-close-loophole-allowing-it-to-lend-to-oil-and-gas-firms"
    },
    {
      "by": "oedmarap",
      "descendants": 0,
      "id": 29029505,
      "score": 2,
      "time": 1635445697,
      "title": "Meta",
      "type": "story",
      "url": "https://stratechery.com/2021/meta/"
    }
  ]
}