{
  "stories": [
    null,
    {
      "by": "georgehill",
      "descendants": 0,
      "id": 32205535,
      "score": 1,
      "time": 1658597642,
      "title": "Why Writing Your Own Search Engine Is Hard (2004)",
      "type": "story",
      "url": "https://queue.acm.org/detail.cfm?id=988407"
    },
    {
      "by": "dsieger",
      "descendants": 1,
      "id": 32205528,
      "kids": [
        32205530
      ],
      "score": 1,
      "time": 1658597620,
      "title": "The Myth of Software Simplicity",
      "type": "story",
      "url": "https://iansommerville.com/technology/software-simplicity/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 32205519,
      "score": 1,
      "time": 1658597563,
      "title": "Japanese workers convert above-ground train to subway in just 3 hours [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_BYW4YYqG5A"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32205514,
      "score": 1,
      "time": 1658597547,
      "title": "Stop saying “They shouldn't have invested more than they could afford to lose”",
      "type": "story",
      "url": "https://blog.mollywhite.net/stop-saying-they-shouldnt-have-invested-more-than-they-can-afford-to-lose/"
    },
    {
      "by": "ponnhide",
      "descendants": 1,
      "id": 32205481,
      "kids": [
        32205482
      ],
      "score": 1,
      "time": 1658597380,
      "title": "Tips to combine multiple Matplotlib-related plots using patchworklib",
      "type": "story",
      "url": "https://colab.research.google.com/drive/1NfjyuKP9nqAM0hanvRHQP-kD1gbmP9Qz?usp=sharing"
    },
    {
      "by": "Klaster_1",
      "descendants": 1,
      "id": 32205474,
      "kids": [
        32205526
      ],
      "score": 1,
      "time": 1658597351,
      "title": "Computer languages by Time-Life Books (1986)",
      "type": "story",
      "url": "https://archive.org/details/computerlanguagetime"
    },
    {
      "by": "superkuh",
      "descendants": 0,
      "id": 32205468,
      "score": 1,
      "time": 1658597340,
      "title": "Why the NRO is defending AFRINIC",
      "type": "story",
      "url": "https://blog.apnic.net/2022/07/22/why-the-nro-is-defending-afrinic/"
    },
    {
      "by": "jerryjerryjerry",
      "descendants": 0,
      "id": 32205438,
      "score": 1,
      "time": 1658597155,
      "title": "All bosses should learn after Bill Gates posted his resume on LinkedIn",
      "type": "story",
      "url": "https://www.inc.com/bill-murphy-jr/7-things-all-bosses-should-learn-after-bill-gates-posted-his-resume-on-linkedin.html"
    },
    {
      "by": "sillystuff",
      "descendants": 0,
      "id": 32205435,
      "score": 1,
      "text": "I&#x27;m curious about others&#x27; experience with California Consumer Privacy Act (CCPA) compliance.  And, if my understanding of the protections of the act are incorrect, and it does not, in fact, prevent continued retention and selling of personal data after a CCPA request has been lodged (i.e., it contains giant loopholes that negate any real protection by the act).<p>At the end of February, I visited a government site that asked me security questions that I had not provided answers to.  My account was locked because I answered the questions &quot;wrong&quot;.  The site&#x27;s support responded, to a query, that they sourced the questions and answers from LexisNexis.<p>I wanted to avoid such issues in the future, so using the LexisNexis CCPA request web form, I checked the boxes on all three of, request a) a copy of the data they had collected, b) they not sell my data, and c) they delete the data they already had collected.  In early March, I got confirmation of my request and an extensive report of the data they had collected on me.<p>The data was extremely unreliable containing many errors.  It was no wonder I could not answer the security questions &quot;correctly&quot;.<p>In mid July, I had to use that government web site again, and was again prompted with security questions I had not provided answers for (this time, however, I was able to answer the questions &quot;correctly&quot; using the CCPA report as an answer key).  I contacted the site again, and they confirmed that the questions and answers were exclusively sourced from LexisNexis, and that they did not cache &#x2F; store any of this information-- that the website queries LexisNexis in real time at the time the questions are posed to the visitor.<p>This seems to indicate that LexisNexis did not, in fact delete my data, and Lexis Nexis is continuing to sell my data.<p>If you have placed CCPA requests, what have been your experiences?  And, were my expectations that the CCPA would prevent LexisNexis from continuing to retain and sell my data not in line with what the CCPA actually provides?",
      "time": 1658597145,
      "title": "Ask HN: What have been your California Consumer Privacy Act (CCPA) experiences?",
      "type": "story"
    }
  ]
}