{
  "stories": [
    {
      "by": "laktak",
      "descendants": 0,
      "id": 31164590,
      "score": 2,
      "time": 1650954231,
      "title": "Jack Dorsey says ‘Elon is the singular solution I trust’ for Twitter’s future",
      "type": "story",
      "url": "https://www.theverge.com/2022/4/25/23042172/jack-dorsey-elon-musk-twitter-lbo-radiohead"
    },
    {
      "by": "Trouble_007",
      "descendants": 1,
      "id": 31164574,
      "kids": [
        31164576
      ],
      "score": 2,
      "time": 1650954019,
      "title": "Adenovirus Infection as possible cause of acute liver-failure in a healthy Child",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/19119490/"
    },
    {
      "by": "laktak",
      "descendants": 0,
      "id": 31164567,
      "score": 1,
      "time": 1650953930,
      "title": "Apple iOS browser grip loosened under latest draft EU rules",
      "type": "story",
      "url": "https://www.theregister.com/2022/04/26/apple_ios_browser/"
    },
    {
      "by": "aegooby",
      "descendants": 0,
      "id": 31164563,
      "score": 1,
      "text": "Where do I begin? Easy. There are lots of problems with current forms of government. Clearly Democracy is not working (see [https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QFgcqB8-AxE] for a pretty short summary of why). Based on the IQ distribution, we have that 50% of people are below 100 IQ. If you go to a university or other decently high skill job, think about the dumbest person at that job. They probably have a 110+ IQ. Now consider that over 50% of people are dumber than that idiot who you hate with all your being. He is probably your boss, that project manager who wants you to play hopscotch with strangers as a team building exercise. Imagine if people just like him and even more stupid could singlehandedly decide on who the next ruler of your country will be. Terrible.<p>So clearly the next best option is to have the decision be made by a more intelligent group of people. Who better than Rabbis? They have studied all their lives, are genetically more likely to have a very high IQ, have shown immense dedication, work ethic, and pure intentions (aside from pricking the penis of male converts, not sure why they do that). It&#x27;s common for them to engage in debates and intellectual discussions with each other, and they are chosen by G-d as His favored people to lead the way forward for humanity.<p>Imagine a society where they are able to choose amongst themselves. Personally I think it would be amazing. The person they choose doesn&#x27;t even have to be a Rabbi or Jewish at all, it could be some random kid. But we need to all trust in their judgment because it is the best one available to us. To keep things fresh it&#x27;s probably best to rotate different Rabbis every year, maybe have one year be Conservative, the next one be Reform, etc. just for the variety and to give them a break. Many of them are senior citizens, we don&#x27;t want them getting exhausted or accelerating neurological issues they might have.",
      "time": 1650953922,
      "title": "CMV: Form of Government Is a Rabbinical Theocratic Dictatorship (RTD)",
      "type": "story"
    },
    {
      "by": "laktak",
      "descendants": 0,
      "id": 31164548,
      "score": 1,
      "time": 1650953757,
      "title": "China again signals desire to shape IPv6 standards",
      "type": "story",
      "url": "https://www.theregister.com/2022/04/26/china_ipv6_plan/"
    },
    {
      "by": "yosefjaved1",
      "descendants": 0,
      "id": 31164539,
      "score": 1,
      "time": 1650953702,
      "title": "Can (and Should) Corporations Be Taxed?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=PFHa2vZG1Q0"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 31164523,
      "score": 1,
      "time": 1650953570,
      "title": "High-tech fitness mirrors with a monthly subscription",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-61092317"
    },
    {
      "by": "Wowfunhappy",
      "descendants": 0,
      "id": 31164521,
      "score": 1,
      "time": 1650953566,
      "title": "Projects for Old Versions of OS X",
      "type": "story",
      "url": "https://jonathanalland.com/old-osx-projects.html"
    },
    {
      "by": "LowLevelMahn",
      "descendants": 1,
      "id": 31164483,
      "kids": [
        31164484
      ],
      "score": 1,
      "time": 1650953238,
      "title": "A executable extractor and starter for the DOS game Alpha Waves",
      "type": "story",
      "url": "https://github.com/LowLevelMahn/alpha_waves_loader"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31164472,
      "score": 2,
      "time": 1650953131,
      "title": "More than a quarter of Netflix’s UK subscribers share passwords",
      "type": "story",
      "url": "https://www.theguardian.com/media/2022/apr/26/netflix-uk-subscribers-share-passwords-streaming"
    }
  ]
}