{
  "stories": [
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30658352,
      "score": 1,
      "text": "I&#x27;m looking for a Voice memo app or solution for Android that will allow me to have both an audio file and a text generated from the voice afterwards. If this does not exist in a single app then a solution that is hopefully customizable via an api would be great, by which I mean - use service X for your voice, access generated voice files via api send files to voice to text service Y via its api.",
      "time": 1647150336,
      "title": "Ask HN: A Voice Memo solution for Android that does both audio and voice to text",
      "type": "story"
    },
    {
      "by": "speedylight",
      "descendants": 0,
      "id": 30658324,
      "score": 1,
      "text": "I am interested to know what ML platforms you use for personal&#x2F;hobbyist projects... Do you rent GPU instances from the likes of Azure, GCP, AWS or do you use managed solutions like Paperspace Gradient, or Colab? why or not?<p>I am very much a beginner in the space of machine learning and have been overwhelmed by the choices available. Eventually I do want to simply want to build my own rig and just train models on that, but I don&#x27;t have that kind of money right now, nor is it easy to find GPUs even if could afford them.<p>So I am basically stuck to cloud solutions for now, which is why I want to hear personal experiences of HN folks who have used any of the available ML platforms. Their benefits, short comings, which are more beginner friendly, cost effective, etc<p>I am also not opposed to configuring environments myself rather than using managed solutions (such as Gradient) if it is more cost effective to do so, or affords better reliability &#x2F;&#x2F; better than average resource availability... because I read some complaints that Colab has poor GPU availability since shared among subscribers, and that the more you use it the less time is allocated to you... not sure how big of a problem it actually is though.<p>I am very motivated to delve into this space (it&#x27;s been on my mind a while) and I want to do it right, which is why I am asking for personal experiences on this forum given that there is a very healthy mix of technology hobbyists as well as professionals on HN, of which the opinion of both is equally valuable to me for different reasons.<p>Also please feel free to include any unsolicited advice such as learning resources, anecdotes, etc,<p>Thanks for reading until the end.",
      "time": 1647149918,
      "title": "Ask HN: What ML platform are you using?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30658321,
      "score": 2,
      "time": 1647149910,
      "title": "Texas man wins $75K suing telemarketers for illegal robo-calls",
      "type": "story",
      "url": "https://www.chron.com/business/article/Robocalls-Texas-Austin-lawsuit-Do-Not-Call-list-16989419.php"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30658320,
      "score": 2,
      "time": 1647149901,
      "title": "An Economic Iron-Curtain is falling on Russia as Companies cut-ties",
      "type": "story",
      "url": "https://text.npr.org/1085967986"
    },
    {
      "by": "athH",
      "descendants": 0,
      "id": 30658311,
      "score": 1,
      "time": 1647149775,
      "title": "Logiciel+libre",
      "type": "story",
      "url": "https://fsfe.org/freesoftware/freesoftware.html"
    },
    {
      "by": "appwiz",
      "descendants": 1,
      "id": 30658310,
      "kids": [
        30658349
      ],
      "score": 2,
      "time": 1647149773,
      "title": "Track changes to CLI tools by recording their help output",
      "type": "story",
      "url": "https://simonwillison.net/2022/Feb/2/help-scraping/"
    },
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 30658264,
      "score": 1,
      "time": 1647149135,
      "title": "Cosmopolitan Railway",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Cosmopolitan_Railway"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30658238,
      "score": 1,
      "time": 1647148795,
      "title": "Nvidia's Magical AI Speaks Using Your Voice",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=KeepnvtICWo"
    },
    {
      "by": "LittleMoveBig",
      "descendants": 0,
      "id": 30658221,
      "score": 1,
      "time": 1647148571,
      "title": "Moderna finally cracks into gene editing with Metagenomi pact",
      "type": "story",
      "url": "https://www.fiercebiotech.com/biotech/moderna-finally-cracks-into-gene-editing-metagenomi-pact-thanks-irresistible-data"
    },
    {
      "by": "kirso",
      "descendants": 2,
      "id": 30658212,
      "kids": [
        30658308,
        30658244,
        30658265
      ],
      "score": 1,
      "text": "A quick background:\nI started learning programming for the sake of building stuff. Quite frankly even the ability to help in any way during the crisis in Europe by collating information on the web is a seriously valuable skill. It sounds trivial to many here, but just a small contribution like that seems like a superpower.<p>As a job, it doesn&#x27;t seem super enticing though. I started wondering how many people actually still do it because they enjoy it compared to &quot;out of necessity&quot;?<p>Feeling of creating something out of nothing, even super simple and uncomplicated but useful feels very rewarding...<p>Wordle is a good example of just a simple piece of software that is elegant in its own way and was created for fun instead of drilling on specifics of making something scalable or achieving an OKR. It feels like it&#x27;s a lost philosophy nowadays where everyone is chasing unicorns and money.<p>Where did all the fun go?",
      "time": 1647148466,
      "title": "Ask HN: Are you still programming for fun?",
      "type": "story"
    }
  ]
}