{
  "stories": [
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29147905,
      "score": 1,
      "time": 1636367485,
      "title": "Succession-style feud gripping Canada settled as court sides with Edward Rogers",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/nov/05/canada-succession-rogers-communications-feud-saga"
    },
    {
      "by": "mofosyne",
      "descendants": 1,
      "id": 29147888,
      "kids": [
        29147904
      ],
      "score": 5,
      "text": "For the general public he was seen as just another hacktivist along with various\nhacktivist groups that were active around the time like lulzsec and anonymous.\nBut for the wider internet community, he represents something much much more,\nespecially post 2020 where we are all questioning many aspect of governance\nthat we take for granted as the normal state of the world.<p>In November the eight of 1986 Aaron Swartz was born. While his early childhood\nwas like any other kid, he showed early spark of someone who would be very\nconsequential to internet culture.<p>One of his first website to be recognized by the public is &quot;The Info Network&quot;\na user generated encyclopedia, created at the age of 12 years old which won\nthe ArsDigita Prize.<p>But later on he was accepted into Y Combinator&#x27;s founder program on a startup\ncalled infogami. While infogami failed to get further funding, his contribution\nto the wider Y Combinator, got him in touch with another fellow co-founder to\nwork together on this small but potentially important firm known as Reddit.<p>If you are from Reddit or Hackernews, you will be very familiar with how the next\nfew years will go for Arron as well and so no further introduction will be needed.\n(But you can follow further in his wiki page https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Aaron_Swartz)<p>However what will be consequential to the wider public is his work as an tech\nactivist fighting for the same rights and values that digital natives in the\nwider internet culture would fight for. Especially in the realms of copyright\nlaws and the wider debate on digital access and freedom.<p>This includes writing Guerilla Open Access Manifesto, as well as filing a FOIA\n request to find out how Chelsea Mannings was treated after she was detained for\n her alleged role in the WikiLeaks leaks.\nIn addition to to leaking PACER digital court records to improve public access,\nwhich had him investigated by the FBI for potential copyright infringements.\nAnd most importantly to rally the internet against Stop Online Piracy Act (SOPA).<p>However it was tragically his efforts to push for open access to academic\njournals (much of which was publicly funded research) that may have costed him\nhis life at 2008-12-13.<p>Eight years later, as we emerge from the global pandemic, it is about time we\ncelebrate his life and reflect on his his short time with us.\nAs well as reflecting on how his actions had inspired countless digital natives\ncurrent and in the future to continuously push and fight for the\nright for information to be free and transparent.",
      "time": 1636367278,
      "title": "Aaron Swartz Rememberance Day This Monday",
      "type": "story"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29147853,
      "score": 1,
      "time": 1636366996,
      "title": "East Coast flooding is a reminder that sea level is rising as the climate warms",
      "type": "story",
      "url": "https://theconversation.com/east-coast-flooding-is-a-reminder-that-sea-level-is-rising-as-the-climate-warms-heres-why-the-ocean-is-pouring-in-more-often-168729"
    },
    {
      "by": "tempodox",
      "descendants": 0,
      "id": 29147834,
      "score": 1,
      "time": 1636366811,
      "title": "Faulty DRM Breaks Dozens of Games on Intel’s Alder Lake CPUs",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2021/11/faulty-drm-breaks-dozens-of-games-on-intels-alder-lake-cpus/"
    },
    {
      "by": "pelcg",
      "descendants": 0,
      "id": 29147830,
      "score": 2,
      "text": "Hi HNers,<p>What subscription management software do you use for your SaaS or projects in 2021 these days? I see a lot of well deserved praise for Stripe, but wondering if there is something else that integrates with Stripe, Paypal, etc, all the rest of them.",
      "time": 1636366770,
      "title": "Ask HN: What subscription management software do you use in 2021?",
      "type": "story"
    },
    {
      "by": "yuchi",
      "descendants": 0,
      "id": 29147821,
      "score": 2,
      "time": 1636366657,
      "title": "CSS Grid vs. Flexbox Performance Evaluation",
      "type": "story",
      "url": "https://techblog.smc.it/en/2020-08-03/grid-vs-flexbox-performance/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29147814,
      "score": 1,
      "time": 1636366576,
      "title": "Apple Silicon roadmap reveals plans for Mac Pro, MacBook Air",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/11/leaked-apple-silicon-roadmap-reveals-plans-for-mac-pro-macbook-air/"
    },
    {
      "by": "croes",
      "descendants": 1,
      "id": 29147811,
      "kids": [
        29147813
      ],
      "score": 2,
      "time": 1636366557,
      "title": "Countries’ climate pledges built on flawed data, Post investigation finds",
      "type": "story",
      "url": "https://www.washingtonpost.com/climate-environment/interactive/2021/greenhouse-gas-emissions-pledges-data/"
    },
    {
      "by": "rmoff",
      "descendants": 0,
      "id": 29147802,
      "score": 1,
      "time": 1636366470,
      "title": "The Future of SQL: Databases Meet Stream Processing",
      "type": "story",
      "url": "https://www.confluent.io/blog/databases-meet-stream-processing-the-future-of-sql/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29147793,
      "score": 2,
      "time": 1636366440,
      "title": "WhatsApp Rolls Out Multi-Device Support to All Users on iOS and Android",
      "type": "story",
      "url": "https://www.macrumors.com/2021/11/08/whatsapp-multi-device-rollout-ios-android/"
    }
  ]
}