{
  "stories": [
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 28798760,
      "score": 1,
      "time": 1633698154,
      "title": "Other primates self-medicate – and what they could teach us",
      "type": "story",
      "url": "https://worldsensorium.com/how-other-primates-self-medicate/"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 28798758,
      "score": 1,
      "time": 1633698147,
      "title": "Flying Microchips Are Headed Our Way",
      "type": "story",
      "url": "https://www.wsj.com/articles/now-flying-microchips-are-headed-our-way-11633634893"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 28798742,
      "score": 1,
      "time": 1633698075,
      "title": "Order Flocking Out of Chaos",
      "type": "story",
      "url": "https://nautil.us/issue/107/the-edge/order-flocking-out-of-chaos"
    },
    {
      "by": "chekumbe",
      "descendants": 1,
      "id": 28798718,
      "kids": [
        28798719
      ],
      "score": 1,
      "time": 1633697937,
      "title": "Nasonga",
      "type": "story",
      "url": "https://nasonga.com/"
    },
    {
      "by": "throwaway_ddlk",
      "descendants": 0,
      "id": 28798712,
      "score": 1,
      "text": "This company&#x27;s website apparently indexed folders full of customers&#x27; private documents, they&#x27;re all on Google.\nI found them accidentally by googling something else.<p>What is the proper procedure here? Should I ask for a bounty?",
      "time": 1633697889,
      "title": "Ask HN: I accidentally found a serious data leak on a website, what next?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28798697,
      "score": 1,
      "time": 1633697827,
      "title": "TIPP10 – Free Touch Typing Tutor",
      "type": "story",
      "url": "https://www.tipp10.com/en/index/"
    },
    {
      "by": "dsr12",
      "descendants": 0,
      "id": 28798689,
      "score": 1,
      "time": 1633697788,
      "title": "Covid vaccine immunity is waning – how much does that matter?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-021-02532-4"
    },
    {
      "by": "srushtika",
      "descendants": 0,
      "id": 28798687,
      "score": 1,
      "time": 1633697780,
      "title": "Fully serverless editable chat app demo",
      "type": "story",
      "url": "https://serverless-scalable-chat.netlify.app/"
    },
    {
      "by": "curt15",
      "descendants": 0,
      "id": 28798683,
      "score": 1,
      "time": 1633697752,
      "title": "CERN IT recommends standardizing on CentOS 8 Stream [pdf]",
      "type": "story",
      "url": "https://indico.cern.ch/event/1070475/contributions/4511844/attachments/2309304/3929738/lfc03-20210915-NoNDA.pdf"
    },
    {
      "by": "ikegittlen",
      "descendants": 0,
      "id": 28798679,
      "score": 1,
      "text": "As the media dutifully takes and spins our political leaderships efforts to message, it’s good to step back and ask “who are they trying to convince?”.  We keep telling ourselves that there is this huge divide between Americans and most people are firmly entrenched on one side or the other.  There are those who also say the Republicans have given up on persuading any more people to join them, and are busy fixing the election process so they can dominate as a minority Party.  If this is so, then Democrats will have to attract super-majorities to overcome the voting hurdles that the R’s erect.  However, results from a recent CNN Poll on so-called “independent” voters throws some new light on who, in our voting citizenry, are actually open to persuasion.<p>On the face of it, the CNN Poll findings belie the “all on one side or the other” viewpoint.  Fully 40% of those responding to the Poll, self-identified as “independent” voters.  From a political strategist’s point of view, this is a huge pool of “persuadable’s” to try to bring into their respective camps.  But it turns out that nine out of ten of those “independents”, also say they “lean” toward one Party or the other.  Apparently, what unites them in declining to fully adopt one Party or the other is their collective distain for government generally and a dissatisfaction with the current leaders of both Party’s.  So only 10% of the voting public is really unmoored from one of our two political Parties, and theoretically open to go either way.  In the hunt for support and votes, it becomes more about breaking the tenuous ties independents have to the Party they “lean” towards.<p>The best hope of the strategist is to get “leaners” to not vote.  That’s the source of all the negative campaigning, that seeks to muddy up a candidate’s image.  The heavier lift is to convince them to actually vote for the Party they “lean” against.  That becomes an exercise in finding the independents “hot button” issue and making that the single decision-maker for that voter.  For example, if you’re a Republican-leaning voter, but climate change is your number one fear, then you might be persuaded to vote for the Dem’s as the R’s continue to deny and drag their feet on climate change.  Likewise, if you’re a Democrat-leaning voter, but are most concerned about crime and violence, then “defund the police” slogans may tip you toward the R’s.  This explains the constant and hyper escalation of emotional issues.  The goal is to obscure a balanced view of where each Party or candidate will lead and replace it with one issue that becomes the entire reason we cast a vote.<p>As we listen to and are impacted by political-speak, it’s important to realize that most of it is not aimed at the 30% of the voting population that is firmly in one Party or the other.  It’s designed to either get the “leaners” to opt out, or get hyped up about a hot-button issue.  Huge sums of money are being spent to both delve into the top issues for independents and what emotional appeals trigger them to move their vote.  Then more billions are spent targeting independents with media, direct mail and rampant mis-information campaigns.  Today’s candidate is a technological and human behavior product of intense research and targeted spending, mostly directed at 40% of the electorate.<p>In this environment, the candidate or Party that is trying to promote a comprehensive approach to our collective problems is seriously handicapped.  Since the hunt is for emotional triggers, policy itself gets a short shrift in favor of bumper sticker slogans and outrageous behavior.  Breaking this cycle of political opportunism and cynicism, has to be a priority for those of us who want government to solve complex problems and help us succeed into the future.<p>ihg  10-8-2021<p>If you like these commentaries, join my blog for free at: https:&#x2F;&#x2F;ikegittlen.substack.com&#x2F; and share. Let’s see what we can build together",
      "time": 1633697743,
      "title": "On Looking for “The Persuadable’s”",
      "type": "story"
    }
  ]
}