{
  "stories": [
    {
      "by": "clouded",
      "descendants": 0,
      "id": 31820677,
      "score": 1,
      "text": "First post here. It&#x27;s 2 AM and can&#x27;t sleep. I&#x27;m 40 and the majority of my experience has been in Java. Spring, Spring Boot, Hibernate, what you&#x27;d expect. I&#x27;m pretty much at the top of my game (which I know is specifically Java, but bare with me).<p>We all know technology constantly changes and progresses, and I&#x27;ve always thought that&#x27;s fine, I&#x27;ll be happy to learn whatever replaces Java because it will be better, right? I&#x27;ve seen Go coming along, Kotlin too. But I&#x27;ve been hit like a brick in the face to realize where we&#x27;re headed. AWS. The cloud. I&#x27;ll get to the point. I hate it. I&#x27;ve seen it happen personally at two companies now. The transition to the cloud. Where we throw away everything we&#x27;ve spent years learning to reinvent the wheel. We throw away relational databases for MongoDB. I love SQL. I&#x27;m good at it. But no one cares. MongoDB is &quot;in&quot; now. I&#x27;m good at Java. Years of experience and I finally feel good in my abilities and speed with the frameworks, ORM&#x27;s, best practices, etc. We&#x27;re just throwing it out like it&#x27;s nothing. For AWS products. Lambdas written in Typescript (why Typescript, I don&#x27;t know, the same reason I don&#x27;t know why MongoDB). Files of YAML configuration, and Kubernetes and a lot of other things I don&#x27;t care about, just to create the same CRUD apps we&#x27;ve always been creating.<p>I&#x27;ve been buying power tools and learning how to use them. I&#x27;ve started taping and patching drywall. I&#x27;ve cut down trees. I want tools that won&#x27;t change every 5 years. I want tools that I can master and will be relevant in 50 years. Maybe I&#x27;m too old to be a carpenter, or tradesman. I just need some advice. The worst thing is, developers are embracing this AWS trend and seem to love it. No one seems to mind. Software engineers are cursed. Just when we&#x27;ve established a best practice and it&#x27;s a solved problem, we throw it out and reinvent a new way to do it.<p>Please let me know if I&#x27;m not alone, or if it&#x27;s just me and I need to adapt or get out of the way. I will predict this though: AWS is a mistake. It&#x27;s not fun. It&#x27;s not &quot;software engineering&quot; and it won&#x27;t be here in 10, 15, 20 years. All your mastery of Kubernetes will be for nothing. It will be tossed aside like trash. And the worst part is when that day comes everyone will act like it was never that great all along. They&#x27;ll also embrace the next trend like it&#x27;s the greatest thing ever. Because software engineers are cursed.",
      "time": 1655793631,
      "title": "Need some advice, feeling depressed about the direction of our industry",
      "type": "story"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31820663,
      "score": 1,
      "time": 1655793573,
      "title": "Wordpress.org Strongly Urges Theme Authors to Switch to Locally Hosted Webfonts",
      "type": "story",
      "url": "https://wptavern.com/wordpress-org-strongly-urges-theme-authors-to-switch-to-locally-hosted-webfonts"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31820654,
      "score": 1,
      "time": 1655793541,
      "title": "ML mistake: not collecting the right features",
      "type": "story",
      "url": "https://twitter.com/fchollet/status/1539019133282447360"
    },
    {
      "by": "zzh8829",
      "descendants": 0,
      "id": 31820650,
      "score": 2,
      "text": "cloudflare.com returning 500\n1.1.1.1 DNS not responding<p>discord, downdetector and many other sites are down as well",
      "time": 1655793506,
      "title": "Cloudflare Is Down",
      "type": "story"
    },
    {
      "by": "Satam",
      "descendants": 0,
      "id": 31820647,
      "score": 2,
      "time": 1655793496,
      "title": "Cloudflare Is Down",
      "type": "story"
    },
    {
      "by": "justkez",
      "descendants": 0,
      "id": 31820642,
      "score": 3,
      "text": "Nothing on their official status, but their dashboard is non-operational and numerous reports dripping in of services dropping off",
      "time": 1655793472,
      "title": "Cloudflare Is Down",
      "type": "story"
    },
    {
      "by": "rkwasny",
      "descendants": 12,
      "id": 31820635,
      "kids": [
        31820670,
        31820667,
        31820675,
        31820666,
        31820671,
        31820656,
        31820679,
        31820648,
        31820673,
        31820649,
        31820658,
        31820641
      ],
      "score": 38,
      "time": 1655793455,
      "title": "Cloudflare Down Worldwide",
      "type": "story",
      "url": "https://www.cloudflare.com/"
    },
    {
      "by": "zatkin",
      "descendants": 3,
      "id": 31820613,
      "kids": [
        31820624,
        31820645,
        31820633
      ],
      "score": 9,
      "time": 1655793266,
      "title": "Discord Is Down",
      "type": "story",
      "url": "https://twitter.com/IsDiscordDown/status/1539133780304207872"
    },
    {
      "by": "braingenious",
      "descendants": 0,
      "id": 31820534,
      "score": 1,
      "time": 1655792282,
      "title": "South Korea imposing exit ban on ex Terra employees",
      "type": "story",
      "url": "https://twitter.com/unifiedh/status/1538825838279663617"
    },
    {
      "by": "eriner_",
      "descendants": 0,
      "id": 31820502,
      "score": 1,
      "time": 1655792010,
      "title": "Show HN: Blame.email – client-side one-way email generator",
      "type": "story",
      "url": "https://blame.email"
    }
  ]
}