{
  "stories": [
    {
      "by": "jurgenaut23",
      "descendants": 0,
      "id": 31270383,
      "score": 1,
      "time": 1651733564,
      "title": "Effective Communication for Engineering Teams",
      "type": "story",
      "url": "https://www.craft.do/s/QTNODWjzGbnfZR"
    },
    {
      "by": "jurgenaut23",
      "descendants": 0,
      "id": 31270379,
      "score": 1,
      "time": 1651733515,
      "title": "New Cisco Technology Can Predict Network Issues Before They Happen",
      "type": "story",
      "url": "https://markets.businessinsider.com/news/stocks/new-cisco-technology-can-predict-network-issues-before-they-happen-1031419345"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 31270375,
      "score": 1,
      "time": 1651733443,
      "title": "Google urges Chrome 100 users to update to 101 because of 29 security flaws",
      "type": "story",
      "url": "https://www.techspot.com/news/94431-google-urges-chrome-100-users-update-101-because.html"
    },
    {
      "by": "nix23",
      "descendants": 0,
      "id": 31270367,
      "score": 1,
      "time": 1651733375,
      "title": "OmniOSce R151042 Current Stable Release",
      "type": "story",
      "url": "https://omnios.org/download"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31270356,
      "score": 1,
      "time": 1651733287,
      "title": "US Government Research into Worm Holes, Anti-Gravity and Invisibility Cloaks",
      "type": "story",
      "url": "https://www.vice.com/en/article/k7wj9e/newly-released-documents-shed-light-on-government-funded-research-into-worm-holes-anti-gravity-and-invisibility-cloaks"
    },
    {
      "by": "systemvoltage",
      "descendants": 0,
      "id": 31270355,
      "score": 1,
      "time": 1651733287,
      "title": "“Used to respect HashiCorp – Now don’t.” – Cloudflare CEO",
      "type": "story",
      "url": "https://twitter.com/eastdakota/status/1522098889423163394"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31270354,
      "score": 1,
      "time": 1651733283,
      "title": "Ow high to attach Wi-Fi equipment to light poles",
      "type": "story",
      "url": "https://www.nist.gov/news-events/news/2022/05/wi-fi-may-be-coming-soon-lamppost-near-you"
    },
    {
      "by": "TowerTall",
      "descendants": 0,
      "id": 31270349,
      "score": 1,
      "text": "My UPS saved all of my important electric equipment like my computers, but various kitchen machinery and extension sockets doesn&#x27;t work anymore. Everything with a fuse needs to be replaced. The neighbor&#x27;s TV blew.<p>There was a bright white flash inside of my living room, just under an open window and directly above the my UPS surge protector and then all my devices turned off including the surge projector. The PSU in one of the computers is gone, but not the motherboard and rest. It was connected to the UPS.<p>I was sitting on the concrete floor in the middle of the room watching it happen.<p>I live in Thailand in the middle of a big flat coconut groove with only two houses. Except for the palm trees, my house is the tallest structure in a 200 x 200 meters (300 feet)+ area and we have frequent huge thunder storms.<p>Only two months ago, I bought a socket outlet tester. It reported that my sockets was not grounded. I got an electricians out to fix that. I suspect this is the reason why the lightning chooses me. We have frequent big thunderstorms and haven&#x27;t had this issue before, but now there is a ground connection.<p>Any suggestions on what to do next? A big metal stick somewhere in the garden?<p>I don&#x27;t know if there is a proper grounding rod. There is a cable going from the house into the ground, but I don&#x27;t know what it is attached too. The rest of the electric installation is amateur&#x27;s business so could be connected to nothing. The house is a long-term rental and the electric installation came with it, but I can change it regardless of it&#x27;s is a rental.<p>The electricity doesn&#x27;t even come directly from the power company&#x27;s cables. It goes in to the owners house, where the meter is. From there they have pulled a 200 meter cable into ours. There is a fuse box in my house.<p>If everything is wired correctly in my house, should all equipment attached to my UPS have survived this with no impact or is a direct lightning strike so powerful that even high-quality home-grade UPS must give up?<p>I have a $300 UPS from one of the major brands from their pro line up.",
      "time": 1651733249,
      "title": "Ask HN: I think my house just got hit by lightning with me inside",
      "type": "story"
    },
    {
      "by": "Asdrubalini",
      "descendants": 0,
      "id": 31270326,
      "score": 1,
      "time": 1651732963,
      "title": "My PhD Research Workflow–Emacs Inside",
      "type": "story",
      "url": "https://tony-zorman.com/posts/phd-workflow/2022-05-01-my-phd-workflow.html"
    },
    {
      "by": "Schiphol",
      "descendants": 1,
      "id": 31270289,
      "kids": [
        31270303
      ],
      "score": 1,
      "time": 1651732631,
      "title": "Dracula Daily",
      "type": "story",
      "url": "https://draculadaily.substack.com/about"
    }
  ]
}