{
  "stories": [
    {
      "by": "jnxx",
      "descendants": 0,
      "id": 31155253,
      "score": 1,
      "text": "Just to be specific, I am asking about a good way to manage mail in the following situation:<p>I am using an open source email client and a mail hoster who and does the usual spam filtering in an excellent and privacy-friendly way.<p>For reading mail, I use my work computer, my laptop and my phone, the first two running claws-mail and the latter K9 Mail.<p>The issue I have is that I have some parties that I need to communicate with which do the following thing:<p>They are larger companies or associations (think in online shops, recruiting companies, professional organizations, organizators of recreational activities or sites such as LinkedIn or XING).<p>These can legitimately contact me for specific purposes (I gave consent to that, and gave them my email address), but what happens is that they then use my address to contact me for their own (non-consented) purposes, for their magazine, some event, some suggestion, an opportunity, something else, yet another thing, and so on.... The purpose is clear: They want to grab as much of my attention as possible in the hope that I might engage more with their offers or activities.<p>Blacklisting such addresses does not help in the long run, because senders and domains change all the time. Possibly, they have recognized that not all their messages are wanted and could become blocked, and they are now fast-switching sender domains to get around that. The messages and newsletters might have unsubscribe links, but as soon as I unsubscribe one, I have one or two new ones.<p>Traditional keyword-based spam filtering does not help either, because they use the same terms for their legitimate stuff and the things why I did initiate the subscription &#x2F; communication &#x2F; registration in the first place. This would not only block &#x2F;their&#x2F; site, but also mails from people that I am actually more interested in. Part of the problem is that I am actually interested in some of that stuff, but not in the actual deluge of messages.<p>What would help would be perhaps some form of whitelisting. But how to do that effectively?",
      "time": 1650896700,
      "title": "For people using FOSS email software, how do you filter organizational spam?",
      "type": "story"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 31155242,
      "score": 1,
      "time": 1650896654,
      "title": "Nukes, Nubs and Coners: The Unique Social Hierarchy Aboard a Nuclear Submarine",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/34104/nukes-nubs-and-coners-the-unique-social-hierarchy-aboard-a-nuclear-submarine"
    },
    {
      "by": "ashr_",
      "descendants": 1,
      "id": 31155190,
      "kids": [
        31155209
      ],
      "score": 1,
      "time": 1650896481,
      "title": "Show HN: Grape – Transform your code into a tutorial with one click",
      "type": "story",
      "url": "https://www.grape.codes/explore"
    },
    {
      "by": "Schiphol",
      "descendants": 0,
      "id": 31155186,
      "score": 1,
      "time": 1650896469,
      "title": "Small Technology",
      "type": "story",
      "url": "https://small-tech.org/research-and-development/"
    },
    {
      "by": "makerofspoons",
      "descendants": 0,
      "id": 31155182,
      "score": 1,
      "time": 1650896453,
      "title": "Dry Weather Forecast Calls for Higher Food Prices–and Billions in Farm Losses",
      "type": "story",
      "url": "https://www.forbes.com/sites/chloesorvino/2022/04/21/dry-weather-forecast-calls-for-higher-food-prices-and-billions-in-farm-losses/"
    },
    {
      "by": "mrsaidoutbitch",
      "descendants": 0,
      "id": 31155173,
      "score": 1,
      "time": 1650896390,
      "title": "Ask HN: Who is still using Spreadsheet for project mngt?",
      "type": "story"
    },
    {
      "by": "flerovium",
      "descendants": 0,
      "id": 31155155,
      "score": 1,
      "text": "I know this sounds odd, but sometimes this sequence of events will happen:\n1. A simple website won&#x27;t be loading\n2. I&#x27;ll open a new tab and load google\n3. Google loads instantly\n4. I return to the first website. Still hasn&#x27;t loaded.\n5. I&#x27;ll try other websites and they won&#x27;t be loading.<p>To all appearances, my internet will simply become slow, except Google search still loads quickly. I might say, Google&#x27;s servers&#x2F;site are better, but I&#x27;ll check network requests and even the first HTML request of simple static sites won&#x27;t be loading.",
      "time": 1650896299,
      "title": "Ask HN: Is the Internet Faster for Google?",
      "type": "story"
    },
    {
      "by": "agmm",
      "descendants": 0,
      "id": 31155137,
      "score": 3,
      "time": 1650896218,
      "title": "The Balloon Learning Environment",
      "type": "story",
      "url": "https://ai.googleblog.com/2022/02/the-balloon-learning-environment.html"
    },
    {
      "by": "ensocode",
      "descendants": 0,
      "id": 31155087,
      "score": 1,
      "time": 1650896054,
      "title": "Agrivoltaics",
      "type": "story",
      "url": "https://agri-pv.org/en/"
    },
    {
      "by": "idonov",
      "descendants": 0,
      "id": 31155086,
      "score": 1,
      "time": 1650896045,
      "title": "Show HN: DagsHub GitHub Integration – You've been reviewing ML projects wrong",
      "type": "story",
      "url": "https://dagshub.com/blog/introducing-dagshub-connect-the-complete-github-integration-is-here/"
    }
  ]
}