{
  "stories": [
    {
      "by": "Aissen",
      "descendants": 0,
      "id": 29919022,
      "score": 1,
      "time": 1642068874,
      "title": "Zero-copy network send with io_uring",
      "type": "story",
      "url": "https://lwn.net/Articles/879724/"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 29919015,
      "score": 1,
      "time": 1642068794,
      "title": "Historic First Successful Transplant of Porcine Heart into Adult Human",
      "type": "story",
      "url": "https://www.umms.org/ummc/news/2022/first-successful-transplant-of-porcine-heart-into-adult-human-heart"
    },
    {
      "by": "badRNG",
      "descendants": 0,
      "id": 29919012,
      "score": 1,
      "time": 1642068752,
      "title": "Ransomware Actor May Have Leaked Their Previous Victims",
      "type": "story",
      "url": "https://certitude.consulting/blog/en/ransomware-leak/"
    },
    {
      "by": "Louno",
      "descendants": 0,
      "id": 29919004,
      "score": 1,
      "text": "Hi guys,<p>I&#x27;ve been a big fan and proud premium user of RTM for more than ten years now. I love how it sticks to the KISS principle and how developpers haven&#x27;t feel the need to add cunbersome features over the years. It&#x27;s fast, it&#x27;s really efficient and the app had been a big part of my pro and personal life for years.<p>While i&#x27;m very happy to contribute to it by paying my yearly subscription, I&#x27;m still a bit worried about it being sold and&#x2F;or shutdown and would love to be ready for a more sustainable tool when this eventually happens (Fingers crossed, the later the better).<p>I love how Joplin helped me to deal with my notes, how Keepass helped with my passwords, or Veracrypt with my encrypted drives and I would feel safer to have a similar solution for my tasks.<p>Do you guys know any open source desktop or self-hosted app that show similar way to add and handle task ?<p>Thanks for your help.<p>Best,<p>L.",
      "time": 1642068697,
      "title": "Ask HN: Open-source todo app for a Remember the milk user?",
      "type": "story"
    },
    {
      "by": "hyperionplays",
      "descendants": 0,
      "id": 29918994,
      "score": 1,
      "time": 1642068575,
      "title": "ZeroTier on MikroTik Routers",
      "type": "story",
      "url": "https://www.zerotier.com/2021/08/31/zerotier-on-mikrotik/"
    },
    {
      "by": "nanna",
      "descendants": 0,
      "id": 29918980,
      "score": 1,
      "time": 1642068426,
      "title": "Dealing with APIs, JSONs and databases in org-mode",
      "type": "story",
      "url": "https://isamert.net/2022/01/04/dealing-with-apis-jsons-and-databases-in-org-mode.html"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 29918971,
      "score": 1,
      "time": 1642068392,
      "title": "Symmetries Reveal Clues About the Holographic Universe",
      "type": "story",
      "url": "https://www.quantamagazine.org/symmetries-reveal-clues-about-the-holographic-universe-20220112/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 29918952,
      "score": 1,
      "time": 1642068260,
      "title": "New free resources for young people to create 3D worlds with code in Unity",
      "type": "story",
      "url": "https://www.raspberrypi.org/blog/free-resources-unity-game-development-3d-worlds/"
    },
    {
      "by": "thrwawy283",
      "descendants": 0,
      "id": 29918944,
      "score": 1,
      "text": "For a long time I&#x27;ve thought about running my laptop as a cluster of separate, largely immutable VMs that are easy to copy&#x2F;replicate&#x2F;transfer (Proxmox).  The laptop would &quot;boot into&quot; the VM I use for my daily work, with separate VMs for managing a firewall (pfsense), for gaming (Windows), and for running containerized services (CoreOS).<p>It all comes down to the laptop display panel.<p>The problem is getting a VM to &quot;drive&quot; the laptop&#x27;s display, with exclusive control from that guest OS.  I don&#x27;t know how to articulate this Google search.  It is NOT the same as passing through a GPU to the VM.  Because these searches touch on the same topics, I&#x27;m often looking at a solution for giving GPU compute power to a VM.  This is entirely about the laptop display panel and its controller - the host hypervisor should not touch it.<p>How do I make this happen?  I would appreciate anyone&#x27;s help in understanding what I&#x27;m really talking about.  I&#x27;m not sure the laptops display controller is something that can be foisted into a VM as a vfio device.<p>I&#x27;m on an AMD laptop if that helps.  I know Intel has put considerable effort into carving out vfio functions with GVT, but again that is focused around offering GPU compute to the VM.  How do you isolate and dedicate the display controller to the VM.  Does AMD have something like this?<p>Thank you for your help with an odd setup.<p>See here:  https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28334168",
      "time": 1642068215,
      "title": "Ask HN: Can I boot a laptop into a Proxmox guest VM?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29918923,
      "score": 1,
      "time": 1642068080,
      "title": "The Open Source Software Security Summit: securing the world’s code together",
      "type": "story",
      "url": "https://github.blog/2022-01-13-open-source-software-security-summit-securing-the-worlds-code-together/"
    }
  ]
}