{
  "stories": [
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 31064114,
      "score": 1,
      "time": 1650227030,
      "title": "Taiga – Project management tool for multi-functional teams",
      "type": "story"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 31064108,
      "score": 1,
      "time": 1650226990,
      "title": "Reading at Risk: A Survey of Literary Reading in America (2002) [pdf]",
      "type": "story",
      "url": "https://www.arts.gov/sites/default/files/RaRExec.pdf"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31064091,
      "score": 1,
      "time": 1650226864,
      "title": "The Several Canons of CBOR",
      "type": "story",
      "url": "https://www.imperialviolet.org/2022/04/17/canonsofcbor.html"
    },
    {
      "by": "craigjb",
      "descendants": 0,
      "id": 31064080,
      "score": 1,
      "time": 1650226798,
      "title": "Samsung Electronics Cultural Issues Causing Disasters in Foundry, LSI, & DRAM",
      "type": "story",
      "url": "https://semianalysis.substack.com/p/samsung-electronics-cultural-issues"
    },
    {
      "by": "bluefone",
      "descendants": 0,
      "id": 31064059,
      "score": 2,
      "text": "Managers are outsourcing their work to teams, in the name of democracy. They ask the team to come up with goals and direction for the work, which was actually the job of the manager. Effectively this results in someone from the team making decisions on behalf of the manager though he is not a competent authority to do so, leading to poor decisions. Managers believe that this approach has benefits of democracy, empowers the team and makes them more committed to the work etc.<p>However, a business org with roles is different from the political voters without roles. Organization roles have an accountability for the decisions made and they are expected to be experts in their domain. A voter in a democracy is not expected to be accountable for his decisions (there are no wrong votes) nor is expected to be expert in choosing a leader. A democracy is not meant for making decisions at work in an organizational context.",
      "time": 1650226646,
      "title": "Democracy at Work Is Bad",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 1,
      "id": 31064022,
      "kids": [
        31064030
      ],
      "score": 1,
      "text": "affected by an overzealous 2fa I searched for a common swear concatenated with Github and found the repos that communicate their dissatisfaction with their host https:&#x2F;&#x2F;github.com&#x2F;search?q=fuck+you+github",
      "time": 1650226360,
      "title": "Tell HN: I worry GitHub may not have official channels to express problems",
      "type": "story"
    },
    {
      "by": "andrew_",
      "descendants": 0,
      "id": 31064016,
      "score": 1,
      "time": 1650226297,
      "title": "“Simping” from Ritual of Simpanæous",
      "type": "story",
      "url": "https://twitter.com/SWENGTIM/status/1515776021089427458"
    },
    {
      "by": "Animats",
      "descendants": 1,
      "id": 31063965,
      "kids": [
        31064065
      ],
      "score": 1,
      "time": 1650226020,
      "title": "Ever Forward Unstuck",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2022/apr/17/ship-container-stuck-ever-forward-refloated"
    },
    {
      "by": "DevToRecruiter",
      "descendants": 1,
      "id": 31063960,
      "kids": [
        31064017
      ],
      "score": 2,
      "text": "She was my first and currently only relationship. I have two kids with her. I cannot imagine being with anyone else. I’m not religious but our marriage felt sacred. It’s been 4 years and I’m still going through hell. I tried telling myself I didn’t love her but I still do. We have no contact except regarding the kids. It’s eating me alive.<p>I’m in talk therapy and have tried many other therapies so far without any success. I’m not in an emotional space where I can even “replace” her and even if I was that doesn’t seem healthy.<p>There’s this piece of me that’s holding on to what could have been and I don’t know how to let go. Does anyone have experience in dealing with this?<p>I know this isn’t typical HN. But I’ve posted an emotional support questions here in the past with great success.",
      "time": 1650226000,
      "title": "Ask HN: How does one move on after a divorce?",
      "type": "story"
    },
    {
      "by": "ducktective",
      "descendants": 0,
      "id": 31063953,
      "score": 1,
      "time": 1650225975,
      "title": "Why is GIMP still so bad?",
      "type": "story",
      "url": "https://old.reddit.com/r/linux/comments/u5m7xo/why_is_gimp_still_so_bad/"
    }
  ]
}