{
  "stories": [
    {
      "by": "theafh",
      "descendants": 0,
      "id": 27971921,
      "score": 1,
      "time": 1627391044,
      "title": "A New Chapter for Google’s Vulnerability Reward Program",
      "type": "story",
      "url": "https://security.googleblog.com/2021/07/a-new-chapter-for-googles-vulnerability.html"
    },
    {
      "by": "minikites",
      "descendants": 0,
      "id": 27971918,
      "score": 1,
      "time": 1627391029,
      "title": "Apple Gave Uber Access to a Secret Feature That Can Record iPhone Screens (2017)",
      "type": "story",
      "url": "https://wccftech.com/apple-uber-secret-record-iphone-screen/"
    },
    {
      "by": "rabplumbingandh",
      "descendants": 1,
      "id": 27971908,
      "kids": [
        27971909
      ],
      "score": 1,
      "time": 1627390982,
      "title": "How to Get the Best Heating Installation in Your House",
      "type": "story",
      "url": "https://rabplumbingandheatingltd.wordpress.com/"
    },
    {
      "by": "puttycat",
      "descendants": 0,
      "id": 27971876,
      "score": 3,
      "time": 1627390842,
      "title": "Covid-19 in Israel is taking a globally unique course",
      "type": "story",
      "url": "https://www.haaretz.com/israel-news/.premium.HIGHLIGHT-israeli-expert-i-believe-covid-will-catch-up-with-us-all-eventually-1.10035142"
    },
    {
      "by": "makerofspoons",
      "descendants": 0,
      "id": 27971872,
      "score": 1,
      "time": 1627390818,
      "title": "Researcher Stands by Prediction of 2040 Civilization Collapse",
      "type": "story",
      "url": "https://futurism.com/the-byte/prediction-civilization-collapse"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 27971845,
      "score": 2,
      "time": 1627390681,
      "title": "Say the Names of the Forever Wars",
      "type": "story",
      "url": "https://foreverwars.substack.com/p/say-their-names-05a"
    },
    {
      "by": "latexr",
      "descendants": 0,
      "id": 27971827,
      "score": 1,
      "time": 1627390566,
      "title": "Upload Filters: 23 EU Member States Face Legal Action over Copyright Law Delays",
      "type": "story",
      "url": "https://torrentfreak.com/upload-filters-23-eu-member-states-face-legal-action-over-copyright-law-delays-210727/"
    },
    {
      "by": "anconia",
      "descendants": 0,
      "id": 27971826,
      "score": 1,
      "text": "I built ndahrhino.com and ipbutterfly.com as easy, do-it-yourself legal form generators.<p>And I am wondering what are some other very popular legal documents that people use? I can think of many but curious what you use over and over again.",
      "time": 1627390552,
      "title": "Ask HN: What are the most common legal documents that you use for your projects?",
      "type": "story"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 27971819,
      "score": 1,
      "time": 1627390477,
      "title": "Malware Makers Using ‘Exotic’ Programming Languages",
      "type": "story",
      "url": "https://threatpost.com/malware-makers-using-exotic-programming-languages/168117/"
    },
    {
      "by": "gordi",
      "descendants": 0,
      "id": 27971809,
      "score": 1,
      "text": "Hi peers,<p>Gordi from onetool here.<p>We’re a YC backed company that worked hard to solve the SaaS chaos and failed along the way. It’s a story that many founders have experienced one way or another - from flying high after being accepted to YC to reaching rock bottom aka the realization of not being able to offer what you set out to solve. This rollercoaster journey represents the struggle many founders are facing (but are often still not entirely honest about) and we’re paying tribute to it by converting our failed company into a collectible piece of art by selling onetool as the first startup ever sold as an NFT<p>The idea mainly struck us from an angle where we did not understand why failing is so rarely embraced in the startup community. You often see “exits” for “undisclosed amounts” where, in many cases, people tried to hide their failure, trying to make it seem like a successful exit. We thought “that’s not us”.  Instead of whitewashing the situation by going through a fire sale, why not be authentic and do something we actually enjoy doing as our last move: Trying something completely new and different; being entrepreneurial. Being aware of the fact that selling a business this way doesn’t attract buyers in the traditional sense, we think that the journey of a startup setting out with a great vision and eventually failing represents something most entrepreneurs should be able to identify with - the art of failing as you might say. Closing a business is never easy and a culture where failure is something people rather prefer not to talk about makes dealing with it even harder. Selling onetool as an NFT is our way of embracing failure as entrepreneurs. Being transparent about it and setting an example that even in difficult times there’s room for fresh ideas.<p>You can read the full story here: https:&#x2F;&#x2F;medium.com&#x2F;@gordi&#x2F;why-were-selling-our-yc-startup-onetool-as-nft-art-897e91c67a17<p>If you like the idea feel free to share our auction:https:&#x2F;&#x2F;nft.onetool.co&#x2F;going-down-in-style<p>Cheers,\nGordi",
      "time": 1627390414,
      "title": "Why we’re selling our YC- startup onetool as an NFT",
      "type": "story"
    }
  ]
}