{
  "stories": [
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31648465,
      "score": 1,
      "time": 1654562655,
      "title": "Climate change is harder on less educated",
      "type": "story",
      "url": "https://www.economist.com/international/2022/06/01/climate-change-is-harder-on-less-educated-people"
    },
    {
      "by": "goplayoutside",
      "descendants": 0,
      "id": 31648463,
      "score": 1,
      "time": 1654562634,
      "title": "Building the Figma for Maps",
      "type": "story",
      "url": "https://felt.com/blog/modern-mapping-tools"
    },
    {
      "by": "linkdd",
      "descendants": 0,
      "id": 31648445,
      "score": 1,
      "text": "I&#x27;m looking at you eslint. Publishing a new release almost every 2 weeks.<p>And, following semantic versioning, it&#x27;s always a new feature, not even bugfixes.<p>But eslint is not the only one, and when Dependabot gives you a storm of Pull Requests, this is exhausting to manage.",
      "time": 1654562444,
      "title": "Ask HN: Are you tired of JavaScript libs publishing a release so often?",
      "type": "story"
    },
    {
      "by": "cpncrunch",
      "descendants": 0,
      "id": 31648416,
      "score": 1,
      "time": 1654562176,
      "title": "A 15-year-old Ukrainian drone pilot helped destroy a Russian army column",
      "type": "story",
      "url": "https://globalnews.ca/news/8893672/15-year-old-ukrainian-drone-pilot-russian-column/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31648404,
      "score": 1,
      "time": 1654562096,
      "title": "Apple announces winners of the 2022 Apple Design Awards",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2022/06/apple-announces-winners-of-the-2022-apple-design-awards/"
    },
    {
      "by": "Vaslo",
      "descendants": 0,
      "id": 31648368,
      "score": 1,
      "time": 1654561757,
      "title": "Falling roof during screening of 'Top Gun: Maverick' mistaken as special effects",
      "type": "story",
      "url": "https://www.taiwannews.com.tw/en/news/4560033"
    },
    {
      "by": "c4pt0r",
      "descendants": 0,
      "id": 31648356,
      "score": 2,
      "time": 1654561627,
      "title": "TiKV: A High Performance Transactional Key-Value Database",
      "type": "story",
      "url": "https://github.com/tikv/tikv"
    },
    {
      "by": "Vaslo",
      "descendants": 0,
      "id": 31648347,
      "score": 1,
      "time": 1654561590,
      "title": "James Webb Space Telescope's first full-color images revealed on July 12th",
      "type": "story",
      "url": "https://www.engadget.com/james-webb-space-telescope-first-full-color-images-release-date-spectroscopic-data-180056334.html"
    },
    {
      "by": "andrecarini",
      "descendants": 0,
      "id": 31648326,
      "score": 4,
      "text": "With all the news about the Apple M2 and the people excited to sunset their couple years old computers, I feel compelled to share my reality (and that of many others outside the HN bubble).<p>I&#x27;m a 27 years old software developer from Brazil. The computer in question was assembled in 2007 from parts that were mostly bought abroad (and then gifted to me) by a wealthier relative that was visiting. That&#x27;s a key point: the currency exchange rates and the import taxes make electronics out of reach for the common folks.<p>That was an AMD2+ motherboard, 4GB of DDR2, a 5400 RPM rust spinner, and a Phenom X4 coupled with an ATI 4870.<p>Although the household was never in a dire situation financially, I had always been taught by example to fix things and keep using them for as long as possible. Even back in elementary school times I would troubleshoot computer issues myself and brush off dust from the components.<p>Yes, there have been hardware failures since 2007: two HDDs died (about 6 years lifespan for each), the 4870 died (but I extended its life for one more year with the bake-it-in-the-oven trick), one DIMM failure, a PSU blowout and a CPU cooler bracket mechanical failure.<p>All replacements that had to be purchased would cost me a significant amount of money. HDDs and PSUs were not that expensive, but GPUs were out of reach. When that DIMM died in 2018, I purchased an used and dusty DDR2 replacement kit off AliExpress.<p>After the pandemic hit and I got my first proper (remote) job in 2020, I splurged and replaced some components: a hand-me-down GPU from a wealthier friend (I had been using the onboard graphics since the 4870 died), an AMD3 motherboard, a Phenom II X4 and some DDR3, all used and from AliExpress.<p>The monitor, a 22&quot; TFT panel from Samsung, is still kicking since 2007 with a couple of dead pixels. Same goes for the mouse, manufactured by an unknown Chinese brand, and a membrane keyboard that I completely disassembled and scrubbed clean under a running faucet.<p>Even with my career finally taking off (I&#x27;m due to complete undergraduate Computer Science this year) I don&#x27;t see myself doing major upgrades&#x2F;purchases any soon.<p>When was the last time you gave something extra life instead of throwing it away?",
      "time": 1654561367,
      "title": "Tell HN: I used the same computer since 2007 (with minor upgrades)",
      "type": "story"
    },
    {
      "by": "Ariarule",
      "descendants": 2,
      "id": 31648323,
      "kids": [
        31648423
      ],
      "score": 1,
      "time": 1654561309,
      "title": "My Bet: AI Size Solves Flubs",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/my-bet-ai-size-solves-flubs"
    }
  ]
}