{
  "stories": [
    {
      "by": "rishabhdhar",
      "descendants": 0,
      "id": 28037322,
      "score": 1,
      "text": "Hi HN - Hassaan, Quinn &amp; Rishabh here and we&#x27;re the founders of Tavus.io. We generate personalized videos that realistically imitate your gestures and voice. See a short demo at <a href=\"https:&#x2F;&#x2F;video.tavus.io&#x2F;video?id=2302\" rel=\"nofollow\">https:&#x2F;&#x2F;video.tavus.io&#x2F;video?id=2302</a> and play with it at <a href=\"https:&#x2F;&#x2F;tavus.io&#x2F;playground&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tavus.io&#x2F;playground&#x2F;</a>.<p>Companies like Loom and Vidyard have proven the value of personalized videos for sales, onboarding, marketing, and more. The problem is the time it takes to create a video for each prospect. We make it scalable by generating thousands of personalized videos of you in the time it would take to record one. Our users get the benefits of personalized videos, like large increases in open and reply rates, without having to invest all that time.<p>We struggled with LinkedIn outreach and email marketing at every company we all worked at. It took too many emails and felt spammy. The best responses we got were from emails that we wrote specifically for clients we were particularly interested in. We then tried our hand at video marketing, with generic videos sent to each lead over LinkedIn, which ultimately performed much better than any traditional campaigns we ran.<p>What if we personalized the videos like we personalize emails at scale? We decided to test that, and the results were incredible. People loved the fact that we sent natural videos with our own voices and faces, and we achieved massive increases in demos booked (250% spike). The sales industry is seeing this shift towards more individualized video content as well; companies like Loom are growing rapidly and seeing validating results such as 4x meetings booked. We also found that these videos perform well outside of sales and marketing, specifically in recruiting, onboarding, and customer success.<p>To get started with Tavus, users train an AI model with their voice and face, by submitting a 15 minute video recording. Next they set up a base video template(s) that includes the pitch that they will be giving in the video, along with the associated branded landing page and video background. Once that is set up, videos can be generated at the click of a button. One-off videos can be generated in the Tavus portal, or a CSV can be uploaded to process videos in bulk. Videos can also be generated programmatically through the Tavus API. Each video is automatically personalized in the user’s voice for each unique prospect, and can even automatically generate unique backgrounds, such as a prospects LinkedIn profile or website.<p>People don’t notice imperfections if the content is interesting to them, and unless you are specifically looking for artifacts, Tavus videos are practically indiscernible from a manually recorded video. Therefore our focus is not on generating the most advanced voice-cloning or lip syncing—plenty of great researchers can do that way better than we ever could. Instead it is to provide many immersive personalization options that cater to the customers&#x27; leads. A recruiting company can use video outreach very differently than a sales company, and so on. Our core effort is supporting each of those use cases in depth.<p>Also, people don’t trust videos that have professional green-screen backgrounds, perfect lighting and a voice actor recording for you. They want to see you, see that you are real, they want to hear your voice. In our experience, slight imperfections in your video can actually lead to better outcomes as long as you get the content right, as they make for a more engaging experience. The point is not to fool people into thinking that a recording is fully ‘natural’ but to provide them an immersive experience that is personally relevant to them.<p>Our revenue is generated from a  subscription model. These subscriptions typically include things like video strategy consulting, branded landing pages, and a quota of videos that can be generated per month,<p>We would love to get your feedback on Tavus, and in particular, hear any ideas you have! We’re super excited about this product, and we’ve got a lot of work ahead of us :) Thank you!",
      "time": 1627916308,
      "title": "Launch HN: Tavus (YC S21) – AI-generated personalized videos for sales outreach",
      "type": "story"
    },
    {
      "by": "bouk",
      "descendants": 0,
      "id": 28037317,
      "score": 1,
      "time": 1627916278,
      "title": "Spreadsheet Formulas for Personal Finance",
      "type": "story",
      "url": "https://bou.ke/blog/formulas/"
    },
    {
      "by": "i_have_to_speak",
      "descendants": 0,
      "id": 28037304,
      "score": 1,
      "time": 1627916238,
      "title": "PostgreSQL: Six Not-So-Easy Pieces",
      "type": "story",
      "url": "http://pgdash.io/blog/postgresql-six-not-so-easy-pieces.html?h"
    },
    {
      "by": "juancampa",
      "descendants": 1,
      "id": 28037300,
      "kids": [
        28037356
      ],
      "score": 1,
      "time": 1627916216,
      "title": "Nyxt – The Internet on Your Terms",
      "type": "story",
      "url": "https://github.com/atlas-engineer/nyxt"
    },
    {
      "by": "wagslane",
      "descendants": 0,
      "id": 28037298,
      "score": 1,
      "time": 1627916214,
      "title": "Keep Data Raw at Rest",
      "type": "story",
      "url": "https://qvault.io/clean-code/keep-your-data-raw-at-rest/"
    },
    {
      "by": "jgrahamc",
      "descendants": 0,
      "id": 28037295,
      "score": 1,
      "time": 1627916204,
      "title": "Project Pangea: Helping Underserved Communities Access the Internet for Free",
      "type": "story",
      "url": "https://blog.cloudflare.com/pangea/"
    },
    {
      "by": "hanguokai",
      "descendants": 0,
      "id": 28037279,
      "score": 2,
      "time": 1627916120,
      "title": "Show HN: A web video player for local files",
      "type": "story",
      "url": "https://webvideoplayer.org/"
    },
    {
      "by": "eplanit",
      "descendants": 0,
      "id": 28037275,
      "score": 1,
      "time": 1627916115,
      "title": "The Pandemic Has Forced People to Rethink What They Want from a Job",
      "type": "story",
      "url": "https://morningconsult.com/2021/08/02/workplace-incentives-to-join-leave-polling/"
    },
    {
      "by": "mpsq",
      "descendants": 0,
      "id": 28037269,
      "score": 1,
      "time": 1627916072,
      "title": "Libopenaptx: Open-source implementation of Audio Processing Technology (aptX)",
      "type": "story",
      "url": "https://github.com/pali/libopenaptx"
    },
    {
      "by": "koins",
      "descendants": 1,
      "id": 28037259,
      "kids": [
        28037260
      ],
      "score": 1,
      "time": 1627916020,
      "title": "Show HN: CTF “Start Here” Script",
      "type": "story",
      "url": "https://github.com/kmanc/intelligent_machine_discovery"
    }
  ]
}