{
  "stories": [
    {
      "by": "avinassh",
      "descendants": 0,
      "id": 29476613,
      "score": 1,
      "time": 1638903104,
      "title": "Upgrading to Django v4 (From v1)",
      "type": "story",
      "url": "https://avi.im/blag/2021/rc-day-20/"
    },
    {
      "by": "nazgulsenpai",
      "descendants": 0,
      "id": 29476608,
      "score": 1,
      "time": 1638903091,
      "title": "Microsoft offers 50% subscription discounts to Office pirates",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-offers-50-percent-subscription-discounts-to-office-pirates/"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 29476585,
      "score": 1,
      "time": 1638903001,
      "title": "The ‘stats ambassadors’ taking the fear out of numbers",
      "type": "story",
      "url": "https://www.siliconrepublic.com/innovation/royal-statistical-society-stats-ambassador"
    },
    {
      "by": "galfarragem",
      "descendants": 0,
      "id": 29476577,
      "score": 1,
      "text": "Question from Kevin Kelly that I feel it fits very well here:<p>&quot;Thought experiment: You are sent via a special time machine to the same place on Earth 500 years into the past. Your machine can return with you and one passenger. For the passenger from the past it is a one-way trip into the future. You need to convince the person back then back then (a farmer, or miller, or cook, or King) to come to 2022. Even though I am utterly certain we are thousands of times better off now, no matter who they are, I think I would have trouble describing our time in a way that would make it desirable for them to entice them to come to our time. Convincing them it is better now is especially hard if they starting asking good questions. Our modern world might sound ridiculous, or maybe just unbelievable. However, the honest truth is all we would probably need to tell the average person 500 years ago is that they can have all the food they want anytime anywhere; they would climb right in.<p>So here is the experiment. A guy appears at your door. He has a glowing sphere in his hand. He says he is from the future and will transport you 500 years into that future. You want to know what that future world is like. What does he have to say in order for you to get in? What is the future equivalent of “all the free food you can eat”? Five hundred years from now, there could be abundance of material things enabled by machines that in effect makes everything “as if” it were free. That might be enough to get us to zoom to the future, despite the inevitable weirdness it will have. But for most people there might need to be more than free stuff.<p>Let’s make it even easier call; it’s not a one way trip. Let’s say someone offers you a round-trip ride into the future 500 years from now — but you have to stay 2 years. What would this world have to have before you get in?  What would be an irresistible future?&quot;<p>original: https:&#x2F;&#x2F;kk.org&#x2F;thetechnium&#x2F;the-irresistible-future&#x2F;",
      "time": 1638902964,
      "title": "Ask HN: The Irresistible Future?",
      "type": "story"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 29476575,
      "score": 2,
      "time": 1638902946,
      "title": "Social Media Initiative to Develop Communication Skills for Scientists",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5969406/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 29476573,
      "score": 1,
      "time": 1638902928,
      "title": "Wolfram Alpha",
      "type": "story",
      "url": "https://www.wolframalpha.com/"
    },
    {
      "by": "skanderbm",
      "descendants": 0,
      "id": 29476545,
      "score": 1,
      "time": 1638902802,
      "title": "Rockstar: A programming language for hard rock metal fans",
      "type": "story",
      "url": "https://codewithrockstar.com/"
    },
    {
      "by": "throwmemoney",
      "descendants": 0,
      "id": 29476466,
      "score": 2,
      "time": 1638902454,
      "title": "Amazon services down for thousands of users",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-59568858"
    },
    {
      "by": "guedou",
      "descendants": 0,
      "id": 29476418,
      "score": 1,
      "time": 1638902241,
      "title": "Status of post-quantum cryptography implementation",
      "type": "story",
      "url": "https://blog.quarkslab.com/status-of-post-quantum-cryptography-implementation.html"
    },
    {
      "by": "spekcular",
      "descendants": 2,
      "id": 29476415,
      "kids": [
        29476537,
        29476526
      ],
      "score": 2,
      "time": 1638902225,
      "title": "Bitcoin's self-proclaimed inventor wins trial over stash worth $54B",
      "type": "story",
      "url": "https://www.cnn.com/2021/12/07/tech/bitcoin-creator-trial-fortune/index.html"
    }
  ]
}