{
  "stories": [
    {
      "by": "picture",
      "descendants": 0,
      "id": 30617896,
      "score": 1,
      "time": 1646849095,
      "title": "Reverse-engineering the waveform generator in a 1969 breadboard",
      "type": "story",
      "url": "https://www.righto.com/2022/03/reverse-engineering-waveform-generator.html"
    },
    {
      "by": "KyleBerezin",
      "descendants": 0,
      "id": 30617893,
      "score": 1,
      "time": 1646849091,
      "title": "Plastic Automotive Engine",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Plastic_automotive_engine"
    },
    {
      "by": "derw-lang",
      "descendants": 0,
      "id": 30617892,
      "score": 1,
      "time": 1646849061,
      "title": "A Love of Languages",
      "type": "story",
      "url": "https://derw.substack.com/p/a-love-of-languages"
    },
    {
      "by": "OrbitalShotput_",
      "descendants": 0,
      "id": 30617884,
      "score": 1,
      "text": "Microsoft is due to start forcing every single account on Minecraft to a Microsoft if it isn&#x27;t already, over the next 2 days, I have read.\nI have learned that if you make a Microsoft account, their system auto-locks you out and forces you to provide them a phone number<p>I play with my family (it&#x27;s something we&#x27;ve bonded together over a long time) and we take our privacy seriously, and don&#x27;t give up our phone numbers to companies , frequently using burner apps or other methods to set up stuff.<p>However, Microsoft accounts don&#x27;t accept VOIP numbers it seems, and their official guidance is to find someone near you if you don&#x27;t have a phone, and use their phone to validate your account. This seems like a huge risk to someone else, with Microsoft now having their number (there&#x27;s nothing that indicates they don&#x27;t keep it.)\nAlso, if this is for spam prevention, then if you have a lot of kids, you would be in trouble due to multiple accounts sharing the same number unless you bought every kid a phone.<p>Apparently alternate email addresses used to be enough, to stop this but the system still automatically flags you. I don&#x27;t know if TOTP 2 factor authentication  works, but have read if you submit the reclaim-your-account form with lots of personal details, Microsoft considers this not-workable if you had setup MFA on your account and won&#x27;t intervene.<p>An option with Microsoft accounts is to set up their own dedicated microsoft authentication app to get in passwordlessly (but that feature isn&#x27;t going to be on the Minecraft launcher, likely) , but this isn&#x27;t as clear cut over if it pulls your phone number and other details from your phone.<p>Does anyone know of a method my family could preserve their phone number privacy  while continuing to play?<p>Is there a way to set up a Microsoft account with enough authentication that it doesn&#x27;t auto-ban you a little bit later and force you to give them more info to keep the account?\nI don&#x27;t know if TOTP is enough, there&#x27;s been mixed results per https:&#x2F;&#x2F;github.com&#x2F;MultiMC&#x2F;Launcher&#x2F;issues&#x2F;4093<p>I know some might wonder about third party clients or as some called them it seems ,hacked clients , but those don&#x27;t support LAN&#x2F;multiplayer it appears.<p>Note: the message Microsoft accounts tell you is that they detected suspicious activity, but for those who gave them the info then checked the suspicious activity log in the (new)account, nothing but their own logins are shown, indicating this might be more of a phone-number-obtaining thing. I have trouble believing the tens of millions of players on Minecraft are all able to give phone numbers, and this seems concerning from a privacy point of view.",
      "time": 1646849014,
      "title": "Can Minecraft be played without giving MS a Phone#?",
      "type": "story"
    },
    {
      "by": "biggestlou",
      "descendants": 0,
      "id": 30617878,
      "score": 1,
      "time": 1646849003,
      "title": "Remote Protobuf Plugin Execution with the Buf Schema Registry",
      "type": "story",
      "url": "https://buf.build/blog/remote-plugin-execution"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30617864,
      "score": 1,
      "time": 1646848913,
      "title": "Russia soon unable to pay its debts, warns agency",
      "type": "story",
      "url": "https://www.bbc.com/news/business-60672085"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30617838,
      "score": 1,
      "time": 1646848831,
      "title": "Elon Musk’s space solar college paper = fantastic (2019)",
      "type": "story",
      "url": "https://elisashebaroblog.wordpress.com/2019/07/03/elon-musks-space-solar-college-paper-fantastic/"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 30617834,
      "score": 1,
      "time": 1646848804,
      "title": "GitHub vs. Gitlab: The Key Differences",
      "type": "story",
      "url": "https://www.zdnet.com/article/github-vs-gitlab-the-key-differences/"
    },
    {
      "by": "julienchastang",
      "descendants": 0,
      "id": 30617832,
      "score": 2,
      "time": 1646848799,
      "title": "Biden Orders Study of Cryptocurrency Risk, Creation of U.S. Digital Currency",
      "type": "story",
      "url": "https://www.wsj.com/articles/biden-to-order-study-of-cryptocurrency-risk-creation-of-u-s-digital-currency-11646823600"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30617831,
      "score": 2,
      "time": 1646848787,
      "title": "Congrats to Rigetti Computing (YC S14) on Going Public",
      "type": "story",
      "url": "https://www.ycombinator.com/blog/rigetti-goes-public/"
    }
  ]
}