{
  "stories": [
    {
      "by": "petee",
      "descendants": 0,
      "id": 29947698,
      "score": 1,
      "time": 1642264462,
      "title": "Microsoft Yanks Buggy Windows Server Updates – ReFS Volumes Unavailable",
      "type": "story",
      "url": "https://threatpost.com/microsoft-yanks-buggy-windows-server-updates/177648/"
    },
    {
      "by": "pavanyara",
      "descendants": 0,
      "id": 29947695,
      "score": 1,
      "time": 1642264448,
      "title": "Kim Kardashian, Floyd Mayweather and a crypto token’s wild ride",
      "type": "story",
      "url": "https://www.ft.com/content/a6dd4d6f-6a86-48cc-992c-f8a32c64fdd7"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 29947677,
      "score": 1,
      "time": 1642264328,
      "title": "First Pig-to-Human heart-transplant: what can Scientists learn?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-00111-9"
    },
    {
      "by": "rwmj",
      "descendants": 0,
      "id": 29947669,
      "score": 1,
      "time": 1642264273,
      "title": "The Official List of Every Company’s Back-to-Office Strategy (Updated Weekly)",
      "type": "story",
      "url": "https://hubblehq.com/blog/famous-companies-workplace-strategies"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 29947665,
      "score": 1,
      "time": 1642264245,
      "title": "What’s an useful website most people probably don’t know about?",
      "type": "story",
      "url": "https://twitter.com/engineers_feed/status/1482252330158411777"
    },
    {
      "by": "happythen",
      "descendants": 0,
      "id": 29947654,
      "score": 1,
      "text": "When programming something &#x27;new&#x27; (somewhat complex to really complex), do you:<p>1) Write tests first.<p>2) Draw something, with pencil or with a chart program.<p>3) Start programming, see where it leads.<p>4) Procrastinate and think, &quot;I believe I will know what to do when I have to do it&quot;.<p>5) Grab a coffee and just look at the internets for as long as possible to see if someone has already made this and you can copy&#x2F;paste as much as possible.<p>6) Take a poll from staff to see if anyone wants to work on this first before you absolutely have to commit.<p>7) Say you did it the thing, and say it&#x27;s in production, and really check if anyone notices.<p>8) Read up on internal work-related pages to see if you can build a &quot;someone else should do this&quot; case.<p>9) Find a way to tie in 34 other concerns you have with the software in general, that&#x27;s definitely more important, and ask for a 14-month extension.<p>10) watch youtube videos that criticize movies you like just so you can feel something and then tell everyone, &quot;There are some issues with this, we should remove the deadline as I am waiting to hear back from people, out of my hands&quot;.<p>11) Go on a meeting blitz, departmental tour to see if you can find anyone that will tell you not to do it.<p>12) Tell your stakeholders the requirements aren&#x27;t defined enough.  Continue that loop until the stakeholders have to write out the logic themselves. Teach stake holders how to write an if statement. Hire your stake holders.<p>13) YOLO, hardcode 200&#x27;s on all endpoints and blame frontend developers for not requesting data properly, and when they schedule a meeting, claim you have covid symptoms, and learn how to paint on your down time.<p>14) write a giant list of excuses you fantasize about.<p>15) Let the stakeholders know that this gets very specialized, and you need to attend a conference in Hawaii to find a consultant that specializes in this XYZ thing.<p>16) Create a blog, get active on twitter and linkedIn, investigate Rust and how it&#x27;s going to save your career and quit.<p>17) Quit.<p>18) Pretend you will actually finish the coding challenges necessary for FAANG jobs, get burnt out and research &quot;onshore fishing&quot; as a job.<p>19) Learn the use cases, understand that you could white label this mofo and make millions.  Yea... dream about it. Think about it all day.  Start making it. Never finish.  Get fired.  Research unemployment benefits.<p>20) Consider unemployment benefits as Series A funding.<p>21) Go hard, super hard, understand that you can change everything with this new software, work 24&#x2F;7, people will bother you, &quot;you should, like, hang out, take showers, and stuff.&quot; But you know, if you deliver on this, you will... doesn&#x27;t matter, something great will happen.  And you work.  And you circumvent all blockers like Keanu in Matrix 1, not Matrix 4 cause it sucks.  Boom Boom Boom! You finish! It&#x27;s huge! You research &quot;onshore finishing&quot; as a job.",
      "time": 1642264194,
      "title": "Ask HN: How do you start new projects/tasks at work?",
      "type": "story"
    },
    {
      "by": "byoung2",
      "descendants": 0,
      "id": 29947651,
      "score": 1,
      "text": "Is there a well-known sorting algorithm that fits the scenario described below?<p><i>A wise teacher once brought balloons to school, told her pupils to blow them up and write their name on one. After the children tossed their balloons into the hall, the teacher moved through the hall mixing them all up. The kids were given five minutes to find the balloon with their name on it, but though they searched frantically, no one found their own balloon.<p>Then the teacher told them to take the balloon closest to them and give it to the person whose name was on it. In less than two minutes, everyone was holding their own balloon.<p>The teacher said to the children, “These balloons are like happiness. We won’t find it when we’re only searching for our own. But if we care about someone else’s happiness … it will ultimately help us find our own.”</i>",
      "time": 1642264174,
      "title": "Ask HN: Well-known algorithm to describe the balloons in hallway scenario?",
      "type": "story"
    },
    {
      "by": "jeffreyrogers",
      "descendants": 0,
      "id": 29947638,
      "score": 1,
      "time": 1642264108,
      "title": "On the Financialization of Society",
      "type": "story",
      "url": "https://applieddivinitystudies.com/finance/"
    },
    {
      "by": "Michelangelo11",
      "descendants": 1,
      "id": 29947636,
      "kids": [
        29947678
      ],
      "score": 1,
      "text": "In the past, you couldn&#x27;t use almost any Twitter functionality without an account, but at least you could scroll through someone&#x27;s Tweets. I just tried that a few minutes ago on PG&#x27;s feed, and it soon cut off and I got this message:<p>&quot;See more Tweets from Paul Graham\nWhen you log in you’ll be able to see every Tweet from Paul Graham.&quot;<p>So it did almost the exact same thing Instagram does if you&#x27;re not logged in. Anyone else seeing the same thing?",
      "time": 1642264091,
      "title": "Can't read Twitter at all without an account",
      "type": "story"
    },
    {
      "by": "drakerossman",
      "descendants": 1,
      "id": 29947604,
      "kids": [
        29947688
      ],
      "score": 1,
      "time": 1642263865,
      "title": "Avoid Learning Things That Do Not Compound",
      "type": "story",
      "url": "https://www.drakerossman.com/blog/avoid-learning-things-that-do-not-compound"
    }
  ]
}