{
  "stories": [
    {
      "by": "divan",
      "descendants": 0,
      "id": 30735099,
      "score": 1,
      "text": "There is a neat tool for Flutter development called Monarch.<p>Due to the bug if you run &#x27;monarch upgrade&#x27; it deletes all files in HOME :(\nhttps:&#x2F;&#x2F;github.com&#x2F;Dropsource&#x2F;monarch&#x2F;issues&#x2F;38",
      "time": 1647707390,
      "title": "Monarch upgrade deletes all files in $HOME",
      "type": "story"
    },
    {
      "by": "ivanvas",
      "descendants": 0,
      "id": 30735090,
      "score": 1,
      "time": 1647707337,
      "title": "I Write Elm Applications (2020)",
      "type": "story",
      "url": "https://jezenthomas.com/how-i-write-elm-applications/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30735081,
      "score": 1,
      "time": 1647707286,
      "title": "Avoid Sealed Secrets in your GitOps deployment",
      "type": "story",
      "url": "https://dnastacio.medium.com/why-you-should-avoid-sealed-secrets-in-your-gitops-deployment-e50131d360dd"
    },
    {
      "by": "deeptake",
      "descendants": 0,
      "id": 30735062,
      "score": 1,
      "time": 1647707144,
      "title": "Please don’t make me use Databricks notebooks",
      "type": "story",
      "url": "https://medium.com/@seade03/please-dont-make-me-use-databricks-notebooks-3d07a4a332ae"
    },
    {
      "by": "arsalanb",
      "descendants": 0,
      "id": 30735058,
      "score": 2,
      "text": "Hi HN, I’m Arsalan, founder of Livedocs (<a href=\"https:&#x2F;&#x2F;livedocs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;livedocs.com</a>). Livedocs is a no-code analytics tool that lets you build simple reports with live data from tools like Segment, Stripe, and Google Analytics, without writing code. Here’s a video of how it works: <a href=\"https:&#x2F;&#x2F;cln.sh&#x2F;6NKYiG\" rel=\"nofollow\">https:&#x2F;&#x2F;cln.sh&#x2F;6NKYiG</a>.<p>Working on early stage teams in the past, I got tired of tracking and reporting even simple metrics. My team would resort to either esoteric hacks, VBA scripts, or simply nagging data guys for metrics—even simple ones. Tracking metrics from multiple tools is a pain in the neck.<p>That’s when I realized most teams rely heavily on software that already offer some sort of embedded analytics on their dashboards. All they needed was a way to compose data from these dashboards into a single place.<p>Livedocs lets non-technical users track common metrics like retention, MRR, etc by connecting directly to tools via OAuth. IMO, until teams or projects hit a certain size or success, writing SQL queries or hopping between different dashboards to track simple metrics is overkill. So we let these users build live reports and documents using pre-built blocks that connect to their tools directly.<p>For example, solopreneurs, super-early stage startups, and small businesses use us to keep track of metrics like MRR, churn, web traffic, and product analytics like retention, activation, etc., from Stripe, Google Analytics, and Segment. See here for what that looks like: <a href=\"https:&#x2F;&#x2F;livedocs.com&#x2F;doc&#x2F;1e2e4001-ed5a-44ad-8d13-806deafdde95\" rel=\"nofollow\">https:&#x2F;&#x2F;livedocs.com&#x2F;doc&#x2F;1e2e4001-ed5a-44ad-8d13-806deafdde9...</a>.<p>To pick another example: side projects! I have so many side projects, each with their own Google Analytics, Stripe, and sometimes Twitter account that I lose track of how each is performing. Now I just set up a quick report on Livedocs for each—like this: <a href=\"https:&#x2F;&#x2F;livedocs.com&#x2F;doc&#x2F;46a38473-e525-4482-aa46-4da4a77cf180\" rel=\"nofollow\">https:&#x2F;&#x2F;livedocs.com&#x2F;doc&#x2F;46a38473-e525-4482-aa46-4da4a77cf18...</a>.<p>We call these “live documents” because they are like a document with live variables, graphs, etc. The closest comparison would be a dashboard, but way more flexible—e.g. as editable as a document.<p>I also wanted these documents to be easy to replicate for other projects and quick sharing, so I built a templates feature into Livedocs. Commonly used templates are listed here: <a href=\"https:&#x2F;&#x2F;livedocs.com&#x2F;templates\" rel=\"nofollow\">https:&#x2F;&#x2F;livedocs.com&#x2F;templates</a>. You can easily clone one and connect it to your own data sources to get started, so please feel free to try it out.<p>We charge $30&#x2F;month and offer a free 14 day trial (without a card).<p>I’m keen to hear your feedback!",
      "time": 1647707110,
      "title": "Launch HN: Livedocs (YC W22) – Live data in your documents, without code",
      "type": "story",
      "url": "https://livedocs.com"
    },
    {
      "by": "timedrift",
      "descendants": 0,
      "id": 30735048,
      "score": 1,
      "text": "I have two XSX and one of them runs consistently slower by 5% in a game because the system clock timing is off. I don’t know if the cause is the crystal oscillator or CMOS battery. I searched for hours and did not find anyone with this problem. Is this a widespread XSX issue no one noticed?<p>There is an easy way to test if your Xbox is affected. Please, share your results by going to TestUFO.com using the Edge browser and let us know what your FPS and Hz are.<p>My normal XSX shows 60 FPS and 60Hz. My slower XSX shows 63 FPS and 63Hz. This is consistent with a slow clock. The function to calculate FPS will count more frames if time runs slower.<p>My system clock time will drift by 2 minutes in 40 minutes. I restarted both and the system clock synchronized over the internet to 10:00 AM. Twenty minutes later one was 10:20 and the slower 10:19. Twenty three minutes later one was 10:43 and the slower 10:40.<p>King of Fighters XV, a new fighting game, has a training mode that shows how many frames you hold a direction or button. The game counts fewer frames on the slow XSX if I hold and release a button down at the same time on both XSX. For example, the normal XSX shows I held a button down for 100 frames and the slow XSX shows 94 frames.<p>Character idle animation and menu transitions run noticeably slower. If I reset a character on both XSX, the idle animation on the slow XSX will drift behind the normal XSX.<p>The normal XSX has a serial number lower than the slow XSX. Do newer XSX have this issue?",
      "time": 1647707046,
      "title": "Ask HN: Can Xbox Series X System Clock Time Drift Cause Games to Run 5% Slower?",
      "type": "story"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 30735044,
      "score": 1,
      "time": 1647707025,
      "title": "What the Russia Invasion Teaches Us About Right-Wing Logic",
      "type": "story",
      "url": "https://newsletters.theatlantic.com/the-third-rail/6234aa276c90860020516e75/republican-conspiracy-russia-ukraine/"
    },
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 30735017,
      "score": 1,
      "time": 1647706846,
      "title": "The Russian Army Is Running Out Of Trucks For Its War In Ukraine",
      "type": "story",
      "url": "https://www.forbes.com/sites/davidaxe/2022/03/18/as-predicted-the-russian-army-is-running-out-of-trucks-for-its-war-in-ukraine/"
    },
    {
      "by": "prtkgpt",
      "descendants": 0,
      "id": 30735014,
      "score": 1,
      "time": 1647706818,
      "title": "How to get lost in your neighborhood",
      "type": "story",
      "url": "https://prtkgpt.medium.com/how-to-get-lost-in-your-neighborhood-c7d0a8814283"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 30735013,
      "score": 2,
      "time": 1647706801,
      "title": "Apple M1 Ultra Chip Is Nearly 3 Times Bigger Than AMD’s Ryzen CPUs",
      "type": "story",
      "url": "https://wccftech.com/apple-m1-ultra-chip-is-nearly-3-times-bigger-amd-ryzen-cpus-benchmarks-show-intel-amd-cpus-still-ahead/"
    }
  ]
}