{
  "stories": [
    {
      "by": "kvee",
      "descendants": 0,
      "id": 28602601,
      "score": 1,
      "time": 1632207065,
      "title": "SSC Journal Club: Dissolving the Fermi Paradox",
      "type": "story",
      "url": "https://slatestarcodex.com/2018/07/03/ssc-journal-club-dissolving-the-fermi-paradox/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28602586,
      "score": 1,
      "time": 1632206785,
      "title": "How to read Nancy (1988) [pdf]",
      "type": "story",
      "url": "http://www.laffpix.com/howtoreadnancy.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28602585,
      "score": 1,
      "time": 1632206778,
      "title": "RFC 7282 – On Consensus and Humming in the IETF (2014)",
      "type": "story",
      "url": "https://datatracker.ietf.org/doc/html/rfc7282"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28602581,
      "score": 1,
      "time": 1632206674,
      "title": "Debug sections for hot-patching LLD's ELF output",
      "type": "story",
      "url": "https://lists.llvm.org/pipermail/llvm-dev/2021-September/152697.html"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28602579,
      "score": 1,
      "time": 1632206665,
      "title": "What I learned from a year on Substack",
      "type": "story",
      "url": "https://www.niemanlab.org/2021/09/what-i-learned-from-a-year-on-substack/"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28602575,
      "score": 1,
      "time": 1632206618,
      "title": "Primitive Pictures – Reproducing images with geometric primitives",
      "type": "story",
      "url": "https://github.com/fogleman/primitive"
    },
    {
      "by": "XPermutator",
      "descendants": 0,
      "id": 28602556,
      "score": 1,
      "time": 1632206468,
      "title": "US Law Enforcement is about to put the squeeze on crypto exchanges",
      "type": "story",
      "url": "https://www.cyber-economics.com/2021/09/20/apparantly-new-legislative-push-is-the-the-usa-on-the-way-to-ban-ransomware-payments/"
    },
    {
      "by": "Ice_cream_suit",
      "descendants": 1,
      "id": 28602533,
      "kids": [
        28602538
      ],
      "score": 1,
      "time": 1632206031,
      "title": "Remote Tasmanian GP clinic closes because staff refuse to get the jab",
      "type": "story",
      "url": "https://www.themercury.com.au/nocookies?a=A.flavipes"
    },
    {
      "by": "inflamed",
      "descendants": 0,
      "id": 28602520,
      "score": 1,
      "text": "p3d or xplane. Is it possible to capture and sync Internal Data-references for true systems integration?<p>x-plane (xp) simulator platform, provides world simulation for aircraft (ac) models to plugin to. XP and P3D allow P2P multiplayer, this is limited by the model functions and the huge amount of processing required. I worked around by setup of 2 amazon servers linked as p2p, Users then connect to one of the servers via remote desktop connection (parsec) providing a streaming low latency client&#x2F;server type architecture.<p>The preferred platform, and ac model is P3d and FSL a321x: https:&#x2F;&#x2F;www.flightsimlabs.com&#x2F;index.php&#x2F;a321-x&#x2F;#1477756251107-46cbe338-2c3b the other Toliss A320 on XP. The platform offers multiplayer, but the better model simulates aircraft systems sufficient to use as an instructional aid to our group of users, (NOT commercial use) The problem is the ac model datarefs do not sync via the multiplayer sync app or the native platform app. The ac systems datarefs do not need to interface with flight platform model, therefore the functionality of the ac model we need is lost, with no abnormal aircraft systems the operational or procedural simulation is 80% lost and the result is only a game.<p>ALL data between two P2P software instances will run on a remote AWS or similar, then users use remote connection (PARSEC) to one of the servers with an Automated and intuitive GUI. One of two models and simulator platforms X-Plane (XP) https:&#x2F;&#x2F;www.x-plane.com&#x2F; or Lockheed martin (P3D) https:&#x2F;&#x2F;www.prepar3d.com&#x2F; using a hi-fidelity model A320 https:&#x2F;&#x2F;toliss.com&#x2F;products&#x2F;<p>The workarounds i have thought about are: 1.Linux network solution os and using two AWS servers in the same location, clone and sync the datarefs at more than 20fps embedded within developer gamelink, 2.develop controller interface on one application instance allowing two users with independent views and controllers, 3. Internal code interface for multiplayer Co-op controllers and views. The best format is the last one (3) with one application and two persons interacting with same architecture that emulates two independent or split displays, and independent view and controllers.<p>I like to identify the easiest way to achieve reliable sync of ac model. I prefer Using P3D and or the Toliss A320 in XP. This is for the existing models and third party apps, used for teaching in a closed group. the OEM developer is not interested in developing this most likely becuase it is impossible to sync that much data via P2P and or wants to keep datarefs under lock and key until a client server edition is developed for steam or similar.",
      "time": 1632205851,
      "title": "Multiplayer flight simulator cockpit sync advanced models",
      "type": "story"
    },
    {
      "by": "logronoide",
      "descendants": 0,
      "id": 28602517,
      "score": 1,
      "time": 1632205812,
      "title": "Europe’s OVHcloud Plans IPO at Potential $4.7B Valuation",
      "type": "story",
      "url": "https://www.wsj.com/articles/europes-ovhcloud-readies-possible-4-7-billion-ipo-11632082037"
    }
  ]
}