{
  "stories": [
    {
      "by": "bobbywilson0",
      "descendants": 0,
      "id": 32215854,
      "score": 1,
      "time": 1658684982,
      "title": "Shell ain’t a bad place to FP: part 1/N: McIlroy’s Pipeline",
      "type": "story",
      "url": "https://www.evalapply.org/posts/shell-aint-a-bad-place-to-fp-part-1-doug-mcilroys-pipeline/"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 1,
      "id": 32215839,
      "kids": [
        32215846
      ],
      "score": 1,
      "time": 1658684861,
      "title": "An Encyclopedia of Unknowns",
      "type": "story",
      "url": "https://wikenigma.org.uk/a-z_listing#"
    },
    {
      "by": "MatthiasPortzel",
      "descendants": 0,
      "id": 32215829,
      "score": 1,
      "time": 1658684788,
      "title": "LeechCraft – open-source modular internet-client",
      "type": "story",
      "url": "https://github.com/0xd34df00d/leechcraft"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 32215780,
      "score": 1,
      "time": 1658684527,
      "title": "Laser-fusion facility heads back to the drawing board",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-02022-1"
    },
    {
      "by": "dbld",
      "descendants": 0,
      "id": 32215768,
      "score": 1,
      "text": "Submitting to ML conferences isn&#x27;t a fun experience. One wait for months and the reviews are noisy. We envision an open review platform where anyone can rate and review any research papers. Decouple paper review from publication to break from the zero-sum game mentality of conference reviewing. Let&#x27;s together build the IMDB for research papers. Thank you!",
      "time": 1658684474,
      "title": "Show HN: Doublind, a paper review platform (ML)",
      "type": "story",
      "url": "https://doublind.com/home"
    },
    {
      "by": "fileeditview",
      "descendants": 0,
      "id": 32215765,
      "score": 1,
      "text": "I love playing tactically and&#x2F;or strategically deep board&#x2F;card games. I have played chess, Go, checkers, skat, poker and many TCGs such as Magic the Gathering. I have once tried Bridge but playing&#x2F;learning it online seemed not so great.<p>I still play chess regularly but none of the others for different reasons. In general I am looking for non-TCG games where you always play with the same play set of cards&#x2F;pieces. TCGs can also be very entertaining but they always need new sets and investments to stay interesting whereas games such as chess just work forever.<p>Do you have any other suggestions? I&#x27;d prefer if it is possible to play online since I just don&#x27;t have the time to go to clubs anymore.",
      "time": 1658684470,
      "title": "Ask HN: Which deep board and card games do you know/recommend?",
      "type": "story"
    },
    {
      "by": "cgb223",
      "descendants": 0,
      "id": 32215740,
      "score": 1,
      "text": "I&#x27;m a Product Manager who&#x27;s been applying for jobs recently and have had a good amount of interest from companies that I would be excited to work for.<p>Each time I make it through the initial recruiter interview, then the casual chat with a PM, and then fail at the &quot;Product Sense&quot; portion of the interview.<p>Now, I&#x27;m not new to being a PM, I&#x27;ve been operating in a Senior role at a Big-N tech company for 5 years, and over the course of that time brought multiple products from 0 to 1 to v2.0 that has netted us high 9 figures.<p>So I&#x27;m in this weird place where I know I&#x27;m a decent enough PM, but for whatever reason the structure of the interview just isn&#x27;t conducive for me showing my best self.<p>These interviews are very open ended.<p>The interviewer will suggest a hypothetical product or market that a hypothetical company wants to be successful in, and asks how you&#x27;d go about building that product, getting information about that market, and how you would prioritize features based on information you discover....and that&#x27;s it, then its just up to you the interviewee to ask questions, discern information, and try and make calls. The interviewer will often not give specific answers to your questions at all, so you have to make up your own answers, and then build on those.<p>For whatever reason, my questions, answers, and plans (most of which come from my real life experience) dont seem to be satisfactory.<p>How do I do better at these?",
      "time": 1658684314,
      "title": "Ask HN: How to pass a “Product Sense” interview?",
      "type": "story"
    },
    {
      "by": "ArtWomb",
      "descendants": 1,
      "id": 32215716,
      "kids": [
        32215732
      ],
      "score": 1,
      "time": 1658684194,
      "title": "Scaffolding protein functional sites using deep learning [pdf]",
      "type": "story",
      "url": "https://www.ipd.uw.edu/wp-content/uploads/2022/07/science.abn2100.pdf"
    },
    {
      "by": "sriku",
      "descendants": 0,
      "id": 32215686,
      "score": 1,
      "time": 1658683984,
      "title": "Stigler's Law of Eponymy",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Stigler%27s_law_of_eponymy"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32215681,
      "score": 1,
      "time": 1658683953,
      "title": "Page Is Anonymous",
      "type": "story",
      "url": "http://voidnull.sdf.org/"
    }
  ]
}