{
  "stories": [
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 31232745,
      "score": 1,
      "time": 1651482028,
      "title": "Stm32F429 – Keil projects and libraries for stm32f4xx devices",
      "type": "story",
      "url": "https://github.com/MaJerle/stm32f429"
    },
    {
      "by": "amikodejs",
      "descendants": 0,
      "id": 31232739,
      "score": 1,
      "time": 1651481900,
      "title": "Five Elements of High-Quality Software",
      "type": "story",
      "url": "https://levelup.gitconnected.com/5-elements-of-high-quality-software-3342560b2d86?gi=4d34c8f2e3a8"
    },
    {
      "by": "pimterry",
      "descendants": 0,
      "id": 31232725,
      "score": 1,
      "time": 1651481655,
      "title": "Rescuing the Art of Disagreement",
      "type": "story",
      "url": "https://www.coryzue.com/writing/reasonable-disagreements/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31232724,
      "score": 1,
      "time": 1651481648,
      "title": "Drawing Multiple Sprites of a Water Tank",
      "type": "story",
      "url": "https://lepiter.io/feenk/drawing-multiple-sprites-of-a-water-tank-daker357r2ls686tqyd6g1jgn/"
    },
    {
      "by": "sharedptr",
      "descendants": 0,
      "id": 31232722,
      "score": 2,
      "text": "Python&#x2F;Golang&#x2F;C (ye, C) day-to-day job here.<p>I am interested in either updating myself on (C++11&gt;) or going the Rust way. I see a lot of criticism&#x2F;hate of C++ lately (mostly due to the comittee), but the tooling and libraries are there for multiple areas.<p>Rust is also interesting to me from a security standpoint.<p>So I don&#x27;t really have time to invest in both languages; any directions?",
      "time": 1651481631,
      "title": "Ask HN: Learn C++11 or Rust in 2022?",
      "type": "story"
    },
    {
      "by": "herbertl",
      "descendants": 0,
      "id": 31232713,
      "score": 1,
      "time": 1651481500,
      "title": "One Rogue Exec Thrust Levi’s into the Culture Wars",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2022-04-28/jennifer-sey-s-levi-s-twitter-split-is-modern-corporate-tale"
    },
    {
      "by": "FriendlyVillain",
      "descendants": 0,
      "id": 31232695,
      "score": 1,
      "text": "I saw someone posted that hiring an experienced growth marketer is often cost-prohibitive and I got inspired to write this.<p>But first, who am I?\nI&#x27;m the founder of a customer research agency that works with SaaS startups to help them achieve product-market fit. Some of the clients I&#x27;ve worked with include MetaMap and Flow XO.<p>Back to the topic.<p>Let&#x27;s first think a little. What do experienced marketers do makes them so valuable? They create strategies and then execute on them. But how do they create these precious strategies?<p>A lot of it comes from experience on the market. They&#x27;ve put themselves in enough situations that they have already developed a hunch for it. That doesn&#x27;t tell you much but listen closely now.<p>There are 3 components to good marketing.<p>Who?\nWhere?\nHow?<p>Who?\nExperienced marketers always get a solid grasp on the &quot;Who&quot; first. They would spend time talking to current customers and they would do so until they have a very solid grasp on (1) who exactly uses the product and (2) the circumstances that led to a purchase.\nGetting (2) is crucial as it reveals what&#x27;s the path to purchase. That knowledge is then used to place content strategically along that natural path to purchase. In a sense, the strategy already reveals itself.<p>Where?\nAfter the marketer knows who the target is, it&#x27;s quite easy to guess where to find such people. For example, I know I work with SaaS owners, and thus I found several communities on the topic and joined. This is probably the easiest step. It&#x27;s all about finding relevant communities, newsletters, websites, etc.<p>How?\nThis is the point where many inexperienced marketers would begin. They would read a few article online and attempt different &quot;strategies&quot;. The problem is they base that strategy on their own assumptions. Usually, it&#x27;s the case they are trying to sell carrots to fish.<p>On the other hand, the experienced marketer has already started crafting the strategy. Remember, at that point, we already know (2) the circumstances around a purchase. We know that we should market along that path. So, the marketer begins experimenting and trying things. They create a strategy and start executing.<p>During execution they would tweak different components of that strategy. However, it is the knowledge on Who and Where that allows them to persist and not give up. They know it&#x27;s a matter of hitting the right approach.<p>So, how to hire a less experienced person and still achieve results similar to the pros?\nYou want to do some of the work for them. You want to create very detailed personas that cover the who and where, so the marketer would work only on the how.\nHow to create personas?\nBasically, you are looking for the patterns in behavior. The way to do it is secondary research into survey into interviews (8-10 is enough for 1-2 personas). Then, you want to sit down and analyze so you could capture the patterns.<p>What to ask during interviews:<p>What problem do they solve with your tool? Is your tool part of a larger process within their organization?<p>When did they realize they needed a tool similar to yours?<p>Why did they choose you over the competitors? (you might find you were the third option they tried, thus a task for your marketer to improve that!)<p>Not exhaustive list, but gives direction.<p>The whole process should take you about 2-3 weeks.<p>Now, you are at the point where you have done 2&#x2F;3 of the professional marketer&#x27;s work.<p>You can begin looking for someone that would fit your company culture (e.g. similar way of thinking to you).<p>Once you find them, give them a week to go through the persona work you&#x27;ve done. You want them to really get a solid grasp on your customers and where to find them.<p>After that, they only need to figure out the &quot;How&quot;.<p>If you&#x27;d like help with the process above or simply want to consult, visit our website: https:&#x2F;&#x2F;www.stamresearch.com&#x2F;<p>Hope this helps!",
      "time": 1651481226,
      "title": "How to hire a less experienced marketer and still get the results of the pros?",
      "type": "story"
    },
    {
      "by": "gurjeet",
      "descendants": 0,
      "id": 31232689,
      "score": 1,
      "time": 1651481172,
      "title": "Crash-Only Software",
      "type": "story",
      "url": "https://www.usenix.org/legacy/events/hotos03/tech/full_papers/candea/candea_html/index.html"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 31232686,
      "score": 1,
      "time": 1651481137,
      "title": "The Better Alternative to Lifetime GATs",
      "type": "story",
      "url": "https://sabrinajewson.org/blog/the-better-alternative-to-lifetime-gats"
    },
    {
      "by": "bananapear",
      "descendants": 0,
      "id": 31232682,
      "score": 1,
      "time": 1651481114,
      "title": "The Foegen effect: A mechanism by which masks contribute to Covid-19 CFR",
      "type": "story",
      "url": "https://journals.lww.com/md-journal/fulltext/2022/02180/the_foegen_effect__a_mechanism_by_which_facemasks.60.aspx"
    }
  ]
}