{
  "stories": [
    {
      "by": "ahmarkhan",
      "descendants": 0,
      "id": 29638431,
      "score": 1,
      "time": 1640101388,
      "title": "What are the business opportunities for software engineers?",
      "type": "story"
    },
    {
      "by": "kylegill",
      "descendants": 0,
      "id": 29638419,
      "score": 2,
      "time": 1640101344,
      "title": "Let's Encrypt: the centralized web2 service used by most Web3 projects",
      "type": "story",
      "url": "https://twitter.com/kelseyhightower/status/1473310965454278656"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29638408,
      "score": 1,
      "time": 1640101292,
      "title": "Cheaper Intel Alder Lake Platforms Will Arrive in January, but There's a Catch",
      "type": "story",
      "url": "https://www.tomshardware.com/news/intel-alder-lake-b660-h610-h670"
    },
    {
      "by": "dqpb",
      "descendants": 0,
      "id": 29638406,
      "score": 1,
      "time": 1640101282,
      "title": "Tell HN: Interruptions cost more than the duration of the interruption",
      "type": "story"
    },
    {
      "by": "spaetzleesser",
      "descendants": 0,
      "id": 29638397,
      "score": 1,
      "text": "After coming out of a long time relationship I tried online dating a few moths ago. I got in touch with a woman on match.com, exchanged a few messages on the site, then a few text messsges and did ally met her once.",
      "time": 1640101235,
      "title": "How did Facebook connect me to an online date I have met once?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29638396,
      "score": 1,
      "time": 1640101234,
      "title": "Zone de Sensibilité Picturale Immatérielle",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Zone_de_Sensibilit%C3%A9_Picturale_Immat%C3%A9rielle"
    },
    {
      "by": "gringoDan",
      "descendants": 0,
      "id": 29638370,
      "score": 1,
      "time": 1640101111,
      "title": "The Value of the NFT Bundle",
      "type": "story",
      "url": "https://paranoidenough.com/2021/12/21/The-Value-of-the-NFT-Bundle.html"
    },
    {
      "by": "voxadam",
      "descendants": 0,
      "id": 29638367,
      "score": 1,
      "time": 1640101084,
      "title": "Unix Admin. Horror Story Summary, Version 1.0",
      "type": "story",
      "url": "https://www-uxsup.csx.cam.ac.uk/misc/horror.txt"
    },
    {
      "by": "technicalPM",
      "descendants": 0,
      "id": 29638345,
      "score": 1,
      "text": "My background:\nI never got a CS degree because I started programming when I was 12, building simple programs, games and websites. By the time I was college age, I already had a bit of experience and was working part time developing websites and doing IT support. I&#x27;ve now worked in &quot;tech&quot; for 18 years. I started as a &quot;web dev&quot; in an agency and moved on to full-stack software engineering in a few startups and then for bigger companies, including a FAANG company. I worked as a SWE, a Eng Manager, and then moved into more hybrid roles until I fully switched over to Product Manager about 7 years ago.<p>The problem:\nI&#x27;ve worked as a Technical Product Manager and Senior Product Manager for a few tech companies. The problem is that I&#x27;ve found Product Management to be interesting, but ultimately less challenging that Engineering, at least in the ways I enjoy being challenged. Most of my time is spent in meetings, coordinating other people&#x27;s ideas to other people&#x27;s work. I&#x27;d love to get back to actually building and engineering. I&#x27;m probably not the most brilliant SWE to ever live, but I&#x27;m also not horrible - I&#x27;ve contributed to a book on JS and have built quite a few successful sites and apps. I even keep pretty current by building hobby projects and side projects when I have time. My conversations with other engineers would lead me to believe I&#x27;m actually more up-to-date than many of them, at least on full-stack oriented languages and libraries.<p>When I talk to recruiters or inquire about positions, I get one of two responses.\n1) We require a CS degree \n2) Disbelief that I can work as a SWE (don&#x27;t have current skills)<p>Anyone have any advice on going back to Engineering from Product?",
      "time": 1640100942,
      "title": "How to move from Product back to Engineering?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 1,
      "id": 29638335,
      "kids": [
        29638394
      ],
      "score": 2,
      "time": 1640100909,
      "title": "The Decruiter: We'll help you quit your job",
      "type": "story",
      "url": "https://thedecruiter.com/"
    }
  ]
}