{
  "stories": [
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30781923,
      "score": 1,
      "time": 1648061685,
      "title": "Next Generation Telescopes Could Search for Intelligent Civilizations Directly",
      "type": "story",
      "url": "https://www.universetoday.com/155078/next-generation-telescopes-could-search-for-intelligent-civilizations-directly/"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30781910,
      "score": 1,
      "text": "I am having trouble posting. I have to try several times before anything is finally accepted. It is hit or miss!",
      "time": 1648061602,
      "title": "Truth Social Bugs",
      "type": "story"
    },
    {
      "by": "modinfo",
      "descendants": 0,
      "id": 30781909,
      "score": 1,
      "time": 1648061598,
      "title": "A TUI-rs framework inspired by Elm and React",
      "type": "story",
      "url": "https://github.com/veeso/tui-realm"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 30781895,
      "score": 1,
      "time": 1648061537,
      "title": "The Guide to Modern Data Architecture",
      "type": "story",
      "url": "https://future.a16z.com/emerging-architectures-modern-data-infrastructure/"
    },
    {
      "by": "textman",
      "descendants": 0,
      "id": 30781887,
      "score": 1,
      "text": "The Shingrix manufacturer GlaxosmithKline conducted clinical trials prior to product release but only for two doses. So how did GlaxosmithKline determine two doses are needed if they never ran a trial for a single dose? source:\nhttps:&#x2F;&#x2F;pubmed.ncbi.nlm.nih.gov&#x2F;33580242&#x2F;",
      "time": 1648061481,
      "title": "How was it determined two doses of Shingrix are needed?",
      "type": "story"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 30781862,
      "score": 1,
      "time": 1648061317,
      "title": "Instagram brings back option for chronological feed",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/23/tech/instagram-chronological-order/index.html"
    },
    {
      "by": "heleninboodler",
      "descendants": 0,
      "id": 30781838,
      "score": 1,
      "text": "The short story: my broker keeps sending me email with the subject beginning with &quot;Encrypt:&quot; and assuring me that the contents are encrypted.  They aren&#x27;t.  Anyone who has any clue can clearly look at the raw message and see that the contents are not encrypted.  This has happened to me from various parties for many, many years, and I&#x27;ve always assumed they have some sort of internal encrypted email concept where the client can encrypt&#x2F;decrypt transparently, but that when it exits the company, it&#x27;s necessarily sent in the clear (they don&#x27;t know what kind of mail system is on the receiving end).<p>I&#x27;m well-versed in security.  I know fundamental truths like that I can&#x27;t possibly be reading an encrypted email without having access to a decryption key, and that systems to manage such keys are Hard Problems that simply have no widespread implementation that would feasibly work between my broker and my gmail.  And further, I know how to look at the raw contents of an email and see that it&#x27;s clearly just a base64-encoded PDF that I can open and view without any kind of shared secret.<p>What I <i>don&#x27;t</i> know is .. what are these various email systems that claim to encrypt and send &quot;secure&quot; email actually <i>doing</i>?  I&#x27;m looking for references that give the technical details of how various types of encrypted email systems actually work.  I want to eliminate the magic and be able to have a conversation that doesn&#x27;t stop at the other person saying, &quot;I don&#x27;t know, IT says it&#x27;s encrypted.&quot;",
      "time": 1648061229,
      "title": "Ask HN: Information on common commercial “encrypted email” systems?",
      "type": "story"
    },
    {
      "by": "Anon84",
      "descendants": 0,
      "id": 30781824,
      "score": 3,
      "time": 1648061178,
      "title": "Madeleine Albright, first female US secretary of state, has died of cancer",
      "type": "story",
      "url": "https://thehill.com/homenews/wire/599428-madeleine-albright-1st-female-us-secretary-of-state-has-died-of-cancer-her"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 30781822,
      "score": 1,
      "text": "Sessions are short and logging back in is a pain: email&#x2F;password, captcha, MFA, captcha... if you make a mistake at any step you have to repeat the whole thing. AWS is really great but please improve your auth flow...",
      "time": 1648061170,
      "title": "Tell HN: AWS's login flow is a pain",
      "type": "story"
    },
    {
      "by": "daveaiello",
      "descendants": 0,
      "id": 30781782,
      "score": 2,
      "time": 1648060975,
      "title": "Madeleine Albright Has Died",
      "type": "story",
      "url": "https://www.nbcnews.com/politics/politics-news/madeleine-albright-first-female-secretary-state-dies-84-rcna21247"
    }
  ]
}