{
  "stories": [
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 30377236,
      "score": 1,
      "time": 1645124983,
      "title": ".NET 7 Preview 1",
      "type": "story",
      "url": "https://devblogs.microsoft.com/dotnet/announcing-net-7-preview-1/"
    },
    {
      "by": "gdss",
      "descendants": 0,
      "id": 30377224,
      "score": 1,
      "time": 1645124904,
      "title": "Cybernetics (The Science of Effective Management)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Cybernetics"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30377204,
      "score": 2,
      "time": 1645124787,
      "title": "Quarkus 2.7.1 Released – But Why Quarkus?",
      "type": "story",
      "url": "https://www.i-programmer.info/news/80-java/15223-quarkus-271-released.html"
    },
    {
      "by": "rchaves",
      "descendants": 0,
      "id": 30377201,
      "score": 1,
      "time": 1645124768,
      "title": "Show HN: I've compiled Firefox iOS together with a cookie blocker",
      "type": "story",
      "url": "https://rchaves.app/firefox-ios-without-cookies/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30377190,
      "score": 1,
      "time": 1645124717,
      "title": "Edward Said’s Orientalism and Its Afterlives",
      "type": "story",
      "url": "https://www.jacobinmag.com/2021/12/said-orientalism-postcolonial-theory-capitalism-materialism"
    },
    {
      "by": "hardmaru",
      "descendants": 0,
      "id": 30377181,
      "score": 1,
      "time": 1645124625,
      "title": "EvoJAX: Hardware-Accelerated Neuroevolution",
      "type": "story",
      "url": "https://github.com/google/evojax"
    },
    {
      "by": "vngzs",
      "descendants": 0,
      "id": 30377172,
      "score": 1,
      "time": 1645124598,
      "title": "A Logarithm Is Just the Number of Digits (2021)",
      "type": "story",
      "url": "https://probablydance.com/2021/07/29/a-logarithm-is-just-the-number-of-digits/"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30377156,
      "score": 1,
      "text": "Shut down the entire US. Economy has never been done before and told everybody to quarantine including healthy people and then he didn&#x27;t do anything for early treatment at all. And then he says, stay inside with a mask on and if you catch covid so you can&#x27;t breathe very well, then get yourself to a hospital and strap yourself to a ventilator and that all of them. Wait a couple of years for a vaccine, which I get a cut from. That is insane. America has the most deaths of Any country as a percentage and is a total and he could have come out early and said, take they put him in deep, get outside, eat healthy, exercise. Do all of those things that are helping with early treatment. He didn&#x27;t do any of that even today. Doctors are still prescribing hydroxychloroquine Ivermectin, still do, it didn&#x27;t get on the phone. You can create a hotline to these doctors. They were on the front lines during the pandemic. A what&#x27;s working. What&#x27;s not working? You didn&#x27;t do that. You just said wait for my vaccine and Stacy. Feet apart. What do you do to the entire world was even worse? This plunge, like 300 million people. In the poverty, starvation, malnourishment what he did to our kids, what he did to the supply change, alcoholism drug addiction child abuse, and think about all the small businesses, you shut down. And it&#x27;s like, the biggest transfer of wealth in world history. He takes four trillion away from workers and then about four trillion goes to billionaires. The gummy bears and all these big Tech pick media Giants. They got super rich and they got more powerful and then we just divided against each other. Remember he screwed up the election, you know, we all don&#x27;t trust the Science. Now, science was all wrong. I mean this guy really screwed up. You&#x27;re not waiting to go. That&#x27;s great. Mr. Waters folks. He sitting around the table talking as if he&#x27;s had this conversation May times. He looks down at his notes, I get it. That&#x27;s great. Great.",
      "time": 1645124542,
      "title": "Jesse Waters on Fauci",
      "type": "story"
    },
    {
      "by": "saimiam",
      "descendants": 0,
      "id": 30377155,
      "score": 1,
      "time": 1645124538,
      "title": "I'm building an inbox for my domains but want to share a cool little feature",
      "type": "story",
      "url": "https://old.reddit.com/r/SideProject/comments/suwg28/im_building_an_inbox_for_my_domains_but_want_to/"
    },
    {
      "by": "gnicholas",
      "descendants": 0,
      "id": 30377154,
      "score": 2,
      "text": "When checking my battery stats, I noticed that Exposure Notifications was around 5% of my recent battery usage. Although this isn&#x27;t a lot, it seems like it&#x27;s for a completely useless feature. Is anyone else still using this, or are there any reasons I should deactivate it?",
      "time": 1645124538,
      "title": "Ask HN: Do you still use Exposure Notifications?",
      "type": "story"
    }
  ]
}