{
  "stories": [
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 29294189,
      "score": 1,
      "text": "I put scammers in quotes because I’m not sure if it rises to the level of scamming but I feel like it does.<p>So apparently one can send someone a package with insufficient postage paid upfront, and the recipient is then forced to pay extra postage upon delivery or at the post office in order to receive it.<p>I’m not sure how long this “feature” has been available, but it’s most certainly a thing now— and I am not at all enthused about it.  It was only $3.xx in my case, but I indeed feel wronged.  I would have much rather just paid the extra $3 to not have to now wait until Monday and drive to the post office.<p>I won’t leave the eBayer’s name, but he has tons of 1-star reviewers with the same complaint.  Obviously there must be tons of eBayer’s using the same technique, so the USPS is, unwittingly or not, enabling this scamming practice.",
      "time": 1637468837,
      "title": "Tell (ask?) HN: The USPS is (unknowingly?) enabling eBay “scammers”",
      "type": "story"
    },
    {
      "by": "mmwelt",
      "descendants": 0,
      "id": 29294187,
      "score": 1,
      "time": 1637468805,
      "title": "Meat packaging without absorbent materials",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S2214289421001277"
    },
    {
      "by": "tomcam",
      "descendants": 0,
      "id": 29294172,
      "score": 1,
      "time": 1637468555,
      "title": "Disabling cores to reduce the Pi Zero 2 W's power consumption by half",
      "type": "story",
      "url": "https://www.jeffgeerling.com/blog/2021/disabling-cores-reduce-pi-zero-2-ws-power-consumption-half"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 29294143,
      "score": 2,
      "time": 1637468007,
      "title": "Explanations for the Havana Syndrome",
      "type": "story",
      "url": "http://backreaction.blogspot.com/2021/11/the-3-best-explanations-for-havana.html"
    },
    {
      "by": "wyrm",
      "descendants": 0,
      "id": 29294135,
      "score": 1,
      "time": 1637467928,
      "title": "Halo Composer Forced by Court to Tell People to Destroy Music",
      "type": "story",
      "url": "https://kotaku.com/former-bungie-composer-tells-fans-to-destroy-destiny-mu-1848097066"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 29294112,
      "score": 2,
      "time": 1637467624,
      "title": "What Hot Dogs Can Teach Us About Number Theory",
      "type": "story",
      "url": "https://www.quantamagazine.org/the-secret-math-of-hot-dogs-and-buns-20211118/"
    },
    {
      "by": "zero_kool",
      "descendants": 0,
      "id": 29294107,
      "score": 1,
      "time": 1637467439,
      "title": "The original proposal of the WWW, HTMLized",
      "type": "story",
      "url": "https://www.w3.org/History/1989/proposal.html"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 29294103,
      "score": 1,
      "time": 1637467411,
      "title": "Wander (1974) – a lost mainframe game is found",
      "type": "story",
      "url": "https://ahopeful.wordpress.com/2015/04/22/wander-1974-a-lost-mainframe-game-is-found/"
    },
    {
      "by": "blockwriter",
      "descendants": 1,
      "id": 29294100,
      "kids": [
        29294203
      ],
      "score": 3,
      "text": "I am a novelist by trade, but I began a coding project at the outset of the pandemic. My failed stint as a student of physics included courses in programming. I had a good base to work from when I discovered I needed tasks with a shorter feedback loop than writing to occupy my time. The project consists primarily of tools meant to make explicit the implicit boon that reading is to writers, as well as facilitate the rehearsal and dramaturgy of plays, all by providing a group of contributors and collaborators another place to turn to regularly as part of their methodology. Although it began amateurishly, I was happy to find that my efforts, often fraught, but always enthralling, gradually produced a product that is truly useful and a code base that is mostly clear and concise. I have also been working on other programs that help make my publishing, e-commerce, and retail operation easier to manage. I also have a raspberry pi side project that I would like my hire to scale up.<p>I am ready to hire a programmer, but I am at a loss as to how to do so. I think the project has potential, not great potential, but some potential, and I have capital to invest. I make use of GitHub, but I am inexpert in its intricacies. I am thinking about going to a nearby university and finding an undergraduate to hire. I suppose that I could hire foreign developers, but I would like to develop a relationship with a small team. It is important to me that the software is a creative enterprise and does not lose the esoteric motivation that is literature. Do I need a contract out of the gate? Could I begin a working relationship without too much formality, or is that a bad idea? How do I hire my first developer?",
      "time": 1637467393,
      "title": "Ask HN: How do I hire an initial developer for an earnest undertaking?",
      "type": "story"
    },
    {
      "by": "techolic",
      "descendants": 1,
      "id": 29294096,
      "kids": [
        29294142
      ],
      "score": 2,
      "time": 1637467350,
      "title": "Is the sewage from the Burj Khalifa transported away by trucks?",
      "type": "story",
      "url": "https://skeptics.stackexchange.com/questions/52204/is-the-sewage-from-the-burj-khalifa-transported-away-by-trucks"
    }
  ]
}