{
  "stories": [
    {
      "by": "JonathanBuchh",
      "descendants": 0,
      "id": 28666105,
      "score": 1,
      "time": 1632705057,
      "title": "Great Movies",
      "type": "story",
      "url": "https://www.rogerebert.com/great-movies"
    },
    {
      "by": "mrsalt",
      "descendants": 0,
      "id": 28666104,
      "score": 1,
      "time": 1632705032,
      "title": "GnuCash 4.7",
      "type": "story",
      "url": "https://github.com/Gnucash/gnucash/releases/tag/4.7"
    },
    {
      "by": "joaquinbeltran",
      "descendants": 0,
      "id": 28666103,
      "score": 1,
      "time": 1632705029,
      "title": "Delta Concerns of U.S. School Reopenings and Reducing Airborne Transmission",
      "type": "story",
      "url": "https://www.gospeakupamerica.com/deltaschools"
    },
    {
      "by": "LinuxBender",
      "descendants": 1,
      "id": 28666060,
      "kids": [
        28666080
      ],
      "score": 4,
      "time": 1632704583,
      "title": "It's not your age that's slowing your metabolism, new research says",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_6393a3cab16cabbe7bfa1e77505a6ef8"
    },
    {
      "by": "for_i_in_range",
      "descendants": 0,
      "id": 28666054,
      "score": 1,
      "time": 1632704560,
      "title": "My Honest Opinion on Whether or Not an an Analog Zettelkasten Is for Everyone",
      "type": "story",
      "url": "https://daily.scottscheper.com/num/250/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28666052,
      "score": 1,
      "time": 1632704529,
      "title": "What we were not allowed to see at R. Kelly's trial",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_0e26481ebdfae25a364256a99a3cd941"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28666038,
      "score": 2,
      "time": 1632704412,
      "title": "Find your sleep 'sweet spot' to protect your brain as you age, study suggests",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_12bedd753b4e286f7fa5bcd1dff2bac0"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28666032,
      "score": 1,
      "time": 1632704383,
      "title": "'Probably the worst drug approval decision in recent US history'",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_9aa6f38726ad66bc0a8a829db5756c13"
    },
    {
      "by": "for_i_in_range",
      "descendants": 0,
      "id": 28665998,
      "score": 1,
      "time": 1632704063,
      "title": "Example of an Analog Zettelkasten",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=O5kI1l7JXGY"
    },
    {
      "by": "kshacker",
      "descendants": 1,
      "id": 28665942,
      "kids": [
        28666094
      ],
      "score": 5,
      "text": "Saw this post : https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=25512071 and that motivated me to post about our situation.<p>My son is 23 years old. He has completed AA degree in liberal arts at a local community college. He has complex-partial epilepsy and intellectual disability. In my personal opinion, he is borderline for both conditions : his epilepsy is controlled by medications and his intellectual capacity is quite borderline - he will be on top of the list of disabled people, but will find himself struggling to compete with regular people. Social skills are bad with strangers, but otherwise he is quite communicative.<p>His interests are technology - he can not program, I do not think he could write a for loop, but he can narrate the in-depth progression of technology of all iPhones, Androids, Samsungs and what not. Could he describe all features? Maybe not, but he knows quite a bit that he could be groomed into a salesman (except his current inability to connect to people which may be needed for sales). We looked at Quality Assurance but current QA is quite a bit of programming, and while I think he would be eventually good at manual QA (review of the product and finding faults), not sure those opportunities exist any more.<p>After the long Covid break when we did not want him venturing out anyways, we have just started to push him (yes we need to push him) to start looking for jobs. The first few reactions have been negative. It is clear that we will need to help him find something only via the disability route, and we have started pursuing that route with Department of Rehabilitation although it appears their focus may be to find him any job so that he is not a burden to society<p>Wonder if anyone has suggestions, or just opportunities for (even unpaid) internships where he&#x2F;we can start figuring out what works. We are in South Bay and that would be a preference due to his inability to drive due to epilepsy.",
      "time": 1632703325,
      "title": "Ask HN: How can I help my son with Epilepsy and Intellectual Disability",
      "type": "story"
    }
  ]
}