{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30868654,
      "score": 1,
      "time": 1648742361,
      "title": "US will now offer gender-neutral X option on passports",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/31/23004639/us-gender-neutral-x-option-non-binary-transgender-passports-april-11th"
    },
    {
      "by": "yvana",
      "descendants": 0,
      "id": 30868651,
      "score": 1,
      "text": "Soluções em nuvem OpenText Content Services e Digital Experience suportam banco com gerenciamento avançado de informações e inovação em conformidade regulatória<p>Ontário, 31 de março de 2022 - A OpenText™ (NASDAQ: OTEX), (TSX: OTEX) anuncia que irá fornecer à Close Brothers Asset Finance and Leasing, um dos principais financiadores de ativos do Reino Unido, conteúdo estratégico e gestão de comunicações com clientes para apoiar a sua iniciativa de transformação. As soluções serão entregues e geridas no OpenText Cloud, permitindo à Close Brothers Asset Finance and Leasing implementar a gestão estratégica de documentos em todo o grupo e proporcionar aos seus clientes interações modernas e seguras.<p>&quot;Na Close Brothers Asset Finance and Leasing, nos concentramos no desenvolvimento da nossa estratégia digital e na adoção de tecnologia de nuvem para atender às expectativas em evolução dos clientes&quot;, diz Peter Millard, diretor comercial. &quot;A plataforma de gestão de conteúdos OpenText baseada em nuvem abrangerá a nossa empresa e fornecerá recursos críticos que ajudarão a melhorar as experiências dos nossos clientes com segurança e eficiência.&quot;<p>A Close Brothers Asset Finance and Leasing implementará o OpenText Extended ECM, que permite às organizações compartilhar, colaborar e analisar informações para uma tomada de decisão mais assertiva, enquanto mitiga o risco por meio de governança, conformidade e segurança aprimoradas. A empresa irá também aproveitar o OpenText Extended ECM para integrar serviços de conteúdo com aplicações empresariais vitais como Salesforce, que faz a ponte entre silos, acelera os fluxos de informação e expande a governança para processos de negócios aprimorados.<p>Para modernizar as experiências dos clientes, a instituição financeira também utilizará a oferta da OpenText Digital Experience (DX), o OpenText Exstream, que aproveita dados e conteúdos existentes dentro da organização para fornecer comunicações omnichannel que capacitam a tomada de decisões dos clientes.<p>&quot;Ao remover silos de informação, a Close Brothers Asset Finance and Leasing tem a visão abrangente necessária para melhor servir os seus clientes e aperfeiçoar as operações&quot;, destaca Ted Harrison, vice-presidente executivo de vendas corporativas da OpenText.<p>A Close Brothers Asset Finance and Leasing é uma divisão da Close Brothers, que foi fundada em 1878 e fornece empréstimos, recebimento de depósitos, serviços de gestão de patrimônio e negociação de títulos. O grupo bancário é uma empresa FTSE250, que emprega mais de 3.700 pessoas, principalmente no Reino Unido.<p>Sobre a OpenText\nA OpenText, The Information Company™, permite que as organizações obtenham insights por meio de soluções de gerenciamento de informações líderes de mercado, fornecidas pelo OpenText Cloud Editions. Para obter mais informações sobre OpenText (NASDAQ: OTEX, TSX: OTEX), visite www.opentext.com.br.<p>Contato para imprensa\nVianews Comunicação\nYvana Crizanto – 91 98138-7691\nyvana.crizanto@vianews.com.br\nRosa Pellegrino – 11 99507-1184\nrosa.pellegrino@vianews.com.br",
      "time": 1648742343,
      "title": "Grupo bancário Close Brothers escolhe OpenText para transformação digital",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 30868644,
      "score": 1,
      "time": 1648742308,
      "title": "PostgreSQL versions 9.3 through 11.7 remote code execution exploit",
      "type": "story",
      "url": "https://packetstormsecurity.com/files/166540/PostgreSQL-11.7-Remote-Code-Execution.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30868639,
      "score": 1,
      "time": 1648742287,
      "title": "Russia says its military is regrouping. Assault on eastern Ukraine could be next",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_6d5f6ffea09dec69b66828eb4a503a8f"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30868630,
      "score": 1,
      "time": 1648742212,
      "title": "The impact of the ‘open’ workspace on human collaboration",
      "type": "story",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rstb.2017.0239"
    },
    {
      "by": "leeny",
      "descendants": 0,
      "id": 30868629,
      "score": 2,
      "time": 1648742199,
      "title": "We analyzed 100K technical interviews to see where the best performers work",
      "type": "story",
      "url": "https://blog.interviewing.io/we-analyzed-100k-technical-interviews-to-see-where-the-best-performers-work-here-are-the-results/"
    },
    {
      "by": "wintercarver",
      "descendants": 0,
      "id": 30868628,
      "score": 1,
      "time": 1648742198,
      "title": "From nobody to unicorn in 3 years",
      "type": "story",
      "url": "https://dune.xyz/blog/started-from-the-bottom"
    },
    {
      "by": "LinuxBender",
      "descendants": 1,
      "id": 30868612,
      "kids": [
        30868622
      ],
      "score": 1,
      "time": 1648742111,
      "title": "GParted 1.4: New version of live partition-manipulation tool",
      "type": "story",
      "url": "https://www.theregister.com/2022/03/30/gparted_14/"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 30868599,
      "score": 2,
      "time": 1648742052,
      "title": "Deep Neural Networks and Tabular Data: A Survey",
      "type": "story",
      "url": "https://arxiv.org/abs/2110.01889"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30868585,
      "score": 1,
      "time": 1648741971,
      "title": "How organisations are changing.. The next “next” generation",
      "type": "story",
      "url": "https://swardley.medium.com/how-organisations-are-changing-cf80f3e2300"
    }
  ]
}