{
  "stories": [
    {
      "by": "giantg2",
      "descendants": 0,
      "id": 29960132,
      "score": 1,
      "text": "If someone stole an SD from a security cam, is there a way to track it or identify the person, besides using a second hidden camera?<p>I was thinking of things like a fake card that&#x27;s a tracker (GPS, network&#x2F;IP connection, etc), or a card that contains software that can transmit it&#x27;s location (is that even legal?).<p>Alternatively, I could replace the camera with something network connected. There&#x27;s no wifi or ethernet. Cell could be acceptable, but would prefer a more localized type network, like LoRan or something (maybe 500yd range with trees in the way).",
      "time": 1642367645,
      "title": "Ask HN: How to track SD card theft?",
      "type": "story"
    },
    {
      "by": "dgudkov",
      "descendants": 0,
      "id": 29960130,
      "score": 1,
      "time": 1642367636,
      "title": "Going to space can change the shape of your eyeball",
      "type": "story",
      "url": "https://www.inverse.com/science/spaceflight-eyes"
    },
    {
      "by": "headalgorithm",
      "descendants": 0,
      "id": 29960117,
      "score": 1,
      "time": 1642367588,
      "title": "Pest – An Elegant PHP Testing Framework",
      "type": "story",
      "url": "https://pestphp.com/"
    },
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 29960105,
      "score": 1,
      "time": 1642367503,
      "title": "Charles Domery",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Charles_Domery"
    },
    {
      "by": "vord1080",
      "descendants": 0,
      "id": 29960069,
      "score": 1,
      "time": 1642367290,
      "title": "SpiderMonkey Newsletter (Firefox 96-97)",
      "type": "story",
      "url": "https://spidermonkey.dev/blog/2022/01/14/newsletter-firefox-96-97.html"
    },
    {
      "by": "BrandoElFollito",
      "descendants": 0,
      "id": 29960039,
      "score": 1,
      "text": "I have a 1000&#x2F;400 Mbps fibre connection at home that is and will not ever be loaded.<p>Is there a project I could donate it to? Some kind of shared-something where the missing medium would be bandwidth?<p>I already bittorent some Linux distros but the load is insignificant.",
      "time": 1642367159,
      "title": "Ask HN: How and Where to Donate Bandwidth",
      "type": "story"
    },
    {
      "by": "jrockway",
      "descendants": 0,
      "id": 29960033,
      "score": 1,
      "time": 1642367114,
      "title": "An Examination of the June 2013 East Coast Meteotsunami [pdf]",
      "type": "story",
      "url": "https://tidesandcurrents.noaa.gov/publications/NOS_COOPS_079.pdf"
    },
    {
      "by": "ourmandave",
      "descendants": 0,
      "id": 29960009,
      "score": 2,
      "time": 1642366986,
      "title": "Walmart is quietly preparing to enter the metaverse",
      "type": "story",
      "url": "https://www.cnbc.com/2022/01/16/walmart-is-quietly-preparing-to-enter-the-metaverse.html"
    },
    {
      "by": "gtest",
      "descendants": 0,
      "id": 29960000,
      "score": 1,
      "text": "Hello,<p>I ordered 2 pixel 6 pros from google store. This was on Dec 9th, 2021. The order was delivered on Dec 22nd. However, they only delivered 1 phone. But they claim that they delivered both phones.<p>I contacted support, and created a ticket on Dec 22nd (or Dec 23rd, I don&#x27;t recall). And since then, I keep receiving the same message from them:<p>&gt; Thanks for reaching out to the Google Support team.<p>&gt; Please accept my sincere apologies as it is taking more time than expected.<p>&gt; I can completely understand how inconvenient it is not to have your issue resolved soon. However, let me\nassure you that we&#x27;re trying our best to resolve it as soon as possible.<p>&gt; Furthermore, I&#x27;ve shared the details with our higher end support team. Rest assured, I&#x27;ll notify you as soon as\nthey reply.<p>&gt; I really appreciate your continued patience and cooperation as we work to resolve this situation.<p>Almost every other day, I receive a message like the above, that this info is shared with someone. I was told this ticket is escalated (twice now?). Nothing has moved forward. And it has been 3 weeks (and over a month since the transaction).<p>If this is the experience I have with an order, who know how it is if I need to invoke the warranty.<p>What should I do in this case? Is this a glimpse of how Google support in general is?",
      "time": 1642366973,
      "title": "Ask HN: Google Store support does not investigate order issue",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29959925,
      "score": 1,
      "time": 1642366508,
      "title": "A split 34-key layout for iPadOS – Matt Gemmell",
      "type": "story",
      "url": "https://mattgemmell.com/a-split-34-key-layout-for-ipados/"
    }
  ]
}