{
  "stories": [
    {
      "by": "docdeek",
      "descendants": 0,
      "id": 28153845,
      "score": 1,
      "time": 1628758947,
      "title": "Mailchimp Is Exploring a Sale at $10B-Plus Valuation",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-11/mailchimp-is-said-to-explore-sale-at-10-billion-plus-valuation"
    },
    {
      "by": "Vindl",
      "descendants": 0,
      "id": 28153814,
      "score": 4,
      "time": 1628758753,
      "title": "The most vaccine-hesitant group of all? PhDs",
      "type": "story",
      "url": "https://unherd.com/thepost/the-most-vaccine-hesitant-education-group-of-all-phds/"
    },
    {
      "by": "galfarragem",
      "descendants": 0,
      "id": 28153804,
      "score": 1,
      "time": 1628758699,
      "title": "Crypto leaders are obsessed with life extension",
      "type": "story",
      "url": "https://cointelegraph.com/magazine/2021/08/11/crypto-folk-are-obsessed-with-life-extension-heres-why"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28153794,
      "score": 1,
      "time": 1628758606,
      "title": "Fast Base64 with WASM and SIMD",
      "type": "story",
      "url": "https://github.com/mitschabaude/fast-base64"
    },
    {
      "by": "rich_sasha",
      "descendants": 0,
      "id": 28153764,
      "score": 3,
      "text": "For many good reasons, Apple&#x27;s move to scan offline data on iDevices is heavily criticised by tech-aware people. But that&#x27;s surely only half the debate.<p>Developments in &quot;tech&quot; are without a shadow of a doubt one of the greatest achievements of the last 30 years. When used right, they improve our lives, prolong our lives, save our lives. It seems obvious that there should be an application of technology that helps fight crime, child abuse in particular.<p>But how should that work? A debate where &quot;techies&quot; just say nay to what seems like a win-win for fighting child abuse is incomplete. The world and the big corporations won&#x27;t stop for us. We need to either suggest better alternatives we can push in the public debate, or at least come to terms with the change, and think about mitigating its negative impact.<p>I don&#x27;t have great suggestions off the top of my head, but turning some ideas around:<p>- Make device searches warrant-driven. Law Enforcement would be able to submit (perhaps streamlined, electronic) warrant applications, to be reviewed by court, backed up by other evidence. For something like matching photo hashes, the bar could be lower than e.g. for searching someone&#x27;s house. The flipside would be that if the warrant is found to be inadequately justified (even in retrospect), no data found in it is available for evidence.<p>- On a similar vein, perhaps Law Enforcement only gets very limited information back from such a warrant. For example, only photos matching hashes are available back to them. This severely reduces the usefulness of this as a general fishing tool.<p>- Sadly, I think just saying &quot;let&#x27;s not scan users&#x27; devices&quot; is like trying to ban nuclear weapons. The cat is out of the bag, it can be done, so it will be done. But perhaps not? Is there an alternative that people with low technology awareness would see as adequate?<p>- What non-tech analogies can be made and leveraged in the discussion? A recent HN submission [1] compares the change to mandatory weekly house searches; I don&#x27;t think this would resonate with the general public. House searches are invasive and uncomfortable, much more so than devices, which we all know have a life of their own. Is it like a partner constantly going through our wallets or briefcase&#x2F;handbag? Or going through our messages all the time? What about mobile phone data already available to Law Enforcement - like it or not, they can access our (approximate) location, call logs, bank transactions etc. with a similarly low level of scrutiny. To what extent is scanning photos on our devices different?<p>I hope this can lead to a fruitful discussion on the <i>positive</i> ways technology can be used to fight crime, minimising the impact on innocent people.",
      "time": 1628758221,
      "title": "Discuss HN: How should tech be used to fight child abuse?",
      "type": "story"
    },
    {
      "by": "Schroedingers2c",
      "descendants": 0,
      "id": 28153762,
      "score": 1,
      "time": 1628758196,
      "title": "The Perfectionism Trap",
      "type": "story",
      "url": "https://www.economist.com/1843/2021/08/10/the-perfectionism-trap"
    },
    {
      "by": "IfOnlyYouKnew",
      "descendants": 0,
      "id": 28153691,
      "score": 1,
      "time": 1628757579,
      "title": "The hacker, the tax haven, and $200M in offshore deposits",
      "type": "story",
      "url": "https://www.brookings.edu/blog/future-development/2021/05/05/the-hacker-the-tax-haven-and-what-200-million-in-offshore-deposits-can-tell-us-about-the-fight-against-illicit-wealth/"
    },
    {
      "by": "_thesanjeetc",
      "descendants": 0,
      "id": 28153673,
      "score": 1,
      "time": 1628757404,
      "title": "Generating Podcast Episodes with GPT-2 and Google WaveNet",
      "type": "story",
      "url": "https://betterprogramming.pub/generate-conversational-podcasts-with-gpt-2-and-google-wavenet-1dc9c2edc3ef"
    },
    {
      "by": "edward",
      "descendants": 2,
      "id": 28153669,
      "kids": [
        28153841
      ],
      "score": 5,
      "time": 1628757359,
      "title": "The bug which lost more than $600m in various crypto currencies a few hours ago",
      "type": "story",
      "url": "https://twitter.com/simonw/status/1425333588610801667"
    },
    {
      "by": "annadane",
      "descendants": 0,
      "id": 28153667,
      "score": 1,
      "time": 1628757336,
      "title": "Matrix Closure (2018)",
      "type": "story",
      "url": "https://disroot.org/en/blog/matrix-closure"
    }
  ]
}