{
  "stories": [
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31599077,
      "score": 1,
      "time": 1654196111,
      "title": "Ubuntu 22.10 Replaces Gedit with New Text Editor",
      "type": "story",
      "url": "https://www.omgubuntu.co.uk/2022/05/ubuntu-22-10-new-text-editor"
    },
    {
      "by": "mbowcut2",
      "descendants": 0,
      "id": 31599035,
      "score": 1,
      "time": 1654195942,
      "title": "How the Brain Works: The Thousand Brains Theory of Intelligence – Numenta",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LaAYuygr7_8"
    },
    {
      "by": "gumby",
      "descendants": 0,
      "id": 31599023,
      "score": 1,
      "time": 1654195885,
      "title": "Giraffes May Be Long-Necked for Fights, Not Just Food",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/02/science/giraffe-neck-evolution.html"
    },
    {
      "by": "RBBronson123",
      "descendants": 1,
      "id": 31598978,
      "kids": [
        31599042
      ],
      "score": 7,
      "text": "So it’s with deep professional and personal sadness that I must announce my plans to shut down 70 Million Resources, Inc., the parent company of 70 Million Jobs (the 1st national, for-profit employment platform for people with criminal records) and Commissary Club (the first mobile social network for this population).<p>When I launched 70MR in 2016, I was motivated to build a company that could short circuit the pernicious cycles of recidivism in this country--cycles that destroy lives, tear apart families and decimate communities. I sought to disrupt the sleepy reentry industry by applying technology, focusing on data, employing an aggressive, accountable team, and moving with some urgency. And for the first time, approaching the challenge as a national, for-profit venture.<p>This approach, which I named “RaaS,” (Reentry as a Service), turned out to be wildly effective, and by the beginning of 2020, we were delivering on our mission of driving “double bottom line returns”: build a big, successful business and do massive social good. With the help of Y Combinator and nearly 1,500 investors, I assembled a team and got to work.<p>We succeeded in facilitating employment for thousands of deserving men and women and became operationally profitable.<p>However, the pandemic had other plans for us. When it hit in force in March 2020, companies made wholesale terminations of nearly all our people, and continued their halt in hiring for two years.<p>Our revenue dropped like a rock to almost nothing. I immediately responded by paring our expenses to the bone and began letting team members go. There was no opportunity to raise additional funding, so I began injecting my own money into the company—money I barely have—just to keep the lights on.<p>When the economy and job market began storming back, we were inundated with inbound requests for our services. Our perseverance seemed to be paying off. Except now we were hit with a new gut punch: “The Great Resignation.” Now our workers were reticent to come back to work. And if they did accept a job, they’d often leave after only a few days.<p>It became obvious that we lacked the resources to weather this new storm while hoping and praying the world would normalize soon. (It still hasn’t.)<p>Our coffers are empty. We’ve incurred a relatively small amount of debt (that I personally guaranteed) that I hope to negotiate down. All employees have been paid what they were owed (except for me). I will explore sale of assets we hold.<p>On a personal note, I can’t tell you how grateful and humbled I’ve been that many would entrust their  investment or business with me. For a person who’s done time in prison (me), it’s almost impossible to ask for someone’s trust. I have not yet forgiven myself for things I did which ultimately got me into trouble. But I will be eternally grateful to those that assisted me in my efforts to settle the score and win back my karma.<p>From the beginning I was blessed by an unbelievable team of smart, funny, passionate young people who shared my ambition to cause change. They stuck with me&#x2F;us until the very end.<p>I’m most saddened by the millions of formerly incarcerated men and women who we won’t be able to help. These are some of the most sincere, honest, and heroic people I’ve ever met. It was my life’s honor to work with them.<p>I’m pretty sure I’ll continue my reentry work. Several prominent organizations have indicated their interests in me assuming a leadership role. I need to work, and I need to continue my work.<p>I’m so sorry for this outcome, despite the good we’ve done. I’m not sure we could have done anything differently or better, but ultimately, I take full responsibility. Needless to say, if you have any thoughts or suggestions, please don’t hesitate to reach out, here or at Richard@70MillionJobs.com.<p>This has been the greatest experience of my life; it couldn’t have happened without my getting a second chance.<p>Richard",
      "time": 1654195623,
      "title": "I'm Afraid We're Shutting Down",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31598967,
      "score": 1,
      "time": 1654195601,
      "title": "The consequences of climate change in the Alps are visible from space",
      "type": "story",
      "url": "https://phys.org/news/2022-06-consequences-climate-alps-visible-space.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31598963,
      "score": 1,
      "time": 1654195569,
      "title": "Children in schools with more traffic noise show slower cognitive development",
      "type": "story",
      "url": "https://medicalxpress.com/news/2022-06-children-schools-traffic-noise-slower.html"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31598896,
      "score": 2,
      "time": 1654195226,
      "title": "Despite ‘right-to-repair’ law, there’s no easy fix for wheelchair users",
      "type": "story",
      "url": "https://khn.org/news/article/power-wheelchair-users-right-to-repair-law-no-easy-fix/"
    },
    {
      "by": "latchkey",
      "descendants": 0,
      "id": 31598888,
      "score": 1,
      "time": 1654195189,
      "title": "Gravité",
      "type": "story",
      "url": "http://www.wildbits.com/gravite/"
    },
    {
      "by": "jonluca",
      "descendants": 0,
      "id": 31598887,
      "score": 1,
      "time": 1654195175,
      "title": "Reversing Resy's API to create a reservation bot",
      "type": "story",
      "url": "https://blog.jonlu.ca/posts/resy-api"
    },
    {
      "by": "gsatic",
      "descendants": 0,
      "id": 31598886,
      "score": 1,
      "time": 1654195159,
      "title": "The Langlands Program",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_bJeKUosqoY"
    }
  ]
}