{
  "stories": [
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 29944902,
      "score": 1,
      "time": 1642236481,
      "title": "The Dynamics of SARS-CoV-2 Infectivity with Changes in Aerosol Microenvironment",
      "type": "story",
      "url": "https://www.medrxiv.org/content/10.1101/2022.01.08.22268944v1"
    },
    {
      "by": "devShark",
      "descendants": 0,
      "id": 29944900,
      "score": 1,
      "text": "At work, I need to work with 3 laptops (3 mac book pros).<p>My employer is happy to pay for whatever hardware or software to make it easier.<p>What setup should I go for?<p>I thought about the following options<p>1) my current setup\nI simply have the 3 laptops sitting on the desk, and 1 screen. I move one laptop to the center of the desk, unplug the hdmi cable to the screen of the other laptop, and plug it in the laptop I want to use.\nThis is a bit unwieldy, and there&#x27;s a lot of unplugging&#x2F;replugging<p>2) 1 keyboard, 1 trackpad, 1 screen\nA better option might be to have 1 external keyboard, 1 external trackpad, 1 screen. Laptops would stay on the side of the desk, and I would have a little hardware box on which I click a button that says which laptop the screen&#x2F;keyboard&#x2F;trackpad are linked to.\nDoes such a box even exist? Does it make sense?<p>There are probably good options that I am missing. I&#x27;d be grateful for any thoughts. Thanks!",
      "time": 1642236466,
      "title": "Ask HN: Setup for 3 Laptops",
      "type": "story"
    },
    {
      "by": "aar0ntw",
      "descendants": 0,
      "id": 29944878,
      "score": 1,
      "time": 1642236237,
      "title": "Crane Demo with Alexey DataTalks.Club",
      "type": "story",
      "url": "https://blog.infuseai.io/crane-demo-with-alexey-datatalks-club-6999c4849428"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 29944848,
      "score": 1,
      "time": 1642235966,
      "title": "William H. Gates [pdf]",
      "type": "story",
      "url": "https://www.mimsdcmancherial.com/uploads/library/Bill%20Gates-%20Biography.pdf"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 29944846,
      "score": 1,
      "time": 1642235950,
      "title": "Quitting is just half the story: the truth behind the ‘Great Resignation’",
      "type": "story",
      "url": "https://www.theguardian.com/business/2022/jan/04/great-resignation-quitting-us-unemployment-economy"
    },
    {
      "by": "i_dont_know_",
      "descendants": 0,
      "id": 29944843,
      "score": 1,
      "text": "So, for the last 8 or 9 years, I&#x27;ve offered prospective employers a 20% discount on salary if I can work 4 days a week instead of 5. I usually go with start-ups because they&#x27;re under pressure to hire top-talent but skimp on costs (i.e. they want to offer below-market costs but have trouble justifying why), and they&#x27;re usually flexible enough to not have a HR policy etched in stone against this kind of flexibility. It also usually takes some sort of warming-up to the idea and a whole pitching and easing process to get it (so I&#x27;ll work 5 days for the first few months), but it usually works out in the end.<p>I make everything sound like it&#x27;s economics while discussing it, but I actually get 1000x more enjoyment out of my work and non-work lives under this time-split. There&#x27;s some stigma around &#x27;lazy&#x27; and &#x27;work ethic&#x27; that I usually have to get around, but these are the ideal parameters for me to produce the most sustainably, and keep motivation up sustainably. So I figured this is just my weird quirk... valuing free time over money so much that I do something about it.<p>Recently, though, I&#x27;ve been interviewing candidates for some open tech positions and found a surprising number of them asking for the same thing in some form or another.<p>So I&#x27;m starting to wonder:<p>* Are there lots and lots of us that value free time over money, and there&#x27;s just such a tight cultural stigma (even in our high-earning industry) around discussing it, so no one does?<p>* Are there lots and lots of us that have already instituted something like this with our employers&#x2F;clients under some sort of &quot;keep this between us&quot; understanding? One of the larger companies I worked for, I was told to tell everyone that my day off was a day of &#x27;focused work-from-home&#x27; out of fear that others might ask for something similar.<p>I&#x27;m just wondering what your experiences are, and if this is a weird niche quirk, or actually a cultural shift :)",
      "time": 1642235919,
      "title": "Ask HN: How common is a 4-day work week in our industry?",
      "type": "story"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 29944830,
      "score": 1,
      "time": 1642235660,
      "title": "Does Not Compute",
      "type": "story",
      "url": "https://www.collaborativefund.com/blog/does-not-compute/"
    },
    {
      "by": "Apocryphon",
      "descendants": 0,
      "id": 29944821,
      "score": 1,
      "time": 1642235524,
      "title": "Deep Night, Dark Night",
      "type": "story",
      "url": "https://www.ekstasismagazine.com/blog/2021/12/16/new-night"
    },
    {
      "by": "baby",
      "descendants": 0,
      "id": 29944817,
      "score": 1,
      "time": 1642235455,
      "title": "“ The entire blockchain is about 22kb”",
      "type": "story",
      "url": "https://minaprotocol.com/blog/22kb-sized-blockchain-a-technical-reference"
    },
    {
      "by": "h1x",
      "descendants": 2,
      "id": 29944771,
      "kids": [
        29944874,
        29944827
      ],
      "score": 1,
      "time": 1642234972,
      "title": "There is no such thing as a static website",
      "type": "story",
      "url": "https://blog.wesleyac.com/posts/no-static-websites"
    }
  ]
}