{
  "stories": [
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 28087365,
      "score": 1,
      "time": 1628258993,
      "title": "Where Your Money Goes: The Irish Government's Expenditure Data",
      "type": "story",
      "url": "https://whereyourmoneygoes.gov.ie/en/"
    },
    {
      "by": "volta83",
      "descendants": 0,
      "id": 28087355,
      "score": 1,
      "time": 1628258945,
      "title": "St. Gallen Uni kicks PhD candidate for tweets critical of China's Covid handling",
      "type": "story",
      "url": "https://www.nzz.ch/schweiz/hsg-und-china-kritik-auf-twitter-kostet-doktoranden-abschluss-ld.1637789"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28087354,
      "score": 1,
      "time": 1628258937,
      "title": "Setting Slack Status for Remote Work",
      "type": "story",
      "url": "https://bytebase.io/blog/slack-status-remote-work/"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 28087338,
      "score": 1,
      "time": 1628258876,
      "title": "The Push for GATs Stabilization",
      "type": "story",
      "url": "https://blog.rust-lang.org/2021/08/03/GATs-stabilization-push.html"
    },
    {
      "by": "tomduncalf",
      "descendants": 0,
      "id": 28087335,
      "score": 1,
      "time": 1628258871,
      "title": "In internal memo, Apple addresses concerns around new Photo scanning features",
      "type": "story",
      "url": "https://9to5mac.com/2021/08/06/apple-internal-memo-icloud-photo-scanning-concerns/"
    },
    {
      "by": "Uzo0312",
      "descendants": 0,
      "id": 28087309,
      "score": 3,
      "text": "Hi HN! We are Uzo and Iyanu, the founders of BlackOakTV (<a href=\"https:&#x2F;&#x2F;beta.blackoak.tv\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.blackoak.tv</a>). BlackOakTV is a subscription video platform serving black audiences by making it easy for them to watch TV shows and movies that feature black stories and characters.<p>Nearly three-quarters of Black people want to watch more content that portrays their lives and experiences (Target Market News, 2018), but they can&#x27;t find enough of it, and when they do find it, it usually hasn&#x27;t gotten the budget or development resources that more mainstream content does.<p>When I grew up in the 90s, it seemed like black people had a relatively high number of TV shows to choose from like &quot;Martin&quot;, &quot;Living Single,&quot; and &quot;The Fresh Prince of Bel-Air&quot;. It felt good. I felt represented. Unfortunately, it turns out the 90s were an aberration, and over the next 2 decades, black content would become widely underrepresented in Hollywood. Having watched too much TV as a kid, I foolishly decided to get into media as an adult. I worked as a journalist, producer, media strategist and executive, loving to make content, but always being reminded that my culture wasn’t getting the representation it deserved, and always hoping to do something about that someday.<p>When I started at YouTube and Google, I thought I would finally be able to help change that; I thought the internet and the world&#x27;s biggest video source would bring black people the same awesome experience they were creating for other viewers and creators. Unfortunately, that wasn’t the case. Black millennial users of YouTube, despite using it more than any other millennial group, often expressed that the comments on YouTube could make it an uncomfortable place. And black creators often did not get the same chance at success that their mainstream counterparts did, leading to some black creators filing lawsuits against YouTube. Despite YouTube&#x27;s good intentions, systemic biases in how non-black users treated black creators, as well as the economic realities of Black people only representing 10% of the U.S. audience, have led to YouTube never doing quite enough to address this.<p>So I left YouTube, and Iyanu and I decided to address this on our own. The creator economy is booming, with black influencers among the most creative, and black consumers often among the most energetic and prolific users. I knew that energy could be harvested into a platform that gave black viewers the content they want, and creators the chance to make it. So we started BlackOakTV with the goal of delivering the most, and the best, Black content possible.<p>We license content from indie creators and make it available in one place, so Black viewers have a one-stop shop for the content they want to see. We&#x27;re also creating&#x2F;commissioning original content, to raise the bar on quality. We&#x27;re different from Netflix in that our focus on black content means we can identify new black voices earlier, make it easier to find black content on our platform (hint: it’s everywhere!), and better serve the diversity of black viewers rather than just treating Black people as one single niche. As for the other streaming services targeting black users, our main differentiator from them will eventually be our product. Iyanu is an amazing engineer, and with his prowess, our product will provide a unique viewing experience, full of the features black viewers want.<p>But Netflix’s business model is where we aim to be a lot like them. Because Netflix changed media not just because of how they made their content available, but because for the first time in TV history, the aggregator of the content owned a direct relationship with the end user--and that’s why streaming is so valuable. And it’s why we want to have a product that makes users want to view our content exclusively through our properties. Today, users can go to blackoak.tv or download one of our apps, and after subscribing to our 7-day free trial, they can watch all of our content, on-demand, simply by scrolling through our catalog of shows and films. And because we appreciate the HN community taking time to hear our story, for a short period of time, we’re making some of our original black TV shows available for free on our site and in our apps on iOS, Android, Roku and Amazon Firestick. You don’t even have to sign up, just find the &quot;free section&quot; on our homepage or click the following link: <a href=\"https:&#x2F;&#x2F;beta.blackoak.tv&#x2F;categories&#x2F;free-episodes\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.blackoak.tv&#x2F;categories&#x2F;free-episodes</a>.<p>With that, I welcome any feedback, ideas, or experiences similar to ours. It’s been very challenging trying to enter a quickly maturing business with a lot of competition from public companies, and while we think we have some of the answers, your suggestions, thoughts and advice would be greatly appreciated!",
      "time": 1628258743,
      "title": "Launch HN: BlackOakTV (YC S21) – Netflix for black people",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28087268,
      "score": 2,
      "time": 1628258514,
      "title": "The Tao of Unicode Sparklines",
      "type": "story",
      "url": "https://blog.jonudell.net/2021/08/05/the-tao-of-unicode-sparklines/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28087264,
      "score": 1,
      "time": 1628258481,
      "title": "Are electric cars ‘green’? The answer is yes, but it’s complicated",
      "type": "story",
      "url": "https://www.cnbc.com/2021/07/26/lifetime-emissions-of-evs-are-lower-than-gasoline-cars-experts-say.html"
    },
    {
      "by": "hirundo",
      "descendants": 0,
      "id": 28087229,
      "score": 1,
      "time": 1628258270,
      "title": "Adumbrations of Aducanumab",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/adumbrations-of-aducanumab"
    },
    {
      "by": "throw0101a",
      "descendants": 0,
      "id": 28087218,
      "score": 1,
      "time": 1628258211,
      "title": "Why Hardware Matters with Bryan Cantrill [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=o2GhBig0OWM"
    }
  ]
}