{
  "stories": [
    {
      "by": "marban",
      "descendants": 1,
      "id": 31030883,
      "kids": [
        31030892
      ],
      "score": 1,
      "time": 1649959732,
      "title": "YouTube Shorts now allows creators to splice in long-form videos",
      "type": "story",
      "url": "https://www.theverge.com/2022/4/14/23024230/youtube-shorts-video-sampling-remixing"
    },
    {
      "by": "pombo",
      "descendants": 0,
      "id": 31030869,
      "score": 2,
      "time": 1649959703,
      "title": "Update iasql SET source = 'open';",
      "type": "story",
      "url": "https://blog.iasql.com/os-iasql/"
    },
    {
      "by": "eagledotRL",
      "descendants": 0,
      "id": 31030867,
      "score": 1,
      "text": "Hi HN,I am Anubhav from RamanLabs.We have been developing dedicated modules based on deep-learning for purposes like face-detection,object-detection,pose-estimation etc.<p>We hope to make it easy for developers,hobbyists to integrate such functionalities into their existing app&#x2F;pipeline at the cost of a few milliseconds.All our modules run end to end in super-realtime even on consumer-grade CPUs[0].\nFor now we provide only Python  based API.<p>We provide Demo for each of the  modules to allow testing for your desired data distribution.We also have a blog[1] where we hope to add more technical details about  the framework used to develop these modules.<p>The framework used to develop these modules is completely written in Nim language.We wrap existing ops implementations from libraries like ONEDNN and write our own code where we cannot find one or existing implementation is not good enough,mainly for preprocessing and postprocessing code.Having full access to framework code and being written in a high level language allows us to port newer architectures and optimize them quickly.<p>We would love to hear your feedback on our attempt.<p>[0] Quad-core Cpu with AVX2 instructions.\n[1] &lt;<a href=\"https:&#x2F;&#x2F;ramanlabs.in&#x2F;static&#x2F;blog&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;ramanlabs.in&#x2F;static&#x2F;blog&#x2F;index.html</a>&gt;",
      "time": 1649959699,
      "title": "Show HN: Fast,Compiled deep-learning based modules for inferencing on CPUs",
      "type": "story",
      "url": "https://ramanlabs.in/static/products.html"
    },
    {
      "by": "jonyt",
      "descendants": 0,
      "id": 31030795,
      "score": 1,
      "time": 1649959472,
      "title": "The most important thing in microesrvices",
      "type": "story",
      "url": "https://www.sysaid.com/blog/sysaid-tech/microservices-architecture-asynchronouscommunication-better"
    },
    {
      "by": "davikr",
      "descendants": 0,
      "id": 31030792,
      "score": 2,
      "time": 1649959466,
      "title": "Saudi prince Alwaleed bin Talal rejects Elon Musk's Twitter takeover bid",
      "type": "story",
      "url": "https://www.reuters.com/technology/saudi-prince-alwaleed-bin-talal-rejects-elon-musks-twitter-takeover-bid-tweet-2022-04-14/"
    },
    {
      "by": "blaisco",
      "descendants": 0,
      "id": 31030780,
      "score": 1,
      "time": 1649959426,
      "title": "Private Equity-Backed Checkr (YC S14) Buys GoodHire in $400M Deal",
      "type": "story",
      "url": "https://www.wsj.com/articles/private-equity-backed-checkr-to-buy-goodhire-in-400-million-deal-11649763001"
    },
    {
      "by": "ss48",
      "descendants": 0,
      "id": 31030765,
      "score": 1,
      "text": "https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31025061<p>After looking at the Elon Musk thread growing to over a thousand comments, I&#x27;m thinking that after a comments section grows past a threshold (ex. 500 comments), a &quot;remix comments&quot; button or hyperlink in the comments section might be useful. You click the button and randomly have 5 or 10 comment threads shown to you. That way:<p>- You are likely to end up with something new to read and consider in the thread and other people end up with something different<p>- You don&#x27;t have to click more a million times to find something new.<p>- Discussions and replies do not keep accumulating around the top comment in the thread that otherwise prevent more insightful comments made later from being read.",
      "time": 1649959385,
      "title": "Ask HN: Remix Comments Button on Hacker News?",
      "type": "story"
    },
    {
      "by": "coloneltcb",
      "descendants": 0,
      "id": 31030761,
      "score": 1,
      "time": 1649959369,
      "title": "Link: Simple, secure one-click payments by Stripe",
      "type": "story",
      "url": "https://link.co/"
    },
    {
      "by": "bluesroo",
      "descendants": 0,
      "id": 31030740,
      "score": 3,
      "text": "Some background first: I&#x27;ve been a software engineer for ~7 years now. I have a decently paying job, but we&#x27;re definitely in the first base stretch of home ownership and have 2 children (~1 and ~4 years old).<p>My wife has a strong academic background in pedagogy and LOVES teaching high school, but with the pandemic teaching has really affected her relationship with our girls due to the sheer amount of work being dumped on her. Teacher and admin attrition at her school was suffering terribly and it was leading to her being forced to pick either continuing to work as a teacher and sacrifice all of her time with our kids or figure something else out. I was in awe of my wife&#x27;s capacity for work and the number of plates she can keep spinning while still getting the highest teacher evaluation scores at her school... Only to be met with blanks stares when asked for assistance or any sort of compensation or promotion for the amount of work she was picking up.<p>So she left.<p>After some reflection, we&#x27;re both worried that teaching in general is at a place where most schools will be similar. On top of this, she originally went into teaching thinking that I&#x27;d take mornings (get the kids ready and to school&#x2F; daycare) and she&#x27;d get afternoons since schools are usually out ~3pm. But since the pandemic school hours continue to stretch, further cutting down on what little time she can be with our children.<p>So, back to my question: She&#x27;s at a crossroads, but my professional experience doesn&#x27;t overlap much and most of my connections are not adjacent to education or instructional design. I&#x27;m poking my network and friends and family, but it&#x27;s pretty difficult to find anyone willing to give her a chance outside of education. My gut is that she needs to talk with people because throwing resumes into the void isn&#x27;t going to work if you&#x27;re switching industries and don&#x27;t have the right key words.<p>I&#x27;m very open to any advice, both to help her with some direction or for me with how I can best support her. Up until this point her career has been fairly straight forward, so I can tell it&#x27;s weighing on her that she&#x27;s not getting calls back from applications or much positive feedback.",
      "time": 1649959285,
      "title": "Ask HN: How can I best assist my wife with a career transition?",
      "type": "story"
    },
    {
      "by": "grej",
      "descendants": 1,
      "id": 31030669,
      "kids": [
        31030832
      ],
      "score": 4,
      "time": 1649959061,
      "title": "Twitter Weighs Poison Pill to Prevent Musk from Increasing Stake Significantly",
      "type": "story",
      "url": "https://www.wsj.com/articles/can-elon-musk-buy-twitter-11649949297"
    }
  ]
}