{
  "stories": [
    {
      "by": "setgree",
      "descendants": 0,
      "id": 30263931,
      "score": 1,
      "time": 1644351161,
      "title": "Isaiah Andrews, 2021 John Bates Clark Medalist [pdf]",
      "type": "story",
      "url": "https://pubs.aeaweb.org/doi/pdfplus/10.1257/jep.36.1.177"
    },
    {
      "by": "mfilion",
      "descendants": 0,
      "id": 30263913,
      "score": 1,
      "time": 1644351082,
      "title": "Landing a new syscall, part 1: What is futex?",
      "type": "story",
      "url": "https://www.collabora.com/news-and-blog/blog/2022/02/08/landing-a-new-syscall-part-what-is-futex/"
    },
    {
      "by": "ashton314",
      "descendants": 0,
      "id": 30263897,
      "score": 2,
      "time": 1644351004,
      "title": "Raspberry Pi bootloader enables OS installs with no separate PC required",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/02/raspberry-pi-bootloader-enables-os-installs-with-no-separate-pc-required/"
    },
    {
      "by": "study_genetics",
      "descendants": 0,
      "id": 30263885,
      "score": 1,
      "text": "Hi HN!<p>I have been a long time lurker but got to a point now where I am stuck on how\nto look for an answer and thought that this crowd might have some good\ninsight.<p>There was a question about how to raise funds for rare disease research\n(https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30250496) posted yesterday that\nfelt like the last drop for me to try to pursue learning about genetics.<p>If one wants to learn about how the genetic code works, how proteins work, and\nbe able to investigate their functions what kind of undergrad program does one\nneed to apply to? I still have trouble explaining what exactly I am trying to\ndo, but let me try:<p>For various times in my life I&#x27;ve thought I should study genetics and try to\nlearn about how life works in its essence. For the past few months, I have\nbeen stumbling upon various posts and websites that talk about new discoveries\non understanding of human genome, therapies being developed and so on. Almost\nas if getting a sign that I should dive into learning it as it is something\nthat I feel I am interested in. Knowing how to code definitely seems to be\nsomething that helps, but I don&#x27;t want to work on simply getting genetic data\nI don&#x27;t understand and write software that apply transformations or generate\nvisualizations of this kind of data and make it available for scientists to do\nwhat I deem to be the most interesting part of the work. I want to be able to\nunderstand what the data means and be able to review and reflect about it and\ngive input to advance the understanding in the field.<p>So, if one wants to get in this field to be able to do research on how genes\nrelate to diseases and have a deeper understanding of protein formation and\ninner workings as well as have access to equipment that would allow performing\nthis kind of research, what should one study? Is going back to college and\ntaking an undergrad course the best way? Or is there a way of learning this\nkind of stuff at home (and if so, how does one do that)? I&#x27;d assume that it\nmight not be possible to go too far by studying at home just because without\naccess to equipment it might be very hard to make progress in this area.<p>I don&#x27;t know if it matters, but I am in my mid 30s and my work is completely\nunrelated. I work in security and programming, and have not had any kind of\nexposure to this kind of biology other than what you learn at highschool (and\nthat was about 20 years ago). I am at a point where I feel my interest in the\nfield seems to be diminishing and I might be burnt out. For some years now I\nhave been trying to figure out what would be a different career path I could\ntry, but always ended up at a point where I felt none of them had any meaning\nin the end. When I think about learning about this topic, I get this warm\nfeeling I haven&#x27;t had in a while and don&#x27;t have that dreaded feeling that my\nwork won&#x27;t matter, because I genuinely think it can be important.<p>I wouldn&#x27;t be doing this for the money (I honestly don&#x27;t even know how much\nmoney one makes in this line of work) but for the chance to learn, satisfy my\ncuriosity and with luck help advance our understanding of how living things\nwork. And hopefully being able to do this kind of work would allow me to offer\nto help in situations such as the post mentioned above.<p>Any help or advice on how to proceed on this, or how to become a bit less\nignorant in order to be able to understand what exactly it is I am trying to\nachieve would be very appreciated. Anyone working in the field that could\nshare their experience in it and how they got into it, would also be very\nappreciated.<p>Thanks!<p>PS: Sorry if the line of thought is all over the place there, I was trying to\nconvey what I want to do and the way I am feeling about it while not missing\nany information I think would be important.<p>PPS: The throwaway account is due to me mentioning burn out and not wanting to\nhave such information traced back to me.",
      "time": 1644350989,
      "title": "Ask HN: How to get into genetics/biology being over 30?",
      "type": "story"
    },
    {
      "by": "marinesebastian",
      "descendants": 0,
      "id": 30263882,
      "score": 1,
      "time": 1644350974,
      "title": "My (failed) attempt to unsubscribe from UnderArmour emails",
      "type": "story",
      "url": "https://sebastianmarines.substack.com/p/my-failed-attempt-to-unsubscribe"
    },
    {
      "by": "danso",
      "descendants": 0,
      "id": 30263873,
      "score": 1,
      "time": 1644350945,
      "title": "‘America’s Army’, The Pentagon’s Video Game, Shuts Down After 20 Years",
      "type": "story",
      "url": "https://www.vice.com/en/article/y3v5xk/americas-army-the-pentagons-video-game-shuts-down-after-20-years"
    },
    {
      "by": "andrewfromx",
      "descendants": 0,
      "id": 30263869,
      "score": 1,
      "time": 1644350911,
      "title": "Mathematical artist has created a three dimensional model",
      "type": "story",
      "url": "https://www.shapeways.com/product/65UWG8KL7/24-cell"
    },
    {
      "by": "mrkramer",
      "descendants": 0,
      "id": 30263868,
      "score": 1,
      "time": 1644350911,
      "title": "How to transfer playlists from Spotify to other music streaming services",
      "type": "story",
      "url": "https://www.theverge.com/22916495/playlist-transfer-spotify-youtube-music-amazon-apple-music"
    },
    {
      "by": "drrlvn",
      "descendants": 0,
      "id": 30263854,
      "score": 2,
      "time": 1644350856,
      "title": "Linux 5.18 has new RNG, fixes vulnerabilities and faster by 103-225%",
      "type": "story",
      "url": "https://twitter.com/edgesecurity/status/1491128272276664328"
    },
    {
      "by": "dvt",
      "descendants": 0,
      "id": 30263843,
      "score": 1,
      "time": 1644350776,
      "title": "Risky Tweets Finder",
      "type": "story",
      "url": "https://risky-tweets.mudit.blog/"
    }
  ]
}