{
  "stories": [
    {
      "by": "McGofy",
      "descendants": 0,
      "id": 31142939,
      "score": 1,
      "time": 1650798507,
      "title": "Healing Your Body Through Your Hands: Acupressure Points",
      "type": "story",
      "url": "https://gnosiscorner.jimdofree.com/2019/02/26/healing-your-body-through-your-hands-acupressure-points/"
    },
    {
      "by": "Ashoka_rkt",
      "descendants": 0,
      "id": 31142938,
      "score": 1,
      "time": 1650798500,
      "title": "Internet spring cleaning: How to delete Instagram, Facebook and other accounts",
      "type": "story",
      "url": "https://blog.mozilla.org/en/internet-culture/how-to-delete-instagram-facebook-online-accounts/"
    },
    {
      "by": "tentacleuno",
      "descendants": 0,
      "id": 31142928,
      "score": 1,
      "time": 1650798420,
      "title": "List of Discontinued Microsoft Products Since 1975",
      "type": "story",
      "url": "https://www.versionmuseum.com/history-of/discontinued-microsoft-products"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 31142920,
      "score": 1,
      "time": 1650798352,
      "title": "Becoming Attached (1990)",
      "type": "story",
      "url": "https://www.theatlantic.com/magazine/archive/1990/02/becoming-attached/308966/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31142884,
      "score": 1,
      "time": 1650797929,
      "title": "A man is trolling his airline with PowerPoint to find his missing bag",
      "type": "story",
      "url": "https://www.cnn.com/travel/article/airtag-travel-missing-baggage-aer-lingus/index.html"
    },
    {
      "by": "yosefjaved1",
      "descendants": 0,
      "id": 31142881,
      "score": 1,
      "time": 1650797885,
      "title": "Retrospective on the Secret of Monkey Island",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9F9ahZQ7oP0"
    },
    {
      "by": "rockarage",
      "descendants": 0,
      "id": 31142845,
      "score": 1,
      "text": "A few days ago Dropbox disabled my account.\nAfter several emails inquiring about why my account was disabled I received this response:<p>Dropbox’s Acceptable Use Policy prohibits, among other things, use of the Dropbox Services in conjunction with materials that “constitute child sexually exploitative material (including material which may not be illegal child sexual abuse material but which nonetheless sexually exploits or promotes the sexual exploitation of minors), unlawful pornography, or are otherwise indecent.” Your account was determined to be in violation of these policies. In accordance with our Terms of Service, Dropbox reserves the right to terminate your access to the Services without notice when you are in material breach of our terms, when providing notice would cause Dropbox to incur legal liability or compromise our ability to provide Services to other users, or when we are prohibited from providing such notice by law.<p>When I read this my heart sank. Being accused of having files that &quot;constitute child sexually exploitative material&quot;  is one of the worst things I can think of.\nI wondered, how the hell would I have that in my account? Was it compromised? Does their system have a software error?<p>However, they did mention other things in that response.<p>content deemed &quot;otherwise indecent&quot;<p>we will get to that, but first, I let them know that\ncontent that sexually exploits children goes against everything I stand for and I told them that If have any unlawful pornography or anything &quot;constitutes child sexually exploitative material&quot; on my account let us go to the police and investigate the matter.<p>Now the language about &quot;indecent content&quot; is wild and opens a whole can of worms. What may be indecent to one person may not be indecent to others.\nSomething so arbitrary should not give Dropbox the right to ruin people.<p>Dropbox has shut down access to my all files and messed up my computer setup without due process and seemingly no recourse.<p>As you can imagine, this is a major problem for me because sometime last year I went all-in on Dropbox, because I’ve had very bad luck with hard drives and I’ve been using Dropbox for over a decade with no problem. So I fully integrated my Mac with Dropbox, after my limited Dropbox setup help save me from major disk drive failure. I’ve also been using Dropbox Paper for much of my work files. When Dropbox disabled my account I lost access to everything on Dropbox and Dropbox Paper. Now it is very hard for me to get work done, and they are not responding to my messages in a timely manner. I have years of my work as a musician stored on Dropbox as well. Yes,  I messed up royally for trusting a company with all my work, lesson learned.<p>I plan to sue Dropbox and get an injunction but that will take a lot of time and resources. So I wondering if the community can help me find out what is really happening, and perhaps help get my account restored faster.  I’ve seen the HN community help in situations like this.  I’m running out of time for business-related deadlines.<p>my email is in my profile if you like more information.",
      "time": 1650797406,
      "title": "A Cloud Storage Horror Story",
      "type": "story"
    },
    {
      "by": "Frajedo",
      "descendants": 0,
      "id": 31142826,
      "score": 2,
      "time": 1650797044,
      "title": "Show HN: I built a dashboard of official data ahead of French elections",
      "type": "story",
      "url": "https://lafrance.enchiffres.fr"
    },
    {
      "by": "Vimeomate",
      "descendants": 0,
      "id": 31142825,
      "score": 2,
      "time": 1650797028,
      "title": "A Comprehensive Guide to Save TikTok Videos",
      "type": "story",
      "url": "https://tikfast.net/blog/guide-to-save-tiktok-video"
    },
    {
      "by": "sturza",
      "descendants": 2,
      "id": 31142798,
      "kids": [
        31142907,
        31142813
      ],
      "score": 1,
      "time": 1650796710,
      "title": "Why your house is a terrible investment",
      "type": "story",
      "url": "https://jlcollinsnh.com/2013/05/29/why-your-house-is-a-terrible-investment/"
    }
  ]
}