{
  "stories": [
    {
      "by": "homarp",
      "descendants": 0,
      "id": 30733337,
      "score": 1,
      "time": 1647694181,
      "title": "Gas pumps happen to be about as insecure as your typical router",
      "type": "story",
      "url": "https://www.cnx-software.com/2022/03/19/gas-pumps-insecure-typical-router/"
    },
    {
      "by": "seedie",
      "descendants": 0,
      "id": 30733328,
      "score": 1,
      "time": 1647694068,
      "title": "Beauty and wonder of science boosts researchers’ well-being",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-00762-8"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30733327,
      "score": 1,
      "time": 1647694055,
      "title": "Private Jets Leave Russia for Dubai as Putin Threatens to Purge Russian Traitors",
      "type": "story",
      "url": "https://www.businessinsider.com/private-jets-go-russia-dubai-after-putin-pledges-self-cleansing-2022-3"
    },
    {
      "by": "MyStartupNotes",
      "descendants": 0,
      "id": 30733319,
      "score": 1,
      "text": "TLDR: Do you think it is useful if there is a tool that can simplify the concepts of SEO for everyone and also make it affordable?<p>After about 10 years of working in the field of SEO, I can see an opportunity of having a new SEO tool for people who can&#x27;t afford\n1) an expensive SEO software like SEMRush, Ahrefs, MOZ etc. (with the cheapest subscription plan at about $90&#x2F;m) or\n2) to have an SEO expert (very expensive solution for lots of SMBs or early stage startups)<p>I know that there are some WordPress plugins like YOAST or All in One SEO but they are mostly useful for on-site SEO. But this not sufficient. People also need proper Site Audit, Backlink analysis&#x2F;gap, position tracking, keyword research and so on and so forth.<p>And not only that, many people still don&#x27;t know how to use GMB, Google Search Console or Analytics, or even don&#x27;t know what SEO mean at all :D<p>I&#x27;m thinking of creating a tool that guide users step-by-step how to improve their site&#x27;s ranking (like a virtual assistant) and offer them on-demand modules based on their needs.<p>I would love to know your feeling about this startup idea, thanks.",
      "time": 1647693960,
      "title": "Startup idea: Improving SEO ranking without an expert?",
      "type": "story"
    },
    {
      "by": "chockchocschoir",
      "descendants": 1,
      "id": 30733314,
      "kids": [
        30733336
      ],
      "score": 1,
      "text": "Seems I&#x27;m not alone in believing that software is fun, and should be fun as well (while not getting in the way of getting work done) [from https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30725843].<p>One example is the `Defaults insults` setting in `sudo` that will add a insult every time you get your password wrong. This has made me smile a couple of times when the insult is really good.<p>Is there other examples of software that insults you when you get something wrong&#x2F;do something incorrect?<p>This list can serve a double-purpose: first as a recommendation list for us who like to get insulted for fun, and second as a list of software to avoid for the ones that don&#x27;t like it.",
      "time": 1647693901,
      "title": "Ask HN: Software That Insults You?",
      "type": "story"
    },
    {
      "by": "gotmedium",
      "descendants": 0,
      "id": 30733311,
      "score": 1,
      "time": 1647693846,
      "title": "The Standardization of Time (1982)",
      "type": "story",
      "url": "https://www.journals.uchicago.edu/doi/abs/10.1086/227631"
    },
    {
      "by": "pradeepb28",
      "descendants": 0,
      "id": 30733308,
      "score": 1,
      "text": "My Macbook is a complete mess, and I’m often in strange situations when somone approaches my desk or during a meeting, because my desktop is unorganized with icons , there are constantly several windows open, and I was frequently chatting in the conference while on mute.<p>I needed a solution where I could tidy up the desktop icons by concealing them, or hide all windows except the one I was presently working on, or turn on or off the microphone with a single click without having to seek for it.<p>I&#x27;ve been searching through different tools to see if there&#x27;s anything that could fix this problem. While I&#x27;ve found a few, many of them are pricey, so I figured why not build one myself.<p>Here is where Zen mode comes in, with a single click you can hide desktop icons, hide inactive windows, mute mic or speakers.<p>You can watch a quick intro to the tool here: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;wT2PdPg-RZo\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;wT2PdPg-RZo</a><p>You can download the mac app here: <a href=\"https:&#x2F;&#x2F;zen-mode.carrd.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;zen-mode.carrd.co&#x2F;</a><p>Any feedback is highly appreciated. Thank you!",
      "time": 1647693818,
      "title": "Show HN: Zen Mode – Hide Everything. Mute Everything",
      "type": "story",
      "url": "https://zen-mode.carrd.co"
    },
    {
      "by": "SQL2219",
      "descendants": 0,
      "id": 30733301,
      "score": 1,
      "time": 1647693725,
      "title": "CDC removes 30K Covid deaths – reduces pediatric deaths by 24%",
      "type": "story",
      "url": "https://twitter.com/NBSaphierMD/status/1504419658136440833"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30733281,
      "score": 1,
      "time": 1647693477,
      "title": "How to take advantage of rising interest rates",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/17/success/rising-interest-rates-investments-and-savings/index.html"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30733278,
      "score": 1,
      "time": 1647693452,
      "title": "A Big Bet to Kill the Password for Good",
      "type": "story",
      "url": "https://www.wired.com/story/fido-alliance-ios-android-password-replacement/"
    }
  ]
}