{
  "stories": [
    {
      "by": "mmmmkay",
      "descendants": 0,
      "id": 31962171,
      "score": 1,
      "time": 1656794473,
      "title": "Pen and paper exercises in machine learning",
      "type": "story",
      "url": "https://github.com/michaelgutmann/ml-pen-and-paper-exercises"
    },
    {
      "by": "uberdru",
      "descendants": 0,
      "id": 31962129,
      "score": 1,
      "time": 1656794208,
      "title": "We dropped event sourcing with Kafka Streams when given a second chance",
      "type": "story",
      "url": "https://medium.com/dna-technology/why-we-dropped-event-sourcing-with-kafka-streams-when-given-a-second-chance-b904a80bc4be"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31962050,
      "score": 1,
      "time": 1656793695,
      "title": "List of fugitives from justice who disappeared",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/List_of_fugitives_from_justice_who_disappeared"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31962032,
      "score": 2,
      "time": 1656793552,
      "title": "Dinosaurs took over amid ice, not warmth",
      "type": "story",
      "url": "https://lamont.columbia.edu/news/dinosaurs-took-over-amid-ice-not-warmth-says-new-study-ancient-mass-extinction"
    },
    {
      "by": "getflookup",
      "descendants": 0,
      "id": 31962025,
      "score": 1,
      "text": "I&#x27;m curious about how well your data management solution fits your workflow.<p>On 3 occasions, my former employer &quot;wasted&quot; hundreds of thousands of dollars procuring data management software but we ended up only using about 10% of the features in each instance. It took them a while to even start thinking of getting a custom-built solution.<p>Do you find that you are facing the same degree of inefficiency with your current data management work?<p>In other words, does you current data management software stack have way more features than you will ever need? How do you deal with that situation?",
      "time": 1656793535,
      "title": "Ask HN: Is your current data management solution working well for you?",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 2,
      "id": 31962014,
      "kids": [
        31962115,
        31962127
      ],
      "score": 27,
      "time": 1656793426,
      "title": "AWS Nuke – delete all resources associated with AWS account",
      "type": "story",
      "url": "https://github.com/rebuy-de/aws-nuke"
    },
    {
      "by": "actfrench",
      "descendants": 52,
      "id": 31961992,
      "kids": [
        31962188,
        31962202,
        31962168,
        31962112,
        31962166,
        31962140,
        31962155,
        31962064,
        31962162,
        31962146,
        31962126,
        31962087,
        31962136,
        31962152,
        31962184,
        31962178,
        31962077,
        31962106,
        31962092,
        31962089,
        31962088,
        31962158,
        31962122,
        31962120,
        31962133,
        31962179,
        31962181,
        31962113,
        31962111,
        31962053
      ],
      "score": 29,
      "text": "Since I was a little girl, I’ve dreamed of falling in love and having a family of my own.<p>By most cultural standards, according to my male friends, I’m smart, beautiful, fit, kind, emotionally mature and doing meaningful work in the world. Not too needy and not a workaholic.<p>Over the last two years  I’ve been on over 120 dates with men I’ve met online  - a few I met in person - in 3 different cities .<p>I’ve deeply invested myself in therapy, support groups, meditation, dating coaching, yoga and hypnotism.\nI’ve tried bumble, tinder , Eharmony, hinge, coffee meets bagel, Thursday, Match, speed dating as well as a few other random apps.<p>I’ve asked my friends to set me up .\nI tried to crowdsource a husband on Facebook.<p>I’ve read and done the exercises in Calling In the One, Love Addiction, Datonomics, Make Your Move and If the Buddha dated. I’ve listened to every episode of Girls Gotta Eat.<p>I’ve gone to CrossFit and hung out at steakhouses. I’ve dated every profession you can think of from doctors to electricians and unemployed guys.<p>I even moved to Austin because I read that’s where there was the highest ratio of educated men to women, thereby improving my odds of meeting a marriageable man.<p>My time for having children is running out.<p>This has always been my dream and I’m willing to try almost anything. I was raised by a single mom and I really want to have kids with a man I love, not do it on my own.<p>So, are there any love hacks I could try?<p>Please encouragement only, no discouragement. I’m discouraged enough already.",
      "time": 1656793152,
      "title": "Ask HN: I’m 41 and still unmarried. What should I do?",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31961976,
      "score": 1,
      "time": 1656793026,
      "title": "End-of-History Illusion",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/End-of-history_illusion"
    },
    {
      "by": "Borkdude",
      "descendants": 0,
      "id": 31961951,
      "score": 1,
      "time": 1656792833,
      "title": "Bebo: Run Clojure Scripts on Deno",
      "type": "story",
      "url": "https://github.com/borkdude/bebo"
    },
    {
      "by": "V-2",
      "descendants": 0,
      "id": 31961938,
      "score": 2,
      "text": "Do you have any recommendation of a mobile app for shared home budgeting?<p>My criteria:<p>* Runs on Android<p>* Shares budget &#x2F; synchronizes data between two users (my wife and I)<p>* Allows to break expenses by categories<p>* Simple to use, not too opinionated (I don&#x27;t need a dashboard like a Boeing 747 since I&#x27;m not trying to run a Wall Street hedge fund; I don&#x27;t want to be forced to assign an &quot;envelope budget&quot; upfront for every single category, I don&#x27;t need nor want integration with my bank accounts, etc.)<p>You&#x27;d think these requirements don&#x27;t set the bar particularly high, and yet it seems surprisingly hard to find an app in the Play Store that ticks all the boxes.<p>We&#x27;ve been using Monshare, which is far from perfect (buggy, doesn&#x27;t work offline even in the most rudimentary sense), but it would mostly do the trick at least. Unfortunately, the creators have abandoned it without any warning: the API is dead, data is inaccessible, user support is off.<p>I&#x27;ve briefly tested several alternatives so far, but unfortunately all of them suck in one way or another (Spendee, iSaveMoney, Money manager, Money Manager (sic), Money Lover, Wallet, Jointo, YNAB, Yona, Bluecoins, Walnut, Finances).<p>Is there some quality app that I&#x27;m missing? I believe there might be - it similarly took me a while to find a perfect TODO app that didn&#x27;t look like a Java desktop app from 1990s and was actually pleasant (Memorigi), maybe I&#x27;ll see some luck with this one. As an Android dev myself, I feel tempted to write one, but as a newly dad, I don&#x27;t really have much free time these days.",
      "time": 1656792726,
      "title": "Ask HN: Mobile app for shared home budgeting?",
      "type": "story"
    }
  ]
}