{
  "stories": [
    {
      "by": "rodoni",
      "descendants": 0,
      "id": 30683881,
      "score": 1,
      "text": "Hi<p>Two weeks ago we launched our swiss MS 365 alternative which was in development for about one year. We now focus on advertisement and are currently wondering how to approach companies.<p>Maybe somebody of the community has a great idea how to do it. Also do you think a there is a big market for our product? We are currently not sure if we maybe have used too much time for development and not enough for testing the market &#x2F; market analysis.<p>The cloud based tool has a quite simple GUI and is capable of\n- File storage &amp; editing\n- Team communication (connected to the storage)\n- E-Mail (connected to the storage)\n- Project Management (Trello like)\n- Time Tracking\n- Password management<p>At the moment there is no App (but if we see that the product has success we will build a Progressive Web App (PWA).<p>Thanks for your feedback. I wish everyone a nice week!",
      "time": 1647342159,
      "title": "Ask HN: How to promote a Swiss MS 365 alternative?",
      "type": "story"
    },
    {
      "by": "solanav",
      "descendants": 0,
      "id": 30683879,
      "score": 1,
      "time": 1647342146,
      "title": "Arti 0.1.0: Tor re-written in Rust now has a stable API",
      "type": "story",
      "url": "https://blog.torproject.org/arti_010_released/"
    },
    {
      "by": "MarkusWandel",
      "descendants": 0,
      "id": 30683794,
      "score": 2,
      "text": "I am stumped.  I&#x27;ve run a Linux firewall for years using an &quot;iptables&quot; based configuration.  Never a problem.  The current gateway machine is running on CENTOS 6 installed 10 years ago, so it&#x27;s time for an upgrade.<p>I installed Redhat Enterprise 8.5 (using a free personal developer licence) which comes with kernel 4.18.  Decided to modernize and use an nft based firewall script.<p>At first glance it works.  But a subset of the internet is inaccessible.  Specifically, any attempt to access http:&#x2F;&#x2F;news.yahoo.com fails from any machine other than the gateway machine itself.  Paring the script down to the bare minimum, which I paste here:<p>table ip nat {\n chain postrouting {\n  type nat hook postrouting priority filter; policy accept;\n  oifname &quot;ppp0&quot; masquerade\n }\n}<p>everything works except news.yahoo.com (and it appears other things on the same CDN or whatever).<p>I figured I&#x27;d wait until RHEL9 and its newer kernel, but I did a test using another machine running FC39 (same kernel version) and the problem is the same.<p>These setups can still load my old iptables based firewall config.  That also works but also has the problem above.  It does not on the old CENTOS 6 machine.  I&#x27;m stumped.  Where can I even begin to go for help with this?",
      "time": 1647341347,
      "title": "Ask HN: Why can't I access HTTP://news.yahoo.com through this firewall script?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30683781,
      "score": 1,
      "time": 1647341235,
      "title": "Complexity on a simian's face reveals a great deal about its society. (2013)",
      "type": "story",
      "url": "https://www.discovermagazine.com/the-sciences/how-evolution-made-the-monkey-face"
    },
    {
      "by": "Distozion",
      "descendants": 2,
      "id": 30683777,
      "kids": [
        30683807
      ],
      "score": 1,
      "text": "Almost every week I see new software books being published, sometimes on extremely niche topics. A good number of them get outdated within the year it was published.<p>At the same time, every workplace I worked at had some books, but mostly it was books-as-decor or ones that the management liked the title of (The Lean Startup, agile&#x2F;scrum ones, etc). And no one ever read them.<p>When it comes to the software engineers I know of, a few mention they do read books, but AFAIK, it&#x27;s mostly hobby reading and almost never work related (I think the closest I got was the 4h workweek or The Lean Startup).<p>So who is the target audience reading all these books?\nIs there actual demand and I just happened to miss all those hidden readers who churn through swats of these technical writings on their free time?\nAre they all published just for the sake that the person in question becomes a &quot;published author&quot;?",
      "time": 1647341188,
      "title": "Ask HN: Who reads all of the constantly published software book?",
      "type": "story"
    },
    {
      "by": "minroot",
      "descendants": 2,
      "id": 30683770,
      "kids": [
        30683875,
        30683882
      ],
      "score": 1,
      "time": 1647341157,
      "title": "Gofmt is keeping whitespaces, Go team is denying a fix",
      "type": "story",
      "url": "https://github.com/golang/go/issues/51663"
    },
    {
      "by": "shrewdcomputer",
      "descendants": 1,
      "id": 30683742,
      "kids": [
        30683769
      ],
      "score": 2,
      "time": 1647340928,
      "title": "Better Sentiment Analysis with Sentiment.ai",
      "type": "story",
      "url": "https://www.r-bloggers.com/2022/03/better-sentiment-analysis-with-sentiment-ai/"
    },
    {
      "by": "nikolalsvk",
      "descendants": 0,
      "id": 30683728,
      "score": 1,
      "time": 1647340784,
      "title": "DevOps JavaScript – Intro to Writing Scripts with Zx",
      "type": "story",
      "url": "https://pragmaticpineapple.com/devops-javascript-intro-to-writing-scripts-with-zx/"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30683722,
      "score": 2,
      "time": 1647340764,
      "title": "Rescue: Type-safe exception support for Python",
      "type": "story",
      "url": "https://github.com/idmitrievsky/rescue"
    },
    {
      "by": "jack335",
      "descendants": 1,
      "id": 30683710,
      "kids": [
        30683733
      ],
      "score": 2,
      "time": 1647340651,
      "title": "Podcasts for Bootstrappers and Indie Hackers",
      "type": "story",
      "url": "https://transistor.fm/podcasts-for-bootstrappers/"
    }
  ]
}