{
  "stories": [
    {
      "by": "boxysean",
      "descendants": 0,
      "id": 28301058,
      "score": 1,
      "text": "I&#x27;ve come across a number of people recently who insist on storing their secrets (e.g., passwords, private keys, credentials) in a secrets manager such as HashiCorp Vault or AWS Secrets Manager. Intuitively, I believe this a good idea, but I would like to understand it better. Is this a new phenomenon, or something that’s been desirable in software since the advent of the industry? Where is this narrative coming from?<p>Is this idea driven by security? Has it been proven to be a safer paradigm than storing keys in a variety of systems?<p>Is the idea driven by management? Do folks charged with managing keys prefer to keep all of their keys under one roof so it&#x27;s easier to keep tabs on, thereby reducing risk?<p>Is this idea driven by policy? Does GDPR or other mandatory or optional regulatory frameworks imply a customer should control their secrets centrally?<p>Is the idea driven by sales? Does Azure, GCP, AWS, and HashiCorp all have products that they earn additional $$$ with (pay-per-access and update), and are pushing their customers to use then?<p>I&#x27;m curious to hear what others think or know. Thanks!",
      "time": 1629896338,
      "title": "Ask HN: Why use secrets managers?",
      "type": "story"
    },
    {
      "by": "oliacodes",
      "descendants": 0,
      "id": 28301056,
      "score": 1,
      "time": 1629896331,
      "title": "The code behind the magic: the tag",
      "type": "story",
      "url": "https://api.video/blog/video-trends/the-code-behind-the-magic-the-video-tag"
    },
    {
      "by": "lucasbotzen",
      "descendants": 0,
      "id": 28301046,
      "score": 1,
      "text": "About the problem and startup<p>Most business founders do not know their real-time financial status of their companies. Usually, companies receive a status update every month or every quarter, after their accountant has updated all of the books.<p>Similarly, accounting software are a black box for CEOs and CFOs. More than often, accountancy jargon is used and the data cannot be leveraged financial projections and visibility.<p>Rivermate wants to change that by building an all-in-one financial management platform<p>We do this by connecting your account with third-party services that already hold valuable information, such as Stripe, Shopify, TransferWise, creditcards, Zoho, etc. This way, information is always up to date, and not just when you manually export data from all your services. Along with that, we will build an interface which business founders can leverage, such as payment prediction, categorising costs and using graphs, many graphs.<p>Also your accountant has access to the software, so you can cut out the back and forth emailing and have one single source of truth.<p>We will first focus on e-commerce entrepreneurs in The Netherlands, Europe. I have an extensive network of e-commerce entrepreneurs (14k contacts) that I have generated from my time at my previous company (a SaaS company for ecom entrepreneurs, which I sold to my co-founder).<p>Once I find the right co-founder, I will reach out to investors to get funding. I know many big VC&#x27;s in Europe and can call them when we are ready to get funded.<p>This business has a shot at becoming a HUGE company. The market is hot (look at Ramp, Brex, Pilot, that focus on the US market) and we can capitalize the European market.<p>What I&#x27;m looking for?<p>There is one thing holding me back from making this a successful company: I have yet to find the right co-founder. I&#x27;m not only looking for a technical co-founder, but also someone who wants to dedicate all of his time on building this company and who is willing to put skin in the game for at least the coming 5 years.<p>If I manage to find a co-founder before September 8, we can apply for YC&#x27;s W22 batch!<p>Criteria<p>Experience in working in a startup<p>40+ hours available per week<p>Ready to put skin in the game<p>No payment, only equity until we get to the market<p>About me<p>Successfully co-founded a startup, grew it to €3M+ yearly revenue and sold the company<p>From The Netherlands<p>Age: 25<p>Language: Dutch and English<p>My skills<p>Business innovation and management (two studies on Business Innovation and Management)<p>Huge network of potential customers<p>Huge network of angel investors and VC firms.<p>Technical and marketing experience<p>Experience in early-stage startups and product management<p>Incredibly hard worker<p>If you are interested send me a PM with your LinkedIn and we&#x27;ll schedule a Zoom meeting",
      "time": 1629896252,
      "title": "Join me as a technical co-founder in a fintech startup to change the world",
      "type": "story"
    },
    {
      "by": "decrypt",
      "descendants": 0,
      "id": 28301031,
      "score": 1,
      "time": 1629896175,
      "title": "iCloud Custom Domain now available",
      "type": "story",
      "url": "https://old.reddit.com/r/iOSBeta/comments/pb2ncl/icloud_custom_domain_appears_to_be_live_at/"
    },
    {
      "by": "codetrotter",
      "descendants": 0,
      "id": 28301023,
      "score": 1,
      "time": 1629896128,
      "title": "Color Oracle: open source color blindness simulator for Mac, Linux and Windows",
      "type": "story",
      "url": "https://colororacle.org/index.html"
    },
    {
      "by": "osener",
      "descendants": 0,
      "id": 28301016,
      "score": 1,
      "time": 1629896090,
      "title": "In JavaScript “export default foo” is different to “export { foo as default }”",
      "type": "story",
      "url": "https://jakearchibald.com/2021/export-default-thing-vs-thing-as-default/"
    },
    {
      "by": "mikesabbagh",
      "descendants": 0,
      "id": 28301010,
      "score": 1,
      "time": 1629896056,
      "title": "PayPal to add $20 inactivity fee in Canada",
      "type": "story",
      "url": "https://mobilesyrup.com/2021/08/24/paypal-20-dollar-inactivity-fee-canada/"
    },
    {
      "by": "philangist",
      "descendants": 0,
      "id": 28300993,
      "score": 2,
      "time": 1629895946,
      "title": "Gaslighting, a Covid Love Story",
      "type": "story",
      "url": "https://alexberenson.substack.com/p/gaslighting-a-covid-love-story"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 28300992,
      "score": 1,
      "time": 1629895941,
      "title": "OnlyFans Reverses Its Decision",
      "type": "story",
      "url": "https://twitter.com/onlyfans/status/1430499277302816773"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 28300973,
      "score": 1,
      "time": 1629895843,
      "title": "Making Sense of Satellite Data, Open Source Workflow",
      "type": "story",
      "url": "https://nightingaledvs.com/making-sense-of-satellite-data-an-open-source-workflow-accessing-data/"
    }
  ]
}