{
  "stories": [
    {
      "by": "sanmak",
      "descendants": 0,
      "id": 28200913,
      "score": 1,
      "time": 1629136767,
      "title": "Want to Remember Everything You'll Ever Learn? Surrender to This Algorithm",
      "type": "story",
      "url": "https://www.wired.com/2008/04/ff-wozniak/"
    },
    {
      "by": "riffic",
      "descendants": 0,
      "id": 28200912,
      "score": 1,
      "time": 1629136763,
      "title": "Twitter CEO Jack Dorsey's Bluesky Project Hires Jay Graber",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-16/twitter-ceo-jack-dorsey-s-bluesky-project-hires-jay-graber"
    },
    {
      "by": "billyharris",
      "descendants": 0,
      "id": 28200904,
      "score": 1,
      "time": 1629136715,
      "title": "Would you let a robot lawyer defend you?",
      "type": "story",
      "url": "https://www.bbc.com/news/business-58158820"
    },
    {
      "by": "riffic",
      "descendants": 0,
      "id": 28200900,
      "score": 1,
      "time": 1629136695,
      "title": "Facebook Domination vs. Self-Determination",
      "type": "story",
      "url": "https://boingboing.net/2018/07/18/platform-independence.html"
    },
    {
      "by": "FedeNzzZ",
      "descendants": 0,
      "id": 28200879,
      "score": 1,
      "time": 1629136549,
      "title": "Step by step guide to becoming a modern back end developer",
      "type": "story",
      "url": "https://roadmap.sh/backend"
    },
    {
      "by": "poletopole",
      "descendants": 0,
      "id": 28200849,
      "score": 1,
      "text": "I&#x27;ve learned that investing in a good work chair is worth it after all, but is no surprise. Using anything less just exhausts the mind and body and limits how much work you can get done. Picking the right desk is also a factor, so feel free to comment on what your work desk is as well.<p>I&#x27;m curious what everyone&#x27;s work chair&#x2F;desk is that agrees with me on is? Personally I&#x27;m shopping around, but perhaps comments should have:<p>1. Price.<p>2. Model&#x2F;Make.<p>3. Features.<p>4. Brief conclusion summarizing value.<p>Thanks in advance for any commentary, picking the right chair is surprising hard!",
      "time": 1629136379,
      "title": "Ask HN: What is your work chair/desk?",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28200752,
      "score": 1,
      "time": 1629135851,
      "title": "DuckDuckGo’s simple plan to make the internet more private",
      "type": "story",
      "url": "https://www.protocol.com/duckduckgo-ceo-interview"
    },
    {
      "by": "thebrowncat",
      "descendants": 1,
      "id": 28200727,
      "kids": [
        28200910
      ],
      "score": 6,
      "text": "I&#x27;m 34. I work in quant finance in London, UK (in ML&#x2F;statistics). I graduated with a PhD in CS and sort of fell into this field when a recruiter contacted me with the promise of $$$ that is hard to get in any other field unless you&#x27;re at Google. I&#x27;m on a pretty decent salary even by London standards, but I&#x27;m utterly miserable.<p>1. The job is meaningless. When I first started in the field I thought I enjoyed it, but now I see that the bonuses were what excited me about the job, not the actual work.<p>2. Although the money is good, an &#x27;adequate&#x27; house in London would cost at least 10 times my salary. I&#x27;m renting a flat with my partner. It&#x27;s a reasonably decent flat by London standards, but because we&#x27;re renting we can never really make it a home.<p>3. London is a horrible place to live. I have no affinity for it whatsoever. Even if I could afford a house I would not want to live here.<p>4. My home town is an hour flight away but if I were to move home I would most likely take at least a 2&#x2F;3 pay cut. I would prefer to live back home. But doing that would ruin any chances I ever had of being able to retire early.<p>5. My parents, like most boomers, had a much better standard of living when they were my age. My father had a pretty average salary, bought a massive house for a reasonable price, and saw his wealth multiply many times over. It&#x27;s not like that for my generation.<p>My partner is in a similar job to me and he is making multiples of what I&#x27;m making (although it&#x27;s more stressful than mine). Luckily for him, he hates his job less than I do, so he could probably stick it out a few years longer.<p>I have just come back from 2 weeks holidays at home with my parents and was pretty much in tears this morning starting another day at work. It&#x27;s so hard to muster up any motivation for the job, especially now that the company is in a dry period pnl-wise. I much prefer my home town to London, but I can&#x27;t expect my partner to move back with me, as he is doing extremely well in his career and it would be career suicide for him.<p>I have racked my brain trying to figure out what field I would prefer to work in, but I can&#x27;t think of anything. I just go round in circles thinking about it. Given that anything else would involve a massive pay cut, I think I would regret leaving the job I&#x27;m in. I could probably grind leetcode for a couple of months to try to get into Google, but I would find working at Google utterly meaningless as well. I have the ability to work hard to pass an interview, but I&#x27;ve been working for long enough now that I find it difficult to muster up any enthusiasm during job interviews, which is probably a red flag for potential employers. I&#x27;m no longer young and excited about this stuff!<p>I&#x27;m interested in computers and programming in general, but doing it for a living ruins the joy. I would love to be able to retire and get into meditation &#x2F; travelling the world &#x2F; learning about things for fun.",
      "time": 1629135696,
      "title": "Ask HN: I feel trapped in my job and city",
      "type": "story"
    },
    {
      "by": "david_shaw",
      "descendants": 0,
      "id": 28200691,
      "score": 8,
      "time": 1629135468,
      "title": "Terror Watchlist Exposed via Misconfigured Elasticsearch Cluster",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/secret-terrorist-watchlist-with-2-million-records-exposed-online/"
    },
    {
      "by": "readonthegoapp",
      "descendants": 1,
      "id": 28200683,
      "kids": [
        28200702
      ],
      "score": 1,
      "time": 1629135425,
      "title": "Ask HN: Did you get the 'Did you mean...' Chrome 'warning'?",
      "type": "story"
    }
  ]
}