{
  "stories": [
    {
      "by": "raiyu",
      "descendants": 0,
      "id": 29641767,
      "score": 1,
      "time": 1640118800,
      "title": "We Got Hacked Today",
      "type": "story",
      "url": "https://fractal.medium.com/dear-fractal-community-70173e8a5ea7"
    },
    {
      "by": "Nitrobemsin",
      "descendants": 0,
      "id": 29641766,
      "score": 1,
      "time": 1640118790,
      "title": "Mytrip Nigeria Launches Online Bus Booking in Nigeria",
      "type": "story",
      "url": "https://mytrip.ng"
    },
    {
      "by": "justinzollars",
      "descendants": 0,
      "id": 29641750,
      "score": 1,
      "time": 1640118726,
      "title": "To Track Covid-19 Surges, Scientists Are Studying Sewage",
      "type": "story",
      "url": "https://www.wsj.com/articles/to-track-covid-19-surges-scientists-are-studying-sewage-11640082603"
    },
    {
      "by": "andrewstuart",
      "descendants": 0,
      "id": 29641746,
      "score": 2,
      "text": "I got the mail below saying my AWS Route53 registered Australia domains will be transferred.<p>What trickery is this?  If it was valid then surely Amazon would be telling me?<p>Anyone know what this is about?<p>HEXONET &lt;no-reply@hexonet.net&gt;<p>Tue, Dec 21, 4:43 AM (1 day ago)<p>to me<p>Dear Domain Registrant,<p>You are receiving this email as you are the registrant contact for the following domain name(s):<p>(list of domain names)<p>We (HEXONET) are the supplier providing domain management services for the .AU domain extension to the domain name provider currently managing your domain name(s) on your behalf:<p>Gandi SAS https:&#x2F;&#x2F;help.gandi.net www.gandi.net<p>As part of a system upgrade at HEXONET, we are required to notify you that we intend to change the official registrar of record for your domain name(s). Your domain(s) will transfer from the current registrar, Tucows Pty Ltd trading as OpenSRS, to Domain Directors Pty Ltd as part of this upgrade. This transfer will be processed on 25 January 2022.<p>Importantly:<p><pre><code>    There will be no impact to your domain name or website or email service\n    There will be no changes to the way you manage your domain(s)\n    No action is required on your behalf unless you would like to opt-out of the transfer\n</code></pre>\nIn accordance with the .AU Domain Name Suppliers&#x27; Code of Practice (http:&#x2F;&#x2F;www.auda.org.au&#x2F;policies&#x2F;auda-2004-04) and auDA&#x27;s transfer policy\n(http:&#x2F;&#x2F;www.auda.org.au&#x2F;policies&#x2F;auda-2013-02), you have the option to opt-out of this change. If you would prefer not to have your domain name(s) transferred to Domain Directors Pty Ltd, you must take action to transfer your domain(s) to another registrar prior to 25 January 2022 to ensure that your instructions are executed properly. Please contact your domain name provider for further details.<p>As per auDA’s requirements, we will send a reminder email seven (7) days prior to the transfer. Again, no further action is required on your part for continued and uninterrupted domain management of the above listed domain(s).<p>If you have any questions, please contact your domain name provider.<p>Kind Regards, HEXONET<p>HEXONET<p>p: +49 6894 9396 250<p>f: +49 6841 6984 199<p>e:help@hexonet.support<p>w:hexonet.net<p>HEXONET is a Key-Systems GmbH brand. Key-Systems GmbH is registered at the local court of Saarbruecken, Germany with the registration no. HRB 18835. CEO: Oliver Fries, Robert Birkner. Registered Office: Im Oberen Werk 1, 66386 St. Ingbert, Germany. Key-Systems is part of the CentralNic Group PLC (LON: CNIC), a company registered in England and Wales with the company number 8576358.<p>This email and any files transmitted are confidential and intended only for the person(s) directly addressed. If you are not the intended recipient, any use, copying, transmission, distribution, or other forms of dissemination is strictly prohibited. If you have received this email in error, please notify the sender immediately and permanently delete this email with any files that may be attached.",
      "time": 1640118702,
      "title": "Ask HN: Email saying my Amazon Route53 domains will be transferred?",
      "type": "story"
    },
    {
      "by": "samspenc",
      "descendants": 0,
      "id": 29641738,
      "score": 1,
      "time": 1640118646,
      "title": "The Universe Can Bend the Laws of Physics All by Itself",
      "type": "story",
      "url": "https://www.popularmechanics.com/science/a38539247/universe-evolves-laws-of-physics-by-itself/"
    },
    {
      "by": "jrs235",
      "descendants": 0,
      "id": 29641736,
      "score": 1,
      "text": "It seems like more and more I notice people driving while looking at their cell phones. Even at stop lights when people just &quot;quickly check&quot; their phones it distracts them from noticing the lights change and then only a few cars getting through on green and several more running the red. What&#x27;s the &quot;best answer&quot; to this dilemma in your opinion? Is it steeper fines if caught? More enforcement? Regulation disabling devices if&#x2F;when certain conditions are detected? It&#x27;s getting to where someone leaving the bar after a few drinks but focusing on driving is better at driving then a completely sober person looking at their phone.",
      "time": 1640118638,
      "title": "Ask HN: What is “the answer” to distracted driving due to cell phones?",
      "type": "story"
    },
    {
      "by": "samspenc",
      "descendants": 0,
      "id": 29641728,
      "score": 1,
      "time": 1640118615,
      "title": "Scientists Say the Laws of Physics May Be Changing",
      "type": "story",
      "url": "https://futurism.com/laws-physics-changing"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 29641726,
      "score": 2,
      "time": 1640118612,
      "title": "DuckDuckGo Working on Privacy-Focused Desktop Browser for Mac",
      "type": "story",
      "url": "https://www.macrumors.com/2021/12/21/duckduckgo-mac-browser/"
    },
    {
      "by": "loker",
      "descendants": 0,
      "id": 29641718,
      "score": 1,
      "text": "So I built an online job portal. It&#x27;s free for up to 6 months for the first 10000 members. \nGo visit https:&#x2F;&#x2F;www.lokerhq.com for more details.",
      "time": 1640118562,
      "title": "Indonesia's Newest Online Job Portal",
      "type": "story"
    },
    {
      "by": "rossmohax",
      "descendants": 0,
      "id": 29641716,
      "score": 3,
      "time": 1640118555,
      "title": "FoundationDB website is down for a week now",
      "type": "story",
      "url": "https://github.com/apple/foundationdb/issues/6154"
    }
  ]
}