{
  "stories": [
    {
      "by": "sam-2727",
      "descendants": 0,
      "id": 27844829,
      "score": 1,
      "time": 1626357809,
      "title": "Using Benford's Law to Detect Bitcoin Manipulation",
      "type": "story",
      "url": "https://mindmatters.ai/2021/07/using-benfords-law-to-detect-bitcoin-manipulation/"
    },
    {
      "by": "simonswords82",
      "descendants": 0,
      "id": 27844824,
      "score": 1,
      "text": "We are a work from anywhere company and I&#x27;m trying to find a sustainable computer equipment setup for our 20+ .NET developers.<p>It needs to be flexible (local admin rights, ability to compile locally) but secure to map to our ISO 27001 and other security policies.<p>Our developers run Visual Studio IDE, currently they code&#x2F;compile locally, they will all have a local SQL etc.<p>The ideal would be to have a cloud based server using RFP&#x2F;Azure AD but they&#x27;re against RDP.<p>So what other options are out there that will allow us to provide standard kit to our team that we can manage access&#x2F;sign on to in the cloud and facilitates a development environment on their local machines (or RDP if latency definitely won&#x27;t be an issue?)<p>Thanks all",
      "time": 1626357791,
      "title": "Ask HN: Setups for Remote Developers",
      "type": "story"
    },
    {
      "by": "bodqhrohro",
      "descendants": 0,
      "id": 27844816,
      "score": 1,
      "time": 1626357732,
      "title": "X.org-to-Wayland migration chart for app developers",
      "type": "story",
      "url": "https://wayland-bites.github.io"
    },
    {
      "by": "throwaway_wwEG",
      "descendants": 0,
      "id": 27844809,
      "score": 1,
      "text": "Hello everyone.<p>For most of my life, my interests have shifted relatively quickly: I spent a month or two learning thing #1 before then discovering thing #2, putting the first on hold and so on until maybe I discovered some interesting insight that got me back into #1. Learning anything else other than the current interest is a slog, but so far that worked in my favor as being a jack of all trades, master of none was beneficial as an undergraduate.<p>Working on my final project is making me realize the shortcomings of such approach: I keep procrastinating and sometimes missing deadlines because I get interested in orthogonal topics; I need depth of knowledge rather than breadth; learning as an end in itself makes me uninterested in practical applicability. Despite that, I don&#x27;t see myself as dysfunctional, but rather just far less productive than I know can be.<p>I am interested into pursing an academia path, but I can&#x27;t see myself as I am going through a master&#x27;s, let alone a PhD. The outlook of going to the industry doesn&#x27;t seem much better either.<p>So, cutting the chase short: how can I work on improving this situation? Any advice would be greatly appreciated.",
      "time": 1626357699,
      "title": "Ask HN: How to maintain interest in things for longer?",
      "type": "story"
    },
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 27844784,
      "score": 1,
      "time": 1626357558,
      "title": "Firefox 89 delivered more speed–today’s Firefox 90 adds SmartBlock 2.0",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/07/firefox-90-ramps-up-private-browsing-with-new-smartblock-2-0/"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 27844773,
      "score": 1,
      "time": 1626357530,
      "title": "Germany floods: At least 42 dead and dozens missing after record rain",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-57846200"
    },
    {
      "by": "vladmk",
      "descendants": 0,
      "id": 27844743,
      "score": 1,
      "time": 1626357358,
      "title": "Genes and Aging Are Still",
      "type": "story",
      "url": "https://www.nytimes.com/2006/08/31/health/31age.html"
    },
    {
      "by": "amitsy",
      "descendants": 1,
      "id": 27844728,
      "kids": [
        27844879
      ],
      "score": 5,
      "text": "Hey HN. We are Amit, Chetan, Anubhav and Hari, the cofounders of Weekday (<a href=\"https:&#x2F;&#x2F;www.weekday.works\" rel=\"nofollow\">https:&#x2F;&#x2F;www.weekday.works</a>) . We are building a recruitment platform centered around recommendations. We help companies hire engineers who are vouched for by other engineers.<p>Discovering top talent is challenging. It&#x27;s easy to check for great credentials, but that&#x27;s not the same thing as on-ground reality and achievement. It works the other way, too: someone with credentials may not be a great contributor, and screening for credentials eliminates many contributors who are.<p>Our company is based on the insight that great contributors tend to know other great contributors and are in a position to recommend them. We believe that a network-driven approach can help to discover high-caliber candidates.<p>We chanced upon this idea when we were doing our previous startup where we found it excruciatingly difficult to hire our first engineer. We tried all job boards and tech hiring marketplaces but nothing worked. We asked 50 of our friends if they knew a good engineer for us. Many said that they would recommend someone, but few actually did. We realized that it was because the friction to recommend is too high. Instead, we asked those friends to do a screen-share call and scroll their LinkedIn connections and just tell us which ones they would recommend (it didn&#x27;t matter if they thought they were looking out). This ended up increasing our pipeline multifold and is what gave us the idea to productize the same approach and try to make it work for a global network.<p>In an attempt to productise the same approach of hiring via recommendations, we have built a Chrome extension which removes the friction of coming up with names to refer. We give people a shortlist of people to choose from (based on a matching of roles we have available and your connections’ profiles) and they can recommend anyone they like out of them. They get financial rewards if the people they recommend end up getting interviewed by companies or get hired. Our business model works on a success fee model, we take 15% of annual salary from the company’s side. We pass on a percentage of that finder’s fee to the engineer who recommended them, while also paying if any of your recommended friends get interviews (as we have seen on avg companies take 20 interviews to hire 1 person).<p>We have experienced that in hiring, neither a fully automated nor completely human-driven approach works. Having to only interact with software can be a dehumanizing experience. A fully human-led approach leads to a lot of recruiter spam as every recruiter in their silo tries to reach out to every possible engineer. We believe our approach of hiring based on recommendations leads to a much more targeted matching and gives opportunities to people who otherwise would find it difficult in the current credential-driven job market.<p>We would love to get your feedback on our approach and hear about the problems you have faced while hiring, looking to switch jobs or interacting with recruiters.",
      "time": 1626357263,
      "title": "Launch HN: Weekday (YC W21) – Hire engineers vouched for by other engineers",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 27844718,
      "kids": [
        27844762
      ],
      "score": 2,
      "time": 1626357235,
      "title": "Facebook asks for removal of FTC Chair Khan from antitrust cases against it",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/14/facebook-is-shook-asks-for-removal-of-ftc-chair-khan-from-antitrust-cases-against-it/"
    },
    {
      "by": "steelstraw",
      "descendants": 0,
      "id": 27844706,
      "score": 1,
      "time": 1626357188,
      "title": "A personal note on Cuba and what it can teach Americans now",
      "type": "story",
      "url": "https://www.thepullrequest.com/p/the-invisible-boot"
    }
  ]
}