{
  "stories": [
    {
      "by": "daniel-alex",
      "descendants": 0,
      "id": 30955407,
      "score": 1,
      "time": 1649414760,
      "title": "Proton and SimpleLogin are joining forces",
      "type": "story",
      "url": "https://protonmail.com/blog/proton-and-simplelogin-join-forces/"
    },
    {
      "by": "jcubic",
      "descendants": 0,
      "id": 30955404,
      "score": 1,
      "text": "This is a comment I&#x27;ve added to this post on dev.to https:&#x2F;&#x2F;dev.to&#x2F;kevincox&#x2F;maybe-passwords-are-the-future-4gdl I think it may be interested to Hacker News readers.<p>I don&#x27;t think that passwords are needed at all. The reason they exists is to verify that you are you. There are better way of doing it. But I yet to see good solution.<p>The problem the password solve is that you say once that you&#x27;re you and then again you verify that you&#x27;re you. But password are solution that are create very long ago, when there were no other way of authentications.<p>I think that 2FA solution where 2nd A is the only A is the way to go. But it need to way better automated so it have better UX.<p>I was once thinking about Personal OAuth solution, where user browser act as OAuth provider that can verify that she is she. Or something like LastPass but that will allow to register to the service, not only store passwords.<p>All those password managers are just a patch&#x2F;hack on broken system with password. It would be easier to just remove all password and start a better way of user authentication.<p>Solving password problem is great way to start a new Startup around the idea. Having app on a phone that act as OAuth with single button sign in like with physical Token would be really great idea for a startup that will get rid of passwords. Since with 2FA you actually don&#x27;t need that 1st step with password. The app will only work similar to LastPass, Physical token and Authenticator App.<p>The flow can work like this:<p>* You login on a website with email or username only\n* Request is send to the service\n* Popup show up on your phone (that can be restricted with PIN, like Bank mobile app of someone want better security)\n* User tap the button\n* Service authenticate the user on the site<p>To resister to a website:<p>* You type username or email and QR Code show up on the screen\n* You scan the code with the app\n* And you only need one password for the Service. This can be called 2ndFA Second Factor Authentication.<p>The normal process of registration with password and email will only happen with The Service.",
      "time": 1649414731,
      "title": "Second Factor Authentication",
      "type": "story"
    },
    {
      "by": "ricardbejarano",
      "descendants": 0,
      "id": 30955384,
      "score": 1,
      "time": 1649414454,
      "title": "Find Jira issues faster with this shortcut",
      "type": "story",
      "url": "https://www.bejarano.io/jira-issues-shortcut/"
    },
    {
      "by": "sm_ts",
      "descendants": 0,
      "id": 30955382,
      "score": 1,
      "time": 1649414442,
      "title": "Magnus – Ruby Bindings for Rust",
      "type": "story",
      "url": "https://github.com/matsadler/magnus"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30955381,
      "score": 1,
      "time": 1649414411,
      "title": "Building Games in ECS with Entity Relationships",
      "type": "story",
      "url": "https://ajmmertens.medium.com/building-games-in-ecs-with-entity-relationships-657275ba2c6c"
    },
    {
      "by": "fabianalebelle",
      "descendants": 0,
      "id": 30955369,
      "score": 1,
      "time": 1649414240,
      "title": "Repo.xarold.com",
      "type": "story"
    },
    {
      "by": "pradeepb28",
      "descendants": 0,
      "id": 30955366,
      "score": 1,
      "text": "I was inspired by other builders who were working on mac apps, so I wanted to build a mac app.<p>What is it?\nHave you ever been in an awkward situation where you wanted to hide all of your desktop icons or windows during a meeting but couldn’t do it fast?\nHave you ever been encountered in a situation where you believed you were on mute in the meeting but were not?\nIf you want to avoid those problems in the future, then you are in the right place.<p>Zen mode — Hide Everything. Mute Everything is a single click tool that lets you hide desktop icons, hide inactive windows, mute mic or speakers.<p>Here is a quick video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=wT2PdPg-RZo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=wT2PdPg-RZo</a><p>You can try the app here: <a href=\"https:&#x2F;&#x2F;zen-mode.carrd.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;zen-mode.carrd.co&#x2F;</a><p>more features coming soon...",
      "time": 1649414204,
      "title": "Show HN: With a one click declutter your desktop in meetings or in public places",
      "type": "story",
      "url": "https://zen-mode.carrd.co"
    },
    {
      "by": "asim",
      "descendants": 0,
      "id": 30955352,
      "score": 1,
      "time": 1649413982,
      "title": "M3O DNS API – DNS over HTTPS",
      "type": "story",
      "url": "https://m3o.com/dns"
    },
    {
      "by": "mjoseph-strych",
      "descendants": 1,
      "id": 30955341,
      "kids": [
        30955360
      ],
      "score": 1,
      "text": "Market research to solve the banking needs of global start ups.",
      "time": 1649413888,
      "title": "Start Up Banks",
      "type": "story"
    },
    {
      "by": "bonzini",
      "descendants": 0,
      "id": 30955338,
      "score": 1,
      "time": 1649413854,
      "title": "Deprecating Scp (2020)",
      "type": "story",
      "url": "https://lwn.net/Articles/835962/"
    }
  ]
}