{
  "stories": [
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29430577,
      "score": 1,
      "time": 1638542804,
      "title": "The Hard Drive That Brought Down the Chancellor",
      "type": "story",
      "url": "https://www.martinthuer.at/2021/12/netzwerkeffekte/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29430546,
      "score": 2,
      "time": 1638542643,
      "title": "Altering Emotions in Video Footage with AI – Unite.ai",
      "type": "story",
      "url": "https://www.unite.ai/altering-emotions-in-video-footage-with-ai/"
    },
    {
      "by": "worldvoyageur",
      "descendants": 0,
      "id": 29430545,
      "score": 3,
      "time": 1638542643,
      "title": "How to Keep Your Corporation Out of the Culture War",
      "type": "story",
      "url": "https://www.persuasion.community/p/haidt-and-lukianoff-how-to-end-corporate"
    },
    {
      "by": "barlutiu",
      "descendants": 0,
      "id": 29430540,
      "score": 2,
      "time": 1638542617,
      "title": "Stacks v1.6 – The best Trello alternative has just got even better",
      "type": "story",
      "url": "https://stacks.rocks/blog/stacks-v1.6/"
    },
    {
      "by": "toisanji",
      "descendants": 0,
      "id": 29430533,
      "score": 1,
      "time": 1638542588,
      "title": "Incentivize older people to use autonomous vehicles to increase adoption",
      "type": "story",
      "url": "https://blog.jtoy.net/incentivize-older-people-to-use-autonomous-vehicles-to-increase-adoption/"
    },
    {
      "by": "kristintynski",
      "descendants": 1,
      "id": 29430520,
      "kids": [
        29430529
      ],
      "score": 9,
      "text": "As a marketer, i’ve always been fascinated with new and interesting ways content is driving engagement, sharing, but most of all how content creates motivation and growth around shared goals. What is it that can turn a single viral post into a movement? How does that happen? Who can do it? How does it grow, and what can we learn?<p>I’m going to tell you two stories, both of which happened to me in the last year, experiences that have made me look at marketing, content, community, and purpose differently. I will explore the special dynamics that led to the creation of something from nothing in these two cases, and point out how and why specific things worked. What I hope to provide is a playbook for starting a movement from nothing, with two examples of different ways to do it that I have been involved with.<p>1. PDAP - The Police Data Accessibility Project\nWhat began as a typical data-driven content marketing project for a domain my company owns, quickly snowballed into something much much bigger.<p>It began when I realized that my local county made all police arrest and traffic citation data public. This included all of the meta data on the arresting officer, the arrestee, and the circumstances of the arrest. With this data aggregated for a single county, it was possible to essentially do individual level police officer analysis, to see how they were actually behaving on the job. Outliers could be identified easily, and hard questions could be asked.<p>After doing a blog post about this, along with the data analysis of my County, I made a reddit post linking to the blog.  This is where the first few lessons come in:<p>The story needs to be compelling (the idea that we can police the police with existing data is an exciting one for some people)<p>Who the story is interesting to is extremely important. The message needs to matter to the audience. In this case, my post went up on r&#x2F;privacy, a large community dedicated to individual privacy, with a focus on tech privacy. This story resonated with them, as it flipped the paradigm and suggested that it was possible to do predictive policing on the police themselves. \nIf you want to start a movement, you need to capitalize on early traction.<p>After posting my blog post to reddit(https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;privacy&#x2F;comments&#x2F;gm8xfq&#x2F;if_cops_can_watch_us_we_should_watch_them_i&#x2F;), it went viral within the community, giving authority and interest to the idea itself. I followed up with this post (https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;privacy&#x2F;comments&#x2F;gr11aw&#x2F;i_think_i_accidentally_started_a_movement&#x2F;), which was well received because of the first. Here, I played up the story, and made a call to action. This was the chance to seed a community, while the hype was hot within the subreddit.<p>So, I started a slack group, and started directing people from my reddit post to the slack. Over a few days several thousand people joined the slack channel. From nothing there were dozens of people collaborating, organizing, thinking critically about what it might look like to collaboratively try to Police the Police with data.<p>While the initial buzz on reddit wore off, a remnant of the few thousand that joined in those first days remained committed to the project long term.  Over the following year, what started as a reddit post became PDAP.io, a legitimate 501c3 non-profit, working every day toward more accessible and accountable police data, having written scrapers and aggregated hundreds of departments so far. The energy captured in those first few days was extended to become something much much bigger, by a handful of true believers who joined and saw the potential, based on a single initial post, and one follow up post.",
      "time": 1638542513,
      "title": "How to Start a Movement – Strange Experiences in Marketing",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 29430510,
      "kids": [
        29430511
      ],
      "score": 4,
      "time": 1638542463,
      "title": "Wikipedia Co-Founder Jimmy Wales Was Educated in a One-Room Schoolhouse",
      "type": "story",
      "url": "https://www.wsj.com/articles/wikipedia-co-founder-jimmy-wales-was-educated-in-a-one-room-schoolhouse-11638288640"
    },
    {
      "by": "marcodiego",
      "descendants": 1,
      "id": 29430498,
      "kids": [
        29430561
      ],
      "score": 7,
      "time": 1638542403,
      "title": "Blender 3.0 binaries",
      "type": "story",
      "url": "https://download.blender.org/release/Blender3.0/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29430484,
      "score": 3,
      "time": 1638542321,
      "title": "UTC with Smoothed Leap Seconds (UTC-SLS) (2011)",
      "type": "story",
      "url": "https://www.cl.cam.ac.uk/~mgk25/time/utc-sls/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29430481,
      "score": 3,
      "time": 1638542310,
      "title": "How to Think about Space-Based Missile Defense (2018)",
      "type": "story",
      "url": "https://allthingsnuclear.org/dwright/space-based-missile-defense/"
    }
  ]
}