{
  "stories": [
    {
      "by": "ozdave",
      "descendants": 0,
      "id": 28094042,
      "score": 1,
      "time": 1628292806,
      "title": "Starlight Could Be a Vast Alien Quantum Internet, Physicist Proposes",
      "type": "story",
      "url": "https://www.vice.com/en/article/5db4ma/starlight-could-really-be-a-vast-alien-quantum-internet-physicist-proposes"
    },
    {
      "by": "artur_makly",
      "descendants": 0,
      "id": 28094041,
      "score": 1,
      "time": 1628292804,
      "title": "Mod Games Live with Game Ifrit",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Mc2r2qmC0y4"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 28094014,
      "score": 1,
      "time": 1628292596,
      "title": "Strength Dictates Weakness",
      "type": "story",
      "url": "https://boz.com/articles/strength-weakness"
    },
    {
      "by": "GMWANG",
      "descendants": 1,
      "id": 28094003,
      "kids": [
        28094006
      ],
      "score": 1,
      "text": "I submitted a post citing something a little bit controversial. Seeing how well you guys handled the topic, I&#x27;m gonna pull out some real offensive stuff. Let&#x27;s tear down Harry Potter for a try, here we go:<p>1. The philosopher&#x27;s stone should not destroyed.<p>If we rank technology like scientific theories, on the scale of impact, then I argue, the inventions that changed the way human live on a more fundamental scale makes the greater impact. Under this evaluation, the CURE for cancer, the smallpox vaccine, should all rank at least 10x fold lesser than the invention of the philosophers&#x27; stone. For the extension of human life beyond a nature threshold is a great VIOLATION, yet also a great re-invention of human hardware.<p>The fault here is at the politics and limitations of the ethics in the wizarding society at the time, which was primitive and unable to provide a legal&#x2F;political structure that handles this invention properly.<p>The fault is not at science. It&#x27;s the people.<p>Can you imagine, if one day we found a cure to cancer, and because the government says it will lead to the inequality of people, therefore let&#x27;s destroy it? It would be so absurd, but remember, it&#x27;s only because we have surpassed that era in thinking and ethics, that we were able to handle those inventions at a psychological ease.<p>So same with the philosopher&#x27;s stone, no one should live further than natural limitation, therefore, for the sake of equality, let&#x27;s destroy it?<p>2. Voldemort is right.(and wrong)<p>I&#x27;m sad announce this too, but once I thought his potential argument through, I had admit he had lots of foresight that might not be totally wrong.<p>But of course, the killing of innocent people, torture, shall always be wrong and subject to legal punishment. But I&#x27;m only going to weigh the more controversial stuff here:<p>For one, following logic of my last argument, you will see Voldemort is actually one of the greatest inventor of his time. He is the only one whom attempted and succeeded in a human existential level invention, the Horcrux.<p>I didn&#x27;t realize the value of the Horcrux until one day I was writing a scenario where human existence might be threatened by aliens, and then you know what my first reaction was? We have to back up ourselves and scatter our coding info. into the space, and see if there&#x27;s opportunity that we will land on a habitable planet and decode, resuscitate.<p>So, there is great value in the Horcrux technology, even the potential to save humankind against extinction. Even on a lesser extent, what if we preserved Prof. Hawkin?<p>Destroy, destroy, destroy, the solution to everything that we can&#x27;t control, destroy. What is it we are fighting against, evil or our own fear?<p>My second point, I really don&#x27;t think people deserve to be hated because they don&#x27;t understand love. I&#x27;d say in a court case, this is what made them victim, being unloved is just like being born in poverty. Being unable to love is just like being asexual, it&#x27;s not an illness.",
      "time": 1628292531,
      "title": "Harry Potter is Anti-technology, here's why",
      "type": "story"
    },
    {
      "by": "arunbahl",
      "descendants": 0,
      "id": 28093993,
      "score": 1,
      "time": 1628292497,
      "title": "Apple explains how iPhones will scan photos for child-sexual-abuse images",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/08/apple-explains-how-iphones-will-scan-photos-for-child-sexual-abuse-images/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28093980,
      "score": 3,
      "time": 1628292432,
      "title": "SEC approves Nasdaq's plan to require board diversity",
      "type": "story",
      "url": "https://apnews.com/article/business-race-and-ethnicity-ef14c40ab196e29b3a9f3022ee70d0f7"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 28093896,
      "score": 1,
      "time": 1628291787,
      "title": "China's Sputnik Moment?",
      "type": "story",
      "url": "https://www.foreignaffairs.com/articles/united-states/2021-07-29/chinas-sputnik-moment"
    },
    {
      "by": "paul32345",
      "descendants": 0,
      "id": 28093882,
      "score": 1,
      "time": 1628291660,
      "title": "Stasi",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Stasi"
    },
    {
      "by": "hbcondo714",
      "descendants": 0,
      "id": 28093863,
      "kids": [
        28094010,
        28094034
      ],
      "score": 8,
      "time": 1628291562,
      "title": "Britney Spears: 'I got my first iPad today'",
      "type": "story",
      "url": "https://www.yahoo.com/entertainment/britney-spears-ipad-conservatorship-battle-160245957.html"
    },
    {
      "by": "markdoney",
      "descendants": 1,
      "id": 28093844,
      "kids": [
        28093869
      ],
      "score": 3,
      "time": 1628291451,
      "title": "The Big Money Behind the Big Lie",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/08/09/the-big-money-behind-the-big-lie"
    }
  ]
}