{
  "stories": [
    {
      "by": "akvadrako",
      "descendants": 0,
      "id": 30104719,
      "score": 1,
      "time": 1643310457,
      "title": "Wordle starting word, statistically proven",
      "type": "story",
      "url": "https://medium.com/@brendanwjones/the-best-wordle-starting-word-statistically-proven-3946e3a040e4"
    },
    {
      "by": "valashnez",
      "descendants": 0,
      "id": 30104713,
      "score": 1,
      "time": 1643310436,
      "title": "Show HN: Sync your personal finances to Notion, automatically",
      "type": "story",
      "url": "https://www.finotion.app/"
    },
    {
      "by": "omgmajk",
      "descendants": 0,
      "id": 30104700,
      "score": 1,
      "text": "I watch a lot of YouTube. Most days a few hours, so they have a lot of data on what I watch. My google account is ancient, It&#x27;s been with me since the start of gmail and became a YT account when they took over. Lately the recommendations that I get are a lot more repetitive than they used to be. I get recommended the same videos over and over, sometimes I even get recommended things I would never have seen in my feed years ago - things that are of no interest that used to be outside of my bubble for the longest time. I also see tons of videos that I know that I have watched being marked as un-watched and recommended again and again. I don&#x27;t know if this is imagined of if their algorithms have become terrible lately. Anyone else have this feeling?",
      "time": 1643310387,
      "title": "Ask HN: Has YouTube's recommendations gotten worse?",
      "type": "story"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 30104686,
      "score": 1,
      "time": 1643310335,
      "title": "Microsoft Teams users can now chat with Teams users outside their organization",
      "type": "story",
      "url": "https://techcommunity.microsoft.com/t5/microsoft-teams-blog/microsoft-teams-users-can-now-chat-with-any-teams-user-outside/ba-p/3070832"
    },
    {
      "by": "chollida1",
      "descendants": 0,
      "id": 30104641,
      "score": 1,
      "time": 1643310076,
      "title": "Crypto Secrecy Makes DeFi a Wonderland to Felon Tied to Quadriga",
      "type": "story",
      "url": "https://www.bloombergquint.com/onweb/crypto-s-cloak-of-anonymity-makes-defi-a-wonderland-for-felon"
    },
    {
      "by": "Radim",
      "descendants": 0,
      "id": 30104624,
      "score": 2,
      "time": 1643310000,
      "title": "Last living signer of Canadian constitutional charter sues gvt over Covid bans",
      "type": "story",
      "url": "https://www.jccf.ca/the-charters-only-living-signatory-sues-canada-over-travel-mandates/"
    },
    {
      "by": "nickexyz",
      "descendants": 0,
      "id": 30104587,
      "score": 2,
      "time": 1643309837,
      "title": "OPNsense 22.1 “Observant Owl” released",
      "type": "story",
      "url": "https://opnsense.org/opnsense-22-1-released/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30104558,
      "score": 1,
      "time": 1643309691,
      "title": "Netflix Is Now Streaming AV1 Video to Select Smart TVs and Game Consoles",
      "type": "story",
      "url": "https://www.audioholics.com/hdtv-formats/netflix-av1"
    },
    {
      "by": "msapaydin",
      "descendants": 0,
      "id": 30104513,
      "score": 2,
      "text": "Today&#x27;s something very strange happened for me where I live (Turkey). I got a health insurance offer (from Allianz) that precluded certain conditions (thyroid related). I had made a request about 10 months ago from the same provider, and had not had this excluded set of conditions from the insurance policy, but had decided to not proceed. Since then, I have had a private blood test and a private MR for thyroid. I paid for both myself in full, one in cash. When I showed the results of the test and the MR to my doctor last year, he concluded that I had no thyroid related condition to worry about and I decided to get a private health insurance. I wonder how the health insurance provided has heard of this set of tests I had done. I can think of only a clandestine transfer of data from the hospital and lab where the MR and blood test were done which does not adhere to the national equivalent of GDPR. I am not sure what I could do to prevent this kind of thing except moving elsewhere with better privacy procedures.",
      "time": 1643309505,
      "title": "How to prevent health insurance company get hold of private health tests",
      "type": "story"
    },
    {
      "by": "JSeymourATL",
      "descendants": 0,
      "id": 30104510,
      "score": 1,
      "time": 1643309497,
      "title": "Discharging Remote Workers Trigger the Warn Act at ‘Single Site of Employment’?",
      "type": "story",
      "url": "https://www.natlawreview.com/article/can-discharging-remote-workers-trigger-warn-act-single-site-employment"
    }
  ]
}