{
  "stories": [
    {
      "by": "JNRowe",
      "descendants": 0,
      "id": 30956718,
      "score": 1,
      "time": 1649425723,
      "title": "Reproducible Builds in March 2022",
      "type": "story",
      "url": "https://reproducible-builds.org/reports/2022-03/"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 30956684,
      "score": 2,
      "time": 1649425440,
      "title": "An Update to Raspberry Pi OS Bullseye",
      "type": "story",
      "url": "https://www.raspberrypi.com/news/raspberry-pi-bullseye-update-april-2022/"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 30956674,
      "score": 2,
      "time": 1649425359,
      "title": "WBA OpenRoaming promises seamless access for municipal Wi-Fi",
      "type": "story",
      "url": "https://www.theregister.com/2022/04/08/wba_openroaming/"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 30956670,
      "score": 2,
      "time": 1649425330,
      "title": "Built without wheels, this infinity bike looks to start a revolution",
      "type": "story",
      "url": "https://mashable.com/video/infinity-bike-stephen-henrich"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30956663,
      "score": 3,
      "time": 1649425307,
      "title": "Help us improve the Corona-Warn-App",
      "type": "story",
      "url": "https://www.coronawarn.app/en/"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 30956662,
      "score": 2,
      "time": 1649425305,
      "title": "The Soviet Union's Lethal MiG-25 Foxbat: A Business Jet?",
      "type": "story",
      "url": "https://nationalinterest.org/feature/the-soviet-unions-lethal-mig-25-foxbat-business-jet-13912"
    },
    {
      "by": "redman25",
      "descendants": 1,
      "id": 30956643,
      "kids": [
        30956729
      ],
      "score": 1,
      "time": 1649425195,
      "title": "Ask HN: What’s the best non-vim vim mode editor?",
      "type": "story"
    },
    {
      "by": "eimrine",
      "descendants": 0,
      "id": 30956636,
      "score": 3,
      "text": "I am from a generation that is familiar with banners showing dancing Flash animations from the internets of the 00s, usually some boobs and butts on the middle of the screen, and I still remember that pressing [x] or [close] could either close the banner or do it even bigger. So if the cookie banner&#x27;s overlay is not hard enough, I am comfortable to read a text through the overlay, but it seems way more broken because the owners of that dancing nudes at least realized that they are disturbing people, and those in charge of the cookie banners really believe that they protect the interests of the user, so cookie banners are noticeable agressiver - nude banners never had an overlay and almost never made the content unreadable before paying attention to them.<p>Some websites might require you to go through the jungle of odd choices about which cookies are acceptable and which are not. It&#x27;s so similar to Italian strike (aka &quot;work-to rule&quot;). Imagine regular people who are forced to chose between the strange and even strangier. What can they choose but &quot;agree to everything&quot; or look an some gray text through a gray overlay?<p>There are definitely people in the HN crowd who can understand the different options offered by cookie banners. I have an example of this product of thought, maybe not the best, but good enough to demonstrate what the jungle is [1], so if at least one person in the whole world uses this option - share your answers:<p>1. What will you do on your next visit if your browser forgets the cookie - click again, right?<p>2. On which websites do you use these custom cookies, maybe you know something about some special websites?<p>3. Do you know about some instruments like DO-NOT-TRACK but for cookie banners? Adblock or adblock-like extentions IMO miss the point of doing the conscious decision.<p>4. If you are such an advanced user of cookie-banners then it is natural you to think they are somewhat useful for you - what are the advantages of this?<p>[1] https:&#x2F;&#x2F;www.hull.ac.uk&#x2F;",
      "time": 1649425163,
      "title": "People who press on cookie banners anything except “agree” – why do you do that?",
      "type": "story"
    },
    {
      "by": "AgnesCooper",
      "descendants": 0,
      "id": 30956632,
      "kids": [
        30956713
      ],
      "score": 1,
      "text": "I had my job fully done and smiles on my chicks knowning fully well i won at last, she thinks that i wasn&#x27;t smart well thanks to (wizardharry @ programmer . net ) if you need a private hacker to contact and help get job done secretly Harry is the best to contact, you can reach him anonymously by What sApp +1 8 0 7 8 0 8 6 1 6 8.. just tell him what you want, he is over capable.",
      "time": 1649425114,
      "title": "Get a Private Hacker Hired",
      "type": "story"
    },
    {
      "by": "philk10",
      "descendants": 0,
      "id": 30956623,
      "score": 1,
      "time": 1649425079,
      "title": "More Accessible Keyboard Layouts: One-Handed Dvorak",
      "type": "story",
      "url": "https://spin.atomicobject.com/2022/04/08/type-one-hand-dvorak/"
    }
  ]
}