{
  "stories": [
    {
      "by": "chirau",
      "descendants": 0,
      "id": 29001693,
      "score": 1,
      "time": 1635262566,
      "title": "Jay-Z's Marcy Venture Partners just closed its second fund with $325M",
      "type": "story",
      "url": "https://techcrunch.com/2021/10/25/marcy-venture-partners-cofounded-by-jay-z-just-closed-its-second-fund-with-325-million/"
    },
    {
      "by": "jckahn",
      "descendants": 0,
      "id": 29001687,
      "score": 1,
      "text": "Hi HN, a friend of mine is frustrated by their company&#x27;s move towards NFT adoption. They are considering looking for jobs at companies whose mission might serve to counteract NFT technology&#x27;s negative environmental effects. They&#x27;re having a hard time finding interesting companies in the sustainability space, but surely there must be something out there?<p>Are there any job boards or similar resources for software engineers who want to work in green tech? Please share them so that I can pass them along. Thank you in advance!",
      "time": 1635262548,
      "title": "Ask HN: How to find a job in sustainability as a software engineer?",
      "type": "story"
    },
    {
      "by": "georgesequeira",
      "descendants": 0,
      "id": 29001682,
      "score": 1,
      "time": 1635262536,
      "title": "Finding startup ideas that predict the future",
      "type": "story",
      "url": "https://www.georgesequeira.com/writing/finding-startup-ideas-that-anticipate-the-future"
    },
    {
      "by": "endlessvoid94",
      "descendants": 0,
      "id": 29001675,
      "score": 1,
      "time": 1635262507,
      "title": "The Theranos trial lost a juror to the mathematical allure of Sudoku",
      "type": "story",
      "url": "https://mashable.com/article/elizabeth-holmes-trial-juror-sudoku"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 29001665,
      "score": 1,
      "time": 1635262458,
      "title": "MobaXterm free Xserver and tabbed SSH client for Windows",
      "type": "story",
      "url": "https://mobaxterm.mobatek.net/"
    },
    {
      "by": "montalbano",
      "descendants": 0,
      "id": 29001636,
      "score": 1,
      "time": 1635262325,
      "title": "Elevated CO2 depletes plant minerals at the base of human nutrition",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4034684/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29001628,
      "score": 1,
      "time": 1635262285,
      "title": "Aspiring Founders Forum for Women Globally",
      "type": "story",
      "url": "https://blog.ycombinator.com/aspiring-founders-forum-for-women-globally/"
    },
    {
      "by": "standardUser",
      "descendants": 0,
      "id": 29001626,
      "score": 2,
      "time": 1635262280,
      "title": "Internet infrastructure company RightForge to host Trump’s TRUTH Social",
      "type": "story",
      "url": "https://www.axios.com/trump-social-network-host-rightforge-c5c83181-db9f-4936-854b-1bf8942dfe17.html"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 29001612,
      "score": 1,
      "time": 1635262214,
      "title": "Time Series Similarity Search",
      "type": "story",
      "url": "https://wwww.pinecone.io/docs/examples/time-series/"
    },
    {
      "by": "jrsutterfield",
      "descendants": 0,
      "id": 29001611,
      "score": 1,
      "text": "At the start of the pandemic, my girlfriend and I decided to work on a side project to keep ourselves busy. We ended up creating https:&#x2F;&#x2F;www.mynamefairy.com&#x2F;. It&#x27;s like a tinder for names. It&#x27;s been a fun project to work on, and its accomplished the technical growth goals that I wanted to get out of it (I learned how to do more modern css, how to setup a FE build with webpack, some vue.js, how to dockerize and deploy a django application, how to use postgres instead of MySQL), but at this point it&#x27;s been released for over a year and gets maybe 1-2 people a day. Those people are spending time on the site (avg time is 4 minutes, some spend up to 30-40 mins per session), but there just aren&#x27;t very many of them.<p>I&#x27;m not so much interested in trying to monetize it (although that would certainly be nice), but it&#x27;d be great if we could get more people using it. I&#x27;ve shared it on a few of subreddits. (r&#x2F;django[1], r&#x2F;python[2], and r&#x2F;webdev[3]). When doing so, I tried to balance the self promotion aspect with information about which classes I took and found useful, tools I worked with, and various lessons along the way. Those posts did provide a nice little bump for about a week or so, but traffic dropped again afterwards. At this point we&#x27;re trying to brainstorm what would be the best use of our energies to try and get more people using the site.<p>Some ideas we&#x27;ve had:\n* Focus more on SEO. If I google &quot;tinder for names&quot;, we don&#x27;t even show up. A lighthouse test gives us 100%, but clearly that&#x27;s not a good enough benchmark for how discoverable we are. We&#x27;ve even thought about paying some SEO expert to help, but so many of the services we find seem scammy.\n* Try and find more parenting&#x2F;expecting mom forums online and posting there.\n* Trying to find places around town we could leave flyers (we&#x27;re based in Amsterdam).\n* Just keep on hammering away at features to try and make the site more useful&#x2F;compelling.<p>Has anyone else faced a similar quandary and, if so, how did you go about getting more exposure for your project? It&#x27;s still just a hobby, but we&#x27;re willing to pay a bit of money if it helped us get some traffic and momentum on it again.<p>1: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;django&#x2F;comments&#x2F;kync31&#x2F;side_project_i_built_using_django_and_what_i&#x2F;\n2: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;Python&#x2F;comments&#x2F;kz8uxu&#x2F;side_project_i_built_using_django_a_tinder_for&#x2F;\n3: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;webdev&#x2F;comments&#x2F;l3dior&#x2F;side_project_i_built_using_django_a_tinder_for&#x2F;",
      "time": 1635262207,
      "title": "Ask HN: I built a side project. How do I get people to use it?",
      "type": "story"
    }
  ]
}