{
  "stories": [
    {
      "by": "warning26",
      "descendants": 0,
      "id": 31111870,
      "score": 1,
      "time": 1650559718,
      "title": "Elon Musk still wants Twitter–and he now has $46.5B in financing",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/04/elon-musk-still-wants-twitter-and-he-now-has-46-5-billion-in-financing/"
    },
    {
      "by": "rrmdp",
      "descendants": 0,
      "id": 31111857,
      "score": 1,
      "time": 1650559674,
      "title": "Made a web to help you find the best job boards in the world-Job Board Search",
      "type": "story",
      "url": "https://jobboardsearch.com/"
    },
    {
      "by": "jcun4128",
      "descendants": 0,
      "id": 31111842,
      "score": 1,
      "text": "We have a &quot;blended stack&quot; app which combines video and printing.<p>Currently our stuff runs on two t2.small servers. One serves the app (has everything). I know we can break it up. What we send out is an app which is just a static build (react) and it can be smaller (it&#x27;s big right now, need to purge Tailwind CSS). We use a postgres backend with Express.<p>Aside from that the video is handled by another party and our second server is primarily for an Apple CUPS instance. This server also handles websocket connections between users.<p>The servers are single CPU, 2GB RAM, not a lot of storage (not really needed for operation, we use S3 to store things).<p>Some ideas to scale are to just serve the front end builds via a CDN&#x2F;from S3.<p>I just was trying to figure out how I could get numbers per server, how many people it could hold. I have seen crazy figures like a single NGINX instance doing 10,000 requests out of the box easily.<p>The printer is the interesting one because the load is in bursts. Not sure what I should cap each machine at even though it&#x27;s probably never really 100% used at any time.",
      "time": 1650559603,
      "title": "Ask HN: Benchmarking Ideas?",
      "type": "story"
    },
    {
      "by": "anishathalye",
      "descendants": 1,
      "id": 31111836,
      "kids": [
        31111849
      ],
      "score": 1,
      "time": 1650559592,
      "title": "Cleanlab 2.0: Automatically Find Errors in ML Datasets",
      "type": "story",
      "url": "https://cleanlab.ai/blog/cleanlab-2/"
    },
    {
      "by": "logandhead",
      "descendants": 0,
      "id": 31111817,
      "score": 1,
      "text": "Whatnot is looking for a seasoned engineer who aligns with our company values and can work across a variety of stacks (backend, iOS, android, web) to help with skunk work like projects not sanctioned within the roadmap. ;-) You must have a growth &amp; hacker mindset.<p>You can apply here. https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;whatnot&#x2F;jobs&#x2F;4467142004",
      "time": 1650559498,
      "title": "Whatnot is looking for an engineer with a growth and hacker mindset",
      "type": "story"
    },
    {
      "by": "daniel-cussen",
      "descendants": 0,
      "id": 31111806,
      "score": 1,
      "text": "So recently I thought of the Cussen Test, it&#x27;s one converse of the Turing Test.  The Turing Test was created by Alan Turing as a target, basically, like what he wanted his AI to be able to do.  He must have wanted more later, but it&#x27;s a very well-defined milestone.  It is not final, however.  And the purpose is to allow him to exist in a world that didn&#x27;t tolerate him, by chemically castrating him for instance, but it wasn&#x27;t just homosexuality it was also how different he was.  And that world was dominated by humans.  So the AI researcher creates a bot that passes for a human, which believe it or not is more viable than adapting so he himself passes as human.<p>What&#x27;s the Cussen Test?  Similar, so it&#x27;s for AI researchers in a world dominated by bots.  The algorithm.  The Matrix, basically.  The goal is to get an human on the other end of the line, strictly through the same medium as the Turing Test, digital text.  This post is a Cussen Test.",
      "time": 1650559450,
      "title": "I'm having fun playing with the bots",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31111803,
      "score": 1,
      "time": 1650559437,
      "title": "Single-cell DNA sequencing provides insight on causes of Alzheimer’s disease",
      "type": "story",
      "url": "https://neurosciencenews.com/genetic-sequencing-alzheimers-20424/"
    },
    {
      "by": "donsupreme",
      "descendants": 0,
      "id": 31111778,
      "score": 1,
      "time": 1650559351,
      "title": "On a per day of existence, CNN+ burnt much more money than Quibi",
      "type": "story",
      "url": "https://twitter.com/trungtphan/status/1517177312424316929"
    },
    {
      "by": "CarCooler",
      "descendants": 0,
      "id": 31111748,
      "score": 2,
      "time": 1650559257,
      "title": "Tesla giving high school grads opportunity to work full-time at Giga Texas",
      "type": "story",
      "url": "https://cbsaustin.com/news/local/tesla-giving-high-school-grads-opportunity-to-work-full-time-at-giga-texas-factory"
    },
    {
      "by": "ericvanular",
      "descendants": 0,
      "id": 31111739,
      "score": 2,
      "time": 1650559228,
      "title": "Government: Motorists in self-driving cars will not be liable for crashes",
      "type": "story",
      "url": "https://news.sky.com/story/self-driving-cars-motorists-will-not-be-liable-for-crashes-and-can-watch-tv-behind-the-wheel-government-says-12593826"
    }
  ]
}