{
  "stories": [
    {
      "by": "dondraper36",
      "descendants": 0,
      "id": 30323495,
      "score": 1,
      "text": "To be more accurate, I am referring to the Go programming language, but I assume the answer doesn&#x27;t depend heavily on a particular language.<p>Not so long ago, I switched to Go from Python and I really appreciate almost all aspects of the language. I have read all the recommended resources (and keep rereading some of them like Effective Go). At this stage, very often it all boils down to reading the specification, which is very readable and user-friendly.<p>Nonetheless, there are some questions for which explanations unexpectedly (for me, I mean) shift the discussion to code in C, assembly instructions, how the compiler is implemented.<p>Even though I understand that pretty often it&#x27;s not necessary to understand things at a very low level, but I feel comfortable when unable to do so.<p>What are some resources or at least subjects I should get comfortable with so I can reason about more advanced issues like performance, motivation behind certain language decisions, etc.<p>Do you think that getting your feet wet with C is necessary for that? Compilers? Assembly? Something else?",
      "time": 1644773288,
      "title": "Ask HN: Books to feel comfortable discussing internals of programming languages?",
      "type": "story"
    },
    {
      "by": "openquery",
      "descendants": 0,
      "id": 30323486,
      "score": 2,
      "time": 1644773246,
      "title": "Cryptomnesia",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Cryptomnesia"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 30323469,
      "score": 4,
      "time": 1644773161,
      "title": "Swiss back further restrictions on tobacco advertising",
      "type": "story",
      "url": "https://www.swissinfo.ch/eng/politics/swiss-to-vote-on-protecting-children-from-tobacco-ads/47336990"
    },
    {
      "by": "fnubbly",
      "descendants": 0,
      "id": 30323448,
      "score": 3,
      "time": 1644773050,
      "title": "Patricia Highsmith: Diaries and Notebooks",
      "type": "story",
      "url": "https://www.prospectmagazine.co.uk/arts-and-books/patricia-highsmith-diaries-notebooks-review-ian-rankin"
    },
    {
      "by": "wallflower",
      "descendants": 0,
      "id": 30323432,
      "score": 2,
      "time": 1644772959,
      "title": "Kubernetes: The Documentary",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=BE77h7dmoQU"
    },
    {
      "by": "wglb",
      "descendants": 0,
      "id": 30323417,
      "score": 1,
      "time": 1644772875,
      "title": "Elliptic Follows the $7B in Bitcoin stolen from Bitfinex in 2016 (2021)",
      "type": "story",
      "url": "https://www.elliptic.co/blog/elliptic-analysis-bitcoin-bitfinex-theft"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30323413,
      "score": 1,
      "time": 1644772857,
      "title": "What’s a Boundary Anyway? Know When to Set a Boundary",
      "type": "story",
      "url": "https://www.tiffanygoyer.com/blog/2018/11/19/boundary"
    },
    {
      "by": "disqard",
      "descendants": 0,
      "id": 30323384,
      "score": 1,
      "text": "I just received an annoying popup forcing an &quot;upgrade&quot; to &quot;Cam Plus Lite&quot; by 15th Feb, else my cams &quot;will capture snapshots instead of 12-second videos&quot;.<p>This is sleazy stuff Wyze, and I will be throwing away your hardware very soon as a result (and making sure to tell all of my friends and colleagues to stay away from your products).",
      "time": 1644772731,
      "title": "Tell HN: Wyze cam forcing upgrade to keep storing recordings locally",
      "type": "story"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 30323376,
      "score": 1,
      "time": 1644772667,
      "title": "Rockefeller Foundation: Reset the Table – Transforming the U.S. Food System [pdf]",
      "type": "story",
      "url": "https://www.rockefellerfoundation.org/wp-content/uploads/2020/07/RF-Reset-the-Table-FULL-PAPER_July-28_FINAL.pdf"
    },
    {
      "by": "2bor-2n",
      "descendants": 0,
      "id": 30323369,
      "score": 2,
      "text": "I am from South Asia and in an interview process with a German e-commerce company. The role I am interviewing for is Senior Frontend Engineer. I have already given my technical interview and this should be the last interview (according to the recruiter).<p>The interviewers would consist of the recruiter, Engineering Manager, and Engineering Director and then I would get the chance to meet the team I would work with. I am not sure what kind of questions to expect from them or to ask from the team. I want to ACE this interview that&#x27;s why I want to get some tips from people here.<p>Please feel free to share any kind of guidance&#x2F;suggestion&#x2F;interview experiences here. Thanks a lot.",
      "time": 1644772628,
      "title": "Ask HN: Upcoming interview with Engineering manager and Engineering Director",
      "type": "story"
    }
  ]
}