{
  "stories": [
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28029475,
      "score": 1,
      "time": 1627848876,
      "title": "Anthropogenic forcing yields observed positive trend in Earth’s energy imbalance",
      "type": "story",
      "url": "https://www.nature.com/articles/s41467-021-24544-4"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 28029469,
      "score": 2,
      "text": "As you may have noticed, Spotify started sending this email to users:<p><pre><code>    Starting August 04, 2021, we&#x27;ll be upgrading our systems to ensure the accuracy of sales tax we       \n    are obligated by law to collect from subscribers. If you do not update your account \n    information, we will charge a rate in accordance with instructions from your state tax \n    authority. Any changes will be applied automatically as of your next billing date after August \n    04, 2021.\n</code></pre>\nI find it bizarre that a music streaming service needs my home address now. And they basically threat that they&#x27;ll charge me if I don&#x27;t provide this information by charging me.<p>Their policy says the following data is collected from users:<p><pre><code>    This is the personal data that is provided by you or collected by us to enable you to sign up \n    for and use the Spotify Service. Depending on the type of Spotify Service plan you sign up for, \n    this may include your username, email address, phone number, birth date, gender, street   \n    address, and country.\n</code></pre>\nThis is on top of the usage data that they collect. According to their policy, usage data includes:<p><pre><code>    Information about your type of Spotify Service plan.\n    Information about your interactions with the Spotify Service such as your search queries \n    (including the date and time of any requests you make), streaming history, playlists you \n    create, your library, your browsing history, and your interactions with the Spotify Service, \n    content, other Spotify users. This also may include details of your use of third party \n    applications in connection with the Spotify Service.\n    Inferences drawn about your interests and preferences based on your usage of the Spotify Service.\n    User Content (as defined in the Terms and Conditions of Use) you post to Spotify, such as photos, playlist titles, and interactions with \n    the Spotify Customer Service team. Please note that we will only access your camera or photos from your device if you give us permission to \n    do so, and we will only access images that you specifically choose to share with us and metadata related to those images, such as the type \n    of file and the size of the image. We will never scan or import your device’s photo library or camera roll.\n    Certain technical data, which may include:\n\n    URL information;\n    online identifiers including cookie data and IP addresses;\n    information about the types of devices you are using such as unique device IDs, network \n    connection type (e.g. wifi, 3G, LTE, Bluetooth), provider, network and device performance, \n    browser type, language, information enabling digital rights management, operating system, and \n    Spotify application version;\n    device attributes of devices on your wifi network that are available to connect to the \n    Spotify Service (such as speakers);\n    your non-precise location, which may be derived or inferred from certain technical data \n    (e.g., your IP address, language setting of your device, or payment currency), to comply with  \n    geographic requirements in our licensing agreements, and deliver personalized content and \n    advertising to you; and\n    motion-generated or orientation-generated mobile sensor data (e.g. accelerometer or \n    gyroscope) required for the purposes of providing specific features of the Spotify Service to \n    you.</code></pre>",
      "time": 1627848832,
      "title": "Tell HN: Spotify says either gives us your home address or you'll be charges",
      "type": "story"
    },
    {
      "by": "jkradddic",
      "descendants": 0,
      "id": 28029438,
      "score": 2,
      "text": "I&#x27;m cleaning off my desk and just found an old dog-eared copy of O&#x27;Reilly&#x27;s XSLT pocket reference. I referenced in frequently ~2006-10 but haven&#x27;t touched in awhile. It&#x27;s got me wondering... when did you (the HN commenter) last use XSLT?<p>Also, are there any actively used APIs (obviously SOAP, but also REST) that only return XML?",
      "time": 1627848610,
      "title": "Ask HN: When do you last use XSLT?",
      "type": "story"
    },
    {
      "by": "bschaatsbergen",
      "descendants": 0,
      "id": 28029435,
      "score": 1,
      "time": 1627848585,
      "title": "Pre-jitting in Lambda (using CrossGen) to reduce .NET cold starts",
      "type": "story",
      "url": "https://www.bschaatsbergen.com/pre-jitting-in-lambda"
    },
    {
      "by": "dabockster",
      "descendants": 0,
      "id": 28029434,
      "score": 1,
      "text": "So I just read yet another article about HN users using their own views on science and logic to rip into someone else because of something they didn&#x27;t agree with. I won&#x27;t link or mention the article here, but this is a repeating pattern. You have to remember that there are other people in tech who do not necessarily have the same opinions or conclusions on data that you do. And that is okay.<p>What isn&#x27;t okay is showing up and attempting to coerce someone to believe the same things you do, in the same ways that you do. I stopped going to HN regularly for this reason a long time ago. But with your lack of empathy and obvious lack of respect for original human thought and emotion, I decided to come back and post this. What you are doing is hurting people and is holding this industry back. You contribute NOTHING by arguing with someone like that. Being online behind a username does not give you a pass to treat someone less than human.<p>I strongly encourage anyone who reads this to look at themselves in the mirror and try to understand genuine human empathy. Stop thinking of things in strict fact and logic (like, eg, Spock), and learn to be sympathetic to other individuals’ feelings and emotions. Remember that you don’t have to agree with them, but you still need to understand their perspective at the very least. Learn empathy. Be a human being.<p>One final thing: I say all tof his as a person with a diagnosed autism disorder. If I, of all people, can be empathetic then so can you. There are ZERO excuses for this sort of behavior. Fix it ASAP.",
      "time": 1627848557,
      "title": "Ask HN: Let's talk about empathy towards others",
      "type": "story"
    },
    {
      "by": "jameslk",
      "descendants": 0,
      "id": 28029433,
      "score": 2,
      "time": 1627848554,
      "title": "Forget the suburbs, the 'exurbs' are the place to be",
      "type": "story",
      "url": "https://www.businessinsider.com/moving-from-suburbs-to-exurbs-pandemic-relocation-where-to-move-2021-7"
    },
    {
      "by": "jessaustin",
      "descendants": 0,
      "id": 28029432,
      "score": 1,
      "time": 1627848544,
      "title": "A.I. Drone May Have Acted on Its Own in Attacking Fighters, U.N. Says",
      "type": "story",
      "url": "https://www.nytimes.com/2021/06/03/world/africa/libya-drone.html"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28029418,
      "score": 1,
      "time": 1627848461,
      "title": "Programming Rules to Develop Secure Applications with Rust",
      "type": "story",
      "url": "https://www.ssi.gouv.fr/en/guide/programming-rules-to-develop-secure-applications-with-rust/"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 28029375,
      "score": 2,
      "time": 1627848140,
      "title": "The Invisible Tech Behemoth",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/07/microsofts-antitrust/619599/"
    },
    {
      "by": "alokrai",
      "descendants": 0,
      "id": 28029366,
      "score": 2,
      "time": 1627848102,
      "title": "Linfa: A Rust machine learning framework",
      "type": "story",
      "url": "https://github.com/rust-ml/linfa"
    }
  ]
}