{
  "stories": [
    {
      "by": "solouncomen",
      "descendants": 0,
      "id": 32181494,
      "score": 1,
      "text": "I&#x27;ve been working at this company for ~4 months, and I feel like an absolute outcast there. I work 3&#x2F;5 days remotely, and I&#x27;m pretty happy when I work by myself—the job is fine. The problem comes with the two days I need to go to the office. I&#x27;ve anxiety the night before, and I feel depressed the day after.<p>My coworkers have a cliquey vibe, and I feel like the weird introvert who doesn&#x27;t talk very much. I do talk with people I feel comfortable with, but with this team (I don&#x27;t know why) I enter <i>quiet mode</i>, and I can&#x27;t go out of there. It&#x27;s weird because it&#x27;s the first time at a job that I don&#x27;t click with anybody. In previous experiences, I always have had 2 or 3 coworkers which whom I could get along with, make jokes, or share some kind of interest.<p>Here I don&#x27;t have anybody to share a problem with. It makes me feel sad, and I&#x27;m falling into a depression. I know that we don&#x27;t go to work to make friends, but I&#x27;m experiencing first-hand time how difficult it is the lack of support at the workplace.<p>I thought that waiting some time would make things better, but they are going worse. I&#x27;m avoiding going to breakfast with them, to keep away from the weird silences, and I feel like I do them a favour (if I go with them I sit there without saying anything).<p>What should I do? I&#x27;m thinking of quitting, but I&#x27;m not sure if I&#x27;m being too drastic.",
      "time": 1658421522,
      "title": "Ask HN: Quit a job if you don't fit in the team?",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32181490,
      "score": 1,
      "time": 1658421510,
      "title": "Huawei under investigation for having tech installed near US missile silos",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/21/huawei_missile_silo_spying/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32181478,
      "score": 1,
      "time": 1658421449,
      "title": "FBI Warns Fake Crypto Apps Are Bilking Investors of Millions",
      "type": "story",
      "url": "https://threatpost.com/fbi-warns-fake-crypto-apps/180245/"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 32181474,
      "score": 1,
      "time": 1658421441,
      "title": "Paying for the Party: How colleges maintain inequality",
      "type": "story",
      "url": "https://jakeseliger.com/2014/04/27/paying-for-the-party-elizabeth-armstrong-and-laura-hamilton/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 32181468,
      "score": 1,
      "time": 1658421413,
      "title": "Critical flaws in GPS tracker enable “disastrous” and “life-threatening” hacks",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/07/critical-flaws-in-gps-tracker-enable-disastrous-and-life-threatening-hacks/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 32181465,
      "score": 1,
      "time": 1658421410,
      "title": "Sustainable practices linked to farm size in organic farming",
      "type": "story",
      "url": "https://phys.org/news/2022-07-sustainable-linked-farm-size-farming.html"
    },
    {
      "by": "JonathanBeuys",
      "descendants": 0,
      "id": 32181462,
      "score": 2,
      "text": "We had a great discussion here on HN a few days ago about the question whether it is possible to use Bitcoin in a trustless way. So that you control your Bitcoin yourself and don&#x27;t have to trust on any privileged party to take it from you:<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32115693<p>Interestingly, there was a <i>lot</i> of speculation and misinformation. So even on Hacker News, this topic is still only vaguely understood.<p>But also some very good information came to light.<p>The biggest bomb that was dropped in the thread received little attention: The fact that signing a transaction is not deterministic. This means when a hardware wallet is asked to sign a transaction, it can internally do that multiple times and then chose from multiple valid signatures. This means that it can encode data into the signature. For example, it could choose between two signatures with certain properties (say one results in an even checksum of the bits of the signature and one results in an odd checksum) and thereby signalling one bit to the creator of the wallet.<p>Everytime it signals a bit of your seed phrase home, the security of your coins is cut in half.<p>Here is an article about the fact that elliptic curve signatures are not deterministic:<p>https:&#x2F;&#x2F;medium.com&#x2F;@simonwarta&#x2F;signature-determinism-for-blockchain-developers-dbd84865a93e<p>The way I understand it, the wallet can chose from a large number of possible signatures and thereby signalling many bits to its creator. In every transaction.<p>I think a dicsussion about this should be started. The way I understand it, it makes it completely impossible to use Bitcoin in a trustless way. You are always at the mercy of the wallet manufactuer and the delivery chain that gets the wallet to you. If it gets swapped out on the way to you, you are at the mercy of whoever swapped it out.",
      "time": 1658421389,
      "title": "Tell HN: It looks like all Bitcoin hardware wallets can phone home",
      "type": "story"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 32181429,
      "score": 1,
      "time": 1658421264,
      "title": "You Won’t Be Allowed to Take Photos with Google’s New AR Glasses",
      "type": "story",
      "url": "https://petapixel.com/2022/07/21/you-wont-be-allowed-to-take-photos-with-googles-new-ar-glasses/"
    },
    {
      "by": "metadat",
      "descendants": 1,
      "id": 32181427,
      "kids": [
        32181433
      ],
      "score": 2,
      "time": 1658421257,
      "title": "Dave Chappelle’s show in Minneapolis canceled by venue after backlash",
      "type": "story",
      "url": "https://www.washingtonpost.com/arts-entertainment/2022/07/21/dave-chappelle-minneapolis-first-avenue-canceled/"
    },
    {
      "by": "mpweiher",
      "descendants": 0,
      "id": 32181424,
      "score": 1,
      "time": 1658421247,
      "title": "Documents as User Interfaces (1991)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=s6DuMNB5ILA"
    }
  ]
}