{
  "stories": [
    {
      "by": "bobcostas55",
      "descendants": 0,
      "id": 29897567,
      "score": 1,
      "time": 1641933859,
      "title": "On the History of Scurvy Science",
      "type": "story",
      "url": "https://slimemoldtimemold.com/2022/01/11/reality-is-very-weird-and-you-need-to-be-prepared-for-that/"
    },
    {
      "by": "iam-TJ",
      "descendants": 0,
      "id": 29897560,
      "score": 1,
      "time": 1641933828,
      "title": "Live demonstration for cyber resilience (European Space Agency)",
      "type": "story",
      "url": "https://www.esa.int/Safety_Security/Live_demonstration_for_cyber_resilience"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 29897549,
      "score": 2,
      "time": 1641933776,
      "title": "How High Will California's Taxes Go Before There's No One Left to Tax?",
      "type": "story",
      "url": "https://reason.com/2022/01/11/how-high-will-californias-taxes-go-before-theres-no-one-left-to-tax/"
    },
    {
      "by": "chapulin",
      "descendants": 1,
      "id": 29897541,
      "kids": [
        29897551
      ],
      "score": 1,
      "time": 1641933745,
      "title": "‘Killer’ immune cells still recognize Omicron variant",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-00063-0"
    },
    {
      "by": "Capira",
      "descendants": 1,
      "id": 29897521,
      "kids": [
        29897558
      ],
      "score": 1,
      "text": "Bitcoiners care a lot about &quot;sound money&quot; (or &quot;hard money&quot;). They believe for a society to be sustainable, it is fundamental that its money is hard to debase. \nFurthermore, they believe that only if a society uses hard money the prices in the market can accurately reflect the cost of production. Otherwise, the market will always end up with inefficiencies and worse quality.<p>Apart from all criticism with regards to bitcoin&#x27;s energy consumption - do you care about sound money in that regard?",
      "time": 1641933625,
      "title": "Ask HN: Do you care about sound money?",
      "type": "story"
    },
    {
      "by": "starwind",
      "descendants": 1,
      "id": 29897507,
      "kids": [
        29897508
      ],
      "score": 1,
      "time": 1641933566,
      "title": "1MDB Scandal",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/1Malaysia_Development_Berhad_scandal"
    },
    {
      "by": "haunter",
      "descendants": 0,
      "id": 29897482,
      "score": 1,
      "time": 1641933461,
      "title": "The Next Five Years at Riot Games",
      "type": "story",
      "url": "https://www.riotgames.com/en/news/calling-the-shot-the-next-five-years-at-riot-games"
    },
    {
      "by": "alphabettsy",
      "descendants": 0,
      "id": 29897475,
      "score": 1,
      "time": 1641933410,
      "title": "Apple may be done with Intel Macs but Hackintoshes can still use the newest CPUs",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/01/apple-may-be-done-with-intel-macs-but-hackintoshes-can-still-use-the-newest-cpus/"
    },
    {
      "by": "tgp",
      "descendants": 0,
      "id": 29897462,
      "score": 1,
      "time": 1641933378,
      "title": "Exhaustive Union Matching in Python",
      "type": "story",
      "url": "https://tech.preferred.jp/en/blog/python-exhaustive-union-match/"
    },
    {
      "by": "fizzyfizz",
      "descendants": 0,
      "id": 29897428,
      "score": 1,
      "text": "I&#x27;ve had two recent experiences that seem like a new frontier, at least to me. I&#x27;m wondering if anyone else has noticed this, or if they know who might be selling fake LinkedIn accounts backed by AI to apparently legit businesses.<p>A person working at a well-known devops vendor reached out to me repeatedly because my company is in the news. Then called me on my personal phone. I texted him back to stop and he was still quite perky and persistent. Eventually I realized I was dealing with an AI - saying something like &quot;Hey, &#x27;Scheduling a meeting with you today at 2pm&#x27; is a thing I would never agree to&quot;, would result in the schedule being generated. I ghosted on that meeting and then the AI pinged me again saying he was sorry he couldn&#x27;t make that meeting since his grandmother was ill.<p>Just this morning the same thing happened. I&#x27;m feeling a bit ill and against my better judgment agreed to a call with a recruiter who cold-emailed me. The job seemed relatively specific and tailored to my needs, and even included a salary range which would be a decent bump for me. The recruiter had a long history on LinkedIn, although they seemed to have switched industries from writing for travel websites to recruiting. Plausible. When I got on the call, the person was not &quot;Jason&quot; (who had reached out) but &quot;Jay&quot; who proceeded to say that Jason was too new, so he didn&#x27;t let Jason handle the actual calls. I asked why Jason wasn&#x27;t on the call; wouldn&#x27;t this be a great training exercise for him to shadow us? &quot;Jay&quot; started speaking slowly as if he was figuring it out in real time, and said &quot;...yeah, sure, Jason could join us, if you want... if he&#x27;s not on another call right now...?&quot; I terminated that call right away.<p>What the actual f?? What is happening out there?",
      "time": 1641933206,
      "title": "Ask HN: Automated fake AI / LinkedIn accounts for sales or worse?",
      "type": "story"
    }
  ]
}