{
  "stories": [
    {
      "by": "chefkoch",
      "descendants": 0,
      "id": 27929570,
      "score": 1,
      "time": 1627040394,
      "title": "Mercedes-Benz to build eight battery factories in push to become electric-only",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/22/mercedes-benz-to-build-eight-battery-factories-in-push-to-become-electric-only-automaker-by-2030/"
    },
    {
      "by": "okumurahata",
      "descendants": 0,
      "id": 27929536,
      "score": 1,
      "time": 1627040068,
      "title": "Show HN: What Are You Working On?",
      "type": "story",
      "url": "https://tiempone.com"
    },
    {
      "by": "hucste",
      "descendants": 0,
      "id": 27929519,
      "score": 2,
      "time": 1627039871,
      "title": "OpenBSD: Xfce4",
      "type": "story",
      "url": "http://doc.huc.fr.eu.org/en/sys/openbsd/xfce4/"
    },
    {
      "by": "Aissen",
      "descendants": 1,
      "id": 27929495,
      "kids": [
        27929498
      ],
      "score": 2,
      "time": 1627039627,
      "title": "NXP hides critical firmware security fix in 1257 lines patch",
      "type": "story",
      "url": "https://twitter.com/kc8apf/status/1418306557196922883"
    },
    {
      "by": "pvsukale3",
      "descendants": 0,
      "id": 27929480,
      "score": 1,
      "time": 1627039533,
      "title": "Google-like letter avatars using ERB-generated SVGs",
      "type": "story",
      "url": "https://kukicola.io/posts/creating-google-like-letter-avatars-using-erb-generated-svgs/"
    },
    {
      "by": "ozu",
      "descendants": 0,
      "id": 27929472,
      "score": 1,
      "text": "I got the impression that each HN topic is biased towards an &quot;opinion theme&quot;. In other words, there seems to be a main opinion which is leading. This main opinion then shadows all the other opinions. Irrespective whether the opinion that &quot;won&quot; (by most up votes) is adequately nuanced or not.<p>Such opinions sometimes discard significant aspects of a topic.  Let&#x27;s call this particular notion short-sightedness or &quot;aspect blindness&quot;.<p>I suspect it is due to generational differences of the HNers. I also suspect it is due to the general &quot;availability&quot; of HNers. Meaning, one particular HNer who is able to consider more aspects of a given topic (be it due to experience, skill) is currently not there. Hence, other HNers who are perhaps less nuanced join in the discussion and if their bias matches the HN crowd&#x27;s bias, he (or less likely a she) wins.<p>Let me try to illustrate what I mean with these two notions:<p>The baby boomer generation generally has a different approach and mindset than succeeding generations (X, Y, Z).\nIt is much like the differences between rich and poor. Louis CK expressed this sentiment very well with his sketch on being broke:<p>https:&#x2F;&#x2F;youtu.be&#x2F;Y_-1l_SlA7c<p>It is basically due to less empathy or lack of experience and understanding that a person cannot sympathize with another person&#x27;s viewpoint and experience. At least, I think so.\nEthnicity, gender etc. are also shaping a person&#x27;s viewpoint and experience besides financial status and generation.<p>Now onto the second point. The point with the &quot;availability&quot; of HNers.\nI think this is largely self-explanatory, but let me give a hint what sparked me to come such as a &quot;speculation&quot;. My suspicion was caused by 2 recent posts.\nIn one post, I saw someone arguing that the term &quot;engineer&quot; is not appropriate for software people. Instead, the title &quot;engineer&quot; is for folks who are the &quot;real deal&quot;, meaning &quot;mechanical engineers&quot;, &quot;electrical engineers&quot; etc. Why? It is because they know physics and calculus. Okay, I paraphrased this in my own words, but he or (less likely a she) made that point more or less.<p>Then I saw another topic that discussed a YouTube privacy front-end (blocking ads and such) and the top comment made the argument it is unethical to use these as they block earnings for content creators. Why this person didn&#x27;t consider the other aspects, such as Google&#x27;s invasive privacy violations? (There are non-invasive ways to display ads, but apparently it isn&#x27;t mainstream yet.)\nIt is much like &quot;I have nothing to hide, so I don&#x27;t care about privacy. Father government will take care of me. I am in good hands.&quot;<p>Again, I am just wondering why there is no adequate nuance in the top comments.<p>Anyhow, this is my impression of HN. It is an impression, after all. Could be wrong, could be partially right, could be partially wrong, ...<p>I think HN needs more diversity in &quot;aspects&quot;, and perhaps more empathy and understanding for people with different backgrounds. IOW: less &quot;short-sightedness&quot;.<p>(If you down or up vote the comment, please consider a comment on why you did it. Thank you, I really appreciate criticism. I cannot read your minds, so perhaps explain to me why my notion is wrong. Thank you!)",
      "time": 1627039462,
      "title": "Tell HN: Aspect Blindness on HN",
      "type": "story"
    },
    {
      "by": "serenagray",
      "descendants": 0,
      "id": 27929470,
      "score": 1,
      "time": 1627039433,
      "title": "What are the best practices for Selenium Testing?",
      "type": "story",
      "url": "https://mywondr.co/p/9a279450-e63c-11eb-b996-d1c9f60ba22b"
    },
    {
      "by": "alexisdevs",
      "descendants": 1,
      "id": 27929463,
      "kids": [
        27929464
      ],
      "score": 1,
      "time": 1627039327,
      "title": "Angular 11 PDF Tutorial: Here’s How to Convert PDF to Image (JPEG/PNG)",
      "type": "story",
      "url": "https://www.bacancytechnology.com/blog/convert-pdf-to-image-in-angular-11"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27929462,
      "score": 1,
      "time": 1627039320,
      "title": "The Hipster PDA (2004)",
      "type": "story",
      "url": "http://www.43folders.com/2004/09/03/introducing-the-hipster-pda"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27929460,
      "score": 2,
      "time": 1627039314,
      "title": "How the Channel Tunnel Changed Europe Forever (2019)",
      "type": "story",
      "url": "https://edition.cnn.com/travel/article/channel-tunnel-anniversary/index.html"
    }
  ]
}