{
  "stories": [
    null,
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 30679319,
      "score": 1,
      "time": 1647296960,
      "title": "Work with FreeBSD in Google Summer of Code",
      "type": "story",
      "url": "https://freebsdfoundation.org/blog/work-with-freebsd-in-google-summer-of-code/"
    },
    {
      "by": "ceohockey60",
      "descendants": 0,
      "id": 30679286,
      "score": 1,
      "time": 1647296801,
      "title": "Dissecting the “Great Delisting”",
      "type": "story",
      "url": "https://interconnected.blog/dissecting-the-great-delisting/"
    },
    {
      "by": "musiciangames",
      "descendants": 0,
      "id": 30679274,
      "score": 1,
      "time": 1647296735,
      "title": "Anti-war protester interrupts Russian TV news show",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-60744605"
    },
    {
      "by": "songzme",
      "descendants": 0,
      "id": 30679249,
      "score": 1,
      "text": "I want to build something like repl.it but I don&#x27;t know what I need to know. How do I go about learning how to build something like repl.it where I could create server instances for every user and allow them to code on the browser?",
      "time": 1647296624,
      "title": "Ask HN: How to build something like Repl.it?",
      "type": "story"
    },
    {
      "by": "deweywsu",
      "descendants": 0,
      "id": 30679224,
      "score": 1,
      "text": "I have been programming since I was a small kid (started on a Radio Shack TRS-80 Color Computer).  I later became an Electrical Engineer, but for a big company, which many will tell you isn&#x27;t like being a professional engineer, or working at a small firm.  I&#x27;ve only programmed professionally a few times, many times as part of a job, but not as my main job.<p>As COVID seems to be wrapping up and people are going back to the office, it appears that many companies are reneging on their original stance of keeping people remote.<p>I have a good job that I&#x27;ve been at for 15 years, and am doing great there, but am really dismayed at coming back to the office.  Working from home has become a lifestyle for me, and it really gets me that executives, who enjoy mostly total autonomy in the execution of their duties, are mandating that the rest of us be tethered to the office again.  It seems many didn&#x27;t learn anything from COVID (or didn&#x27;t care) about people&#x27;s desire to work away from an office, or about the sense of lack of trust it creates to put them in the office unnecessarily.  If I want to &quot;collaborate&quot;, I won&#x27;t hesitate to call someone.  I don&#x27;t need to sit at a desk without walls under bright lights so I might feel like being talkative with a coworker one day.<p>I&#x27;m making the assumption that there are coding jobs that I can get 100% virtual work in - is that still a valid assumption?  What&#x27;s the best way for me to get ready for those jobs?  Am I being crazy trying to do this at 45?  I have kids and a house and a decent salary, although I just heard yet another story from a coworker about how their nephew got hired at Google for $300K.  Is that even close to possible?  If so, I&#x27;m in the wrong business.  How many people who go to coding camps succeed in job placement?  Just looking for any helpful answers on charting a new course.<p>Thanks",
      "time": 1647296509,
      "title": "Looking for remote: what's the best way into coding?",
      "type": "story"
    },
    {
      "by": "crackercrews",
      "descendants": 1,
      "id": 30679206,
      "kids": [
        30679227
      ],
      "score": 3,
      "time": 1647296405,
      "title": "What Happens When an Élite Public School Becomes Open to All?",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2022/03/14/what-happens-when-an-elite-public-school-becomes-open-to-all"
    },
    {
      "by": "cmhteixeira",
      "descendants": 0,
      "id": 30679189,
      "score": 3,
      "time": 1647296336,
      "title": "Concurrency Deep Dives: Building a Java timer/scheduler from scratch",
      "type": "story",
      "url": "https://cmhteixeira.com/concurrency/javaTimer.html"
    },
    {
      "by": "crummy",
      "descendants": 0,
      "id": 30679186,
      "score": 2,
      "time": 1647296319,
      "title": "Multiplayer Minesweeper",
      "type": "story",
      "url": "https://minesweeper.fly.dev/sessions"
    },
    {
      "by": "BOOSTERHIDROGEN",
      "descendants": 0,
      "id": 30679178,
      "score": 3,
      "time": 1647296272,
      "title": "The Benefits of Venture Capital in Web3",
      "type": "story",
      "url": "https://avc.com/2022/03/the-benefits-of-venture-capital-in-web3/"
    }
  ]
}