{
  "stories": [
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 27882284,
      "score": 1,
      "time": 1626700459,
      "title": "Quick Morning Rant: China vs America",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=HryiadpkssQ"
    },
    {
      "by": "felishiagreenn",
      "descendants": 0,
      "id": 27882282,
      "score": 1,
      "text": "I know a real professional hacker who has worked for me twice in the past one month. He is very good at hacking anything concerning database, phone, social media and even credit report fixes. He offers legit services. He also helps to retrieve accounts that have been taken by hackers. Contact him at cybergoldenhacker at gmail dot com",
      "time": 1626700434,
      "title": "Hacking Service",
      "type": "story"
    },
    {
      "by": "notoriousarun",
      "descendants": 0,
      "id": 27882272,
      "score": 1,
      "time": 1626700385,
      "title": "I Miss Rails",
      "type": "story",
      "url": "https://chanind.github.io/rails/2019/03/28/why-i-miss-rails.html"
    },
    {
      "by": "olvy0",
      "descendants": 0,
      "id": 27882270,
      "score": 1,
      "time": 1626700364,
      "title": "Microsoft FAQ Plus – free support chatbot based on Teams and Azure",
      "type": "story",
      "url": "https://github.com/OfficeDev/microsoft-teams-apps-faqplus"
    },
    {
      "by": "radmuzom",
      "descendants": 0,
      "id": 27882229,
      "score": 1,
      "time": 1626700088,
      "title": "The UK government's claims on bus deregulation (1984 vs. 2021) [pdf]",
      "type": "story",
      "url": "https://chrgj.org/wp-content/uploads/2021/07/UK-Bus-Comparison-Chart.pdf"
    },
    {
      "by": "entyphom",
      "descendants": 0,
      "id": 27882227,
      "score": 1,
      "text": "Most other jobs don&#x27;t ask you to perform a pale staged imitation of what your real job would be before they hire you.<p>We have resumes to prove our past work, and yet we keep having to prove we know how to implement fibonacci on a whiteboard or rediscover the wheel of sorting algorithms that are already implemented in the languages we use.<p>Technical interviews don&#x27;t even remotely reflect ability to do the job, at best they show that you can write basic code, which isn&#x27;t enough.<p>More importantly, for me the big flaws in those interviews are:<p>- They&#x27;re very susceptible to bad luck or bad days. Projects in real life don&#x27;t last an hour, sometimes you will do something easily and sometimes not. In interviews, a problem might be about an algorithm you know about, or about one you never heard of.<p>- It gives an edge to people who have time to do &quot;interview homework&quot;, which effectively means the best strategy for succeeding at interviews is to not be employed, and if you interview while still being employed you&#x27;re putting yourself at a disadvantage<p>- It makes some personality types more likely to succeed. Anyone who gets stressed &quot;performing&quot; in front of an audience will have more trouble. Reading a problem and finding a solution for it in real time for an audience during a test is very different from what people do on the job.<p>- It&#x27;s basically a school test. We&#x27;re not school children, we have resumes and past projects to attest of our ability to do our job (unless it&#x27;s your very first job obviously)<p>I am so tired of having to learrn linked list algorithms for big company interviews, or having to spend a week-end of my life to do a code test. Those things make it super hard to schedule interviews and tests around work too because it&#x27;s basically a second job, and makes it impossible to consider more than a small handful of companies at a time.<p>There are literally entire startups based around providing what is effectively homework to prepare for interviews, and they&#x27;re even sponsored by FAANG companies which literally expect you to practice their interview questions before going on the interview. It makes no sense.<p>Are there any companies that are starting to move away from that? Could we just collectively agree to just stop agreeing to those practices? Why is it considered normal for me to have to schedule a 2 hour technical interview in the middle of your current job&#x27;s workday?",
      "time": 1626700081,
      "title": "Why do programmers accept current technical interview practices?",
      "type": "story"
    },
    {
      "by": "kooskoos",
      "descendants": 0,
      "id": 27882205,
      "score": 1,
      "time": 1626699935,
      "title": "Anti Pattern: Constructor over Injection",
      "type": "story",
      "url": "https://jeffreypalermo.com/2010/01/constructor-over-injection-anti-pattern/"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 27882169,
      "score": 1,
      "time": 1626699748,
      "title": "Analog Fractals with 1930's Technology [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Pv26QAOcb6Q"
    },
    {
      "by": "remt",
      "descendants": 0,
      "id": 27882156,
      "score": 1,
      "time": 1626699633,
      "title": "Why introverts excelled at working from home",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20210713-why-introverts-excelled-at-working-from-home"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 27882133,
      "score": 1,
      "time": 1626699490,
      "title": "The Best-Selling Car in America, Every Year Since 1978",
      "type": "story",
      "url": "https://www.visualcapitalist.com/best-selling-car-in-america-every-year-since-1978/"
    }
  ]
}