{
  "stories": [
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 31144043,
      "score": 1,
      "time": 1650808708,
      "title": "The Book You Need to Read",
      "type": "story",
      "url": "https://perell.com/essay/the-book-you-need-to-read/"
    },
    {
      "by": "aphrax",
      "descendants": 0,
      "id": 31144006,
      "score": 1,
      "time": 1650808440,
      "title": "Waxy.org Turns 20",
      "type": "story",
      "url": "https://waxy.org/2022/04/waxy-org-turns-20/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31143988,
      "score": 1,
      "time": 1650808304,
      "title": "Bootstrappable Builds",
      "type": "story",
      "url": "https://bootstrappable.org/"
    },
    {
      "by": "sun_bear",
      "descendants": 0,
      "id": 31143968,
      "score": 1,
      "time": 1650808158,
      "title": "Ditch Your To-Do List and Use These Docs to Make More Impact",
      "type": "story",
      "url": "https://review.firstround.com/ditch-your-to-do-list-and-use-these-docs-to-make-more-impact"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31143941,
      "score": 1,
      "time": 1650808000,
      "title": "Store Nintendo Switch Screenshots in the Cloud",
      "type": "story",
      "url": "https://www.raymondcamden.com/2022/04/23/store-nintendo-switch-screenshots-in-the-cloud-using-pipedream"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 31143907,
      "score": 2,
      "time": 1650807730,
      "title": "Do Electronic Signs Displaying Number of Traffic Fatalities Cause More Crashes?",
      "type": "story",
      "url": "https://reason.com/volokh/2022/04/23/do-electronic-signs-displaying-number-of-traffic-fatalities-actually-cause-more-crashes/"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 31143893,
      "score": 2,
      "time": 1650807629,
      "title": "What Is a Major Chord?",
      "type": "story",
      "url": "https://www.jefftk.com/p/what-is-a-major-chord"
    },
    {
      "by": "wey-gu",
      "descendants": 0,
      "id": 31143877,
      "score": 1,
      "time": 1650807525,
      "title": "Xbin: getting missing utilities w/o installation(especially in containers)",
      "type": "story",
      "url": "https://github.com/xbin-io/xbin"
    },
    {
      "by": "Normille",
      "descendants": 1,
      "id": 31143847,
      "kids": [
        31143865
      ],
      "score": 1,
      "text": "I&#x27;m still looking round for an alternative to Google Workspace, when they get rid of the free tier for custom domains, in a month or so&#x27;s time.<p>My needs are pretty basic; I just want a reliable email service that I can run on my own domain, with a couple of addresses for family members. I&#x27;m not bothered about all the other business-related stuff. Privacy and encryption would be preferable, but not an absolute deal-breaker. Anything I want to discuss in private goes by encrypted messenger anyway, not email.<p>One must have is IMAP support. I run a load of email addresses [not all via Gmail or Google Workspaces] so  I want to be able to keep them all in the same place [Thunderbird] and not have to fire up different apps for different accounts.<p>So far, I&#x27;ve checked out most of the oft-recommended options; Protonmail, Tutanota, Mailbox, Mailfence, CTemplar, Runbox, Zoho, etc. and found that there were issues with most of them --whether this was lack of IMAP support, lack of Unicode support [Hello Runbox and Zoho. It&#x27;s 2022!] or just general uneasiness after reading customer reviews.<p>But, by far the biggest no-no with all of these services is that they charge for each separate email address. I have emails set up on my domain for the missus, and a couple of family members. So 4 in all. As each of these services charges per user, that effectively means quadruple the stated price for any of them. For amount of emails sent on the accounts --a handful a week at most, that ends up being prohibitively expensive, for the amount of usage.<p>Which brings me onto the 3 mentioned in the title.  Migadu[0], Postale[1] and MXroute[2] all charge by the amount of emails you send, not by the number of actual addresses you set up on the domain. Which seems a much fairer system. Especially for my use case.  So, unless anyone is aware of another option, I&#x27;m wavering between those three.<p>I still have some doubts though:<p>MIGADU --Probably the best known of this business model and the prices seem reasonable for what I want. But a quick read through their T&amp;Cs is pretty alarming.  Their Acceptable Use policy [3] pretty much says they can suspend your account without warning for a huge range of subjective reasons. Including:<p><pre><code>  &gt;Hate speech, racism, calls for violence, Nazism as well any other immoral, unethical or socially unacceptable activity will be denied service. If illegal, we will report such to the authorities.\n</code></pre>\nQuite apart from the fact that this implies that Migadu are scanning the content of every email that their users send; what the actual fuck is a bloody email server company doing, taking on the role of arbitrating what is &#x27;Nazi&#x27;, &#x27;immoral&#x27; or &#x27;socially unacceptable&#x27;?<p>This virtue signalling shite is really going too far these days. By all means take down accounts that are indulging in illegal activity, but otherwise just keep your noses the hell out of people&#x27;s private correspondence!<p>So, thats&#x27;s MIGADU ruled out.  Next up...<p>POSTALE --I didn&#x27;t actually find anything too egregious on the Postale website. But that was part of the problem. I couldn&#x27;t find any info about the company at all. ie. where are they based?.. where are their servers?.. etc?  Even on the company &#x27;About&#x27; page[4], all we get is mention of an unnamed &#x27;creator&#x27; and the only contact details are an email address. I have absolutely no idea where this company is based, or what size it is. For all I know, it could be some kid in his bedroom.  A bit dubious about entrusting my email to such an unknown entity.<p>MXROUTE --I hadn&#x27;t heard of these, til I saw a few recommendations on HN. On the face of it, it seems to be a good fit. I&#x27;m not afraid of a bit of setup and configuration.  However, I have noticed people complaining about the company&#x27;s &#x27;attitude&#x27; and, reading through their FAQs they do come across as pretty abrasive --even down to making a point of not offering refunds to anyone who signs up and doesn&#x27;t like the service.<p>CONT&#x27;D --&gt;",
      "time": 1650807389,
      "title": "Migadu? Postale? MXroute? Or Any Other Mail Services Using This Model?",
      "type": "story"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 31143820,
      "score": 2,
      "time": 1650807209,
      "title": "Microsoft has demonstrated the underlying physics required to new kind of qubit",
      "type": "story",
      "url": "https://www.microsoft.com/en-us/research/blog/microsoft-has-demonstrated-the-underlying-physics-required-to-create-a-new-kind-of-qubit/"
    }
  ]
}