{
  "stories": [
    {
      "by": "CobaltFire",
      "descendants": 0,
      "id": 31505489,
      "score": 1,
      "text": "Just got the following email:<p>Dear Proton Supporter,<p>As a Proton Visionary or Lifetime subscriber, we are honored to have your support for our mission to build a better internet where privacy is the default. With the rollout of the new Proton ecosystem and the continued unification of our privacy services this week, our shared vision of this better internet is closer to being realized.<p>You are a special group, and much of what Proton has achieved over the years would not have been possible without your endorsement and support. As a way of saying thanks, we’re making the following improvements to Proton Visionary and Lifetime accounts at no extra cost:<p>We’ve boosted your total storage to 3,000 GB to help you make the most out of Proton Drive. It also means you’ll never have to worry about email storage again.\nWe’ve increased the number of email addresses you can have to 100.\nEach of your users can now connect to our high-speed VPN on up to 10 devices.\nVisionary and Lifetime subscribers will continue to receive free access to the paid versions of all new privacy services we release in the future. You will also continue to receive early access to all future features and products at no extra cost.<p>Proton Visionary is a special plan for the strongest early supporters of our mission, and for this reason, we are no longer offering it. As the plan becomes more exclusive in the future, we will provide additional unique benefits and enhancements.<p>Your opinion matters, and we also prioritize your feedback when it comes to setting the future direction of Proton. Your support tickets have the highest priority and are addressed first. However, if you have thoughts, suggestions, or other feedback that you would like to share with us, we’ve created an email channel just for you at protonvision@proton.me.<p>We look forward to hearing from you and continuing to serve you.<p>Thank you again for your support and for joining us on this journey.<p>Best regards,<p>Dr. Andy Yen\nFounder &amp; CEO\nProton",
      "time": 1653490693,
      "title": "ProtonMail Sunsets Visionary",
      "type": "story"
    },
    {
      "by": "Melchizedek",
      "descendants": 0,
      "id": 31505441,
      "score": 1,
      "time": 1653490510,
      "title": "What Progress Wants – I saw the best minds of my generation",
      "type": "story",
      "url": "https://paulkingsnorth.substack.com/p/what-progress-wants"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 31505436,
      "score": 2,
      "time": 1653490478,
      "title": "A New World Health Organization Report Once Again Proves Sweden Right",
      "type": "story",
      "url": "https://ianmsc.substack.com/p/a-new-world-health-organization-report"
    },
    {
      "by": "mg",
      "descendants": 0,
      "id": 31505434,
      "score": 1,
      "time": 1653490476,
      "title": "Are generic domain names for new projects a good idea?",
      "type": "story",
      "url": "https://twitter.com/marekgibney/status/1529475751673724928"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31505433,
      "score": 1,
      "time": 1653490475,
      "title": "Gene-edited tomatoes could provide new source of Vitamin D",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01443-2"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 31505417,
      "score": 1,
      "time": 1653490382,
      "title": "The Rise of Cash App",
      "type": "story",
      "url": "https://digitalnative.substack.com/p/the-rise-of-cash-app-"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31505416,
      "score": 1,
      "time": 1653490380,
      "title": "Device and method for the autonomous bootstrapping of unified sentience",
      "type": "story",
      "url": "https://patents.google.com/patent/US20150379394A1/en"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31505412,
      "score": 1,
      "time": 1653490362,
      "title": "APFS in Detail: Data Integrity (2016)",
      "type": "story",
      "url": "http://dtrace.org/blogs/ahl/2016/06/19/apfs-part5/"
    },
    {
      "by": "firatcand",
      "descendants": 0,
      "id": 31505398,
      "score": 1,
      "text": "Hey everyone,<p>I&#x27;m one of the co-founders of Permify. We&#x27;re building open-source authorizations for better fine-grained systems.<p>We recently build Rego policy enforcer. It&#x27;s an open source tool that allows you easily create complex authorization policies. Supports RBAC, ABAC and resource filtering based on them.<p>You can basically;\n- Generate your complex authorization policy easily with code.\n- Export the rego (policy language for defining rules that are evaluated by the OPA engine) you created with the code.\n- Filter data based on your authorization logic.\n- Make decisions about multiple resources from one policy.\n- Get the details of the decisions made.\n- Add custom messages and handle decision messages.<p>Looking forward hear your feedback :)",
      "time": 1653490321,
      "title": "Show HN: Open-Source Rego Policy Enforcer for Open-Policy Agent(OPA)",
      "type": "story",
      "url": "https://github.com/Permify/policy-enforcer"
    },
    {
      "by": "jackcooper",
      "descendants": 1,
      "id": 31505392,
      "kids": [
        31505503
      ],
      "score": 1,
      "text": "I think the way we are taught could be greatly improved. What do you think? And what would be the ideal way to teach?<p>bad teaching examples from personal experience:\n---\n&gt;you have 1&#x2F;5 exercises wrong and therefore sit in 2 hour long exercise sessions waiting for that specific exercise to be solved. (20 students * 20% * 2h = 8h wasted)<p>&gt;lectures add no value or excitement to content. Most students learn it better and faster reading the script. video lectures are also very bad. You mainly go to the lectures for social interaction or a clear conscience.<p>&gt;a friend made a teaching internship in Uganda this winter: the kids have school for 15h a day. They didn&#x27;t learn anything, it was basically to keep them busy and increase the price for the girls when they are married off<p>There are many more and better examples, these are just from the top of my head. For me it is just so frustrating to see, especially for the other people. For example, there are physics lecture that were given for the past houndred years, how can my professor then give them in such a bad way that noone understands, but after a 1min youtube video, it is all clear.<p>I will apply for a TA position next semester. At some point in the future I (try&#x2F;)want to  create high-quality opensource content. In our time it makes no sense that thousands of professors give the same, but bad online lectures, all around the world. I could go on and on...<p>Thank you for your input and ideas",
      "time": 1653490295,
      "title": "Ask HN: How would you improve teaching?",
      "type": "story"
    }
  ]
}