{
  "stories": [
    {
      "by": "clubminsk",
      "descendants": 0,
      "id": 28682600,
      "score": 1,
      "time": 1632836141,
      "title": "Surprising Facts About Countries Where Americans Prefer to Outsource Development",
      "type": "story",
      "url": "https://marketingforit.com/market-research/top-software-outsourcing-countries"
    },
    {
      "by": "phonon",
      "descendants": 0,
      "id": 28682582,
      "score": 1,
      "time": 1632836091,
      "title": "Tesla Sues for Defamation over Social Media Posts",
      "type": "story",
      "url": "https://jalopnik.com/tesla-sues-for-defamation-over-social-media-posts-1847750963"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28682558,
      "score": 1,
      "time": 1632835981,
      "title": "AMD 4700S CPU Reviewed: Defective PS5 Chips Find New Life",
      "type": "story",
      "url": "https://www.tomshardware.com/news/amd-ryzen-4700s-desktop-kit-ps5-cpu-review"
    },
    {
      "by": "XzetaU8",
      "descendants": 0,
      "id": 28682549,
      "score": 2,
      "time": 1632835937,
      "title": "Sunlight exposure guidelines may need to be revised",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2021/09/210927150523.htm"
    },
    {
      "by": "tnuoccanrub",
      "descendants": 0,
      "id": 28682543,
      "score": 1,
      "text": "For the past couple of weeks, I&#x27;ve been suffering an absolute inability to be productive at work. I mean spending the whole day staring at the screen not writing a single line of code.<p>At first I thought it was a problem of attention, since I was being distracted by literally anything, from a text to street noise. But even removing all distractions and putting on some noise cancelling headphones won&#x27;t do the trick. I just feel... unable to start.<p>It&#x27;s a feeling that&#x27;s really difficult to explain. Like the feeling that keeps you from jumping into a swimming pool when you&#x27;re at the edge. I don&#x27;t find work unpleasant, not the tasks that I have in front of me difficult, and I&#x27;m not particularly bored, or tense, or anything. I just can&#x27;t do it.<p>Is this normal? Any of you have any idea about how to deal with this problem?",
      "time": 1632835904,
      "title": "Ask HN: Have you ever spend days unable to do *any* work?",
      "type": "story"
    },
    {
      "by": "vegetablepotpie",
      "descendants": 0,
      "id": 28682528,
      "score": 1,
      "time": 1632835821,
      "title": "Laurene Powell Jobs to invest $3.5B in climate group",
      "type": "story",
      "url": "https://news.yahoo.com/laurene-powell-jobs-invest-3-020040427.html"
    },
    {
      "by": "BoxOfRain",
      "descendants": 0,
      "id": 28682515,
      "score": 1,
      "text": "I suspect this idea has already appeared quite a bit on HN already, but I&#x27;d quite like to train a language model to detect language intended to persuade. The model would then be exposed via an API so that I could build a browser extension which would examine social media posts and mark them accordingly.<p>Quite apart from the expense I&#x27;ll incur training this model, I&#x27;m struggling to figure out a way of finding enough definitive propaganda to begin with given that it&#x27;s such a subjective topic. Ideally I&#x27;d use a wide variety of propaganda types such as advertising, political propaganda, social media comments plugging a given product or service, and other categories of propaganda. Is anybody here on HN aware of any collections of propaganda I can easily ingest in a machine-readable form or failing that, have any ideas of how I could go about constructing one myself?<p>This is purely a personal project with no desire for monetisation, I&#x27;m just curious to know how much of my browsing does actually consist of propaganda given it&#x27;s such a topic of discussion at the moment.",
      "time": 1632835746,
      "title": "Ask HN: Can anyone recommend a corpus of propaganda and other persuasive text?",
      "type": "story"
    },
    {
      "by": "imgabe",
      "descendants": 0,
      "id": 28682499,
      "score": 1,
      "time": 1632835663,
      "title": "Show HN: Expensive Taste – Guess which artwork sold for more",
      "type": "story",
      "url": "https://expensivetaste.art/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28682479,
      "score": 6,
      "time": 1632835528,
      "title": "Old coal plant is now mining Bitcoin for a utility company",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/09/old-coal-plant-is-now-mining-bitcoin-for-a-utility-company/"
    },
    {
      "by": "jankeromnes",
      "descendants": 0,
      "id": 28682477,
      "score": 7,
      "time": 1632835523,
      "title": "VS Code in the Browser for Everyone",
      "type": "story",
      "url": "https://www.gitpod.io/blog/openvscode-server-launch"
    }
  ]
}