{
  "stories": [
    {
      "by": "spyc",
      "descendants": 0,
      "id": 29830889,
      "score": 1,
      "time": 1641506349,
      "title": "uriparser 0.9.6 with security fixes released",
      "type": "story",
      "url": "https://blog.hartwork.org/posts/uriparser-096-with-security-fixes-released/"
    },
    {
      "by": "dgellow",
      "descendants": 0,
      "id": 29830864,
      "score": 1,
      "time": 1641506211,
      "title": "It's the Future (2015)",
      "type": "story",
      "url": "https://circleci.com/blog/its-the-future/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29830851,
      "score": 1,
      "time": 1641506136,
      "title": "Python ParamSpec Guide",
      "type": "story",
      "url": "https://sobolevn.me/2021/12/paramspec-guide"
    },
    {
      "by": "open-source-ux",
      "descendants": 0,
      "id": 29830839,
      "score": 1,
      "time": 1641506111,
      "title": "Chart of the day: Apple is the first $3trn company",
      "type": "story",
      "url": "https://www.newstatesman.com/chart-of-the-day/2022/01/how-apple-became-the-worlds-first-3trn-company"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 29830832,
      "score": 1,
      "time": 1641506068,
      "title": "Springer retracts hundreds of “nonsensical” articles",
      "type": "story",
      "url": "https://twitter.com/MicrobiomDigest/status/1478869782732570627"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 29830820,
      "score": 1,
      "time": 1641506046,
      "title": "FuzixOS",
      "type": "story",
      "url": "https://github.com/EtchedPixels/FUZIX"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29830796,
      "score": 1,
      "time": 1641505956,
      "title": "Salt-die/nurses_2: A widget and async-centric terminal graphics library",
      "type": "story",
      "url": "https://github.com/salt-die/nurses_2"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 29830789,
      "score": 1,
      "time": 1641505943,
      "title": "Hamming, Intro to the Art of Doing Science and Engineering: Learning to Learn",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=AD4b-52jtos"
    },
    {
      "by": "dazeandconfuse",
      "descendants": 0,
      "id": 29830770,
      "score": 5,
      "text": "Dear HN,<p>I&#x27;m working my first job out of college and I really enjoy it. I get to do fun computer vision stuff, write Rust, great pay, great benefits, short commute, etc. And my manager and her boss are both super smart.<p>However I&#x27;m a bit frustrated. I thought I was doing well - I&#x27;m working hard on the project I was assigned to, and it&#x27;s coming along nicely. The deadline was pushed back once (which that seems to be very common at this company), and the new deadline is still in the future.<p>Two weeks ago, my manager&#x27;s boss schedules a meeting with me and my manager. My manager is busy putting out a fire so it&#x27;s just me and the boss, and the boss made a bunch of criticisms of me that I&#x27;ve been thinking about and I can&#x27;t shake the feeling that they were largely unfair.<p>First, he basically tells me this project should have been finished a long time ago and he can&#x27;t believe it&#x27;s taken this long etc. I had no idea that he felt this way before the meeting - I&#x27;ve mostly just been working to get it done before the revised deadline my manager gave me.<p>He looks at the code and criticizes design decisions, some of which were made largely on my manager&#x27;s explicit suggestions. (When I bring this up, he says I probably just misinterpreted an offhand comment of hers as a hard requirement.)<p>Part of the reason it had taken so long is because I put a substantial amount of work into a part of the project that&#x27;s no longer necessary due to changing requirements, which I don&#x27;t think I could have forseen. I don&#x27;t think the boss appreciates that and just sees that the amount of usable output is low for the amount of time I&#x27;d been working.<p>He did also make some criticisms that I thought were fair. For instance he said I should have looked at other projects to see how they accomplished what I&#x27;m trying to do. That definitely would have been a good idea.<p>After our meeting, my manager and my boss had a meeting with just the two of them to discuss the status of our project. I have no clue what happened in that meeting and I haven&#x27;t heard anything about it from either of them since.<p>As of today the project is pretty much done (save for some procedural details). I&#x27;m happy, but I can&#x27;t stop thinking about that meeting. I really did work hard, and produced code which I feel is really above average for a fresh college graduate&#x2F;junior dev, and I feel like it&#x27;s completely unappreciated and my boss just thinks I took a really long time to produce really shit code.<p>I&#x27;m not thinking of quitting over this or anything, but it seriously bums me out. I don&#x27;t know if I have a future at this company if the boss thinks I&#x27;m not a good dev, and I really like it here. A month or so ago they added someone else to my project and I trained him on my code, and he&#x27;s super smart and capable, and I&#x27;m thinking that now they probably feel that they could fire me if they wanted and not lose much.<p>How should I proceed?",
      "time": 1641505866,
      "title": "Ask HN: My boss doesn't think I'm doing good work, how to proceed?",
      "type": "story"
    },
    {
      "by": "bobcostas55",
      "descendants": 0,
      "id": 29830743,
      "score": 2,
      "time": 1641505709,
      "title": "Quit Your Job",
      "type": "story",
      "url": "https://palladiummag.com/2022/01/06/quit-your-job/"
    }
  ]
}