{
  "stories": [
    {
      "by": "bendtheblock",
      "descendants": 0,
      "id": 30011885,
      "score": 1,
      "time": 1642699762,
      "title": "The Machine Stops (1909) [pdf]",
      "type": "story",
      "url": "https://www.cs.ucdavis.edu/~koehl/Teaching/ECS188/PDF_files/Machine_stops.pdf"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 30011872,
      "score": 2,
      "time": 1642699669,
      "title": "U.S. Dismisses Charges Against MIT Professor Accused of Hiding China Ties",
      "type": "story",
      "url": "https://www.wsj.com/articles/u-s-seeks-to-dismiss-criminal-charges-against-mit-professor-accused-of-hiding-china-ties-11642698761"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30011856,
      "score": 1,
      "time": 1642699586,
      "title": "JSON Awareness in the Curl Tool",
      "type": "story",
      "url": "https://github.com/curl/curl/wiki/JSON"
    },
    {
      "by": "jaredwiener",
      "descendants": 0,
      "id": 30011832,
      "score": 1,
      "time": 1642699514,
      "title": "Social Media Bans of Scientific Misinformation Aren't Helpful, Researchers Say",
      "type": "story",
      "url": "https://gizmodo.com/researchers-say-bans-on-scientific-misinformation-arent-1848385764"
    },
    {
      "by": "indus",
      "descendants": 0,
      "id": 30011831,
      "score": 3,
      "time": 1642699512,
      "title": "Google is building an AR headset",
      "type": "story",
      "url": "https://www.theverge.com/2022/1/20/22892152/google-project-iris-ar-headset-2024"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30011827,
      "score": 1,
      "time": 1642699504,
      "title": "TypeScript Compiler (By LLVM)",
      "type": "story",
      "url": "https://github.com/ASDAlexander77/TypeScriptCompiler"
    },
    {
      "by": "ecliptik",
      "descendants": 0,
      "id": 30011824,
      "score": 2,
      "time": 1642699501,
      "title": "CheriBSD – FreeBSD for Cheri-MIPS, Cheri-RISC-V, and Arm Morello ISAs",
      "type": "story",
      "url": "https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheribsd.html"
    },
    {
      "by": "nimbius",
      "descendants": 0,
      "id": 30011817,
      "score": 3,
      "time": 1642699464,
      "title": "Antimicrobial resistance now a leading cause of death worldwide, study finds",
      "type": "story",
      "url": "https://www.theguardian.com/society/2022/jan/20/antimicrobial-resistance-antibiotic-resistant-bacterial-infections-deaths-lancet-study"
    },
    {
      "by": "TrailMixRaisin",
      "descendants": 0,
      "id": 30011812,
      "score": 1,
      "text": "Some time ago I read about the idea to create an email account for small children and write them regular mails that they can read in the future (For example when turning 18). Additionally you can invite grandparents and other people to write for the child to get it in the future. Now I would like to have something like this for my children. Thinking about this showed me that there might be no good solution or that I am overthinking it. Here are what I was thinking about:<p>1. Using my own server. I have my own server where I can create a mail account and collect all mails. Its private and has &quot;unlimited&quot; storage if we speak about text and some photos. Only problem is, I might die before the children reaches the age. The contract for the server ends, all data gets deleted and the child may never get the mail. I would have to write a will and define how to handle the server. Combined with need to chance software, updates and chanced credentials I see the real risk that the documentation does not allow the designated handler to give access to my child. This seems like a worst case scenario. Dying before the child is of age and losing all the stuff I wrote form him&#x2F;her.<p>2. Using a freemailer. I could register an account at gmail or similar and collect the data there. The credentials are handled by me and are stored in my will to pass along if I die. If the service goes out of service I can backup and move the data. This solutions sound good, but I feel uncomfortable deciding for my child that this much and highly personal information is stored at someone processing it to make ads.<p>3. Using a specialized app like timespring. I found one app that offers a service to collect data and give access in the future. https:&#x2F;&#x2F;timespring.com&#x2F;features&#x2F; While I am comfortable paying for such an service it will be 2038 before I plan to give the child access to the system. This is longer that the iPhone is around so it seems unsafe to trust in an App being available 16 years in the future. Additionally it would be much harder for my parents to send data via this app.<p>Writing and thinking about that matter showed me again how little prepared we seem to be in the context of digital heritage. So if you have any other ideas to organize your digital stuff for the people after you I would be interested. Especially if there is some kind of PW management where I can define some elements that will be send to somebody else If I do not log in after x days.<p>Best trailmixraisin",
      "time": 1642699446,
      "title": "Ask HN: Sending mails for my children accessible in the future (",
      "type": "story"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 30011809,
      "score": 2,
      "time": 1642699435,
      "title": "Mayor Adams to Receive First Paycheck in Cryptocurrency with Coinbase",
      "type": "story",
      "url": "https://www1.nyc.gov/office-of-the-mayor/news/041-22/mayor-adams-receive-first-paycheck-cryptocurrency"
    }
  ]
}