{
  "stories": [
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 30460150,
      "score": 1,
      "time": 1645736093,
      "title": "Alibaba Posts Lowest Growth on Record After China Crackdown",
      "type": "story",
      "url": "https://www.caixinglobal.com/2022-02-25/alibaba-posts-lowest-growth-on-record-after-china-crackdown-101846597.html"
    },
    {
      "by": "gouggoug",
      "descendants": 0,
      "id": 30460141,
      "score": 1,
      "time": 1645736066,
      "title": "Cloudflare customer communication in regards to Ukraine conflict",
      "type": "story",
      "url": "https://imgur.com/BrDgtxq"
    },
    {
      "by": "ysnp",
      "descendants": 0,
      "id": 30460139,
      "score": 1,
      "time": 1645736063,
      "title": "F-Droid: how it weakens Android's security model",
      "type": "story",
      "url": "https://wonderfall.dev/fdroid-issues/"
    },
    {
      "by": "okintheory",
      "descendants": 1,
      "id": 30460122,
      "kids": [
        30460123
      ],
      "score": 1,
      "time": 1645735959,
      "title": "Spectral and Algebraic Graph Theory",
      "type": "story",
      "url": "http://cs-www.cs.yale.edu/homes/spielman/sagt/"
    },
    {
      "by": "kaladin-jasnah",
      "descendants": 0,
      "id": 30460120,
      "score": 2,
      "time": 1645735952,
      "title": "Pangolin desktop environment for Fuchsia and Linux written in Flutter",
      "type": "story",
      "url": "https://github.com/dahliaOS/pangolin_desktop"
    },
    {
      "by": "i386",
      "descendants": 0,
      "id": 30460072,
      "score": 1,
      "time": 1645735678,
      "title": "Apple rejected expedited app review over previously reviewed marketing materials",
      "type": "story",
      "url": "https://twitter.com/i386/status/1496949841590878211"
    },
    {
      "by": "iedufy",
      "descendants": 0,
      "id": 30460049,
      "score": 2,
      "text": "Hi Everyone,<p>I wanted to talk to this community about a particular story from my experience to see how the community feels. I have noticed that I have a lot of educated friends from top universities in my country who are having problems finding work due to a lack of experience, which has brought me to a conclusion that diplomas and CVs are not really good at conveying the knowledge someone has.<p>A friend of mine who is already working on his own company told me that he had trouble finding people to work for him, so I thought about an idea that I am currently incorporating into my app. Perhaps we could make it much easier for you to show your knowledge to companies, as easy as show and tell. A network of live knowledge feeds that constantly keep updating over time showing how someone has evolved.<p>If you know something, put it on full display for everyone to see, show something you have made and explain how you made something so that everyone can understand. If you are good at something, you probably won’t have a hard time explaining it to others, and other people could perhaps learn something by simply following your feed.<p>Educational Institutions have curriculums that aren’t really adaptable, but if we rely on people expressing their unique knowledge to the world, we can create countless combinations of curriculums that will be much more adaptable for the problems we have to face today.<p>I will be trying this approach with some friends over the coming days. My friends are looking for graphic designers, software engineers and music producers. They have established brands and are going to ask people who want to work with them to submit something they made and explain how they did it for everyone to see.<p>You are welcome to join us at EWS (<a href=\"https:&#x2F;&#x2F;edify.ws&#x2F;club&#x2F;10\" rel=\"nofollow\">https:&#x2F;&#x2F;edify.ws&#x2F;club&#x2F;10</a>). If this sounds like a good idea, maybe we can kick off a challenge that you can share with your friends to #ShowWhatYouKnow. If you have a company, are looking for employees, maybe you can ask people to show something they made and explain how they made it to see whether someone has the knowledge required to work for you.",
      "time": 1645735563,
      "title": "Show HN: A Network of Knowledge Feeds",
      "type": "story",
      "url": "https://edify.ws/club/10"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30460045,
      "score": 1,
      "time": 1645735542,
      "title": "Bilbr – Movie Recomendation Service",
      "type": "story",
      "url": "https://bilbr.com/#explore"
    },
    {
      "by": "oalders",
      "descendants": 0,
      "id": 30460003,
      "score": 1,
      "time": 1645735305,
      "title": "Finding Unused Perl Variables",
      "type": "story",
      "url": "https://www.olafalders.com/2022/02/22/finding-unused-perl-variables/"
    },
    {
      "by": "DougMellon",
      "descendants": 0,
      "id": 30460002,
      "score": 2,
      "time": 1645735296,
      "title": "How can I strengthen my resume to get a job in back end development? [pdf]",
      "type": "story",
      "url": "https://github.com/dougmellon/resume/blob/main/DougMellon_resume.pdf"
    }
  ]
}