{
  "stories": [
    {
      "by": "gogo_grep",
      "descendants": 0,
      "id": 30680792,
      "score": 1,
      "time": 1647307983,
      "title": "Ask HN: Why is no one talking about chain of trust based internet?",
      "type": "story"
    },
    {
      "by": "Stevvo",
      "descendants": 0,
      "id": 30680773,
      "score": 1,
      "time": 1647307784,
      "title": "Greenville County Schools gets first E-Bus",
      "type": "story",
      "url": "https://greenvillejournal.com/greenville-county-schools/greenville-county-schools-gets-first-e-bus/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30680767,
      "score": 1,
      "text": "I lived here for a couple of years and I thought the pandemic would hit pretty hard here eventually. But so far it hasn&#x27;t. I&#x27;m really surprised because it&#x27;s very densely populated, people don&#x27;t social distance (e.g queues will have less than 1m gap, and  rubbish day everyone basically moshes, and social distancing is not enforced) and life hasn&#x27;t changed much here. Everyone wears masks and uses the checkin apps and a whole lot of other measures like that. But there&#x27;s a large old population who live in some sort of retirement homes and there&#x27;s a lot of public transport. And vaccination rate is exceeded by places like Singapore and Hong Kong, but no large outbreaks, or death spikes, like in other places. And also we&#x27;re right across the water from mainland China so things are not really not different in terms of geography, urban planning culture (if anything is far less space here and everything&#x27;s more crowded than in an average mainland City), and so on... The one big difference is the lockdown measures have been far less severe here, if there can be said to have been a lockdown at all. And while we closed the borders at some point there&#x27;s been international flights and people coming and going as long as you have the proper paperwork basically throughout the entire duration. I&#x27;m so curious what the reasons might be and maybe it&#x27;s something that other places can replicate.",
      "time": 1647307730,
      "title": "Ask HN: Why Does Taiwan Have So Few Covid Cases?",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 30680749,
      "score": 2,
      "time": 1647307543,
      "title": "Why don’t cowbirds feed their chicks?",
      "type": "story",
      "url": "https://envirobites.org/2022/03/14/why-dont-cowbirds-feed-their-chicks/"
    },
    {
      "by": "nikolay",
      "descendants": 0,
      "id": 30680716,
      "score": 1,
      "time": 1647307204,
      "title": "A Russian jet that was hit by a missile over Ukraine and made it back to base",
      "type": "story",
      "url": "https://theaviationist.com/2022/03/14/russian-su-25-survived-manpads/"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 30680712,
      "score": 2,
      "time": 1647307181,
      "title": "U.S. Intelligence Says Putin Made a Last-Minute Decision to Invade Ukraine",
      "type": "story",
      "url": "https://theintercept.com/2022/03/11/russia-putin-ukraine-invasion-us-intelligence/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30680672,
      "score": 1,
      "time": 1647306765,
      "title": "“Alien Drone Swarm” Form Giant Hovering QR Code over Austin to Promote ‘Halo’",
      "type": "story",
      "url": "https://www.hollywoodreporter.com/tv/tv-news/halo-sxsw-drones-1235110882/"
    },
    {
      "by": "thangngoc89",
      "descendants": 0,
      "id": 30680645,
      "score": 2,
      "text": "Hi there,<p>We are deprecating the Vercel Free plan. On May 12, 2022, you will be automatically moved to our Pro Plan.<p>Our Pro Plan is $20 per user per month, includes up to 1TB of Bandwidth, and supports the ultimate development &amp; collaboration workflow. Of course, you can always change or upgrade plans by contacting us.<p>Your projects will be transferred to Pro with zero downtime. The only way this change will affect your project is if your application depends on Serverless Functions with timeouts longer than 60 seconds, or is dependent on being deployed to multiple regions—these options are not available for new deployments on the Pro plan.<p>Keep in mind—you&#x27;ll receive 1TB of bandwidth, 1TB of function execution, and 5,000 source images included in your plan. Concerned about overages? Learn more about pricing here.<p>Feel free to reply with any questions or read more about it here.<p>Happy Developing,\nThe Vercel Team",
      "time": 1647306579,
      "title": "Vercel free plan will be deprecated in May 2022",
      "type": "story"
    },
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 30680633,
      "score": 2,
      "time": 1647306472,
      "title": "Japanese company Serendix is 3D-printing houses in less than 24 hours",
      "type": "story",
      "url": "https://www.designboom.com/technology/serendix-3d-printed-house-24-hours-03-14-2022/"
    },
    {
      "by": "gotmedium",
      "descendants": 0,
      "id": 30680628,
      "score": 3,
      "time": 1647306461,
      "title": "U.S. Sewer Data Warns of a New Bump in Covid Cases",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-03-14/are-covid-cases-going-back-up-sewer-data-has-potential-warning"
    }
  ]
}