{
  "stories": [
    {
      "by": "YeBanKo",
      "descendants": 0,
      "id": 28389576,
      "score": 2,
      "text": "As a consumer, aren&#x27;t you terrified of Plaid account verification approach?<p>Some time ago I wanted to connect my bank account to my old Coinbase account, once I chose my bank I was prompted to enter my online banking username and password. They use the service called Plaid, that requires your bank credentials (and one time code if 2F is enabled) to verify your checking account. I was able to go with ACH deposit verification route as an alternative, but it is not default approach anymore.<p>This seems like a security and privacy nightmare.\nFirst, sharing your username and password is against the most basic principle we tell the users. Don&#x27;t share your password! Even a text message with the verification code says not to share it! I&#x27;d be surprised if this also does not violate terms of services for online banking.\nSecond, according to Plaid help pages they store credentials if bank does not provide an API. Ideally, banks themselves should not store unhashed passwords, let alone third party apps.\nThird, it is a privacy nightmare. With such unlimited scope, they scrape everything, your entire financial history is available. And this all for what? To instantly verify a bank account? Their help pages and some comments from the founders state that they don&#x27;t share&#x2F;sell your info without explicit permission. They aren&#x27;t now, but will they later? What if their monetization strategy changes? What if their new owner has a different view on privacy? Or I move to the state that has no CCPA analogue? Is it another service where I need to make sure to opt out of sharing and keep an eye on upcoming TS changes and wonder for how long they are going to keep my data?<p>I dug a little bit and discovered that Plaid is used by many in fintech: Coinbase, Robinhood, Venmo, Betterment, you name it. Maybe I was living under a rock for too long, but this password sharing practice did not use to be mainstream. I have or had accounts with some of them and I think deposit verification used to be the way few short years back.<p>I know the US banks don&#x27;t have any shared scoped authorization mechanism similar to OAuth2&#x2F;OpenID Connect and there is no easy way to instantly verify the account. ACH deposit can take a week. Though do you really need to fund  your Coinbase, Robinhood or Betterment account immediately, is a week later too late? Isn&#x27;t the whole spiel of Betterment and the likes that &quot;time in market&quot; &gt; &quot;time the market&quot;, so a week later would not matter for your retirement? Sure, this approach can be sensible in some narrow use case, when you indeed want them to have that unfettered access. But for the majority of consumers, I don&#x27;t see how it is worthy of forming such a dangerous habit. However, I almost am certain, for fintech services there is a significant drop in conversion and uptick in abandonment rate, when they need a customer to come back in few days to finish their account funding. Again, seems to be not enough for the industry to be complacent about it.<p>Note: this is not a critique of Plaid or other services, their security practices maybe excellent, their code reviewed, tested, audited by 3rd parties, etc and there is a limited scope when it is sensible, I am shocked that this becomes mainstream.",
      "time": 1630568398,
      "title": "Ask HN: Aren't you terrified of Plaid account verification approach?",
      "type": "story"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 28389575,
      "score": 1,
      "time": 1630568396,
      "title": "Air pollution could knock 9 years off the life of people in India, study says",
      "type": "story",
      "url": "https://edition.cnn.com/2021/09/02/india/india-air-pollution-life-expectancy-intl-hnk/index.html"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28389571,
      "score": 1,
      "time": 1630568327,
      "title": "Twitch Users Are Boycotting over Attacks Targeting Black,Queer,Disabled People",
      "type": "story",
      "url": "https://www.npr.org/2021/09/01/1032873942/twitch-boycott-hate-raid-attacks?t=1630568265322"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28389557,
      "score": 1,
      "time": 1630568079,
      "title": "Do fast-food chains still need dining rooms?",
      "type": "story",
      "url": "https://qz.com/2053967/do-fast-food-chains-still-need-dining-rooms/"
    },
    {
      "by": "emirb",
      "descendants": 0,
      "id": 28389545,
      "score": 1,
      "time": 1630567900,
      "title": "From 1m trees to a tree graveyard: how Dubai’s conservation plans went awry",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/aug/24/1m-trees-tree-graveyard-dubai-conservation-plans-desertification-real-estate"
    },
    {
      "by": "XzetaU8",
      "descendants": 0,
      "id": 28389540,
      "score": 1,
      "time": 1630567855,
      "title": "Analysis of Medicare data finds location matters, not just past health behavior",
      "type": "story",
      "url": "https://news.mit.edu/2021/seniors-relocate-longevity-0901"
    },
    {
      "by": "tempodox",
      "descendants": 0,
      "id": 28389534,
      "score": 1,
      "time": 1630567789,
      "title": "SQLiteStudio: Open-Source Cross-Platform SQLite GUI",
      "type": "story",
      "url": "https://sqlitestudio.pl"
    },
    {
      "by": "kulesh",
      "descendants": 0,
      "id": 28389530,
      "score": 1,
      "time": 1630567719,
      "title": "Nicely damaged photos of California I recovered from the dead hard-drive",
      "type": "story",
      "url": "https://opensea.io/collection/trueglitch"
    },
    {
      "by": "busymom0",
      "descendants": 0,
      "id": 28389517,
      "score": 1,
      "time": 1630567644,
      "title": "WHO says it is monitoring a new Covid variant called ‘mu’",
      "type": "story",
      "url": "https://www.cnbc.com/2021/09/01/who-says-it-is-monitoring-a-new-covid-variant-called-mu.html"
    },
    {
      "by": "mormegil",
      "descendants": 0,
      "id": 28389516,
      "score": 1,
      "time": 1630567620,
      "title": "Wikipedia Is Trying to Transcend the Limits of Human Language",
      "type": "story",
      "url": "https://slate.com/technology/2021/09/wikipedia-human-language-wikifunctions.html"
    }
  ]
}