{
  "stories": [
    {
      "by": "aleksiloytynoja",
      "descendants": 0,
      "id": 29236663,
      "score": 1,
      "text": "I have struggled to find my place in DAOs.<p>It&#x27;s great that these orgs are open and flexible. I love the principle that everybody can contribute and join according to their skills and availability. Community-led development is a great strength – just look at Aave, Uniswap... and it&#x27;s easy to understand how great of an asset community empowerment can be to any organization.<p>However, in my opinion, it&#x27;s much easier to get going with &quot;normal companies&quot; than DAOs. The main differences:<p>- *Org. Structure:* DAOs are flexible, in good and bad. While it enables more permissionless work and collaboration between online strangers, flexibility makes it harder to understand which kind of opportunities each org is offering. With LLCs, you can expect to find full-time employment opportunities – not that simple with DAOs.\n- *Processes:* For us in startups&#x2F;crypto, the word &#x27;process&#x27; sounds obviously pretty bad. However, it has its pros, too – when there are some processes in place (say, in recruitment), you know who to contact (HR person) and what to expect (standard hiring process). Not the same with DAOs – there may be no clear points of contact and a messy or non-existing process for contributor onboarding.\n- *Prof. Reputation:* In LLC, you can expect that good performance creates you new opportunities within an org, and promotions have a general, positive influence on your future career prospects, too. With a fluid DAO structure, even though you may get a chance to take on plenty of responsibility early on, it&#x27;s hard to transfer the reputation you&#x27;ve generated in one org to another. Result: it&#x27;s a similar grind every time you want to gain a meaningful role in a new DAO, regardless of your expertise. Opportunities may be divided based on factors like Discord activity – making the process very inefficient and also unfair (esp for us non-Americans who are online in a different time than majority of DAO people...)<p>So, the answer for the headline&#x27;s question today is (or at least has been for myself): pure grinding, hoping that you&#x27;re in the right place at the right time. And it applies again and again to every single org you want to engage with.<p>I felt this so frustrating that I decided to team up with my co-founder a while ago to build a better solution. We founded Kleoverse (https:&#x2F;&#x2F;www.kleoverse.com) to make it seamless to discover DAOs and understand working opportunities in them. We gather together all relevant DAOs and provide an easy explanation on how to get involved with each of them. In the future, we also aim at helping you to build your Web3-native professional portfolio. Goal: enable you to showcase your DAO-reputation and take it from one org to another, so that you can fully focus on working on meaningful and challenging projects.<p>If you find it interesting, sign up for an early access today",
      "time": 1637035473,
      "title": "How to become a core contributor in a DAO?",
      "type": "story"
    },
    {
      "by": "diaphanous",
      "descendants": 0,
      "id": 29236659,
      "score": 2,
      "time": 1637035455,
      "title": "The Rise and Fall of Gonzo Journalism",
      "type": "story",
      "url": "https://quillette.com/2021/11/11/high-white-notes-a-review/"
    },
    {
      "by": "okfine",
      "descendants": 0,
      "id": 29236648,
      "score": 2,
      "time": 1637035346,
      "title": "How 12th-century Genoese merchants invented the idea of risk",
      "type": "story",
      "url": "https://psyche.co/ideas/how-12th-century-genoese-merchants-invented-the-idea-of-risk"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 29236592,
      "score": 2,
      "time": 1637034836,
      "title": "The harmonious US city run by Muslim Americans",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-59212355"
    },
    {
      "by": "holonomically",
      "descendants": 0,
      "id": 29236576,
      "score": 1,
      "time": 1637034738,
      "title": "What Arthur Schopenhauer learned about genius at the asylum",
      "type": "story",
      "url": "https://psyche.co/ideas/what-arthur-schopenhauer-learned-about-genius-at-the-asylum"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 29236555,
      "score": 1,
      "time": 1637034529,
      "title": "How Your Family Tree (and DNA) Could Catch a Killer",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/11/22/how-your-family-tree-could-catch-a-killer"
    },
    {
      "by": "Bondi_Blue",
      "descendants": 0,
      "id": 29236534,
      "score": 1,
      "time": 1637034359,
      "title": "Herrie: A Minimalistic Music Player",
      "type": "story",
      "url": "https://github.com/EdSchouten/herrie"
    },
    {
      "by": "peter_d_sherman",
      "descendants": 1,
      "id": 29236526,
      "kids": [
        29236547
      ],
      "score": 1,
      "time": 1637034295,
      "title": "List Of All Cybersecurity Conferences 2021 – 2022",
      "type": "story",
      "url": "https://infosec-conferences.com/"
    },
    {
      "by": "dkinaev",
      "descendants": 0,
      "id": 29236522,
      "score": 1,
      "time": 1637034253,
      "title": "I made a rapid Pitch Deck creation tool with analytics – and no drag+drop",
      "type": "story",
      "url": "https://www.venturepredict.com/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29236517,
      "score": 1,
      "time": 1637034213,
      "title": "ELF Science Part 1",
      "type": "story",
      "url": "https://greatergoodest.github.io/post/elf_science_p1/"
    }
  ]
}