{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27812576,
      "score": 1,
      "time": 1626109955,
      "title": "Chipmakers Getting Serious About Integrated Photonics",
      "type": "story",
      "url": "https://semiengineering.com/chipmakers-getting-serious-about-integrated-photonics/"
    },
    {
      "by": "noahanee",
      "descendants": 0,
      "id": 27812565,
      "score": 3,
      "text": "Hey HN, This is Sefa, Michael and Stephen of Suplias. Suplias is a B2B marketplace where mom and pop stores in Africa buy inventory directly from manufacturers using a mobile app.<p>The retail market in Africa is informal and fragmented with 13M independently owned mom and pop stores contributing 90% of the market. To play in the $180B food and beverages market, you have to reach each mom and pop store separately. Meanwhile, mom and pop stores have to lock their stores, travel up to 20 miles and visit multiple wholesalers to buy inventory. This buying experience is stressful, takes hours, and results in a 15% loss of revenue to the store owner.<p>We are 3 co-founders with experience in supply chain and e-commerce. Sefa led GB Foods, as the Business Development Director in Nigeria, to build a retail network of 130k retail stores. Michael was the Commercial Director for Fashion of Jumia in Nigeria. While working with Procter &amp; Gamble, we (Sefa and Michael) saw how mom and pop stores face barriers to getting inventory. We built a manual selling operation to deliver products to mom and pop stores. The problem was that we could only sell products manufactured by our employer, a single manufacturer, while mom and pop stores owners kept asking for product variety across various manufacturers.<p>Sefa saw an ad about Amazon Dash where individuals could just push a button and home care products would be replenished by Amazon. This experience kept Sefa awake all night wondering if such a concept will work for mom and pop stores in Africa. Sefa called Stephen his friend who is a software engineer and convinced him to build an Android app to test if mom and pop stores will be willing to place orders via a mobile app. In parallel, Sefa called Michael, who was in Stanford GSB at the time and urged him to come back so they could transform Africa with the &quot;big idea&quot; :) In 4 weeks, we spoke to 50 mom and pop stores, 30 had smartphones out of which 20 agreed to place their orders on the app. This experiment led us to quit our jobs and focus on building Suplias.<p>To use Suplias, mom and pop stores sign up with their phone number on a progressive web app. (Since we figure most of you probably don’t have Nigerian phone numbers, we made a demo so you can see how it works: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=R3Wpx2G6W_k\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=R3Wpx2G6W_k</a>.) They place orders for products listed by manufacturers, and get the products delivered within 24 hours. Manufacturers list products and ship physical inventory to Suplias distribution center, where independent delivery associates pick up orders and deliver to stores.<p>We differentiate ourselves by having the most variety for packaged food and guaranteed next day delivery. Order delivery and consistent availability of inventory are actually more important than lower prices to mom and pop stores.<p>We make money via commissions from manufacturers and $1.25 delivery fees from mom and pop stores. In Africa, mom and pop stores don&#x27;t pay delivery fees for orders from a single manufacturer. We are able to charge for delivery because we deliver products from multiple manufacturers.<p>Beyond the market size, helping small businesses like mom and pop stores thrive has an impact on the African economy in an inclusive way. 70% of our customers are mothers who are the primary source of income for their families. We believe using technology to solve the problems mom and pop stores face is a step towards increasing the standard of living of families in Africa.<p>Thanks for reading. We will be super excited to get your thoughts &#x2F; feedback in the comments below especially if you have experience in the marketpace, Logistics or SMB space.<p>Best regards\nSefa, Michael, Stephen",
      "time": 1626109908,
      "title": "Launch HN: Suplias (YC S21) – B2B inventory for mom and pop stores in Africa",
      "type": "story"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 27812549,
      "score": 1,
      "time": 1626109827,
      "title": "Trash talk: Are waste-to-energy plants a sustainable solution?",
      "type": "story",
      "url": "https://www.csmonitor.com/Environment/2021/0712/Trash-talk-Are-waste-to-energy-plants-a-sustainable-solution"
    },
    {
      "by": "pepys",
      "descendants": 0,
      "id": 27812532,
      "score": 1,
      "time": 1626109743,
      "title": "Walking Shadows: the actors who first brought Shakespeare’s characters to life",
      "type": "story",
      "url": "https://www.laphamsquarterly.org/roundtable/walking-shadows"
    },
    {
      "by": "the_decider",
      "descendants": 0,
      "id": 27812530,
      "score": 1,
      "time": 1626109734,
      "title": "Researchers Develop CNN to Determine Which Correlations Are Most Important",
      "type": "story",
      "url": "https://www.marktechpost.com/2021/07/10/cornell-and-harvard-university-researchers-develops-correlation-convolutional-neural-networks-ccnn-to-determine-which-correlations-are-most-important/"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 27812523,
      "score": 1,
      "time": 1626109709,
      "title": "Company sells passports to Americans looking for tax breaks on Bitcoin profits",
      "type": "story",
      "url": "https://www.cnbc.com/2021/07/11/plan-b-passport-tax-break-bitcoin-profits.html"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 27812522,
      "score": 1,
      "time": 1626109707,
      "title": "State of the Haskell Ecosystem",
      "type": "story",
      "url": "https://github.com/Gabriel439/post-rfc/blob/master/sotu.md"
    },
    {
      "by": "s3rgio",
      "descendants": 0,
      "id": 27812507,
      "score": 2,
      "time": 1626109612,
      "title": "Google 2FA Vulnerable Code",
      "type": "story",
      "url": "https://sergiogiucastro.medium.com/google-2fa-vulnerable-code-aa2af8b93ecd"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 27812494,
      "score": 1,
      "time": 1626109529,
      "title": "Study reveals ways to preserve employee morale during cost-cutting",
      "type": "story",
      "url": "https://news.wsu.edu/2021/07/12/study-reveals-ways-preserve-employee-morale-cost-cutting/"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 27812489,
      "score": 1,
      "time": 1626109514,
      "title": "Ron Paul Wants to Abolish the CIA; His Largest Donor Builds Toys for It (2012)",
      "type": "story",
      "url": "https://www.thenation.com/article/archive/ron-paul-wants-abolish-cia-his-largest-donor-builds-toys-it/"
    }
  ]
}