{
  "stories": [
    {
      "by": "reteltech",
      "descendants": 0,
      "id": 28146052,
      "score": 1,
      "time": 1628707782,
      "title": "Perception Sensor Breakdown: FarmWise FT35 Robotic Weeder",
      "type": "story",
      "url": "https://www.tangramvision.com/blog/sensing-breakdown-farmwise-ft35"
    },
    {
      "by": "scottydelta",
      "descendants": 0,
      "id": 28146051,
      "score": 1,
      "time": 1628707774,
      "title": "Pfizer’s Shares Record All-Time High with Covid-19 Vaccine Showing Great Success",
      "type": "story",
      "url": "https://blog.quantale.io/pfizers-shares-record-all-time-high-with-covid-19-vaccine-showing-great-success/"
    },
    {
      "by": "berkozer",
      "descendants": 0,
      "id": 28145998,
      "kids": [
        28145999
      ],
      "score": 1,
      "text": "Hi HN, we’re SenpAI.GG (<a href=\"https:&#x2F;&#x2F;senpai.gg&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;senpai.gg&#x2F;</a>). We help gamers get better by providing real-time, personalized suggestions and feedback before, during, and after games.<p>It takes a lot of time and effort to become good at popular games. Even after learning a game, you need to stay updated and adapt your gameplay to meta changes (game updates). We’ve developed a desktop application to accelerate your learning curve, as well as easily adjusting your gameplay as games get updated. We provide personalized recommendations before the game to set up strategies, give instant notifications and feedback while playing the game, and detailed post-game analysis to improve your gameplay. We follow the guideline of the game publishers and do not share any information or suggestion that is not available on the screen of the player to make sure that we are not providing any unfair competitive advantage. We consider SenpAI as a friend sitting next to the gamers and makes recommendations based on the data they see.<p>Our Desktop application is now available (beta) for League of Legends, VALORANT and TFT. It&#x27;s free to use SenpAI.GG, however we have plans to launch a freemium business model inspired by popular video games. Basically, gamers will need to subscribe to unlock certain features and remove ads.<p>League of Legends players need to pick the champions, runes and items just before they start a match and play. We provide champions, runes and items suggestions to improve their winning probability. Our recommendations can be imported to the game with a single click. We provide some tags pinpointing the game characteristics of opponents and teammates. For example, we have an &quot;Early Ganker&quot; tag for the gamers who tend to gang in the early game. After the match, gamers can take a look at their strengths and weaknesses. For instance, we provide a tag of &quot;Early Game Gold Loss&quot; for a gamer whose gold&#x2F;minutes ratio is significantly less than the lane opponent in early game). We provide these tags based on only publicly accessible data on the official game publisher API. For example, any gamer can search for the opponents’ game data and conduct a similar analysis.<p>In the case of sports, the best analogy would be an ‘analyst’ or a ‘personal performance coach&#x27; that provides some training and insights about the opponents based on the publicly accessible data. We’re available for all players that want to use our product and make recommendations to each of them using only their own private data and public data.<p>For VALORANT, we have a Voice Assistant. For example, we start a counter when a spike  (Spike is a type of &quot;bomb&quot; with 45 second detonation time.) is planted and provide verbal notifications (10 seconds, 7 seconds, etc..). For healer agents, we notify the gamers if any of the teammate&#x27;s HP is low. This information is already available on the screen (health bars) but we provide an extra verbal notification. During the match, we don’t provide any information about the opponent. An approximate analogy to, say, chess might be that we tell about the chess clock and provide verbal notifications about time spent while the player is thinking.<p>We have a Desktop application (built on Electron.js) and a web application. We have two sources of data. We have access to the official API of game developers (specifically Riot Games) and we utilize computer vision to extract information from the game in real-time. For League of Legends, we trained a deep learning model to predict the results of matches. We provide pre-game suggestions to maximize the winning probability of this model.<p>We would love to hear what you think about our application. You can download the app from <a href=\"https:&#x2F;&#x2F;senpai.gg&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;senpai.gg&#x2F;</a> (currently available for Microsoft Windows) or try our web application at <a href=\"https:&#x2F;&#x2F;app.senpai.gg&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;app.senpai.gg&#x2F;</a>. We will be here today to answer any questions and hear your feedback in the comments!",
      "time": 1628707497,
      "title": "Launch HN: Senpai.gg (YC S21) – Personal gaming coach for PC gamers",
      "type": "story"
    },
    {
      "by": "redm",
      "descendants": 0,
      "id": 28145995,
      "score": 1,
      "time": 1628707478,
      "title": "New ‘Jeopardy ’ Hosts Are Mike Richards and Mayim Bialik",
      "type": "story",
      "url": "https://www.wsj.com/articles/mike-richards-and-mayim-bialik-named-the-new-jeopardy-hosts-11628703686"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 28145951,
      "score": 1,
      "time": 1628707261,
      "title": "AT&T delays 500k fiber-to-the-home builds due to severe fiber shortage",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/08/att-delays-500000-fiber-to-the-home-builds-due-to-severe-fiber-shortage/"
    },
    {
      "by": "el1t1st",
      "descendants": 1,
      "id": 28145947,
      "kids": [
        28145948
      ],
      "score": 1,
      "time": 1628707245,
      "title": "A Journey from JavaScript and TS,to Rescript/React, via Elm,OCaml,Haskell",
      "type": "story",
      "url": "https://alex.kleydints.com/a-journey-from-javascript-and-typescript-to-rescript-react-via-elm-ocaml-haskell-c878867b6fe6?sk=bd66221715d74528c2bf65513e929110"
    },
    {
      "by": "CloudOptimize",
      "descendants": 0,
      "id": 28145940,
      "score": 1,
      "text": "Most organizations face larger than estimated bills within months of cloud adoption. From our observations in the trenches, top reasons why the Cloud costs go haywire:<p>https:&#x2F;&#x2F;cloudoptimize.io&#x2F;3-reasons-why-cloud-costs-go-haywire&#x2F;",
      "time": 1628707210,
      "title": "Why do Cloud costs go Haywire?",
      "type": "story"
    },
    {
      "by": "spfzero",
      "descendants": 0,
      "id": 28145918,
      "score": 2,
      "time": 1628707122,
      "title": "Because I Am Bored",
      "type": "story",
      "url": "https://www.antipope.org/charlie/blog-static/2021/05/because-i-am-bored.html"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28145914,
      "score": 1,
      "time": 1628707099,
      "title": "It's wonderful that code written for Windows 3.1 still works well today",
      "type": "story",
      "url": "https://www.theregister.com/2021/08/11/column_cyberbanana_windows/"
    },
    {
      "by": "iximiuz",
      "descendants": 0,
      "id": 28145907,
      "score": 1,
      "time": 1628707060,
      "title": "Cracking Kubernetes Node Proxy (a.k.a. kube-proxy)",
      "type": "story",
      "url": "https://arthurchiao.art/blog/cracking-k8s-node-proxy/"
    }
  ]
}