{
  "stories": [
    {
      "by": "jrepinc",
      "descendants": 0,
      "id": 30190510,
      "score": 1,
      "time": 1643880861,
      "title": "Microsoft swallows up Activision, a further concentration of power",
      "type": "story",
      "url": "https://walledculture.org/beyond-a-game-microsoft-swallows-up-activision-a-further-concentration-of-power-in-a-few-digital-giants/"
    },
    {
      "by": "washedup",
      "descendants": 0,
      "id": 30190503,
      "score": 1,
      "time": 1643880752,
      "title": "Biggest Texas Bitcoin Miner Shuts Down Ahead of Cold Blast",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-02-02/biggest-bitcoin-miner-in-texas-will-shut-for-cold-blast-if-asked"
    },
    {
      "by": "techjolt",
      "descendants": 0,
      "id": 30190494,
      "score": 1,
      "text": "Arid Viper, an advanced persistent threat (APT) group, has launched a new campaign aimed at Palestinian organizations and activists.<p>The hacker gang, which is thought to be based in Gaza – a center of conflict and tension between Israel and Palestine –targets organizations all over the world, but currently appears to be focusing on groups involved in Palestinian politics.",
      "time": 1643880682,
      "title": "Arid Viper hackers attack Palestinian organizations and activists",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30190490,
      "score": 2,
      "time": 1643880653,
      "title": "Meta estimates Apple's iOS changes will cost it $10B in 2022",
      "type": "story",
      "url": "https://www.zdnet.com/article/meta-estimates-apples-ios-changes-will-cost-it-10b-in-2022/"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 30190481,
      "score": 2,
      "time": 1643880579,
      "title": "Google Sponsors Wagtail CMS's",
      "type": "story",
      "url": "https://finance.yahoo.com/news/google-sponsors-wagtail-cmss-next-115800283.html"
    },
    {
      "by": "valzevul",
      "descendants": 0,
      "id": 30190473,
      "score": 2,
      "time": 1643880460,
      "title": "A Methodology for Normalizing Safety Statistics of Partially Automated Vehicles",
      "type": "story",
      "url": "https://engrxiv.org/preprint/view/1973/3986"
    },
    {
      "by": "JunaidBhai",
      "descendants": 1,
      "id": 30190464,
      "kids": [
        30190467
      ],
      "score": 3,
      "text": "Hello HN&#x27;ers,<p>I’m Junaid Ansari &amp; along with Amin Memon, I have co-founded Draftss.com<p>Draftss is a Graphic Design &amp; Code subscription to help businesses with on-demand graphic design &amp; code requests without spending a huge amount of money on hiring designers &amp; saving tons of time.<p>2021 started in the most unusual fashion for all of us as we had to face some additional challenges bestowed on us by the covid pandemic. It came at the worse of times but we converted every obstacle into opportunity &amp; made the most of it in the best possible way.<p>Here is some crazy stuff that happened with us in 2021:<p>- We almost doubled our revenue from $100k to $180k ARR<p>- We automated our entire productized business &amp; now work only 1 hour a day!<p>- Created more than 10,000 designs &amp; revisions for our clients<p>- Worked with loads of new brands<p>- Went from 1st page in SEO to the 7th page<p>Everything that went wrong:\nWe faced a few setbacks because of many things that happened. Some of them were due to our own errors while some of them were not under our control. The best part is, I learned through them &amp; now we have transformed ourselves to not repeat those mistakes again.<p>We didn’t focus on our SEO enough which cost us dearly. It was too late before we realized it as most of the keywords we were ranking for dropped in SERP from 4th to 50th. For a few of our main keywords, we went from the first page to the 7th page. We tried to figure out what was going wrong but eventually failed. Another thing that follows with poor SEO is poor social presence. I had my own reasons for not signing up on Instagram or Facebook as there is a lot of unnecessary abuse on Social Media. I am still unclear about the idea of using Social Platforms for my business but it surely holds value to improve the overall SEO game.<p>I never really sensed the urge to hire a person to take care of SEO before 2021. This year, we are setting up a dedicated team to handle SEO &amp; Social Media. We shall start with LinkedIn as it is the most professional platform and then gradually move towards Facebook, Twitter &amp; Instagram.<p>Every Draftss customer wants their task to be completed at the fastest pace possible. One of the feedbacks we received was that our service felt slow to a few customers. At Draftss the time taken for every task to be completed is pre-decided but we had to fasten up for the urgency of our customers. If we try to do stuff very fast, the quality suffers. If we focus on quality, time suffers. We worked thoroughly on SOP when designing &amp; managing briefs to optimize time at all possible places to give the best results in record time. The bright side of this issue is that now we have a fast service in the market with of course keeping quality in mind.<p>It is always a great feeling when you add more people to your business. I hired tons of people this year as my business flourished. The downside of hiring is that sometimes you end up hiring inefficient people who can’t help you but instead be a liability at times. Getting the right talent is the key to success. After deep evaluation now we have gathered our A-Team.<p>At one moment I thought it would be better to outsource all our work. It would’ve saved all our efforts in hiring, training &amp; retaining the team. We looked out for companies that could provide such services &amp; we found none. It won’t work out for any business that gets varying amounts of work every week or month. The bright side of this experiment is that we got more serious in the hiring process &amp; added only highly efficient people to our team. It helped us in increasing our business because we all were in the same boat.",
      "time": 1643880389,
      "title": "Show HN: I automated my productized service and made $180k last year",
      "type": "story"
    },
    {
      "by": "mpweiher",
      "descendants": 0,
      "id": 30190460,
      "score": 1,
      "time": 1643880368,
      "title": "Me on App Store Monopolies and Security",
      "type": "story",
      "url": "https://www.schneier.com/blog/archives/2022/02/me-on-app-store-monopolies-and-security.html"
    },
    {
      "by": "benhoyt",
      "descendants": 0,
      "id": 30190436,
      "score": 1,
      "time": 1643880191,
      "title": "Optimizing GoAWK with a bytecode compiler and virtual machine",
      "type": "story",
      "url": "https://benhoyt.com/writings/goawk-compiler-vm/"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30190432,
      "score": 2,
      "time": 1643880162,
      "title": "Impossible to prevent children from ingesting microplastics",
      "type": "story",
      "url": "https://www.eurekalert.org/news-releases/941768"
    }
  ]
}