{
  "stories": [
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29530407,
      "score": 1,
      "time": 1639323283,
      "title": "Rails 7, Railties, and Sorbet at Shopify with Rafael França from Rails Core",
      "type": "story",
      "url": "https://share.transistor.fm/s/70d76807"
    },
    {
      "by": "squidhunter",
      "descendants": 0,
      "id": 29530400,
      "score": 1,
      "time": 1639323246,
      "title": "Sending SMS Messages Through the ISS",
      "type": "story",
      "url": "https://www.kj7nzl.net/blog/sending-sms-messages-through-iss/"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 29530399,
      "score": 1,
      "time": 1639323245,
      "title": "Writing Eleanor Rigby",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/10/25/paul-mccartney-writing-eleanor-rigby-beatles"
    },
    {
      "by": "Nerks234",
      "descendants": 0,
      "id": 29530391,
      "score": 2,
      "text": "I’m a bootstrapped founder of a SaaS product, working with an agency run by an ex-colleague of mine for development. The existing infrastructure is a React&#x2F;Node&#x2F;GraphQL FE + BE deployed via an ECS container on AWS.<p>We’re looking to make a pivot into a new product with a new infrastructure, and would like to make use of boilerplate as much as possible to focus on the core of what will be the MVP. That means not building from scratch the following elements:\n- Auth\n- Payments\n- Hosting for FE + BE\n- Database<p>We want to continue with our current tech stack on the FE + BE(React&#x2F;Node). I’ve love to know people’s recommendations and what they’ve found to work in the past.",
      "time": 1639323208,
      "title": "What would be your choice for setting up a new SaaS project for 2022?",
      "type": "story"
    },
    {
      "by": "domrdy",
      "descendants": 0,
      "id": 29530383,
      "score": 1,
      "time": 1639323179,
      "title": "Coding Bootcamps: Are They Worth the Hype?",
      "type": "story",
      "url": "https://codesubmit.io/blog/coding-bootcamps/"
    },
    {
      "by": "vorgeat",
      "descendants": 0,
      "id": 29530370,
      "score": 1,
      "time": 1639323107,
      "title": "J’accuse Macron et Castaner de crimes contre l’Humanité – Anti-K",
      "type": "story",
      "url": "https://www.anti-k.org/2019/02/15/jaccuse-macron-et-castaner-de-crimes-contre-lhumanite/"
    },
    {
      "by": "elvis70",
      "descendants": 0,
      "id": 29530353,
      "score": 2,
      "time": 1639322993,
      "title": "ToaruOS 2.0",
      "type": "story",
      "url": "https://github.com/klange/toaruos/releases/tag/v2.0.0"
    },
    {
      "by": "vorgeat",
      "descendants": 0,
      "id": 29530350,
      "score": 1,
      "time": 1639322968,
      "title": "Pétition: Castaner, Macron doivent répondre de leurs actes devant la justice",
      "type": "story",
      "url": "https://www.mesopinions.com/petition/politique/castaner-macron-doivent-repondre-leurs-actes/61215"
    },
    {
      "by": "ta988",
      "descendants": 0,
      "id": 29530312,
      "score": 1,
      "time": 1639322703,
      "title": "Tensions with China revive old fears for Indians of Chinese descent",
      "type": "story",
      "url": "https://www.npr.org/2021/12/12/1059976638/india-china-conflict-chinatown-chinese-indians"
    },
    {
      "by": "readonthegoapp",
      "descendants": 0,
      "id": 29530304,
      "score": 1,
      "text": "I always took this to be obvious, but I think I saw what might count as an admission in this AWS Devops Training slide text:<p>&quot;Developers change things quickly, release often, and measure success by the rate of delivery. Operations are driven by maintaining stability of the application. Frequent releases are a cause for concern of the stability and reliability of the application on the supported platforms, especially during high network traffic.&quot;<p>Another bit of text later on seems to have a typo -- i.e. a bug -- which is just funny:<p>&quot;With DevOps, you can quickly while retaining control and preserving compliance.  Use automated compliance policies, fine-grained controls, and configuration management techniques. Monitor for security incidents and adjust your configurations and software as needed. For example, using policy as code you can define and then track compliance at scale.&quot;<p>It&#x27;s mainly interesting to me because, of the 18Z pro-Agile articles and the 19Z anti-Agile articles I&#x27;ve read, none seemed to talk about this aspect of Agile -- end product reliability.<p>Granted, this AWS course is about &#x27;Devops&#x27; -- its culture and processes and tools -- not &#x27;Agile&#x27; -- but Devops, to me, is driven by Agile, CI&#x2F;CD, etc.<p>If it is true that Agile leads to, or can lead to, or has a higher risk of leading to, less reliable software, then I would like to see some more truth in advertising going forward.<p>And, if there is a way to Sprint but still maintain or even increase the reliability of the end product (over&#x2F;instead of a non-Agile dev process), I&#x27;d like to know what those techniques&#x2F;safeties are.",
      "time": 1639322613,
      "title": "Ask HN: Does Agile dev inherently produce more-buggy, less-stable software?",
      "type": "story"
    }
  ]
}