{
  "stories": [
    {
      "by": "naderrehaan",
      "descendants": 0,
      "id": 30518426,
      "score": 1,
      "time": 1646161169,
      "title": "How to Generate Word-of-Mouth Referrals for E-Commerce",
      "type": "story",
      "url": "https://www.cloudsponge.com/blog/6-ways-to-generate-word-of-mouth-referrals/"
    },
    {
      "by": "ptaipale",
      "descendants": 0,
      "id": 30518421,
      "score": 1,
      "text": "The recent dramatic policy shift in Russia has brought out two Citizens&#x27; Initiatives in the Finnish government&#x27;s net portal. Both are about NATO membership in the country which is traditionally militarily non-aligned.<p>First initiative (open Feb 21) proposes a NATO membership referendum, the other (open Feb 28) proposes that parliament should go ahead to membership procedures without referendum, because of expected Russian harrasment and influence on the referendum procedures.<p>The government portal for initiatives has been very slow today. The authentication to sign any of the initiatives is done either by a person ID smartcard, or bank-based identification. Most people use the bank authentication (in most cases 2FA using mobile phone) because they don&#x27;t bother with smart card readers.<p>The first of the initiatives has already passed the threshold (50 000) which automatically brings it to the table in Parliament. The other initiative has collected 35 000 signatures in 30 hours, meaning it will also pass the threshold tomorrow, despite many people not being able to sign it due to bank connections failing under DDoS.<p>YLE (state broadcaster) news about the attack: https:&#x2F;&#x2F;yle.fi&#x2F;uutiset&#x2F;3-12338542<p>Initiative 1 (referendum): https:&#x2F;&#x2F;www.kansalaisaloite.fi&#x2F;fi&#x2F;aloite&#x2F;9866\nInitiative 2 (parliament direct decision): https:&#x2F;&#x2F;www.kansalaisaloite.fi&#x2F;fi&#x2F;aloite&#x2F;9997",
      "time": 1646161143,
      "title": "DDoS attacks slow down Citizens' Initiative signing in Finland",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30518394,
      "score": 1,
      "time": 1646161034,
      "title": "Hustle and hype: the truth about the influencer economy",
      "type": "story",
      "url": "https://www.theguardian.com/fashion/2022/feb/24/hustle-and-hype-the-truth-about-the-influencer-economy"
    },
    {
      "by": "olvrng",
      "descendants": 0,
      "id": 30518392,
      "score": 1,
      "time": 1646161025,
      "title": "Validate zero enum value in Protobuf 3",
      "type": "story",
      "url": "https://olvrng.github.io/w/proto.enum/"
    },
    {
      "by": "jensneuse",
      "descendants": 0,
      "id": 30518389,
      "score": 1,
      "time": 1646161023,
      "title": "Show HN: WunderHub – publish and consume APIs like NPM packages",
      "type": "story",
      "url": "https://hub.wundergraph.com"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 30518385,
      "score": 1,
      "time": 1646161009,
      "title": "Indian startups second to US on Y Combinator’s top companies list",
      "type": "story",
      "url": "https://economictimes.indiatimes.com/tech/startups/india-tops-the-chart-after-us-in-y-combinators-top-companies-list/articleshow/89905360.cms"
    },
    {
      "by": "rikroots",
      "descendants": 3,
      "id": 30518369,
      "kids": [
        30518423,
        30518398
      ],
      "score": 1,
      "time": 1646160948,
      "title": "Show HN: Dithering a real-time video media stream",
      "type": "story",
      "url": "https://codepen.io/kaliedarik/pen/OJOaOZz"
    },
    {
      "by": "borisandcrispin",
      "descendants": 0,
      "id": 30518335,
      "score": 1,
      "text": "Hello HN! This is Thiago and Dragos from Duckly (YC S20) (https:&#x2F;&#x2F;duckly.com). Duckly is an IDE plugin for VSCode and IntelliJ that enables developers to talk and share their code in real-time with people using a different IDE.<p>We have been working together remotely since 2019 and we were surprised about how hard it was for doing simple collaborative tasks. Like helping a colleague debug something. We also found it interesting to watch skilled people working and naturally as product builders, we were particularly interested in watching developers working. We knew the rubber duck debugging methodology so we decided to build this product that would enable you to share yourself coding live. We called it GitDuck — like after doing a git commit, you would record a short video explaining your code using the command git duck. We launched this on HN https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=20895084.<p>That was interesting, but we were still facing the same issues when trying to collaborate internally. It was still hard to get help from somebody else. We decided to focus on private collaboration and make it possible for people to collaborate in real-time. That was a big change, as previously we had built a streaming platform and an IDE plugin that was linking the code to the video timestamps. In this new iteration, we had to build a video calling app connected to the IDE plugin that would enable people to share and edit code while on a call. Btw, that happened while going through YC. You can see this version launch here https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24228826.<p>The video calling part was built using Daily.co and we built a new IDE plugin that would share the code P2P with other call participants using CRDTs. Building that was quite challenging and we had to be very careful when propagating changes between all participants to avoid the code getting out of sync.<p>A frequent feedback that we received from our users is that it was troublesome to talk using the web, while code sharing on the IDE. That everything would be better if you could actually talk inside of the IDE. The hard part of doing this is that we couldn’t rely on the IDEs for managing the audio and video. For example, while building the first live streaming iteration, we learned that the IDEs were often killing the extension running in the background. Another challenge is how we could offer this feature in the future for other IDEs like Eclipse, vim, or Sublime. Some of these didn’t even have the UI or the APIs for supporting such features. We decided to use an electron app and make the IDE communicate and control it. You talk using this native app, but that is launched and controlled by your IDE.<p>And yes, we are going to support other IDEs, but we don’t want to port until we are satisfied with the existing experience.<p>Server sharing was another interesting use case that we wanted to solve. It enables you to share any local open port with other people. We create a tunnel with a temporary URL and people can access it by going to that URL. We use socket.io under the hoods to be able to do it.<p>And that’s what we are launching now! This version of Duckly works entirely on the IDE so developers can talk and share their code without using anything else. The code is shared P2P, with IntelliSense support, and you can collaborate with people using a different IDE than you. We are naturally excited about this launch, but we still need to provide support for Terminal, chat and port to other IDEs. We will address this later.<p>Duckly has 3 plans, a free plan that allows you to talk up to 45min with one person. A Developer plan ($6&#x2F;month) that you can talk unlimited with up to 3 people simultaneously or the Team plan ($10&#x2F;member&#x2F;month) that is basically unlimited on all fronts.<p>We would love to hear your feedback. How do you do when you need to collaborate remotely? Do you use any traditional video call like Zoom with screen sharing or do you use something else?",
      "time": 1646160820,
      "title": "Show HN: Duckly – Cross-IDE real-time code sharing with video call",
      "type": "story"
    },
    {
      "by": "kosasbest",
      "descendants": 0,
      "id": 30518318,
      "score": 2,
      "time": 1646160776,
      "title": "How to Checkmate Putin",
      "type": "story",
      "url": "https://www.jpost.com/international/article-698594"
    },
    {
      "by": "launchiterate",
      "descendants": 1,
      "id": 30518300,
      "kids": [
        30518358
      ],
      "score": 1,
      "time": 1646160703,
      "title": "Ask HN: How do you connect your M1 MacBook Air to your iMac?",
      "type": "story"
    }
  ]
}