{
  "stories": [
    {
      "by": "57844743385",
      "descendants": 0,
      "id": 28419544,
      "score": 1,
      "time": 1630791630,
      "title": "The Extraordinary CSS of Amit Sheen",
      "type": "story",
      "url": "https://codepen.io/amit_sheen/pens/showcase"
    },
    {
      "by": "diller",
      "descendants": 0,
      "id": 28419538,
      "score": 1,
      "text": "My Saas company lets customers brand our white label software with their logo, corporate images, slogans, domain, etc. There is a slow manual process where a project or account manager has to give the customers marketing team the available branding points along with the requirements (pixels, file type, character length, etc.) The customer’s marketing team isn’t technical or organized, so they screw up providing content that meets the requirements. After the account manager gets the content from the customer and stages it in the software, the customer sees it and is unhappy. They didn’t take into account how bad a logo with written text appears in a tiny image, they wrote a sub header that doesn’t make sense on a particular page, etc. This slows implementation time which ultimately costs us and the customer money.<p>Instead of mucking around with this, I want to be able to put a set of urls in our software. Then customers can upload the images and text to some management site that validates the images meet the requirements, automatically does conversions if possible or makes suggestions on what is wrong. Then the images get output to some place where the customer can see them in the software for approval. The customer can then approve them and automatically promote them to the prod software. We the white label saas company never are involved since this is just a set of urls we consume. \nI need to be able to expense this on my company card so $1000 a year. It sounds like a cms but most CMS systems are over complicated. This is supposed to save time which gets lost if an account manager has to explain something. Contentful seems to be the closest thing but still doesn’t seem set up for this use case.",
      "time": 1630791592,
      "title": "Ask HN: Does this software exist? Image tracker for white label software",
      "type": "story"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 28419536,
      "score": 1,
      "time": 1630791586,
      "title": "Gunshot Victims Wait as Horse Dewormer Overdoses Overwhelm Hospitals",
      "type": "story",
      "url": "https://www.rollingstone.com/politics/politics-news/gunshot-victims-horse-dewormer-ivermectin-oklahoma-hospitals-covid-1220608/"
    },
    {
      "by": "spekcular",
      "descendants": 0,
      "id": 28419503,
      "score": 1,
      "time": 1630791431,
      "title": "Psilocybin: A Journey Beyond the Fear of Death?",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/psilocybin-a-journey-beyond-the-fear-of-death/"
    },
    {
      "by": "enos_feedler",
      "descendants": 0,
      "id": 28419485,
      "score": 1,
      "time": 1630791318,
      "title": "Simplicity and Flexibility: A New Way of Driving a BMW Is Coming",
      "type": "story",
      "url": "https://www.accessbybmw.com"
    },
    {
      "by": "mtasic",
      "descendants": 0,
      "id": 28419463,
      "score": 1,
      "time": 1630791196,
      "title": "Python – Peg – Parsing Combinators – Simple JSON Parser",
      "type": "story",
      "url": "https://gist.github.com/mtasic85/d64bafe70f39314dd5d35af58fb868ba"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 28419458,
      "score": 1,
      "time": 1630791165,
      "title": "An Alternative Syntax for Async Functions",
      "type": "story",
      "url": "https://ibraheem.ca/writings/an-alternative-async-fn-syntax/"
    },
    {
      "by": "istingray",
      "descendants": 0,
      "id": 28419456,
      "score": 2,
      "text": "The more I learn about the company the more I like it. The one thing that surprises me is they seem fairly unique in the marketplace. Solid Linux-first hardware, with a encryption&#x2F;anti-surveillance focus. Curious for people&#x27;s thoughts here.",
      "time": 1630791141,
      "title": "Ask HN: What do you think of System76?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28419442,
      "score": 1,
      "time": 1630791099,
      "title": "Cold Spring Harbor Lab on Nautilus: The Cancer Custodians",
      "type": "story",
      "url": "http://cshl.nautil.us/article/709/the-cancer-custodians"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28419359,
      "score": 2,
      "time": 1630790512,
      "title": "Samsung builds the world’s highest-resolution phone camera sensor: 200 MP",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/09/samsung-builds-the-worlds-highest-resolution-phone-camera-sensor-200-mp/"
    }
  ]
}