{
  "stories": [
    {
      "by": "danny00",
      "descendants": 0,
      "id": 29288681,
      "score": 1,
      "time": 1637420702,
      "title": "Staged Abstract Interpreters [pdf]",
      "type": "story",
      "url": "https://www.cs.purdue.edu/homes/rompf/papers/wei-oopsla19.pdf"
    },
    {
      "by": "nabla9",
      "descendants": 0,
      "id": 29288670,
      "score": 1,
      "time": 1637420612,
      "title": "Explanations for the Havana Syndrome by Sabine Hossenfelder",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=g9C3ZKWLZG4"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 29288652,
      "score": 2,
      "time": 1637420522,
      "title": "Some Tesla owners unable to unlock cars due to server errors",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/technology/some-tesla-owners-unable-to-unlock-cars-due-to-server-errors/"
    },
    {
      "by": "agluszak",
      "descendants": 0,
      "id": 29288628,
      "score": 1,
      "time": 1637420381,
      "title": "Take the next step to software freedom: Become a member of FSF before Dec. 31",
      "type": "story",
      "url": "https://www.fsf.org/appeal"
    },
    {
      "by": "autoencoders",
      "descendants": 1,
      "id": 29288618,
      "kids": [
        29288623
      ],
      "score": 1,
      "time": 1637420304,
      "title": "Show HN: Cleanvoice – Automated Podcast Editing",
      "type": "story",
      "url": "https://cleanvoice.ai"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29288598,
      "score": 2,
      "time": 1637420137,
      "title": "Europe’s space agency dreams of launching its own astronauts",
      "type": "story",
      "url": "https://www.science.org/content/article/europe-s-space-agency-dreams-launching-its-own-astronauts-amid-ambitious-accelerator-plans"
    },
    {
      "by": "pyentropy",
      "descendants": 0,
      "id": 29288597,
      "score": 1,
      "time": 1637420137,
      "title": "Someone Made a Pirate Bay for NFTs",
      "type": "story",
      "url": "https://www.vice.com/en/article/xgdxvw/someone-made-a-pirate-bay-for-nfts"
    },
    {
      "by": "vcool07",
      "descendants": 2,
      "id": 29288596,
      "kids": [
        29288646,
        29288666
      ],
      "score": 2,
      "text": "I&#x27;m employed at one of the big software giants as a senior engineer. Life has been good so far, except that a sense of job stagnancy is creeping in. I talked to my manager about promotion and moving up the ladder to take on more complex projects, and he said that moving from senior to upper levels is not easy, and irrespective of skillset it takes time and patience (plus the usual take ownership yada yada, most of which I&#x27;m already doing).<p>I&#x27;m almost 40 and there is like an ocean of people in the same boat as me (in my current company), many of them with half my experience.  So, I feel like completely stuck on how to get ahead of the pack.<p>I&#x27;ve taken full ownership of decently sized projects (in terms of complexity&#x2F;scale), with hands-on execution, leading the team all the way from design to the production deployment.  I&#x27;ve tried giving team wide presentations on tech topics, took part in hiring drives and so on, but nothing seems to make any difference.  I&#x27;ve also tried applying to other teams within the company, but they are ready to take me at my current level, but not for a higher level.<p>I often see people reaching the positions of architects&#x2F;tech fellows at these large companies at just 10-12 years of experience, and I fail to understand what exactly did they do right.  Is it all about luck&#x2F;being in right place at the right time ?<p>There&#x27;s the obvious solution of moving to a different (albeit much smaller) company, but I like the work life balance, tech stack we use and some other perks the company provides.  So, trying to see what I can do here before giving up and moving on to a different company altogether.<p>Any&#x2F;All helpful comments is highly appreciated.  Thanks in advance !",
      "time": 1637420135,
      "title": "Ask HN: How do you move up the career ladder being a senior developer?",
      "type": "story"
    },
    {
      "by": "tmaly",
      "descendants": 0,
      "id": 29288592,
      "score": 1,
      "text": "I would like to build an idea I have in VR.  I am working on getting up to speed in Unity.<p>I am curious if you work or dabble in the VR space, what tools and tech stack do you use?",
      "time": 1637420115,
      "title": "Ask HN: Your VR Tech Stack?",
      "type": "story"
    },
    {
      "by": "oftenwrong",
      "descendants": 0,
      "id": 29288554,
      "score": 1,
      "time": 1637419879,
      "title": "Why the Netherlands Is the Best Country for Drivers",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=d8RRE2rDw4k"
    }
  ]
}