{
  "stories": [
    {
      "by": "awakeasleep",
      "descendants": 0,
      "id": 29770046,
      "score": 1,
      "time": 1641140664,
      "title": "Emerging science on BMAA: Do cyanobacteria contribute to neurological disease?",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3295368/"
    },
    {
      "by": "pella",
      "descendants": 0,
      "id": 29770037,
      "score": 1,
      "time": 1641140610,
      "title": "How to slightly improve your life without trying",
      "type": "story",
      "url": "https://www.theguardian.com/lifeandstyle/2022/jan/01/marginal-gains-100-ways-to-improve-your-life-without-really-trying"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 29769983,
      "score": 1,
      "time": 1641140330,
      "title": "Instruction Address Misaligned Exceptions in RISC-V",
      "type": "story",
      "url": "https://twitter.com/hasheddan/status/1477673522193473540"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 29769981,
      "score": 2,
      "time": 1641140327,
      "title": "Write custom Julia compiler passes in library code",
      "type": "story",
      "url": "https://twitter.com/ChrisRackauckas/status/1477274812460449793"
    },
    {
      "by": "sicco",
      "descendants": 1,
      "id": 29769980,
      "kids": [
        29769994
      ],
      "score": 1,
      "time": 1641140317,
      "title": "161 custom Tesla light shows (and counting)",
      "type": "story",
      "url": "https://teslalight.show/0d79c5573ec54cd9be6a8af5ed5181f3"
    },
    {
      "by": "whack",
      "descendants": 0,
      "id": 29769964,
      "score": 1,
      "time": 1641140196,
      "title": "Our Engineering Principles and Best Practices",
      "type": "story",
      "url": "https://software.rajivprab.com/2021/12/26/our-engineering-principles-and-best-practices/"
    },
    {
      "by": "pipnonsense",
      "descendants": 2,
      "id": 29769953,
      "kids": [
        29770027,
        29769990
      ],
      "score": 1,
      "text": "Hey HN,<p>Let me give you some context for my question.<p>I am a 42 yo developer, completely sedentary for the last 15 years or so, slightly overweight. I am worried about my overall health and mobility going into old age, so I started to exercise a bit last year; the thing is that I am utterly unmotivated by any sort of workout.<p>I never ever had the slightest motivation to go to the gym or any weight training. It&#x27;s not that I hate; I just feel bored to death, I don&#x27;t know. And my current long-term health concern is not enough motivation for daily commitment, I know. I am sure I won&#x27;t like the motivational tactics of something like CrossFit, where someone shouting, high volume upbeat music, and group commitment are supposed to motivate you. I don&#x27;t work that way. I am trying Pilates with my wife. Just the two of us and a trainer. The scheduled sessions and my wife has been helping me adhere to it for the last few months, but I know I don&#x27;t look forward to the sessions and that, at some point, will make me quit.<p>I hate running as well, but I love to play soccer and sometimes basketball. The thing is that living in a high-density big city with busy friends is hard to find somewhere practical to play it recurrently. I am committed to finding a way to play it weekly, but even so, it will be just one weekly session of aerobic training without the functional part (which is what I am more worried about).<p>So, I am looking into what would motivate me to do some functional physical exercise. I am a builder. Building something will certainly motivate me. I do that with software all the time. Building things that don&#x27;t go anywhere just for the joy of doing it. So I started to wonder if there is a hobby out there that demands the body enough to put me in shape.<p>And that brings the question: what could I physically build that would be good enough functional training while learning the craft of building it?<p>I am looking for something long-term. It could take years to build something acceptable, as long as the learning process is also physically demanding.<p>There are some more restrictions. I live in an apartment without a backyard, so no space to build a shed or anything like that. But feel free to mention good ideas that fit my purpose, and I can try to find a way to fit them into my life.<p>My first thoughts went to things like carpentry, masonry, sculpture, farming, gardening, ceramics. I am not interested in hobbies where you don&#x27;t build anything but are fun for some people, like dancing or rock climbing.<p>Any ideas, HN?",
      "time": 1641140147,
      "title": "Ask HN: How can I do some functional workout while building something?",
      "type": "story"
    },
    {
      "by": "Osein",
      "descendants": 1,
      "id": 29769947,
      "kids": [
        29769978
      ],
      "score": 1,
      "text": "Hello everyone, I want to start an open source project just for the portfolio. If you have a problem that you can’t solve on your own and you are not going to do it, write it here so maybe we can solve it for you.<p>It can be a mobile or web app. 7 years as a geek tought me a lot of languages xd",
      "time": 1641140123,
      "title": "What should we build as an open source project?",
      "type": "story"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 29769936,
      "score": 1,
      "time": 1641140022,
      "title": "Overserved, Underrated. A witty and erudite homage to alcohol",
      "type": "story",
      "url": "https://www.city-journal.org/a-witty-and-erudite-homage-to-alcohol"
    },
    {
      "by": "moviewise",
      "descendants": 1,
      "id": 29769929,
      "kids": [
        29769977
      ],
      "score": 1,
      "time": 1641139992,
      "title": "Meaningful movies help people cope with life's difficulties",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2021/05/210510104345.htm"
    }
  ]
}