{
  "stories": [
    {
      "by": "hhs",
      "descendants": 0,
      "id": 27990770,
      "score": 1,
      "time": 1627512602,
      "title": "Incitatus",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Incitatus"
    },
    {
      "by": "foxfired",
      "descendants": 0,
      "id": 27990746,
      "score": 1,
      "time": 1627512482,
      "title": "Kwik Talk: A Conversation Simulator",
      "type": "story",
      "url": "https://idiallo.com/projects/kwiktalk/index.html"
    },
    {
      "by": "brookelustig",
      "descendants": 0,
      "id": 27990744,
      "score": 1,
      "text": "Hey everyone, been working on an MVP for the past year and finally getting ready to launch this thing.<p>As this is my first venture I wanted to check in here for some advice on what the best corp structure to start this thing would be.<p>This is a bootstrapped venture that I’m launching in a small market as a proof of concept to start with. I’m looking for the best possible setup to be able to grow quickly and possibly look for outside funding for scaling the business faster in the future.<p>I believe the MVP will bring in some revenue fairly quickly. If it will be attractive enough for outside investment remains to be seen but I guess what I’m trying to say is that once launched I believe there is a decent chance I’ll be working on this for a while.<p>The dilemma is that every dollar and hour of admin work counts as a single founder that is bootstrapping so I’m looking for the solution that has the least headaches and is the most cost-effective.<p>Basically, would the best route just be to register as an LLC in my home state (Colorado) and worry about the transformation to a Delaware C corp if any VCs turn out to be interested later?<p>I was considering just launching the MVP as a sole proprietor but this is a subscription consumer app and I can’t stand the fact that it would be my personal name as the seller in the App Store rather than the company name.<p>That leaves LLC home state (CO) or C corp Delaware with a tool like clerky.<p>My concern with C corp is the money and time that will be spent on admin tasks.<p>The real question I suppose, is how painful is it to transform as an out-of-state LLC to Delaware C corp in the future? Would the fact that I&#x27;m a single owner of the business make the conversion easier? Is there a easy way to transform without triggering tax events?<p>Would love to get some thoughts and appreciate any advice from the community here.<p>Cheers,",
      "time": 1627512436,
      "title": "Company structure for a solo bootstrapped founder?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27990715,
      "score": 1,
      "time": 1627512290,
      "title": "Intel Unveils Foveros Omni and Foveros Direct; Leveraging Hybrid Bonding",
      "type": "story",
      "url": "https://fuse.wikichip.org/news/5949/intel-unveils-foveros-omni-and-foveros-direct-leveraging-hybrid-bonding/"
    },
    {
      "by": "ggasp",
      "descendants": 0,
      "id": 27990705,
      "score": 1,
      "time": 1627512229,
      "title": "Limelight Announces Acquisition of Layer0",
      "type": "story",
      "url": "https://investors.limelight.com/news/press-releases/news-details/2021/Limelight-Announces-Acquisition-of-Layer0-to-Accelerate-Growth-in-Edge-Application-Delivery/default.aspx"
    },
    {
      "by": "giantg2",
      "descendants": 0,
      "id": 27990686,
      "score": 1,
      "text": "I saw an ad for this, but wasn&#x27;t sure what this actually is. Is it just creating libraries in C for other apps?",
      "time": 1627512107,
      "title": "Ask HN: What is an Android SDK layer developer?",
      "type": "story"
    },
    {
      "by": "willemmerson",
      "descendants": 0,
      "id": 27990683,
      "score": 2,
      "time": 1627512091,
      "title": "Potoooooooo",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Potoooooooo"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 27990674,
      "score": 2,
      "time": 1627512006,
      "title": "Tiger Global: the technology investor ruffling Silicon Valley feathers",
      "type": "story",
      "url": "https://www.ft.com/content/54bb342c-230f-4438-a4d7-7cbde010ea1a"
    },
    {
      "by": "ecliptik",
      "descendants": 0,
      "id": 27990666,
      "score": 2,
      "time": 1627511944,
      "title": "Facebook will require US office employees to be vaccinated",
      "type": "story",
      "url": "https://www.theverge.com/2021/7/28/22598818/facebook-vaccine-requirement-us-office-employees"
    },
    {
      "by": "Uehreka",
      "descendants": 0,
      "id": 27990596,
      "score": 1,
      "text": "My impression has been that Quantum Computing (as a profitable and productive thing) is still a while away, but it’s also a thing that’s in my AWS dashboard. I’ve tried googling for Amazon Braket, but the results are full of Amazon docs, Amazon SDKs, news articles about the announcement of the service, and a couple fluff blogs that seem to just paraphrase Amazon’s marketing material.<p>Has anyone here used it? Has anyone done a “straight dope” writeup about what it’s good for? And side note: Does QC actually have pharma&#x2F;chemical applications, or are people just copy-pasting from the Deep Learning articles?",
      "time": 1627511475,
      "title": "Ask HN: Has anyone used Amazon Braket or written about it?",
      "type": "story"
    }
  ]
}