{
  "stories": [
    {
      "by": "baal80spam",
      "descendants": 0,
      "id": 31139234,
      "score": 1,
      "time": 1650752776,
      "title": "What Do Browsers Say When They Phone Home?",
      "type": "story",
      "url": "https://ieeexplore.ieee.org/abstract/document/9374407"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 31139174,
      "score": 1,
      "time": 1650752178,
      "title": "Concerning Prohibited Books (1563)",
      "type": "story",
      "url": "https://en.wikisource.org/wiki/Canons_and_Decrees_of_the_Council_of_Trent/Second_Part/Concerning_Prohibited_Books"
    },
    {
      "by": "tahoslav",
      "descendants": 0,
      "id": 31139172,
      "score": 2,
      "text": "For a couple of months I&#x27;ve been planning to run and organize a relatively big chess tournament with a group of people that I know. It is an online chess tournament targeted at chess players of around 2100-2400 elo rating.<p>The tournament is not aimed at the highest&#x2F;elite sector of chess but I take pride in the craftsmanship and the artistry that goes into the planning and organizing of a tournament. So I put a lot of work on making sure every corner of the tournament is expertly crafted and also unique. For example I put a lot of effort in having a custom&#x2F;in-house user interface, tournament managing software, soundtrack, big monetary prizes, and more.<p>The part that I struggle the most with is earning revenue for myself and my crew. At the moment, I run a small, but competent team of 4 people (including me) and each person is focused at their area of their expertise. They are:\n- Chess expert: They orchestrate the tournament structure and handle chess related technical intricacies such as writing a comprehensive rule book.<p>- Communications: They are responsible for finding sponsors, business deals, business partners and so on.\n- Graphical Designer: They focus on the graphical design of the tournament UI, and graphical material.\n- Leader: That&#x27;s me, besides organizing everyone and managing the tournament as a whole, I also do a huge chunk of the graphical design, talking with potential sponsors, technical chess stuff and so on.<p>We have almost reached the end of the &#x27;pre-production&#x27; stage, so it means we have all the ideas nailed down, we have UI mockups ready, we have potential investors in mind. We are simply waiting for some legal processes before we officially can look for sponsors.<p>I enjoy doing this and I know that my crew also enjoy it to some extent. Despite months of work, I haven&#x27;t paid anyone anything yet so there is some passion involved. What I really want to do is to be able to pay my crew and myself for all this invaluable effort that we have put in.<p>In the beginning I was naive and hoped that we could &#x27;pay ourselves&#x27; by having our &#x27;salaries&#x27; as part of the running cost of the tournament so that the sponsors would pay for it. This seems to be a no go, so I focused on the ways that we can earn revenue. Such as: an entry fee, affiliate links, selling merchandise, and direct ads.<p>But I am worried that these will not generate a satisfiable amount of revenue. Our aim is that, the sponsors will cover all the running costs of the tournament, so whatever revenue we generate would count as &#x27;profit&#x27; that we could divide between ourselves.<p>This is my first &#x27;business&#x27; rodeo. While I have a lot of confidence that the tournament will be a success from an engineering, artistic, and craftsmanship point of view, I am very worried about the commercial success of the tournament.<p>I want to ask you, if you could give me advice on how can I make this tournament a commercial success. I look at the organization of this tournament as a way for me to enter the &#x27;business field&#x27;. So I want it to commercially succeed as well. But I am aware of my limited knowledge and experience in this matter.<p>edit: formatting",
      "time": 1650752150,
      "title": "Ask HN: Advice running a big scale chess tournament",
      "type": "story"
    },
    {
      "by": "superzamp",
      "descendants": 0,
      "id": 31139134,
      "score": 1,
      "time": 1650751869,
      "title": "I think I found the Metaverse",
      "type": "story",
      "url": "https://umniverse.com/"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 31139107,
      "score": 1,
      "time": 1650751655,
      "title": "Asus Will Be Entering the New Wave of Hybrid Tablet-Notebooks",
      "type": "story",
      "url": "https://www.patentlyapple.com/2022/04/taiwans-asus-will-be-entering-the-new-wave-of-hybrid-tablet-notebooks-in-the-second-half-of-the-year-joining-hp-and-others.html"
    },
    {
      "by": "stigz",
      "descendants": 0,
      "id": 31139069,
      "score": 1,
      "text": "Hi,<p>I&#x27;m depressed and judging by posts as of late (see below), chances are, so are you.<p>I go to talk therapy and it&#x27;s <i>okay</i>. Some sessions have been life saving. But the vast majority of my sessions frankly are a waste of time. The biggest waste of time - I feel - is frequently having to re-explain things. I wish I could go all &quot;omg rtfm&quot; to my therapist, but that&#x27;s not an option - being the nature of talk therapy and all.<p>Have any of you considered Email Therapy[1]? The idea being you don&#x27;t communicate with your therapist via spoken word (in person, phone call, zoom, etc.). Rather you communicate via written word (email, text, slack, or go full A. Ham with a written letter).<p>I see very little mention of it on HN over the years [2]. Therefore, I feel like it&#x27;s not a well known thing in the community. And shit, I&#x27;m right there with you, I have been going to talk therapy for 20 years and today is the first day I heard of Email Therapy.<p>I&#x27;m going to give it a try. I&#x27;m thinking I&#x27;ll ask my current therapist if they would like to convert to this form. Otherwise, I&#x27;ll be looking for therapists that do offer such a service.<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Online_counseling\n[2] https:&#x2F;&#x2F;hn.algolia.com&#x2F;?dateRange=all&amp;page=0&amp;prefix=true&amp;query=email%20therapy&amp;sort=byPopularity&amp;type=story<p>The posts as of late. I wish you all strength.<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30668506\nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30923701\nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30862058\nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31039849\nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30132560",
      "time": 1650751409,
      "title": "Ask HN: Email Therapy",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31139046,
      "score": 1,
      "time": 1650751230,
      "title": "Interview: Ramez Naam, futurist, author, and investor",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/interview-ramez-naam-futurist-author"
    },
    {
      "by": "macbookaries",
      "descendants": 0,
      "id": 31139040,
      "score": 2,
      "time": 1650751207,
      "title": "American companies are mining the Finnish language for unique brand names",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-04-13/finnish-language-becomes-hot-trend-for-company-names"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 31139027,
      "score": 1,
      "time": 1650751132,
      "title": "2015 is the year the old internet finally died (2015)",
      "type": "story",
      "url": "https://www.vox.com/2015/8/6/9099357/internet-dead-end"
    },
    {
      "by": "yonixw",
      "descendants": 1,
      "id": 31139019,
      "kids": [
        31139176
      ],
      "score": 2,
      "time": 1650751054,
      "title": "'Great Resignation': Over 70% of workers regret quitting their jobs",
      "type": "story",
      "url": "https://www.foxbusiness.com/lifestyle/workers-regret-quitting-great-resignation"
    }
  ]
}