{
  "stories": [
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31524784,
      "score": 2,
      "time": 1653610508,
      "title": "Pakistan shuts down internet ahead of protests over ousting of prime minister",
      "type": "story",
      "url": "https://therecord.media/pakistan-internet-shutdown-protests-imran-khan/"
    },
    {
      "by": "siva7",
      "descendants": 1,
      "id": 31524767,
      "kids": [
        31524801
      ],
      "score": 1,
      "time": 1653610309,
      "title": "Amber Heard and the Death of MeToo",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/18/opinion/amber-heard-metoo.html"
    },
    {
      "by": "novusteck",
      "descendants": 0,
      "id": 31524764,
      "score": 1,
      "time": 1653610270,
      "title": "ResQR-Vac – Your pet's digital vaccination passport",
      "type": "story",
      "url": "https://resqr.co/vac/en.php"
    },
    {
      "by": "josephcsible",
      "descendants": 0,
      "id": 31524758,
      "score": 1,
      "time": 1653610204,
      "title": "China must destroy Elon Musk's satellites with ‘hard kill’ weapon, say academics",
      "type": "story",
      "url": "https://www.telegraph.co.uk/business/2022/05/25/china-must-destroy-elon-musks-satellites-hard-kill-weapon-say/"
    },
    {
      "by": "hochmartinez",
      "descendants": 0,
      "id": 31524710,
      "score": 1,
      "time": 1653609581,
      "title": "10 Reasons Why Cultivated Meat Is the Future of Protein",
      "type": "story",
      "url": "https://www.greenqueen.com.hk/10-reasons-why-cultivated-meat-is-the-future-of-protein-the-case-for-lab-grown/"
    },
    {
      "by": "hochmartinez",
      "descendants": 0,
      "id": 31524685,
      "score": 1,
      "time": 1653609394,
      "title": "Humble Bee Bio is using bees to create bioplastics",
      "type": "story",
      "url": "https://www.nxtaltfoods.com/news/articles/plant-based/new-zealands-humble-bee-bio-is-using-bees-to-create-bioplastics/"
    },
    {
      "by": "easrng",
      "descendants": 0,
      "id": 31524678,
      "score": 3,
      "time": 1653609331,
      "title": "SPAs: Are They the Right Choice?",
      "type": "story",
      "url": "https://easrng.blogspot.com/2022/05/spa.html"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31524669,
      "kids": [
        31524728
      ],
      "score": 3,
      "time": 1653609311,
      "title": "What are the odds that some idiot will name his mutex ether-rot-mutex",
      "type": "story",
      "url": "http://etherrotmutex.blogspot.com/2017/07/what-are-odds-that-some-idiot-will-name.html"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 31524646,
      "kids": [
        31524719
      ],
      "score": 2,
      "time": 1653609126,
      "title": "Russia's forcibly depopulating hundreds of thousands from east Ukraine to Russia",
      "type": "story",
      "url": "https://www.cnn.com/2022/05/26/politics/ukraine-filtration-camps-forcibly-remove-russia/index.html"
    },
    {
      "by": "captainchris",
      "descendants": 0,
      "id": 31524645,
      "score": 1,
      "text": "Hi HN:<p>Failed USA-based startup founder here. I was cofounder for a SaaS startup and have fallen on hard times. I stopped programming a few years ago and have been cycling between inadequately housed and homeless since before the pandemic. Homeless at this time without transportation. I travel on foot with a backpack and sleep outdoors for now.<p>I&#x27;ve exhausted gov&#x27;t help, as well as help from friends and family already. I am in a rural area with limited work options. My best bet short term, barring a coding gig here, is odesk (Upwork). But, I need some basics such as a bicycle, a laptop, and a coworking membership to do any tech work. There are no programming jobs locally for which I would qualify at this time.<p>I&#x27;ve worked small local jobs here and there, but its sporadic and difficult to maintain without even a bicycle. Today, I asked a friend locally for their extra bike, from which I will seek any kind of work for food at a minimum. If that comes through, I&#x27;ll be in a far better spot to do any kind of job, whether manual labor or technical.<p>My SNAP food allowance has run out for the month. A few nice people here on hn helped me out with food and toiletries this week, and I just need a few more bucks to get through this month.<p>A gentleman here on hn sent me $15 yesterday to PayPal, intended for food, which I used at CVS for first aid supplies, as my feet are worn out and began bleeding today from my heels, due to walking too many miles without proper footware.<p>Even basics like laundry, new socks and sneakers are out of reach, as food&#x2F;toiletries&#x2F;first aid have taken precedence.<p>I have my Apple phone and ACP cell service to stay on grid and manage virtual cash (apple cash, paypal&#x2F;venmo&#x2F;cashapp).<p>May I ask if anyone can help out with some emergency food money so I may eat before early next month? Beyond that, I am quite open to pointers to a low pay remote coding gig. I&#x27;d need the aforementioned basics. However, I can work at a senior level SWE on small to medium full stack db-backed web projects.<p>If you can help, can you e&#x27;mail me at hackernewscontactmail at gmail? If you&#x27;re able to help with food at this time, I will respond quickly with info on my apple cash, or paypal&#x2F;venmo&#x2F;cashapp. Thank you for helping.",
      "time": 1653609120,
      "title": "Ask HN: Failed startup cofounder seeking emergency assistance",
      "type": "story"
    }
  ]
}