{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30469135,
      "score": 1,
      "time": 1645807198,
      "title": "Propaganda, fake videos of Ukraine invasion bombard users",
      "type": "story",
      "url": "https://apnews.com/article/russia-ukraine-technology-europe-media-social-media-123c7975a879b89b85c06877f1f12908"
    },
    {
      "by": "jeffbarr",
      "descendants": 0,
      "id": 30469129,
      "score": 1,
      "time": 1645807191,
      "title": "Additional Checksum Algorithms for Amazon S3",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/new-additional-checksum-algorithms-for-amazon-s3/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 30469127,
      "score": 2,
      "time": 1645807178,
      "title": "Ukraine Military Calls on Citizens with Hobby Drones to Help Kyiv",
      "type": "story",
      "url": "https://gizmodo.com/ukraine-military-calls-on-citizens-with-hobby-drones-to-1848592986"
    },
    {
      "by": "intunderflow",
      "descendants": 0,
      "id": 30469116,
      "score": 3,
      "time": 1645807115,
      "title": "Finland or Sweden joining NATO would spark Russian response – Moscow warns",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/live/world-europe-60517447"
    },
    {
      "by": "323",
      "descendants": 0,
      "id": 30469108,
      "score": 2,
      "time": 1645807082,
      "title": "Russia limits access to Facebook amid fallout over war in Ukraine",
      "type": "story",
      "url": "https://www.independent.co.uk/tech/russia-facebook-ukraine-war-internet-b2023445.html"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 30469100,
      "score": 1,
      "time": 1645807056,
      "title": "Relational Pipes: An open data format",
      "type": "story",
      "url": "https://relational-pipes.globalcode.info/v_0/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 30469080,
      "score": 1,
      "time": 1645806958,
      "title": "Companies have the most to lose from Russia's attack on Ukraine",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_2f56bf0b49d7e24c5562f094a71d9e00"
    },
    {
      "by": "subomi",
      "descendants": 0,
      "id": 30469078,
      "score": 2,
      "text": "Hi HN, we’re Subomi and Emmanuel, founders of Convoy (<a href=\"https:&#x2F;&#x2F;getconvoy.io\" rel=\"nofollow\">https:&#x2F;&#x2F;getconvoy.io</a>). Convoy is an open-source webhooks service. We make it easy for developers to publish webhooks like Stripe and Twilio. Convoy is cloud-native so developers can deploy the container to wherever they host their applications.<p>Some time ago I built an API for local fintech companies alongside Emmanuel. While trying to sell this product, we were asked several times for webhooks. We didn&#x27;t find a great tool that was easy to use, language-agnostic and cloud-native; something that could scale independently of our core service. We decided to build it ourselves.<p>Webhooks are the glue of the modern internet. I like to say it as if you make a payment on Shopify with Stripe’s checkout and Stripe fails to send a webhook event to Shopify’s servers about your payment, you won’t get a delivery of your package even though your card has been debited. This explains the importance of webhook events to many consumer apps. Webhooks are used for asynchronous communication by API providers to notify apps&#x2F;integrators about an event that occurred in their account.<p>Today, implementing a webhooks delivery system is a highly fragmented problem. Stripe&#x27;s system is designed for security (with features like replay attacks, rolling secrets etc), Twilio for performance(with features like connection override), Pagerduty for flexibility(with features like payload filtering) and many more. We&#x27;d love to make these features available to everyone with Convoy. We&#x27;re already helping a few companies solve problems they didn&#x27;t know they had because of the visibility Convoy gives.<p>API providers need to push webhook events reliably. It’s a pain to build this from scratch. At first glance, it seems like a good old HTTP Post, but with time it becomes more nuanced as the requirements pile up: dealing with bad endpoints, pushing events to multiple endpoints as configured by your user,  rate-limiting of customer endpoints, security of delivery, UX for managing retries. We take care of all that and give you one less infrastructure to worry about.<p>Convoy is open-source software that exposes a REST API. Developers push events to it using the REST API(we aim to support other means of ingesting data in the future for high volume environments – this is a feature Shopify provides today) then we sign the payload, publish the events, apply retries, etc. We also provide a management UI to manually retry events to user endpoints.<p>Convoy consists of 3 core components—in addition to the REST API, there is a job queue and a storage layer. The REST API server is used to create applications, endpoints and events. The job queue currently supports 2 backends: in-memory and Redis. The storage layer currently supports 2 backends: on-disk and MongoDB. All events pushed to Convoy are saved to storage and enqueued on the job queue for workers to deliver.<p>Most of our users use our product to push webhook events to their customers’ endpoints. Customers also use Convoy as a broker for inter-service communication.<p>We make money by providing a managed service. We&#x27;ve been running the managed service for a while now and charge $1&#x2F;5k events, but those details are not on our website yet.<p><pre><code>  The repository is available at https:&#x2F;&#x2F;github.com&#x2F;frain-dev&#x2F;convoy and a getting started doc exists here: https:&#x2F;&#x2F;getconvoy.io&#x2F;docs&#x2F;guide. Anyone can download the binary or Docker image from here: https:&#x2F;&#x2F;getconvoy.io&#x2F;download and run it wherever they choose - AWS, Azure, GCP, etc.\n</code></pre>\nWe’d love you to try it out and hear your thoughts! We’d also love to hear your experiences building custom webhook software and what you think we can abstract into Convoy?",
      "time": 1645806940,
      "title": "Launch HN: Convoy (YC W22) – Open-source cloud-native webhooks service",
      "type": "story",
      "url": "https://getconvoy.io"
    },
    {
      "by": "hsnewman",
      "descendants": 0,
      "id": 30469048,
      "score": 2,
      "time": 1645806814,
      "title": "Scientists Have Discovered an Exotic Magnetic State of Matter",
      "type": "story",
      "url": "https://scitechdaily.com/scientists-have-discovered-an-exotic-magnetic-state-of-matter/"
    },
    {
      "by": "autotune",
      "descendants": 1,
      "id": 30469036,
      "kids": [
        30469126
      ],
      "score": 3,
      "text": "Apologies if this is off-topic but the learning French thread got me wondering if anyone here is an artist in the downtime and has recommendations for learning materials when it comes to learning how to draw? I&#x27;ve tried Drawing on the Right Side of the Brain and it doesn&#x27;t do it for me. I&#x27;ve tried nma.art and that&#x27;s like the closest I&#x27;ve come to what I&#x27;m after but currently suffer from paralysis analysis with too many or too few courses to choose from. Any suggestions? I&#x27;m hoping to be able to eventually draw people and landscapes, willing to pay hundreds of dollars potentially for the right course or instruction per month not really looking for like a udemy type thing.",
      "time": 1645806758,
      "title": "Ask HN: Anyone here have good material for learning how to sketch from scratch?",
      "type": "story"
    }
  ]
}