{
  "stories": [
    {
      "by": "r_singh",
      "descendants": 0,
      "id": 31375307,
      "score": 1,
      "text": "My journey as an indie hacker or aspiring startup founder has been rocky to say the least. I&#x27;m aware that&#x27;s nothing unusual. However, every now and then the path of taking a job pops up in my head.<p>I have never taken a job offer from a company before. I&#x27;ve only ever worked on my own projects. One of them got funded and went on to becoming a business but the subsequent projects only ever reached pre product market fit. Still, I have experience designing, building and distributing products. I have conducted hundreds of user interviews over the years and do think that I have a lot to offer.<p>How challenging will it be for me to gain credibility without a reputable organization or logo backing me?",
      "time": 1652505847,
      "title": "Ask HN: Solo makers who switched to a job, how difficult was it?",
      "type": "story"
    },
    {
      "by": "throwaway200112",
      "descendants": 0,
      "id": 31375285,
      "score": 1,
      "text": "A memory: &quot;&quot;&quot;One day in late November in a city in Europe that measures temperature in degree Celsius: I was studying. I felt numb. So numb. That day, I already studied for ages. Longer than any person could possible bare. It must have been around 4 or maybe even 6 hours. The library felt like an endless hall where nothing is allowed to move or make a sound louder than taking a sip from a bottle filled with plain water - no sugar. I needed a break. The suffering was too much. I needed fresh air. So, I decided to procrastinate home.<p>On my way home - on my bike - my 20 feet long hair moved hastily in the wind as I tried to free myself of my mental suffering. And then I saw them: construction workers shoveling earth in the freezing cold. My heart stopped. Not because they didn&#x27;t seem quite happy. They seemed neutral. But it was my mental image of what it must be like. For me. To be in their skin. To be shoveling earth right now. In the cold. Probably already longer than 6h that day. And probably also tomorrow.<p>My mind shifted. Immediately. I was motivated to study. Right there. Right then. I wanted to make sure that I would never be in their skin. To suffer as I imagined they must suffer. I was sure, studying would help. And, boy, did I study that day. That week. That month. Until I forgot. And then I remembered again.&quot;&quot;&quot;<p>I am living a privileged life. However, every now and then I am suffering. And it feels like the end of the world because my mind compares my current situation to a dream world. It feels odd to me - how easily my mind shifts. Just the other day I was suffering. Then I watched a movie. A fiction story. But my suffering slowly faded away. It&#x27;s odd. But it worked.<p>I am wondering: do you have observations of people who suffer(ed) more than you?",
      "time": 1652505497,
      "title": "Ask HN: People who suffer(ed) more than you?",
      "type": "story"
    },
    {
      "by": "zaik",
      "descendants": 0,
      "id": 31375282,
      "score": 1,
      "time": 1652505466,
      "title": "A lock-free, concurrent, generic queue in 32 bits",
      "type": "story",
      "url": "https://nullprogram.com/blog/2022/05/14/"
    },
    {
      "by": "philliphaydon",
      "descendants": 0,
      "id": 31375281,
      "score": 1,
      "time": 1652505459,
      "title": "Sharing the good Elon Musk has done",
      "type": "story",
      "url": "https://twitter.com/johnnacrider1/status/1525127692017860610"
    },
    {
      "by": "leonry",
      "descendants": 0,
      "id": 31375268,
      "score": 1,
      "time": 1652505220,
      "title": "How the world’s forests have transformed over the past two decades",
      "type": "story",
      "url": "https://www.nationalgeographic.com/environment/graphics/the-worlds-forests-decades-of-loss-and-change"
    },
    {
      "by": "fortran77",
      "descendants": 1,
      "id": 31375260,
      "kids": [
        31375264
      ],
      "score": 1,
      "time": 1652505108,
      "title": "Microsoft Suggests Uninstalling Windows 11 Update That Crashes Apps",
      "type": "story",
      "url": "https://www.pcmag.com/news/microsoft-suggests-uninstalling-windows-11-update-that-crashes-apps"
    },
    {
      "by": "WoodenChair",
      "descendants": 0,
      "id": 31375248,
      "score": 2,
      "time": 1652504940,
      "title": "Explorer II",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Explorer_II"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 31375227,
      "score": 1,
      "time": 1652504532,
      "title": "Differences Between a Graph Database and Relational Database (2021)",
      "type": "story",
      "url": "https://memgraph.com/blog/graph-database-vs-relational-database"
    },
    {
      "by": "elvis70",
      "descendants": 1,
      "id": 31375216,
      "kids": [
        31375256
      ],
      "score": 1,
      "time": 1652504366,
      "title": "The Good Ol' Days of QBasic Nibbles",
      "type": "story",
      "url": "https://www.thecodedmessage.com/posts/qbasic-nostalgia/"
    },
    {
      "by": "xqcgrek2",
      "descendants": 0,
      "id": 31375205,
      "score": 2,
      "time": 1652504226,
      "title": "Matt Damon’s crypto ad blamed for losing people money",
      "type": "story",
      "url": "https://www.mercurynews.com/2022/05/12/matt-damons-crypto-ad-blamed-for-losing-people-money/"
    }
  ]
}