{
  "stories": [
    {
      "by": "kristerv",
      "descendants": 0,
      "id": 27847558,
      "score": 1,
      "time": 1626371001,
      "title": "HN creates FOMO, so I created a HNSince. Now I check weekly and not on vacation",
      "type": "story",
      "url": "https://hnsince.com/"
    },
    {
      "by": "lindowe",
      "descendants": 0,
      "id": 27847532,
      "score": 2,
      "time": 1626370953,
      "title": "Reinforcement Learning in HASH Simulations",
      "type": "story",
      "url": "https://hash.ai/blog/reinforcement-learning-in-hash-simulations"
    },
    {
      "by": "oblib",
      "descendants": 0,
      "id": 27847526,
      "score": 1,
      "time": 1626370920,
      "title": "Paralyzed man’s brain waves turned into sentences on computer in medical first",
      "type": "story",
      "url": "https://www.theguardian.com/science/2021/jul/15/paralyzed-man-brain-waves-sentences-computer-research"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27847459,
      "score": 1,
      "time": 1626370673,
      "title": "Ford Looking at Charging EVs by Flat Towing Them",
      "type": "story",
      "url": "https://www.thedrive.com/tech/41529/ford-looking-at-charging-evs-by-flat-towing-them"
    },
    {
      "by": "handheldmouse",
      "descendants": 0,
      "id": 27847428,
      "score": 2,
      "text": "Hi HN,<p>We are Alex and Daniel, the founders of Zen (https:&#x2F;&#x2F;www.yayzen.com&#x2F;yc)! Zen is a computer app that uses your webcam to analyze your posture and alerts you when you&#x27;ve been slouching for an extended period of time (without recording or storing any visuals).<p>Unfortunately, most of us spend the majority of our workdays hunched over a computer, leading to back and joint pain, headaches, and even long-term heart disease.<p>Alex started coding when he was 11 years old and eventually developed a severe case of &quot;Forward Head Posture&quot; (Nerd&#x2F;Text Neck), a postural deformity that&#x27;s often caused by unhealthy posture habits (like slouching while coding).<p>He eventually created prototypes of Zen in his college dorm room at the University of St. Andrews to help with his posture. A couple of Alex&#x27;s classmates saw him using the app throughout lectures and asked if they could test it out.<p>He received promising feedback from his classmates and took advantage of an opportunity to move to San Francisco, California to work more on the project. We met at our co-living space and are still roommates today.<p>I (Daniel) went from playing football and doing splits at Yale University (https:&#x2F;&#x2F;storage.thephapp.com&#x2F;split%281%29.gif) to working with terrible low back pain and carpal tunnel for over 8 hours a day from working hunched over my computer at Adobe. Eventually, I met with an ergonomist at Adobe to get support.<p>Ironically, Alex told me about the project when I got home that day. I tried out his prototype, loved it, and we came together to build Zen alongside top ergonomists and physical therapists.<p>Here&#x27;s how it works: The app takes video stream as input via your webcam (without recording or storing any visuals) and utilizes a locally stored computer vision model that analyzes the video to find and ultimately output key posture points&#x2F;indicators (joints, nose, ears, etc.).<p>These posture points are fed to a mathematical model that constantly compares your current posture position to the original baseline posture position that you set as your &quot;healthy posture&quot; position when starting the app.<p>Furthermore, the app applies geometrical formulas to vectors formed by your current posture position and your original baseline healthy posture position to determine if you&#x27;re slouching.<p>Your current posture position is displayed to you through a blue avatar named Zen that mirrors your posture in real-time. Zen sits in your menu bar (tray menu) and turns red when you slouch.<p>Whenever you slouch for an extended period of time, you can be alerted through a visual notification and&#x2F;or an audio alert. The alert will go away when you move back to your original baseline &quot;healthy&quot; position.<p>The majority of our power users leave Zen on throughout their workday, but our research shows that users see significant health benefits from using the app for just 10 minutes a day during short &quot;posture sessions&quot;.<p>Posture session reminders, slouch alerts, and other important settings can be customized to ensure that they align with your work style. The app is built in Electron and is currently available for Mac and Windows.<p>We&#x27;re offering Zen for free to the HN community (https:&#x2F;&#x2F;www.yayzen.com&#x2F;yc)! Our core business model is focused on selling to companies that offer Zen to employees as a benefit&#x2F;perk (similar to Calm&#x2F;Headspace).<p>We would love your feedback on the user experience and to hear more about any workday health pain points you have! Happy to offer any guidance on choosing the right chair, mouse, keyboard, and other equipment. I&#x27;ll be here all day, cheers!",
      "time": 1626370592,
      "title": "Launch HN: Zen (YC S21) – Posture correction software via webcam (2 min read)",
      "type": "story"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27847323,
      "score": 1,
      "time": 1626370230,
      "title": "Trends in Diversity of Health Care Workers in the United States, 2000 to 2019",
      "type": "story",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2781961"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 27847285,
      "score": 2,
      "time": 1626370122,
      "title": "Two drug companies fined £260m for swindling NHS over 'life-saving medicines'",
      "type": "story",
      "url": "https://news.sky.com/story/two-drug-companies-fined-163260m-for-swindling-nhs-over-life-saving-medicines-12356252"
    },
    {
      "by": "koolba",
      "descendants": 0,
      "id": 27847272,
      "score": 2,
      "time": 1626370083,
      "title": "Baltimore City Schools: 41% of high school students earn below 1.0 GPA",
      "type": "story",
      "url": "https://foxbaltimore.com/news/project-baltimore/baltimore-city-schools-41-of-high-school-students-earn-below-10-gpa"
    },
    {
      "by": "gmcharlt",
      "descendants": 0,
      "id": 27847226,
      "score": 2,
      "time": 1626369855,
      "title": "A Modest Proposal About Ransomware",
      "type": "story",
      "url": "https://blog.dshr.org/2021/07/a-modest-proposal-about-ransomware.html"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 27847219,
      "score": 1,
      "time": 1626369828,
      "title": "Verifiable Design in Modern Systems",
      "type": "story",
      "url": "https://security.googleblog.com/2021/07/verifiable-design-in-modern-systems.html"
    }
  ]
}