{
  "stories": [
    {
      "by": "83457",
      "descendants": 0,
      "id": 28672139,
      "score": 1,
      "time": 1632757621,
      "title": "Was this red tarp always there? I have no recollection of seeing this before",
      "type": "story",
      "url": "https://www.reddit.com/r/GlobalOffensive/comments/pwaec3/was_this_red_tarp_always_there_i_have_no/"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 28672129,
      "score": 1,
      "time": 1632757592,
      "title": "AWS EC2 North Virginia outage resolves but some issues linger",
      "type": "story",
      "url": "https://www.zdnet.com/article/aws-ec2-north-virginia-outage-resolves-but-some-issues-linger/"
    },
    {
      "by": "diogenesofweb",
      "descendants": 0,
      "id": 28672099,
      "score": 1,
      "time": 1632757460,
      "title": "Show HN: Simple Svelte, Vue, HTML form generator",
      "type": "story",
      "url": "https://dwarform.pages.dev/"
    },
    {
      "by": "mkotowski",
      "descendants": 0,
      "id": 28672058,
      "score": 2,
      "time": 1632757286,
      "title": "Peru’s Incan Rope Bridges Are Hanging by a Thread",
      "type": "story",
      "url": "https://www.atlasobscura.com/articles/inca-rope-bridge"
    },
    {
      "by": "henearkr",
      "descendants": 0,
      "id": 28672047,
      "score": 2,
      "text": "In the past one or two decades there have been tremendous discoveries about the brain.<p>Just to quote a few examples, the fact that the cerebellum acts as a general purpose GPU and patterns storage, the existence of a lymphatic system in the brain, the exchange of information between neurons via pseudo-viral complexes, the fact that the dendrites perform calculus at multiple levels from the soma to the synapses, the new detailed role of astrocytes, oligodendrocytes, etc...<p>So I&#x27;d like to read a good book, if possible with deep information but still accessible for the non-professional, that would include all these fresh discoveries.<p>Do any of you know such book?",
      "time": 1632757244,
      "title": "Ask HN: Anybody knows a good up-to-date book about the brain?",
      "type": "story"
    },
    {
      "by": "ValentineC",
      "descendants": 0,
      "id": 28672045,
      "score": 1,
      "time": 1632757241,
      "title": "Binance.com users in Singapore given one month to withdraw assets, redeem tokens",
      "type": "story",
      "url": "https://www.straitstimes.com/business/companies-markets/binancecom-users-in-singapore-given-one-month-to-withdraw-assets-redeem"
    },
    {
      "by": "racuna",
      "descendants": 1,
      "id": 28672021,
      "kids": [
        28672022
      ],
      "score": 1,
      "time": 1632757116,
      "title": "“Weight For Reps”: released a new version",
      "type": "story",
      "url": "https://weightxreps.net"
    },
    {
      "by": "ajoy",
      "descendants": 0,
      "id": 28672019,
      "score": 1,
      "text": "Hi HN,<p>I&#x27;ve been trying to improve my typing efficiency for a while and tried out various keyboard layouts like Dvorak, Colemak, Workman etc., but none really hit the spot.<p>All the existing layouts assume the home&#x2F;middle row is the best&#x2F;easiest to reach. But, this is not necessarily true.<p>The home row assumes all the fingers are of almost equal length, but thats not the case. In the standard placement above, the middle and ring fingers need to curve up more. When the palm is resting on the keyboard at an angle from the shoulder, the middle finger and ring fingers should naturally rest higher than the other fingers. This radically shifts the finger movement effort calculation. My hypothesis is that if we arrange the keys in such a way as to follow the natural length of different fingers, we can achieve a greater degree of efficiency.<p>This is how I came up with FITJOY.<p>As a programmer, I also realized that I tend to use the special characters a lot more than I use the numbers. So, the layout also changes the numbers row to print the special character (Eg. !#%^ etc.)  by default, and have to press Shift to enter the number.<p>* Layout file : https:&#x2F;&#x2F;github.com&#x2F;aj0y&#x2F;fitjoy<p>* Related blog post: https:&#x2F;&#x2F;ajoys.medium.com&#x2F;keyboard-layouts-brief-history-and-a-new-choice-8707b720d01f",
      "time": 1632757104,
      "title": "Show HN: Fitjoy – A more efficient keyboard layout I came up with",
      "type": "story"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28671965,
      "score": 3,
      "time": 1632756914,
      "title": "How Popperian falsification enabled the rise of neoliberalism",
      "type": "story",
      "url": "https://aeon.co/essays/how-popperian-falsification-enabled-the-rise-of-neoliberalism"
    },
    {
      "by": "yboris",
      "descendants": 0,
      "id": 28671933,
      "score": 1,
      "time": 1632756807,
      "title": "Facebook will open up the Oculus Go to tinkerers with an unlocked OS",
      "type": "story",
      "url": "https://www.engadget.com/facebook-oculus-go-operating-system-unlock-john-carmack-151000709.html"
    }
  ]
}