{
  "stories": [
    {
      "by": "elenaturner",
      "descendants": 0,
      "id": 28414223,
      "score": 1,
      "time": 1630755942,
      "title": "Financial moves to help your mental health during a financial burden",
      "type": "story",
      "url": "https://thriveglobal.com/stories/3-financial-moves-to-help-your-mental-health-in-times-of-financial-burden/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28414180,
      "score": 2,
      "time": 1630755436,
      "title": "Fish eyes grown in a petri dish from embryonic stem cells",
      "type": "story",
      "url": "https://phys.org/news/2021-09-fish-eyes-grown-petri-dish.html"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28414156,
      "score": 1,
      "time": 1630755163,
      "title": "My Personal Quest to Study Supernovae on Mars – Issue 104: Harmony",
      "type": "story",
      "url": "https://nautil.us/issue/104/harmony/my-personal-quest-to-study-supernovae-on-mars"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 28414155,
      "score": 1,
      "time": 1630755162,
      "title": "Two brutal tests – can you pass them?",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2021/09/two-brutal-tests-can-you-pass-them.html"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28414151,
      "score": 1,
      "time": 1630755127,
      "title": "Holding stellar nurseries in your hands",
      "type": "story",
      "url": "https://phys.org/news/2021-09-stellar-nurseries.html"
    },
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 28414135,
      "score": 1,
      "text": "Apologize for the clickbaity title, bit it sums out how I&#x27;ve been feeling as of late. I was always told, as I progressed through my career, this would get easier, but it feels to be the exact opposite.<p>It&#x27;s generally agreed that online applying is a crapshoot. Between automated resume screen-outs (my current issue), &quot;fake&quot; job listings posted for compliance reasons and other issues this seems to be considered the worst method. If I had to estimate: Probably around 70% of applications I&#x27;ve sent out have been ignored, and the other 30% were very quickly screened out.<p>From what I&#x27;ve seen, two alternatives are always suggested. One is to search through your network. Unfortunately I don&#x27;t really have a network. Most of my past positions are filled with lifers who are still at the company when I worked with them. Others, I just don&#x27;t have the sort of professional relationship to just reach out and ask. The other alternative is to site back and let recruiters come to you. This did not work for me. After opening up my profiles and updating my information, I had surprisingly few recruiters coming in. The ones that did were either just shopping bad roles (poor pay, body shops), spamming roles completely irrelevant to my experience (junior roles, roles that would obviously fall through as I&#x27;m not the type they&#x27;re looking for) and of course, the robotic, spammy Amazon recruiters.<p>The tiny minority of recruiters that do not fit the above category, frankly were hiring for roles that I just don&#x27;t want. My past [professional] experience has been with a specific tech stack at companies that aren&#x27;t the greatest. These are the sort of roles I get because well, it make senses, on paper I&#x27;m completely qualified. While I&#x27;m attempting to follow through with one of these because the pay seems ok, the reality is that I don&#x27;t really want another role like that. They&#x27;ve been negative to my growth both career wise and tech wise, and I&#x27;d like to take my career in another direction.<p>So then what can I do? Compared to everyone else bragging about how hot the market is, my experience has been a complete crapshoot. It&#x27;d be unlikely for me to ever land a role I really want, but can I not have any standards at this point?",
      "time": 1630754969,
      "title": "Ask HN: How to Get a Job?",
      "type": "story"
    },
    {
      "by": "adam_ellsworth",
      "descendants": 0,
      "id": 28414125,
      "kids": [
        28414188
      ],
      "score": 1,
      "time": 1630754840,
      "title": "The poetry and brief life of a Foxconn worker: Xu Lizhi (1990-2014)",
      "type": "story",
      "url": "https://libcom.org/blog/xulizhi-foxconn-suicide-poetry"
    },
    {
      "by": "edent",
      "descendants": 0,
      "id": 28414121,
      "score": 1,
      "time": 1630754812,
      "title": "What's the window size of a background tab?",
      "type": "story",
      "url": "https://shkspr.mobi/blog/2021/09/whats-the-window-size-of-a-background-tab/"
    },
    {
      "by": "summm",
      "descendants": 0,
      "id": 28414100,
      "score": 2,
      "time": 1630754601,
      "title": "German Government: Smartphones should receive updates for seven years",
      "type": "story",
      "url": "https://old.reddit.com/r/news/comments/pgmxfp/german_federal_government_smartphones_should/"
    },
    {
      "by": "wannapreneur",
      "descendants": 2,
      "id": 28414090,
      "kids": [
        28414193,
        28414131
      ],
      "score": 3,
      "text": "Which one is easy?<p>1. Would you find a tech co-founder and ask him to code?<p>2. Would you use a No-code platform to build?<p>3. Would you outsource to a development team?",
      "time": 1630754500,
      "title": "Ask HN: Dear Non-tech founders, how do you build MVPs?",
      "type": "story"
    }
  ]
}