{
  "stories": [
    {
      "by": "pipyproxy",
      "descendants": 0,
      "id": 30673418,
      "score": 1,
      "text": "Pipy is a programmable network proxy for the cloud, edge and IoT.",
      "time": 1647271023,
      "title": "Show HN: How to use Pipy proxy to create Echo Server",
      "type": "story",
      "url": "https://flomesh.io/docs/en/tutorial/02-echo"
    },
    {
      "by": "mzs",
      "descendants": 1,
      "id": 30673395,
      "kids": [
        30673424
      ],
      "score": 1,
      "time": 1647270930,
      "title": "Russia Eyes New Way to Set Ruble-Dollar Exchange Rate",
      "type": "story",
      "url": "https://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-03-14/card/russia-eyes-new-way-to-set-ruble-dollar-exchange-rate-E4idIajmXRHr3keK4CBu"
    },
    {
      "by": "hutzlibu",
      "descendants": 0,
      "id": 30673393,
      "score": 2,
      "text": "I have a (quite big) OSS project I am about to publish, and want to make at least some money with it through donations - and since that usually works out quite limited, I want to offer as many funding channels as possible, to at least get something in the end. So I also want the crypto option, but do not want to have the extra work of setting everything up and securing it.<p>So I want to add some crypto wallets on the &quot;funding page&quot;, of where people could send crypto to me.<p>Coinbase seems like a good solution as it seems, I could receive virtually all the different crypto coins through it. But it is a bit confusing as it seems a new wallet gets generated every time I click &quot;receive&quot; (for privacy reasons). So I would assume, that all those wallets are still connected to my account, but I want to be sure and the coinbase support is useless.<p>So has anyone experience with it, or other recommendations on how to proceed?",
      "time": 1647270923,
      "title": "Ask HN: Receiving crypto(with Coinbase) to fund OSS?",
      "type": "story"
    },
    {
      "by": "softwarebeware",
      "descendants": 0,
      "id": 30673366,
      "score": 1,
      "time": 1647270775,
      "title": "Tencent plunges 10% after report of record anti-money laundering fine",
      "type": "story",
      "url": "https://www.cnbc.com/2022/03/14/tencent-shares-plunge-after-report-of-record-fine-for-money-laundering.html"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 30673364,
      "score": 2,
      "time": 1647270762,
      "title": "Introduction to K-Means Clustering",
      "type": "story",
      "url": "https://www.pinecone.io/learn/k-means-clustering/"
    },
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 30673358,
      "score": 1,
      "time": 1647270730,
      "title": "An Innocent Mount Issue – iMil.net",
      "type": "story",
      "url": "https://imil.net/blog/posts/2022/an-innocent-mount-issue/"
    },
    {
      "by": "gnull",
      "descendants": 0,
      "id": 30673354,
      "score": 1,
      "time": 1647270704,
      "title": "Russian Offensive Campaign Assessment, March 13",
      "type": "story",
      "url": "https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-march-13"
    },
    {
      "by": "danfritz",
      "descendants": 0,
      "id": 30673336,
      "score": 3,
      "time": 1647270577,
      "title": "Unity Game: Farmers stealing tanks",
      "type": "story",
      "url": "https://pixelforest.itch.io/farmers-stealing-tanks"
    },
    {
      "by": "gbseventeen3331",
      "descendants": 0,
      "id": 30673321,
      "score": 2,
      "time": 1647270501,
      "title": "In Ukraine’s cyber-war with Russia, who is a civilian and what is a war crime?",
      "type": "story",
      "url": "https://restofworld.org/2022/in-ukraines-cyber-war-with-russia-who-is-a-civilian-and-what-is-a-war-crime/"
    },
    {
      "by": "lkrubner",
      "descendants": 1,
      "id": 30673282,
      "kids": [
        30673406
      ],
      "score": 3,
      "text": "I recall when git caught on, during the era 2010-2012. From 2005-2012 the companies I worked at used Subversion, but since late 2012, every company I&#x27;ve been at has used git. I used to ask, &quot;Will it be possible for everyone on the team to use this?&quot; and most proponents of git said &quot;Eventually we will develop easy GUIs so everyone can use it&quot; but it&#x27;s been more than 10 years now and it still hasn&#x27;t happened. git is popular with computer programmers, and it is only popular with computer programmers. I recall at the companies that used Subversion, it was the universal version control for everyone at the company: the CEO, the CFO, the graphic designers, the marketing team, the sales team -- anyone who had a document they wanted to save or share, they would just throw it into Subversion. On Windows, there was the TortoiseSVN client, which many people felt something akin to joy when they used.<p>I was concerned when git emerged because suddenly these organizations were riven across multiple version control systems. The CEO, the CFO, the graphic designers, the marketing team -- all of these people started using different tools, such as Basecamp or Google docs. And the computer programmers used git. I suspect this hurts an organization somewhat, chopping up its version control over so many different tools.<p>I&#x27;m curious if anyone thinks it is possible for git to ever catch up to Subversion in terms of ease of use?",
      "time": 1647270305,
      "title": "Ask HN: Can anything make Git as popular as Subversion?",
      "type": "story"
    }
  ]
}