{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31532699,
      "score": 1,
      "time": 1653674581,
      "title": "Simple MQTT broker in Node.js, local persistence, minimal stdout with Docker",
      "type": "story",
      "url": "https://github.com/nodejavascript/selfhosted-mqtt-broker-nodejs"
    },
    {
      "by": "zkirill",
      "descendants": 0,
      "id": 31532684,
      "score": 1,
      "text": "We currently use &quot;theapp.com&quot; instead of &quot;app.com&quot; and it works well enough so as not to justify paying a domain squatter (BODIS&#x2F;SecuredOffers).<p>Having said that, given that fewer startups are getting funded and tech companies are reigning in their spending, isn&#x27;t this the perfect time to make a bid?<p>If so, when would be the most advantages time to start the negotiation process with the squatter? I realize that it&#x27;s impossible to &quot;time the bottom&quot; but perhaps someone out there has a better crystal ball.",
      "time": 1653674512,
      "title": "Ask HN: Good Time to Acquire Domain?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31532656,
      "score": 1,
      "time": 1653674348,
      "title": "Burnout Is Not Your Fault",
      "type": "story",
      "url": "https://thriveglobal.com/stories/burnout-is-not-your-fault/"
    },
    {
      "by": "SuDa2103",
      "descendants": 0,
      "id": 31532650,
      "score": 1,
      "time": 1653674329,
      "title": "Music NFTs",
      "type": "story",
      "url": "https://www.newbiescrypto.com/p/music-nfts"
    },
    {
      "by": "danso",
      "descendants": 0,
      "id": 31532647,
      "score": 3,
      "time": 1653674311,
      "title": "The unstoppable machines behind the game console shortage",
      "type": "story",
      "url": "https://www.theverge.com/2022/5/25/23137789/aio-buying-bots-ps5-xbox-series-x-console-shortage"
    },
    {
      "by": "benwen",
      "descendants": 0,
      "id": 31532612,
      "score": 2,
      "time": 1653674131,
      "title": "ClojureScript and BigDecimal is a yak barbershop",
      "type": "story",
      "url": "https://blog.janetacarr.com/thoughts-on-clojurescript-and-bigdecimal/"
    },
    {
      "by": "ktamiola",
      "descendants": 0,
      "id": 31532611,
      "score": 1,
      "time": 1653674124,
      "title": "Attention Based Protein Disorder Predictor",
      "type": "story",
      "url": "https://github.com/PeptoneInc/ADOPT"
    },
    {
      "by": "Misiek_k",
      "descendants": 0,
      "id": 31532592,
      "score": 1,
      "time": 1653674031,
      "title": "How the MVPs of the billion dollar businesses got their first 1k customers",
      "type": "story",
      "url": "https://kickstartsidehustle.com/a-billion-dollar-mvp/"
    },
    {
      "by": "lolpython",
      "descendants": 0,
      "id": 31532498,
      "score": 1,
      "time": 1653673638,
      "title": "On removing APIs – Linux status bar, GNOME system tray and ElementaryOS",
      "type": "story",
      "url": "https://blog.console.dev/on-removing-apis-status-appindicators-in-gnome/"
    },
    {
      "by": "outworlder",
      "descendants": 0,
      "id": 31532493,
      "score": 1,
      "text": "Amazon is sending the following message to cloudcam owners.<p>To our valued Cloud Cam customer,<p>With your help over the last five years, Cloud Cam has served as a reliable indoor security camera and a hub for Amazon Key-compatible smart locks that work with Alexa. As the number of Alexa smart home devices continues to grow, we are focusing efforts on Ring, Blink, and other technologies that make your home smarter and simplify your everyday routines. Therefore, we have decided to no longer continue support for Amazon Cloud Cam and its companion apps.<p>What this means for you: \nOn December 2, 2022, you will no longer be able to use your Cloud Cam device or its companion apps. Until then, you will be able to download any video recordings if available. All video history will be deleted on December 2, 2022.<p>What’s next:\nTo thank you for your continuous support and feedback, we would like to offer you a complimentary Blink Mini and one-year Blink Subscription Plus Plan. Blink Mini offers customers an easy-to-use, indoor security camera experience with 1080p HD video, 2.4 GHz Wifi connectivity, night vision, motion detection, two-way audio, and works with Alexa. The Blink Subscription Plus Plan provides extra features and benefits for Blink devices – learn more https:&#x2F;&#x2F;support.blinkforhome.com&#x2F;en_US&#x2F;subscriptions&#x2F;purchasing-a-blink-subscription-plan-through-amazon#plans.<p>Prior to December 2, 2022, you will receive detailed instructions on how to redeem your free Blink Mini and Blink Subscription Plus Plan via email.<p>Downloading and deleting your video recordings:\nTo back up your videos from Cloud Cam app, go to Recorded Clips in the top right menu. Click on each individual video and click on the Download icon on the right side to save the video or click on the Trash icon next to it to delete the video. You could also delete all videos on Amazon Manage Your Content and Devices at any time.<p>If you have any questions about this, please reach out to customer service for additional information.<p>Sincerely,\nThe Amazon Cloud Cam team",
      "time": 1653673632,
      "title": "Amazon Cloud Cam end of service",
      "type": "story"
    }
  ]
}