{
  "stories": [
    {
      "by": "phoe-krk",
      "descendants": 0,
      "id": 30581213,
      "score": 1,
      "time": 1646600393,
      "title": "Russia forces services to move to Russian DNS, stop using external CDNs",
      "type": "story",
      "url": "https://twitter.com/JiriVysin/status/1500560017640067077"
    },
    {
      "by": "mindB",
      "descendants": 0,
      "id": 30581192,
      "score": 1,
      "time": 1646600252,
      "title": "This World of Ours (2014) [pdf]",
      "type": "story",
      "url": "https://scholar.harvard.edu/files/mickens/files/thisworldofours.pdf"
    },
    {
      "by": "jnsaff2",
      "descendants": 0,
      "id": 30581190,
      "score": 1,
      "time": 1646600241,
      "title": "Russian propaganda TV broadcasts hijacked by Anonymous",
      "type": "story",
      "url": "https://twitter.com/youranontv/status/1500557635686486023"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 30581187,
      "score": 2,
      "time": 1646600206,
      "title": "More Indian students opting for Canada over US due to pro-immigration policies",
      "type": "story",
      "url": "https://economictimes.indiatimes.com/nri/study/more-indian-students-opting-for-canada-over-us-due-to-pro-immigration-policies/articleshow/90030841.cms"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 30581178,
      "score": 1,
      "time": 1646600174,
      "title": "SICP: Higher-Order Procedures",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=eJeMOEiHv8c&list=PLE18841CABEA24090&index=3"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 30581161,
      "score": 1,
      "time": 1646600051,
      "title": "Car Models with the Most DUIs",
      "type": "story",
      "url": "https://insurify.com/insights/car-models-with-the-most-duis/"
    },
    {
      "by": "MilnerRoute",
      "descendants": 1,
      "id": 30581146,
      "kids": [
        30581154
      ],
      "score": 3,
      "time": 1646599929,
      "title": "Russian police arrest more than 3k protesting Ukraine invasion",
      "type": "story",
      "url": "https://www.upi.com/Top_News/World-News/2022/03/06/russian-police-arrest-3000-protesters-ukraine-invasion/3161646596821/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 30581136,
      "score": 2,
      "time": 1646599855,
      "title": "The Einstein Telescope",
      "type": "story",
      "url": "https://www.einsteintelescope.nl/en/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30581125,
      "score": 1,
      "time": 1646599737,
      "title": "Please Use Common Sense When Performing Supersets",
      "type": "story",
      "url": "https://freddiedeboer.substack.com/p/please-use-common-sense-when-performing"
    },
    {
      "by": "LeslieDewhurst",
      "descendants": 0,
      "id": 30581119,
      "score": 1,
      "text": "Not everyone knows where Ukraine is or how big it is. Geographically it’s wedged between Poland to its North West and the Black Sea to the South. Russia is on its Eastern flank. \nAnd Ukraine is big. Were it a US State it would rank number 3, just behind Texas but well ahead of California.<p>The Soviet Union has tried invading a similar sized country before and retreated in defeat 10 years later. Afghanistan shares a common border with Russia and crossing the border in 1979 was probably the only easy part of that protracted war. That invasion did have a pretext though: supporting Afghanistan’s Communist puppet regime. This conflict has no pretext: it’s simply a land-grab.<p>With a land mass of this size, the invader can close-down local TV, internet, phone lines and mobile masts but can’t control the vast majority of the country or what’s in the sky hundreds of miles above; and for most of Ukraine, satellite communication is the only means of exchanging information. Battlefield communications use a combination of localised and satellite links as these are the most resilient, but 40-odd years on from Afghanistan, locals can now have access to the same resilient comms.<p>That’s a game changer because now voice, video, text and pics can all be uploaded by just about anyone in the battlefield with an ease unprecedented in any war; and as with any satellite communication it’s almost impossible to detect at ground level, giving a distinct advantage to the locals.<p>If Russians remain Ukraine-wide, they’re going to have major challenges on at least two fronts: managing so large a country as an occupying force and winning the hearts and minds of the remaining Ukrainians. There’s also the none too trivial matter of paying for it all as financial sanctions begin to bite. This time around it’s the hearts and minds issue that will take centre stage as Ukraine has the digital means to refute any spinning of any Ukraine related content that the Russians may put out.<p>If the Russians stay, the skill base of young Ukrainians in particular is going to be decisive in foreshortening the occupation. They’re very tech savvy, talented creatively and they’ll be bursting to throw the Russians out. They won’t be using hand grenades or Molotov cocktails; instead, they’ll be blogging, posting and hacking. Their targets will be Ukrainian infrastructure that Russians now control, military communications of the old school type (much easier to hack) and Russians on the ground who are wondering why they’re there. They’ll be the target of one of the most intensive reverse propaganda campaigns ever mounted and it will all be done via satellite.<p>The invasion may have been started by boots and tanks on the ground, but it will be ended by young Ukrainians fingers and keyboards connected together far above the sky.<p>@DewhurstLeslie",
      "time": 1646599711,
      "title": "Why Satellite links will become Ukraine’s primary weapon",
      "type": "story"
    }
  ]
}