{
  "stories": [
    {
      "by": "mhb",
      "descendants": 0,
      "id": 30621656,
      "score": 1,
      "time": 1646870755,
      "title": "Sixteen Years After ‘The Road,’ Cormac McCarthy Is Publishing Two New Novels",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/08/books/cormac-mccarthy-new-novels.html"
    },
    {
      "by": "goldenskye",
      "descendants": 0,
      "id": 30621640,
      "score": 2,
      "time": 1646870622,
      "title": "Volcanoes, plague, famine and endless winter: Welcome to 536",
      "type": "story",
      "url": "https://theconversation.com/volcanoes-plague-famine-and-endless-winter-welcome-to-536-what-historians-and-scientists-believe-was-the-worst-year-to-be-alive-175654"
    },
    {
      "by": "abbe98",
      "descendants": 0,
      "id": 30621632,
      "score": 1,
      "time": 1646870550,
      "title": "Wikimedia Status",
      "type": "story",
      "url": "https://www.wikimediastatus.net"
    },
    {
      "by": "winternett",
      "descendants": 0,
      "id": 30621619,
      "score": 1,
      "text": "It worries me a bit that many private companies and retailers are totally withdrawing from Russia on top of economic sanctions, despite being implemented with the right intentions.<p>There are millions of residents that will suffer from a sudden lack of health care, food, services, and clothing if all foreign resources are totally cut from the country, including those that are protesting the war. I worry about the precedent that it sets for the future if the any other country were to go to war with China (just for example, hopefully not of course).<p>There are so many unforeseen ways that not just economies suffer in this kind of scenario now that globalism is so deeply embedded into how countries and people survive.<p>Just today I&#x27;m seeing that even video game companies are withdrawing support for their games in Russia, which really has no relatively good effect on people who are living in Russia and trying to cope with the stress of conflict that they are encountering with protests and economic terror of their savings being devalued. I am not referring at all to government-based sanctions mind you, but sanctions from private companies that have made contractual agreements with private customers being levied for Internet points really seems like a bad omen for the future to me. Would be interesting to see what HN thinks about it.<p>Even potentially helpful news and communication from scholars and brilliant independent minds in Russia is now limited in reach to the entire world over the Internet. This can happen anywhere now, and it&#x27;s troublesome to me, even despite the threat of disinformation. Disinformation management could be conducted in many ways better by social platforms than by government in my experience, but that&#x27;s a whole other discussion.<p>I am beginning to think the new &quot;social-media driven&quot; trend of companies posting that they are suspending services and distribution of goods to foreign countries should be discouraged, because it really serves to hurt non-politically-aligned citizens as much as it demonstrates a protest, and it also sets a precedent for the same action to be taken against any of us at any time in the future for reasons&#x2F;conflict we didn&#x27;t individually cause...",
      "time": 1646870446,
      "title": "Software companies suspending service to Russia creates an interesting precedent",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30621617,
      "score": 1,
      "time": 1646870438,
      "title": "PolyCoder is an open-source AI code-generator that trumps Codex",
      "type": "story",
      "url": "https://venturebeat.com/2022/03/04/researchers-open-source-code-generating-ai-they-claim-can-beat-openais-codex/"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30621615,
      "score": 1,
      "time": 1646870423,
      "title": "Uashield – UA Cyber Shield",
      "type": "story",
      "url": "https://github.com/opengs/uashield"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 30621569,
      "score": 1,
      "time": 1646870111,
      "title": "LME forced to halt nickel trading, cancel deals, after prices top $100k",
      "type": "story",
      "url": "https://www.reuters.com/business/lme-suspends-nickel-trading-day-after-prices-see-record-run-2022-03-08/"
    },
    {
      "by": "metadat",
      "descendants": 1,
      "id": 30621564,
      "kids": [
        30621572
      ],
      "score": 2,
      "time": 1646870058,
      "title": "Shattered Pixel Dungeon: The Ultimate OSS Roguelike",
      "type": "story",
      "url": "https://shatteredpixel.com/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30621563,
      "score": 1,
      "time": 1646870057,
      "title": "DIY Radiation Detection (2015)",
      "type": "story",
      "url": "http://large.stanford.edu/courses/2015/ph241/english1/"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30621553,
      "score": 1,
      "time": 1646870022,
      "title": "Cutting Russia’s fossil fuel exports: Short-term pain for long-term gain",
      "type": "story",
      "url": "https://voxeu.org/article/cutting-russia-s-fossil-fuel-exports-short-term-pain-long-term-gain"
    }
  ]
}