{
  "stories": [
    {
      "by": "desertraven",
      "descendants": 0,
      "id": 27843455,
      "score": 1,
      "time": 1626347635,
      "title": "Ask HN: What are your thoughts on aquaponics?",
      "type": "story"
    },
    {
      "by": "FabHK",
      "descendants": 0,
      "id": 27843452,
      "score": 1,
      "time": 1626347617,
      "title": "30 Years in Hong Kong",
      "type": "story",
      "url": "https://webb-site.com/articles/30years.asp"
    },
    {
      "by": "ogiberstein",
      "descendants": 0,
      "id": 27843448,
      "score": 1,
      "text": "Hi HN Community,<p>Today&#x27;s beginner investors are stuck with zero-interest rate accounts and passive investing. That might work for some but if you are interested to explore more active investing opportunities, you will soon find yourself out-traded by funds and bots who control much of the market volume.<p>We are Gabriele, Zdenek and Oleg, founders of Coinrule https:&#x2F;&#x2F;coinrule.com&#x2F;. We met back in 2017 when we were building our previous startups and met at Masschallenge, an accelerator program, in London. At that time all three of us were experimenting with cryptocurrencies investing and soon found that unless we used automation, we could not compete in a 24&#x2F;7 market. That&#x27;s when we started to think of a solution, now called Coinrule.<p>Coinrule helps beginner investor build automated rules for trading strategies, currently for cryptocurrencies but later also for other assets - it runs on top of cryptocurrency exchanges and uses an IFTTT-style interface. It&#x27;s like Zapier for investing.<p>The Cryptocurrency world came along with a lot of controversies, at the same time it gave many makers a possibility to start deconstructing finance. Also for us, cryptocurrencies are a good place to try and build a more equal way of managing your savings.<p>We are part of this market and believe in it. Our ultimate goal is to make trading more accessible and to expand Coinrule to equities, FX and later also to DeFi to give beginner investors the opportunity to manage their funds in a market full of speculators.<p>When we first started investing, we approached it from two beliefs: 1) you are unlikely to grow a portfolio without a small percentage of it allocated to more active investments and 2) tools in the market today are made by traders for advanced traders. Many of our users have learned, grown and improved as traders over the past year of using Coinrule and that&#x27;s what we think really matters.<p>Of course we understand that the HN community has a lot of cryptocurrency sceptics and we respect that. The cryptocurrency market is still full of scams and bad actors. Whether you like it or not though, it is now big enough that it is here to stay. Despite the bad reputation, there are also many genuine and hard working people trying to build technology that matters. We believe that it is worthwhile to try make cryptocurrencies an easier place to navigate for these &#x27;normal&#x27; people. If one of our users does not have the right mindset or could be vulnerable and should not be trading, we tell them that.<p>Coinrule today is registered with the UK&#x27;s Financial Conduct Authority, has transacted over $500m and is run by an international and diverse team.<p>Building a product, as you all know, is hard so we&#x27;d appreciate comments and feedback. We&#x27;d love to hear anything that helps make Coinrule better, simpler and fairer. Please try us out at https:&#x2F;&#x2F;coinrule.com! Happy to answer any questions and hear your feedback in the comments!",
      "time": 1626347535,
      "title": "Launch HN: Coinrule (YC S21) – Automated Trading Made Easy",
      "type": "story"
    },
    {
      "by": "albanesetr",
      "descendants": 0,
      "id": 27843437,
      "score": 1,
      "time": 1626347384,
      "title": "Assessing unit test quality with gap analysis",
      "type": "story",
      "url": "https://www.diffblue.com/blog/software%20development/testing/assessing-unit-test-quality-with-gap-analysis/"
    },
    {
      "by": "zlatkov",
      "descendants": 0,
      "id": 27843430,
      "score": 2,
      "time": 1626347274,
      "title": "How JavaScript Works: the evolution of graphics",
      "type": "story",
      "url": "https://blog.sessionstack.com/how-javascript-works-the-evolution-of-graphics-500e0eb764a0"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 27843426,
      "score": 1,
      "time": 1626347213,
      "title": "Steven Sinofsky on Windows 365",
      "type": "story",
      "url": "https://twitter.com/stevesi/status/1415560091240001539"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27843416,
      "score": 1,
      "time": 1626347068,
      "title": "15 Years Later, The Sims 2 Still Has Its Diehard Fans (2019)",
      "type": "story",
      "url": "https://kotaku.com/15-years-later-the-sims-2-still-has-its-diehard-fans-1834335634"
    },
    {
      "by": "_wldu",
      "descendants": 0,
      "id": 27843399,
      "score": 2,
      "time": 1626346790,
      "title": "China Taking Control of Zero Day Exploits",
      "type": "story",
      "url": "https://www.schneier.com/blog/archives/2021/07/china-taking-control-of-zero-day-exploits.html"
    },
    {
      "by": "orf",
      "descendants": 0,
      "id": 27843388,
      "score": 1,
      "time": 1626346659,
      "title": "Kremlin papers appear to show Putin’s plot to put Trump in White House",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/jul/15/kremlin-papers-appear-to-show-putins-plot-to-put-trump-in-white-house"
    },
    {
      "by": "AnthonyMontoya",
      "descendants": 1,
      "id": 27843375,
      "kids": [
        27843376
      ],
      "score": 1,
      "time": 1626346550,
      "title": "Intelligent Application Design and Development Services – Portal Development",
      "type": "story",
      "url": "https://www.anblicks.com/services/modern-apps/app-services-and-modernization/application-design-development/"
    }
  ]
}