{
  "stories": [
    {
      "by": "cpncrunch",
      "descendants": 0,
      "id": 31648416,
      "score": 1,
      "time": 1654562176,
      "title": "A 15-year-old Ukrainian drone pilot helped destroy a Russian army column",
      "type": "story",
      "url": "https://globalnews.ca/news/8893672/15-year-old-ukrainian-drone-pilot-russian-column/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31648404,
      "score": 1,
      "time": 1654562096,
      "title": "Apple announces winners of the 2022 Apple Design Awards",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2022/06/apple-announces-winners-of-the-2022-apple-design-awards/"
    },
    {
      "by": "Vaslo",
      "descendants": 0,
      "id": 31648368,
      "score": 1,
      "time": 1654561757,
      "title": "Falling roof during screening of 'Top Gun: Maverick' mistaken as special effects",
      "type": "story",
      "url": "https://www.taiwannews.com.tw/en/news/4560033"
    },
    {
      "by": "c4pt0r",
      "descendants": 0,
      "id": 31648356,
      "score": 2,
      "time": 1654561627,
      "title": "TiKV: A High Performance Transactional Key-Value Database",
      "type": "story",
      "url": "https://github.com/tikv/tikv"
    },
    {
      "by": "Vaslo",
      "descendants": 0,
      "id": 31648347,
      "score": 1,
      "time": 1654561590,
      "title": "James Webb Space Telescope's first full-color images revealed on July 12th",
      "type": "story",
      "url": "https://www.engadget.com/james-webb-space-telescope-first-full-color-images-release-date-spectroscopic-data-180056334.html"
    },
    {
      "by": "andrecarini",
      "descendants": 0,
      "id": 31648326,
      "score": 2,
      "text": "With all the news about the Apple M2 and the people excited to sunset their couple years old computers, I feel compelled to share my reality (and that of many others outside the HN bubble).<p>I&#x27;m a 27 years old software developer from Brazil. The computer in question was assembled in 2007 from parts that were mostly bought abroad (and then gifted to me) by a wealthier relative that was visiting. That&#x27;s a key point: the currency exchange rates and the import taxes make electronics out of reach for the common folks.<p>That was an AMD2+ motherboard, 4GB of DDR2, a 5400 RPM rust spinner, and a Phenom X4 coupled with an ATI 4870.<p>Although the household was never in a dire situation financially, I had always been taught by example to fix things and keep using them for as long as possible. Even back in elementary school times I would troubleshoot computer issues myself and brush off dust from the components.<p>Yes, there have been hardware failures since 2007: two HDDs died (about 6 years lifespan for each), the 4870 died (but I extended its life for one more year with the bake-it-in-the-oven trick), one DIMM failure, a PSU blowout and a CPU cooler bracket mechanical failure.<p>All replacements that had to be purchased would cost me a significant amount of money. HDDs and PSUs were not that expensive, but GPUs were out of reach. When that DIMM died in 2018, I purchased an used and dusty DDR2 replacement kit off AliExpress.<p>After the pandemic hit and I got my first proper (remote) job in 2020, I splurged and replaced some components: a hand-me-down GPU from a wealthier friend (I had been using the onboard graphics since the 4870 died), an AMD3 motherboard, a Phenom II X4 and some DDR3, all used and from AliExpress.<p>The monitor, a 22&quot; TFT panel from Samsung, is still kicking since 2007 with a couple of dead pixels. Same goes for the mouse, manufactured by an unknown Chinese brand, and a membrane keyboard that I completely disassembled and scrubbed clean under a running faucet.<p>Even with my career finally taking off (I&#x27;m due to complete undergraduate Computer Science this year) I don&#x27;t see myself doing major upgrades&#x2F;purchases any soon.<p>When was the last time you gave something extra life instead of throwing it away?",
      "time": 1654561367,
      "title": "Tell HN: I used the same computer since 2007 (with minor upgrades)",
      "type": "story"
    },
    {
      "by": "Ariarule",
      "descendants": 1,
      "id": 31648323,
      "kids": [
        31648423
      ],
      "score": 1,
      "time": 1654561309,
      "title": "My Bet: AI Size Solves Flubs",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/my-bet-ai-size-solves-flubs"
    },
    {
      "by": "ddtaylor",
      "descendants": 1,
      "id": 31648309,
      "kids": [
        31648363
      ],
      "score": 1,
      "time": 1654561213,
      "title": "Tim Hortons coffee app broke law by constantly recording users’ movements",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/06/tim-hortons-coffee-app-broke-law-by-constantly-recording-users-movements/"
    },
    {
      "by": "stevenjgarner",
      "descendants": 0,
      "id": 31648274,
      "score": 1,
      "text": "Anyone have experience placing 10s-100s of computers into paid service (e.g. MQL5 [1], Digital Coin Generation [2], Golem P2P network [3], MinePrize [4], etc) or with distributed decentralized storage (SiaCoin [5] vs Storj [6] vs Filecoin [7])?  Is it worth the effort? Best practices?  Any exacerbated security or support concerns?  What about altruistic grid computing through BOINC, Rosetta@home etc?  Assume enterprise class computers and networking with tier 1 gigabit Internet.<p>[1] https:&#x2F;&#x2F;cloud.mql5.com&#x2F;en<p>[2] http:&#x2F;&#x2F;digitalcoingeneration.weebly.com&#x2F;<p>[3] https:&#x2F;&#x2F;www.golem.network&#x2F;<p>[4] https:&#x2F;&#x2F;mineprize.com&#x2F;<p>[5] https:&#x2F;&#x2F;sia.tech&#x2F;<p>[6] https:&#x2F;&#x2F;www.storj.io&#x2F;<p>[7] https:&#x2F;&#x2F;filecoin.io&#x2F;",
      "time": 1654560942,
      "title": "Ask HN: Pros and cons placing idle computers to work outside business hours?",
      "type": "story"
    },
    {
      "by": "kjeetgill",
      "descendants": 0,
      "id": 31648271,
      "score": 1,
      "time": 1654560930,
      "title": "Tirzepatide: Once Weekly for the Treatment of Obesity",
      "type": "story",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2206038"
    }
  ]
}