{
  "stories": [
    null,
    null,
    {
      "by": "mikhael",
      "descendants": 0,
      "id": 29729840,
      "score": 1,
      "time": 1640810979,
      "title": "Tokyo researchers work toward dream Covid-19 vaccine giving protection for life",
      "type": "story",
      "url": "https://www.japantimes.co.jp/news/2021/12/29/national/science-health/one-shot-lifetime-covid-vaccine/"
    },
    {
      "by": "88840-8855",
      "descendants": 0,
      "id": 29729822,
      "score": 1,
      "text": "I just received a letter from my electricy supplier. They are bankrupt and I am exposed to 80Cents&#x2F;kwh now as they stop delivering electricity immediatly.<p>Here is a brief summary of the electricity crisis in Germany:<p>Consumer electricity prices in Germany climb to record high despite a warm winter. Not only mine, but alreadt several electricity prodivers went bankrupt in the past days. The price available to consumers is now 45-80 Cents&#x2F;kwh. Many providers have stopped accepting new customers as they need to recalculate their propositions, leaving consumers exposed to the &quot;basic supply&quot; which has reached 80 Eurocents per kwh in many regions. My plan is now to take a contract that I can terminate monthly and hope that the situation will improve. If they accept my application,  I will have to pay 65 Eurocents per kwh starting now.<p>The bad news is: starting 1st of Jan the prices will increase even further due to an increased CO2 tax and the Green Party has announced to further push this tax up. However, I hope that the underlying effect will improve and lead to an overall price reduction.<p>At the same time, 3 of 6 nuclear power plants will be shut down on 31st December 2021 - in 2 days. As the Green Party does want to accelerate the transition to e-mobility, projections show that we have a demand for several new natural gas power plants in Germany. Unfortunately, due to political tentions with Russia, Germany is working closely with the United States to import LNG. It is not only more expenuse, but also dirty as fracked gas has a similar CO2 balance as coal and a horrible environmental impact.<p>The solution that Germany has to meet electrity demand is to further buy electrity from neighbors that are expanding their nuclear power plant capacity even further.<p>I am shocked and not prepared. Luckily I can pay that but I can imagine that this might drive an increase of prices for everyday goods - and lead to a errosion of our industrial competitiveness.",
      "time": 1640810922,
      "title": "Consumer electricity prices in Germany climb to record high: 45-80 Cents/kwh",
      "type": "story"
    },
    {
      "by": "thrusong",
      "descendants": 0,
      "id": 29729819,
      "score": 1,
      "time": 1640810903,
      "title": "If Planet Nine exists, why has no one seen it?",
      "type": "story",
      "url": "https://www.bbc.com/future/article/20210216-the-massive-planet-scientists-cant-find"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29729792,
      "score": 1,
      "time": 1640810775,
      "title": "At Least 70 Free-Floating Planets Discovered in a Nearby Region of the Milky Way",
      "type": "story",
      "url": "https://scitechdaily.com/at-least-70-free-floating-planets-discovered-in-a-nearby-region-of-the-milky-way/"
    },
    {
      "by": "RansomStark",
      "descendants": 0,
      "id": 29729772,
      "score": 1,
      "time": 1640810686,
      "title": "Data and community can save Zanzibar’s mangroves",
      "type": "story",
      "url": "https://www.aboutamazon.com/news/aws/climate-next-how-data-and-community-can-save-zanzibars-mangroves"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29729769,
      "score": 1,
      "time": 1640810639,
      "title": "The year in inequality in 10 charts",
      "type": "story",
      "url": "https://inequality.org/great-divide/year-in-inequality-10-charts/"
    },
    {
      "by": "another_comment",
      "descendants": 1,
      "id": 29729709,
      "kids": [
        29729804
      ],
      "score": 3,
      "text": "So I was sending an SMS to my friend using Twilio.  And it got rejected as violating carrier guidelines.  It was about masks, not even controversial.  I tried to send my friend a copy&#x2F;paste of the twilio error message and this was rejected as violating carrier guidelines.<p>Can anyone reproduce this?<p>Sending this via SMS gets rejected:\n&quot;Verizon (Error: 30007) Carrier violation. Your message content was flagged as going against carrier guidelines.&quot;<p>Sending this does not:\n(Error: 30007) Carrier violation. Your message content was flagged as going against carrier guidelines.&quot;<p>The only difference is adding the word Verizon.  And by the way Verizon, why is a Twilio error message considered harmful enough to filter?",
      "time": 1640810377,
      "title": "Verizon Rejecting Twilio Error Message as Violating Carrier Guidelines",
      "type": "story"
    },
    {
      "by": "finite_jest",
      "descendants": 0,
      "id": 29729699,
      "score": 1,
      "time": 1640810337,
      "title": "Clemens Non Papa",
      "type": "story",
      "url": "https://johncarlosbaez.wordpress.com/2021/12/25/clemens-non-papa/"
    }
  ]
}