{
  "stories": [
    {
      "by": "kblev",
      "descendants": 0,
      "id": 30461929,
      "score": 1,
      "time": 1645746245,
      "title": "Ukraine loses control of Chernobyl site; increase in radiation detected",
      "type": "story",
      "url": "https://journalrecord.com/2022/02/24/ukraine-loses-control-of-chernobyl-site-increase-in-radiation-detected/"
    },
    {
      "by": "alexstoica",
      "descendants": 0,
      "id": 30461909,
      "score": 1,
      "text": "Hey HN,<p>I&#x27;m looking for advice on calculating the market value for my business.<p>At the beginning of this year, my partner and I decided to part ways and sell our business that started as a side project in October 2013. Over the years we received several offers but never seriously discussed this option. Unfortunately, last year the pandemic changed our priorities. I have to mention that we live in Eastern Europe.<p>Let me briefly describe our biz - it&#x27;s a SaaS project that has generated over $2.5 million to date. 99% of the revenue is subscription based – mainly B2B. Refunds under 1%. Everything was processed through PayPal from the beginning - same account.<p>The problem is, we never incorporated a company for this project. So everything was done in our name.<p>How can I figure out our market worth?<p>Thanks for your help!<p>Edit: I have no experience selling a business, that&#x27;s why I ask.",
      "time": 1645746136,
      "title": "Ask HN: Need your help determining the market value of my business",
      "type": "story"
    },
    {
      "by": "d0ne",
      "descendants": 0,
      "id": 30461860,
      "score": 1,
      "time": 1645745823,
      "title": "Federal Data and Individual Rights: Computer Matching and Privacy Protection Act",
      "type": "story",
      "url": "https://crsreports.congress.gov/product/pdf/IF/IF12053"
    },
    {
      "by": "jameslk",
      "descendants": 0,
      "id": 30461858,
      "score": 1,
      "time": 1645745812,
      "title": "Colorado to Accept Crypto for Tax Payments by End of Summer",
      "type": "story",
      "url": "https://www.coindesk.com/policy/2022/02/16/colorado-to-accept-crypto-for-tax-payments-by-end-of-summer/"
    },
    {
      "by": "ssklash",
      "descendants": 0,
      "id": 30461854,
      "score": 1,
      "time": 1645745774,
      "title": "Would Banning Russia from Getting Software Updates Make It Easier to Hack?",
      "type": "story",
      "url": "https://www.vice.com/en/article/akvyvb/would-banning-russia-from-getting-software-updates-make-it-easier-to-hack"
    },
    {
      "by": "mastazi",
      "descendants": 1,
      "id": 30461843,
      "kids": [
        30461891
      ],
      "score": 1,
      "time": 1645745707,
      "title": "Fighting fire with fire: can Aboriginal knowledge save the world from burning?",
      "type": "story",
      "url": "https://www.economist.com/1843/2022/02/18/fighting-fire-with-fire-can-aboriginal-knowledge-save-the-world-from-burning"
    },
    {
      "by": "porkbrain",
      "descendants": 0,
      "id": 30461836,
      "score": 1,
      "time": 1645745675,
      "title": "Ubuntu (Philosophy)",
      "type": "story",
      "url": "https://www.newworldencyclopedia.org/entry/Ubuntu_(philosophy)"
    },
    {
      "by": "daigoba66",
      "descendants": 0,
      "id": 30461832,
      "score": 1,
      "time": 1645745658,
      "title": "PostgreSQL at Scale: Database Schema Changes Without Downtime",
      "type": "story",
      "url": "https://gist.github.com/jcoleman/1e6ad1bf8de454c166da94b67537758b"
    },
    {
      "by": "fikrikadim",
      "descendants": 1,
      "id": 30461828,
      "kids": [
        30461904
      ],
      "score": 1,
      "time": 1645745620,
      "title": "Melting glaciers issue stark reminder of global warming impact",
      "type": "story",
      "url": "https://www.technoscience.fikrikadim.com/2022/02/24/melting-glaciers-issue-stark-reminder-of-global-warming-impact/"
    },
    {
      "by": "pedrolins",
      "descendants": 0,
      "id": 30461825,
      "score": 1,
      "text": "Hello HN, I&#x27;d love some advice on live video processing for a hobby project I&#x27;m working on.<p>I&#x27;m currently working on placing a live camera on a beach. My current setup leaves a lot to be desired, but my main problem has been with video-processing-related stuff which I have had no contact with as a developer until now.<p>It consists of a camera-equipped microcontroller connected to WiFi that is constantly sending JPEGs to a server through HTTP POST requests. On the server side, these JPEGs get saved as files in a folder which in turn are converted to an RTMP live video feed - using ffmpeg - which gets sent to a streaming platform (Twitch or Youtube).<p>There are problems with my current approach mainly that ffmpeg &quot;finishes&quot; converting my JPEGs mid &quot;transmission&quot; (I use quotes here because all that means is that my microcontroller is still sending JPEGs to the server).<p>I searched extensively but I&#x27;ve had trouble formulating the queries given how specific my use-case seems to be, and have had little success in this regard. That leads me into believing that I&#x27;m commiting mistakes in my approach to this project - which is of no surprise, given my lack of experience in video, specially streaming.<p>So I&#x27;d like some pointers or suggestions from you - it could be pointed at any part of the process I&#x27;m currently doing, though what made me write this in the first place was the video streaming problems I&#x27;m facing. It could be general resources into encoders, decoders, transcoders, video in general... Or even just comment what you&#x27;d change to make streaming work.<p>Perhaps as a way of being more direct: how does can &quot;generic&quot; - as in normal practice - livestreaming be achieved without the help of something like OBS?<p>Thank you.",
      "time": 1645745612,
      "title": "Ask HN: Advice on a live video processing project",
      "type": "story"
    }
  ]
}