{
  "stories": [
    {
      "by": "marius_k",
      "descendants": 0,
      "id": 30510973,
      "score": 1,
      "text": "So let&#x27;s say we have a set of wallets which are used to support terrorist organizations. Can we write a patched BTC&#x2F;ETH clients&#x2F;miners to freeze those wallets? This way we can perform &gt;50% counter attack on terrorists?<p>I am not blockchain expert, sorry if this sounds stupid.<p>I am asking this because I can&#x27;t stay rest seeing Ukrainian civilians being killed by bombarding residential areas.",
      "time": 1646121276,
      "title": "Ask HN: Is it possible to create counter-terrorist consensus on blockchain?",
      "type": "story"
    },
    {
      "by": "ziodave",
      "descendants": 0,
      "id": 30510949,
      "score": 1,
      "time": 1646121092,
      "title": "How you block a country in 8 steps in Cloudflare",
      "type": "story",
      "url": "https://twitter.com/ziodave/status/1498558856582025218"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 30510944,
      "score": 1,
      "time": 1646121063,
      "title": "IBM cannot kill this age-discrimination lawsuit linked to CEO",
      "type": "story",
      "url": "https://www.theregister.com/2022/02/25/ibm_motion_age_discrimination/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30510933,
      "score": 1,
      "time": 1646120922,
      "title": "Quantum Friction Explains Water’s Freaky Flow",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/quantum-friction-explains-waters-freaky-flow/"
    },
    {
      "by": "atdrummond",
      "descendants": 0,
      "id": 30510928,
      "score": 3,
      "text": "As part of my startup&#x27;s remit, I do a lot of work with clients&#x27; SWIFT payments. I feel like the media has done a very poor job explaining what SWIFT is and how exactly it works.<p>SWIFT exists not for the purpose of providing the rail(s) upon which money moves but to be the messaging system which coordinates said transfers. When sending funds (typically done via a document called a MT103, which is a text file with specific formatting requirements) one informs the recipient institution by sending a SWIFT message. When it is time for the banks to actually move the funds (which often times occurs significantly after the funds are made available to the client in question) this will be coordinated through a payment system. In most cases in Europe, this is TARGET2. However, as Russia is not a member of the Eurozone, many of their impacted payments will likely be on the STEP2 payment network, which is the only European-wide clearing house. (However, these days, it isn&#x27;t uncommon for banks to work together to use multiple clearing houses across multiple jurisdictions to most efficiently move funds.)<p>From what I understand from banks and clients we work with who have a significant Eastern European nexus, Russia was already experiencing problems with the payment systems before the formal SWIFT bans were announced and that the effective shutdown of central bank settlements for Russia has served to bring international payments coordination for RU based institutions to a crawl.<p>Happy to add clarification where it could be useful.",
      "time": 1646120888,
      "title": "Tell HN: SWIFT is not a payments transfer system",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 30510905,
      "score": 4,
      "time": 1646120651,
      "title": "Microsoft: Russia invasion of Ukraine ‘unlawful, unjustified’",
      "type": "story",
      "url": "https://www.theregister.com/2022/03/01/microsoft-russia-ukraine/"
    },
    {
      "by": "adityapatadia",
      "descendants": 0,
      "id": 30510876,
      "score": 2,
      "time": 1646120393,
      "title": "How to batch convert images using macOS terminal",
      "type": "story",
      "url": "https://www.gumlet.com/learn/how-to-batch-convert-images-using-macos-terminal/"
    },
    {
      "by": "mudita",
      "descendants": 0,
      "id": 30510861,
      "score": 1,
      "time": 1646120244,
      "title": "Loving Awareness as Anti-Meme",
      "type": "story",
      "url": "https://sashachapin.substack.com/p/loving-awareness-as-anti-meme"
    },
    {
      "by": "twapi",
      "descendants": 0,
      "id": 30510854,
      "score": 1,
      "time": 1646120163,
      "title": "The Maharaja Who Saved Hundreds of Polish Orphans – Article – Culture.pl",
      "type": "story",
      "url": "https://culture.pl/en/article/the-maharaja-who-saved-hundreds-of-polish-orphans"
    },
    {
      "by": "omnitheorist",
      "descendants": 1,
      "id": 30510842,
      "kids": [
        30510895
      ],
      "score": 2,
      "text": "I&#x27;ve recently been listening to Lex Fridman&#x27;s podcast while I go on walks, etc. I enjoy the diversity and calibre of guests he has, but I&#x27;d like to broaden my podcast listening a bit. What podcasts do you recommend in the same vein?",
      "time": 1646120060,
      "title": "Ask HN: Podcasts Like Lex Fridman's?",
      "type": "story"
    }
  ]
}