{
  "stories": [
    {
      "by": "smellingwood",
      "descendants": 0,
      "id": 29706701,
      "score": 1,
      "text": "Application context:\nCurrently a fairly basic .NET application that has been dead in the water for a bit due to the original author leaving the company. A few tables, a few pages, fairly simple AWS API calls. From what I can tell, not a compute intensive application.<p>Company context:\nSmall, been frozen for some time due to the developer not working on the code at all, hard to hire for the codebase without spending a lot of money that they don&#x27;t have. Ideally having me come in, within 4-6 months having a slightly improved version of the application up and running, but on a more common stack. I would be in charge of hiring new developers to work with me on the project right away.<p>My background:\nBeen working in Python for about 5 years, the past 2 years have been very intense on Python. The past year I have been working in Go as well. We have moved some of our API&#x27;s to Go due to the speed gains from the migration. I would say I am significantly more comfortable with Python, but I know the performance I can get from Go is very nice.<p>The ask:\nWhich language do I migrate the backend API&#x27;s to? I have been torn between the two languages. Python would be the fastest off the ground for me, since that is what I am more comfortable with, but Go might be more &quot;future-proof&quot;? What if we implement some more compute heavy features that may benefit from the speedup of Go? I believe the timeline is doable for both languages, with Python getting finished sooner I am sure. Is it worth taking the risk of maybe running up on the deadline with Go?<p>Any suggestions on frontend are also welcome, currently just going with React due to my own past experience.",
      "time": 1640638696,
      "title": "Ask HN: Which Language(s) to Migrate Application To?",
      "type": "story"
    },
    {
      "by": "paavohtl",
      "descendants": 0,
      "id": 29706695,
      "score": 1,
      "time": 1640638665,
      "title": "Bypassing early 2000s copy protection for software preservation",
      "type": "story",
      "url": "https://blog.paavo.me/masa-copy-protection/"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 29706693,
      "score": 1,
      "time": 1640638657,
      "title": "5 Internet Technology Predictions for 2022",
      "type": "story",
      "url": "https://thenewstack.io/5-internet-technology-predictions-for-2022/"
    },
    {
      "by": "maartenh",
      "descendants": 0,
      "id": 29706677,
      "score": 1,
      "time": 1640638567,
      "title": "Has Google won the cloud storage wars?",
      "type": "story",
      "url": "https://www.techradar.com/news/exclusive-has-google-won-the-cloud-storage-wars"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29706647,
      "score": 1,
      "time": 1640638327,
      "title": "Richard Marcinko, Founding Commander of Seal Team 6, Dies at 81",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/27/us/richard-marcinko-dead.html"
    },
    {
      "by": "kamrau",
      "descendants": 0,
      "id": 29706639,
      "score": 1,
      "time": 1640638300,
      "title": "Iptv Replacement",
      "type": "story",
      "url": "http://jackal.surge.sh"
    },
    {
      "by": "purplesnowflake",
      "descendants": 0,
      "id": 29706636,
      "score": 1,
      "time": 1640638294,
      "title": "The Biggest Crypto-Heists of 2021",
      "type": "story",
      "url": "https://gizmodo.com/6-of-the-biggest-crypto-heists-of-2021-1848262016"
    },
    {
      "by": "purplesnowflake",
      "descendants": 0,
      "id": 29706628,
      "score": 2,
      "time": 1640638244,
      "title": "Russia Blocks Privacy Service Tor in Latest Move to Control Internet",
      "type": "story",
      "url": "https://www.rferl.org/a/russia-blocks-tor-internet/31599622.html"
    },
    {
      "by": "ebenh",
      "descendants": 0,
      "id": 29706615,
      "score": 1,
      "time": 1640638133,
      "title": "Recursive Algorithms for Ethiopic Numerals",
      "type": "story",
      "url": "https://blog.derso.org/recursive-algorithms-for-geez-numerals/"
    },
    {
      "by": "pookietuesdays",
      "descendants": 1,
      "id": 29706613,
      "kids": [
        29706717
      ],
      "score": 3,
      "text": "I am 28 and a third-year medical student with a minor in CS from undergrad (biology major). I like medicine but I really don&#x27;t feel it&#x27;s my calling.<p>I do however enjoy software engineering but admittedly, I have never done it outside of my own hobbies, which it&#x27;s been many years since I&#x27;ve coded. Therefore, I don&#x27;t know if I would love it because doing it as a career is much different than toying around on things I&#x27;m interested in. I&#x27;m really interested in backend  &amp; API engineering and building scalable systems, things like applications that support huge loads and concurrency and learning that at large organizations and then eventually helping a  startup scale up as an early engineer.<p>I was interested in software engineering as a career (and finishing with a CS degree with the CS credits I&#x27;ve completed from undergrad), but as Paul Graham most famously said not to hire engineers over 30.<p>While that, as an absolute, may be BS, I do have a lurking fear there is <i>some</i> truth to that, and that I&#x27;ll never fit in at this stage in my life.<p>From software engineers I&#x27;ve asked there seems to be an implicit agreement that ageism is very real against older developers. I am also worried because if I get started at this point, I would be way behind people who started right out of college and I&#x27;d be in my 40s by the time I could catch up financially.<p>I am also worried about employability after 40, when almost everyone will be significantly younger than me, and then being laid off and afterwards finding it very difficult to find a job.<p>So while I understand I can get a job in the near future, I am terrified of long-term prospects. For context, I really don&#x27;t have any money saved and am in debt because of school loans.<p>I feel as if I&#x27;ve already gone too deep in the hole and that I should just only do programming after my residency is over. I am not happy at all, but changing careers also has to make financial sense and if I am going to be discriminated against just because of my age then I don&#x27;t think it is worth it.<p>Many people have told me &quot;do what your heart wants&quot; but they don&#x27;t wake up with my debt.<p>Would love your opinions! (also thank you for reading. I know this is a sensitive topic and been asked about before, but I am curious about any new insight gained post-pandemic during the emergence of remote-first work cultures)",
      "time": 1640638109,
      "title": "At what age is “too old” to work in tech as a software engineer?",
      "type": "story"
    }
  ]
}