{
  "stories": [
    {
      "by": "ihojman",
      "descendants": 0,
      "id": 27887301,
      "score": 1,
      "time": 1626729108,
      "title": "Google Exec Let Go over 10k Word Manifesto on Israel, Jews and Antisemitism",
      "type": "story",
      "url": "https://www.haaretz.com./us-news/.premium-for-second-time-this-month-senior-executive-leaves-google-after-antisemitic-post-1.10013352"
    },
    {
      "by": "anarbadalov",
      "descendants": 0,
      "id": 27887298,
      "score": 1,
      "time": 1626729087,
      "title": "The Voices in Our Heads",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2017/01/09/the-voices-in-our-heads"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 27887285,
      "score": 1,
      "time": 1626729000,
      "title": "Sea Monsters The science of rogue waves",
      "type": "story",
      "url": "https://www.cabinetmagazine.org/issues/16/kastner.php"
    },
    {
      "by": "paxys",
      "descendants": 0,
      "id": 27887268,
      "score": 1,
      "text": "I was on a work visa in the US for the longest time and wasn’t allowed to earn anything outside of my paychecks. I just became a permanent resident and so have a lot more options open to me.<p>I don’t want to build the next hot startup, make a billion dollars or anything of the sort. I have a great job and my employer is pretty cool about moonlighting as long as there are no conflicts and it doesn’t affect my work. I want to commit 1-2 hours a day and some weekends — all from home — to try and build an alternate income stream, partially for the experience and partially to earn some “fun money”.<p>I am skilled in all things tech and programming, but that’s about it. Has anyone had any luck in this area, or have stories to share?",
      "time": 1626728892,
      "title": "Ask HN: How do you make money on the side?",
      "type": "story"
    },
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 27887262,
      "score": 1,
      "time": 1626728830,
      "title": "Dow suffers biggest drop of the year as Delta variant fears hit Wall Street hard",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_3d9922ef46bcc3cbe3086b8013501195"
    },
    {
      "by": "werbel",
      "descendants": 0,
      "id": 27887254,
      "score": 3,
      "text": "Hello everyone,<p>Most of you already know this, however, if it&#x27;s a food for thought or a reminder for at least one person, it&#x27;s definitely worth it.<p>• Please, never leave candidates in recruitment process without reply. •<p>Recently I had an actual pleasure interviewing with quite young and promising startup. Four meetings with three technical founders. Great moods and immediate, positive, mutual feedback. Last one ended with “We’re going to debrief today and let you know what the next steps are”… and then nothing.<p>Personally, I don’t mind. It’s more of a red flag for me than disappointment. I’m also 100% OK being rejected as I understand that with such a small team, even purely personal, vague hunch is enough to make such decision. By now, as probably most of you, I’m also confident enough in my value that it doesn&#x27;t affect me directly in a negative way.<p>Not everyone is in a such fortunate position though. For people at the beginning of their careers and those struggling with self-esteem for any other reason, this can be literal torment. Getting a decent job, they’ve spent a lot of time preparing for, is such an important foundation that everything else is on hold in their life until that happens.<p>As a friend, partner, or a mentor, I’ve rode a passenger seat of weeks-long roller-coaster rides from excitement to doubt. I’ve witnessed months of stress from being stuck in a limbo. I’ve seen last bits of self-confidence being completely stripped away and depressions deepened when no reply hits as “I’m not even worth a short email”.<p>It doesn’t have to be complete lack of response and reactions don’t have to be so severe. Yet, while from a company perspective recruitment process of a single person might start and finish within half an hour, on the other side it could be even years of rejection.<p>I’m not asking for charity and it shouldn’t affect actual hiring decision. However, on behalf of those that don’t have their voice in professional environment yet, I’m pleading for •compassion•. Simply by keeping them as informed as you can, as promptly as you can.<p>For you, the recruitment team in your company, or anyone else in your network, it might be a minute of effort to write “We’ll get back to you by the end of next week” or “Unfortunately, we decided not to move forward”. For the recipient, simply knowing where they stand can make the biggest difference in the world.",
      "time": 1626728776,
      "title": "Tell HN: Don't leave candidates without reply",
      "type": "story"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 27887250,
      "score": 3,
      "time": 1626728760,
      "title": "Apple under pressure over iPhone security after NSO spyware claims",
      "type": "story",
      "url": "https://www.ft.com/content/898e14b1-a4e1-4443-8d9a-8b5ff5238396"
    },
    {
      "by": "woldemariam",
      "descendants": 0,
      "id": 27887236,
      "score": 1,
      "time": 1626728667,
      "title": "It’s been 20 years since it felt like an elephant was sitting on my chest",
      "type": "story",
      "url": "https://www.washingtonpost.com/local/heart-attack-ambulance/2021/07/19/d3106dc6-e8a3-11eb-8950-d73b3e93ff7f_story.html"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 27887234,
      "score": 1,
      "time": 1626728641,
      "title": "Midpoint Circle Algorithm",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Midpoint_circle_algorithm"
    },
    {
      "by": "e2e4",
      "descendants": 1,
      "id": 27887228,
      "kids": [
        27887275
      ],
      "score": 1,
      "time": 1626728610,
      "title": "Toyota cancels Tokyo Games-themed TV ads in Japan",
      "type": "story",
      "url": "https://www3.nhk.or.jp/nhkworld/en/news/20210719_32/"
    }
  ]
}