{
  "stories": [
    {
      "by": "WayToDoor",
      "descendants": 0,
      "id": 30330144,
      "score": 1,
      "time": 1644832065,
      "title": "Text Rendering Hates You",
      "type": "story",
      "url": "https://gankra.github.io/blah/text-hates-you/"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 30330137,
      "score": 1,
      "time": 1644831992,
      "title": "Animal Mistreatment at Neuralink",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=-YnmYKDCRTQ"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30330135,
      "score": 1,
      "time": 1644831982,
      "title": "Cointelpro",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/COINTELPRO"
    },
    {
      "by": "nithivandhana",
      "descendants": 0,
      "id": 30330113,
      "score": 2,
      "time": 1644831816,
      "title": "Metaverse Development Platform – Maticz",
      "type": "story",
      "url": "https://maticz.com/metaverse-development-company"
    },
    {
      "by": "rl1987",
      "descendants": 0,
      "id": 30330107,
      "score": 1,
      "time": 1644831756,
      "title": "Captcha solver services for scraping and automation",
      "type": "story",
      "url": "https://www.trickster.dev/post/captcha-solver-services-for-scraping-and-automation/"
    },
    {
      "by": "nithivandhana",
      "descendants": 0,
      "id": 30330106,
      "score": 2,
      "time": 1644831752,
      "title": "How to Create Metaverse?",
      "type": "story",
      "url": "https://maticz.com/how-to-create-metaverse"
    },
    {
      "by": "throwaway834768",
      "descendants": 0,
      "id": 30330088,
      "score": 1,
      "text": "What do you do in the following case:<p>- You have have gained some insights about a specific domain, to solve some challenges in this domain<p>- You want to setup an organisation to solve this problem<p>- The insights are completely paradigm shifting. When you talk to others about the problem, and solutions. You can see they are not getting to the root causes. They are just scratching at the surface.<p>- The vision of what this organisation could be, and the change it could initiate drives fear in you<p>- You are afraid of telling people what the idea &amp;  plan (how to) because you think they will call you crazy!<p>* As an example :<p>We have a hypothetical world, tataoine. On tatoine there are tribes, and all tribes resolve conflict between each other by fighting. They never do anything else.<p>So an entire industry has popped up in order to build swords\n - 95% of people are building swords in the same way for generations.<p>- Some forward thinking folks have come about and said your methods of building swords are not optimal. So they have optimised the method of building<p>- Some other folks have come about and said maybe we need new types of swords, so now they are building light sabres<p>NOW:<p>- This insight began with some first principals thinking. What should this thing actually be, no other assumptions. How can we actually solve for the right problem (resolving conflict)<p>- The realisation is that sword makers are producing swords for a world that no longer requires swords, but everyone still continues because they think its best<p><pre><code>  -  Because there is so much swords produced, organisations spring up to architect &quot;conflict&quot; so that they can leverage the swords\n</code></pre>\n- This is what keeps the system going<p>- Along comes someone and says, hey instead of first resorting to war. Maybe we should just speak to each other first.<p>- Completely different paradigm on how to resolve conflict)<p>Insight was gained due to my own struggle with trying to solve a challenge in my own personal life, and not finding any satisfactory solutions.<p>* This is just an example, the insight has nothing to do with ACTUAL war. Just wanted to throw in the light sabre reference :)",
      "time": 1644831521,
      "title": "Ask HN: What do you do when your insight (& vision) scares you?",
      "type": "story"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30330086,
      "score": 1,
      "time": 1644831452,
      "title": "Raspberry Pi In-Car Ads-B Display – With Rust",
      "type": "story",
      "url": "https://rsadsb.github.io/rasp-pi-display.html#raspberry-pi-in-car-ads-b-display---with-rust"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30330084,
      "score": 1,
      "time": 1644831436,
      "title": "Tilt-Shift",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Tilt%E2%80%93shift_photography"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30330053,
      "score": 1,
      "time": 1644831176,
      "title": "Retool – Build internal tools, remarkably fast",
      "type": "story",
      "url": "https://retool.com/"
    }
  ]
}