{
  "stories": [
    {
      "by": "askonomm",
      "descendants": 0,
      "id": 29261241,
      "score": 1,
      "time": 1637200765,
      "title": "I Created a Markdown Parser",
      "type": "story",
      "url": "https://bien.ee/blog/how-i-created-a-markdown-parser"
    },
    {
      "by": "mactoxbr",
      "descendants": 1,
      "id": 29261225,
      "kids": [
        29261226
      ],
      "score": 1,
      "time": 1637200647,
      "title": "Welcome to MetaBean Official – BSC",
      "type": "story",
      "url": "https://www.metabean.finance/"
    },
    {
      "by": "msis",
      "descendants": 0,
      "id": 29261217,
      "score": 2,
      "time": 1637200549,
      "title": "Perfect – Data workflow automation with Python",
      "type": "story",
      "url": "https://github.com/PrefectHQ/prefect"
    },
    {
      "by": "tammer",
      "descendants": 0,
      "id": 29261204,
      "score": 1,
      "time": 1637200449,
      "title": "Levo II Oil Infuser",
      "type": "story",
      "url": "https://levooil.com/products/levo-ii"
    },
    {
      "by": "seethelownavast",
      "descendants": 0,
      "id": 29261189,
      "score": 2,
      "text": "quoting from [here](https:&#x2F;&#x2F;www.mckinsey.com&#x2F;~&#x2F;media&#x2F;mckinsey&#x2F;industries&#x2F;financial%20services&#x2F;our%20insights&#x2F;the%20rise%20and%20rise%20of%20the%20global%20balance%20sheet%20how%20productively%20are%20we%20using%20our%20wealth&#x2F;the-rise-and-rise-of-the-global-balance-sheet-nov-2021-full-report_final.pdf):<p>&gt;Strikingly, net worth is still mostly tangible. While investment in intangible assets has grown relative to investment in tangible assets in many countries when broadly measured, under current accounting standards, intellectual property—including research and development, software, and original artworks—is assumed to rapidly lose its value to competition and obsolescence. On paper, intellectual property products make up less than 4 percent of global net worth and real assets. Intangibles do, however, generate economic returns. The OECD reported in 2015 that intangible assets had expected returns of 24 percent, the highest rate among produced asset categories.<p>my first question is specific. *what does this sentence mean*: &quot;under current accounting standards, intellectual property—including research and development, software, and original artworks—is assumed to rapidly lose its value to competition and obsolescence.&quot; *what are you investing in, when you invest in google, if not in the value of its intellectual property?* i realize google has not been around for very long, in the grand scheme of things, but it would be quite a surprise if it weren&#x27;t still a major player in five years, no?<p>now my questions start to get vague.<p>if you read someone like buffett or sam altman, you leave thinking that only productive things are valuable (buffett likes a sure linear function; altman likes a possible exponential function), but that is obviously in some sense absurd, not just because valuable things are also valuable, but also because it is not at all clear that there is a clear distinction between things that are valuable for being productive and those that are valuable for having a personal canon of historical value. (indeed, altman does make caveats for land, even at the crescendi of his [hymn to productivity](https:&#x2F;&#x2F;moores.samaltman.com&#x2F;).) again, from the mckinsey report:<p>&gt;The global economy has undergone a vast transformation over the past two decades, as rapid technological progress including digitization has taken hold and investment in intangible assets has soared. Yet over this same period, global wealth has grown largely as a result of the rising value of household real estate, a historical store of value<p>my rough read (very possible that this is not just a simplification, but downright inaccurate) is that they (mckinsey) basically attribute this discrepancy to loose monetary policy — i.e., it has been, on average, easier to increase net worth by taking out a loan, buying a tangible&#x2F;valuable thing, and paying off that loan, than by buying an intangible&#x2F;productive thing.<p>*but then why are all the largest companies in the world precisely those that principally (?) own intangible&#x2F;productive things (tech)?*<p>i read [something](https:&#x2F;&#x2F;www.worksinprogress.co&#x2F;issue&#x2F;the-housing-theory-of-everything&#x2F;) recently that includes a lemma (see the &quot;Scratching the surface&quot; section), referencing another [article](https:&#x2F;&#x2F;papers.ssrn.com&#x2F;sol3&#x2F;papers.cfm?abstract_id=3667309), to the effect that the housing valuations in 2008 were in some sense <i>not</i> inflated, insofar as the run-up basically amounted to an increasingly accurate assessment, on the demand side, of the intrinsic (even <i>productive</i>) value of living in certain properties.<p>i think the best tl;dr, here, is that i am becoming increasingly suspicious of the distinction, which seems pervasive (especially the higher up you go in the intellectual totem pole), between speculation, on the one hand, and investment in productive&#x2F;technological assets, on the other.",
      "time": 1637200186,
      "title": "Value vs. Expected Return",
      "type": "story"
    },
    {
      "by": "badafa",
      "descendants": 0,
      "id": 29261165,
      "score": 1,
      "time": 1637199929,
      "title": "A waveguide metasurface based quasi-far-field transverse-electric superlens",
      "type": "story",
      "url": "https://www.pubcard.net/paper/68665f4e8b2d46919ddeb70b51f1922a"
    },
    {
      "by": "L0in",
      "descendants": 1,
      "id": 29261164,
      "kids": [
        29261207
      ],
      "score": 1,
      "time": 1637199916,
      "title": "Ask HN: Sometimes you won't understand something right away. How come to terms",
      "type": "story"
    },
    {
      "by": "KiranRao0",
      "descendants": 0,
      "id": 29261156,
      "score": 2,
      "time": 1637199820,
      "title": "One Engineers Quest for the Perfect t-shirt",
      "type": "story",
      "url": "https://kiranrao.ca/2021/11/17/perfect-shirt.html"
    },
    {
      "by": "mikesabbagh",
      "descendants": 0,
      "id": 29261113,
      "score": 1,
      "time": 1637199240,
      "title": "Apple will begin allowing DIY iPhone repairs in 2022",
      "type": "story",
      "url": "https://www.techspot.com/news/92262-apple-begin-allowing-diy-iphone-repairs-starting-2022.html"
    },
    {
      "by": "monsieurpng",
      "descendants": 0,
      "id": 29261091,
      "score": 1,
      "time": 1637198927,
      "title": "A Day in the Life of a Crypto-Fueled Future",
      "type": "story",
      "url": "https://latecheckout.substack.com/p/a-day-in-the-life-of-a-crypto-fueled"
    }
  ]
}