{
  "stories": [
    {
      "by": "mdb31",
      "descendants": 0,
      "id": 31180272,
      "score": 1,
      "time": 1651069461,
      "title": "Remote Code Execution via VirusTotal Platform",
      "type": "story",
      "url": "https://www.cysrc.com/blog/virus-total-blog/"
    },
    {
      "by": "crate_barre",
      "descendants": 0,
      "id": 31180253,
      "score": 1,
      "time": 1651069389,
      "title": "Ask HN: How much of your monthly net income goes towards rent or mortgage?",
      "type": "story"
    },
    {
      "by": "rijulgulati",
      "descendants": 0,
      "id": 31180246,
      "score": 1,
      "time": 1651069355,
      "title": "Show HN: BlockPoll – Decentralized Blockchain-Based Polling (OSS)",
      "type": "story",
      "url": "https://www.blockpoll.io/"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 31180242,
      "score": 1,
      "time": 1651069344,
      "title": "Gitlab New Logo: DevOps Is at the Center of Gitlab",
      "type": "story",
      "url": "https://about.gitlab.com/blog/2022/04/27/devops-is-at-the-center-of-gitlab/"
    },
    {
      "by": "nsky-world",
      "descendants": 0,
      "id": 31180228,
      "score": 1,
      "time": 1651069266,
      "title": "Learn Cloud the Hard Way",
      "type": "story",
      "url": "https://turingpi.com/use-case-learn-cloud-the-hard-way/"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 31180208,
      "score": 2,
      "time": 1651069193,
      "title": "Cloudflare blocks 15M rps HTTPS DDoS attack",
      "type": "story",
      "url": "https://blog.cloudflare.com/15m-rps-ddos-attack/"
    },
    {
      "by": "mdb31",
      "descendants": 1,
      "id": 31180203,
      "kids": [
        31180256
      ],
      "score": 1,
      "time": 1651069167,
      "title": "Commit Level Vulnerability Dataset (For Android)",
      "type": "story",
      "url": "https://blog.quarkslab.com/commit-level-vulnerability-dataset.html"
    },
    {
      "by": "jakobgreenfeld",
      "descendants": 0,
      "id": 31180201,
      "score": 1,
      "time": 1651069163,
      "title": "Why most indie makers fail",
      "type": "story",
      "url": "https://jakobgreenfeld.com/why-indies-fail"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31180193,
      "score": 1,
      "time": 1651069127,
      "title": "Under heavy predation, Swift Parrots produce more sons",
      "type": "story",
      "url": "https://www.birdguides.com/articles/conservation/under-heavy-predation-swift-parrots-produce-more-sons/"
    },
    {
      "by": "CorinaCh",
      "descendants": 0,
      "id": 31180192,
      "score": 1,
      "text": "Reloadly, a Spain-based tech firm building payment APIs for developers and their brands, is gearing up to unveil the new version of its popular Plugin. The unveiling will take place at an online event entitled &quot;More Engagement, Less Code,&quot; which will be live-streamed on social media platforms on April 28.<p>According to Gartner, global demand for technology allowing hyper automation will be $596.6 billion in 2022, while low-code is expected to account for more than 65% of application development operations by 2024.<p>According to Reloadly Founder &amp; CEO Michel Francis, &quot;The new Reloadly Web Plugin removes the complexities involved to go live fast with our solutions – a task that typically requires deep engineering skills with API integrations.&quot;<p>Enhanced User Experience, Cost-Effectiveness\nIdeal for small-to-mid-sized digital businesses with limited development resources, the new Plugin lets companies send airtime, data bundles and gift cards across the globe through their websites and mobile apps. Fully integrated with both Stripe and Flutterwave, it provides wider global coverage and new payment methods, creating novel means of navigating product offerings. It also makes possible the acceptance of payments in cryptocurrency.<p>Product Manager Frankel Zambrano also comments &quot;Our Web Plugin is meant to deliver a seamless low code experience for non-engineers looking to add airtime top ups and digital gift card capabilities for their users to consume&quot;.<p>Reloadly will also unveil its new Webhook feature, in response to popular demand. Webhooks enable Reloadly to send events to an app based on processing that occurs at Reloadly&#x27;s end. &quot;All performance-focused software developers should be implementing webhooks in their applications,&quot; Reloadly Developer Advocate Mauro Chojrin says.<p>‘More Engagement, Less Code’\nBoth products will make their debut at an event to be live-streamed on Reloadly´s social media channels. Entitled More Engagement, Less Code interactive event will showcase the products’ many benefits. Improvements to Reloadly’s demo development platform will also be discussed at the event.<p>Businesses of every size and type have come to rely on Reloadly software to transfer mobile top-ups, data bundles, bill payments and gift cards. &quot;Since launching in 2019, our mission remained the same,&quot; Francis says. &quot;To help users across the globe optimize engagement with customers with a view to enhancing business performance.&quot;",
      "time": 1651069123,
      "title": "More engagement, less code (Product Launch event)",
      "type": "story"
    }
  ]
}