{
  "stories": [
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28637193,
      "score": 1,
      "time": 1632442457,
      "title": "Discontinue Sourcetrail",
      "type": "story",
      "url": "https://sourcetrail.com/blog/discontinue_sourcetrail/"
    },
    {
      "by": "alavilli",
      "descendants": 1,
      "id": 28637186,
      "kids": [
        28637187
      ],
      "score": 1,
      "time": 1632442368,
      "title": "Eezitt",
      "type": "story",
      "url": "https://www.eezitt.com/"
    },
    {
      "by": "gorwell",
      "descendants": 0,
      "id": 28637111,
      "score": 3,
      "time": 1632441657,
      "title": "Scientific American: Why the Term ‘Jedi’ Is Problematic",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/why-the-term-jedi-is-problematic-for-describing-programs-that-promote-justice-equity-diversity-and-inclusion/"
    },
    {
      "by": "ktfth",
      "descendants": 0,
      "id": 28637083,
      "score": 2,
      "time": 1632441364,
      "title": "Spect Runner",
      "type": "story",
      "url": "https://github.com/ktfth/spect"
    },
    {
      "by": "transpute",
      "descendants": 0,
      "id": 28637069,
      "score": 1,
      "time": 1632441248,
      "title": "Protecting High-Level Personnel from IMSI Catchers",
      "type": "story",
      "url": "https://www.securitymagazine.com/articles/91767-protecting-high-level-personnel-from-imsi-catchers"
    },
    {
      "by": "exolymph",
      "descendants": 0,
      "id": 28637062,
      "score": 2,
      "time": 1632441184,
      "title": "Apple's Power Move to Kneecap Facebook Advertising Is Working",
      "type": "story",
      "url": "https://bigtechnology.substack.com/p/completely-running-blind-apples-power"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 28637027,
      "score": 1,
      "time": 1632440885,
      "title": "Chrome 95 Beta: Secure Payment Confirmation, WebAssembly Exception Handling and",
      "type": "story",
      "url": "https://blog.chromium.org/2021/09/chrome-95-beta-secure-payment.html"
    },
    {
      "by": "bcaulfield",
      "descendants": 0,
      "id": 28637026,
      "score": 1,
      "time": 1632440869,
      "title": "Nvidia Extends AI Inference Performance Leadership, with Debut Results on Arm",
      "type": "story",
      "url": "https://blogs.nvidia.com/blog/2021/09/22/mlperf-ai-inference-arm/"
    },
    {
      "by": "sakopov",
      "descendants": 2,
      "id": 28636987,
      "kids": [
        28637132,
        28637098
      ],
      "score": 4,
      "text": "I linked the official bill document at the bottom. Here are some section that stuck out to me.<p>Sec. 138312 states:<p>&gt; The bill prohibits an IRA from holding any security if the issuer of the security requires the IRA owner to have certain minimum level of assets or income, or have completed a minimum level of education or obtained a specific license or credential.  For example, the legislation prohibits IRAs from holding investments which are offered to accredited investors because those investments are securities that have not been registered under federal securities laws. IRAs holding such investments would lose their IRA status. This section generally takes effect for tax years beginning after December 31, 2021, but there is a 2-year transition period for IRAs already holding these investments. [1]<p>This appears to indicate that an IRA can no longer participate in investments which aren&#x27;t registered as securities. Is this a swipe at cryptocurrency investments in IRAs?<p>Sec. 138301 states:<p>&gt; Under current law, taxpayers may make contributions to IRAs irrespective of how much they already have saved in such accounts.  To avoid subsidizing retirement savings once account balances reach very high levels, the legislation creates new rules for taxpayers with very large IRA and defined contribution retirement account balances.  \nSpecifically, the legislation prohibits further contributions to a Roth or traditional IRA for a taxable year if the total value of an individual’s IRA and defined contribution retirement accounts generally exceed $10 million as of the end of the prior taxable year.  The limit on contributions would only apply to single taxpayers (or taxpayers married filing separately) with taxable income over $400,000, married taxpayers filing jointly with taxable income over $450,000, and heads of households with taxable income over $425,000 (all indexed for inflation). [1]<p>IRA account balances of $10 million or more lose their IRA status?<p>Sec. 138314 states:<p>&gt; To prevent self-dealing, under current law prohibited transaction rules, an IRA owner cannot invest his or her IRA assets in a corporation, partnership, trust, or estate in which he or she has a 50 percent or greater interest.  However, an IRA owner can invest IRA assets in a business in which he or she owns, for example, one-third of the business while also acting as the CEO. The bill adjusts the 50 percent threshold to 10 percent for investments that are not tradable on an established securities market, regardless of whether the IRA owner has a direct or indirect interest.  The bill also prevents investing in an entity in which the IRA owner is an officer. Further, the bill modifies the rule to be an IRA requirement, rather than a prohibited transaction rule (i.e., in order to be an IRA, it must meet this requirement).  This section generally takes effect for tax years beginning after December 31, 2021, but there is a 2-year transition period for IRAs already holding these investments. [1]<p>This seems to indicate that self-directed IRAs are only allowed to participate in the stock market. Other investments types are no longer allowed and if you have them you&#x27;re given 2 years to liquidate them.<p>All-in-all, this seems incredibly worrisome unless I&#x27;m misunderstanding something here.<p>[1] https:&#x2F;&#x2F;waysandmeans.house.gov&#x2F;sites&#x2F;democrats.waysandmeans.house.gov&#x2F;files&#x2F;documents&#x2F;SubtitleISxS.pdf",
      "time": 1632440583,
      "title": "Tell HN: New tax legislation proposes limitations for directed IRAs",
      "type": "story"
    },
    {
      "by": "aazaa",
      "descendants": 0,
      "id": 28636985,
      "score": 4,
      "time": 1632440563,
      "title": "China sends 24 fighter jets toward Taiwan in show of force",
      "type": "story",
      "url": "https://apnews.com/article/china-beijing-taiwan-87dea2310add5beefdee0530cf0bd740"
    }
  ]
}