{
  "stories": [
    {
      "by": "Live_Itt",
      "descendants": 0,
      "id": 27910861,
      "score": 1,
      "text": "Before Live Itt, we were constantly looking for fun bars and restaurants to meet people in, but we were oftentimes disappointed by the locations when we got there and would have to bounce around a lot before settling into a place we liked. We consistently ran into the same issue over and over again. It was always a guessing game: Is it lively? Dead? Busy or not? Attractive women there? Is there a long line or can we breeze right through? We would get on social media platforms like twitter, FB, Instagram, to browse through hashtags to see if someone was there recently and recorded a video of their experience. We would read Yelp’s and Google’s most recent reviews to try and make the most accurate determination from someone else’s point of view.<p>We would piece multiple sources from someone else’s perspective and point of view to attempt to see what was going on at a specific location, but the videos and reviews were always a few hours or days old and not exactly what I wanted to see. The reviews couldn’t be authenticated as they would be only in writing and from someone else’s point of view or experience. A picture speaks a thousand words, but a video in real time speaks a million words. What if we could be in two places at once, in real time?  We dug deeper and asked, If we could be in two places at once, how much agony, time and money would be saved?<p>So out of sheer necessity and frustration, spending time and money on Uber rides and searching social media platforms from someone else’s point of view, we decided to build a platform that allows users to request what they want to see from their point of view (VPOV), essentially flipping the traditional model upside down, giving full control to the viewer to request what they want to see in real time.<p>Netflix became one of the most valuable companies because they understood that the most valuable asset anyone has is time. With Netflix it allows you to watch whatever you want, anytime, anyplace, with a click of a button. Uber took the traditional cab system and made it cheaper, more convenient and saved riders time. Live Itt takes the traditional social media and review apps and puts the control in the viewers hands to request what they want, from the perspective that they want, and when they want to see an experience. Which is done in real time.<p>Live itt was conceived from the idea that you can be in two places at once. The user can finally break free of the traditional video sharing platforms from someone else’s perspective or vantage point and request a tailored specific video experience from their point of view. From a live look at the bar, restaurant, lounge, grocery store line, beach or anything else, they finally have full control and can request a real-time video from their point of view allowing them to be in two places at once.",
      "time": 1626895447,
      "title": "New APP – How to be 2 places at once",
      "type": "story"
    },
    {
      "by": "phwd",
      "descendants": 0,
      "id": 27910856,
      "score": 1,
      "time": 1626895410,
      "title": "Bulletin.com Email Address Leak",
      "type": "story",
      "url": "https://philippeharewood.com/bulletin-com-email-address-leak/"
    },
    {
      "by": "diplodocusaur",
      "descendants": 0,
      "id": 27910853,
      "score": 1,
      "time": 1626895396,
      "title": "Can we compile C code into PowerPoint?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LArkm4v5mWA"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27910850,
      "score": 1,
      "time": 1626895379,
      "title": "Carbon Tax, Beloved Policy to Fix Climate Change, Is Dead at 47",
      "type": "story",
      "url": "https://www.theatlantic.com/science/archive/2021/07/obituary-carbon-tax-beloved-climate-policy-dies-47/619507/"
    },
    {
      "by": "rolph",
      "descendants": 0,
      "id": 27910848,
      "score": 2,
      "time": 1626895368,
      "title": "Microsoft Linux has arrived, but it's not what you imagined",
      "type": "story",
      "url": "https://www.techrepublic.com/article/microsoft-linux-is-not-what-you-think-or-hoped-it-would-be/"
    },
    {
      "by": "worldee_pat",
      "descendants": 1,
      "id": 27910823,
      "kids": [
        27910841
      ],
      "score": 1,
      "time": 1626895277,
      "title": "Show HN: Worldee – create and organize your travel life",
      "type": "story",
      "url": "https://www.worldee.com/"
    },
    {
      "by": "dogetomars",
      "descendants": 1,
      "id": 27910810,
      "kids": [
        27910811
      ],
      "score": 1,
      "time": 1626895201,
      "title": "Protect your Computer against strangers (Ring Your Phone)",
      "type": "story",
      "url": "https://github.com/aydinnyunus/FaceRecognitionSecurity"
    },
    {
      "by": "libab",
      "descendants": 0,
      "id": 27910756,
      "score": 2,
      "time": 1626895028,
      "title": "Firefox May Have Lost Up to 12% of Its Users So Far in 2021",
      "type": "story",
      "url": "https://fosspost.org/firefox-may-have-lost-12-percent-of-users/"
    },
    {
      "by": "kengine_express",
      "descendants": 0,
      "id": 27910739,
      "score": 2,
      "time": 1626894909,
      "title": "Karl Marx: Unrealistic and Heinous World View",
      "type": "story",
      "url": "https://anchor.fm/ken-drew/episodes/Karl-Marx-Unrealistic--Heinous-World-View-e14dlg4"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 27910725,
      "score": 3,
      "time": 1626894852,
      "title": "Twitter is testing upvote or downvote on replies",
      "type": "story",
      "url": "https://twitter.com/TwitterSupport/status/1417920469265788931"
    }
  ]
}