{
  "stories": [
    {
      "by": "tomjuggler",
      "descendants": 0,
      "id": 28029557,
      "score": 1,
      "time": 1627849480,
      "title": "Fritz.ai is shutting down their API at the end of August",
      "type": "story",
      "url": "https://www.circusscientist.com/2021/08/01/goodbye-fritz-ai-goodbye-proprietary-online-services/"
    },
    {
      "by": "hheikinh",
      "descendants": 0,
      "id": 28029553,
      "score": 1,
      "time": 1627849456,
      "title": "Pfizer and Moderna ramp up EU Covid vaccine prices",
      "type": "story",
      "url": "https://www.ft.com/content/d415a01e-d065-44a9-bad4-f9235aa04c1a"
    },
    {
      "by": "hashmash",
      "descendants": 0,
      "id": 28029545,
      "score": 1,
      "time": 1627849383,
      "title": "Show HN: Cojen/Maker – lightweight Java class generator designed for ease of use",
      "type": "story",
      "url": "https://github.com/cojen/Maker"
    },
    {
      "by": "hheikinh",
      "descendants": 0,
      "id": 28029540,
      "score": 1,
      "time": 1627849358,
      "title": "Short Report on Long Covid [pdf]",
      "type": "story",
      "url": "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1007511/S1327_Short_Long_COVID_report.pdf"
    },
    {
      "by": "devtailz",
      "descendants": 0,
      "id": 28029525,
      "score": 2,
      "time": 1627849263,
      "title": "Show HN: Engram Journal and Planner – the quickest path from thought to jot",
      "type": "story",
      "url": "https://engramhq.xyz"
    },
    {
      "by": "appwiz",
      "descendants": 0,
      "id": 28029502,
      "score": 1,
      "time": 1627849083,
      "title": "Managing the development of large software systems [pdf]",
      "type": "story",
      "url": "http://www-scf.usc.edu/~csci201/lectures/Lecture11/royce1970.pdf"
    },
    {
      "by": "web_dev_master",
      "descendants": 0,
      "id": 28029499,
      "score": 1,
      "time": 1627849073,
      "title": "JavaScript Quiz",
      "type": "story",
      "url": "https://javascriptquiz.com/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28029479,
      "score": 2,
      "time": 1627848910,
      "title": "Google Cloud reported an operating loss of $5.6bn in 2020",
      "type": "story",
      "url": "https://www.theregister.com/2021/05/18/google_cloud_confirm_departure_of/"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28029475,
      "score": 2,
      "time": 1627848876,
      "title": "Anthropogenic forcing yields observed positive trend in Earth’s energy imbalance",
      "type": "story",
      "url": "https://www.nature.com/articles/s41467-021-24544-4"
    },
    {
      "by": "behnamoh",
      "descendants": 2,
      "id": 28029469,
      "kids": [
        28029528
      ],
      "score": 3,
      "text": "As you may have noticed, Spotify started sending this email to users:<p><pre><code>    Starting August 04, 2021, we&#x27;ll be upgrading our systems to ensure the accuracy of sales tax we       \n    are obligated by law to collect from subscribers. If you do not update your account \n    information, we will charge a rate in accordance with instructions from your state tax \n    authority. Any changes will be applied automatically as of your next billing date after August \n    04, 2021.\n</code></pre>\nI find it bizarre that a music streaming service needs my home address now. And they basically threat to charge me if I don&#x27;t provide this information. How on earth is my home address required for me to listen to music? This even bypasses iOS&#x27;s app tracking filter because this data is not collected within the app, rather the user enters their address directly on the website.<p>Their policy says the following data is collected from users:<p><pre><code>    This is the personal data that is provided by you or collected by us to enable you to sign up \n    for and use the Spotify Service. Depending on the type of Spotify Service plan you sign up for, \n    this may include your username, email address, phone number, birth date, gender, street   \n    address, and country.\n</code></pre>\nThis is on top of the usage data that they collect. According to their policy, usage data includes:<p><pre><code>    Information about your type of Spotify Service plan.\n    Information about your interactions with the Spotify Service such as your search queries \n    (including the date and time of any requests you make), streaming history, playlists you \n    create, your library, your browsing history, and your interactions with the Spotify Service, \n    content, other Spotify users. This also may include details of your use of third party \n    applications in connection with the Spotify Service.\n    Inferences drawn about your interests and preferences based on your usage of the Spotify Service.\n    User Content (as defined in the Terms and Conditions of Use) you post to Spotify, such as photos, playlist titles, and interactions with \n    the Spotify Customer Service team. Please note that we will only access your camera or photos from your device if you give us permission to \n    do so, and we will only access images that you specifically choose to share with us and metadata related to those images, such as the type \n    of file and the size of the image. We will never scan or import your device’s photo library or camera roll.\n    Certain technical data, which may include:\n\n    URL information;\n    online identifiers including cookie data and IP addresses;\n    information about the types of devices you are using such as unique device IDs, network \n    connection type (e.g. wifi, 3G, LTE, Bluetooth), provider, network and device performance, \n    browser type, language, information enabling digital rights management, operating system, and \n    Spotify application version;\n    device attributes of devices on your wifi network that are available to connect to the \n    Spotify Service (such as speakers);\n    your non-precise location, which may be derived or inferred from certain technical data \n    (e.g., your IP address, language setting of your device, or payment currency), to comply with  \n    geographic requirements in our licensing agreements, and deliver personalized content and \n    advertising to you; and\n    motion-generated or orientation-generated mobile sensor data (e.g. accelerometer or \n    gyroscope) required for the purposes of providing specific features of the Spotify Service to \n    you.</code></pre>",
      "time": 1627848832,
      "title": "Tell HN: Spotify says either give us your home address or you'll be charged",
      "type": "story"
    }
  ]
}