{
  "stories": [
    {
      "by": "matgillard",
      "descendants": 0,
      "id": 30345233,
      "score": 1,
      "time": 1644925062,
      "title": "Le Parisien Adopts Newsbridge’s AI-Powered Media Hub",
      "type": "story",
      "url": "https://newsbridge.io/customer-stories/leparisien"
    },
    {
      "by": "fperson",
      "descendants": 1,
      "id": 30345231,
      "kids": [
        30345239
      ],
      "score": 2,
      "time": 1644925059,
      "title": "Auto-dark-mode.nvim – automatically change Neovim brightness in macOS",
      "type": "story",
      "url": "https://github.com/f-person/auto-dark-mode.nvim"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30345229,
      "score": 1,
      "time": 1644925053,
      "title": "What's cooking on Sourcehut? February 2022",
      "type": "story",
      "url": "https://sourcehut.org/blog/2022-02-15-whats-cooking-february-2022/"
    },
    {
      "by": "okozzie",
      "descendants": 2,
      "id": 30345227,
      "kids": [
        30345268
      ],
      "score": 2,
      "time": 1644925035,
      "title": "Show HN: Generate a personal website in seconds from your Twitter/insta/GitHub",
      "type": "story",
      "url": "https://twooter.co?ref=hn"
    },
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30345212,
      "score": 2,
      "time": 1644924903,
      "title": "EU privacy watchdog wants Pegasus spyware banned",
      "type": "story",
      "url": "https://therecord.media/eu-privacy-watchdog-wants-pegasus-spyware-banned/"
    },
    {
      "by": "AutoDisorder",
      "descendants": 0,
      "id": 30345204,
      "score": 6,
      "time": 1644924829,
      "title": "ReCAPTCHA (A Google Service) Privacy Concerns",
      "type": "story",
      "url": "https://blog.cloudflare.com/moving-from-recaptcha-to-hcaptcha/"
    },
    {
      "by": "magusd",
      "descendants": 0,
      "id": 30345201,
      "score": 4,
      "text": "Last week I received a spam email from ~generic dumb scammer #199209842982~ here it is for your amusement: https:&#x2F;&#x2F;imgur.com&#x2F;YYqOgYE<p>I&#x27;ve blurred the sender because it might have been a hijacked account, and it&#x27;s not like it&#x27;s hard to get a new gmail account anyways. You can also see that I&#x27;ve blurred all the other people too. Yeah, the scammer cc all his targets.<p>I was in a good mood, so I replied and made fun of him and warned all the other recipients that, &quot;hey, just in case you&#x27;re distracted, yes this is a spam email&quot;. I didn&#x27;t use any curse words, or strong language, but I was a bit edgy.<p>Two days later, my google account was suspended. Apparently, my account was being used to send unwanted e-mails. Ha! I just became a spammer.<p>And let me tell you, it was very frustrating to be blacklisted like this. A little context for you, I&#x27;m a DevOps engineer and I&#x27;ve been using gmail for the past 15 years. I&#x27;ll skip the classic &#x27;my files, my contacts, my email&#x27; because I had backups.<p>But I lost access to paid services that I had set up with social login, besides all Google&#x27;s services ( GCP, firebase, youtube premium, google one, subscriptions paid through play store, google ads, etc, etc). And here&#x27;s the kicker: my gmail used to be the contact I shared with potential clients, current clients, and job applications which, by the way, I was actively job seeking. Not because I don&#x27;t like my job, but because I had pushback on my raise on a recent promotion, so I was trying to get offers to make a point.<p>But what if I was out of a job? What if I was expecting a contract to sign? What if I had an SLA with a client? What if my bank or the government, health plan, car insurance, or any of the hundreds of notifications that I&#x27;ve set up throughout the years was triggered and needed my attention?<p>I know about terms of services, that they&#x27;re a company and they can do whatever they want. But what if your car maker could take away your car if you turned right without signing first? Or if you went over the speed limit? What if you were a salesman and samsung could take away your phone because you&#x27;re using it to call people to do your job and they&#x27;ve reported you for unwanted calls? Or AT&amp;T could take away your phone number because you said a curse word on the phone?<p>You could argue that gmail is not a product that I own, but I paid for it, so technically, don&#x27;t I own it? Don&#x27;t I get the right to use it while they figure out if I&#x27;m really a spammer or not?<p>That got me thinking, what is an identity? How can I prove that I am who I am? I thought I could just share my profile, or gmail, or phone number, or identity and prove that I was who I was. But all those things can be taken away because of some rule that can be judged and enforced by someone else.<p>The google stack is very convenient, and it&#x27;s 2022, I&#x27;m not going to start hosting my email server, but I&#x27;m in need of a foolproof and long lasting solution to online identity. And I&#x27;ve started by purchasing a domain name for 10 years and having a &#x27;catch all and forward to gmail&#x27; rule setup. So I can just forward it all to somewhere else in case I lose my gmail again. \nBut what if I get reported on my domain name? What if that gets suspended or blacklisted too?<p>Should we own the free services that we&#x27;ve paid for with money and data? Do we own our identities? Do we own our phone numbers, emails, handles, PO boxes, addresses?<p>What do you use for identity? And what are your thoughts on this? Am I overreacting?",
      "time": 1644924826,
      "title": "Should we own the free stuff we pay for?",
      "type": "story"
    },
    {
      "by": "merlinscholz",
      "descendants": 1,
      "id": 30345171,
      "kids": [
        30345174
      ],
      "score": 1,
      "time": 1644924514,
      "title": "Audiblegate",
      "type": "story",
      "url": "https://twitter.com/wdfpodcast/status/1492810241372741636"
    },
    {
      "by": "kyriakosel",
      "descendants": 0,
      "id": 30345169,
      "score": 1,
      "time": 1644924456,
      "title": "The Founder of Eight Sleep, Matteo, at Terra Video Podcast",
      "type": "story",
      "url": "https://blog.tryterra.co/matteo-franceschetti-with-kyriakos-and-raouf-terra-podcast-series-48cb1fc76c5a?gi=4cf272bcbba"
    },
    {
      "by": "fsflover",
      "descendants": 0,
      "id": 30345137,
      "score": 1,
      "time": 1644924126,
      "title": "Linux tops Google's Project Zero charts for fastest bug fixes",
      "type": "story",
      "url": "https://www.theregister.com/2022/02/14/in_brief_security/"
    }
  ]
}