{
  "stories": [
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 32163994,
      "score": 1,
      "time": 1658315043,
      "title": "Court OKs billion-dollar Play Store gouging suit against Google",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/20/uk_court_okays_google_lawsuit/"
    },
    {
      "by": "CawCawCaw",
      "descendants": 0,
      "id": 32163993,
      "score": 1,
      "time": 1658315025,
      "title": "World chess champion Magnus Carlsen abdicates title",
      "type": "story",
      "url": "https://chess24.com/en/read/news/magnus-carlsen-to-give-up-world-championship-title"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 32163976,
      "score": 1,
      "time": 1658314938,
      "title": "How the end of free returns will change the way we shop",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2022/jul/20/end-free-returns-fast-fashion-online-shoppers"
    },
    {
      "by": "adihbu",
      "descendants": 0,
      "id": 32163954,
      "score": 1,
      "text": "just do it",
      "time": 1658314792,
      "title": "Nike",
      "type": "story"
    },
    {
      "by": "lyset",
      "descendants": 0,
      "id": 32163951,
      "score": 1,
      "time": 1658314777,
      "title": "Why having a backup saves a lot of worry",
      "type": "story",
      "url": "https://usercept.eu.org/blog/having-a-backup-saves-a-lot-of-worry/"
    },
    {
      "by": "guiambros",
      "descendants": 1,
      "id": 32163949,
      "kids": [
        32163959
      ],
      "score": 2,
      "time": 1658314768,
      "title": "Android Apps on Linux with Waydroid",
      "type": "story",
      "url": "https://lwn.net/SubscriberLink/901459/f328860b93677ad0/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 32163943,
      "score": 1,
      "time": 1658314750,
      "title": "A look at the CloudMensis macOS spyware",
      "type": "story",
      "url": "https://www.welivesecurity.com/2022/07/19/i-see-what-you-did-there-look-cloudmensis-macos-spyware/"
    },
    {
      "by": "kevincox",
      "descendants": 0,
      "id": 32163940,
      "score": 4,
      "time": 1658314714,
      "title": "TeamViewer installs suspicious font only useful for web fingerprinting",
      "type": "story",
      "url": "https://www.ctrl.blog/entry/teamviewer-font-privacy.html"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 32163936,
      "score": 1,
      "time": 1658314702,
      "title": "Thailand admits to using phone spyware, cites national security",
      "type": "story",
      "url": "https://www.reuters.com/world/asia-pacific/thailand-admits-using-phone-spyware-cites-national-security-2022-07-20/"
    },
    {
      "by": "jstrafy",
      "descendants": 0,
      "id": 32163932,
      "score": 3,
      "text": "Hey there,<p>Another Hacker News Launch for our new product, Moot!<p>Moot is a multiplayer work hub specifically designed around remote teams (like us). In its current form, Moot is a multiplayer dashboard (video&#x2F;voice enabled with shared cursors) where teams can plug and play blocks that replicate, augment and create the ways they collaborate.<p>Why build yet another SaaS for remote work? Remote work isn’t going anywhere, with office occupancy stagnating at around 50% of pre-covid levels [1], yet remote work can still be so much better. My own experience in building a remote company (now async) over the past year has been great for productivity but pretty tragic for creative collaboration and building general social connection, which is a requisite for most to feel fulfilled in their jobs.<p>There’s also a ton of SaaS cloud apps that are amazing at what they do, but nothing that really ties them together in any substantial way. We’ve tried everything we could get our hands on, and all solutions felt either too limited (no video, voice or real time collaboration), or too predetermined (the work was controlled by the tool, rather than the other way around).<p>Then there is a simple difference in perspective. I am a trained architect and I specialized in large scale cultural projects, being very close to the new Google HQ construction in Kings Cross (London) and HQ in Charleston East SV, and other projects like the new terminal for Changi airport in Singapore. These projects taught me a lot into understanding the relationship of functional spaces to people. Leveraging beauty, economy, technology and foresight into each and every space that is designed, with regard to the experience of the whole.<p>In summary, we want to build the standard architecture for a digital native workspace better than it’s ever been done before. How?<p>1. Make <i>everything</i> multiplayer, so there’s a sense real time connection to how people are working. As Figma, Miro et al have figured, the desktop no longer needs to be an individual experience and multiplayer makes everything more fun.\n2. Make <i>everything</i> customisable, so teams can build their workflows exactly how they want to. The office has always had the advantage of being educational into the ways of company culture and means of how to get things done within a particular organisation and we believe that the only way to really compete with this remotely is to allow full customisation of the tools where people work. This is how we’ve thought about Moot from the ground up.\n3. Interoperability. With so many tools, how can we simplify the experience? We’ve always imagined Moot to be a Zapier type company in the way we’d aim to enhance the rich ecosystem of apps, pulling their abilities into functional widgets on a single interface. This is our next adventure!<p>We’re currently doing a demo based checkout as we’re launching sooner than we should be, and because of that we would need to work on making a crystal clear self-serve model.<p>Landing: [<a href=\"https:&#x2F;&#x2F;usemoot.com](http:&#x2F;&#x2F;usemoot.com)\" rel=\"nofollow\">https:&#x2F;&#x2F;usemoot.com](http:&#x2F;&#x2F;usemoot.com)</a><p>I would love to hear your feedback and suggestions on the idea. Hit or miss?<p>PS: If you want to chat about the idea or are interested in working together I’d love to chat. Always interesting to meet people on HN and we have the funds, ideas and drive to continue making cool things that can solve big problems. Send me an email at james@trymoot.com<p>Thanks!<p>[1] <a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;opinion&#x2F;articles&#x2F;2022-06-10&#x2F;don-t-blame-the-wrinklies-for-those-empty-office-desks-opinion-wrap\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;opinion&#x2F;articles&#x2F;2022-06-10&#x2F;don-t-...</a>",
      "time": 1658314648,
      "title": "Show HN: What do you think of our new multiplayer workspace?",
      "type": "story",
      "url": "https://www.trymoot.com/"
    }
  ]
}