{
  "stories": [
    {
      "by": "blunte",
      "descendants": 0,
      "id": 29749090,
      "score": 1,
      "text": "I want to help a family member show and sell their paintings online.  The works are already framed (so no frame options&#x2F;configuration is necessary).  It is basically just &quot;see this beautiful piece, as it actually exists&quot; and &quot;buy it!&quot;<p>I&#x27;m aware of many general options and plenty of technical options, but perhaps there are some HN folks who already do this.  If so, what site&#x2F;service do you use?<p>Online payments are not absolutely necessary, but that would be a nice bonus.<p>There exist sites for photographers to sell their work, but those tend to have many, many options and seem to be overkill for this.  At a minimum, this could probably just be a Shopify store selling individual, one of a kind items.  But perhaps there&#x27;s something better for this (with better presentation)?",
      "time": 1640965760,
      "title": "Ask HN: Selling framed physical art online",
      "type": "story"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 29749078,
      "score": 2,
      "time": 1640965671,
      "title": "Two NFT copycats are fighting over which is the real fake Bored Ape Yacht Club",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/30/22860010/bored-ape-yacht-club-payc-phayc-copycat-nft"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 29749063,
      "score": 2,
      "time": 1640965637,
      "title": "How to Help a Friend Who Lost Their Home in a Fire (2020)",
      "type": "story",
      "url": "https://www.sonomamag.com/how-to-help-a-friend-who-lost-their-home-in-a-fire/"
    },
    {
      "by": "Cameri",
      "descendants": 0,
      "id": 29749061,
      "score": 3,
      "time": 1640965634,
      "title": "Fiatjaf/nostr – a truly censorship-resistant alternative to Twitter",
      "type": "story",
      "url": "https://github.com/fiatjaf/nostr"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29749053,
      "score": 1,
      "time": 1640965572,
      "title": "Kinopio",
      "type": "story",
      "url": "https://kinopio.club"
    },
    {
      "by": "MaysonL",
      "descendants": 0,
      "id": 29749045,
      "score": 1,
      "time": 1640965519,
      "title": "Why aren't the most useful Mac apps on the App Store?",
      "type": "story",
      "url": "https://alinpanaitiu.com/blog/apps-outside-app-store/"
    },
    {
      "by": "unclebucknasty",
      "descendants": 0,
      "id": 29749026,
      "score": 2,
      "time": 1640965441,
      "title": "The Metaverse’s Dark Side: Here Come Harassment and Assaults",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/30/technology/metaverse-harassment-assaults.html"
    },
    {
      "by": "internetvin",
      "descendants": 0,
      "id": 29749010,
      "score": 3,
      "time": 1640965338,
      "title": "Show HN: A tool to help you finish projects, learn skills and develop habits",
      "type": "story",
      "url": "https://futureland.tv"
    },
    {
      "by": "jacquesm",
      "descendants": 0,
      "id": 29748959,
      "score": 3,
      "time": 1640965099,
      "title": "Making a CPU Using an Analog Modular Synthesizer",
      "type": "story",
      "url": "https://twitter.com/thingskatedid/status/1476679065411022849"
    },
    {
      "by": "Tim25659",
      "descendants": 1,
      "id": 29748949,
      "kids": [
        29749065
      ],
      "score": 3,
      "text": "Anybody experience this while learning something or talking, listening, mind wanders suddenly to irrelevant things is this behavior normal to everybody basically I will not be in the present moment is this a symptom of ADHD I&#x27;m suffering a lot because of this I used to get bad reputation in the corporate companies because whenever getting the requirement I was suppose to listen properly and implement the thing as I&#x27;m a developer but I used to end up with understanding different things and this happened many times and also I&#x27;m an introvert and shy because of this trait I will not open up with my team members so that many things were unclear when they asked me &quot;Are you clear with this?&quot; out of fear I used to tell them that &quot;Yes I understood&quot; instantly and when I come back to my chair I used to assume things and implement which was leading to conflict and escalations. My fear was that when they asked me did I understand the requirement what if I tell them that I didn&#x27;t understand and what they might think about me  will they think I&#x27;m stupid to understand anything, dumb, useless. Did Anybody faced this kind of difficulty and how you overcame it..",
      "time": 1640965068,
      "title": "Stop mind from thinking on other things while listening or learning",
      "type": "story"
    }
  ]
}