{
  "stories": [
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 29985058,
      "score": 1,
      "time": 1642536859,
      "title": "Get Ready for the ‘Great Shutdown’",
      "type": "story",
      "url": "https://www.computerworld.com/article/3647270/get-ready-for-the-great-shutdown.html"
    },
    {
      "by": "oblib",
      "descendants": 0,
      "id": 29985023,
      "score": 1,
      "text": "Yesterday while using the Opera web browser on my late `09 Mac Mini (MacOS v10.11) to test a web app I&#x27;m working on I noticed a &lt;style type=&quot;text&#x2F;css&quot;&gt; tag referencing a file that&#x27;s not in my html code. Here&#x27;s a small sample of it of what was in it:<p>:root topadblock, :root span[id^=&quot;ezoic-pub-ad-placeholder-&quot;], :root img[alt^=&quot;Fuckbook&quot;], :root iframe[src<i>=&quot;mellowads.com&quot;],<p>There are hundreds of URLs embedded in that file and not all are porn sites (but there are quite a few).<p>My first thought was I may have some malware on my Mac but after testing the app on Firefox and Safari and not seeing this issue I thought maybe this is a &quot;feature&quot; in the Opera web browser so I sent them a message via the bug report system on Opera&#x27;s web site. They replied with:<p>&quot;All bug reports are read and handled by our staff. However, please note that you will not receive a personal reply to the bug report, unless we need more information to investigate the bug.&quot;<p>Later on last night I did some searching for a file with that string above in it on my Mac and found one buried in one of the system folders named &quot;OperaEmbeddedBS.html&quot;. So this morning I responded to Opera&#x27;s reply email asking if that file is installed when I install their browser. So far I&#x27;ve not heard back from them but it&#x27;s only been a few hours.<p>I&#x27;ve also done some google and duckduckgo searching for both the file name and snippets of the content but didn&#x27;t find anything at all.<p>I&#x27;ve uploaded the file so others can check it out if they want:<p>https:&#x2F;&#x2F;ezinvoice.com&#x2F;OperaEmbeddedBS.html<p>The page is blank when viewed in a web browser so you have to view the source code to see what it contains. Here&#x27;s another longer snippet of it copied from a page loaded in the Opera web browser. I have no idea what this does. I&#x27;ve never seen CSS like it before but that doesn&#x27;t mean much because my CSS skills and knowledge are minimal.<p>Anyone have a clue about what this does, if it&#x27;s an Opera &quot;feature&quot;, or malware of some kind?<p>The only thing I can think of is it&#x27;s sending requests to the urls embedded in it, but I no clue why or what else it might do.<p>&lt;style type=&quot;text&#x2F;css&quot;&gt;:root topadblock, :root span[id^=&quot;ezoic-pub-ad-placeholder-&quot;], :root img[alt^=&quot;Fuckbook&quot;], :root iframe[src</i>=&quot;mellowads.com&quot;], :root div[style^=&quot;padding: 5px 15px !important&quot;] &gt; [style^=&quot;width: 100% !important; cursor: pointer !important;&quot;], :root div[id^=&quot;zergnet-widget&quot;], :root div[id^=&quot;traffective-ad-&quot;], :root div[id^=&quot;taboola-stream-&quot;], :root div[id^=&quot;sticky_ad_&quot;], :root div[id^=&quot;rc-widget-&quot;], :root div[id^=&quot;q1-adset-&quot;], :root div[id^=&quot;proadszone-&quot;], :root div[id^=&quot;lazyad-&quot;], :root div[id^=&quot;gtm-ad-&quot;], :root div[id^=&quot;ezoic-pub-ad-&quot;]",
      "time": 1642536693,
      "title": "Ask HN: Anyone else seeing this weirdness in the Opera web browser?",
      "type": "story"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 29985013,
      "score": 1,
      "time": 1642536655,
      "title": "Coinbase and MasterCard partner to revolutionize NFT purchase experience",
      "type": "story",
      "url": "https://blog.coinbase.com/coinbase-and-mastercard-partner-to-revolutionize-nft-purchase-experience-8e486a392c55"
    },
    {
      "by": "stalfosknight",
      "descendants": 0,
      "id": 29985001,
      "score": 3,
      "time": 1642536574,
      "title": "Democrats unveil bill to ban online ‘surveillance advertising’",
      "type": "story",
      "url": "https://www.theverge.com/2022/1/18/22889903/democrats-targeted-advertising-facebook-google-surveillance"
    },
    {
      "by": "lbrito",
      "descendants": 0,
      "id": 29984978,
      "score": 1,
      "time": 1642536463,
      "title": "The Myth of 1.3M Vacant Investor Homes in Canada",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=evYOhpjMql0"
    },
    {
      "by": "notRobot",
      "descendants": 0,
      "id": 29984975,
      "kids": [
        29985030
      ],
      "score": 1,
      "time": 1642536453,
      "title": "Microsoft releases emergency fixes for Windows Server, VPN bugs",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-fixes-for-windows-server-vpn-bugs/"
    },
    {
      "by": "StefanWestfal",
      "descendants": 0,
      "id": 29984970,
      "score": 1,
      "text": "Over the last year&#x27;s I have worked in different roles and with different technologies. Python, Go, C, TS&#x2F;React, domain specific languages and tooling, and played with frameworks like Elm and Svelte. Mainly in the areas of web, technical simulations, and DataScience.<p>I would argue that I am flexible but that comes at a cost, low specialization.<p>My question: To build a career, how much do tech stacks matter? Should I stick to one (React, FastAPI, PostgreSQL) or doesn&#x27;t it really matter as long as I can ship something? Is it fine to use Svelte for a new project when breaking into the market or should I stick to React?<p>Note: I worked in different roles not described as SWE but in practice I am writing code full time for almost 3 years. Building a career refers to &quot;becoming officially a SWE&quot;.",
      "time": 1642536427,
      "title": "Ask HN: How important are stacks and specialization?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29984965,
      "score": 2,
      "time": 1642536419,
      "title": "Deplatforming make userbase smaller but loyal members may return more galvanised",
      "type": "story",
      "url": "https://gnet-research.org/2022/01/18/tracing-extremist-platform-migration-on-the-darkweb-lessons-for-deplatforming/"
    },
    {
      "by": "empressplay",
      "descendants": 0,
      "id": 29984961,
      "score": 1,
      "time": 1642536409,
      "title": "Floaty Turtle: A Flappy Bird Clone Written in Logo",
      "type": "story",
      "url": "https://turtlespaces.org/2022/01/18/floaty-turtle-a-flappy-bird-clone-in-logo/"
    },
    {
      "by": "binghamgarrett",
      "descendants": 0,
      "id": 29984951,
      "score": 2,
      "text": "AutoInit is a weight initialization method that automatically adapts to different neural network architectures. It tracks the mean and variance of signals as they propagate through the network and initializes the weights at each layer to avoid exploding or vanishing signals. AutoInit can be used to improve performance of feedforward, convolutional, and residual networks; configured with different activation function, dropout, weight decay, learning rate, and normalizer settings; and applied to vision, language, tabular, multi-task, and transfer learning domains. The software package provides a simple wrapper that makes it possible to apply AutoInit to existing TensorFlow models as-is. We invite you to try it out and see if it can improve the performance of your neural network models!<p>For further details, see\n- GitHub repo: https:&#x2F;&#x2F;github.com&#x2F;cognizant-ai-labs&#x2F;autoinit\n- arXiv paper: https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;2109.08958<p>AutoInit is also available through the Cognizant AI Labs Software page, together with related software on estimating model uncertainty, multitasking, loss-function metalearning, decision making, and model management, at\n- https:&#x2F;&#x2F;evolution.ml&#x2F;software<p>-- Garrett Bingham &amp; Risto Miikkulainen",
      "time": 1642536367,
      "title": "AutoInit Software for Model Initialization",
      "type": "story"
    }
  ]
}