{
  "stories": [
    {
      "by": "drocer88",
      "descendants": 0,
      "id": 29510266,
      "score": 1,
      "time": 1639146809,
      "title": "Severe Covid could reduce male fertility",
      "type": "story",
      "url": "https://news.uga.edu/covid-affects-male-fertility/"
    },
    {
      "by": "marcelotournier",
      "descendants": 0,
      "id": 29510259,
      "score": 1,
      "time": 1639146765,
      "title": "Ransom hackers steal 50 TB of data from Brazil Public Health System",
      "type": "story",
      "url": "https://www.riotimesonline.com/brazil-news/rio-politics/brazils-health-ministry-website-hacked-overnight-and-is-offline/"
    },
    {
      "by": "jobamax",
      "descendants": 0,
      "id": 29510240,
      "score": 1,
      "text": "Hello,\nI hope you are all doing fine !<p>I am excited to announce you that  Jobamax.com beta has been launched and is available for downloading today on Iphone at https:&#x2F;&#x2F;testflight.apple.com&#x2F;join&#x2F;Lw2oQr4I<p>The app has a job board with 30K+ jobs, networking spaces for Gen Z and e-learning platform.<p>All is free !<p>I would love to get your feedbacks on the app in order to correct bugs and improve some features.<p>Let&#x27;s shape the future of work together !<p>Regards,\nAlexandre\nCEO Jobamax",
      "time": 1639146649,
      "title": "Jobamax beta: First Gen Z professional ecosystem app (review for beta – iOS)",
      "type": "story"
    },
    {
      "by": "the_origami_fox",
      "descendants": 0,
      "id": 29510237,
      "score": 1,
      "time": 1639146632,
      "title": "Quaternions",
      "type": "story",
      "url": "https://liorsinai.github.io/mathematics/2021/11/05/quaternion-1-intro.html"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29510236,
      "score": 1,
      "time": 1639146625,
      "title": "Tribal communities are facing a new threat: Instagram",
      "type": "story",
      "url": "https://www.theverge.com/22824517/wind-river-reservation-instagram-wyoming-arapaho-tribe"
    },
    {
      "by": "my123",
      "descendants": 0,
      "id": 29510224,
      "score": 1,
      "time": 1639146567,
      "title": "Fedora on Nvidia Jetson Xavier",
      "type": "story",
      "url": "https://nullr0ute.com/2021/12/fedora-on-nvidia-jetson-xavier/"
    },
    {
      "by": "JohnJamesRambo",
      "descendants": 0,
      "id": 29510218,
      "score": 2,
      "time": 1639146551,
      "title": "New CPI numbers released, 6.8% for the year",
      "type": "story",
      "url": "https://www.bls.gov/cpi/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29510211,
      "score": 1,
      "time": 1639146529,
      "title": "Benchmarks: FreeBSD 13 vs. NetBSD 9.2 vs. OpenBSD 7 vs. DragonFlyBSD 6 vs. Linux",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=article&item=bsd-linux-eo2021&num=1"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 29510185,
      "score": 4,
      "time": 1639146412,
      "title": "SARS-CoV-2 infects human adipose tissue and elicits an inflammatory response",
      "type": "story",
      "url": "https://www.biorxiv.org/content/10.1101/2021.10.24.465626v1"
    },
    {
      "by": "scailer",
      "descendants": 0,
      "id": 29510163,
      "score": 2,
      "text": "We are the developers of Scailer, a new desktop email client for Windows and Mac. Scailer is entering the final beta test and we would love to get feedback on it before the final release. As a thank you, the first 300 users to give us feedback will get an unlimited version for free.<p>Scailer is the first email client that sorts messages by contacts like WhatsApp, giving a different and (we think) better way of working with email - there’s no folders, rules or categories because, in earlier testing, we found it just wasn’t needed. Anyone who sends emails to several different people in a day should find Scailer is a good fit for them. All of our previous test users have found that they worked faster and found dealing with their email easier than before once they’d gotten used to the Scailer way of using their email. Scailer provides the highest level of email security and protection of your data, with strong encryption of your local email database as standard.<p>If you’d like to get involved, you can download Scailer here https:&#x2F;&#x2F;scailer.com&#x2F;download. Since the Scailer way of working with mail can take a little getting used to, we would be grateful if you tried the program for a week first before giving us feedback (either through the Google form that will be sent to you within the program or below in the comments).<p>We&#x27;d love to hear feedback from the HN community prior to the release of the product to see if you liked the software, and what you think we can improve. We will try to answer any questions as soon as we get them. If you’d like, you can read more here https:&#x2F;&#x2F;scailer.com&#x2F;news&#x2F;join-final-beta-testing \nThank you all, we can’t wait to hear from you!<p>Sincerely,\nThe Scailer Team.",
      "time": 1639146259,
      "title": "Call for testers of a new email client that sorts messages by contacts",
      "type": "story"
    }
  ]
}