{
  "stories": [
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31706919,
      "score": 1,
      "time": 1654972505,
      "title": "Diving brothers found the wreck of the Gloucester 300 years after sinking",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/06/diving-brothers-found-the-wreck-of-the-gloucester-300-years-after-sinking/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31706917,
      "score": 1,
      "time": 1654972489,
      "title": "Can Synthetic Biology and Pond Scum Deliver Carbon-Neutral Manufacturing?",
      "type": "story",
      "url": "https://future.com/synbio-algae-carbon-neutral-biomanufacturing/"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31706886,
      "score": 1,
      "time": 1654972363,
      "title": "A stranger’s kindness during WWII helped give us the Big Bang theory",
      "type": "story",
      "url": "https://www.nationalgeographic.com/magazine/article/how-a-strangers-kindness-helped-give-us-the-big-bang-theory"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31706868,
      "score": 1,
      "time": 1654972239,
      "title": "A Saxophonist Tricked the KGB by Encrypting Secrets in Music",
      "type": "story",
      "url": "https://www.wired.com/story/merryl-goldberg-music-encryption-ussr-phantom-orchestra/"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31706859,
      "score": 1,
      "time": 1654972203,
      "title": "Meta Halts Plans for Portal, AR Glasses, and Other Hardware",
      "type": "story",
      "url": "https://www.wired.com/story/meta-stops-selling-portal-to-consumers/"
    },
    {
      "by": "goplayoutside",
      "descendants": 0,
      "id": 31706842,
      "score": 1,
      "time": 1654972128,
      "title": "WT.Social",
      "type": "story",
      "url": "https://wt.social/about"
    },
    {
      "by": "nborwankar",
      "descendants": 0,
      "id": 31706835,
      "score": 3,
      "text": "Or is there at least one where Smart mode can be turned off verifiably AND it doesn’t keep enticing you to turn it on by withholding ease of use or some convenience feature until you just give up?",
      "time": 1654972098,
      "title": "Ask HN: Is there a TV on the market without “Smart TV” features?",
      "type": "story"
    },
    {
      "by": "samstave",
      "descendants": 0,
      "id": 31706826,
      "score": 1,
      "text": "Simple premise for discussion:<p>At what point should technology be regulated&#x2F;precluded from being in &quot;standard equipment&quot; for LEOs (not military, but police.)<p>(Regardless of the fact that the two are so overlapped, currently)<p>---<p>So the iPhone13 pro&#x2F;mx has the 3D mapping Lidar capability.<p>There are two major companies that make Police Body Cams at this point.<p>On the one hand, it makes sense to have body cams that are basically iphone 13 max equivs, which LIDAR map the spaces that are entered...<p>But that would violate Amendment 4 of the US constitution. FULL STOP:<p>Amendment IV<p>&gt;<i>The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no warrants shall issue, but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.</i><p>This means that if such LIDAR mapping was added to the major body cams that everyone wants, they immediately violate the 4th amendement... because they data they will retrieve (a fully photo 3d map of the interior of a space (such as a private citizens home) should be illegal&#x2F;unconstitutional...<p>However, we know how this all plays out.<p>If the body cams are allowed to be developed utilizing this tech, then whatever data that is derived from them goes to GovCloud.<p>(SOURCE: I worked on a major bay area&#x27;s GovCloud governance model to exactly setup the infra to capture AXON cam data and get it into govcloud)<p>---<p>SO.. at what point do we actually start talking about such policies.",
      "time": 1654972001,
      "title": "Ask HN: Policies regarding the inclusion of tech in law/surveillance?",
      "type": "story"
    },
    {
      "by": "bckr",
      "descendants": 0,
      "id": 31706819,
      "score": 1,
      "text": "Someone important to me is in a job search as a marketing designer with experience and interest in e-commerce + tech.<p>As an engineer, I&#x27;m aware of courses, books, methods, and tools for hacking the technical job search and interview process.<p>Do you have any similar resources for the job hunting designer that I can share? FAANGish-specific welcome but not necessary. Thank you.",
      "time": 1654971964,
      "title": "Ask HN: Career Resources for Marketing Designers?",
      "type": "story"
    },
    {
      "by": "URfejk",
      "descendants": 0,
      "id": 31706801,
      "score": 1,
      "time": 1654971875,
      "title": "Privacy Dashboard",
      "type": "story",
      "url": "https://www.operationprivacy.com/"
    }
  ]
}