{
  "stories": [
    {
      "by": "smbl64",
      "descendants": 0,
      "id": 32190600,
      "score": 1,
      "text": "humble-cli allows you to list all your Humble Bundle purchases, see their details, and download them from the comfort of your terminal.<p>It can also limit downloads based on their size and format.",
      "time": 1658487178,
      "title": "Show HN: humble-cli – A CLI tool to download Humble Bundle purchases",
      "type": "story",
      "url": "https://github.com/smbl64/humble-cli"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 32190596,
      "score": 1,
      "time": 1658487141,
      "title": "Finding Inner Harmony: The Underappreciated Legacy of Karen Horney",
      "type": "story",
      "url": "https://blogs.scientificamerican.com/beautiful-minds/finding-inner-harmony-the-underappreciated-legacy-of-karen-horney/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32190593,
      "score": 1,
      "time": 1658487136,
      "title": "U.S. probes China's Huawei over equipment near missile silos",
      "type": "story",
      "url": "https://www.reuters.com/world/us/exclusive-us-probes-chinas-huawei-over-equipment-near-missile-silos-2022-07-21/"
    },
    {
      "by": "soupysoupysoup",
      "descendants": 0,
      "id": 32190591,
      "score": 1,
      "text": "A &quot;recent news&quot; article referencing the defunct &quot;Sports Authority&quot; caught my attention today. The entire text appears to be computer generated nonsense. Is there a business case for publishing this?<p>Article for reference:\nhttps:&#x2F;&#x2F;medium.com&#x2F;@f3eulca622&#x2F;15-reasons-why-you-shouldnt-ignore-baltimore-ravens-super-bowl-apparel-at-sports-authority-cheap-2b1a1166dc60",
      "time": 1658487109,
      "title": "Ask HN: What Is the Purpose of Publishing a Nonsense CG Article?",
      "type": "story"
    },
    {
      "by": "nradov",
      "descendants": 0,
      "id": 32190588,
      "score": 1,
      "time": 1658487073,
      "title": "High Housing Costs, Remote Work Leading People to Move Out of the Bay Area",
      "type": "story",
      "url": "https://www.nbcbayarea.com/news/local/bay-area-residents-moving-destinations/2947694/"
    },
    {
      "by": "viebel",
      "descendants": 0,
      "id": 32190574,
      "score": 1,
      "time": 1658486841,
      "title": "Clj-commons/etaoin: Pure Clojure Webdriver protocol implementation",
      "type": "story",
      "url": "https://github.com/clj-commons/etaoin"
    },
    {
      "by": "omitmyname",
      "descendants": 0,
      "id": 32190563,
      "score": 1,
      "text": "As an example. When I’m developing some requests handlers I ask myself those questions:\n1) how do I handle multiple same requests\n2) What happens if database fails\n3) What happens if server fails\n4) How do I work with time if users are from different timezones\nEtc<p>Do you have some kind of cheat sheet?",
      "time": 1658486750,
      "title": "Ask HN: Back end. Which questions you ask yourself while developing back end?",
      "type": "story"
    },
    {
      "by": "yangzhiganlu",
      "descendants": 1,
      "id": 32190559,
      "kids": [
        32190560
      ],
      "score": 1,
      "time": 1658486724,
      "title": "Truck Knowledge: Engines of HOWO Dump Truck-Talenet",
      "type": "story",
      "url": "https://www.trucksglobal.com/engines-of-howo-dump-truck/"
    },
    {
      "by": "ff133",
      "descendants": 0,
      "id": 32190556,
      "score": 1,
      "text": "Hi, I&#x27;m looking for a way to rotate SSH-keys in an infrastructure. I have no experience when it comes to rotating SSH-keys.<p>Today I use SSH Key-based authentication to authenticate to my servers, tho I have been wondering if I should take a look SSH Certificate-based authentication, or if it is just an &quot;idea&quot; that seems nice.<p>This is far from a well structured question, but I appreciate anyone who contributes.<p>Thanks.",
      "time": 1658486694,
      "title": "Ask HN: Experience when it comes to SSH-key rotation?",
      "type": "story"
    },
    {
      "by": "oriettaxx",
      "descendants": 0,
      "id": 32190543,
      "score": 1,
      "text": "I just received this notice from Google<p>&quot;We associate your Google Account with a country (or region) so that we can better provide our services to you. This association is used to determine two things:<p><pre><code>    The Google company that provides the services, processes your information and is responsible for complying with applicable privacy laws\n    The version of the Terms of Service that governs our relationship, which can vary depending on local laws\n</code></pre>\nYour country association will change within 30 days:<p><pre><code>    from XXX\n    to YYY </code></pre>\n&quot;<p>where XXX is a country in europe, and YYY is not (is where I often go in vacation)<p>then<p>&quot;If the country associated with your account doesn’t match your country of residence, it could be because of a difference between your country of work and residence, because you’ve installed a virtual private network (VPN) to mask your IP address, or because you live close to a territorial border. If you recently moved, it can take about a year for your country association to update. You can find more information about your country association, and a way to request a change if you think that it’s wrong, by reviewing the Google Terms of Service.\nYour country association affects the Terms of Service that apply to your use of our services. &quot;<p>so, basically, I am not protected by EU privacy law, and I cannot reverse it.<p>Am I the only one?<p>(btw, I already moved my data out of Google, but I still have an account, almost empty, for some email forwarding)",
      "time": 1658486539,
      "title": "Ask HN: Google moving my account out of Europe",
      "type": "story"
    }
  ]
}