{
  "stories": [
    {
      "by": "fossuser",
      "descendants": 0,
      "id": 28542274,
      "score": 1,
      "time": 1631728786,
      "title": "Stupid-Simple Electric Paramotor",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=BeayJZzaXjM"
    },
    {
      "by": "xenophonf",
      "descendants": 0,
      "id": 28542251,
      "score": 3,
      "time": 1631728652,
      "title": "Dan Price Says Raising Min Wage to $70K Led to Baby Boom, Revenue Rise",
      "type": "story",
      "url": "https://www.businessinsider.com/gravity-payments-dan-price-ceo-raise-minimum-wage-revenue-2021-8"
    },
    {
      "by": "PeterCorless",
      "descendants": 0,
      "id": 28542248,
      "score": 2,
      "time": 1631728641,
      "title": "What We’ve Learned After 6 Years of IO Scheduling",
      "type": "story",
      "url": "https://www.p99conf.io/2021/09/15/what-weve-learned-after-6-years-of-io-scheduling/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28542242,
      "score": 1,
      "time": 1631728606,
      "title": "Good 4 who? How music copyright has gone too far",
      "type": "story",
      "url": "https://www.theverge.com/22672704/olivia-rodrigo-switched-on-pop-charlie-harding-music-copyright"
    },
    {
      "by": "mariuz",
      "descendants": 0,
      "id": 28542240,
      "score": 1,
      "time": 1631728585,
      "title": "Python Firebird-driver 1.3.0 released with Firebird 4 support",
      "type": "story",
      "url": "https://firebirdsql.org/en/news/firebird-driver-1-3-0-released/"
    },
    {
      "by": "adrhead",
      "descendants": 0,
      "id": 28542239,
      "score": 8,
      "time": 1631728584,
      "title": "Cryptoradar is a tool that help you buy or sell crypto at the best price",
      "type": "story",
      "url": "https://cryptoradar.co/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28542222,
      "score": 2,
      "time": 1631728510,
      "title": "“Melting face,” “pregnant person,” and 35 other emoji approved for Unicode 14.0",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/09/melting-face-pregnant-person-and-35-other-emoji-approved-for-unicode-14-0/"
    },
    {
      "by": "Ancalagon",
      "descendants": 0,
      "id": 28542219,
      "score": 1,
      "text": "Hey HN, I’ve been on the interview grind for a couple of months now. Made it to four final rounds, and no offers. This in huge contrast to my last job hunt experience two years ago when I had multiple offers in hand after just three final round interviews.<p>Has anyone else noticed interviews getting harder? And I don’t just mean leetcode, but most final rounds now are longer (more interviews overall), and require multiple systems design and plenty of leetcode M&#x2F;H. I just finished (and failed) a set of 8(!) interviews for a senior SDE position.<p>Maybe this is just because I’m now aiming for a higher tier of pay or experience (senior roles vs. non-senior) and need to seriously up my game, but grinding all of the leetcode and systems design, looking up companies, asking relevant questions, had really started weighing down on my personal time outside of work (~40hrs&#x2F;wk). Wondering what others feel.",
      "time": 1631728487,
      "title": "Ask HN: SDE Interviews getting more difficult?",
      "type": "story"
    },
    {
      "by": "djsedaw",
      "descendants": 0,
      "id": 28542194,
      "score": 1,
      "time": 1631728351,
      "title": "Embrio-real-time, agent based programming for Arduino",
      "type": "story",
      "url": "https://embrio.io/"
    },
    {
      "by": "cgchen",
      "descendants": 1,
      "id": 28542189,
      "kids": [
        28542199
      ],
      "score": 1,
      "text": "mello is a YC S21 company. We’re building the new standard that companies use to measure, track and action on burnout. To inspire happier, healthier, more motivated teams. We know talent is extremely difficult to acquire right now and retaining team members is even more difficult in a remote-first world.<p>Here’s how mello can help you and your team combat burnout today:<p>mello (a simple slack integration) checks in with all of your employees on a weekly basis with a set of 20 questions (It sounds like a lot, but takes 2-3 mins to complete according to our 10K+ respondents) via our mello index which we’ve scientifically designed to measure their burnout score.\nUsers get a score (from 0-80) placing them in one of 5 zones from not mello (burnt out) to mello mastery (In flow state).\nUsers will then get a list of “nudges” or actions they can take increase their mello score and move up their mello zone.\nIf you currently offer employee benefits, have an EAP (Employee Assistant Plans), wellness perks like BetterUp, Modern Health or Calm and Headspace, you can plug them into the nudges and surface this to your employees every week, when they need it most! (so hopefully they stop asking: “What benefits do we have again?”)\nWe as team mello also have a list of resources on how to deal with burnout symptoms like exhaustion, anxiety, depression and surface them in nudges to your employees during each check-in so users have tangible actions and next steps they can take.\nAs the admin you will get a mello dashboard that will give you trending data on how your team is doing overall and how individuals are doing (mello gives individuals the ability to share their check-in score with you or keep it anonymous).\n How to redeem this YC offer:<p>We’ve heard of burnout in our S21 batch and we know founders and motivated employees face burnout too (trust me we’ve been there) so we’re happy to offer YC teams the chance to try mello FREE for 28-days instead of 21.<p>To redeem the offer, please use our magic code: YC4WEEKS when you Register here<p>Want to see the product before you try it? You can book a 15min demo with Arisa from our team.<p>We’re living through unprecedented times at the moment, so aside from crushing it as you all are doing, remember to stay mello!<p>--<p>Some FAQ’s:<p>Q: Will my employees want to fill-out a survey every week?<p>A: Our average completion rate across 600+ users is 70%, we’ve heard users say “I look forward to doing my mello check-in every week because it gives me time to reflect.” or &quot;the check-in experience of mello is smooth as butter.” or “I carve out 5mins each week to do it, and I love that it takes so little time and I get value out of it right away.”<p>Q: So my employees can do this anonymously or share their score with me?<p>A: Yes, users have the option of doing their mello check-in anonymously or non-anonymously, it’s entirely up to them. (Fun fact: 60% of employees using mello choose to share who they are with managers and HR!)<p>Q: What’s the science behind your index? Why should I trust it?<p>A: We tested our index with over 10K+ respondents who’re today’s knowledge workers to dial in the zones and scores for accuracy!<p>Q: Why is it important to get our employees into the ‘mello mastery zone’ or to achieve flow?<p>A: I’m so glad you asked! Adam Grant, one of today’s leading thinkers in organizational psychology said that “Researchers found that during the pandemic the best predictor of wellbeing was not optimism, it was flow.” (His TEDTalk on flourishing&#x2F;flow delves into more detail) so the more you can get yourself and your employees into flow the better it is for their wellbeing and help them not burn out!<p>Q. How much is mello after the 28-day free trial?<p>$5 per employee per month (for the first-year) or $90 per employee per year. If pricing post-trial is a barrier for you but you want to continue to use it mello cause you find value, happy to chat at cg@itsmello.co",
      "time": 1631728337,
      "title": "Struggling with burnout? mello can help – 28day Free Trial for YC companies",
      "type": "story"
    }
  ]
}