{
  "stories": [
    {
      "by": "impostervt",
      "descendants": 0,
      "id": 30777309,
      "score": 2,
      "time": 1648034654,
      "title": "How the NYT has changed its map symbology as Russia invaded Ukraine",
      "type": "story",
      "url": "https://twitter.com/LeviWesterveld/status/1506253203704356867"
    },
    {
      "by": "ptskd",
      "descendants": 0,
      "id": 30777308,
      "score": 1,
      "time": 1648034649,
      "title": "Show HN: Vapor Chat. Chat Room for Everything Vaporwave",
      "type": "story",
      "url": "https://vapor-chat.web.app/"
    },
    {
      "by": "Nyamutsambira",
      "descendants": 1,
      "id": 30777292,
      "kids": [
        30777293,
        30777316
      ],
      "score": 1,
      "time": 1648034515,
      "title": "Pass Mark: Math Made Simple",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=com.nyamutsambira.passmark&hl=en_US&gl=US"
    },
    {
      "by": "jimmierwilliams",
      "descendants": 1,
      "id": 30777267,
      "kids": [
        30777268
      ],
      "score": 1,
      "time": 1648034301,
      "title": "Confused over React Native vs. swift in 2022?",
      "type": "story",
      "url": "https://refind.com/links/123794705?via=refind"
    },
    {
      "by": "mikomikarro",
      "descendants": 0,
      "id": 30777250,
      "score": 1,
      "time": 1648034137,
      "title": "Putin, Biden Face a Dangerous Choice: How Does Russia Want to Lose?",
      "type": "story",
      "url": "https://www.wired.com/story/biden-putin-russia-lose-ukraine-war/"
    },
    {
      "by": "ChuckNorris89",
      "descendants": 0,
      "id": 30777235,
      "score": 2,
      "time": 1648034001,
      "title": "NLAW anti-tank launcher unboxing",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LUDrLFrfr_s"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30777228,
      "score": 2,
      "time": 1648033952,
      "title": "Almost 37 years after its launch, someone found an Easter egg in Windows 1.0",
      "type": "story",
      "url": "https://www.techradar.com/news/almost-37-years-after-its-launch-someone-found-an-easter-egg-in-windows-10"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 30777227,
      "kids": [
        30777229
      ],
      "score": 1,
      "time": 1648033949,
      "title": "What the Silicon Valley Prophet Stewart Brand Sees on the Horizon",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/23/technology/stewart-brand-tech.html"
    },
    {
      "by": "tomerv",
      "descendants": 0,
      "id": 30777224,
      "score": 2,
      "text": "I&#x27;m trying to get into open source development, and I&#x27;ve made a few attempts in the last year or so. It was always small bug fixes or enhancements to existing project, and the experience was consistently terrible. It made me wonder how developers get into seriously contributing to these projects - and whether it&#x27;s even possible.<p>The main hurdle I encountered is simply lack of response from the project maintainers. This happened to me several times already: I would encounter a bug or limitation, investigate the cause, fix it, and open a pull request with as many details as I could about the issue and how I fixed it. This requires several hours of work - understanding the project structure, testing the fix, adding unit tests, and so on. You could say I did my homework. Then I waited, and waited, and waited…<p>The last time this happened was the most representative. I don&#x27;t want to call out any specific projects - that would seem unfair - it&#x27;s a well-known open source project that originates from a FAANG-level company, popular enough to appear on CVs. It&#x27;s one of those libraries that is used everywhere. I encountered a bug in that library, and opened the most detailed issue I could, even pointed to specific lines of code and what needs to be changed there. Due to my previous experience, I didn&#x27;t open a PR yet. I wanted to get confirmation on my observation first, and I mentioned in the issue that after getting confirmation that my direction is correct I would open a PR. The result? Complete silence. This was 2 weeks ago - should I expect to wait more for a response?<p>I understand that these are open source projects, and that the maintainers don&#x27;t owe me anything, and so on. I&#x27;m just wondering if I&#x27;m doing something wrong. Do others here have similar experiences? How would someone get seriously involved in such a project, if just making the first steps is met with such roadblocks? This reminds me of xkcd #2347, where all modern digital infrastructure depends on &quot;a project some random person in Nebraska has been thanklessly maintaining since 2003&quot;. It&#x27;s like I want to help that person, but they aren&#x27;t answering my calls.",
      "time": 1648033899,
      "title": "Ask HN: Why is contributing to existing open source projects so hard?",
      "type": "story"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 30777220,
      "score": 1,
      "time": 1648033884,
      "title": "Education Dept. Says Owners of For-Profit Schools Must Pay If College Close",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/22/business/for-profit-colleges-education-department.html"
    }
  ]
}