{
  "stories": [
    {
      "by": "GabrieleR",
      "descendants": 0,
      "id": 29892237,
      "score": 1,
      "time": 1641913494,
      "title": "Mafia fugitive arrested when spotted on Google Street View – the Inside story",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=arYEpjgjlPg"
    },
    {
      "by": "mikehall314",
      "descendants": 0,
      "id": 29892218,
      "score": 1,
      "time": 1641913407,
      "title": "Package-lock.json pins only first-order dependencies",
      "type": "story",
      "url": "https://twitter.com/brianleroux/status/1480905580873072643"
    },
    {
      "by": "boeingUH60",
      "descendants": 0,
      "id": 29892203,
      "score": 1,
      "time": 1641913339,
      "title": "Turo S-1 IPO",
      "type": "story",
      "url": "https://www.sec.gov/Archives/edgar/data/1514587/000119312522005696/d145731ds1.htm"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 29892179,
      "score": 1,
      "time": 1641913224,
      "title": "The Gargantuan Challenge of 5G Semiconductors",
      "type": "story",
      "url": "https://semiengineering.com/the-gargantuan-5g-chip-challenge/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29892174,
      "score": 1,
      "time": 1641913203,
      "title": "How to Read an Unlabeled Sales Chart (2013)",
      "type": "story",
      "url": "https://www.evanmiller.org/how-to-read-an-unlabeled-sales-chart.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29892171,
      "score": 1,
      "time": 1641913193,
      "title": "Ever Plugged a USB in Wrong? Of Course You Have. Here's Why (2019)",
      "type": "story",
      "url": "https://www.npr.org/2019/06/21/734451600/ever-plugged-a-usb-in-wrong-of-course-you-have-heres-why"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 29892163,
      "score": 1,
      "time": 1641913167,
      "title": "Vector Database",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Vector_database"
    },
    {
      "by": "syrusakbary",
      "descendants": 0,
      "id": 29892150,
      "score": 1,
      "time": 1641913103,
      "title": "Spain is calling for Covid-19 to be treated as an endemic disease",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-01-11/omicron-has-spain-looking-past-pandemic-as-europe-surge-persists"
    },
    {
      "by": "attasi",
      "descendants": 0,
      "id": 29892134,
      "score": 3,
      "text": "Hi HN, This is Tom, Adam, and Brandon from Clover (<a href=\"https:&#x2F;&#x2F;cloverapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;cloverapp.com</a>) – a digital notebook that blends notes, tasks, whiteboards, and a daily planner into one streamlined app.<p>We&#x27;ve spent our careers working on creative tools. Tom started building web-based design products with Apple back in 2011. Our first startup – Macaw – was one of the first no-code tools on the market. It was acquired by InVision years ago, where we went on to build numerous other design tools. We are also long-time productivity junkies, having built nine different note-taking and task management apps over the past eight years. These were passion projects that were fun to build and use.<p>Working in the design industry, we noticed how designers struggle to communicate their ideas with design tools alone. They often spend more time in a text document outlining feature specifications than they do in their design program designing the actual interface. Task management is done in yet another program, and so on.<p>At the same time, we noticed how text editors don’t do a good job of supporting thinking. Our brains naturally think in a non-linear fashion. Great ideas don&#x27;t flow out of us with a beginning, a middle and an end—they require an iterative process of divergence and convergence (the ‘double diamond model’, for those familiar). Forcing people to record their ideas in linear documents is a terrible constraint. It&#x27;s much more intuitive to work in a non-linear fashion like designers do within their design tools.<p>Conclusion: Thinking tools lack communication and productivity features. Writing tools lack thinking and iteration capabilities. This means you need to string together multiple tools across an idea’s lifecycle, which is difficult to manage.<p>This gave us the idea for Clover: a single workspace to support all stages of an idea’s development: from brainstorming, design, planning, all the way to execution. It should be as good for thinking and iteration as design tools, have powerful text and knowledge management capabilities, and support planning and task tracking workflows. The mission is to help you think more creatively and get more done every day.<p>The heart of our implementation is a new type of document, which we call a Surface. It&#x27;s a freeform spatial document with a heavy emphasis on text capabilities. This required us to build a new type of text editor from the ground up. At its core, it&#x27;s similar to other modern markdown-style editors (like Dropbox Paper) but it also borrows mechanics from design tools (like Figma). Instead of working down a page from top to bottom, you can work in any direction, drag and drop text the way you would move layers in a design tool, sketch on top of your documents, embed rich media from across the web, and a lot more.<p>Building a workspace like this requires meeting users&#x27; expectations of not just one but many different tools: digital whiteboarding, note-taking, tasks, and knowledge management. Consolidating technology and UX into something that actually works across all of those different functions is an interesting and challenging systems design problem. Text editors are deceptively complex to build, and we had to rethink a number of things about traditional text editors to enable Clover&#x27;s spatial capabilities. We don&#x27;t have all of the features of the traditional programs, but we think having all of your tools together is more valuable.<p>We also spent a fair amount of time thinking about how a product like this should fit into your daily workflow. Our Daily Notes feature is intended to be a place to return to throughout your day to take notes, plan tasks, journal, etc. It has some special functionality to automatically roll over any tasks that you didn&#x27;t finish from day to day, and it aggregates tasks across all of your pages, so you have one location to see all of your priorities.<p>Having notes, whiteboarding, tasks, and a daily planner all together in one tool makes it frictionless to carry out ideas from beginning to end and ensures nothing gets lost in the cracks.<p>Clover is used for a wide variety of things – taking notes, planning tasks, etc. Some of the more interesting one ones we&#x27;ve seen are: planning out presentations and practicing them with Clover&#x27;s frames and presentation mode; outlining a vision for a sales team using our diagramming tools; drafting blog posts and using a Clover surface to iterate on the text or take notes in the margins; simple kanban to manage small projects; watching videos on a surface while taking notes and pasting screenshots directly next to the embed.<p>We charge a simple monthly subscription and you can try it out here: <a href=\"http:&#x2F;&#x2F;cloverapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cloverapp.com</a>.<p>We’d love to hear what you think of the product and ideas on how to improve it. Thanks!",
      "time": 1641913046,
      "title": "Launch HN: Clover (YC S20) – Notes, whiteboarding, and daily planner in one tool",
      "type": "story"
    },
    {
      "by": "tigersforhire",
      "descendants": 0,
      "id": 29892123,
      "score": 1,
      "time": 1641912983,
      "title": "Finding unhandled errors using CodeQL",
      "type": "story",
      "url": "https://blog.trailofbits.com/2022/01/11/finding-unhandled-errors-using-codeql/"
    }
  ]
}