{
  "stories": [
    {
      "by": "joshma",
      "descendants": 0,
      "id": 29581161,
      "score": 1,
      "text": "Wondering if anyone is running Redis for message queues, not caching, at a moderate to large scale. My impression is that you&#x27;d require cluster mode + streams to get some (rough) parity.<p>Has it been easy to operate? Is its durability story reliable? Can it be used as a lighter-weight alternative to Kafka?",
      "time": 1639676657,
      "title": "Ask HN: Anyone using Redis cluster and streams?",
      "type": "story"
    },
    {
      "by": "ckoning",
      "descendants": 0,
      "id": 29581158,
      "score": 1,
      "time": 1639676653,
      "title": "Show HN: CloudGraph – The GraphQL API for AWS and Azure",
      "type": "story",
      "url": "https://www.cloudgraph.dev/"
    },
    {
      "by": "davegauer",
      "descendants": 0,
      "id": 29581157,
      "score": 1,
      "time": 1639676650,
      "title": "Why Pluto Is a Planet (2015)",
      "type": "story",
      "url": "https://www.philipmetzger.com/nine-reasons-why-pluto-is-a-planet/"
    },
    {
      "by": "ConfessionTime",
      "descendants": 0,
      "id": 29581125,
      "score": 2,
      "text": "I have been working as a software developer for almost two decades. I have received multiple promotions. I make decent money, 3x - 4x my area&#x27;s median salary, so I live a comfortable life. I have never been fired or unemployed for more than a few months total over my entire career. Through most of that time I have averaged roughly 5 - 10 hours of actual work a week. I&#x27;m not even discounting job related but non-coding time as not work. There are literally days in which the only time I spend on my job is the few minutes it takes to attend the morning stand-up.  Then I successfully bullshit my way through our next stand-up to hide my lack of production.<p>No one has ever called me out on this and my performance reviews range from mediocre to great. I&#x27;m generally a smart person. I went to a top 30 university, but it&#x27;s not like I&#x27;m a genius or I&#x27;m coasting off connections made while getting a Harvard education. I wouldn&#x27;t consider myself an abnormally talented developer. I often don&#x27;t understand the technical details other engineers discuss in meetings. I have probably bombed more tech interviews than I have passed. All my jobs have been between 2-5 years so I&#x27;m neither finding a place to stagnate or leaving before anyone could judge my production. It feels like I am in the middle of the bell curve in terms of career success. So what gives?<p>Are most of us secretly lying about how much we are working? Do people regularly run into coworkers like me during their career and simply ignore it because they find it too awkward to criticize them? Have I just been incredibly lucky and every boss I have had is too incompetent to notice? Do I have imposter syndrome and I am actually a 10x developer whose laziness makes them a 1x developer?<p>These questions have kept popping up in my mind over the last year.  Remote work during the pandemic has allowed me to finally be honest with myself and stop pretending I am working when I am not.  I want to know if I was the only one pretending.",
      "time": 1639676530,
      "title": "Ask HN: Are most of us developers lying about how much work we do?",
      "type": "story"
    },
    {
      "by": "bullcitydev",
      "descendants": 0,
      "id": 29581112,
      "score": 1,
      "time": 1639676472,
      "title": "Trying Out Generics in Go",
      "type": "story",
      "url": "https://markphelps.me/posts/trying-out-generics-in-go/"
    },
    {
      "by": "Fabricio20",
      "descendants": 0,
      "id": 29581110,
      "score": 1,
      "time": 1639676462,
      "title": "Bitburner: An open-source programming-based incremental game",
      "type": "story",
      "url": "https://danielyxie.github.io/bitburner/"
    },
    {
      "by": "doppp",
      "descendants": 0,
      "id": 29581107,
      "score": 2,
      "time": 1639676447,
      "title": "How Deus Ex Blended Genres To Change Shooters Forever | War Stories",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Bb98qIZfwgc"
    },
    {
      "by": "mlabouardy",
      "descendants": 0,
      "id": 29581073,
      "score": 1,
      "time": 1639676321,
      "title": "Show HN: I wrote a book on pipeline as code",
      "type": "story",
      "url": "https://www.manning.com/books/pipeline-as-code"
    },
    {
      "by": "hncurious",
      "descendants": 0,
      "id": 29581072,
      "score": 1,
      "time": 1639676318,
      "title": "San Francisco exodus isn’t over, according to new migration data",
      "type": "story",
      "url": "https://www.sfchronicle.com/projects/2021/california-bay-area-migration-maps/"
    },
    {
      "by": "nik12795",
      "descendants": 1,
      "id": 29581061,
      "kids": [
        29581065
      ],
      "score": 2,
      "time": 1639676271,
      "title": "Show HN: I built a voice activated golf bag that shoots your clubs",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=v42RaYL28ZA"
    }
  ]
}