{
  "stories": [
    {
      "by": "sefi-infralight",
      "descendants": 0,
      "id": 30701378,
      "score": 1,
      "time": 1647450438,
      "title": "Show HN: An Open Source Terraform HCL Checker – ValidIaC",
      "type": "story",
      "url": "https://validiac.com/"
    },
    {
      "by": "mab477",
      "descendants": 0,
      "id": 30701377,
      "score": 3,
      "text": "Hi HN! Matias and Jessica here, we&#x27;re the founders of Civic (https:&#x2F;&#x2F;civicapp.co&#x2F;), an online platform that connects people to causes in their area. That could mean everything from volunteering opportunities to activism and politics.<p>Every year, over 180M Americans contribute to social causes, yet doing so takes a significant amount of time and energy — information on how to get involved or take action often spreads through disconnected pages, newsletters, and word of mouth. Civic plans to solve this by creating a hub for people to find and organize events, connect, and donate to causes around them.<p>We just launched our MVP in NYC, focusing exclusively on events. I (Matias) started working on Civic while still in college, where I also spent a lot of my time in politics, having worked with ActBlue and a presidential campaign. I also served as a hyper-local elected official in DC, where I represented about 2k constituents to the city. Jessica is a full-stack software engineer and spent 5 years working at Google before joining us. She&#x27;s fully responsible for our tech and is the reason why we&#x27;re able to build this at all.<p>During my time in DC, one of the most interesting things I observed was how the causes that were most likely to get people engaged were the local&#x2F;neighborhood issues that affected them directly. Yet, because of their local nature, those causes were also the ones least likely to get publicity. That plus the general lack of a true online hub for civic engagement led us to start Civic.<p>The MVP is rough around the edges and we&#x27;re definitely looking for ideas and feedback on how we can improve! Some of the features in our dev pipeline include an onboarding process to customize the content seen by each user (causes are very broad); easy and streamlined, no-fee donations to organizations; social &quot;spaces&quot; based on location and interests where users can meet and discuss issues with others; and much more!<p>For those curious about revenue, we plan to monetize by introducing donations. Right now, over $300B are donated by individuals to non-profits in the United States each year, much of which goes through outdated platforms that charge high fees. We&#x27;d target smaller, local organizations that aren&#x27;t well served by existing platforms, and would follow the same model as GoFundMe and a few other companies, allowing users to add an optional &quot;tip&quot; to Civic after each donation. From our research, this tends to lead to tips of about 6-8% per transaction.<p>You can check out our MVP here: https:&#x2F;&#x2F;civicapp.co&#x2F;<p>We&#x27;d really appreciate any and all feedback (especially related to features, new and existing), please let us know what you think! :)",
      "time": 1647450434,
      "title": "Show HN: Civic – Online Hub for Causes",
      "type": "story"
    },
    {
      "by": "dynamite-ready",
      "descendants": 0,
      "id": 30701353,
      "score": 1,
      "text": "I&#x27;d been recently introduced to Binkist and think it&#x27;s great. For the uninitiated, Binkist (and a similar app called Scribd), take popular books off the retail shelf, and condense their 200+ pages into an 8 - 15 page summary.<p>The summaries are good, and are often accompanied by audio transcripts, but what do others make of these apps? Do you find it a good way to learn? Or do you think it&#x27;s perhaps diluting the true benefit of reading the books themselves?",
      "time": 1647450308,
      "title": "Ask HN: Do you find apps like Binklist and Scribd useful?",
      "type": "story"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 30701348,
      "score": 1,
      "time": 1647450289,
      "title": "Crypto currencies are not immune to politics of legacy finance",
      "type": "story",
      "url": "https://twitter.com/palladiummag/status/1504141172058509315"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30701335,
      "score": 2,
      "time": 1647450224,
      "title": "General Petraeus: Invasion reveals a host of weaknesses in Russia's military",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_95b1b5231303f08e60a964a7ba23d183"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 30701332,
      "score": 2,
      "time": 1647450216,
      "title": "German government advises against using Kaspersky antivirus",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/german-government-advises-against-using-kaspersky-antivirus/"
    },
    {
      "by": "moinnadeem",
      "descendants": 0,
      "id": 30701311,
      "score": 2,
      "time": 1647450134,
      "title": "Composer: A new PyTorch library to train models 4x faster with better algorithms",
      "type": "story",
      "url": "https://github.com/mosaicml/composer"
    },
    {
      "by": "drewvolpe",
      "descendants": 0,
      "id": 30701296,
      "score": 2,
      "time": 1647450047,
      "title": "Latency is driving edge and serverless computing infrastructure",
      "type": "story",
      "url": "https://medium.com/@penberg/latency-is-driving-edge-and-serverless-computing-infrastructure-21b708cbdfce"
    },
    {
      "by": "weinzierl",
      "descendants": 0,
      "id": 30701289,
      "score": 7,
      "time": 1647450031,
      "title": "Microsoft says Win11 Explorer ads were ‘not intended to be published externally’",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/15/22979251/microsoft-file-explorer-ads-windows-11-testing"
    },
    {
      "by": "davidbarker",
      "descendants": 0,
      "id": 30701282,
      "score": 1,
      "time": 1647449978,
      "title": "Font Awesome and OCHA Partner to Create Humanitarian Icons",
      "type": "story",
      "url": "https://blog.fontawesome.com/humanitarian-icons/"
    }
  ]
}