{
  "stories": [
    {
      "by": "crhulls",
      "descendants": 0,
      "id": 32071020,
      "score": 1,
      "time": 1657638229,
      "title": "James Webb first images – additional full resolution shots now live",
      "type": "story",
      "url": "https://webbtelescope.org/news/news-releases?Collection=First%20Images"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32071009,
      "score": 1,
      "time": 1657638187,
      "title": "Fresh US Inflation Peak to Keep Fed on Aggressive Interest Rate Path",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-07-12/fresh-us-inflation-peak-to-keep-fed-on-aggressive-rate-path"
    },
    {
      "by": "MuchoMaas",
      "descendants": 0,
      "id": 32070989,
      "score": 1,
      "time": 1657638119,
      "title": "Global Changes in Child and Adolescent Physical Activity During the Pandemic",
      "type": "story",
      "url": "https://jamanetwork.com/journals/jamapediatrics/fullarticle/2794075"
    },
    {
      "by": "gmays",
      "descendants": 1,
      "id": 32070957,
      "kids": [
        32070990
      ],
      "score": 1,
      "time": 1657637962,
      "title": "Meta launches Sphere, an AI knowledge tool based on open web content",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/11/meta-launches-sphere-an-ai-knowledge-tool-based-on-open-web-content-used-initially-to-verify-citations-on-wikipedia/"
    },
    {
      "by": "pil0u",
      "descendants": 0,
      "id": 32070952,
      "score": 1,
      "text": "Some time in the past 60 days, I stumbled upon a top HN article which gave pieces of advice when you join a new company, which is currently my case. I thought I saved that article like hundreds before, but a few days later and after <i>a couple hours</i> of search in my bookmarks manager, my history and through HN Algolia search, I can&#x27;t find it anymore.<p>I can&#x27;t say much about the article for I haven&#x27;t read most of it.\nThe title was not very explicit (no &quot;career&quot; keyword in it), but I know that the author mentioned &quot;the first 100 days&quot; in the introduction as a cliché not to follow.<p>Does anybody have any idea of what the article I am describing is?<p>I have no idea where I could ask for help except for here, so if there is any more appropriate place I&#x27;ll comply.<p>Thank you",
      "time": 1657637949,
      "title": "Ask HN: Could you help me find a not-so-old HN top story?",
      "type": "story"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 32070947,
      "score": 2,
      "time": 1657637926,
      "title": "Texas Bitcoin Miners Power Down as Heat Wave Threatens Grid with Blackouts",
      "type": "story",
      "url": "https://decrypt.co/104878/texas-bitcoin-miners-power-down-heat-wave-grid-rolling-blackouts"
    },
    {
      "by": "reedciccio",
      "descendants": 0,
      "id": 32070937,
      "score": 2,
      "time": 1657637875,
      "title": "The future of innovation has patent-free standards",
      "type": "story",
      "url": "https://blog.opensource.org/the-future-of-innovation-has-patent-free-standards/"
    },
    {
      "by": "PLG88",
      "descendants": 0,
      "id": 32070927,
      "score": 3,
      "text": "Last year, we - Capgemini, Arm, and NetFoundry - created a blueprint for building zero trust principles using open source technology into autonomous vehicles. The objective was to accelerate innovation in software and the transition to new digital business models while ensuring the highest functional safety, reliability, and security.<p>The main components including:\n- AWS Greengrass - an open-source edge runtime and cloud service that helps you build, deploy, and manage intelligent device software.\n- Arm Parsec - an open-source initiative to provide a common API to hardware security and cryptographic services in a platform-agnostic way\n- OpenZiti - an open-source project focused on bringing Zero Trust networking to any use case or application while closing all inbound ports from the internet.<p>We hope you find this interesting and please share any comments, questions, etc.<p>https:&#x2F;&#x2F;capgemini-engineering.com&#x2F;us&#x2F;en&#x2F;insight&#x2F;converging-on-a-zero-trust-blueprint&#x2F;",
      "time": 1657637831,
      "title": "Open source blueprint for zero trust principles applied to autonomous vehicles",
      "type": "story"
    },
    {
      "by": "jehlakj",
      "descendants": 1,
      "id": 32070921,
      "kids": [
        32070936
      ],
      "score": 1,
      "text": "And whoever has the biggest network wins?<p>I guess it&#x27;s no surprise, but it&#x27;s gotten to the point where the top products are solving the most shallow problems. Even among the apps that target me, I&#x27;ve seen it done before countless times just with prettier UIs.<p>I&#x27;ve been thinking about announcing my app on product hunt, but I feel like the odds are against indie devs that don&#x27;t have backings from a VC or a network of high profile influencers.<p>Just what sort of audience am I working with on the platform when it&#x27;s clear that my actual target audience isn&#x27;t them? When does it make sense to announce it on product hunt?",
      "time": 1657637796,
      "title": "Ask HN: Is product hunt a popularity contest?",
      "type": "story"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 32070902,
      "score": 1,
      "time": 1657637733,
      "title": "AWS Cloud WAN: A Managed WAN Service",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/new-cloud-wan-a-managed-wan-service/"
    }
  ]
}