{
  "stories": [
    {
      "by": "_josh_meyer_",
      "descendants": 0,
      "id": 29786132,
      "score": 2,
      "time": 1641241035,
      "title": "Show HN: Clone your voice and speak a foreign language",
      "type": "story",
      "url": "https://coqui.ai/"
    },
    {
      "by": "vagabund",
      "descendants": 0,
      "id": 29786129,
      "score": 1,
      "text": "Sign-up for a new account on Twitter, Telegram, Discord, Facebook, etc. and your phone contacts are automatically alerted to its existence.  It seems everywhere there&#x27;s an awareness&#x2F;emphasis on the privacy of your online presence from the prying eyes of advertisers&#x2F;authorities&#x2F;prospective employers, but little attention paid to the privacy of pseudonymous accounts from one&#x27;s real-world social circles.  For reasons that should be obvious, not least of which is mitigating career risk, a large number of people share a preference for bifurcating their online persona(s) from their actual lives, yet few options exist for doing so, even for services that position themselves as privacy-forward (e.g., Telegram, Discord).  Throwaway phone numbers are either caught and banned by spam filters, or present untenable security-risks to the account.<p>It doesn&#x27;t seem like there&#x27;s much appetite for this to change among social-network founders either: https:&#x2F;&#x2F;twitter.com&#x2F;nikitabier&#x2F;status&#x2F;1403498766737444865<p>&quot;@nikitabier\nIf you’re building a social app and less than 70% of your users are granting access to contacts, your app is dead on arrival until that’s fixed\nNetwork effects will never form if you expect users—who have a 5 second attention span—to find their friends by typing in usernames.&quot;<p>What options exist for being on populated&#x2F;powerful networks truly pseudonymously?",
      "time": 1641241030,
      "title": "Ask HN: Any way to use social media without sharing account with phone contacts?",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29786076,
      "score": 1,
      "time": 1641240885,
      "title": "Apple becomes first U.S. company to reach $3T market cap",
      "type": "story",
      "url": "https://www.cnbc.com/2022/01/03/apple-becomes-first-us-company-to-reach-3-trillion-market-cap.html"
    },
    {
      "by": "ceohockey60",
      "descendants": 0,
      "id": 29786042,
      "score": 1,
      "time": 1641240786,
      "title": "2022 Outlook: Rise of the “Rest”",
      "type": "story",
      "url": "https://interconnected.blog/2022-outlook-rise-of-the-rest/"
    },
    {
      "by": "davnicwil",
      "descendants": 1,
      "id": 29786007,
      "kids": [
        29786098
      ],
      "score": 4,
      "time": 1641240674,
      "title": "Tips for making writing more fun",
      "type": "story",
      "url": "https://davnicwil.com/tips-for-making-writing-more-fun/"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 29785970,
      "score": 2,
      "time": 1641240589,
      "title": "Ask HN: What is today's version of Scientific American's “Computer Recreations”?",
      "type": "story"
    },
    {
      "by": "ajmurmann",
      "descendants": 1,
      "id": 29785951,
      "kids": [
        29786099
      ],
      "score": 2,
      "text": "I am looking at building a relatively small desktop app. It would handle confident information that I don&#x27;t want to have to handle for other people and storing it on the web might in fact deter some potential users. That&#x27;s why I want to build it as a desktop app rather than a web app which would be where I have the stronger skill set.<p>The app should be lightweight, since it won&#x27;t do that much (think fancy note taking for a few specific use cases), but ideally it also would be cross-platform. An Electron app would give me the cross-platform, but it&#x27;s definitely not lightweight and might even feel sluggish. I know everyone here loves to hate Electron. Right now I am inclined to just write it in Swift and make it only support the Apple ecosystem where it also would fulfill all my personal needs, but miss out on lots of potential monetization (which realistically will never happen if I look at my past side projects). Another option would be Qt which I used to write 20 years ago, but it seems very expensive.<p>What other options would you look at for building a desktop app in 2022?",
      "time": 1641240530,
      "title": "Ask HN: Building a Desktop App in 2022",
      "type": "story"
    },
    {
      "by": "chat",
      "descendants": 0,
      "id": 29785947,
      "score": 2,
      "time": 1641240525,
      "title": "Best Films of 1931",
      "type": "story",
      "url": "http://www.davidbordwell.net/blog/2022/01/01/the-ten-best-films-of-1931/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29785910,
      "score": 2,
      "time": 1641240357,
      "title": "Jurors in the Elizabeth Holmes trial appear deadlocked on some charges",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/03/business/elizabeth-holmes-theranos-trial.html"
    },
    {
      "by": "snird",
      "descendants": 0,
      "id": 29785903,
      "score": 1,
      "time": 1641240344,
      "title": "Israel: Jerusalem Post site hacked by Iranians with threats of annihilation",
      "type": "story",
      "url": "https://www.dw.com/en/israel-jerusalem-post-site-hacked-on-anniversary-of-killing-of-top-iranian-general/a-60314043"
    }
  ]
}