{
  "stories": [
    {
      "by": "conanxin",
      "descendants": 0,
      "id": 30313304,
      "score": 1,
      "time": 1644678176,
      "title": "There were almost two internets. Then, the CIA destroyed one",
      "type": "story",
      "url": "https://pk.mashable.com/tech/15002/there-were-almost-two-internets-then-the-cia-destroyed-one"
    },
    {
      "by": "atylerrice",
      "descendants": 0,
      "id": 30313289,
      "score": 1,
      "text": "Between work, university, and a side business, I have a lot of priorities in my life currently. What do you do to stay focused and make sure all of your priorities get the attention they need?",
      "time": 1644678077,
      "title": "Ask HN: How do you stay focused with competing priorities?",
      "type": "story"
    },
    {
      "by": "openknot",
      "descendants": 0,
      "id": 30313280,
      "score": 1,
      "time": 1644677992,
      "title": "Special Inquiry into Counterfeit Items in Operating Nuclear Power Plants [pdf]",
      "type": "story",
      "url": "https://www.nrc.gov/docs/ML2204/ML22040A111.pdf"
    },
    {
      "by": "nh2",
      "descendants": 1,
      "id": 30313260,
      "kids": [
        30313293
      ],
      "score": 1,
      "time": 1644677855,
      "title": "Papercups (YC S20) open-source chat tool is now in Maintenance Mode",
      "type": "story",
      "url": "https://papercups.io/blog/papercups-maintenance"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30313246,
      "score": 2,
      "time": 1644677771,
      "title": "ThreadPoolExecutor in Python: The Complete Guide",
      "type": "story",
      "url": "https://superfastpython.com/threadpoolexecutor-in-python/"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30313239,
      "score": 1,
      "time": 1644677714,
      "title": "Real-Cugan: Real Cascade U-Nets for Anime Image Super Resolution",
      "type": "story",
      "url": "https://github.com/bilibili/ailab/blob/main/Real-CUGAN/README_EN.md"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30313228,
      "score": 1,
      "time": 1644677656,
      "title": "CutefishOS: A better Desktop OS Focus on simplicity, beauty and practicality",
      "type": "story",
      "url": "https://en.cutefishos.com"
    },
    {
      "by": "notyeast",
      "descendants": 0,
      "id": 30313225,
      "score": 1,
      "time": 1644677623,
      "title": "A developer-friendly explanation of centralized banking",
      "type": "story",
      "url": "https://engineering.gusto.com/how-ach-works-a-developer-perspective-part-1/"
    },
    {
      "by": "nerdyadventurer",
      "descendants": 0,
      "id": 30313215,
      "score": 1,
      "text": "I am a web developer, I am also suffering from OCD for years, was depressed for while after the initial diagnosis of OCD which was years ago. I take 60mg of Fluxetine daily and Quetiapine at night to help with sleep.<p>May be I also have ADHD, since sometime I get really excited about things and do things energetically, but sometime I get pretty down. I also prefer work on only things I care about or interested in. My mind get flooded with thoughts most of the time.<p>After finishing college I was working on projects, but I was not able to finish any of my projects. I sometime gather courage to work for a while but fall of the wagon after a week or so. In recent months I have not done anything useful keep procrastinating on things. Over the years my obsessive thoughts have evolved with the age, these days I mostly battle with ethical, legal obsessive thoughts, while I can control the response to these thoughts with meds. I seem to have complex obsessive thought which revolves around perfectionism, where I plan things and work for week then procrastinate, replan then work for while then procrastinate and so on. But last recent days I have lost the energy and have not done useful work, keep procrastinating.<p>Note : As the procrastinating I do household work, work in the garden, help family members and relations, check email Reddit, HN, watch TV where any of the things are not urgent. (I also seem to have addiction to information since I regularly check HN, Reddit, PH, RSS reader.)<p>My mother have Parkinson, her condition also deteriorating slowly. Father also have health issues. I am the eldest son of the family, my mother constantly worries about me and my brothers future. We recently showed my mother to psychiatrist where he said my mom is depressed, this probably due since she worries about me and my brother, since she have strong bond towards us due to past unfortunate events with my elder brothers. (My brother does not have any psychological disorder) Even with enough stress I keep procrastinating. I have to get this projects done and make my parents happy before it is too late.<p>So please any advice would be highly appreciated?<p>By the way I am from South Asian country where doctors (in my case psychiatrists) are expensive when you made a private booking, they just ask some questions give some meds and take the money without taking things seriously, sometimes does not even take ten minutes which was my experience. Even in the public hospital they pay less attention to me. There are good doctors who are caring but they are really rare which I had at the very beginning after my diagnosis of the OCD, when I was suffering from depression.",
      "time": 1644677543,
      "title": "Ask HN: Have OCD, suffering from extreme procrastination, please help?",
      "type": "story"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30313205,
      "score": 1,
      "time": 1644677479,
      "title": "Introducing Propshaft",
      "type": "story",
      "url": "https://world.hey.com/dhh/introducing-propshaft-ee60f4f6"
    }
  ]
}