{
  "stories": [
    {
      "by": "feross",
      "descendants": 0,
      "id": 28222365,
      "score": 1,
      "time": 1629299971,
      "title": "Spring cleaning MDN: Part 2",
      "type": "story",
      "url": "https://hacks.mozilla.org/2021/08/spring-cleaning-mdn-part-2/"
    },
    {
      "by": "sova",
      "descendants": 0,
      "id": 28222315,
      "score": 1,
      "time": 1629299851,
      "title": "Translating Harry Potter from Japanese to English",
      "type": "story",
      "url": "https://www.youtube.com/playlist?list=PL8YghW9gQcMlSGKHkaLATFbXHKPXYjSSb"
    },
    {
      "by": "mettamage",
      "descendants": 0,
      "id": 28222309,
      "score": 1,
      "text": "I&#x27;m prepping for a systems design interview and I can&#x27;t find how (micro)services know where the discovery server is. So how does it know?<p>I think I saw the following two things:<p>* Some configuration file contains the IP address of the discovery server (but what if the discovery server goes crashes? What if that particular IP isn&#x27;t reachable due to a network partition?)<p>* It&#x27;s actually part of the same codebase and the service discovery server exports a register and unregister function to whatever part of the code is a standalone service.",
      "time": 1629299833,
      "title": "Ask HN: Small question how does registration work in service discovery?",
      "type": "story"
    },
    {
      "by": "edbertdudon",
      "descendants": 1,
      "id": 28222262,
      "kids": [
        28222280
      ],
      "score": 1,
      "time": 1629299718,
      "title": "Show HN: A R notebook with a spreadsheet interface. Also, works with big data",
      "type": "story",
      "url": "https://app.sciepp.com/worksheet?id=xovt6ZCLRe&name=Ordinary+Least+Squares+run+2"
    },
    {
      "by": "rickyyean",
      "descendants": 0,
      "id": 28222242,
      "score": 2,
      "text": "We’re Ricky, David, and Minjeong and we built Flow Club: <a href=\"https:&#x2F;&#x2F;www.flow.club\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flow.club</a>. Flow Club is a virtual co-working space to help you focus. You work in hour-long sprints of up to 9 people led by a host and designed to get you into flow quickly. Here’s a video showing how it works: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=svl68znFgLc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=svl68znFgLc</a>.<p>A lot of innovation around work today focuses on helping employees collaborate while distributed. The problem? Either you can’t get any work done from the constant Slack pings, excessive emails and agenda-less Zoom meetings, or (if you unplug from all that) you’re isolated and without structure. Then it can get hard to figure out which tasks to work on or find motivation to start. The challenge is to craft a virtual environment that is conducive to doing deep work and at the same time feeling connected to other people. That’s what we’re trying to solve.<p>David and I got back together to do our third startup in 13 years. I’m a hard worker, but David takes it to another level. When we would get together in coffee shops, we’d start pomodoro timers to make sure we don’t talk forever instead of working. When the pandemic began, we made a virtual timer overlay for our Zoom meetings to do stretches of work together while WFH. It was effective, but we didn’t think about it as a startup because we were working on other, more social products. None of those got traction.<p>The hard part about building a social product, especially for “older” people (i.e. everybody but the super young), is that purely social value props no longer work. Our desire to meet people, self-express, etc., goes down as we get older and busier. So how to bring busy people together? That led us to think about working as part of a “club,” and we went back to our simple timer, which had solved a real problem for us, and developed the idea from there.<p>With Flow Club, you work in sprints in the style of a group workout class. Every session takes place in a small group setting led by a host. The first five and last five minutes of the hour are reserved to hear a bit about what each person is working on and to celebrate their progress. Over time, as you attend more sessions, you start to feel connected to the community of “co-workers”.<p>If you’ve tried remote co-working with friends and found it distracting, you could try bringing your friend to Flow Club instead. It’s harder to slack off &#x2F; goof around when there is structure, community norms, and a clear leader. We help you get started on big tasks like writing, coding, or creating, as well as keep you accountable for smaller tasks to unblock you for the first type of task. I’m writing this in a Flow Club right now because I read HN everyday and I am intimidated to post to HN. Tasks that scare you a little bit are great for Flow Club :)<p>Our members have launched their startups, finished their pitch decks, finished research papers, gotten to inbox zero, finally sent their investor updates. Others come at specific times, for example, to follow up right after a meeting, or to fight an after-lunch slump.<p>So please check out the demo video we made and let us know what you think! If you’ve tried your own Zoom coworking with friends, we’d love to hear how that went as well. We know that live video coworking isn’t for everyone—we actually initially thought it might just be for solo or new founders working on their own projects, but we’ve been very pleasantly surprised by who it has resonated with. We also keep hearing from community members who thought it sounded weird, but tried it, and now have been back to hundreds of sessions.<p>If this sounds like something you might like and benefit from, we created a special invite code for a limited number of Hacker News readers. We have a waitlist because session space is limited. This will also get you a special HN tag to find other HN members, and see a few HN-only sessions David is hosting: <a href=\"https:&#x2F;&#x2F;in.flow.club&#x2F;invite&#x2F;HNRunsOnArc07\" rel=\"nofollow\">https:&#x2F;&#x2F;in.flow.club&#x2F;invite&#x2F;HNRunsOnArc07</a>",
      "time": 1629299653,
      "title": "Launch HN: Flow Club (YC S21) – Virtual co-working space for focused work",
      "type": "story"
    },
    {
      "by": "hncurious",
      "descendants": 1,
      "id": 28222229,
      "kids": [
        28222367
      ],
      "score": 2,
      "time": 1629299635,
      "title": "Assange: “The goal is to use Afghanistan to wash money out” (2011)",
      "type": "story",
      "url": "https://twitter.com/wikileaks/status/1427929346262642688"
    },
    {
      "by": "jrepinc",
      "descendants": 0,
      "id": 28222228,
      "score": 1,
      "time": 1629299635,
      "title": "Mobilizon 1.3 Released",
      "type": "story",
      "url": "https://joinmobilizon.org/en/news/#21-08-17"
    },
    null,
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28222152,
      "score": 1,
      "time": 1629299433,
      "title": "Let's write a compiler, part 5: A code generator",
      "type": "story",
      "url": "https://briancallahan.net/blog/20210818.html"
    },
    {
      "by": "izzymiller",
      "descendants": 0,
      "id": 28222125,
      "score": 2,
      "time": 1629299359,
      "title": "Dataframe SQL: Python or SQL? Why Not Both?",
      "type": "story",
      "url": "https://hex.tech/blog/dataframe-sql"
    }
  ]
}