{
  "stories": [
    {
      "by": "helsinkiandrew",
      "descendants": 0,
      "id": 30269699,
      "score": 1,
      "time": 1644389102,
      "title": "Spinal implants allow paralysed people to walk, swim and cycle again",
      "type": "story",
      "url": "https://www.economist.com/science-and-technology/spinal-implants-allow-paralysed-people-to-walk-swim-and-cycle-again/21807596"
    },
    {
      "by": "matkoniecz",
      "descendants": 0,
      "id": 30269668,
      "score": 1,
      "text": "I just run into it yesterday and I was not really expecting it so I thought that it would share if anyone helps family or friends with their computer<p>- someone had horribly slow Windows (opening folder with photos has not completed after several minutes)\n- no typical signs of a malware or other infestation otherwise\n- OneDrive asking to be &quot;upgraded&quot; (which went straight to payment form)<p>Turns out that Windows was uploading local files to Microsoft servers (OneDrive). User was not aware about this, presumably it appeared in way similar how most people end with Microsoft account during installation.<p>In addition it turned that OneDrive deleted local files. User was definitely not aware about that.<p>So someone opening folder with photos - was downloading them from server. No idea who thought that it would be better than simply mirroring files. Opening folders was slow because user was waiting for download of GBs of data.<p>Attempts to change configuration were without any feedback or noticeable change. Linux would at give cryptic but searchable error.<p>Uninstalling OneDrive resulted in Windows stopping to pretend that local files are there.<p>At least message asking for OneDrive subscription, appearing every 30s, was also gone.<p>After that it was necessary to download files from OneDrive. Which failed in the middle of download twice and was rate limited to 250 KB&#x2F;s by Microsoft server. Which makes idea &quot;lets delete GBs of files locally and download them when user opens folder&quot; even worse.<p>I guess that the entire idea was invented to push OneDrive subscriptions (many people will simply pay as popup demanded) but who though that deleting local files is a good idea?<p>Also, it is not just one person who did something weird, it happened to multiple. So I guess that it is one more thing to be aware while helping with horribly slow Windows and one more dark pattern to look out for.<p>BTW, it is really sad that &quot;Linux PC becoming more usable than Windows PC&quot; is driven recently mostly by Windows becoming worse.<p>Also, that is how &quot;lets give family member external hard drive and help with backup making as a gift&quot; turned out to be 1h of investigation and several of waiting rather than 5 minutes of copying.",
      "time": 1644388765,
      "title": "Tell HN: Helping with a slow Win10? Maybe OneDrive deleted local files",
      "type": "story"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 30269648,
      "score": 1,
      "time": 1644388478,
      "title": "Red Cross says cyberattack was 'state-like' in nature",
      "type": "story",
      "url": "https://www.devex.com/news/exclusive-icrc-says-cyberattack-was-state-like-in-nature-102593"
    },
    {
      "by": "rapnie",
      "descendants": 0,
      "id": 30269641,
      "score": 1,
      "text": "I am sure there&#x27;s a philosophy to keeping the html &lt;head&gt; as minimal as possible. Keep it simple, right. Suggesting to consider adding a tiny bit more metadata.<p>Just shared Zoom&#x27;s newest privacy issue (with the microphone listening in when not in a meeting [0]). Not by HN&#x27;s fault but LinkedIn doesn&#x27;t use the &lt;title&gt; for some reason. I think it is using &lt;og:title&gt; and lacking that it parsed the title as <i>&quot;Sunspark 4 hours ago | root | parent | next [-]&quot;</i>. An OpenGraph title, description, and maybe an image is a nice to have.<p>[0] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30266894",
      "time": 1644388374,
      "title": "Tell HN: Use some minimal OpenGraph meta on HN",
      "type": "story"
    },
    {
      "by": "quaintdev",
      "descendants": 0,
      "id": 30269639,
      "score": 1,
      "time": 1644388337,
      "title": "Low Cost Server for Self Hosting at Home",
      "type": "story",
      "url": "https://www.ankshilp.com/posts/low_cost_server/"
    },
    {
      "by": "kooskoos",
      "descendants": 0,
      "id": 30269614,
      "score": 1,
      "time": 1644388043,
      "title": "What Does P3Y6M4DT12H30M5S Mean?",
      "type": "story",
      "url": "https://www.digi.com/resources/documentation/digidocs/90001437-13/reference/r_iso_8601_duration_format.htm"
    },
    {
      "by": "chris_overseas",
      "descendants": 0,
      "id": 30269610,
      "score": 1,
      "time": 1644387980,
      "title": "Elon Musk launched his own Tesla roadster to space 4 years ago. Where is it now?",
      "type": "story",
      "url": "https://www.cnn.com/2022/02/08/tech/spacex-tesla-roadster-falcon-heavy-anniversary-scn/index.html"
    },
    {
      "by": "rmarzooqur",
      "descendants": 1,
      "id": 30269603,
      "kids": [
        30269613
      ],
      "score": 1,
      "time": 1644387913,
      "title": "Visualising React Component Hierarchy",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30269577,
      "score": 1,
      "time": 1644387651,
      "title": "Ruby on Rails – Rails 7.0.2 has been released",
      "type": "story",
      "url": "https://rubyonrails.org/2022/2/8/Rails-7-0-2-has-been-released"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 30269569,
      "score": 1,
      "time": 1644387583,
      "title": "Ubuntu 22.04 May Offer a Choice of System Accent Colour",
      "type": "story",
      "url": "https://www.omgubuntu.co.uk/2022/02/ubuntu-22-04-accent-colors"
    }
  ]
}