{
  "stories": [
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 28236810,
      "score": 1,
      "time": 1629394536,
      "title": "Alabama Doctor watched patients reject Covid vaccine now refuses to treat them",
      "type": "story",
      "url": "https://www.washingtonpost.com/health/2021/08/18/alabama-doctor-unvaccinated-patients-valentine/"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 28236783,
      "score": 1,
      "time": 1629394404,
      "title": "Capitol Police Are Negotiating with Man Who Claims to Have Bomb Near the Capitol",
      "type": "story",
      "url": "https://www.npr.org/2021/08/19/1029275390/bomb-threat-near-capitol-library-of-congress"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 28236762,
      "score": 1,
      "time": 1629394315,
      "title": "Adam Curtis picks 10 films that capture the mood of their times",
      "type": "story",
      "url": "https://www.bfi.org.uk/sight-and-sound/lists/adam-curtis-10-films-capture-mood-times"
    },
    {
      "by": "jeremylevy",
      "descendants": 0,
      "id": 28236748,
      "score": 2,
      "time": 1629394253,
      "title": "AWS Announces General Availability of Amazon MemoryDB for Redis",
      "type": "story",
      "url": "https://www.businesswire.com/news/home/20210819005670/en/AWS-Announces-General-Availability-of-Amazon-MemoryDB-for-Redis"
    },
    {
      "by": "sydneyartt",
      "descendants": 2,
      "id": 28236747,
      "kids": [
        28236754,
        28236752
      ],
      "score": 1,
      "text": "Maxwell, a FinTech company flipping the mortgage industry on it&#x27;s head, is hiring for several Engineering roles, including a Data Engineering Lead and QA Engineering Lead. If you want to work for a company that is solving complex problems through tech, where you&#x27;ll truly have ownership in your role within a highly collaborative team, and be able to define your career path, then we&#x27;re the spot for you! Click the link to apply.",
      "time": 1629394251,
      "title": "Who Is Hiring",
      "type": "story"
    },
    {
      "by": "sdevonoes",
      "descendants": 0,
      "id": 28236744,
      "score": 1,
      "text": "I have been looking for a job (as a software engineer) in the last weeks and almost all the companies out there try to differentiate from others by highlighting their &quot;culture&quot; (some call them their &quot;principles&quot;, and others call it &quot;how we work&quot;). This is all fine, until you actually read what their &quot;culture&quot; is about. I&#x27;ll post a summary here of what I have found on the internet:<p>- &quot;We get shit done and move fast! Once you get used to our pace, you won&#x27;t want to go back! Sometimes we break things. No problem! We take ownership, fix things, and move on&quot;. How I read it: we care little about well-crafted software because we are in a rush; we want to push features live faster than our competitors.<p>- &quot;We are not the traditional 9 to 5. We own our products and if they break anytime we are there to help because we care about our customers&quot;. How I read it: goodbye work-life balance.<p>- &quot;Unlimited vacation&quot;. How I read it: you are taking away my N days of vacation given by law.<p>- &quot;We are all owners. You build it, you ship it, you maintain it&quot;. How I read it: you take extra responsibility (and need to know ton more of skills besides the regular ones) but we pay you the same, you get no bonus or anything if the company goes well. I want to work as a &quot;Senior Software Engineer&quot; not as a &quot;Senior Owner Software Engineer&quot;.<p>- &quot;We love hackathons!&quot;. How I read it: I will have to work on something I don&#x27;t really care about from Friday to Saturday twice a year, eating pizza for breakfast, lunch and dinner.<p>And much more similar stuff. These companies publish all of the above on their websites. They think they are cool because they offer free fruits and drinks and you can play videogames after working hours and they have cool pets, and they organize parties... I just really don&#x27;t get how all these minutiae can compete with the horrors listed above. I just want a normal job: I&#x27;ll do my best 9-5, I&#x27;ll be honest and bring good practices while sharping my skills as much as I can. Is my mentality outdated already? If so, man, this is so sad.",
      "time": 1629394244,
      "title": "Ask HN: The dark side of “cool” companies?",
      "type": "story"
    },
    {
      "by": "zengt",
      "descendants": 0,
      "id": 28236716,
      "score": 1,
      "text": "I have an on-going personal project to host an off-grid server from my van. I have a few Raspberry Pis that I&#x27;m going to use, and as it stands I&#x27;ve assembled two of them into a K3s cluster.<p>My reasoning behind using Kubernetes is that I want something that supervises the server and makes sure everything stays healthy, and I also want to stay familiar with modern technology. In addition, I&#x27;d like to make it as easy as possible to add more computing power to the setup and I&#x27;ve found K3s tools that seem to do a good job of that.<p>My main question is: Am I over-engineering this setup? If so, what should I be using instead? If not, are there any tips and tricks that people have to make the most of this kind of setup? I know I&#x27;m not the first person to set up a home server on RPis, but I imagine most people aren&#x27;t trying to take it off-grid for extended periods.",
      "time": 1629394075,
      "title": "Ask HN: What are the best tools for setting up a local RPi cluster?",
      "type": "story"
    },
    {
      "by": "deng",
      "descendants": 0,
      "id": 28236656,
      "score": 3,
      "time": 1629393784,
      "title": "“Foundation” TV Series – Official Trailer",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=X4QYV5GTz7c"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 28236652,
      "score": 1,
      "time": 1629393766,
      "title": "Ms. Categorized: Gender, notability, and inequality on Wikipedia",
      "type": "story",
      "url": "https://journals.sagepub.com/doi/10.1177/14614448211023772"
    },
    {
      "by": "norov",
      "descendants": 0,
      "id": 28236643,
      "score": 1,
      "time": 1629393734,
      "title": "U.S. Senate Democrats roll out draft bill to legalize weed",
      "type": "story",
      "url": "https://www.reuters.com/world/us/us-senate-democrats-release-discussion-draft-federally-legalize-cannabis-2021-07-14/"
    }
  ]
}