{
  "stories": [
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 29163540,
      "score": 1,
      "time": 1636473962,
      "title": "I Had Breakthrough Covid. It Was a Logistical Nightmare",
      "type": "story",
      "url": "https://www.theatlantic.com/health/archive/2021/11/the-worlds-only-normal-until-you-test-positive/620653/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29163494,
      "score": 2,
      "time": 1636473769,
      "title": "BZx crypto heist results in reported losses of more than $55M",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/bzx-crypto-heist-results-in-reported-losses-of-more-than-55-million"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29163493,
      "score": 1,
      "time": 1636473763,
      "title": "Holiday season kicks off at Apple",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2021/11/holiday-season-kicks-off-at-apple/"
    },
    {
      "by": "ipeefreely",
      "descendants": 0,
      "id": 29163484,
      "score": 1,
      "time": 1636473742,
      "title": "Too little social interaction leads to bad health. Too much also does, though",
      "type": "story",
      "url": "https://www.psychologytoday.com/us/blog/finding-new-home/202110/can-too-much-socializing-actually-be-bad-you"
    },
    {
      "by": "marslan2000",
      "descendants": 0,
      "id": 29163466,
      "score": 3,
      "text": "Hi HN,<p>We are the team at Metaphor Data, backed by a16z &amp; Amplified Partner. Today we are excited to announce the launch of our product Metaphor, a modern metadata platform that serves as a system of record for your organization&#x27;s data ecosystem.<p>Metaphor provides full visibility into your data landscape and empowers both data producers and consumers to work more effectively and efficiently. For producers, Metaphor enables quick and accurate impact analysis as well as offers critical insights like data consumption patterns and resource utilization. For consumers, it brings technical metadata and business context together to inform decisions about how and when to use data products. To facilitate adoption, Metaphor seamlessly embeds these interactions directly in people&#x27;s existing tools and workflows, such as Slack, Looker, and Notebooks, in addition to an easy-to-use web application.<p>Metaphor has its root in DataHub, the leading open-source metadata platform project created by our team while working at LinkedIn. It shares the same architecture that has been battle-tested for the complexity and scale of industry leaders, such as LinkedIn, Expedia, Klarna, Peloton, DFDS, Saxo Bank, and Grofers. DataHub powered many metadata-related use cases at LinkedIn, including data discovery, GDPR&#x2F;CCPA compliance, data integration, governance, and ML DevOps. After experiencing how DataHub supercharged the data democratization at LinkedIn, we decided to create Metaphor so that every company to realize the full potential of data through effective metadata management.<p>The Modern Data Stack has helped democratize data across the company but also led to organic growth and fragmentation. This makes something as basic as finding the right data become increasingly more difficult—many data scientists &amp; analysts spend as much as 30% of their time searching for a needle in the proverbial data haystack. Typical data catalogs fail to solve the data discovery and understandability problems as they rely solely on technical metadata. Metaphor took a different approach by combining three types of metadata:<p>1. Technical metadata (&quot;What is it?&quot;): All metadata sourced from the data systems, including schemas, lineage, SQL&#x2F;code, description, data profile, data quality, etc.\n2. Business metadata (&quot;What do users call it?&quot;): The mapping between physical data and business use cases governed at the company, organization, or team level.\n3. Behavioral metadata (&quot;Who, where and how is it being used?&quot;):  Linking data assets to the users who create, use, and depend on them, as well as the actual usage behavior.<p>With this, Metaphor bridges the gap between the technical and business worlds and helps organizations to realize true data democratization on the Modern Data Stack.<p>We have also written a blog post with more details and product screenshots here: https:&#x2F;&#x2F;metaphor.io&#x2F;blog&#x2F;metaphor-product-launch. You can check out a brief product demo video (5 mins): https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=MKPDjGwE0Ac<p>We&#x27;d love the hear about your experience and challenges with this data discovery &amp; metadata management space and any feedback&#x2F;questions you have about what we are building.",
      "time": 1636473664,
      "title": "Metaphor: The Modern Metadata Platform",
      "type": "story"
    },
    {
      "by": "podiki",
      "descendants": 0,
      "id": 29163465,
      "score": 2,
      "time": 1636473653,
      "title": "From ‘guix environment’ to ‘guix shell’",
      "type": "story",
      "url": "https://guix.gnu.org/en/blog/2021/from-guix-environment-to-guix-shell/"
    },
    {
      "by": "ajdude",
      "descendants": 0,
      "id": 29163463,
      "score": 1,
      "time": 1636473641,
      "title": "Discord Nitro users cancel en masse as CEO teases Ethereum and NFT integration",
      "type": "story",
      "url": "https://www.notebookcheck.net/Discord-Nitro-users-start-canceling-subscriptions-en-masse-as-CEO-teases-Ethereum-and-NFT-integration.577971.0.html"
    },
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 29163457,
      "score": 2,
      "time": 1636473616,
      "title": "Bottlerocket - An open source Linux-based operating system -  a Year in the Life",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/containers/bottlerocket-a-year-in-the-life/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 29163448,
      "score": 1,
      "time": 1636473592,
      "title": "L-Arginine potentiates radiation therapy for cancer",
      "type": "story",
      "url": "https://news.cornell.edu/stories/2021/11/oral-drug-enhances-radiation-therapy-cancer"
    },
    {
      "by": "ur-whale",
      "descendants": 0,
      "id": 29163447,
      "score": 1,
      "time": 1636473589,
      "title": "Discord community splits as CEO unveils ethereum integration",
      "type": "story",
      "url": "https://cointelegraph.com/news/discord-community-splits-as-ceo-unveils-pre-released-ethereum-integration"
    }
  ]
}