{
  "stories": [
    {
      "by": "thesecretceo",
      "descendants": 0,
      "id": 32019989,
      "score": 1,
      "time": 1657230792,
      "title": "Videogame sales set to fall 4 first time in years as industry braces 4 recession",
      "type": "story",
      "url": "https://www.cnbc.com/2022/07/07/video-game-industry-not-recession-proof-sales-set-to-fall-in-2022.html"
    },
    {
      "by": "cheinyeanlim",
      "descendants": 0,
      "id": 32019935,
      "score": 1,
      "time": 1657230526,
      "title": "Meta’s Going After a Universal Translator. Its AI Now Works for 200 Languages",
      "type": "story",
      "url": "https://singularityhub.com/2022/07/07/metas-going-after-a-universal-translator-its-ai-now-works-for-200-languages/"
    },
    {
      "by": "diversion",
      "descendants": 0,
      "id": 32019923,
      "score": 2,
      "time": 1657230453,
      "title": "GitHub Copilot and Open Source: A Love Story That Won’t End Well?",
      "type": "story",
      "url": "https://thenewstack.io/github-copilot-and-open-source-a-love-story-that-wont-end-well/"
    },
    {
      "by": "canthrowaway",
      "descendants": 0,
      "id": 32019914,
      "score": 2,
      "text": "Hi HN, obviously posting from a throwaway account. In the recent past, I struggled with depression, due to burnout at work + loneliness. I started getting better with therapy, but I hit another low when once I started recovering, tried to date people, and failed catastrophically at attracting women.<p>After a couple of relapses, today I can say that I feel way better than before. I have a decent work-life balance, I don&#x27;t get stressed, I don&#x27;t have anxiety, I don&#x27;t have social anxiety, I do exercise, I basically don&#x27;t care much about stuff. I&#x27;m really stable mentally, which to me is a big accomplishment, and have been consistently feeling like this for some months.<p>I&#x27;m usually alone (live alone and work on my own stuff, basically), but from time to time I meet 1 person for lunch (e.g., a colleague from work). I do this, say, once a week or so.<p>So, now I feel like I have a decent quality of life and good mental stability, a big accomplishment, but at the same time, it&#x27;s true that I&#x27;m suppressing my instinct of trying to date people. I&#x27;m purposely avoiding any dating situation, because I know that with very, very high probability, the answer is going to be no, and this might affect my beloved mental stability. While it&#x27;s tempting to think: &quot;it&#x27;s a numbers game, it shouldn&#x27;t affect you, you should try it&quot;, in one of the depression relapses I mentioned, what happened was precisely that I got lots of rejections in a row; enough rejections so that I don&#x27;t take rejections personally anymore; a single rejection doesn&#x27;t affect me, but what does affect me is having virtually always the same result: a rejection.<p>So, HNers who have been a similar situation, what would you do? Would you stick in my local minimum, or would you try to leave it by going back to the dating game? If so, any strategies for getting another relapse?",
      "time": 1657230411,
      "title": "Ask HN: Should I leave my socio-sentimental local minimum?",
      "type": "story"
    },
    {
      "by": "altrus",
      "descendants": 0,
      "id": 32019906,
      "score": 2,
      "time": 1657230359,
      "title": "Bamboo Scaffolding in Hong Kong",
      "type": "story",
      "url": "https://multimedia.scmp.com/infographics/culture/article/3183200/bamboo-scaffolding/index.html"
    },
    {
      "by": "goplayoutside",
      "descendants": 0,
      "id": 32019884,
      "score": 1,
      "time": 1657230268,
      "title": "When “One Size Fits All” Fails: PostGIS Bounding Boxes for Maps",
      "type": "story",
      "url": "https://felt.com/blog/postgis-bounding-boxes-for-maps"
    },
    {
      "by": "dmcy22",
      "descendants": 0,
      "id": 32019868,
      "score": 3,
      "time": 1657230189,
      "title": "A data leak exposes China’s vast surveillance state",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/07/china-leak-police-database/"
    },
    {
      "by": "mikkergp",
      "descendants": 0,
      "id": 32019848,
      "score": 1,
      "text": "I&#x27;ve worked on both sides of the vendor relationship, and thought I&#x27;m always curious about how outages happen, I&#x27;ve rarely had a quantifiable reason for it.  If you&#x27;re in the habit of requesting RCA&#x27;s from vendors.  Why?  Have you gotten a tangible benefit from it?",
      "time": 1657230064,
      "title": "Ask HN: Why do you request an RCA?",
      "type": "story"
    },
    {
      "by": "polleyoo",
      "descendants": 0,
      "id": 32019840,
      "score": 1,
      "text": "I am currently enrolled in a summer session with San Diego State University.  As part of the Information Systems Analysis class, I’ve been assigned a group project to evaluate a specific technology.<p>The group have decided to use the subject of Platform as a Service (PaaS). Our setup is that we are hypothetical web startup, and we need to decide on which provider to go with (or manage ourselves through IaaS).<p>We are looking for professionals who have had to make this decision (or in the process of making this decision). Additionally, we need individuals who have expertise in this area.<p>Our team will develop some questions and conduct a short interview on this topic.<p>If this sounds like you, and your willing to help, please leave contact details or reach out via the email in my HN profile.<p>Thank you!",
      "time": 1657230029,
      "title": "Ask HN: Looking for PaaS professionals to be interviewed for summer project",
      "type": "story"
    },
    {
      "by": "sacrosanct",
      "descendants": 0,
      "id": 32019801,
      "score": 1,
      "time": 1657229850,
      "title": "Met Police UK Live Facial Recognition",
      "type": "story",
      "url": "https://www.met.police.uk/advice/advice-and-information/fr/facial-recognition"
    }
  ]
}