{
  "stories": [
    {
      "by": "nhirschfeld",
      "descendants": 0,
      "id": 29793725,
      "score": 1,
      "text": "Hi there,<p>I&#x27;d like to introduce you to Starlite - a new python ASGI API framework built on top of pydantic and Starlette.<p>You can find the repo for the framework here: https:&#x2F;&#x2F;github.com&#x2F;Goldziher&#x2F;starlite<p>The documentation here: https:&#x2F;&#x2F;goldziher.github.io&#x2F;starlite&#x2F;<p>I wrote an article introducing it, which you can read here: https:&#x2F;&#x2F;itnext.io&#x2F;introducing-starlite-3928adaa19ae<p>This article gives an overview of the framework and explains &quot;why create a new framework?&quot; using the same ingredients as FastAPI, and also the relation to FastAPI with some criticisms.<p>I&#x27;d be happy to discuss and answer any questions you might have.",
      "time": 1641296083,
      "title": "Show HN: Starlite, the little ASGI framework that can",
      "type": "story"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29793723,
      "score": 1,
      "time": 1641296055,
      "title": "Things I Learned in 2021",
      "type": "story",
      "url": "https://kottke.org/22/01/52-things-i-learned-in-2021-1"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29793695,
      "score": 1,
      "time": 1641295771,
      "title": "Africa’s ‘Great Green Wall’ could have far-reaching climate effects",
      "type": "story",
      "url": "https://www.sciencenews.org/article/africa-great-green-wall-trees-sahel-climate-change"
    },
    {
      "by": "8bitsrule",
      "descendants": 0,
      "id": 29793687,
      "score": 1,
      "time": 1641295704,
      "title": "Spotting Surveillance in Your Hotel Room",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Hthi588gl2c"
    },
    {
      "by": "ptgtemporal",
      "descendants": 0,
      "id": 29793674,
      "score": 2,
      "time": 1641295604,
      "title": "Show HN: RexMex – A Recommender Systems Evaluation Metrics Library",
      "type": "story",
      "url": "https://github.com/AstraZeneca/rexmex"
    },
    {
      "by": "BoumTAC",
      "descendants": 0,
      "id": 29793673,
      "score": 1,
      "text": "I&#x27;ve been a developer for 7 years. I&#x27;m just a random web developer doing random application for random companies.<p>But I have a recurrent powerlessness feeling every time I code. I often get blocked on issue that are not made by me.<p>The last few years I was a front end developer and as you know everything is complicated in the javascript world and everything always change. For example it was recurrent to have issue with webpack or the ES6 compiler. It was the kind of hard issue, the manager doesn&#x27;t care and doesn&#x27;t understand, he just wants the new form to work but here I am, just another day and nothing work for no reason because of external issue (webpack here for the example).<p>The problem is this, I don&#x27;t know how to resolve the issue, (and only a few people on earth know because webpack is so hard to understand), and I don&#x27;t have the skill to resolve the issue which is not mine.<p>Yes I know I can report an issue, try to fix it, debug all the application and maybe with a lot of chance I will be able to resolve the issue. But the manager don&#x27;t want me te take a few days on something he doesn&#x27;t understand and which it isn&#x27;t my fault. What am I supposed to do ? I feel powerless. How do you resolve this kind of issue ? It&#x27;s a difficult state of mind and it get a lot of stress from it.<p>For the last few months I&#x27;ve been learning back Django which was my first love. I&#x27;m learning back the django rest framework and today I have an issue where in the DRF interface the button for POST&#x2F;DELETE&#x2F;PUT&#x2F;PATCH don&#x27;t work. They don&#x27;t even send the POST&#x2F;DELETE&#x2F;PUT&#x2F;PATCH request, they just reload the page as if the only thing those button do where `window.location.reload();`.<p>What am I suppose to do with issue like this ? I&#x27;ve found a 7 months old stackoverflow issue with no answer, and it&#x27;s such a basic feature. Nobody use the DRF framework nowadays ?<p>What am I suppose to do? Debug it ? I don&#x27;t event know where to start from. Develop a better alternative than DRF ? I don&#x27;t have the skills. Post an issue on github ? I will get an answer like &quot;we don&#x27;t have an issue here maybe check your code you should have miss something&quot;. But I don&#x27;t know where to search because the interface is made by DRF and not by me. The browser don&#x27;t even send a request, and the server receive just a get request to reload the page.<p>I feel so powerless and it&#x27;s always like this. It&#x27;s not as if I was missing something I mismanage in my model, it&#x27;s the library I use that doesn&#x27;t work. What am I gonna say when I will be looking for jobs ? Sorry it doesn&#x27;t work for no reason so I couldn&#x27;t improve my skill so I&#x27;m a shitty developer.<p>This is not a post about shaming famous project (like here Webpack and DRF for the example), those are incredible project that change the life of millions of people. I would have never been able to do 10% of those. I just often get stuck in those kind of things. I find no answer on the internet and I don&#x27;t know what to do next. Pay a freelancer to help me debug the application ? What am I suppose to say to a manager or recruiter ? How do you manage the stress of the powerlessness feeling I have. Am I the only one to feeling like this ?",
      "time": 1641295578,
      "title": "Ask HN: How do you deal with the powerlessness feeling of coding?",
      "type": "story"
    },
    {
      "by": "rasz",
      "descendants": 0,
      "id": 29793668,
      "score": 1,
      "time": 1641295529,
      "title": "Konix Multisystem – This Console Would Have Changed Gaming Forever",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=kLyHQpdnjpA"
    },
    {
      "by": "GordonS",
      "descendants": 0,
      "id": 29793622,
      "score": 1,
      "time": 1641295104,
      "title": "Green Hydrogen: Drop in Bucket or Big Splash?",
      "type": "story",
      "url": "https://cleantechnica.com/2022/01/02/its-a-green-hydrogen-drop-in-the-bucket-but-it-could-still-make-a-splash/"
    },
    {
      "by": "slyyls84",
      "descendants": 0,
      "id": 29793608,
      "score": 1,
      "time": 1641294940,
      "title": "Show HN: Ninja Designer – An All-in-One Tool for Freelance Designers",
      "type": "story",
      "url": "https://ninjadesigner.io/"
    },
    {
      "by": "piccogabriele",
      "descendants": 0,
      "id": 29793588,
      "score": 1,
      "time": 1641294674,
      "title": "Show HN: Simple reader of the top voted articles of news and worldnews subreddit",
      "type": "story",
      "url": "https://www.redditnews.io/"
    }
  ]
}