{
  "stories": [
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 30724129,
      "score": 1,
      "time": 1647620309,
      "title": "Volkswagen recalling 23,192 SUVs in Canada for possible 'unexpected braking'",
      "type": "story",
      "url": "https://www.cbc.ca/news/business/volkswagen-recall-1.6389466"
    },
    {
      "by": "rdpintqogeogsaa",
      "descendants": 0,
      "id": 30724128,
      "score": 1,
      "time": 1647620306,
      "title": "Base64 Malleability in Practice",
      "type": "story",
      "url": "https://eprint.iacr.org/2022/361"
    },
    {
      "by": "electricdriver",
      "descendants": 0,
      "id": 30724127,
      "score": 1,
      "text": "Hi HN! We are looking for feedback on the Electric Driver, a site that helps car shoppers easily more objectively find the right electric car that more closely matches their unique needs.<p>Having gone through the process of researching and buying an electric vehicle and helping others we learned that car research sites do not meet the needs of electric vehicle consumers.<p>Specifically, we developed a new process for researching electric vehicles that more closely aligns with how consumers evaluate and make purchase decisions.<p>Needs-Based Search: The auto industry today uses a year, make and model or search by body style to search for vehicles. The problem with this method of search is if a person does not know what specific vehicle, they want they are forced to wade through most vehicles looking for the ones that meet their criteria. We developed a new method of search that asks the shopper what criteria (Eg. I want a safe, reliable, fuel-efficient 5-seater under $35K that can go 200 miles on a single charge) is important to them to electric vehicles that best meet their needs.<p>Comparison Based Shopping: We developed a new method of comparison shop based on the three strongest candidates based on your needs. Based on what criteria you told us was important to you we compare and show the trade-offs between each electric vehicle and highlight the vehicle that most closely matches your needs. We believe people by natural use comparisons.<p>Personalized Electric Vehicle Information: based on your location and other criteria we show you what it costs to drive a mile in a specific electric vehicle versus gas in your area. We show the consumer expected maintenance and insurance costs look like versus gas and we also show you want compatible chargers are available in your area. We also explain the environmental impact of switching from gas to electricity. Based on your location your electricity may be generated from Coal, natural gas, nuclear, hydro, or renewables. We show what your state power mix looks like can calculate the estimated carbon emission from buying from the utility.<p>Our goal is to educate and help car shoppers find the right electric vehicle that fits their needs.\nThis project has been bootstrapped.<p>We are looking for feedback beyond our friends and family and the limited group of people we have been testing with. As you go through the site was questions you have did we not address, what could we do better, and anything else you want to share.",
      "time": 1647620289,
      "title": "Show HN: Find and Research the Right Electric Car Based on Your Specific Needs",
      "type": "story",
      "url": "https://electricdriver.co"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30724112,
      "score": 3,
      "time": 1647620222,
      "title": "The Roman Dictatorship: How Did It Work? Did It Work?",
      "type": "story",
      "url": "https://acoup.blog/2022/03/18/collections-the-roman-dictatorship-how-did-it-work-did-it-work/"
    },
    {
      "by": "sunjester",
      "descendants": 0,
      "id": 30724105,
      "score": 1,
      "time": 1647620207,
      "title": "Hackers, Arnold Schwarzenegger and the U.S. Pierce Digital Iron Curtain",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/18/politics/information-campaign-ukraine-russia-schwarzenegger/index.html"
    },
    {
      "by": "nicolas_lorenzi",
      "descendants": 0,
      "id": 30724068,
      "score": 1,
      "time": 1647619991,
      "title": "Why is the development of Robotics in the world so slow?",
      "type": "story",
      "url": "https://www.luos.io/blog/how-to-make-embedded-systems-skyrocket"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 30724055,
      "score": 1,
      "time": 1647619938,
      "title": "Machine Learning Reimagines the Building Blocks of Computing",
      "type": "story",
      "url": "https://www.quantamagazine.org/machine-learning-reimagines-the-building-blocks-of-computing-20220315/"
    },
    {
      "by": "algo_trader",
      "descendants": 0,
      "id": 30724045,
      "score": 1,
      "time": 1647619924,
      "title": "Buyer of NFT sues creator for issuing identical NFTs",
      "type": "story",
      "url": "https://old.reddit.com/r/CryptoCurrency/comments/tgmkbf/buyer_of_pepe_the_frog_nft_files_us500000_lawsuit/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30724013,
      "score": 1,
      "time": 1647619804,
      "title": "Asahi Linux integrates with the native multi-boot support on Apple Silicon Macs",
      "type": "story",
      "url": "https://twitter.com/AsahiLinux/status/1504777954303549442"
    },
    {
      "by": "hendy1996",
      "descendants": 0,
      "id": 30724003,
      "score": 1,
      "time": 1647619758,
      "title": "Website that organise automatically your images by similarity",
      "type": "story",
      "url": "https://www.sortedimage.com/"
    }
  ]
}