{
  "stories": [
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31458297,
      "score": 1,
      "time": 1653143960,
      "title": "State of ex situ conservation of landrace groups of 25 major crops",
      "type": "story",
      "url": "https://www.nature.com/articles/s41477-022-01144-8"
    },
    {
      "by": "notacat",
      "descendants": 0,
      "id": 31458284,
      "score": 1,
      "text": "3 years ago, I started an algotrading project with the goal of funding fundamental AI research. This has gone really well, we are now trading 0.5-3% of the overall crypto market and our AUM has grown to 9 digits, and we have a team of 7 people.\nThe short term goal is to relocate our activity (which is currently in France) and have the trading operate independent of myself by hiring and transferring knowledge, so that I can focus on growing the AI research team.\nI initially wanted to relocate to the US because it has the best AI research community, but because it&#x27;s so hostile to trading crypto derivatives (which is a large part of what we do), we decided to stay in Europe. The two places we are considering are London or Zug&#x2F;Zurich.<p>I actually prefer London as the AI&#x2F;ML community is bigger. Kings Cross feels like a proper &quot;tech hub&quot; with Google and Deepmind there. English is the main language, and people are welcoming and risk-taking.\nZug&#x2F;Zurich has better taxes and lifestyle (lake, mountains, food, air quality), but people are more standoffish and it&#x27;s harder to make friends.<p>What is really complicating this decision is that I have a weird headache issue : in some places (I did live in Budapest for a while as well as London), I have a low-to-medium-intensity permanent headache. I did keep a daily log and the pattern is really clear. Whenever I am in Budapest or London, the headache shows up after 2 days of being there. Whenever I move elsewhere, it goes away after 1 to 2 weeks. I did have it at other times, especially when travelling but not as intensely. I did have it when travelling to Zug for the first time, but it went away. In Budapest it never went away after 5 months of being there. In London, I don&#x27;t know as I never stayed for longer than 10 days.\nI did consult with GPs but the cause is unclear. One doctor said it&#x27;s maybe a tension-type headache. I did try to do sport, sleep better, eat better. But location seems to be the highest correlation and I&#x27;m still very unsure of the cause.<p>I am the majority shareholder and founder of the trading&#x2F;research operation, so I have the final word about where to go. What I am wondering is wether that headache issue is bad enough to tip the scale in favor of Zug. Form a business perspective, London is better. But I just don&#x27;t feel good there. The state of uncertainty that has lasted since 5 months now is hard to bear for the team, so I don&#x27;t want to take too long to make that decision.<p>Any tips about how to navigate this choice?",
      "time": 1653143831,
      "title": "Ask HN: Where to relocate our trading and research group of 7 people",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31458279,
      "score": 1,
      "time": 1653143819,
      "title": "What Does the Met’s New Online Collection Mean for Art Students? (2014)",
      "type": "story",
      "url": "https://medium.com/@wendymac/what-does-the-mets-new-online-collection-mean-for-art-students-5d957b09aaf8"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31458277,
      "score": 1,
      "time": 1653143810,
      "title": "What Everybody Gets Wrong About Jekyll and Hyde (2012)",
      "type": "story",
      "url": "https://www.tor.com/2012/06/22/what-everybody-gets-wrong-about-jekyll-and-hyde/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31458267,
      "score": 1,
      "time": 1653143739,
      "title": "How to Improve Employee Retention During the Great Resignation",
      "type": "story",
      "url": "https://codingsans.com/blog/how-to-improve-employee-retention"
    },
    {
      "by": "tintinnabula",
      "descendants": 0,
      "id": 31458263,
      "score": 1,
      "time": 1653143681,
      "title": "Trüth, Beaüty, and Volapük (2012)",
      "type": "story",
      "url": "https://publicdomainreview.org/essay/truth-beauty-and-volapuk/"
    },
    {
      "by": "asyncscrum",
      "descendants": 0,
      "id": 31458254,
      "score": 2,
      "time": 1653143589,
      "title": "Websites get cool with Ajax or die (2006)",
      "type": "story",
      "url": "https://phys.org/news/2006-06-web-sites-cool-ajax-die.html"
    },
    {
      "by": "soapdog",
      "descendants": 0,
      "id": 31458237,
      "score": 1,
      "time": 1653143462,
      "title": "On rants about laptops for developers",
      "type": "story",
      "url": "https://andregarzia.com/2022/05/On-rants-about-laptops-for-developers.html"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 31458218,
      "score": 1,
      "time": 1653143308,
      "title": "The Apple Services Experience Is Not Good Enough",
      "type": "story",
      "url": "https://bzamayo.com/need-better-services"
    },
    {
      "by": "partygirl",
      "descendants": 0,
      "id": 31458216,
      "score": 1,
      "time": 1653143293,
      "title": "On the Spectrum, on the Guest List: Tao Downtown",
      "type": "story",
      "url": "https://onthespectrumontheguestlist.substack.com/p/tao-downtown"
    }
  ]
}