{
  "stories": [
    {
      "by": "efficientsticks",
      "descendants": 0,
      "id": 31274344,
      "score": 1,
      "text": "Hi HN,<p>I’ve been developing my own take on a web search engine for about six months.<p>I’ve crawled just a few pages each from about 10 million websites each at the moment, but only the most lightweight websites are included as of this moment.<p>I’m keen to hear what you make of this, and what you want to see next.<p>Cheers,\nAli",
      "time": 1651763353,
      "title": "Show HN: High Browse, esoteric web search (alpha quality)",
      "type": "story",
      "url": "https://highbrow.se/"
    },
    {
      "by": "galoisscobi",
      "descendants": 0,
      "id": 31274330,
      "score": 1,
      "time": 1651763278,
      "title": "Signals That Drive Us",
      "type": "story",
      "url": "https://37signals.com/00"
    },
    {
      "by": "_bramses",
      "descendants": 0,
      "id": 31274331,
      "score": 1,
      "time": 1651763278,
      "title": "Hey DALL-E, Finish the Cat Drawing",
      "type": "story",
      "url": "https://www.bramadams.dev/projects/finish-the-cat-picture"
    },
    {
      "by": "sph",
      "descendants": 0,
      "id": 31274315,
      "score": 1,
      "time": 1651763183,
      "title": "We're breaking up with JavaScript front ends (2016)",
      "type": "story",
      "url": "http://triskweline.de/unpoly-rugb/#/"
    },
    {
      "by": "hWZhfIxSiA",
      "descendants": 0,
      "id": 31274308,
      "score": 1,
      "time": 1651763142,
      "title": "My brother is learning JavaScript and made this game (desktop only)",
      "type": "story",
      "url": "http://digitle.io/"
    },
    {
      "by": "blockwriter",
      "descendants": 0,
      "id": 31274299,
      "score": 1,
      "text": "I started coding about two years ago because I planned to open a coffeeshop and bookstore and wanted to think about management from first principles by coding a management system. I then started coding a web application to augment the process of reading, writing, publishing and distributing literature, which is my primary occupation. Both projects have come together nicely. I find that they are both truly useful, and I am starting to consider them largely complete. I am endeavoring to hire my first full stack developer to take over and improve upon these two projects, but I feel at a loss in the meantime about what to code next.<p>Does anyone have a suggestion? I want to code for roughly one hour a day going forward. I enjoy having projects feed into one another meaningfully. For example: I have set up a system to automatically get the metadata of a comic book, automatically price it, image the book, and list the book, so that all that is required of me is to scan the barcode. With this, and offering comics for sale at the coffeeshop, I should be able to acquire collections fairly readily from patrons. The finances of the various operations are all logged in a manner that allows for comprehensive reports to be made of them individually and in concert. My initial thought is to make work on robust graphing functionality so that I am presented with an overview of various metrics related to these project when I wake up in the morning. I can use pyplot, but not expertly. My other thought is to develop some kind of game that is part and parcel with being a regular at a coffeeshop. Below is a brief, non-exhaustive overview of the languages, the services, and the like that I have used so far.<p>-Python\n-Flask\n-Javascript\n-HTML\n-AWS EC2\n-AWS RDS\n-AWS S3\n-MySQL\n-Stripe\n-Web-scraping\n-Raspberry Pi<p>P.S. Are there any full-stack developers in Chicago, Illinois, or nearby states looking for a job?",
      "time": 1651763110,
      "title": "Ask HN: What do I code next?",
      "type": "story"
    },
    {
      "by": "WA9ACE",
      "descendants": 0,
      "id": 31274296,
      "score": 1,
      "time": 1651763103,
      "title": "PBS Lite",
      "type": "story",
      "url": "https://lite.pbs.org"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31274271,
      "score": 1,
      "time": 1651762978,
      "title": "Apple, Google, and Microsoft commit to expanded support for FIDO standard",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2022/05/apple-google-and-microsoft-commit-to-expanded-support-for-fido-standard/"
    },
    {
      "by": "WHA8m",
      "descendants": 0,
      "id": 31274262,
      "score": 1,
      "text": "What is your experience with one or the other approach of therapy? Thoughts, observations, information, anecdotes?<p>---<p>In Germany, therapists are differentiated between &#x27;depth psychotherapy&#x27; and &#x27;behavior therapy&#x27; (there are more, but those are the most common ones). I don&#x27;t know if that&#x27;s a distinction made everywhere in the world, but here you go. If you wonder what the difference is - in my own words and simple terms:<p>depth psychotherapy: more of an analytical approach to find the underlying root cause and take care of it (bottom to top)<p>behavior therapy: improve your life by fighting the symptoms and let your restored mental health sink in and resolve the cause (top to bottom)<p>---<p>Disclaimer: I&#x27;m not asking about the &#x27;better&#x27; way of doing therapy. The best way is the one that works for YOU. The decision about one of those approaches might not even be the critical point to make therapy work for you. Stay safe!",
      "time": 1651762949,
      "title": "Ask HN: Depth Psychotherapy and Behavior Therapy",
      "type": "story"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 31274201,
      "score": 2,
      "time": 1651762689,
      "title": "Elon Musk’s antidepressant tweet puts people at risk",
      "type": "story",
      "url": "https://www.washingtonpost.com/wellness/2022/05/04/wellbutrin-elon-musk-antidepressant/"
    }
  ]
}