{
  "stories": [
    {
      "by": "psikomanjak",
      "descendants": 0,
      "id": 28207675,
      "score": 3,
      "time": 1629190698,
      "title": "Loaded in 600 Milliseconds",
      "type": "story",
      "url": "https://treblle.com/blog/loaded-in-600-milliseconds"
    },
    {
      "by": "BnRJ401E29F8Q3v",
      "descendants": 0,
      "id": 28207668,
      "score": 1,
      "time": 1629190596,
      "title": "Elastic amends Elasticsearch: now won't work with forks then blocks comments",
      "type": "story",
      "url": "https://www.theregister.com/2021/08/09/elasticsearch_python_client_change/"
    },
    {
      "by": "somebee",
      "descendants": 0,
      "id": 28207662,
      "score": 1,
      "text": "Hey all<p>My name is Sindre, and I am the CTO of Scrimba (YC S21). For the last 7 years, I have written all my web apps in a full-stack programming language called Imba. It compiles to JavaScript and its main goal is to make web developers more productive.<p>I just launched a major overhaul of Imba, so I wanted to share it here on HN, in case anyone are interested in learning more about it. It is very opinionated, so some of you might not like it, but I would love to hear anyones feedback regardless. Constructive criticism appreciated!<p>The backstory\nImba initially started in 2012 as an effort to bring the elegance and conciseness of Ruby into the browser, and also because I felt that JavaScript and the DOM should be more tightly coupled together. Over the years, I have taken inspiration from React&#x2F;JSX, and also Tailwind.<p>Since 2013, I have built several business-critical apps in Imba, so this is not a toy project or an academic exercise, it is extracted from a real project trying to solve real problems. Today, we are currently a small but passionate community of devs who use Imba all over the world.<p>The nitty-gritty details\nAs mentioned, Imba compiles to JavaScript, and it works on both the frontend and backend. The quickest way to get a feeling of how it works is by checking out this video: https:&#x2F;&#x2F;imba.io&#x2F;<p>Alternatively, here is a list of the main benefits of the language:<p>* Clean syntax with built-in tags and inline styles<p>* Imba&#x27;s Memoized DOM approach is *an order of magnitude* faster than Virtual DOMs (Vue, React). Learn more here: https:&#x2F;&#x2F;www.freecodecamp.org&#x2F;news&#x2F;the-virtual-dom-is-slow-meet-the-memoized-dom-bb19f546cc52&#x2F;<p>* Imba works with Node and the npm ecosystem, and integrates tightly with both JS and TypeScript<p>* Blazing-fast dev&#x2F;build tools based on esbuild<p>Each of the benefits above are explained more thoroughly in our docs here, so please check it out if any of the above points spark your interest: https:&#x2F;&#x2F;imba.io<p>With this version I feel that I am very close to my vision for what Imba should be. In other words; it is finally ready for public consumption. I&#x27;d wholeheartedly advice you to look into it and give it a whirl if you are interested in web development :)<p>Hope you like it, and please share any feedback you might have in the comments!",
      "time": 1629190529,
      "title": "Show HN: Imba – I have spent 7 years creating a programming language for the web",
      "type": "story"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 28207655,
      "score": 2,
      "time": 1629190450,
      "title": "Chinese Media Says Afghanistan a Lesson for Taiwan on How U.S. Abandons Allies",
      "type": "story",
      "url": "https://www.newsweek.com/chinese-state-media-says-afghanistan-lesson-taiwan-how-us-abandons-allies-1619865"
    },
    {
      "by": "42droids",
      "descendants": 0,
      "id": 28207638,
      "score": 1,
      "text": "If someone wanted to help, what would be the best way? What can a single person do to make a difference?",
      "time": 1629190276,
      "title": "Ask HN: What’s the best way to help people in Afghanistan?",
      "type": "story"
    },
    {
      "by": "bttrfl",
      "descendants": 1,
      "id": 28207629,
      "kids": [
        28207646
      ],
      "score": 1,
      "time": 1629190184,
      "title": "Humans ‘pushing Earth close to tipping point’, say most in G20",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/aug/16/three-quarters-g20-earth-close-to-tipping-point-global-survey-climate-crisis"
    },
    {
      "by": "imartin2k",
      "descendants": 0,
      "id": 28207574,
      "score": 2,
      "time": 1629189624,
      "title": "In Norway, electric cars make gas-powered car sales vanish",
      "type": "story",
      "url": "https://electrek.co/2021/08/16/norway-glimps-future-electric-cars-make-gas-powered-car-sales-vanish/"
    },
    {
      "by": "prgrls",
      "descendants": 1,
      "id": 28207567,
      "kids": [
        28207568
      ],
      "score": 3,
      "time": 1629189566,
      "title": "Elixir and Phoenix uptime monitor for websites and web apps #3: Data models",
      "type": "story",
      "url": "https://l.prograils.com/2UpVIID"
    },
    {
      "by": "Kaibeezy",
      "descendants": 0,
      "id": 28207565,
      "score": 2,
      "time": 1629189532,
      "title": "Finally, a Shot to Prevent Lyme Disease Could Be on Its Way",
      "type": "story",
      "url": "https://www.outsideonline.com/health/wellness/lyme-disease-prevention-antibody-shot/"
    },
    {
      "by": "noduerme",
      "descendants": 0,
      "id": 28207540,
      "score": 1,
      "text": "So let&#x27;s say someone (me) has been iterating a data tool for a few years and wants to make a reasonably nice UI for it, and then open-source the whole thing. And let&#x27;s say person (me) doesn&#x27;t want to deal with React or any other libraries, but does have a bunch of portable UI code from other projects that happens to work fine for drawing UI components to display these big data models.<p>Is it gauche to include your own UI components in data projects these days? I&#x27;m talking about things like dialog boxes and waiters, progress loaders, simple component handlers and things like that. The goal here is to <i>not</i> have dependencies, but to also have a usable client-side app for people without coding skills. Is it frowned upon to just include a custom framework?",
      "time": 1629189305,
      "title": "Ask HN: Would you downvote a data app for having custom/vanillaJS UI?",
      "type": "story"
    }
  ]
}