{
  "stories": [
    {
      "by": "subalalitha",
      "descendants": 0,
      "id": 30161076,
      "score": 1,
      "text": "Hey HN! I am Dr.Subalalitha CN from FirstLanguage (https:&#x2F;&#x2F;www.firstlanguage.in). I am excited to launch our Natural Language Processing(NLP) API service with the HN community.<p>Our motto is &#x27;NLP for the masses&#x27;. As you all know NLP requires specialized developers to build language based apps. We usually talk about training models and picking the right algorithm for an NLP task like for example Sentiment Analysis. This may be daunting for non-NLP developers if they are not well versed with the subject.<p>Any developer with an idea related to any app which requires text or speech processing should be able to develop that idea into reality. We at FirstLanguage enable that by providing an easy to use API at an affordable cost for a wide range of NLP tasks.<p>We cater to basic building block tasks like Stemming, Lemmatizer, Morphological Analyzer, POStag etc to advanced tasks like Sentiment Analysis or classification, Question Answering, Translation, Summarization etc.<p>We provide a Free plan to try our API or build your prototype, no credit card required. It is free for life until you decide to upgrade.<p>We provide API documentation which explains each and every API and what it does and how to use it. The documentation page also provides Try It feature which you can use to try our APIs directly in the browser. The documentation also provides code snippets in multiple coding languages.<p>We also provide SDKs for our API in Python and Typescript.<p>I would love to hear your ideas, experiences, and feedback, and will be answering any questions in the comments!",
      "time": 1643714035,
      "title": "Show HN: FirstLanguage NLP API",
      "type": "story"
    },
    {
      "by": "equalsione",
      "descendants": 0,
      "id": 30161071,
      "score": 1,
      "time": 1643713992,
      "title": "770-km US megaflash sets new lightning record",
      "type": "story",
      "url": "https://phys.org/news/2022-02-longest-lightning-miles-states.html"
    },
    {
      "by": "6mile",
      "descendants": 0,
      "id": 30161058,
      "score": 1,
      "time": 1643713861,
      "title": "Lessons learned on how to secure Git",
      "type": "story",
      "url": "https://securestack.com/how-to-secure-git/"
    },
    {
      "by": "2Gkashmiri",
      "descendants": 0,
      "id": 30161047,
      "score": 1,
      "time": 1643713768,
      "title": "The Crypto Tax Regime Announced in Budget 2022-23",
      "type": "story",
      "url": "https://coincrunch.in/2022/02/01/crypto-tax-announced-in-budget-2022-23/"
    },
    {
      "by": "devperson45",
      "descendants": 0,
      "id": 30161040,
      "score": 2,
      "time": 1643713687,
      "title": "What Is Aquamation? A Sustainable Cremation Alternative, Alkaline Hydrolysis",
      "type": "story",
      "url": "https://eirene.ca/blog/understanding-aquamation"
    },
    {
      "by": "chasil",
      "descendants": 0,
      "id": 30160999,
      "score": 2,
      "time": 1643713324,
      "title": "Bipartisan effort begins to break Google's advertising monopoly",
      "type": "story",
      "url": "https://nypost.com/2022/01/31/googles-online-ad-business-would-be-dismantled-under-bill-gaining-bipartisan-support/"
    },
    {
      "by": "keiferski",
      "descendants": 0,
      "id": 30160992,
      "score": 2,
      "time": 1643713260,
      "title": "The Meta-Lists Website",
      "type": "story",
      "url": "https://beckchris.com/"
    },
    {
      "by": "Huhty",
      "descendants": 0,
      "id": 30160981,
      "score": 2,
      "time": 1643713179,
      "title": "Tired of procrastinating? To overcome it, take the time to understand it (2019)",
      "type": "story",
      "url": "https://ideas.ted.com/tired-of-procrastinating-to-overcome-it-take-the-time-to-understand-it/"
    },
    {
      "by": "aliswe",
      "descendants": 1,
      "id": 30160953,
      "kids": [
        30161055
      ],
      "score": 1,
      "text": "The rules and regulations of GDPR are sending shockwaves through the Data &amp; Analytics community with rulings such as the austrian news site vendor who was convicted for using Google Analytics without consent, and just now a german website was fined 100EUR for using Google Fonts on a website without consent.<p>If the GDPR is in fact to be interpreted in this literal way, and assuming Google Analytics doesn&#x27;t take any measures to become compliant, we will need to replace Google Analytics on our platform with a self-hosted, open source analytics tool like for example Motomo.<p>If this includes other tools like Google Tag Manager, those tools will need to be replaced as well.<p>Should we assume that Google is on top of this and will &quot;publish a fix&quot; in order to become compliant? It&#x27;s not a small actor so it surprises me that we have so little official guidance and&#x2F;or assurance that they are on top of this. Are they paralyzed?<p>What should we do here? What are you going to do?<p>Worst case for us, I guess, is to go back to 90&#x27;s style web programming where everything is self hosted, which is fine I guess, but quite far from how the world commonly works right now.<p>I don&#x27;t even want to think about the fact that GDPR might even ban the usage of Azure and other cloud vendors, because of the simple fact that the CPs (and any hosting company) will definitely get the IP address of a web visitor regardless.",
      "time": 1643712968,
      "title": "Ask HN: GDPR might mean we cannot request any 3rd party service in the US?",
      "type": "story"
    },
    {
      "by": "superasn",
      "descendants": 0,
      "id": 30160944,
      "score": 2,
      "time": 1643712901,
      "title": "India Edges Toward Crypto Legalisation with 30% Tax and Digital Rupee Launch",
      "type": "story",
      "url": "https://www.coindesk.com/policy/2022/02/01/india-to-levy-30-tax-on-crypto-income-cbdc-launch-in-2022-23/"
    }
  ]
}