{
  "stories": [
    {
      "by": "sahin",
      "descendants": 0,
      "id": 30508419,
      "score": 1,
      "time": 1646100969,
      "title": "Animal-free dairy milk set to finally hit US retail shelves",
      "type": "story",
      "url": "https://newatlas.com/science/animal-free-dairy-milk-betterland-perfect-day-whey-protein-on-sale/"
    },
    {
      "by": "techolic",
      "descendants": 1,
      "id": 30508363,
      "kids": [
        30508389
      ],
      "score": 1,
      "time": 1646100432,
      "title": "@Reuters Is Disappointing",
      "type": "story",
      "url": "https://twitter.com/Reuters/status/1498439236080570374"
    },
    {
      "by": "kawera",
      "descendants": 0,
      "id": 30508355,
      "score": 1,
      "time": 1646100376,
      "title": "The Voyagers",
      "type": "story",
      "url": "https://magazine.atavist.com/the-voyagers-russia-bering-strait-stalin-alaska-ukraine/"
    },
    {
      "by": "jacquesm",
      "descendants": 1,
      "id": 30508314,
      "kids": [
        30508391
      ],
      "score": 12,
      "text": "Every Russian citizen and every Russian company that is currently relying on businesses in the West such as Amazon, Google, Microsoft and so on for hosting, communications, connectivity and other services should expect those services to be cut off at some point in the near future, and plan accordingly.<p>Regardless, you won&#x27;t be able to pay for these services at the next billing period so they will be terminated one way or another.<p><i>Back up your stuff, move your service while you can or you risk losing everything</i>, this is <i>not</i> a drill.<p>Understand that the level at which this is currently playing out means that it could very well happen that governments will sanction businesses in the West that continue to work with Russian entities, businesses or individuals.<p>Some may decide to do this unilaterally for reasons all their own, some may give you warnings, some won&#x27;t. Contrary to how these things normally play out the speed with which sanctions are being enacted and their severity should not be underestimated. Effectively threatening the world with nuclear annihilation has put the pressure on in a way that I have never seen before, leading to a degree of unity that is unique and which will speed up the process of ordering and implementing these sanctions to unprecedented levels.<p>Use the time while you have it.<p>If you are a private individual from a Western country get out while you can, even if that means a detour via Dubai or China. This could very well get ugly and you don&#x27;t want to get caught in a country where lots of people are being made to believe that you and&#x2F;or your country of origin are the cause for their hardship. Waiting it out is a risk you probably can not afford. Some Western governments have already ordered their citizens out of Russia.<p>I hope sincerely that all of this will be behind us soon and in a way that minimizes bloodshed on both sides, but I <i>especially</i> wish that for the defenders, who had no agency at all.",
      "time": 1646100074,
      "title": "Tell HN: If You Are in Russia",
      "type": "story"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 30508282,
      "kids": [
        30508405
      ],
      "score": 2,
      "time": 1646099882,
      "title": "Disney will pause theatrical movie releases in Russia",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/28/business/disney-movies-russia-turning-red.html"
    },
    {
      "by": "oinj",
      "descendants": 0,
      "id": 30508246,
      "score": 1,
      "time": 1646099723,
      "title": "A macOS bundler for ScummVM games",
      "type": "story",
      "url": "https://oin.github.io/scummvmbox/"
    },
    {
      "by": "ani_obsessive",
      "descendants": 0,
      "id": 30508225,
      "score": 1,
      "time": 1646099594,
      "title": "Ukrainian Animation Is Worth Celebrating",
      "type": "story",
      "url": "https://animationobsessive.substack.com/p/ukrainian-animation-is-worth-celebrating"
    },
    {
      "by": "rurp",
      "descendants": 0,
      "id": 30508216,
      "score": 2,
      "text": "I&#x27;ve been finding myself hunting for media I don&#x27;t normally consume in order to get more information on Russia&#x27;s invasion of Ukraine. Unfortunately I don&#x27;t know of any good podcasts that are covering the war. Do you have any good recommendations? Any subject matter or angle is welcome, as long as the information is solid and recent. Many thanks.",
      "time": 1646099541,
      "title": "Ask HN: Any good podcasts for following the invasion of Ukraine?",
      "type": "story"
    },
    {
      "by": "mudro_zboris",
      "descendants": 0,
      "id": 30508191,
      "score": 1,
      "time": 1646099432,
      "title": "Beyond sanctions: An off-ramp for post-Putin Russia",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/beyond-sanctions-an-off-ramp-for"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 30508182,
      "score": 2,
      "time": 1646099395,
      "title": "Twitter will label, reduce visibility of tweets linking to Russian state media",
      "type": "story",
      "url": "https://www.reuters.com/technology/twitter-will-label-reduce-visibility-tweets-linking-russian-state-media-2022-02-28/"
    }
  ]
}