{
  "stories": [
    {
      "by": "tomkurtcat",
      "descendants": 0,
      "id": 30526260,
      "score": 1,
      "time": 1646221690,
      "title": "An economy built for men – How sexism is holding up innovation",
      "type": "story",
      "url": "https://creatived.substack.com/p/economy-built-for-men"
    },
    {
      "by": "mountainplus",
      "descendants": 0,
      "id": 30526228,
      "score": 1,
      "time": 1646221457,
      "title": "Iron Law of Prohibition (2018)",
      "type": "story",
      "url": "https://drvidyahattangadi.com/iron-law-of-prohibition/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30526208,
      "score": 1,
      "time": 1646221342,
      "title": "A 155 carat diamond with 92 mm diameter (2017)",
      "type": "story",
      "url": "https://www.innovations-report.com/life-sciences/a-155-carat-diamond-with-92-mm-diameter/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30526201,
      "score": 1,
      "time": 1646221225,
      "title": "The fight over the sugar conspiracy (2018)",
      "type": "story",
      "url": "https://www.theverge.com/2018/2/23/17039780/sugar-industry-conspiracy-heart-disease-research-mark-hegsted-harvard"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30526196,
      "score": 1,
      "time": 1646221174,
      "title": "UN Climate 'Atlas of human suffering', worse, bigger",
      "type": "story",
      "url": "https://apnews.com/article/climate-science-europe-united-nations-weather-8d5e277660f7125ffdab7a833d9856a3"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30526187,
      "score": 2,
      "time": 1646221075,
      "title": "Make on Offer for Namecheap.com on Namecheap.com",
      "type": "story",
      "url": "https://www.namecheap.com/domains/registration/results/?domain=namecheap.com"
    },
    {
      "by": "ertucetin",
      "descendants": 0,
      "id": 30526185,
      "score": 2,
      "time": 1646221074,
      "title": "Clojure – First Impressions",
      "type": "story",
      "url": "https://franz.hamburg/writing/clojure-first-impressions.html"
    },
    {
      "by": "djuric42",
      "descendants": 0,
      "id": 30526178,
      "score": 1,
      "text": "The most important attribute to the current world tech should be - maintaining peace. \nEverything we achieved in software, philosophically speaking, is because of making a better life. So far you get my point.\nIf software would be delivered as current politics is delivered, we all engineers and devs would all be with empty pockets.<p>There is always a variable in a war that is not discovered at a valid time, so can we use software ideas to discover it?<p>Let&#x27;s say I&#x27;m taking the Ukrainian side, what &quot;deep&quot; tools can be used to check facts like &quot;UKRAINIAN CRIMES IN DONBAS&quot;?\nSpecifically, this text<p>--\nVarious crimes were committed by the Ukrainian army, but also by Nazi organizations that were founded in Ukraine in the period from 2014 until today. All these crimes had the support of the Ukrainian authorities and the state leadership, genocide was committed against the Russian population who were persecuted because of their language, religion, culture and identity.\nIn those 8 years, from 2014 to 2022, Ukrainians constantly shelled the cities of DNR and LNR, in which numerous civilians, the elderly, women and children were killed.<p>Cities with a huge number of victims were shelled and devastated: Donetsk, Luhansk, Mariupol, Avdiaevsky and others.<p>From 2014 to 2021, the Army of Ukraine killed more than 150 children in the DNR and LNR, and more were wounded. On July 27, 2014, the main streets of the city of Gorlovka were targeted by armed formations of Ukraine, and 20 civilians, including 4 children, were killed on the streets of the city.<p>That day went down in history as &quot;Bloody Sunday&quot;. During the shelling, 23-year-old Kristina Zhuk died with her daughter in her arms, and after her death she became known as &quot;Gorlovka Madonna&quot;.<p>The Ukrainian army and volunteer detachments committed various crimes, tortured, raped and kidnapped in their actions. Russian-speaking people were beaten in Ukraine. Unpleasant scenes in which street musicians in Lviv were beaten because they sang in Russian, and in Kiev women were beaten only because they spoke in Russian, as well as a taxi driver in the city of Kamyanske who was beaten and shot in the leg because of the Russian language.<p>In Odessa, on May 2, 2014, Russian-speaking people were burned at the Trade Union House by radical members of the Right Sector organization, and more than 10 people were burned alive.<p>In addition to beatings because of the Russian language, Russians were left without a job, noting that they had to learn Ukrainian, and if they could not, they were considered to have a low level of intelligence and should be &quot;cut off&quot; because they are dangerous to society.<p>In the period from 2014 until today, Ukrainian ministers and President Zelensky have repeatedly called Russians scum when addressing their soldiers with support because they are fighting scum.<p>During that period, a large number of Nazi organizations were created in Ukraine. Nazi organizations operating on the territory of Ukraine are: Trident - Stepan Bandera, Organization of Ukrainian Nationalists, Ukrainian Insurgent Army, Right Sector, UNA-UNSO, Brotherhood - Korchinsky, Misanthrope Division (operating under the slogan &quot;Death to Russia&quot;, and uses the flag with with a swastika and the inscription &quot;Hail Hitler!&quot;).",
      "time": 1646221017,
      "title": "Make Peace with Software",
      "type": "story"
    },
    {
      "by": "octoberfranklin",
      "descendants": 0,
      "id": 30526177,
      "score": 1,
      "time": 1646221014,
      "title": "Furnace Repair Businesses Endure Long Winter of Parts Shortages",
      "type": "story",
      "url": "https://www.wsj.com/articles/furnace-repair-businesses-endure-long-winter-of-parts-shortages-11646217001"
    },
    {
      "by": "throwaway4good",
      "descendants": 0,
      "id": 30526171,
      "score": 1,
      "time": 1646220960,
      "title": "The US risks pushing its luck with potential SMIC export ban",
      "type": "story",
      "url": "https://www.protocol.com/bulletins/smic-russia-china-export-ban"
    }
  ]
}