{
  "stories": [
    {
      "by": "Anonymous4272",
      "descendants": 0,
      "id": 30177714,
      "score": 1,
      "time": 1643810976,
      "title": "Nvidia Linux Gaming Performance for Wayland vs. X.org on Ubuntu 22.04",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=article&item=nvidia-510-wayland&num=1"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 30177695,
      "score": 1,
      "time": 1643810916,
      "title": "Sparks Piracy Busts: Facts, Rumors and Fear",
      "type": "story",
      "url": "https://torrentfreak.com/sparks-piracy-busts-facts-rumors-fear-point-to-something-huge-200827/"
    },
    {
      "by": "philk10",
      "descendants": 0,
      "id": 30177681,
      "score": 1,
      "time": 1643810865,
      "title": "FBI confirms it obtained NSO’s Pegasus spyware",
      "type": "story",
      "url": "https://www.theguardian.com/news/2022/feb/02/fbi-confirms-it-obtained-nsos-pegasus-spyware"
    },
    {
      "by": "italoacasas",
      "descendants": 0,
      "id": 30177679,
      "score": 1,
      "time": 1643810858,
      "title": "Solana Internals: What Are the Native On-Chain Programs and Why Do They Matter?",
      "type": "story",
      "url": "https://soldev.app/library/articles/CXRE6Ub7R"
    },
    {
      "by": "keehun",
      "descendants": 0,
      "id": 30177661,
      "score": 1,
      "text": "I am a frequent user of the web version of Outlook hosted at https:&#x2F;&#x2F;outlook.office.com&#x2F;mail&#x2F;<p>On some days, Outlook decides to eat keystrokes. I&#x27;m constantly battling the email editor to type what I need to type. Sometimes, it gets worse because it will reinterpret my keystrokes as activated shortcuts like delete or archive an email.<p>Does this happen to anyone else? I&#x27;m using Firefox.<p>It really seems fine on some days and completely unusable on others. I&#x27;ve disabled all intelligent&#x2F;predictive features because those features made it worse, but now even with those all disabled, the problem persists although to a lesser degree.<p>I&#x27;ve gotten desperate enough with the issue I wondered if anyone else experienced them.",
      "time": 1643810783,
      "title": "Ask HN: Does the web Outlook “eat keystrokes” for you?",
      "type": "story"
    },
    {
      "by": "smartmic",
      "descendants": 0,
      "id": 30177654,
      "score": 1,
      "time": 1643810748,
      "title": "Deciphering three diplomatic letters sent by Maximilian II in 1575",
      "type": "story",
      "url": "https://www.tandfonline.com/doi/full/10.1080/01611194.2020.1858370"
    },
    {
      "by": "faeyanpiraat",
      "descendants": 0,
      "id": 30177651,
      "score": 1,
      "text": "(Trying to keep my question generally applicable, if a key info is missing, let me know, and I edit it in.)<p>It seems like I&#x27;m going to transition into a new role in a company where I&#x27;m going to be the first person being in said role.<p>In software engineering many of the activities are tangentially related to eachother, so other team members are probably already doing parts of what I will have to do, so some siloed knowledge already exists on how they like &quot;stuff&quot; done.<p>Everything technical can be learned from courses, but I&#x27;m not sure how to quickly pick up the nuances coming naturally with years of experience.<p>The role being new, and without a senior specialist in this company I think I&#x27;ll have to figure out (some of) the best practices.<p>This is a medior level job, so they don&#x27;t expect managerial skills from me, but getting myself on track is probably expected.<p>I can be productive from day one, but I&#x27;m afraid of making costly mistakes which only manifest themselves down the road.<p>Although simply trying out different approaches before &quot;committing&quot; to the &quot;best&quot; is doable, due to my lack of deep understanding of the topic it could still result in a sub-optimal solution.<p>How can I accelerate my growth into this new role?",
      "time": 1643810739,
      "title": "Ask HN: How to acquire best practices for a role?",
      "type": "story"
    },
    {
      "by": "carlawaters",
      "descendants": 0,
      "id": 30177609,
      "score": 1,
      "time": 1643810532,
      "title": "ReliaQuest Review: HelpNet Security",
      "type": "story",
      "url": "https://www.reliaquest.com/resource/research-report/reliaquest-review-helpnet-security/"
    },
    {
      "by": "mastermedo",
      "descendants": 0,
      "id": 30177602,
      "score": 1,
      "text": "It&#x27;s a business philosophy that focuses on gradual growth rather than large initial output in hopes of improving efficiency and improving the work environment.<p>Is there a word for continuous self-improvement, unrelated to work?",
      "time": 1643810510,
      "title": "TIL: Kaizen is a Japanese word for continuous improvement",
      "type": "story"
    },
    {
      "by": "arm",
      "descendants": 0,
      "id": 30177559,
      "score": 1,
      "time": 1643810356,
      "title": "Installing Modern Debian on a Power Mac G5 [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=g-Ugfqj1ank"
    }
  ]
}