{
  "stories": [
    {
      "by": "maggioli",
      "descendants": 0,
      "id": 31988559,
      "score": 2,
      "time": 1657031186,
      "title": "Full-office tech jobs pay 1.9x less than full-remote",
      "type": "story",
      "url": "https://landing.jobs/blog/global-tech-talent-trends-2022/"
    },
    {
      "by": "andyjohnson0",
      "descendants": 0,
      "id": 31988550,
      "score": 2,
      "time": 1657031158,
      "title": "Simulating Circuits with Fritzing",
      "type": "story",
      "url": "https://blog.fritzing.org/"
    },
    {
      "by": "alxthm",
      "descendants": 0,
      "id": 31988526,
      "score": 1,
      "time": 1657031060,
      "title": "Quantum Computing – One hundred sec. bit-flip time in a superconducting circuit",
      "type": "story",
      "url": "https://alice-bob.com/2022/03/10/one-hundred-seconds-bit-flip-time-in-a-superconducting-circuit/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31988523,
      "score": 1,
      "time": 1657031045,
      "title": "Release SpaceVim v2.0.0",
      "type": "story",
      "url": "https://github.com/SpaceVim/SpaceVim/releases/tag/v2.0.0"
    },
    {
      "by": "sforza",
      "descendants": 1,
      "id": 31988516,
      "kids": [
        31988578
      ],
      "score": 3,
      "text": "given that, in 2022:<p><pre><code>    both parents will need to work to fund raising a child, so the mother necessarily has to do 1.5 or 2 full-time jobs\n\n    grandparents most likely don&#x27;t live in the same city so you&#x27;re reliant on strangers to raise your children\n\n    increased risk of autism &#x2F; ADD &#x2F; lack of focus because of the internet\n\n    the world is already over-populated, and however hard it is for you to compete with your peers, it&#x27;ll be even harder for your children\n\n    etc etc etc (to name but a few)\n</code></pre>\nI&#x27;m looking for new perspectives on why one should choose to procreate nowadays. I&#x27;m less interested in parents trying to rationalize what deep down they know was a bad decision, the perpetual &quot;oh but I&#x27;d do it all over again&quot; thing when clearly their life is a lot of worse and they&#x27;re full of regret.",
      "time": 1657031031,
      "title": "What are the benefits to having children nowadays?",
      "type": "story"
    },
    {
      "by": "hggh",
      "descendants": 0,
      "id": 31988506,
      "score": 2,
      "time": 1657030974,
      "title": "BTC is Bitcoin only because a group of centralized exchanges gave it that ticker",
      "type": "story",
      "url": "https://twitter.com/jessquit2/status/1544004398820515840"
    },
    {
      "by": "Peach_blue",
      "descendants": 0,
      "id": 31988486,
      "score": 1,
      "text": "Hello everyone,<p>I will try to keep this as short as possible, but I can’t spare you a few details about myself. I’ll give you a tl;dr at the end.<p>I’m a European male in my mid-thirties and I have spent most of my working life as a cook (never a  head chef). A few years back I got a two-year degree in hotel-management (that’s a thing where I live) to escape the hell that is line-cooking. Originally I always wanted to become a head chef, but with more and more economic pressure and less talented or willing personnel everywhere, I’m not envious of anybody in that position anymore.<p>Also I thought I would drink less if I didn’t have to cook anymore, but it turned out that was a lie and I realized I was a bona fide alcoholic. I got treatment and I’m almost 2 years sober now and thankful for it. However, it also made me realize that without alcohol I’m a very shy and introverted person. I used drugs, alcohol and an ‘asshole persona’ to suppress feelings of abandonment and emotional abuse as a child.<p>Because I grew up with computers (created some websites with plain html back in the day) I thought maybe this could be my new career. There is less interpersonal contact in IT and I’m genuinely interested in various fields. However, despite that real interest that draws me in to open that IDE or do CTFs in the evening, I can’t help but feel that I’m again running away from something.<p>I’ve always written as a hobby and recently published some short-stories that were well received. Also I feel like I have valuable insights into trauma and addiction that want to be … how do I say it … turned into something helpful for others. Maybe in the form of a blog for men (because I noticed a lot of resources are skewed towards women, or written by women (not that that’s a problem, but it might not speak to everybody equally))\nSo a whole different path could be to study psychology in part-time, focus on healing myself and possibly helping others along the way. I feel like that’s what I should do, it feels ‘right’. But a part of me wants to be a tech-savvy hacker-type person, who doesn’t have to worry about a well-paying job. Plus there is a considerable amount of fear within me, that governments are turning increasingly authoritarian and will be using technology to control people. So I want to be prepared and possibly know computers well enough to protect my freedom. But that’s just fear, and fear is never a good captain they say. Also I have no idea how realistic any of this is. If the NSA creates software for a digital ID system, a former line-cook probably won’t crack the code in his spare time, amIright?<p>And lastly I do feel more agitated and stressed when I’ve been in front of the computer for extended periods. The sheer amount that is to learn and again more fear that I will never be any good, or possibly be even more stressed when I get an actual job than I was as a cook. I don’t enjoy conversations and the company of friends as much when I’ve coded for the last two days or more. My mind seems sluggish and my soul withdrawn. But meaningful relationships are an essential part of healing from what I’ve been through.<p>In trauma recovery there is a concept that many of us pour energy into misguided careers, with the hopes of ‘it’ll all be better once I get where I want to be’. But when we end up there everything stays the same, except we’re burnt out or close to it. Could this be just another attempt of my subconscious to do exactly that?<p>So here, the tl;dr<p>I want to get into IT, because I feel it would solve many problems I have. But I’m worried it’s just a fantasy and real-life will be just a different version of what I’m trying to avoid. Should somebody who is prone to stress-related illnesses maybe stay out of IT?<p>If you have read all of that I thank you sincerely. Harsh truths are welcome, just try to be kind. I’m sensitive these days.<p>Be healthy everyone.",
      "time": 1657030880,
      "title": "Ask HN: Could my motivation to learn IT/Programming/Cybersecurity be misguided?",
      "type": "story"
    },
    {
      "by": "xyzwave",
      "descendants": 0,
      "id": 31988477,
      "score": 1,
      "time": 1657030845,
      "title": "Aldous Huxley: “Human Potentialities” (1961)",
      "type": "story",
      "url": "https://psychedelicsalon.com/podcasts-454-aldous-huxley-human-potentialities/"
    },
    {
      "by": "Vinnl",
      "descendants": 0,
      "id": 31988468,
      "score": 1,
      "time": 1657030792,
      "title": "Unit and Integration Tests",
      "type": "story",
      "url": "https://matklad.github.io//2022/07/04/unit-and-integration-tests.html"
    },
    {
      "by": "racc1337",
      "descendants": 0,
      "id": 31988466,
      "score": 1,
      "time": 1657030790,
      "title": "Homarr – A Homepage for Your Server",
      "type": "story",
      "url": "https://github.com/ajnart/homarr"
    }
  ]
}