{
  "stories": [
    {
      "by": "FollowingTheDao",
      "descendants": 1,
      "id": 31838982,
      "kids": [
        31839002
      ],
      "score": 1,
      "time": 1655918476,
      "title": "Diabetes: Dopamine regulates insulin secretion through a complex of receptors",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2022/06/220622101340.htm"
    },
    {
      "by": "Twixes",
      "descendants": 0,
      "id": 31838970,
      "score": 1,
      "time": 1655918429,
      "title": "Floating-point arithmetic – all you need to know, explained interactively",
      "type": "story",
      "url": "https://matloka.com/blog/floating-point-101"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31838969,
      "score": 1,
      "time": 1655918420,
      "title": "Vale's “Fearless FFI”, for Memory Safety, Safer Dependencies, and Supply-Chain",
      "type": "story",
      "url": "https://verdagon.dev/blog/fearless-ffi"
    },
    {
      "by": "whiskey14",
      "descendants": 0,
      "id": 31838961,
      "score": 2,
      "text": "I&#x27;m taking a new client for my consulting business and I&#x27;m retierating the need for close working on domain understanding, and therefore domain driven design.<p>I like the principles but not the details and was wondering if HN had any thoughts&#x2F;tips when using (or not using) DDD?",
      "time": 1655918387,
      "title": "Ask HN: What do you think about Domain Driven Design?",
      "type": "story"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31838932,
      "score": 2,
      "time": 1655918289,
      "title": "Gowalla, Foursquare and the (very) brief history of the Location Wars",
      "type": "story",
      "url": "https://thehistoryoftheweb.com/gowalla-foursquare-and-the-very-brief-history-of-the-location-wars/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31838931,
      "score": 2,
      "time": 1655918284,
      "title": "Collisions hint that four neutrons form a transient isolated entity",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01634-x"
    },
    {
      "by": "OrderOfChaos",
      "descendants": 0,
      "id": 31838901,
      "score": 2,
      "time": 1655918179,
      "title": "Big Trak",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Big_Trak"
    },
    {
      "by": "tonymet",
      "descendants": 0,
      "id": 31838895,
      "score": 3,
      "text": "While home-buying I was bombarded with dozens of introductions to strangers asking me to wire large sums of money and share sensitive personal information, typically via email.  The emails themselves were suspicious – from dubious domains, lacking signatures – few if any signals to trust the individual.<p>To establish trust I asked them to Facetime and share IDs mutually, but they balked.  I&#x27;ve tried this before and people are generally reluctant.  Asking for a mutual phone call with a trusted person was also met with suspicion.<p>Ultimately, I met the escrow agents and sellers face-to-face at their business to collect business cards and transfer information.  There&#x27;s still no better authentication than meeting a person at their place of business: they have business cards, an office, co-workers – half a dozen signals to verify identity.<p>Despite the high incidence of wire fraud and identity theft, authentication protocols are all one-sided.  Customers require credentials but there&#x27;s no way to authenticate the business agents. This goes beyond banking to include healthcare, utilities, credit bureaus, the tax industry – any business relationship that  shares sensitive or personal info.<p><i>tl;dr</i> :<p>So, how do you go about establishing trust with strangers in order to share sensitive information or transfer money? What process and &#x2F; or tech do you use to identify &amp; trust the other side of the transaction?<p><i>My Proposal</i> :<p>On the social side, we need to improve the culture of verifying identity to encourage a mutual process.  Both sides need to share IDs and proofs of identity for any transaction to be sound.<p>As for technology, we need better systems to empower customers to validate the authenticity of agents, including one-time tokens and business verification.  A system like &quot;The Work Number&quot;, used for employee verification, could be effective to validate business agents without compromising them. These systems need to be stable over legacy channels like phone, fax, wire transfers, paper checks &amp; email – systems that will remain for 30+ years.<p>As software engineers we need to establish trust mutually and give more attention to the business-side of the trust relationship.",
      "time": 1655918161,
      "title": "Ask HN: How do you establish trust with strangers?",
      "type": "story"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 31838888,
      "score": 3,
      "time": 1655918119,
      "title": "Impact of reading about climate science goes away almost instantly",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/06/impact-of-reading-about-climate-science-goes-away-almost-instantly/"
    },
    {
      "by": "mig39",
      "descendants": 0,
      "id": 31838852,
      "score": 2,
      "time": 1655917954,
      "title": "Mullvad audit found no information leakage or logging of customer data",
      "type": "story",
      "url": "https://mullvad.net/en/blog/2022/6/22/vpn-server-audit-found-no-information-leakage-or-logging-of-customer-data/"
    }
  ]
}