{
  "stories": [
    {
      "by": "eternalban",
      "descendants": 0,
      "id": 28346908,
      "score": 1,
      "time": 1630246825,
      "title": "Apple Silicon for Neuro-Imaging",
      "type": "story",
      "url": "https://github.com/neurolabusc/AppleSiliconForNeuroimaging"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 28346906,
      "score": 1,
      "time": 1630246802,
      "title": "The College Student Who Makes His Own Chips",
      "type": "story",
      "url": "https://thenewstack.io/meet-the-college-student-who-makes-his-own-chips/"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 28346904,
      "score": 1,
      "time": 1630246790,
      "title": "JSON Schema bundling finally formalised",
      "type": "story",
      "url": "https://json-schema.org/blog/posts/bundling-json-schema-compound-documents"
    },
    {
      "by": "alexthedaily",
      "descendants": 0,
      "id": 28346893,
      "score": 1,
      "time": 1630246712,
      "title": "Easily earn over $1000 with Canva – Tutorial",
      "type": "story",
      "url": "https://www.thedailytechs.com/canva-affiliate-program-how-to-make-1000-or-more"
    },
    {
      "by": "amarkumar81",
      "descendants": 0,
      "id": 28346873,
      "score": 1,
      "text": "My name is Amar Kumar and I’m the founder of KaiPod Learning (<a href=\"http:&#x2F;&#x2F;www.kaipodlearning.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kaipodlearning.com</a>). We provide a physical place for middle- and high- school students who go to online school to work on their classes, to interact with other students, and to get support from teachers.<p>Over the last 15 years I have been a school teacher, a principal, and most recently the Chief Product Officer of Pearson Online Schools. I have come to understand the unfortunate link between residential property values and educational outcomes. There are tens of millions of parents in poor quality school districts who can’t afford to relocate or pay for a private school. Online learning can help solve this problem for many kids. With public online schools, you can live anywhere and have access to a high-quality education.<p>For millions of kids, online school is the best school they’ve ever had. They get to study at their own pace without feeling rushed or bored, work without distractions, and not fear bullying. However, they lack enough opportunities to interact with other kids or get real-time help from their teachers. In addition, parents of online students usually have to stay home with them and support them with academic work, something that not all parents are able to do.<p>At Pearson, my team supported 150,000 students who went to school completely online before the pandemic even started. In conversations with many families, I came to understand what brought them to our schools and what could make their experience better. The idea to run small-group learning pods as supplements to online school was the highest-impact idea we studied. It was popular with parents and students and we knew we could improve customer conversion, student outcomes, and school retention if we did it. However, Pearson is a curriculum company and I couldn’t get this off the ground. As the pandemic started and the floodgates opened for online schooling, I decided to quit my job and build a startup to solve the problem.<p>We provide a physical place for online students to meet every day, interact with other kids, and get support from instructors. We match them to a learning center within 20 minutes of their home with 8-10 other children of similar age. These students come to our center anywhere from two to five days a week. While they are at our centers, they are supported by a “learning coach”, a former teacher who loves working with kids (but not grading homework or creating lesson plans!).  Our coaches interact closely with the online school teachers and create strategies on how to support each child. This team approach is highly effective at addressing the academic, social, and emotional needs of each child.<p>During the day, kids set goals for themselves; work on their online courses; take part in enrichment activities such as art, music, and coding; and have plenty of time for free play and independent learning. Our centers are open until 5:30pm every day so families with working parents do not have to worry about arranging for after-school childcare. At the end of the day, our students go home without any homework to do or tests to study for. All academic work happens on-site with the support of the coach. When the family gets home, they can truly spend time together rather than nagging kids about doing homework.<p>We have a video showcasing some of our students, parents, and teachers: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Ujx_TAUP7uw\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Ujx_TAUP7uw</a><p>Getting feedback from parents is really critical and I would love to get your ideas on what makes for a great school experience for your children. And, if you have experienced some form of remote or online learning in the past (i.e, before or during COVID), I’d love to hear more about what you liked about it and what could have been better!<p>Thank you in advance!",
      "time": 1630246568,
      "title": "Launch HN: KaiPod Learning (YC S21) – A physical place for online schoolers",
      "type": "story"
    },
    {
      "by": "altilunium",
      "descendants": 1,
      "id": 28346867,
      "kids": [
        28346876
      ],
      "score": 1,
      "time": 1630246546,
      "title": "Show HN: RtnF2 – Yet Another Notetaking App",
      "type": "story",
      "url": "https://altilunium.github.io/rtnf2/"
    },
    {
      "by": "Bud",
      "descendants": 0,
      "id": 28346859,
      "score": 1,
      "time": 1630246502,
      "title": "UGA professor resigns mid-class after student refuses to wear mask",
      "type": "story",
      "url": "https://www.redandblack.com/uganews/uga-professor-resigns-mid-class-after-student-refuses-to-wear-mask/article_598ba244-077b-11ec-ba9b-cb3534ab07cc.html"
    },
    {
      "by": "drocer88",
      "descendants": 0,
      "id": 28346853,
      "score": 1,
      "time": 1630246456,
      "title": "Real Personal Income: Transfer Payments",
      "type": "story",
      "url": "https://www.calculatedriskblog.com/2021/08/real-personal-income-transfer-payments.html"
    },
    {
      "by": "arbobmehmood",
      "descendants": 0,
      "id": 28346826,
      "score": 1,
      "time": 1630246225,
      "title": "Show HN: Voicera – Add life-like AI voice dictation to your blogs and articles",
      "type": "story",
      "url": "https://www.voicera.co"
    },
    {
      "by": "hliyan",
      "descendants": 0,
      "id": 28346802,
      "score": 2,
      "time": 1630246006,
      "title": "Biophilic Design",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Biophilic_design"
    }
  ]
}