{
  "stories": [
    {
      "by": "karaokeyoga",
      "descendants": 0,
      "id": 30831485,
      "score": 1,
      "time": 1648481065,
      "title": "Majority in Japan backs nuclear power for first time since Fukushima",
      "type": "story",
      "url": "https://www.japantimes.co.jp/news/2022/03/28/national/nuke-power-poll/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30831480,
      "score": 1,
      "time": 1648481057,
      "title": "Changing critical code paths with scientist",
      "type": "story",
      "url": "https://world.hey.com/jorge/changing-critical-code-paths-with-scientist-a3becb84"
    },
    {
      "by": "garrettscott",
      "descendants": 0,
      "id": 30831470,
      "score": 1,
      "time": 1648481024,
      "title": "Show HN: Factle, Wordle but for Trivia",
      "type": "story",
      "url": "https://factle.app/"
    },
    {
      "by": "toinewx",
      "descendants": 1,
      "id": 30831466,
      "kids": [
        30831467
      ],
      "score": 1,
      "time": 1648481010,
      "title": "Josh Comeau – Secret Mechanisms of CSS",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Xt1Cw4qM3Ec"
    },
    {
      "by": "dangle1",
      "descendants": 0,
      "id": 30831449,
      "score": 2,
      "time": 1648480940,
      "title": "I Can Restore Star Trek Voyager and Deep Space Nine to HD, Why Can’t Paramount?",
      "type": "story",
      "url": "https://www.extremetech.com/extreme/333150-i-can-restore-star-trek-voyager-and-deep-space-nine-to-hd-so-why-cant-paramount"
    },
    {
      "by": "MKais",
      "descendants": 0,
      "id": 30831436,
      "score": 1,
      "time": 1648480871,
      "title": "Effects of different music on HEK293T cell growth and mitochondrial functions",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1550830722000027"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30831414,
      "score": 1,
      "time": 1648480792,
      "title": "An overview of the privacy risks associated with web federated identity",
      "type": "story",
      "url": "https://wicg.github.io/FedCM/"
    },
    {
      "by": "ShaunCammack",
      "descendants": 0,
      "id": 30831396,
      "score": 1,
      "text": "Hey HN!<p>I started a non-profit that&#x27;s spent the last year building a type of short news content that can supplement a normal, partisan news diet. It began as a tweet (https:&#x2F;&#x2F;twitter.com&#x2F;shaunjcammack&#x2F;status&#x2F;1298722815349149699?), which turned into a Substack, and now we have a small staff of researchers and writers working on the project. The goal is to help news consumers understand themselves and those they disagree with.<p>There&#x27;s usually a lot of (well deserved) suspicion out there about &quot;better news&quot; type initiatives, and so I want to be clear up front that (although we like to pop bubbles) we&#x27;re not trying to change anyone&#x27;s politics, we just want to lower the temperature.<p>As far as I can tell, our current news-media system is pretty bad. On the ground reporting has been replaced by armchair journalism, our viewpoint silos are occasionally penetrated by the worst of the other side, and the entire system seems to be in an escalating panic about <i>Those Bad People Over There.</i><p>This is obvious, but people of different political persuasions will look at the same event and immediately come to different conclusions, and often become agitated with folks on the other side of the issue. And when asked why others disagree on that issue, people usually give one of four answers: <i>They</i> think <i>that</i> because they&#x27;re either stupid, ignorant, brainwashed, or evil.<p>It&#x27;s probably not helpful to think that half the country is stupid, and it&#x27;s a recipe for really bad things to think that half the country is evil. So we&#x27;re trying to work on the better answer, which is that people with different priors and experiences can reasonably come to different conclusions. Maybe that also sounds obvious, but that&#x27;s a difficult thing to remember in the moment when we&#x27;re confronted with someone on the other side of a morally animating topic.<p>So what we&#x27;re building is a short, substantive piece of analysis that presents and examines the perspectives on either side of a given issue, and illustrate the underlying reasons for how people come to those conclusions. We aggregate the narratives from twitter (via our social media listening tool), and identify what either side is focusing on, how they&#x27;re interpreting new information, and how they&#x27;re reasoning. We write the summaries of either side <i>as though we believed it,</i> and discuss the differences.<p>We like to imagine a person on their lunch break, who only has a few minutes to investigate the news event that everyone is talking about. He scrolls through twitter, reads the opinions of people he tends to agree with, and then opens up our content to get a quick overview of the whole discourse. He goes back to work entrenched in his opinions, perhaps, but also with an understanding of why people disagree with him (and it&#x27;s not that they&#x27;re evil).<p>Here&#x27;s another example. There&#x27;s a mainstream conservative Aunt who watches Fox News. She has a progressive niece who watches left-leaning twitch streamers. They have a lot of difficulty discussing news, not just because they disagree, but because they don&#x27;t have any way of talking between their worldviews. They just end up messaging each other links to partisan articles (which is not a great way to have a conversation). So instead of this, the niece sends her aunt our content about the topic, which helps them both feel acknowledged and prompted to talk about productive parts of the disagreement (values, experiences, priors, etc.). They still disagree, but they don&#x27;t think each other are crazy or stupid.<p>We think this minimal understanding helps to alleviate the distress of the reader, helps them understand their own position and be acknowledged, and helps them humanize their opponent.<p>Here&#x27;s two examples of recent posts:<p>https:&#x2F;&#x2F;www.narrativesproject.com&#x2F;news&#x2F;why-cant-we-agree-on-the-nonexistence-of-biolabs-in-ukraine&#x2F;<p>https:&#x2F;&#x2F;www.narrativesproject.com&#x2F;news&#x2F;views-on-the-us-banning-russian-energy-imports&#x2F;<p>And here&#x27;s a recent Instagram version:<p>https:&#x2F;&#x2F;www.instagram.com&#x2F;p&#x2F;Cbh6kxhArKa&#x2F;<p>We&#x27;re also trying to experiment with formats that approach the problem totally differently, like comparisons of partisan headlines, deep dives into evergreen divisions, and extended thought experiments.<p>---<p>There&#x27;s other organizations and products out there that share our concern, such as AllSides, The Flip Side, Braver Angels, Ground News, etc. Here&#x27;s two reasons why we&#x27;re different.<p>First, the news aggregators operate on the idea that people should consume news from both the right and the left to understand a topic and see where other people are coming from. But this is pretty impractical for the average person. There&#x27;s just too many divisive stories and too few hours in the day. Also, I&#x27;m not sure that watching oppositional news wouldn&#x27;t just confirm your belief that the other side is awful.<p>Most other organizations and products construct their understanding of the discourse by looking at partisan news and opinion articles. This is grounded in assumption that narratives are the product of top-down influence. We&#x27;re grounded in the field of cultural evolution, and so we think narrative emerges from the interactions of individual agents sharing information, which is then picked up by the media and propagated. So we construct our understanding of the discourse by looking at conversations on Twitter through a social media listening tool (Meltwater), which gives us access to the full firehose.<p>---<p>We&#x27;ve learned a lot this year, but one of the biggest things we&#x27;ve figured out (through user testing) is that our design is not intuitive. Once users get what we&#x27;re doing, they see a lot value in it and want to share it, but there&#x27;s a gap that we need to bridge.<p>So at the moment, two of our biggest questions are: How can we design our product to be eminently accessible, obvious, and useful to the average media consumer? And how can we best compete within the incentives of our unhealthy media ecosystem?<p>And that&#x27;s why I&#x27;m showing this to you. What do you think? Does it make sense? Are there considerations I&#x27;m missing? Is there a different format that we should experiment with?",
      "time": 1648480706,
      "title": "Show HN: Narratives Project – A news product for peace",
      "type": "story"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30831387,
      "score": 1,
      "time": 1648480649,
      "title": "A Bold Idea to Stall the Climate Crisis–By Building Better Trees",
      "type": "story",
      "url": "https://www.wired.com/story/trees-carbon-capture-genes/"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 30831386,
      "score": 2,
      "time": 1648480649,
      "title": "‘This Game Is So Realistic It Feels Just Like Working Overtime’",
      "type": "story",
      "url": "https://www.sixthtone.com/news/1009982/this-game-is-so-realistic%21-it-feels-just-like-working-overtime"
    }
  ]
}