{
  "stories": [
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 28056536,
      "score": 3,
      "text": "5 years in and I never expected the job search to get more miserable as I gained more experience.<p>Everyone says the market is great right now and so I’ve begun looking again, but man the jobscape is depressing. I want to increase my pay (I have certain targets of mine), break out of stagnation, and by the grace of gods work on something I find interesting, but it’s just looking so grim. I’m seeing a lot of “senior” level roles mostly in areas I have no experience in. This might mean technologies &#x2F; languages &#x2F; working on software of scales that I just couldn’t get at my current company or past companies. This isn’t a matter of “I don’t fit all of the qualifications” more so “the only qualification I meet is general YoE”. To be blunt, I have little experience with modern technologies and what I do have is a little old to be relevant. I’ve never had direct interaction with any clouds&#x2F;cloud technologies and I’ve never had to do significant system design or work on any software at scale. Though I do a good bit of design work on my perpetually unfinished side projects. I don’t feel comfortable listing many skills on my resume as even the programming languages I’ve built my career on, I don’t feel I know that well, in account of the very little code I’ve written in a professional context. My resume in general feels rather bare, lacking education or a plethora of technologies&#x2F;programming languages I can confidently list.<p>I’ve begun categorizing jobs I see in my head into three categories<p>1) The jobs I could qualify for, but would continue my stagnation. These are pretty easy to spot, my prior experience is typically very relevant, I mostly would look good on paper and could pass the interviews, but they would at best be the same thing I have now, with marginally more pay. They are likely to be boring, and not actually push me any at all and I’d basically just get more tenure with little good experience to back it up. Could probably get a pay increase, but not near my target. If I begin to open up, the recruiters that contact me will almost certainly be from this group.<p>2) Jobs that seem mostly boring but would meet my pay targets and at the very least slow the stagnation. Not ideal, but would at least be better than what I’ve done in the past and set me up for more success down the line. Some of these pay quite well, but I would be unlikely to pass the interviews or even make it to one.<p>3) Jobs that look interesting, and also meet my goals for pay. There are really two groups within this. A) Jobs I would never qualify for regardless and B) Jobs that I could qualify for, but with substantial work and a healthy dose of luck. Note when I say qualify for here, I mostly mean on paper. A lot of these tend to be more niche as well, and almost always end up being actual senior level roles desiring domain experts, so I’m still likely out of luck even with some self development.<p>Interviews are another component. I could probably manage a “take home” type interview because of my ability to figure things out quickly (if I have the motivation), but save for that and the coveted but rare “talk about stuff” interviews. I’d flatline on nearly anything else. Particularly I would never pass a leetcode&#x2F;white boarding type interview and nowadays I’d probably fail most trivia&quot; interviews given the lack of depth of my experience.<p>OTOH, I don’t think I’m a complete idiot. I know a little about a lot and am confident in my abilities to ramp up quickly in the correct context. I spend a lot of time reading about all sorts of technologies and can talk my ass off about many things. It’s just that I lack sufficient depth in almost everything to look good on paper or perform in an interview or a senior level role.",
      "time": 1628044063,
      "title": "Ask HN: How to Break Career Stagnation?",
      "type": "story"
    },
    {
      "by": "Stratoscope",
      "descendants": 0,
      "id": 28056532,
      "score": 1,
      "time": 1628044023,
      "title": "LinkedIn decides to allow employees to work remotely for good",
      "type": "story",
      "url": "https://www.bizjournals.com/sanjose/news/2021/08/02/linked-in-permanent-remote-work.html"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28056526,
      "score": 2,
      "time": 1628043949,
      "title": "Where Do Models Go Wrong? Parameter-Space Saliency Maps for Explainability",
      "type": "story",
      "url": "https://arxiv.org/abs/2108.01335"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28056513,
      "score": 2,
      "time": 1628043727,
      "title": "Unvaccinated People Belong on the No-Fly List",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/08/unvaccinated-flight-vaccine-tsa-mandate/619643/"
    },
    {
      "by": "aminozuur",
      "descendants": 0,
      "id": 28056506,
      "score": 1,
      "time": 1628043652,
      "title": "Almost-Billionaires",
      "type": "story",
      "url": "http://lackingambition.com/?p=1464"
    },
    {
      "by": "fiesycal",
      "descendants": 0,
      "id": 28056474,
      "score": 1,
      "time": 1628043185,
      "title": "Show HN: ILTM – Paper trade memes like they're stocks based on their popularity",
      "type": "story",
      "url": "https://ilikethememe.com/"
    },
    {
      "by": "hoppyhoppy2",
      "descendants": 0,
      "id": 28056468,
      "score": 1,
      "time": 1628043132,
      "title": "The State Department and 3 other US agencies earn a D for cybersecurity",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/08/the-state-department-and-3-other-us-agencies-earn-a-d-for-cybersecurity/"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 28056467,
      "score": 2,
      "time": 1628043129,
      "title": "Watch the First Two Hours of MTV Ever Broadcast",
      "type": "story",
      "url": "https://nerdist.com/article/first-two-hours-of-mtv-broadcast-1981/"
    },
    {
      "by": "bohaJeho",
      "descendants": 0,
      "id": 28056461,
      "score": 1,
      "time": 1628043062,
      "title": "Žádný otázky ani VAše spamovy emailovy hračky",
      "type": "story",
      "url": "https://blog.cloudflare.com/health-check-analytics-and-how-you-can-use-it/"
    },
    {
      "by": "sbt567",
      "descendants": 0,
      "id": 28056459,
      "score": 1,
      "time": 1628043048,
      "title": "Polars v0.15.0: Fastest DataFrame library written in Rust",
      "type": "story",
      "url": "https://www.ritchievink.com/blog/2021/08/02/an-update-on-polars-v0.15.0/0.8.17/"
    }
  ]
}