{
  "stories": [
    {
      "by": "bionhoward",
      "descendants": 1,
      "id": 29416802,
      "kids": [
        29416803
      ],
      "score": 1,
      "time": 1638456568,
      "title": "A Prototype Neo Socratic Space+Time Trajectory Dialog",
      "type": "story",
      "url": "https://docs.google.com/document/d/1q8_34UzIaJXHtUy_K_sf2bHchNGMdogOW-Bmyr_GtqM/edit"
    },
    {
      "by": "brudgers",
      "descendants": 0,
      "id": 29416800,
      "score": 1,
      "time": 1638456565,
      "title": "Multiplayer Psychosis (2020)",
      "type": "story",
      "url": "https://www.sonyasupposedly.com/multiplayer-psychosis/"
    },
    {
      "by": "hackernj",
      "descendants": 0,
      "id": 29416798,
      "score": 1,
      "time": 1638456564,
      "title": "Maths researchers hail breakthrough in applications of artificial intelligence",
      "type": "story",
      "url": "https://phys.org/news/2021-12-maths-hail-breakthrough-applications-artificial.html"
    },
    {
      "by": "tonyatkc",
      "descendants": 0,
      "id": 29416785,
      "score": 1,
      "text": "Hi HN,<p>I&#x27;m Tony, and together with my friend Daniel, we created Stipop (<a href=\"https:&#x2F;&#x2F;developers.stipop.io\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.stipop.io</a>). We help app developers add stickers on chat, comment section, profiles, and live streams by providing an easy-to-install Sticker SDK with 150K+ stickers and a fully customizable UI.<p>This may sound silly and of course, it is, but did you know that stickers - the big, animated emojis you can send in chat - are sent 17x more than GIFs on Facebook Messenger? That’s almost 400 million times a day! Users, especially Gen Z and Millenials, love sending stickers to express themselves better and stay more connected online.<p>But the thing is, having stickers in your app can cost up to a million dollars because you’ll need a good 4~5 engineers to build the infrastructure, UI, search engine AND have a content team to sign contracts with hundreds of sticker artists, send payouts and make regular updates every month. We wanted to solve this problem.<p>We used to operate our own sticker app for iMessage. That&#x27;s when we first gathered all the artists and knowledge about the stickers. Now, after 4 years, we have 5,000 artists from 35 countries. We hit 200k users before we pivoted to B2B. Back then, we attended TC Disrupt, and many startups came to us asking if they could use our stickers. So we came back, released API, and got our first customers.<p>Now with Stipop, any app developer can install stickers in just a single day. Stipop SDK has a pre-built UI, so you don&#x27;t have to design anything by yourself. It also comes with two layouts: a sticker search engine to search for stickers with keywords and a library mode where users can browse and download stickers.<p>We found that stickers apply to many different app types too. For example, Fingo Africa (YC S21) is a neobank. They are adding stickers to their money-sending feature, so their users can soon send stickers to say thank you instead of just transferring money or send a relevant sticker like pizza to split bills after eating a pizza together. TripTime used stickers for user profile images. We are also on Microsoft Teams to help users search for stickers to send in chats, Blabla live-streaming chat, and soon to be on Canva to provide stickers for image editing and designs.<p>Our sticker end-users show a stable 40% 8-week retention and helped apps increase user engagement by up to 17%.<p>We provide the service for free and plan to turn freemium next year. We monetize by creating custom stickers for brands like Coca-Cola.<p>Please let me know if you have any questions, feedback, or ideas. Your thoughts would greatly help us improve the product!<p>You can also take a look at our demo video here: <a href=\"https:&#x2F;&#x2F;link.stipop.io&#x2F;3Epl9LI\" rel=\"nofollow\">https:&#x2F;&#x2F;link.stipop.io&#x2F;3Epl9LI</a><p>Thank you!",
      "time": 1638456506,
      "title": "Launch HN: Stipop (YC S21) – Improving user engagement with stickers",
      "type": "story"
    },
    {
      "by": "valentinacst",
      "descendants": 0,
      "id": 29416776,
      "score": 1,
      "time": 1638456483,
      "title": "How to Apply MLOps to Computer Vision? Introducing CVOps",
      "type": "story",
      "url": "https://www.picsellia.com/post/how-to-apply-mlops-to-computer-vision-cvops?utm_source=Hacker+News&utm_medium=Blog&utm_campaign=blog_CVOps"
    },
    {
      "by": "app4soft",
      "descendants": 0,
      "id": 29416753,
      "score": 1,
      "time": 1638456396,
      "title": "Epicenter: “Sorry, No Pudge”",
      "type": "story",
      "url": "https://twitter.com/epicentergg/status/1466352861168779266"
    },
    {
      "by": "angelolibero",
      "descendants": 2,
      "id": 29416728,
      "kids": [
        29416748,
        29416729
      ],
      "score": 1,
      "time": 1638456295,
      "title": "HyperTheme: Powerful visual theme editor for Chakra UI and ReactJS",
      "type": "story",
      "url": "https://www.hyperthe.me/"
    },
    {
      "by": "igeligel_dev",
      "descendants": 1,
      "id": 29416709,
      "kids": [
        29416715
      ],
      "score": 1,
      "time": 1638456225,
      "title": "Show HN: Getworkrecognized.com – Brag Documents the easy way",
      "type": "story",
      "url": "https://getworkrecognized.com/"
    },
    {
      "by": "Ambolia",
      "descendants": 0,
      "id": 29416697,
      "score": 1,
      "time": 1638456134,
      "title": "Trends in cardiology consultations for suspected myocarditis after Covid vaccine",
      "type": "story",
      "url": "https://link.springer.com/article/10.1007/s00392-021-01974-0"
    },
    {
      "by": "marzipanina",
      "descendants": 0,
      "id": 29416675,
      "score": 2,
      "time": 1638456036,
      "title": "A great tool to test your Figma prototypes for free",
      "type": "story",
      "url": "https://www.uxtweak.com/"
    }
  ]
}