{
  "stories": [
    {
      "by": "ethanpil",
      "descendants": 0,
      "id": 30277765,
      "score": 1,
      "time": 1644437375,
      "title": "“Unix is a junk operating system designed by a committee of PhDs.” -Dave Cutler",
      "type": "story",
      "url": "https://blog.codinghorror.com/showstopper/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30277739,
      "score": 1,
      "time": 1644437299,
      "title": "How to Make Nukadoko (Fermented Rice Bran Bed) for Pickling (2014)",
      "type": "story",
      "url": "https://www.gardenbetty.com/how-to-make-nukadoko-fermented-rice-bran-bed-for-pickling/"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 30277733,
      "score": 1,
      "time": 1644437283,
      "title": "Prototyping a small subset of Luau in Agda",
      "type": "story",
      "url": "https://github.com/Roblox/luau/pull/350"
    },
    {
      "by": "mcannizz",
      "descendants": 0,
      "id": 30277718,
      "score": 1,
      "text": "Hey HN, I’m Matt and I’m on the founding team at <a href=\"https:&#x2F;&#x2F;www.asserts.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;www.asserts.ai</a><p>We help teams use their Prometheus metrics to solve problems faster and remove the toil from their troubleshooting workflows. Everyone already uses dashboards and alerts, but these don’t scale well. Why not? The usual advice is to alert on symptoms but then you have to hunt for the cause of the problem by either sorting through lots of dashboards or writing PromQL queries. That gets tiresome when you’ve got a busy on-call rotation or a complex app.<p>Here’s what we do: you send us your Prometheus metrics and we scan them to build a map of your app and infrastructure. We continuously check your metrics for common problems like resource saturation, error spikes, and so forth (we have a library of health checks but you can write your own too in PromQL.) You also set up some service level objectives so we know what’s important to you. When something goes wrong, we show you both the symptoms of the problem and all the potential causes we detected on a timeline so you can easily connect the symptom to the cause.<p>To try us out, you set up a remote write of your metric data from your Prometheus to our hosted storage. This usually takes just a few lines of configuration and 5 minutes.<p>Are you happy with your team’s troubleshooting workflow? Your feedback and thoughts would be really helpful!",
      "time": 1644437227,
      "title": "Show HN: We’re helping teams do root cause analysis with Prometheus",
      "type": "story",
      "url": "https://www.asserts.ai/blog/announcing-asserts/"
    },
    {
      "by": "eezurr",
      "descendants": 1,
      "id": 30277713,
      "kids": [
        30277723
      ],
      "score": 2,
      "text": "Did you read an interesting novel or book last year? Please share them with us. Some of my favorites from 2021:<p>* East of Eden by John Steinbeck. Steinbeck beautifully captures and shares the culture of old America through the lives of two families that become interwoven over time.<p>* H is for Hawk by Helen Macdonald. Macdonald&#x27;s book is part auto-biography (dealing with depression), part biography on T. H. White (of Sword in the Stone&#x27;s fame), and lightly part guide  on caring for hawks.<p>* The Foundation Series by Isaac Asimov. This was actually a repeat read for me after 7+ years of my first read through. Two new foundations are created to save the milky way galaxy from 30,000 years of war and anarchy after the fall of the galactic empire. Their goal is to limit that period to 1,000 years.<p>This post is inspired from 2018: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17513576",
      "time": 1644437180,
      "title": "Ask HN: Great Books from your 2021 Reading List?",
      "type": "story"
    },
    {
      "by": "unclebucknasty",
      "descendants": 0,
      "id": 30277712,
      "score": 1,
      "time": 1644437177,
      "title": "Christian revival at school prompts student walkout in W.Va",
      "type": "story",
      "url": "https://abcnews.go.com/US/wireStory/christian-revival-school-prompts-student-walkout-wva-82765607"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30277707,
      "score": 1,
      "time": 1644437135,
      "title": "How the tech sector could move in One Direction (2016)",
      "type": "story",
      "url": "https://beyondtellerrand.com/events/berlin-2016/speakers/sacha-judd"
    },
    {
      "by": "cellsNFT",
      "descendants": 0,
      "id": 30277683,
      "score": 1,
      "time": 1644437026,
      "title": "Worst 3 words to start tomorrow's Wordle",
      "type": "story",
      "url": "https://twitter.com/jamesrothmann/status/1491494216459030530"
    },
    {
      "by": "daniel_dev",
      "descendants": 0,
      "id": 30277666,
      "score": 2,
      "time": 1644436952,
      "title": "How I Built My Own Rewards Card",
      "type": "story",
      "url": "https://community.marqeta.com/t5/engineering-blogs/how-i-built-my-own-rewards-card/ba-p/563"
    },
    {
      "by": "el_duderino",
      "descendants": 0,
      "id": 30277653,
      "score": 2,
      "time": 1644436899,
      "title": "Reddit rolls out a web version of Reddit Talk, its live audio produc",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/09/reddit-rolls-out-a-web-version-of-reddit-talk-its-live-audio-product/"
    }
  ]
}