{
  "stories": [
    {
      "by": "rich_sasha",
      "descendants": 0,
      "id": 27753984,
      "score": 1,
      "text": "When not using an ORM: how do you marry SQL with the main programming language of the application (be it web, or data science etc.)?<p>On the one hand, it feels right to abstract the SQL database access into some kind of centralised API - but that feels like reinventing an ORM. Of course the difference remains that the hand-written queries are more specific than what the ORM can produce, but still.<p>The alternative seems messy - there is one shared database, and different parts of the application manage their own little slice of it. If you then want to, say, join tables from different logical domains, are you at risk of your queries getting out of date as different parts of the application evolve?<p>What about creating tables and indices - do you do that as a centralised, &quot;format&quot; process, or do different parts of the application create them as and when? Or do you even do it by hand? Where do any such creation scripts live - a centralised bootstrap script, or again, dispersed throughout the application?<p>Do you hard-code queries as strings in the application, or do they live as separate files? How do you keep table creation and insert&#x2F;update queries in sync?<p>The context is, I&#x27;m setting up some SQL for a data-science-y project, that might lead to something bigger. I&#x27;m scraping various data sources and sticking them into a DB (SQLite for now), and I&#x27;m trying to think ahead, so as not to create one big ball of spaghetti.I&#x27;m trying to avoid using an ORM, to both better learn SQL, and after some critical comments found on the good old t&#x27;Internet.<p>All thoughts and ideas welcome - and thanks!",
      "time": 1625604252,
      "title": "Ask HN: How do you manage SQL code alongside application code?",
      "type": "story"
    },
    {
      "by": "filippofinke",
      "descendants": 0,
      "id": 27753978,
      "score": 1,
      "time": 1625604214,
      "title": "Show HN: Is the mcdonald's ice cream machine broken in Switzerland?",
      "type": "story",
      "url": "https://mcbroken.filippofinke.ch/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27753957,
      "score": 1,
      "time": 1625604103,
      "title": "Improving I/O efficiency and resilience",
      "type": "story",
      "url": "https://lists.dragonflybsd.org/pipermail/users/2021-June/404763.html"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 27753951,
      "score": 1,
      "time": 1625604043,
      "title": "Microsoft is working on game upscaling technology powered by AI",
      "type": "story",
      "url": "https://www.pcgamer.com/au/microsoft-is-working-on-game-upscaling-technology-powered-by-ai/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27753933,
      "score": 1,
      "time": 1625603976,
      "title": "Eviation Alice Electric Airplane to Make First Flight This Year",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-07-01/eviation-s-electric-alice-plane-to-make-first-flight-this-year"
    },
    null,
    null,
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27753918,
      "score": 1,
      "time": 1625603911,
      "title": "Engineered cells successfully treat cardiovascular and pulmonary disease",
      "type": "story",
      "url": "https://medicalxpress.com/news/2021-07-cells-successfully-cardiovascular-pulmonary-disease.html"
    },
    {
      "by": "mutaz",
      "descendants": 0,
      "id": 27753914,
      "score": 1,
      "time": 1625603889,
      "title": "Post-Patriotism",
      "type": "story",
      "url": "https://msaic.medium.com/patriotism-as-tribalism-fc981388aacd"
    },
    {
      "by": "tintinnabula",
      "descendants": 0,
      "id": 27753901,
      "score": 1,
      "time": 1625603771,
      "title": "Jam and Lewis Shaped Pop History. They’re Working on Its Future, Too",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/06/arts/music/jimmy-jam-terry-lewis.html"
    }
  ]
}