{
  "stories": [
    {
      "by": "areoform",
      "descendants": 0,
      "id": 31564102,
      "score": 1,
      "time": 1653948214,
      "title": "Is Jupiter a Failed Star?",
      "type": "story",
      "url": "https://twitter.com/1517fund/status/1531335409061470209"
    },
    {
      "by": "sampo",
      "descendants": 0,
      "id": 31564085,
      "score": 1,
      "time": 1653947971,
      "title": "Romanian ISP to introduce 1Gbps subscription for ~18USD (2013)",
      "type": "story",
      "url": "https://old.reddit.com/r/technology/comments/1nz2ig/romanian_isp_to_introduce_1gbps_subscription_for/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 31564072,
      "score": 1,
      "time": 1653947891,
      "title": "UserVision, the most powerful videogame cheating software ever",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ozOCwY3XrGs"
    },
    {
      "by": "montalbano",
      "descendants": 0,
      "id": 31564064,
      "score": 1,
      "time": 1653947800,
      "title": "Global Methane Tracker 2022",
      "type": "story",
      "url": "https://www.iea.org/reports/global-methane-tracker-2022/overview"
    },
    {
      "by": "dhanna",
      "descendants": 1,
      "id": 31564056,
      "kids": [
        31564065
      ],
      "score": 3,
      "text": "Hi internet,<p>I’m a Junior Software Engineer that’s currently attempting to dig myself out of a deep state of burnout, isolation, and frustration. I quit my job back in August without anything lined up due to crippling anxiety and depression. I’m intermittently searching for jobs and doing programming interview practice, but I’m really struggling.<p>I’m in a kind of stable place, living with my parents. But I’ve been heavily isolated since graduating school, especially due to Covid-19 social distancing. I have no friends, and going out and socializing on the weekends has been difficult. I have a girlfriend in Florida, but we’re too poor to see each other right now. I’ve spent most of my days laying in bed depressed, sometimes with an old textbook to enjoy&#x2F;skim&#x2F;index.<p>I’ve been dealing with mental health issues (loneliness, anxiety, depression, drug, and porn addiction) in some way or form for a decade now. I entered Carnegie Mellon University in 2011, with the intention of studying Computer Architecture. It took me eight years to finish my degree, mostly due to undiagnosed ADHD and its complications. It was completely illogical&#x2F;emotional, but everytime I stepped back onto campus, I wanted to continue studying Computer Systems. In retrospect, it was the only thing that motivated me to return to Pittsburgh and deal with the inevitable illness associated with it. I ended up getting stuck taking Introduction to Computer Architecture four times.<p>The cumulative negative emotion, knowledge gaps&#x2F;atrophy, and lack of relationships made it impossible to learn. I wasn’t recovering at home during my leaves of absences, and couldn’t maintain the focus to follow through on any side projects. Staying in Pittsburgh made me sick. I also developed cannabis use disorder from hanging out with my home town friends.<p>After my last internship at Google, I took even more time off to soul search&#x2F;figure things out in the Bay Area, where I had friends. I lived in a few Airbnb’s while working on my previous internship project before settling in Ocean Beach, San Francisco. I did find a job at a small self-driving car startup in Palo Alto, but I lost interest and motivation to work. I had a baseline of financial support from my family to live a little, so I ended up doing whatever I felt like doing in San Francisco. Which consisted of roaming around soul-searching in SF high as a kite until most of my friends despised me, and working on some verilog&#x2F;fpga projects while depressed and isolated in my room.<p>Eventually, I was reinspired by David Patterson (new Golden age and all that jazz!) to make growing into a Computer System Designer a long-term career goal. I was able to recover enough to go back and finish my degree at Carnegie Mellon. I left school with underdeveloped technical skills and a whole lot of trauma and anxiety. It then took me a year of interviewing, and relearning and before I landed a  job.<p>After quitting my job, I built a home technical library as a passion project and out of sheer loneliness and frustration. David Patterson recommended looking in old Computer Architecture textbooks for ideas, and I took that advice to the extreme. I bought several Ikea bookcases worth of old, classic, foundational books in Computer Science and Mathematics for months, with the goal of rebuilding my passion and expanding my interests to Artificial Intelligence, ML&#x2F;Deep Learning Systems, and Mathematics.<p>Building the library was one of the most fascinating things I’ve done in my career. Literally no one has the time or desire to do this, so I’ve managed to buy the only available copies of many of these texts. It helped satiate some of the unfulfilled intellectual curiosity I’ve had over the past decade, but didn’t appreciably build my technical skills like a proper project would. I really regret this aspect because I again wasted valuable time that I should have used to build skills that would feed myself.\nCont in comment.",
      "time": 1653947782,
      "title": "Ask HN: Depressed, suicidal after 10 years of ADHD burnout",
      "type": "story"
    },
    {
      "by": "1vuio0pswjnm7",
      "descendants": 0,
      "id": 31564048,
      "score": 1,
      "time": 1653947750,
      "title": "Trade Regulation Rule on Commercial Surveillance",
      "type": "story",
      "url": "https://www.reginfo.gov/public/do/eAgendaViewRule?pubId=202110&RIN=3084-AB69"
    },
    {
      "by": "oli5679",
      "descendants": 0,
      "id": 31564033,
      "score": 1,
      "time": 1653947629,
      "title": "Scaling Hypothesis",
      "type": "story",
      "url": "https://www.gwern.net/Scaling-hypothesis"
    },
    {
      "by": "donsupreme",
      "descendants": 0,
      "id": 31564026,
      "score": 1,
      "time": 1653947586,
      "title": "Asian Americans face longer periods of unemployment",
      "type": "story",
      "url": "https://www.cnbc.com/2022/05/30/asian-americans-face-long-unemployment-periods-other-labor-challenges.html"
    },
    {
      "by": "estevaoam",
      "descendants": 0,
      "id": 31564010,
      "score": 1,
      "text": "Hi HN!<p>I&#x27;m a developer who noticed that I haven&#x27;t done much experimentation lately. I decided I wanted to change that this year.<p>This month I built a simple resume builder with the main goal of practicing front-end development, and to scratch an itch I had when updating my resume. :)<p>After it was functional enough, I casually shared with some friends to express my enjoyment of crafting something just for the sake of having some fun. To my surprise they ended up asking how they could send to others. So I went one step further, due to my pure excitement, and hosted it on Netlify to make publicly available.<p>In case you&#x27;re curious, I used the React component library Mantine[1] in this project. I loved it, so I definitely recommend to check it out for your next React project.<p>Have thoughts to share? I would love to know! :)<p>If you&#x27;re postponing starting that project you have been thinking of, just do it. Right now. Just create a new dir, load up your framework of choice and start it, even a couple of lines are enough to get you started. We should never forget that to play around is awesome.<p>--<p>[1] <a href=\"https:&#x2F;&#x2F;mantine.dev\" rel=\"nofollow\">https:&#x2F;&#x2F;mantine.dev</a>",
      "time": 1653947459,
      "title": "Show HN: Resumecreator.io – I built a simple resume builder",
      "type": "story",
      "url": "https://resumecreator.io"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 31564003,
      "score": 1,
      "time": 1653947423,
      "title": "The Hard Problem of Consciousness: Some Distinctions Between “How” and “Why”",
      "type": "story",
      "url": "http://paulaustinmurphypam.blogspot.com/2020/02/the-hard-problem-of-consciousness-some.html"
    }
  ]
}