{
  "stories": [
    {
      "by": "mconigliaro",
      "descendants": 0,
      "id": 32139985,
      "score": 1,
      "text": "Awesome authentication tool for connecting command line applications to SAML identity and service providers",
      "time": 1658160924,
      "title": "Show HN: Authum – command-line SAML authentication tool",
      "type": "story",
      "url": "https://github.com/CirrusMD/authum"
    },
    {
      "by": "andyjohnson0",
      "descendants": 0,
      "id": 32139982,
      "score": 1,
      "time": 1658160902,
      "title": "The Minstry for the Future: Chapter One",
      "type": "story",
      "url": "https://www.orbitbooks.net/orbit-excerpts/the-ministry-for-the-future/"
    },
    {
      "by": "ldlework",
      "descendants": 1,
      "id": 32139977,
      "kids": [
        32139978
      ],
      "score": 1,
      "time": 1658160886,
      "title": "The Gigerian Farce (DALL-E 2)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=UqVOQj4lTq0"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32139973,
      "score": 1,
      "time": 1658160860,
      "title": "Designing an ML-family language on top of TypeScript: import and export syntax",
      "type": "story",
      "url": "https://derw.substack.com/p/designing-an-ml-family-language-on"
    },
    {
      "by": "sunboom",
      "descendants": 0,
      "id": 32139971,
      "score": 1,
      "time": 1658160852,
      "title": "Global Income Coin",
      "type": "story",
      "url": "https://www.globalincomecoin.com/?newsletter=true"
    },
    {
      "by": "0x54MUR41",
      "descendants": 0,
      "id": 32139955,
      "score": 1,
      "time": 1658160738,
      "title": "Resolving conflicts between designers and engineers",
      "type": "story",
      "url": "https://www.smashingmagazine.com/2022/07/resolving-conflicts-designers-engineers/"
    },
    {
      "by": "cgb223",
      "descendants": 0,
      "id": 32139934,
      "score": 2,
      "text": "My schedule currently only allows me time to workout after 5 PM due to life commitments and work.<p>I choose to go to workout classes because I make friends, and it pushes me much harder than I would push myself, and I see benefit in those things.<p>That said, last night like most nights I do this I couldnt fall asleep until the sun came up, despite going to bed at 11 PM.<p>I&#x27;m kind of running out of ideas so I figure I&#x27;ll ask here, if only because we all tend to be weird in the same ways on this forum.<p>I have tried everything:<p>* Chamomile tea<p>* No screens in the bedroom<p>* Snack before bed (this helps probably the most if not inconsistently)<p>* Meditation before bed<p>* Stretching<p>* Melatonin 30 minutes before desired bed time (this one also helps maybe 40% of the time)<p>* THC (get <i>very</i> stuck in my head, does not work at all)<p>* No&#x2F;dim lights in house to trigger sleep hormone production<p>* Progressive relaxation<p>* Warm shower before bed (wakes me up)<p>* Cold shower before bed (WAKES me up inside)<p>* No caffeine after noon<p>* No caffeine at all (Makes me a terrible person to others)<p>I&#x27;m out of ideas. I&#x27;m literally giving myself insomnia with these workouts. Its almost like I cant gear down, and want to keep being productive and am running on some kind of adrenaline &#x2F; cortisol diesel mix that I cant get out of my system.<p>Has anyone found anything that works for them?",
      "time": 1658160622,
      "title": "Ask HN: How to get to sleep after an evening workout?",
      "type": "story"
    },
    {
      "by": "chasebrignac",
      "descendants": 0,
      "id": 32139918,
      "score": 1,
      "text": "Chase here - our mission is to build an open source AI company focused on developing products for enterprises. The repo is at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;humanishai\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;humanishai</a> (please take a moment to star!) and our home page is <a href=\"https:&#x2F;&#x2F;beta.humanish.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.humanish.ai</a><p>After a decade of working at several labs and companies including NASA and Target, I originally quit my job to start a generative media company at YC. We didn’t manage to solve that problem, but we learned how hungry people are to use the biggest AI models.<p>However, when we signed up for access we were put on a waitlist, it bothered us how we needed to send our users data to third parties and get approval before launching our product. Waiting weeks or even months for access felt exclusive if we could get access at all to the big models, and it felt wrong from a privacy perspective. AI should be accessible to anyone. We designed Humanish AI to solve these problems.<p>We made Humanish AI with a set of features that can be extended easily. All of the code will be open source. And all of the models will be too. There is a Discord server where we will train models together with the Open Source community. We&#x27;ll post on Twitter and Instagram. Anyone can help out training, adding features, or making suggestions on Github rather than being excluded. I am personally stoked to read every single one of your suggestions and reply myself!<p>You can have source code access to every part of the process from data collection and cleaning, to training and infrastructure, to backend and frontend, to challenger&#x2F;champion deployment systems, and we are building a cloud version you can sign up for too. That means our plan is to have the best parts of the 3rd party deep learning model providers but are more privacy and developer friendly.<p>We’re thinking of adding features around many more modalities, so please let us know what you would find useful for an enterprise you know.<p>We are platform and language agnostic, with a very simple setup. If you want Python, we give you a library. For anything else, there’s a REST API you can signup for to get early access <a href=\"https:&#x2F;&#x2F;beta.humanish.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.humanish.ai</a> The repos have instructions for AWS, Terraform, or Docker.<p>We’ve launched this repo under MIT license so any developer can use the tools. The goal is to not charge individual developers. We make money by charging a license fee for things like multiple users, user permissions, training or fine tuning custom models, providing a hosted version, support, and any new features or models an enterprise needs.<p>Give us suggestions for your enterprise: github.com&#x2F;humanishai Leave a star! Is there something you want? Make a suggestion in Github discussions or make a PR and I&#x27;ll personally merge it in. For any new paid feature, to help us out, or for investment reach out to sales at contact@humanish.ai",
      "time": 1658160552,
      "title": "Show HN: Humanish AI – open-source Version of OpenAI",
      "type": "story",
      "url": "https://beta.humanish.ai"
    },
    {
      "by": "c-forster",
      "descendants": 0,
      "id": 32139910,
      "score": 1,
      "time": 1658160511,
      "title": "Are Large Language Models Operationalizations of Saussurean Structure?",
      "type": "story",
      "url": "https://c-forster.github.io/2022/07/on-words/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32139908,
      "score": 1,
      "time": 1658160506,
      "title": "Open Source Monthly: July 2022 Edition",
      "type": "story",
      "url": "https://github.blog/2022-07-18-open-source-monthly-july-2022-edition/"
    }
  ]
}