{
  "stories": [
    {
      "by": "edent",
      "descendants": 0,
      "id": 31630680,
      "score": 1,
      "time": 1654434839,
      "title": "Standards, Semantics, & Sequential Art",
      "type": "story",
      "url": "https://digitalcomics.co/index.html"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 31630679,
      "score": 1,
      "time": 1654434837,
      "title": "A Cancer Trial’s Unexpected Result: Remission in Every Patient",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/05/health/rectal-cancer-checkpoint-inhibitor.html"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31630676,
      "score": 1,
      "time": 1654434819,
      "title": "The Philistines Were Likely of Greek Origin, According to DNA",
      "type": "story",
      "url": "https://greekreporter.com/2022/05/18/philistines-greek/"
    },
    {
      "by": "nabla9",
      "descendants": 0,
      "id": 31630647,
      "score": 1,
      "time": 1654434519,
      "title": "Wonking Out: How Low Must Inflation Go?",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/03/opinion/inflation-federal-reserve.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31630637,
      "score": 1,
      "time": 1654434393,
      "title": "Bad history – the Treaty of Versailles is an imperfect guide to Russia relations",
      "type": "story",
      "url": "https://engelsbergideas.com/notebook/bad-history-why-the-treaty-of-versailles-is-an-imperfect-guide-to-future-russia-west-relations/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31630636,
      "score": 1,
      "time": 1654434391,
      "title": "Is deepmind's Gato the first AGI?",
      "type": "story",
      "url": "https://venturebeat.com/2022/06/04/is-deepminds-gato-the-worlds-first-agi/"
    },
    {
      "by": "aruanavekar",
      "descendants": 0,
      "id": 31630630,
      "score": 1,
      "text": "Being influencer is putting captive stories out there and connecting. Entrepreneurs have the grind and hard work but often fail to put a good story. If you have choice what would you chose for legacy - Build Something or Grow a Following",
      "time": 1654434354,
      "title": "Ask HN: Would you prefer to grind as an entrepreneur or influencer?",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31630621,
      "score": 1,
      "time": 1654434203,
      "title": "Bogon Filtering",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bogon_filtering"
    },
    {
      "by": "cswenshuo",
      "descendants": 0,
      "id": 31630610,
      "score": 1,
      "text": "In 2019, I experienced eye soreness and back pain for a while because I was constantly working long hours in front of my 16 inch Macbook without any rest.<p>I decided to do something to change that. I’m not a fan of Apple Watch or smartbands. So the first thing I did was looking for some reminder software to remind me to take a break in the App Store, but none of them were smart enough for my needs. I wish the software could automatically tell if I was working, rather than requiring me to manually set an alarm. At the same time, when I go to the bathroom or drink coffee, it can automatically increase the time I can continue to work afterward.<p>So I created Eye Monitor. Eye Monitor is an automatic reminder tool. It judges whether you are using the computer through the use of the mouse and keyboard.  (which means when a user is watching Youtube videos, Eye Monitor will consider it as not using computer. I haven&#x27;t found a solution yet.) Whenever you use it continuously, your fatigue value will increase, and after a period of rest, your fatigue value will decrease automatically. When your fatigue value reaches the threshold you set, it will trigger a reminder (including the dock icon, status bar, notification, full-screen pop-up window, etc.).<p>After a year of iteration, Eye monitor now has a chart to show your usage of the day. And users now  can customize the fatigue threshold, rest duration, reminder interval, reminder style, etc., and even customize the text of the notification (My customized notification text is “All work and no play makes Jack a dull boy”) or upload your favorite picture as the wallpaper of the full-screen pop-up window.(Not so useful, but I like it.)<p>I like to set the reminder interval very small, like 1 minute, so that when I turn off the reminder, 1 minute later the reminder will reappear again and I will decide to take a break.<p>This software is like a bit of a nagging mom, taking the trouble to remind you to rest. I hope you will like it. Here is the App Store URL: [https:&#x2F;&#x2F;apps.apple.com&#x2F;cn&#x2F;app&#x2F;eye-monitor&#x2F;id1527031341?l=en&amp;mt=12](https:&#x2F;&#x2F;apps.apple.com&#x2F;cn&#x2F;app&#x2F;eye-monitor&#x2F;id1527031341?l=en&amp;mt=12)",
      "time": 1654434102,
      "title": "Show HN: To prevent dry eyes and back pain, I create a macOS app",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31630609,
      "score": 1,
      "time": 1654434102,
      "title": "I Built a Ruby Parser",
      "type": "story",
      "url": "https://mpov.timmorgan.org/i-built-a-ruby-parser/"
    }
  ]
}