{
  "stories": [
    {
      "by": "ak_111",
      "descendants": 0,
      "id": 31132610,
      "score": 1,
      "text": "I tried hard to understand the space and some of the ways in which the technology works, but after many hours of investment I am still unable to alleviate my scepticism that this entire space is vapourware, there is nothing here more than you can get with traditional database technology?<p>At the same time, the amount of coverage and attention it is getting and for a sustained period makes me believe I am missing something.<p>After all there is very few instances of technology fads that have sustained such serious interest for a prolonged period of time. I am talking committees formed in parliaments and central banks to discuss its benefits, serious universities dedicating whole programs on the subject, elite investors pouring money into its potential, and the list goes on.<p>So far the most charitable explanation I could come up with for the craze is that it is an effective rebranding for marketing purposes of database technologies, similar to how &quot;data science&quot; rebranded statistics and business analytics.<p>Where am I going wrong? I am particularly keen to hear from people who underwent the journey from skeptics to believers in the space.",
      "time": 1650705533,
      "title": "Ask HN: Am I going insane or is there genuinely no value in blockchain tech?",
      "type": "story"
    },
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 31132608,
      "score": 1,
      "time": 1650705510,
      "title": "Darien Scheme",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Darien_scheme"
    },
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 31132600,
      "score": 1,
      "time": 1650705378,
      "title": "Why Are American Homes So Big? (2019)",
      "type": "story",
      "url": "https://www.theatlantic.com/family/archive/2019/09/american-houses-big/597811/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31132596,
      "score": 2,
      "time": 1650705176,
      "title": "Shows active air-raid sirens in Ukraine using a Raspberry Pi Zero",
      "type": "story",
      "url": "https://github.com/dr-mod/air-raid-monitor"
    },
    {
      "by": "TekMol",
      "descendants": 0,
      "id": 31132557,
      "score": 1,
      "text": "When I write code and have a question about - say - Python, I go to IRC in the Python channel and ask.<p>The experience is crazy good. Lot&#x27;s of helpful (even though socially unapt) people who know Python in and out.<p>But I rarely read anything about IRC anywhere these days. Is there something new that offers the same functionlity?<p>I know many people use StackOverflow. But IRC is so much nicer, as you can have an instant conversation.",
      "time": 1650704421,
      "title": "Ask HN: Is there something as good / better as IRC for programming questions?",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31132554,
      "score": 1,
      "time": 1650704358,
      "title": "Dingoes further from dogs than initially thought – study",
      "type": "story",
      "url": "https://www.dw.com/en/dingoes-further-from-dogs-than-initially-thought-study/a-61566314"
    },
    {
      "by": "intothemild",
      "descendants": 1,
      "id": 31132534,
      "kids": [
        31132543
      ],
      "score": 1,
      "time": 1650704086,
      "title": "NvChad is planning to remove custom configs",
      "type": "story",
      "url": "https://github.com/NvChad/NvChad/issues/922"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 31132530,
      "score": 1,
      "time": 1650703979,
      "title": "This week in KDE: Major accent color and Global Theme improvements",
      "type": "story",
      "url": "https://pointieststick.com/2022/04/22/this-week-in-kde-major-accent-color-and-global-theme-improvements/"
    },
    {
      "by": "damir",
      "descendants": 2,
      "id": 31132507,
      "kids": [
        31132588
      ],
      "score": 2,
      "text": "You&#x27;ve heard about Peter Cooper, right? The guy running various programming language newsletters (rubyweekly, javascriptweekly, etc.)<p>Well, I&#x27;ve been trying to &quot;knock off&quot; his style of landing page for the longest time - responsive cell-phone image as a background with responsive iframe inside, but never could get the background cell-phone to behave just right. (yeah, my CSS-fu isn&#x27;t the strongest, I know...)<p>Until now...<p>What I just realized, after god know how many years, is his mobile-phone background images aren&#x27;t images at all...<p>They&#x27;re made with CSS!<p>Peter, if you&#x27;re reading this, my hat&#x27;s off to you! Your &quot;hack&quot; just made my day! Thank you.",
      "time": 1650703584,
      "title": "Tell HN: Peter Cooper's genius mobile-phone background image hack",
      "type": "story"
    },
    {
      "by": "enyichi",
      "descendants": 0,
      "id": 31132493,
      "score": 2,
      "time": 1650703326,
      "title": "Mastering CSS Transitions with React 18",
      "type": "story",
      "url": "https://blog.openreplay.com/mastering-css-transitions-with-react-18/"
    }
  ]
}