{
  "stories": [
    {
      "by": "smusamashah",
      "descendants": 0,
      "id": 31438436,
      "score": 1,
      "time": 1652985657,
      "title": "About government and state-affiliated media account labels on Twitter",
      "type": "story",
      "url": "https://help.twitter.com/en/rules-and-policies/state-affiliated"
    },
    {
      "by": "willowwonder45",
      "descendants": 0,
      "id": 31438432,
      "score": 1,
      "time": 1652985626,
      "title": "Edge Browser AI Improve All Web Images",
      "type": "story",
      "url": "https://www.searchenginejournal.com/edge-browser-will-ai-improve-all-web-images/450350/"
    },
    {
      "by": "100011_100001",
      "descendants": 0,
      "id": 31438426,
      "score": 2,
      "text": "I&#x27;m a 10x developer and I hate it. If you consider yourself a &quot;top&quot; developer I would appreciate your perspective.<p>It didn&#x27;t start this way. I became a Jr Dev at 33 years old, people consistently assumed I was more experienced than I was. I&#x27;m not sure if it was my life experience or my relentless pursuit of self-improvement but I have been continuously improving my capabilities.<p>Around the time I turned 38 years old I felt competent. My code started to become defect proof. The drawback was it took me an extra 20% more time to complete. The Product Owner used to say to me, &quot;I know it will take you an extra two days to a week to complete something, but then I never have to worry about it again&quot;. So, solid code, but kind of slow in comparison.<p>I&#x27;m now 42 years old, my code continues to have minimal amount of defects, but I complete stories fast, and I&#x27;m not working crazy hours, just the standard 8-5. Of course I&#x27;m involved in a lot more meetings nowadays, architectural discussions, bleeding edge Proof of Concepts etc, however that has not slowed me down. It has made me faster.<p>I never set out to become some kind of uber developer, but in the last couple of years I have noticed a shift in behaviors around me. It started with little things. Tech Leads inviting me into meetings to express my perspective on things. Developers pinging me when I have never worked with them, because &quot;you probably know the answer&quot;. Being asked to weigh in specific Code Reviews outside my department. Lately if I join a meeting with people I haven&#x27;t talked to before they already know who I am. Even my manager has started introducing me by just saying &quot;This is X, you&#x27;ve probably heard of him&quot;.<p>Someone run a query to see the number of git commits by user for the application group I am in, about 350 developers. A script I wrote that performs various automation tasks was number 1, I was number 2. This surprised me, and it was an event that brought some of my thoughts and feelings into focus, thus this lengthy post.<p>I don&#x27;t think that the number of git commits actually proves anything, other than I commit, code review, and merge code frequently. I wanted a better metric to quantify my feelings of alienation. I looked at Jira stories and story points. In my direct team of 10 people, myself included, I have completed 71% of all story points in 2022, the other 9 are responsible for the other 29%. That jives with my number of git commits compared to others as well.<p>So what&#x27;s the point of this thread? It&#x27;s not to brag, if I came across that way, I apologize. The problem I&#x27;m having is it&#x27;s lonely and stressful.<p>This feeling of loneliness got quantified when the commit number came up. The problem is people just accept whatever I say. I used to get challenged in some of my decisions, which I always appreciated since I could create better solutions. Nowadays people just accept whatever I say as the best way.<p>It feels like I don&#x27;t have peers. I&#x27;m solely dragging my entire team and everyone else around me with me for the ride. This leads to stress, it feels that if I am not working on the &quot;thing&quot; it won&#x27;t get completed.<p>I worry that by not being challenged I will become complacent.<p>I catch myself becoming more controlling because at this point about 80% of the code base is my code for the applications my team is responsible for. I don&#x27;t think that&#x27;s a good thing, at the same time what I find plainly obvious is not to others.<p>The worst part is I am sensing within myself this frustration that everyone else appears to move so slowly. The thought of &quot;great, one more thing I got to fix&quot; is coming up too frequently.<p>To summarize, I&#x27;m a pretty good developer. I love writing code. However I feel alone, and I&#x27;m afraid I will become conceited of my own abilities. If you can empathize with this I would appreciate your perspective. Am I the only person feeling this way? What can I do to change  things?",
      "time": 1652985580,
      "title": "The Loneliness of a 10x Developer",
      "type": "story"
    },
    {
      "by": "sogen",
      "descendants": 0,
      "id": 31438423,
      "score": 1,
      "time": 1652985550,
      "title": "Netflix customers canceling service increasingly includes long-term subscribers",
      "type": "story",
      "url": "https://9to5mac.com/2022/05/18/netflix-long-term-subscribers-canceling-service-increased/"
    },
    {
      "by": "luismedel",
      "descendants": 0,
      "id": 31438415,
      "score": 1,
      "time": 1652985501,
      "title": "The Hare Programming Language",
      "type": "story",
      "url": "https://harelang.org/"
    },
    {
      "by": "stopachka",
      "descendants": 0,
      "id": 31438385,
      "score": 2,
      "time": 1652985378,
      "title": "Why Do Computers Stop and What Can Be Done About It? (1985) [pdf]",
      "type": "story",
      "url": "https://www.hpl.hp.com/techreports/tandem/TR-85.7.pdf"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 31438378,
      "score": 2,
      "time": 1652985318,
      "title": "Congress approves a $40B military and economic aid for Ukraine",
      "type": "story",
      "url": "https://apnews.com/article/russia-ukraine-biden-government-and-politics-economy-a8db447928bb5e3f0609d553252531b8"
    },
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 31438349,
      "score": 1,
      "time": 1652985173,
      "title": "The Ungated Manifesto: The Pattern, and the Battle for the Soul of the Internet",
      "type": "story",
      "url": "https://ungated.media/manifesto/"
    },
    {
      "by": "noobrunner",
      "descendants": 0,
      "id": 31438311,
      "score": 2,
      "text": "Obviously, if you believe there will be one in the next 3-6 months! \nMy question is for someone in tech, but of course, please feel free to chime in even if you are not in tech<p>1. What are the obvious Dos and Don&#x27;ts?\n2. Were you around during the last one? How did you survive it &#x2F; What got you through it?\n3. What did you learn from the last one? Any dumb mistakes you made last time that you wish you didn&#x27;t? What are some of the common mistakes people make?",
      "time": 1652984956,
      "title": "Ask HN: How are you preparing for the recession?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31438303,
      "score": 3,
      "time": 1652984901,
      "title": "Case insensitive string comparisons in C",
      "type": "story",
      "url": "https://daniel.haxx.se/blog/2022/05/19/case-insensitive-string-comparisons-in-c/"
    }
  ]
}