{
  "stories": [
    {
      "by": "kaladin-jasnah",
      "descendants": 0,
      "id": 29894397,
      "score": 1,
      "time": 1641921538,
      "title": "Google employee explicitly calls out iMessage for lock-in and bullying",
      "type": "story",
      "url": "https://twitter.com/lockheimer/status/1479865157753147395"
    },
    {
      "by": "Koshkin",
      "descendants": 0,
      "id": 29894396,
      "score": 1,
      "time": 1641921531,
      "title": "Math Problems Involving Food",
      "type": "story",
      "url": "http://blog.computationalcomplexity.org/2022/01/math-problems-involving-food.html"
    },
    {
      "by": "Panos",
      "descendants": 0,
      "id": 29894388,
      "score": 1,
      "time": 1641921519,
      "title": "Pricing Homes Like Agents Do: “Human-in-Charge AI” for Pricing Using Comparables",
      "type": "story",
      "url": "https://medium.com/compass-true-north/pricing-homes-like-agents-do-ai-for-real-estate-cma-adjustments-c3de27a7ef"
    },
    {
      "by": "3np",
      "descendants": 0,
      "id": 29894370,
      "kids": [
        29894418
      ],
      "score": 2,
      "time": 1641921447,
      "title": "Ultimate-chromium: mysterious ungoogled-chromium patch appears on AUR",
      "type": "story",
      "url": "https://aur.archlinux.org/packages/ultimate-chromium"
    },
    {
      "by": "kirstenlloyd",
      "descendants": 0,
      "id": 29894362,
      "score": 1,
      "time": 1641921408,
      "title": "AI at the Edge",
      "type": "story",
      "url": "https://www.modzy.com/blog/ai-at-the-edge/"
    },
    {
      "by": "crystaldecanter",
      "descendants": 0,
      "id": 29894334,
      "score": 1,
      "time": 1641921305,
      "title": "Amish Hackers",
      "type": "story",
      "url": "https://kk.org/"
    },
    {
      "by": "2pEXgD0fZ5cF",
      "descendants": 0,
      "id": 29894320,
      "score": 1,
      "time": 1641921254,
      "title": "The encrypted threat: Bitcoin’s social cost and regulatory responses",
      "type": "story",
      "url": "https://www.suerf.org/policynotes/38771/the-encrypted-threat-bitcoins-social-cost-and-regulatory-responses"
    },
    {
      "by": "geojacobm6",
      "descendants": 0,
      "id": 29894319,
      "score": 1,
      "text": "Let&#x27;s ask some questions of yourself before we begin.\n1. Are you the same person looking into stackoverflow.com when you are stuck somewhere or ready to help someone on your free time.<p>2. Why would someone help you with answers without any benefit, as they might have spent hours to solve the same problem which you have faced. Have you ever thought about these?<p>Stack Overflow Benefits<p>There are lot of direct benefits by using stackoverflow.com. Those are well visible on the portal as:<p>QnA thread<p>Jobs<p>Teams<p>Collectives<p>Learnings<p>Reputations<p>Badges etc.<p>But do you see the possibility of using your stackoverflow.com profile from a marketing view point?<p>Right, let&#x27;s come to the real part.<p>There are numerous possibilities for developers to make money online, some of them are:<p>Affiliate Marketing<p>Blogging<p>Info Products<p>Micro Startups<p>Freelancing<p>Online courses etc.<p>All these are good, but Freelancing is one of the great opportunities. But the main problem is where&#x2F;how to find the clients? And now that is solved by lots of freelancing portals such as:<p>Upwork<p>Freelancer<p>Codementor<p>Toptal<p>PeoplePerHour etc.<p>Now the biggest problem is how will you get the projects which are listed on those freelancing platforms. People think that, as a beginner to the freelancing world it is difficult to get their first project. But indeed it is not if you are moving on the right path. There are a lot of tactics to get your first project; one of them is, using stackoverflow.com profiles to market yourself while submitting your proposals. This is literally a successful approach from my experience.<p>Let&#x27;s Have A Closer Look\nIn the past, I started my career around 2013, and I was very active on stackoverflow.com at the end of 2014 or early 2015 time frame. Soon I became addicted to it and kept searching for my favorite tag &quot;django&quot;and trying to answer all the questions daily. It really helped me to increase my knowledge as a developer, and it went well for a period of time. As an added advantage, I also earned 1000+ reputations there within a short span.<p>Then around 2 years later, I thought about making some extra income while working, and started exploring freelancing opportunities. So I have opened an account on Upwork and started applying to projects. But I understand that no one will look into my profile, as I&#x27;m saying, I have only 2.5 years of experience even though I&#x27;m confident to fulfil my clients requirements (I used to always submit proposals for building an application from scratch). A few days passed like that, and then I realized no one would trust me until they saw my work or how passionate I was. So I started putting my stackoverflow.com profile link on the cover letter and started submitting the proposals. Suddenly I started seeing some good results. I&#x27;m getting invitations to interview and finally end up winning my first project. This approach I have continued for quite some time, until I get enough reviews from my clients on Upwork..<p>Note: Once you have enough good reviews from clients, it&#x27;s much easier to get the new projects.",
      "time": 1641921247,
      "title": "Long term benefits on being active on Stack Overflow",
      "type": "story"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 29894317,
      "score": 2,
      "time": 1641921236,
      "title": "Evolution ‘Landscapes’ Predict What’s Next for Covid Virus",
      "type": "story",
      "url": "https://www.quantamagazine.org/evolution-landscapes-predict-whats-next-for-covid-virus-20220111/"
    },
    {
      "by": "ksec",
      "descendants": 1,
      "id": 29894300,
      "kids": [
        29894414
      ],
      "score": 4,
      "time": 1641921171,
      "title": "The Optional Chaining Operator, “Modern” Browsers, and My Mom",
      "type": "story",
      "url": "https://blog.jim-nielsen.com/2022/a-web-for-all/"
    }
  ]
}