{
  "stories": [
    {
      "by": "HR01",
      "descendants": 0,
      "id": 29240965,
      "score": 1,
      "time": 1637073307,
      "title": "Toilet history after the nomad era",
      "type": "story",
      "url": "https://daily.jstor.org/the-early-history-of-human-excreta/"
    },
    {
      "by": "mrtedbear",
      "descendants": 0,
      "id": 29240958,
      "score": 1,
      "time": 1637073283,
      "title": "Redefine Meat brings 3D printed vegan cuts to restaurants",
      "type": "story",
      "url": "https://www.ft.com/content/4fac5958-0ce9-482b-b5d1-e09aa764e489"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29240952,
      "score": 2,
      "time": 1637073248,
      "title": "I will pay you cash to delete your NPM module",
      "type": "story",
      "url": "https://drewdevault.com/2021/11/16/Cash-for-leftpad.html"
    },
    {
      "by": "foolinaround",
      "descendants": 0,
      "id": 29240950,
      "score": 1,
      "text": "Some employers (in financial sector in East Coast) have sent out emails (marked as confidential) mandating vaccines, allowing for religious&#x2F;medical exemptions, and failing which &quot;your employment at &lt;Xxx&gt; will end by voluntary resignation&quot; (newspeak!)<p>There is no criteria on how they would adjudicate the applications for accomodation.<p>my position is completely WFH!<p>Does any employer here hire without the need for employees to be vaccinated?\nAny special job boards?<p>TIA!",
      "time": 1637073234,
      "title": "Searching for jobs with employees not mandating vaccines for their employees?",
      "type": "story"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 29240935,
      "score": 1,
      "time": 1637073120,
      "title": "Explain Yourself – A Primer on ML Interpretability and Explainability",
      "type": "story",
      "url": "https://thegradient.pub/explain-yourself/"
    },
    {
      "by": "Jefro118",
      "descendants": 0,
      "id": 29240933,
      "score": 1,
      "text": "Hi folks,<p>I&#x27;ve built a tool to quickly create wikis from Google Drive folders that makes it easy to find files fast. It&#x27;s similar to creating a wiki with Google Sites, but it looks nicer and the search is faster and more accurate. You can easily publish public wikis to a custom domain too.<p>Here&#x27;s the link: https:&#x2F;&#x2F;neat.wiki<p>Hope it&#x27;s useful, any feedback is much appreciated.",
      "time": 1637073100,
      "title": "Show HN: Create a simple, searchable wiki from Google Drive",
      "type": "story"
    },
    {
      "by": "ublaze",
      "descendants": 0,
      "id": 29240917,
      "score": 1,
      "time": 1637072994,
      "title": "Building Zerodha with Kailash Nadh",
      "type": "story",
      "url": "https://www.softwareatscale.dev/p/software-at-scale-37-building-zerodha"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29240909,
      "score": 1,
      "time": 1637072959,
      "title": "Using Propensity Score Matching to Uncover Shopify Capital’s Effect on Growth",
      "type": "story",
      "url": "https://shopify.engineering/propensity-score-matching-shopify-capital"
    },
    {
      "by": "elmerfud",
      "descendants": 0,
      "id": 29240905,
      "score": 4,
      "text": "This happened to me and I&#x27;ve been unable to get attention frim Uber on this matter.  When a driver accepts the ride but if they cancel before they start the ride, it disappears from the passengers history.  This leave a massive exploit potential that I was a victim of.<p>Car arrived, I got in with my things.  Driver locked the doors and started threatening me and demanding cash because Uber doesn&#x27;t pay enough.  He refused to carry on with the ride and became hostile so I unlocked the car and got away as quickly as I could.  In my haste I left some valuable items behind because I just needed to get away.  The driver sped off.  This is what I noticed that my Uber was now saying it was trying to find another ride because the driver canceled.<p>This is a massive exploit of drivers can use to assault passengers.  I have been attempting to contact Uber through there safety phone line through Twitter through any means I can and I cannot seem to get this communicated to Uber.  They repeatedly asked me the same questions what&#x27;s the plate number of the car in the name of the driver and I have to repeatedly explain it does not show up in the ride history because of this exploit.<p>They tell me to contact the police of which I asked them please look up the canceled ride history of a very specific day and time window and give me the plate number because the police need that to pursue this.  They totally refuse to acknowledge anything.<p>Anyone who rides with Uber is potentially vulnerable to this scam.  There is no way to contact Uber, there is no way to get through to them and indicate which ride it was because it will not show up in history, and they utterly refuse to help in any way.<p>Any future rides I get with Uber I will  screenshot every driver that it connects me with.  This kind of uber scam needs to be alerted to the public to the Uber safety officers who&#x27;ve been ignoring me to the executives at Uber.  To really anyone at Uber who would be willing to contact me and speak with me about this so I can get the information to report this to the police.  At this point I&#x27;ll be trying to contact the state&#x27;s attorney general&#x27;s the news media outlets literally anyone who can listen.  It&#x27;s quite likely that Uber&#x27;s assault reporting rate is artificially low because they literally ignore this stuff because you cannot report it in their app.",
      "time": 1637072947,
      "title": "Ask HN: Did you know Uber drivers assault passengers and clear the ride history?",
      "type": "story"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 29240893,
      "score": 3,
      "time": 1637072874,
      "title": "The only paradigm millennials understand NFTs in is DRM",
      "type": "story",
      "url": "https://twitter.com/jd_pressman/status/1460415593849372673"
    }
  ]
}