{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31520809,
      "score": 1,
      "time": 1653584795,
      "title": "How to Make an Instrument App for iOS with AudioKit 5",
      "type": "story",
      "url": "https://audiokitpro.com/makeinstrumentwithak5/"
    },
    {
      "by": "skuzins",
      "descendants": 3,
      "id": 31520805,
      "kids": [
        31520840,
        31520824
      ],
      "score": 1,
      "time": 1653584785,
      "title": "Jack Off the Board of Twitter",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1529869999803965446"
    },
    {
      "by": "martialg",
      "descendants": 0,
      "id": 31520788,
      "score": 1,
      "time": 1653584715,
      "title": "Ask HN: What's your favorite technical blog post of all time?",
      "type": "story"
    },
    {
      "by": "palashkulsh",
      "descendants": 0,
      "id": 31520779,
      "score": 1,
      "text": "I personally face the slack red notifications in the chat very anxiety inducing. With no way to make a todo of all the messages which i cant reply right now but will do later.\nWhat has been your experience and any tips to relieve the issue?",
      "time": 1653584686,
      "title": "Ask HN: Slack red unread chat callouts are anxiety inducing?",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31520773,
      "score": 1,
      "time": 1653584665,
      "title": "Asean citizens view China as most important future partner",
      "type": "story",
      "url": "https://www.scmp.com/news/asia/southeast-asia/article/3179175/asean-citizens-view-china-most-important-future-partner"
    },
    {
      "by": "tetek",
      "descendants": 3,
      "id": 31520769,
      "kids": [
        31520826,
        31520833,
        31520798
      ],
      "score": 2,
      "text": "How many of us carry two laptops?\nI want one laptop with physical switch between work and personal.<p>I like my MacBook Air, but I have to carry two.<p>What should be separate to be able to have physically two computers? Disk + Secure Enclave?<p>Is any company working on it? Maybe framework could do it?",
      "time": 1653584633,
      "title": "I want two laptops in one body",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31520762,
      "score": 1,
      "time": 1653584620,
      "title": "Seawater Greenhouse",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Seawater_greenhouse"
    },
    {
      "by": "geocrasher",
      "descendants": 0,
      "id": 31520750,
      "score": 1,
      "time": 1653584555,
      "title": "Sharing Your Project with the World: How?",
      "type": "story",
      "url": "https://hackaday.com/2022/05/26/sharing-your-projects-with-the-world-how/"
    },
    {
      "by": "tkiolp4",
      "descendants": 0,
      "id": 31520748,
      "score": 1,
      "text": "A month ago I accepted an offer (contract is signed) by an European company that recently has announced that is laying off x% of their staff (the announcement has hit the HN front page recently). I haven’t started to work them yet (I start in August). They have told me that I should not worry about my future position since the contract is signed. Even if what they told me is true, I don’t feel like I want to work there anymore for obvious reasons (I guess more layoffs are around the corner… and I guess recent hires would be the easiest ones to fire).<p>Have you been in a similar situation? I don’t know what would be the best move for me: either I start looking for another job (I’m coming from a break of around 5 months because of health issues) and reject reject working for them, or I continue with them and see what happens.<p>My contract doesn’t say what happens if I “reject” working for them even if the contract is signed (can they sue me?). It doesn’t specify either what happens if they tell me that they cannot afford a new hire.<p>When companies do lay offs, what’s “easier” for them? Fire hired people or reject people who hasn’t started yet but have a signed contract?",
      "time": 1653584553,
      "title": "Ask HN: Accepted an offer from a company that is laying off",
      "type": "story"
    },
    {
      "by": "parentheses",
      "descendants": 0,
      "id": 31520741,
      "score": 1,
      "text": "Are there libraries or tools you would recommend in the JS&#x2F;TS world that are &quot;suckless&quot;?",
      "time": 1653584524,
      "title": "Ask HN: Suckless Node – does it exist?",
      "type": "story"
    }
  ]
}