{
  "stories": [
    {
      "by": "moose_ears",
      "descendants": 0,
      "id": 31280951,
      "score": 1,
      "time": 1651807411,
      "title": "MedCon: Industry praises FDA’s digital health Pre-Cert pilot",
      "type": "story",
      "url": "https://www.raps.org/news-and-articles/news-articles/2022/5/medcon-industry-praises-fdas-digital-health-pre-ce"
    },
    {
      "by": "handsome_latino",
      "descendants": 0,
      "id": 31280949,
      "score": 1,
      "time": 1651807391,
      "title": "Simple, minimalist, lightweight open-source Bitcoin to USD/Euro Converter",
      "type": "story",
      "url": "https://btc2fiat.me/"
    },
    {
      "by": "jimkleiber",
      "descendants": 0,
      "id": 31280943,
      "score": 1,
      "text": "I just posted on FB for the first time in a long time and was thinking about how beholden I am to the algorithm, not knowing who will see what I post or when. Then I thought that what I love about email is that I can put rules to control what I see and when and wondered if this might be something a next iteration of social media might have.<p>But then I wondered: how many people actually use email filters&#x2F;rules?<p>So I ask you: do you use email filters&#x2F;rules? If so, how do you use them? And would you possibly want a similar system for non-email feeds?",
      "time": 1651807345,
      "title": "Ask HN: Do you use email filters/rules?",
      "type": "story"
    },
    {
      "by": "remexre",
      "descendants": 0,
      "id": 31280912,
      "score": 1,
      "time": 1651807024,
      "title": "Rustc: Add do yeet expressions to allow experimentation in nightly",
      "type": "story",
      "url": "https://github.com/rust-lang/rust/pull/96376"
    },
    {
      "by": "mliezun",
      "descendants": 0,
      "id": 31280866,
      "score": 1,
      "time": 1651806628,
      "title": "Blake3 hash plugin for MySQL written in Rust",
      "type": "story",
      "url": "https://mliezun.github.io/2022/05/05/rust-blake-mysql.html"
    },
    {
      "by": "imichael",
      "descendants": 0,
      "id": 31280865,
      "score": 1,
      "time": 1651806623,
      "title": "Chinese social media groups reveal nationalist influencers blogging from abroad",
      "type": "story",
      "url": "https://www.ft.com/content/bd9b6cbe-b817-4f26-8d0d-5d40c6b72a34"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31280855,
      "score": 1,
      "time": 1651806491,
      "title": "Learning Reusable Robot Movement Skills from Human and Animal Behaviors",
      "type": "story",
      "url": "https://arxiv.org/abs/2203.17138"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31280854,
      "score": 1,
      "time": 1651806486,
      "title": "Rapid Locomotion for Legged Robots via Reinforcement Learning",
      "type": "story",
      "url": "https://agility.csail.mit.edu/"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31280850,
      "score": 2,
      "time": 1651806454,
      "title": "SecureDrop 2.3.2 Released May 6, 2022",
      "type": "story",
      "url": "https://securedrop.org/news/securedrop-2_3_2-released/"
    },
    {
      "by": "jayShimada",
      "descendants": 0,
      "id": 31280849,
      "score": 2,
      "text": "Hi. \nI’m a community college graduate who’s been working in the industry for almost a year now. I’m going to start work as a full-stack developer at a new company (I’m pretty happy with the position) in the coming weeks, and had some time to reflect on my current life situation.<p>I enjoy making things with code and usually teach myself topics I’m interested about, and certainly love working. However, as I’m still at the age where most of my friends are attending college, and I’m quickly getting nervous if my decision to dive right into industry over transferring to a 4 year college to pursue a CS degree was the right choice for me.<p>I only have the vague goal of working in FAANG and building a startup (having enjoyed working to the bone at a startup as a founding dev at my last job). So, I basically have no idea what I want to do in life.<p>How do you weigh the decision of choosing one path over the next when both seem good options?\nHow would you decide whether to re-enter the education system, or continue working in industry?<p>HN has been a uniquely intriguing window into different life&#x2F;career choices in tech, and was hoping if I could glean some insight from the opinions from the people here.<p>Thank you.",
      "time": 1651806440,
      "title": "Ask HN: CS Degree or Industry",
      "type": "story"
    }
  ]
}