{
  "stories": [
    {
      "by": "cdahmedeh",
      "descendants": 0,
      "id": 30107653,
      "score": 1,
      "text": "I’ve made this excuse before: I’m busy. However, I actually do have quite a bit of free time not having any serious commitment other than my career and errands. No relationships. No family. No activism. No religion.<p>My time tracking software is ManicTime mainly for keeping tabs on my work hours. It has advanced tagging and report features that I used often. As time accumulates, the software gathers more and more data about my habits and what I do on my computer.<p>This morning, I decide to run a statistics report to see what I do the most and what web pages and documents I spend the most time on. I wasn’t happy with what I saw realizing that it was all my fault.<p>The report was limited to this month of January that is nearly ending. I’ve spent 80% of my time in a web browser but decided to look deeper into the websites I was visiting the most often. I wasn’t shocked so to speak, but it hit me like a rock anyways about how much of my short life was spent doing insipid things.<p>Sixty-percent of my web browsing time was spent on Reddit but not partaking in the discussion oriented forums or the likes. I just visited the main page over and over again to keep scrolling and scrolling getting my dopamine rush in cycles. Picking the subreddits to follow put me in a social bubble only seeing what I know and experiencing the same type of content over and over again.<p>Next on the list was YouTube. I’m not using it to watch informative videos or documentaries, but rather non-beneficial content that only passed the time. I binged and at times watched the same content several times in a week. Wikipedia was far down from the top five.<p>Looking at these reports put me into a downward spiral and gave me a revelation. I was in disbelief even though I knew this all along. I mocked those who spend hours on social websites like Facebook, Twitter, Tik Tok, Instagram and so on. But I just was one of them. I know these things are designed to steal my attention but I’m supposed to be stronger than that.<p>Like many of us, I made promises to myself for the new year. However, 3 weeks later, I haven’t followed up on any of them. I wanted to read more books, volunteer more, focus more on my work, see family and friends and so on. I even wanted to play more video games and watch more movies. I wanted to write more and blog more. Partake in my hobbies and make things.<p>Instead, I’m paralyzed by the bad habits I’ve formed for myself. My boredom is the catalyst for these habits. I keep lying to myself that I’ll do these things later when the moment is right. However, I push my time forward further ahead until it hits my bedtime and knock myself out.<p>I’m not the type who will find ways to block my avenues to limit myself from certain activities. Instead, I try to build habits that are strong and regular and instead provide a ‘natural’ way to stay away from these distractions.<p>Although I think it’s important to have rest and even lazy moments, I aspire to spend my time doing fruitful things or beneficial passive activities. My potential is so much more than what I’m doing now. I’ve mocked people for being stuck to their phones and living their lives online, but I’m one of them too.<p>I know I can do better than this. I have strong organizational skills but I’m not taking advantage of them. I’m awake of what a productive life looks like. It’s not impossible.",
      "time": 1643321713,
      "title": "I’m busy wasting my time",
      "type": "story"
    },
    {
      "by": "siftrics",
      "descendants": 0,
      "id": 30107611,
      "score": 1,
      "time": 1643321549,
      "title": "Learn Solana with Flash Cards and Spaced Repetition",
      "type": "story",
      "url": "https://libre.study/courses/28/"
    },
    {
      "by": "dgellow",
      "descendants": 0,
      "id": 30107607,
      "score": 1,
      "time": 1643321540,
      "title": "A Democratic Scandal Is Unfolding in Denmark",
      "type": "story",
      "url": "https://politiken.dk/udland/art8587872/A-Democratic-Scandal-is-Unfolding-in-Denmark"
    },
    {
      "by": "stoicanalyst",
      "descendants": 0,
      "id": 30107603,
      "score": 1,
      "time": 1643321533,
      "title": "Forensic Watermarking for Pre-Release Content",
      "type": "story",
      "url": "https://pacgenesis.com/forensic-watermarking-for-pre-release-content/"
    },
    {
      "by": "eecc",
      "descendants": 0,
      "id": 30107583,
      "score": 1,
      "time": 1643321462,
      "title": "Parser Combinators: Parsing for Haskell Beginners",
      "type": "story",
      "url": "https://two-wrongs.com/parser-combinators-parsing-for-haskell-beginners"
    },
    {
      "by": "recyclable_user",
      "descendants": 0,
      "id": 30107564,
      "score": 1,
      "text": "Forewarning: I am going to keep this relatively vague and detail sparse. I <i>do not</i> want to blow up my colleagues&#x27; spot and I am looking more for interpersonal&#x2F;professional advice in how to broach the topic with them directly as friends, without bringing in outside influences.<p>Last year, I was discussing ideas with a set of friends. I brought up an idea am confident I originated (at least within the context of the discussion). At the time, two of those friends were workshopping a startup in an entirely different domain. A few weeks ago, I found out that my friends had been accepted to an incubator with a prospective idea that, though not the entirety of what I had discussed, was essentially the business proposition&#x2F;revenue generating portion of my idea, by itself.<p>Upon hearing their idea, my first thought was &quot;didn&#x27;t I tell you exactly this idea?&quot; but I played it cool and did not bring up that I had originated this idea prior nor that I discussed it with them in presumed confidence. I would like to meet with them in person to broach the topic but I don&#x27;t know exactly how I should do that. The relationship between me and these others makes me believe that they were not acting out of malice or trying to swoop the idea from me, but maybe genuinely thought they&#x27;d arrived on this idea on their own. I know from my own memory that often things can pop out that you think you came up with that in reality you lifted wholesale from elsewhere. That said, I know from notes I kept long before the meeting that I had this idea before discussing it with them and that I did not come to it mutually through that discussion.<p>I have no belief that I could compel them to stop and I am not sure that that is my goal in the first place. More so, I am hurt as a friend and a colleague that they would take the idea without credit or forewarning and I feel I must broach the subject as a matter of personal principle. I have not had experience with such a situation before and would appreciate any ideas that the HN community is willing to provide.",
      "time": 1643321389,
      "title": "How to respond when close friends are using my idea in an incubator?",
      "type": "story"
    },
    {
      "by": "ossusermivami",
      "descendants": 0,
      "id": 30107544,
      "score": 1,
      "time": 1643321295,
      "title": "Fleet Below Deck, Architecture Overview",
      "type": "story",
      "url": "https://blog.jetbrains.com/fleet/2022/01/fleet-below-deck-part-i-architecture-overview/"
    },
    {
      "by": "pacificat0r",
      "descendants": 0,
      "id": 30107540,
      "score": 1,
      "time": 1643321286,
      "title": "Prime Video Uses WebAssembly",
      "type": "story",
      "url": "https://www.amazon.science/blog/how-prime-video-updates-its-app-for-more-than-8-000-device-types"
    },
    {
      "by": "indus",
      "descendants": 1,
      "id": 30107468,
      "kids": [
        30107552
      ],
      "score": 1,
      "time": 1643321030,
      "title": "FCC approves internet service provider “nutrition label” proposal",
      "type": "story",
      "url": "https://www.fcc.gov/document/fcc-acts-empower-broadband-consumers-through-transparency"
    },
    {
      "by": "ossusermivami",
      "descendants": 0,
      "id": 30107466,
      "score": 1,
      "time": 1643321022,
      "title": "Top programming languages on GitHub over the years",
      "type": "story",
      "url": "https://twitter.com/github/status/1486821349259681796/photo/1"
    }
  ]
}