{
  "stories": [
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30594761,
      "score": 1,
      "time": 1646696080,
      "title": "Take-Two Faces Lawsuit over “Deceptive and Unlawful” Loot Boxes in NBA 2K",
      "type": "story",
      "url": "https://www.nintendolife.com/news/2022/03/take-two-faces-lawsuit-over-deceptive-and-unlawful-loot-boxes-in-nba-2k"
    },
    {
      "by": "disabled",
      "descendants": 0,
      "id": 30594748,
      "score": 1,
      "time": 1646695995,
      "title": "Have pharmaceutical companies created a web of disinformation to boost profits?",
      "type": "story",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct1jpw"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30594740,
      "score": 1,
      "time": 1646695938,
      "title": "How international law applies to attacks on nuclear and associated facilities",
      "type": "story",
      "url": "https://thebulletin.org/2022/03/how-international-law-applies-to-attacks-on-nuclear-and-associated-facilities-in-ukraine/"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 30594739,
      "score": 1,
      "time": 1646695928,
      "title": "What happened to Python in February 2022?",
      "type": "story",
      "url": "https://realpython.com/python-news-february-2022/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30594716,
      "score": 2,
      "time": 1646695774,
      "title": "Samsung Confirms Galaxy Source Code Was Stolen by Hackers",
      "type": "story",
      "url": "https://gizmodo.com/confirmed-samsung-galaxy-source-code-stolen-in-data-br-1848616398"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30594694,
      "score": 2,
      "time": 1646695582,
      "title": "Learning from Weakly-Labeled Videos via Sub-Concepts",
      "type": "story",
      "url": "https://ai.googleblog.com/2022/03/learning-from-weakly-labeled-videos-via.html"
    },
    {
      "by": "easyalgocode",
      "descendants": 0,
      "id": 30594692,
      "score": 1,
      "text": "I believe that since PoS is money based, meaning the most staked tokens are in the main validator set, then potentially big corporations&#x2F;nations could slowly infiltrate a blockchain at a slow rate and then take the blockchain down at once. There should be a more secure version that PoS that can enhance the trustless issue of nodes.",
      "time": 1646695565,
      "title": "Are PoS blockchains a potential risk if nations want to adopt?",
      "type": "story"
    },
    {
      "by": "ushakov",
      "descendants": 1,
      "id": 30594677,
      "kids": [
        30594751
      ],
      "score": 1,
      "time": 1646695444,
      "title": "Foreign funds now own 81% of all shares listed on Moscow Exchange",
      "type": "story",
      "url": "https://www.reuters.com/article/us-russia-moex-idUSKBN2EZ1XU"
    },
    {
      "by": "Hadi_Asiaie",
      "descendants": 0,
      "id": 30594674,
      "score": 1,
      "text": "Apple terminated my developer account for the association with a previously terminated account.<p>First I should say: I &amp; my developer account are not associated with anyone else in any way since May 2018.<p>From this, I feel I’m fully innocent.<p>My Apple developer account is my only job and I’ve put blood and sweat there, I appreciate any advice. Thank you.<p>More details:<p>Apple fully terminated my developer account of 5 years because they determined it’s associated with some terminated account. However, immediately they gave me another chance to re-instate it. They gave me a chance to write a letter and explain why Apple should give me my developer membership back.<p>Here I’m asking for your advice. I already sent them an email and explained everything, but I think I can add more information. Is there a way I can call them? My account is not accessible at all.<p>This is the latest letter I’ve sent to them: https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;MMWq87X<p>My association with a terminated account lasted until May 12, 2018, the day I removed my Apple ID there. Also one of my bank accounts has been there until July 2017. I uploaded one app there 7 years ago and on May 12, 2018, I removed it, that’s all!\nI believe this account is terminated about a year ago, so almost 3 years after I’ve had any association with it.<p>Of course, they gave me an appeal chance before as well, but my appeal wasn’t successful! I told them the same things that I said here( but with details), except I have had forgotten about the Apple ID thing. But in my last letter, I also told them that my Apple ID has been there until May 2018. Since my previous appeal and my last letter are not much different, I see a low chance for my case.<p>I think they shouldn&#x27;t even flag my account since my association has been very weak and it has been from the distant past.<p>I believe my account terminated using robots with no human interactions, I believe no human even read my previous appeal.<p>Thanks for reading.",
      "time": 1646695417,
      "title": "Ask HN: Apple terminated my developer account for association",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30594670,
      "score": 1,
      "time": 1646695395,
      "title": "The Chaos of a Creator",
      "type": "story",
      "url": "https://blog.polywork.com/the-chaos-of-a-creator/"
    }
  ]
}