{
  "stories": [
    {
      "by": "intronextron",
      "descendants": 0,
      "id": 31095379,
      "score": 1,
      "text": "Hi everyone,I hope this is an ok place to rant because I&#x27;m so tired - mentally and physically.<p>I found a job in the marketing area and it is draining. Not the job as much as the people I work with. I&#x27;m very new to the field, but asking questions is bad. I&#x27;m good at my job (the results show) but the people around me are rude, hostile, and downright condescending when I ask questions. Even HR is rude, so there&#x27;s really no one to talk to. The turnover rate is high as well. It&#x27;s exhausting to deal with this day in day out and feel anxious and dreaded to go into work. That said, I can&#x27;t quit for now - I need the money and I&#x27;m not hearing back from anyone else. Are there people out there who can go into work and just go home without having to deal with all this BS? I&#x27;m also seeing a therapist because my self-esteem is at an all-time-low. It&#x27;s slow but for now I just feel like running away from all of this.<p>PS I know it&#x27;s pointless to rant but I just feel so stuck and hopeless.",
      "time": 1650454490,
      "title": "Rant: Job Sucks",
      "type": "story"
    },
    {
      "by": "ordu",
      "descendants": 0,
      "id": 31095369,
      "score": 1,
      "time": 1650454409,
      "title": "24-hour race won by molecule that traveled 1 micron",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/04/not-quite-le-mans-24-hour-race-won-by-molecule-that-traveled-1-micron/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31095363,
      "score": 1,
      "time": 1650454380,
      "title": "I9-12900KS WR at 7.8Ghz on 8 cores: how I hit this with 70l of liquid nitrogen",
      "type": "story",
      "url": "https://www.tomshardware.com/features/intel-core-i9-12900ks-world-record-78-ghz-8-cores"
    },
    {
      "by": "Tmkly",
      "descendants": 0,
      "id": 31095360,
      "score": 1,
      "text": "I&#x27;m a software engineer, mainly working on mobile apps (iOS primarily) through React Native and some Swift&#x2F;Java. I have a CS degree and about 7 years in this field.<p>However recently I&#x27;ve become very aware that JS&#x2F;TS and Swift etc are just APIs on top of APIs. I&#x27;ve been drawn to learning more about how computers work, the history of programming&#x2F;computers (Unix, Sinclair, commodore, etc and even going back to Ada Lovelace, Babbage and mainframes in the 1950s) and things like memory allocation. I&#x27;ve tried learning some BASIC and Assembly code but haven&#x27;t really got very far. I read&#x2F;devour articles on sites like https:&#x2F;&#x2F;twobithistory.org but they only get you so far.<p>What can I do to help accelerate this and satiate this desire to learn more about how computers work? I live in London, UK and would be happy to spend some money on a uni course or something if there was a good one. I learn best practically so like to be &quot;doing&quot; something as well as theory.",
      "time": 1650454353,
      "title": "Ask HN: Best way to learn about computing history",
      "type": "story"
    },
    {
      "by": "mib32",
      "descendants": 0,
      "id": 31095345,
      "score": 1,
      "text": "I work a 40 hour week, usually from 10 to 6.<p>It&#x27;s so happened, that most of businesses surrounding me are also only open during exactly same time.<p>I am a human, and I need to go to doctors, therapists, other time I need to visit some place to let&#x27;s say choose some furniture to buy, or just to drink a cup of coffee in a lunch time on a terrace of a cafe. I am human, and I feel I am becoming less human if I don&#x27;t allow myself such things!<p>The problem is that I don&#x27;t understand how to talk about that with my employer. Usually when I need to get out, I just put the &quot;afk&quot; status on slack and go.<p>What happens after: if I had no slack mentions, and nothing happened, I feel okay, as if my &quot;bad move&quot; went unnoticed. But if I see some unviewed mentions, somebody was pinging me, I immediately feel lots of shame and guilt. My reaction is: &quot;I&#x27;m here now, let&#x27;s work work work! I am sorry I was absent people!&quot; It feels really bad and weird.<p>HN, did you also ever feel like this? What strategies you found useful?",
      "time": 1650454245,
      "title": "Ask HN: How do you deal with running errands guilt?",
      "type": "story"
    },
    {
      "by": "jamesy0ung",
      "descendants": 0,
      "id": 31095327,
      "score": 1,
      "time": 1650454049,
      "title": "Eee PC Modding Guide",
      "type": "story",
      "url": "https://beta.ivc.no/wiki/index.php/Eee_PC_Internal_Upgrades"
    },
    {
      "by": "pattusk",
      "descendants": 0,
      "id": 31095326,
      "score": 3,
      "time": 1650454040,
      "title": "UK court approves extradition of Julian Assange to US",
      "type": "story",
      "url": "https://www.theguardian.com/media/2022/apr/20/uk-court-approves-extradition-of-julian-assange-to-us"
    },
    {
      "by": "jamesy0ung",
      "descendants": 0,
      "id": 31095313,
      "score": 1,
      "time": 1650453940,
      "title": "Dell Inspiron 1212 Upgradeable Notebook",
      "type": "story",
      "url": "https://twitter.com/kiwapebretech/status/1440080633703780355"
    },
    {
      "by": "beaker52",
      "descendants": 0,
      "id": 31095306,
      "score": 1,
      "text": "I&#x27;m seeking direction and guidance. I&#x27;m between roles. I&#x27;ve been trying to carve out an unconventional role for myself, doing what I enjoy doing and what I&#x27;m best at. I&#x27;m seeking advice because I&#x27;m not sure what role best matches what I&#x27;m looking for.<p>I&#x27;ve come through software development. I juked the Management track and stayed on the IC track. Senior, Team Lead, Principal. But I don&#x27;t want to strictly do software engineering anymore. I&#x27;d like to do systems engineering, or business engineering, or something.<p>I&#x27;d like to make the lives of customers and employees better, through making possible what was not possible before, or reducing burden.<p>I&#x27;d like to do that by helping businesses build systems _beyond just software_ that, having both internal and external effects. This could be having a hand in the product offering, business organisation and operation, commissioning software teams or shaping organisational culture. I&#x27;d also like to help coach the software engineering teams that build the software, because that&#x27;s where I&#x27;ve come from.<p>I feel like I&#x27;m looking for something between a principal engineer, a product manager and an engineering director. I want to keep my boots on the ground, but help shape what is going on above.<p>I&#x27;m applying for principal engineer roles, however the companys I&#x27;ve interviewed for are looking for this role to be primarily focussed on moving tickets across a JIRA board, which isn&#x27;t really what I&#x27;m shooting for. I want to help businesses and teams move the appropriate tickets across JIRA boards. I&#x27;m getting really great feedback, but they just aren&#x27;t hiring for _that_ role.<p>Is there another role I could consider in my position?<p>Any and all advice is appreciated.",
      "time": 1650453876,
      "title": "Ask HN: Unconventional Role?",
      "type": "story"
    },
    {
      "by": "jimhi",
      "descendants": 0,
      "id": 31095305,
      "score": 2,
      "time": 1650453876,
      "title": "Breakfast became the most important meal of the day",
      "type": "story",
      "url": "https://www.mrsteinberg.com/the-most-important-meal-of-the-day/"
    }
  ]
}