{
  "stories": [
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29108760,
      "score": 1,
      "time": 1636041466,
      "title": "GitHub Actions resources to bookmark from the basics to CI/CD",
      "type": "story",
      "url": "https://github.blog/2021-11-04-10-github-actions-resources-basics-ci-cd/"
    },
    {
      "by": "Leary",
      "descendants": 0,
      "id": 29108742,
      "score": 1,
      "time": 1636041378,
      "title": "China, India and Other Developing Nations Seek $1.3T a Year in Climate Finance",
      "type": "story",
      "url": "https://www.wsj.com/articles/climate-finance-china-india-11636039142"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29108718,
      "score": 2,
      "time": 1636041294,
      "title": "Worth a Thousand Words: Automated Diagnosis of Covid-19 from Chest CTs",
      "type": "story",
      "url": "https://dgist.ac.kr/en/html/sub06/060202.html?mode=V&no=289312db200847a65ff559530e1a1f2b&GotoPage=1"
    },
    {
      "by": "frankhopkinjr",
      "descendants": 1,
      "id": 29108683,
      "kids": [
        29108805
      ],
      "score": 2,
      "text": "Hi everyone! I&#x27;m in the process of hiring software developers and I&#x27;ve created the job offer that you can find below. I would like to hear your feedback, because I didn&#x27;t received too much applications. I&#x27;m trying to figure out what can be possible wrong with it or how I can improve this. I know that a number of factors plays a role, like the salary, but maybe there is still something worth to change in the text.<p>I will be really happy to hear your general feeling after reading the offer and what are &quot;positives&quot; or &quot;negatives&quot; in your opinion. Thanks!<p>Job offer\n-------------------<p>Hey! I&#x27;m Frank, and I want you to help us with React projects!<p>Join to our self-organizing teams and participate at every stage of the project: from exploring the project&#x27;s problem to delivering outstanding products. As a team member, you will share responsibilities with other teammates. Together, you will plan the solution and split the work within the team. Collectively, you will take care about the code, final outcome at every level and genuinely support each other. Each team has a leader who consolidates organizational activities like tracking the projected trajectory, communication with the client, and coordination of the team efforts... but we encourage everyone to commit at every level, including the leader&#x27;s responsibilities.<p>Your skills, continuous improvement, willingness to face challenges, and thoughtful collaboration with respect and trust are what you bring to the table. This will make you a valuable part of the project team, and everyone will look forward to working with you! In COMPANY_NAME, we highly appreciate self-learners giving great attention to the details and final results and having a deep sense of responsibility.<p>We also genuinely value the efforts to extend domains, and we encourage everyone to migrate towards full-stack competencies. It gives a better understanding of the project, facilitates cooperation with other programmers, and makes you a more complete developer. Saying this, any additional experience with React Native, Blockchain, Ruby on Rails, AWS, and DevOps will be your great advantage!<p>At COMPANY, you may not only contribute at the project level. Each team follows the common standards and guidelines unifying how projects are built. By giving new suggestions, you can shape how you and all other teams work. This is another way how you can help us to deliver better results!<p>In the daily work, you will find that we are not very different from other organizations. We are using GitHub, Docker, Slack, and we do code reviews. Also, we make sure that everyone can enjoy the well-balanced environment with the right amount of meetings-and-teamwork time and time when you deeply focus on the programming.<p>We work on projects and with people from around the world... so good English communication skills are really needed in this job.<p>Apply now to become a part of COMPANY where you&#x27;ll work as a team, tackle challenges as a team, succeed as a team and fail as a team (...because failure is not an option! ;) )<p>We&#x27;ll also highly appreciate anything more than a CV. You can provide showcases of your previous work and links to your profiles on GitHub and LinkedIn.<p>&gt;&gt;&gt; Essentials:<p>-2+ years of experience with React projects<p>-(...)<p>-Good English communication skills (B2&#x2F;C1)<p>&gt;&gt;&gt; Nice to have:<p>-Gatsby &#x2F; NextJS<p>-(...)<p>-Storybook<p>&gt;&gt;&gt; Leverage:<p>We aim to create a balanced team of developers, and we encourage everyone to enhance their skills to cover other domains of the development world, so the experience with any of the following technologies will give you a great advantage:<p>-React Native<p>-(...)<p>-DevOps<p>&gt;&gt;&gt; Job:<p>-Contract: ?<p>-Remote work<p>-Paid time off<p>-Flexible working hours<p>Process:<p>1.Application review<p>2.First interview-60min<p>3.Second meeting-90min<p>4.Final meeting-30min<p>5.Paperwork and onboarding",
      "time": 1636041102,
      "title": "Ask: I need a feedback about my job offer/description",
      "type": "story"
    },
    {
      "by": "riidom",
      "descendants": 0,
      "id": 29108662,
      "score": 6,
      "time": 1636040988,
      "title": "Don't build your castle in other people's kingdoms",
      "type": "story",
      "url": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/"
    },
    {
      "by": "nonbirithm",
      "descendants": 0,
      "id": 29108648,
      "score": 6,
      "time": 1636040937,
      "title": "Space Station 14 – Open-Source Remake of Space Station 13",
      "type": "story",
      "url": "https://spacestation14.io/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29108643,
      "score": 1,
      "time": 1636040912,
      "title": "The Posthuman Dog",
      "type": "story",
      "url": "https://aeon.co/essays/who-could-dogs-become-without-humans-in-their-lives"
    },
    {
      "by": "martincmartin",
      "descendants": 1,
      "id": 29108638,
      "kids": [
        29108722
      ],
      "score": 2,
      "time": 1636040885,
      "title": "Private space stations will soon be in orbit",
      "type": "story",
      "url": "https://www.economist.com/science-and-technology/private-space-stations-will-soon-be-in-orbit/21805944"
    },
    {
      "by": "thomascz",
      "descendants": 0,
      "id": 29108585,
      "score": 1,
      "time": 1636040591,
      "title": "Show HN: Bookmarklets for Developers",
      "type": "story",
      "url": "https://bookmarklets.websec.blog/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29108579,
      "score": 2,
      "time": 1636040566,
      "title": "Don't Trust Mark Zuckerberg's Metaverse with Your Privacy, ProtonMail CEO Warns",
      "type": "story",
      "url": "https://www.newsweek.com/zuckerberg-facebook-metaverse-privacy-protonmail-1645530"
    }
  ]
}