{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30517128,
      "score": 1,
      "time": 1646156087,
      "title": "Analysis and Introspection Options in Linkers",
      "type": "story",
      "url": "https://maskray.me/blog/2022-02-27-analysis-and-introspection-options-in-linkers"
    },
    {
      "by": "radi8",
      "descendants": 0,
      "id": 30517118,
      "score": 1,
      "time": 1646156054,
      "title": "Show HN: Helping new Freelancers manage clients, projects and payments",
      "type": "story",
      "url": "https://www.CORL8.com"
    },
    {
      "by": "AyoAduwo",
      "descendants": 0,
      "id": 30517113,
      "score": 1,
      "time": 1646156040,
      "title": "DARQ – The Futuristic Technology",
      "type": "story",
      "url": "https://thewebgate.net/darq-the-futuristic-technology/"
    },
    {
      "by": "mudro_zboris",
      "descendants": 0,
      "id": 30517106,
      "score": 1,
      "time": 1646156018,
      "title": "Are There Lost Alien Civilizations in Our Past? – Kurzgesagt",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=KRvv0QdruMQ"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30517098,
      "score": 1,
      "time": 1646155981,
      "title": "GraphJin – an instant GraphQL to SQL compiler",
      "type": "story",
      "url": "https://github.com/dosco/graphjin"
    },
    {
      "by": "diogenesjunior",
      "descendants": 0,
      "id": 30517089,
      "score": 1,
      "time": 1646155931,
      "title": "Data WhiteOps Collects",
      "type": "story",
      "url": "https://smitop.com/post/whiteops-data/"
    },
    {
      "by": "jakestein",
      "descendants": 1,
      "id": 30517088,
      "kids": [
        30517104
      ],
      "score": 6,
      "text": "Hi HN, Jake here, co-founder and CEO of Common Paper. https:&#x2F;&#x2F;commonpaper.com&#x2F; We’re excited to share a new approach to legal contracts.<p>Our vision is to turn contracts into APIs. https:&#x2F;&#x2F;commonpaper.com&#x2F;blog&#x2F;contracts-should-be-apis&#x2F;  We’ve been working with contracts for our whole careers, previously at Stitch (acquired by Talend) and RJMetrics (acquired by Magento, then Adobe).<p>Before starting Common Paper, we interviewed more than 100 founders, lawyers, salespeople, and more from companies ranging from startups to Fortune 500 companies. We learned a lot about their frustrations with the slow, contentious status quo of contracting and what’s preventing things from being improved.<p>The root cause of the problem is that contracts are unstructured and inconsistent. There are an infinite number of legally valid ways to draft each term in any given contract, and things get even more complicated once people start negotiating. Microsoft Word documents with tracked changes get emailed back and forth, and it creates a big mess of unstructured data. All of this means that it’s really hard for people to actually understand what’s in all of their contracts, and it’s impossible to automate the process of following through on their obligations.<p>- An API for contracts changes all of that, and we have built several exciting elements in service of that vision (with a lot more to come):<p>- Open source, standard contracts: The first two are a Mutual NDA and Cloud Service Agreement (for selling software and cloud services). They are released under a Creative Commons CC BY 4.0 license, so they are free to download and use for any purpose. https:&#x2F;&#x2F;commonpaper.com&#x2F;standards&#x2F;<p>- Committee of attorneys that collaborated on the drafting of the contracts. They have experience in big law firms, in small boutique specialist firms, and as in-house at tech companies. The committee ensures that the standard contracts reflect market norms and industry best practices. https:&#x2F;&#x2F;commonpaper.com&#x2F;committee<p>Software for managing and automating the contracts. Our structured contract platform is built from the ground up for standard contracts, and it enables direct access to the data inside them. That means negotiation, closing, and knowing what’s in your contracts is faster and easier than ever before. https:&#x2F;&#x2F;commonpaper.com&#x2F;product&#x2F;<p>We&#x27;d love your feedback. https:&#x2F;&#x2F;commonpaper.com&#x2F;",
      "time": 1646155928,
      "title": "Show HN: Common Paper",
      "type": "story"
    },
    {
      "by": "XnoiVeX",
      "descendants": 0,
      "id": 30517069,
      "score": 1,
      "time": 1646155848,
      "title": "SEC is requesting comments for a Bitcoin spot ETF",
      "type": "story",
      "url": "https://www.sec.gov/comments/sr-nysearca-2021-90/srnysearca202190.htm"
    },
    {
      "by": "mariialv",
      "descendants": 0,
      "id": 30517059,
      "score": 1,
      "time": 1646155787,
      "title": "Slashdot Social Bookmarking Website",
      "type": "story",
      "url": "https://slashdot.org/~mariialv"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 30517054,
      "score": 3,
      "time": 1646155764,
      "title": "Hackers to Nvidia: Remove mining cap or we leak hardware data",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/hackers-to-nvidia-remove-mining-cap-or-we-leak-hardware-data/"
    }
  ]
}