{
  "stories": [
    {
      "by": "marianoguerra",
      "descendants": 0,
      "id": 29341816,
      "score": 1,
      "time": 1637851981,
      "title": "Show HN: Take YouTube video notes without leaving your keyboard",
      "type": "story",
      "url": "https://instadeq.com/youtube-notes/"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 29341799,
      "score": 1,
      "time": 1637851874,
      "title": "My philosophy for productive instant messaging",
      "type": "story",
      "url": "https://drewdevault.com/2021/11/24/A-philosophy-for-instant-messaging.html"
    },
    {
      "by": "philonoist",
      "descendants": 0,
      "id": 29341783,
      "score": 1,
      "time": 1637851756,
      "title": "Voice Control for the Browser – LipSurf",
      "type": "story",
      "url": "https://www.lipsurf.com/"
    },
    {
      "by": "Etai",
      "descendants": 0,
      "id": 29341764,
      "score": 2,
      "text": "Simple data cataloging starts with a great organization. A data catalog is a collection of metadata and documentation that helps make sense of the data sprawl that exists in most growing companies. Getting together and starting to use a data catalog is a simple process, but starting to get adoption and having the dictionary exist as part of your workflow is a little bit more difficult.<p>An example of the data catalog problems shared by one of the delivery companies we spoke with. At this company, it was difficult to get aligned on which tables were commonly used, joined, how they were used together and what columns meant. Similarly, it’s difficult to monitor the number of data assets that exist across different departments, especially when the number of resources grows at a faster rate than people. Why is this the case?<p>Data is becoming more decentralized through concepts like the data mesh. As more teams outside of the data function start to use data in their day-to-day, different tables, dashboards and definitions are being created at an almost exponential rate. Data catalogs are important because they help you organize your data whether you are working with structured or unstructured data.<p>Below are the steps that teams need to take when creating a data catalog:<p>1. Gather sources from across the organization<p>The first step data teams need to take is to collect the different resources that are scattered across different tools in the origination. This may require multiple meetings and stakeholders to come together and figure out which resources need to be in the catalog. Today, this collection could be done in a spreadsheet with an ongoing list of all resources and how they connect.<p>2. Give each resource an owner<p>After data teams have identified all the resources from across the company that they would like to include in their data catalog, we recommend assigning ownership to each resource. Teams that we’ve worked within the past have assigned ownership based on the source, schema or even domain. Teams that start assigning ownership should look for people who are familiar with the data knowledge they are responsible for managing and are willing to help others who want to learn how to use it.<p>3. Get support and sign off<p>Once these meetings conclude and owners are on the same page, have the owners sign off on their responsibilities. The owners should be in alignment with the documentation and feel like the data team worked collaboratively with them to come to this ownership structure. If the team leadership team sees the value of a data catalog, this can move at a much faster pace.<p>4. Integrate the catalog base into your workflow<p>After data teams have received support for their data documentation process, they should look for ways to integrate this tool into their workflow. This step is critical for maintenance and upkeep. Without a tool that allows teammates to receive notifications on Slack, it will likely be forgotten. By creating a process around the data catalog, teams can ensure that it is not left behind as the team grows<p>5. Upkeep the data catalog<p>Although the documentation should be stable, it may need to change over time. One instance that might require documentation to change is when a new revenue stream is introduced or when the pricing of an existing revenue line changes. These changes traditionally come from the business team and might require the data team to implement the changes into the data catalog.<p>Teams that invest the time to get alignment using a data catalog can see major benefits in the long term as they make faster decisions as a team. Creating a data catalog is not a small undertaking. You can read the full step-by-step guide here if you found this post useful: https:&#x2F;&#x2F;www.secoda.co&#x2F;blog&#x2F;how-to-create-a-data-catalog-a-step-by-step-guide",
      "time": 1637851639,
      "title": "How to create a data catalog, a step by step guide",
      "type": "story"
    },
    {
      "by": "malshe",
      "descendants": 0,
      "id": 29341757,
      "score": 1,
      "time": 1637851613,
      "title": "Where U.S. Workers Are Quitting Jobs at Record Rates",
      "type": "story",
      "url": "https://www.wsj.com/articles/where-u-s-workers-are-quitting-jobs-at-record-rates-11637836201"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29341738,
      "score": 1,
      "time": 1637851490,
      "title": "Webcomic made it okay to be sad online. Then its artist vanished",
      "type": "story",
      "url": "https://www.inputmag.com/culture/pictures-for-sad-children-webcomic-simone-veil-interview"
    },
    {
      "by": "kranke155",
      "descendants": 0,
      "id": 29341737,
      "score": 1,
      "time": 1637851483,
      "title": "What Hic Et Nunc’s (NFT) Resurrection Says About Decentralized Infrastructure",
      "type": "story",
      "url": "https://www.coindesk.com/tech/2021/11/18/what-hic-et-nuncs-resurrection-says-about-decentralized-infrastructure/"
    },
    {
      "by": "akeck",
      "descendants": 0,
      "id": 29341708,
      "score": 1,
      "time": 1637851276,
      "title": "Permacomputing Update 2021",
      "type": "story",
      "url": "http://viznut.fi/texts-en/permacomputing_update_2021.html"
    },
    {
      "by": "endergen",
      "descendants": 0,
      "id": 29341691,
      "score": 1,
      "time": 1637851194,
      "title": "Hot Reloading Diagrams into Web Tutorials (Demo Video)",
      "type": "story",
      "url": "https://twitter.com/seflless/status/1463710140687949826"
    },
    {
      "by": "scottbucks",
      "descendants": 0,
      "id": 29341689,
      "score": 1,
      "time": 1637851183,
      "title": "macOS Monterey Features You Will Use",
      "type": "story",
      "url": "https://thedetechtor.com/macos-monterey-features-you-will-actually-use/"
    }
  ]
}