{
  "stories": [
    {
      "by": "22222",
      "descendants": 0,
      "id": 30678280,
      "score": 1,
      "time": 1647291831,
      "title": "China locks down province of 24m as new Covid infections rise",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/mar/14/china-locks-down-province-of-24m-as-new-covid-infections-rise"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30678268,
      "score": 1,
      "time": 1647291787,
      "title": "Apparent Cyberattack on Israel – Disables Government Websites",
      "type": "story",
      "url": "https://www.dw.com/en/apparent-cyberattack-on-israel-disables-government-websites/a-61125249"
    },
    {
      "by": "jamesdco",
      "descendants": 0,
      "id": 30678267,
      "score": 1,
      "time": 1647291784,
      "title": "Home Office under investigation for extracting data from migrants' phones",
      "type": "story",
      "url": "https://news.sky.com/story/home-office-under-investigation-for-extracting-data-from-hundreds-of-migrants-phones-12564073"
    },
    {
      "by": "cft",
      "descendants": 0,
      "id": 30678249,
      "score": 1,
      "text": "I was delayed in Spain because of Covid. I evacuated here sick with Covid from Ukraine, just before the war. Suddenly Google Fi cuts off my service, with no warning. I have not received their email warning. Can somebody help me on HN? I edited out my case ID from the chat, but I can add it.<p>Welcome to Google Support. My name is Lohitha. How are you today?\nLohitha · 1:32 PM\nhi\n1:32 PM\nL\nHi Alec!\nPlease make a note of this case ID: 5-XXXXXXX for future reference.\nLohitha · 1:32 PM\nI described the problem: I suddenly lost data connection today and cannot reconnet to data\n1:32 PM\nL\nI see that you are facing issues with the international data connection. I will help you to the best of my expertise.\nThanks for the details.\nLohitha · 1:33 PM\nIn the screenshot, all networks that now say Forbidden were available until today\n1:34 PM\nL\nOkay. Are you on active military duty or a government employee?\nLohitha · 1:35 PM\nno\n1:35 PM\nL\nThank you for the details.\nLohitha · 1:35 PM\nthis happened after I made a long call to a US phone number over WiFi\n1:36 PM\nL\nGot it.\nI have checked the details and see that your international data capability is suspended.\nLohitha · 1:39 PM\nWhy?\n1:39 PM\nL\nAs per our Terms of Service, Fi must be primarily used in the United States (territories not included) and isn’t intended for extended international use.\nIf you plan to stay abroad, we recommend you use a local carrier until you return to the US.\nLohitha · 1:39 PM\nI had covid and I was delayed here\nI have documents that show that I have had covid recently\n1:40 PM\nL\nAlec, I completely understand.\nI would have definitely helped you with this if there would have been any other alternative options.\nLohitha · 1:42 PM\nI am returning to the US in 2 weeks: I even had to ask for a visa extension because I am sick. I hope you won&#x27;t cut off my service because I have Covid?\nI can upload my doctor&#x27;s letter and a positive PCR test\n1:44 PM\nL\nUnfortunately, we don&#x27;t have an option to provide exceptions for covid affected persons. I hope you understand.\nYour international data roaming capabilities are automatically reinstated once we determine that your services (data, talk and text) are primarily used in the United States (territories not included) as per our Terms of Service.\nLohitha · 1:45 PM\nI am sick and you cut off my phone without warning!\nThere was no warning whatsoever\n1:45 PM\nL\nAlec, you must have received an email before 30 days as a remainder.\nLohitha · 1:46 PM\nI have never received any email\nNothing\n1:46 PM\nL\nPlease check if you have blocked the system automated emails.\nLohitha · 1:46 PM\nI have not\n1:46 PM\nL\nGoogle Fi will send an email before 30 days.\nLohitha · 1:47 PM\nI have never seen the email\nAnd I cannot find it in my gmail account: I am looking no\nnow\n1:47 PM\nL\nI understand. Please check your gmail settings if you have any restrictions.\nLohitha · 1:48 PM\nI did not set any restrictions. Since this is about disconnecting my phone, you could have called me or at least sent a text!\ncan you please reinstate the service for 2 weeks? I am cut off from my banking, everything\nAnd I am sick\n1:49 PM\nL\nAlec, it is an automated email system. Unfortunately, we don&#x27;t have an option to send you a text or call. I hope you understand.\nI would have certainly helped you if there is any alternative option.\nIt is my pleasure to assist you today! Have a good one!\nLohitha left the chat.\n1:50 PM\nThanks for contacting Google Fi chat support. Your chat session is now complete.",
      "time": 1647291680,
      "title": "Ask HN: Sick with Covid in Spain, Google Fi suddenly cuts off my phone service",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30678237,
      "score": 1,
      "time": 1647291605,
      "title": "Robots with realistic pain expressions can reduce examination error and bias",
      "type": "story",
      "url": "https://www.imperial.ac.uk/news/234634/robots-with-realistic-pain-expressions-reduce/"
    },
    {
      "by": "bruceb",
      "descendants": 0,
      "id": 30678219,
      "score": 1,
      "text": "Clicking on Facebook Marketplace vehicles section am confronted with onslaught of scams listings. \nhttps:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;DPSUBhC<p>First three rows show 21 results, 17 vehicles and 4 sponsored ads. Out of the 17 vehicles, 12 are scams, 71%.<p>Reporting these seems to do nothing. Is FB that powerless to stop this?<p>There was a story on this 6 months ago but maybe got worse? \nhttps:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28676973",
      "time": 1647291512,
      "title": "Ask HN: 12 of 17 vehicles (71%) listed first in FB marketplace are scams, Why?",
      "type": "story"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 30678205,
      "score": 2,
      "time": 1647291458,
      "title": "Effective Altruism is and will be more influential than you think",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2022/03/effective-altruism-is-and-will-be-more-influential-than-you-think.html"
    },
    {
      "by": "chaostheory",
      "descendants": 0,
      "id": 30678197,
      "score": 1,
      "time": 1647291420,
      "title": "Rivian Wants Direct Sales in Georgia in Exchange for Jobs",
      "type": "story",
      "url": "https://jalopnik.com/rivian-teases-jobs-for-georiga-if-the-state-considers-d-1848650167"
    },
    {
      "by": "gamechangr",
      "descendants": 0,
      "id": 30678187,
      "score": 1,
      "time": 1647291379,
      "title": "I Hate Myself': 8 Ways to Combat Self-Hatred",
      "type": "story",
      "url": "https://www.verywellmind.com/i-hate-myself-ways-to-combat-self-hatred-5094676"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30678165,
      "score": 1,
      "time": 1647291306,
      "title": "Apple Updates: macOS 12.3, XCode 13.3, tvOS 15.4, watchOS 8.5, iPadOS 15.4, more",
      "type": "story",
      "url": "https://isc.sans.edu/forums/diary/Apple+Updates+Everything+MacOS+123+XCode+133+tvOS+154+watchOS+85+iPadOS+154+and+more/28438"
    }
  ]
}