{
  "stories": [
    {
      "by": "garyclarke27",
      "descendants": 0,
      "id": 30257062,
      "score": 1,
      "time": 1644318228,
      "title": "Cyberattack Brings Down Vodafone",
      "type": "story",
      "url": "https://www.theportugalnews.com/news/2022-02-08/cyberattack-brings-down-vodafone/65121"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 30257056,
      "score": 1,
      "time": 1644318199,
      "title": "The Plausibly Deniable DataBase (PDDB)",
      "type": "story",
      "url": "https://www.bunniestudios.com/blog/?p=6307"
    },
    {
      "by": "MakisH",
      "descendants": 0,
      "id": 30257052,
      "score": 1,
      "time": 1644318157,
      "title": "Overcoming Complexity in Testing Multiphysics Coupling Software",
      "type": "story",
      "url": "https://bssw.io/blog_posts/overcoming-complexity-in-testing-multiphysics-coupling-software"
    },
    {
      "by": "pavlovskyi",
      "descendants": 0,
      "id": 30257030,
      "score": 1,
      "time": 1644317927,
      "title": "Memorization or Creativity AI Way of Thinking",
      "type": "story",
      "url": "https://s3nh.github.io"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30257028,
      "score": 1,
      "time": 1644317911,
      "title": "Texas butterfly centre targeted by conspiracies closes over security concerns",
      "type": "story",
      "url": "https://www.cbc.ca/radio/asithappens/as-it-happens-monday-edition-1.6342527/texas-butterfly-centre-targeted-by-far-right-conspiracies-closes-over-security-concerns-1.6342535"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30257025,
      "score": 1,
      "time": 1644317894,
      "title": "Exclusive – Senior separatist urges Russia to send 30k troops to east Ukraine",
      "type": "story",
      "url": "https://www.euronews.com/2022/02/08/uk-ukraine-crisis-donetsk-exclusive"
    },
    {
      "by": "kevincox",
      "descendants": 0,
      "id": 30257011,
      "score": 2,
      "time": 1644317775,
      "title": "Search Engines Will Deindex All Domains That Have 100 Links to Pirated Content",
      "type": "story",
      "url": "https://torrentfreak.com/search-engines-will-deindex-all-domains-that-have-100-links-to-pirated-content-220208/"
    },
    {
      "by": "shivajikobardan",
      "descendants": 1,
      "id": 30256999,
      "kids": [
        30257000
      ],
      "score": 1,
      "text": "1) Really messed up my uni life. Indulged into various addictions like addiction of making money online. making free money. wasted almost 3 years of uni life in it. 2.5 years to be exact..<p>Didn&#x27;t keep notes of any subject even though i passed subject with ease as I had good track record of being a good student in the past as well. I was one of the toppers upto grade 12. Suddenly this making free money concept hit me during college life and I truly wasted lots of time in university.<p>2) I know really nth. I started studying seriously and found a learning method that works for me in 4th year :(. I have studied every subject since 4th year very properly. I had failed few subjects in the past like 5 subjects and I studied them well irrespective of how much marks I will get as that is dependent on how much revision I do.<p>I am from computer engineering branch..My first goal is to get a web development job here in nepal. get a good earning by working for 5 years. like save 20000 USD. and apply for masters in usa for either ML&#x2F;AI&#x2F;DS&#x2F;DL or some wireless commxn and stuffs from ECE branch. and settle there if I feel ready for it.<p>3) I had severe depression during university as life hit hard when I was in university. Due to those reasons, I was never on my best in university life. Messed up totally.<p>4) I haven&#x27;t failed anything. It is because I was too good to fail exams. Even if I study nth I could go to exam and pass the exam..maybe exams in Nepal are easier who knows.<p>5) Slowly my depression is being cured by the help of good doctor but this thing is hitting me hard..I am afraid how would I settle for after university life. I will surely be jobless for 3 years, that is written in stars. At the very minimum.<p>6) After my failed journey with blogging and stuffs, I have developed a hate towards several professions..Anything related to business. I feel like a loser when I do that as my primary profession. Marketing, sales, enterpreneurship..name any..I feel like yuck when I see myself doing those jobs. Specially since I have a degree in engineering. I should be doing engineering jobs and it is really tough for my mentality to change...I am hecking depressed to even think what other people would think of me...<p>7) The only good part as per se is that I have finally mastered the art of learning slowly and steadily and I am at a position where I can learn things with 60% efficiency at least. I was worse before.<p>My current goals are learning enough programming to get a web development job then think for future. That would really settle my future imo. I already know entrepreneurships and stuffs. Blogging has always been my passion. My adsense is verified, so it won&#x27;t really take me much to write stuffs again and make like 50$ per month which is a lot in Nepal. It is like 8000 NPR. Job pays around 300 USD for newbies. Honestly, I will work even for free...if I am going to learn what I want to learn...Money doesn&#x27;t matter to me as currently my parents are rich enough(they are middle class actually...lower middle class) to give me food and clothes. I already have shelter as in Nepal we live with parents forever.<p>But it hurts my ego and prestige...IDK what to do and there is this depression of leaving university life hitting me right in my head...My depression is being cured and here is new thing arrived..And I don&#x27;t even think this is sth abnormal. This is perfectly normal and should not require medical consultation imo...But since I messed up badly in past, things are hitting me different.<p>I need somewhere around 50K USD saved up to make up for master&#x27;s in USA. Even if I make 25K USD in 5 years, my parents will allow me to do it with their help...But I don&#x27;t think  USA accepts applicants who have 5 years gap between studying and master&#x27;s studying :(",
      "time": 1644317683,
      "title": "University is ending in few days, getting depression",
      "type": "story"
    },
    {
      "by": "kklisura",
      "descendants": 0,
      "id": 30256991,
      "kids": [
        30257034
      ],
      "score": 1,
      "time": 1644317569,
      "title": "Biden officials trying to recalculate U.S. Covid-19 hospitalizations",
      "type": "story",
      "url": "https://www.politico.com/news/2022/02/07/biden-covid-hospitalization-data-recalculate-00006341"
    },
    {
      "by": "notRobot",
      "descendants": 0,
      "id": 30256984,
      "score": 5,
      "time": 1644317505,
      "title": "Porn sites will be legally required to verify users' age using credit card",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-60293057"
    }
  ]
}