{
  "stories": [
    {
      "by": "lostintangent",
      "descendants": 0,
      "id": 28338878,
      "score": 1,
      "time": 1630165080,
      "title": "Show HN: WikiLens – A Markdown-driven knowledge base for GitHub.dev",
      "type": "story",
      "url": "https://github.com/lostintangent/wikilens"
    },
    {
      "by": "nobobsmyuncle",
      "descendants": 0,
      "id": 28338873,
      "score": 1,
      "text": "One of the side projects I&#x27;ve been working on in my spare time has a simple landing page&#x2F;placeholder with a pre-release sign-up form (to build a mailing list of those who might be interested in the new service when it launches).<p>Yesterday, out of the blue, I started receiving some &#x27;interesting&#x27; emails to an unknown user&#x2F;address at that side-project&#x27;s domain.<p>First were a couple of website signups that needed an email verification click. I didn&#x27;t think too much about it, guessing that maybe someone had mistyped their email address from a similarly spelled domain. It happens. But then came a Google workspace setup verification email (legit, from Google). I called Google workspace support and they understood that I owned the domain and also that I had not initiated setting up Google Workspace. They informed me that whoever was doing that would not be successful because they would have to prove ownership of the domain. In my experience this is usually done by adding record to DNS, or by placing a file with a long random key on the server that hosts the website, so maybe I shouldn&#x27;t be too worried about that?<p>But then today, I am starting to get more email to that domain&#x2F;address containing canned responses from websites that loan money, credit card companies, etc.<p>So is this some amateurish attempt at identity theft?\nWhat is the endgame here? Anybody have any experience with something like this?<p>What should I be doing? I changed several passwords since yesterday, added extra protection to the domain name at the registrar to prevent hijacking, but what else should I be doing?<p>Advice welcomed.",
      "time": 1630165049,
      "title": "Strange domain problem – need advice",
      "type": "story"
    },
    {
      "by": "yaa_minu",
      "descendants": 0,
      "id": 28338871,
      "score": 2,
      "time": 1630165029,
      "title": "The Problem with “The Seven Keys”",
      "type": "story",
      "url": "https://www.icann.org/en/blogs/details/the-problem-with-the-seven-keys-13-2-2017-en"
    },
    {
      "by": "starkd",
      "descendants": 0,
      "id": 28338868,
      "score": 1,
      "time": 1630165014,
      "title": "Silicon Valley's biggest fraud is on trial",
      "type": "story",
      "url": "https://www.axios.com/silicon-valley-fraud-trial-theranos-elizabeth-holmes-4cf45ae1-a01a-4d80-8f41-07928d9830a4.html"
    },
    {
      "by": "jensgk",
      "descendants": 0,
      "id": 28338839,
      "score": 1,
      "time": 1630164787,
      "title": "A Python Data Scientist’s Guide to the Apple Silicon Transition",
      "type": "story",
      "url": "https://www.anaconda.com/blog/apple-silicon-transition"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 28338830,
      "score": 2,
      "time": 1630164750,
      "title": "After 18 years, SCO's IBM litigation may be settled for $14.5M",
      "type": "story",
      "url": "https://news.slashdot.org/story/21/08/28/0237243/after-18-years-scos-ibm-litigation-may-be-settled-for-145-million"
    },
    {
      "by": "ryan_j_naughton",
      "descendants": 0,
      "id": 28338826,
      "score": 2,
      "time": 1630164712,
      "title": "China plans control of tech algorithms that US can only dream of",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-27/china-plans-control-of-tech-algorithms-u-s-can-only-dream-of"
    },
    {
      "by": "leetrout",
      "descendants": 0,
      "id": 28338797,
      "score": 1,
      "time": 1630164481,
      "title": "Show HN: Printable kid's door hangers supporting social distancing",
      "type": "story",
      "url": "https://www.distancekids.com/"
    },
    {
      "by": "ElectricMind",
      "descendants": 1,
      "id": 28338787,
      "kids": [
        28338887
      ],
      "score": 1,
      "text": "Unless someone made money teaching philosophy about life, I think it is phony for rich people to tell others about &quot;moderation, family, values and what not&quot;. I mean they become rich by putting everything on backseat and then when they hit millionaire or billionaire, they start preaching online, writing &quot;lessons learned&quot; and worst make more money by &quot;selling&quot; philosophy. I can&#x27;t stand this anymore. Any one else feels this way too?",
      "time": 1630164436,
      "title": "Ask HN:Who else sick of “Rich” people teaching moral/life philosophy?",
      "type": "story"
    },
    {
      "by": "nimfan",
      "descendants": 0,
      "id": 28338757,
      "score": 1,
      "time": 1630164199,
      "title": "Tesla Dojo – Chip Design Allow an Order Magnitude Advantage over Competing AI",
      "type": "story",
      "url": "https://semianalysis.substack.com/p/tesla-dojo-unique-packaging-and-chip"
    }
  ]
}