{
  "stories": [
    {
      "by": "joering2",
      "descendants": 0,
      "id": 31424731,
      "score": 1,
      "time": 1652891378,
      "title": "Musk wars with Twitter over his buyout deal",
      "type": "story",
      "url": "https://apnews.com/article/elon-musk-technology-a71c76ed753b144f4aee081df5ab707c"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31424730,
      "score": 1,
      "time": 1652891373,
      "title": "The pandemic’s true health cost: how much of our lives has Covid stolen?",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01341-7"
    },
    {
      "by": "marcoslozada",
      "descendants": 0,
      "id": 31424729,
      "score": 1,
      "time": 1652891371,
      "title": "Polygon Funds",
      "type": "story",
      "url": "https://polygon.technology/funds/"
    },
    {
      "by": "wapiou",
      "descendants": 1,
      "id": 31424724,
      "kids": [
        31424726
      ],
      "score": 1,
      "time": 1652891353,
      "title": "We made a social language learning app for African languages",
      "type": "story",
      "url": "https://mandla.app"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31424719,
      "score": 1,
      "time": 1652891324,
      "title": "The Court is ignoring science",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/science.adc9968"
    },
    {
      "by": "memish",
      "descendants": 0,
      "id": 31424704,
      "score": 1,
      "time": 1652891260,
      "title": "Exxon is rated top ten best in world for ESG, while Tesla didn’t make the list",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1526958110023245829"
    },
    {
      "by": "kkielhofner",
      "descendants": 0,
      "id": 31424683,
      "score": 1,
      "text": "Hey HN!<p>We just launched[0] our NFT search engine at <a href=\"https:&#x2F;&#x2F;fnftf.io\" rel=\"nofollow\">https:&#x2F;&#x2F;fnftf.io</a>.<p>NFT frauds, copies, forgeries, etc are rampant. As one example check out a search[1] for a random Bored Ape that shows about a dozen visually indistinguishable copies of the Ape. You can also expand the results to see the various ummmm, “remixes” of the image submitted for search (and play with various filters, etc).<p>With that out of the way here’s how we built FNFTF:<p>- Blockchain... We run our own node infrastructure because the various node providers get really expensive really quickly when you need to index chains like we do. We have a custom Node backend written in TypeScript that handles this indexing (both historical and realtime) with HTTP and WebSocket connections to our various nodes. I can spend a lot of time talking about how challenging this first step is…<p>- We fetched and cataloged all of the on chain data and the metadata and actual content (wherever it may be). We do this in realtime as new NFTs are minted, sold, whatever. This has plenty of challenges too.<p>- We add the media content (currently all image and video formats) to our database via our perceptual hashing implementation.<p>- Search and comparison is the tricky one... Every so often we build an approximate nearest neighbors index for all of the content in the perceptual hashing database. This is then loaded in memory.<p>- The actual search comes in multiple passes. We first take submitted content and generate an abbreviated perceptual hash for it. We search the ANN index to get a first pass of results using various standard distance approaches. We then filter that first pass through higher resolution perceptual hashes to increasingly filter the results and generate distance scores for percentage of content match scoring.<p>- The backend for the hash and search steps is python powered by FastAPI.<p>- The API frontend is a Cloudflare worker in Bundled mode. We currently use about 6ms of CPU time so we have plenty of room there.<p>- The fnftf.io page is Next with a lot of React components generated statically and served via Cloudflare Pages<p>- Speaking of Cloudflare, we use Workers to fetch the image results from our backend storage to reisze, re-compress, and add our watermark. This is crucial because we want to provide result images but we definitely don’t want to further enable scammers.<p>- We cache search results in a CF Workers KV store for speedier follow-up searches and to enable search sharing on social media, etc. In terms of caching it’s not terribly effective because it relies on matching a hash of the search but it’s good for the sharing aspect.<p>- Our browser extension[2] is absolute bare bones and enables two click searches directly from about a dozen NFT marketplaces. All it does is get the image URL and launch a new tab to fnftf.io with the image URL as a parameter. Then we fetch that URL and do our thing.<p>All in we have about 40TB of data, growing by the day as we index new content and add blockchains.<p>I’m the sole founder at Tovera and only full time employee. I’d love to hear what the HN community thinks about FNFTF.io!<p>[0] <a href=\"https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;fight-nft-fraud\" rel=\"nofollow\">https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;fight-nft-fraud</a><p>[2] <a href=\"https:&#x2F;&#x2F;fnftf.io&#x2F;?results=00722cd4e7124f8aab052e31b14e301e3716e02ace6bf4ce95188771bab1687e\" rel=\"nofollow\">https:&#x2F;&#x2F;fnftf.io&#x2F;?results=00722cd4e7124f8aab052e31b14e301e37...</a><p>[2] <a href=\"https:&#x2F;&#x2F;chrome.google.com&#x2F;webstore&#x2F;detail&#x2F;tovera&#x2F;gcghgjemlnabhknkkibnoohlajdbhani\" rel=\"nofollow\">https:&#x2F;&#x2F;chrome.google.com&#x2F;webstore&#x2F;detail&#x2F;tovera&#x2F;gcghgjemlna...</a>",
      "time": 1652891193,
      "title": "Show HN: We made reverse image search for NFTs to identify fraud and forgery",
      "type": "story",
      "url": "https://fnftf.io/"
    },
    {
      "by": "maxbaines",
      "descendants": 0,
      "id": 31424647,
      "score": 1,
      "time": 1652890974,
      "title": "Read Comics Online",
      "type": "story",
      "url": "https://viewcomics.me"
    },
    {
      "by": "ossama",
      "descendants": 0,
      "id": 31424643,
      "score": 2,
      "time": 1652890950,
      "title": "Stripe Data Pipeline",
      "type": "story",
      "url": "https://stripe.com/data-pipeline"
    },
    {
      "by": "lifestagesq",
      "descendants": 0,
      "id": 31424641,
      "score": 1,
      "time": 1652890931,
      "title": "In hot pursuit of ‘cryware’: Defending hot wallets from attacks",
      "type": "story",
      "url": "https://www.microsoft.com/security/blog/2022/05/17/in-hot-pursuit-of-cryware-defending-hot-wallets-from-attacks/"
    }
  ]
}