{
  "stories": [
    {
      "by": "patrickdevivo",
      "descendants": 0,
      "id": 27743370,
      "score": 1,
      "time": 1625534300,
      "title": "Golang Bindings for Tree-Sitter",
      "type": "story",
      "url": "https://github.com/smacker/go-tree-sitter"
    },
    {
      "by": "drewmate",
      "descendants": 0,
      "id": 27743369,
      "score": 1,
      "time": 1625534297,
      "title": "NYC agency floats nightlife district plan",
      "type": "story",
      "url": "https://apnews.com/article/nyc-state-wire-ny-state-wire-lifestyle-fe4f57a5339fd94294e5baf070f81762"
    },
    {
      "by": "captmorrel",
      "descendants": 0,
      "id": 27743368,
      "score": 1,
      "text": "I have been working in the software field 20+ years. During all this time, I have never really taken a long break. I have thought about it a lot recently, and feel that stepping away from a 9-to-5 grind for some time (with the intent of getting back) would be helpful for the following reasons:\n1) Exploring tech you are interested in on your own schedule. If you are exploring something deep, I feel like its very beneficial to set your own pace and schedule.\n2) Having a free mind might allow some ideas to emerge that you can refine and work on. And maybe set a track for a new job when you get back.<p>My aim with this question here is not to solicit suggestions on whether a break is good or not career-wise. I am also not concerned about employers seeing a gap in my resume, since I feel I would not do well anyway with employers who raise it as a red flag, and I would avoid them.<p>I am just trying to get an idea of what you did during a break like that, and whether you thought it was worth it, or if it helped you in some way when you got back to the grind. I would be more interested if your activity during the break was somehow related to tech, as that&#x27;s what I am aiming to do. I am aware that traveling and unplugging&#x2F;digital detoxing and all are excellent options - just not something I have in mind for this iteration :)",
      "time": 1625534273,
      "title": "Ask HN: Have you ever taken a 6-month to 1 yr break anytime during your career?",
      "type": "story"
    },
    {
      "by": "stopachka",
      "descendants": 0,
      "id": 27743354,
      "score": 1,
      "time": 1625534074,
      "title": "Observability and Iteration in Nutrition",
      "type": "story",
      "url": "https://stopa.io/post/282"
    },
    {
      "by": "tiagorbf",
      "descendants": 0,
      "id": 27743323,
      "score": 1,
      "time": 1625533492,
      "title": "Podcast episode with my favorite web tools for a project",
      "type": "story",
      "url": "https://anchor.fm/wannabentrepreneur/episodes/57---My-top-favorite-bootstrapping-tools-of-all-time-e13tnk1"
    },
    {
      "by": "postpawl",
      "descendants": 0,
      "id": 27743318,
      "score": 1,
      "time": 1625533421,
      "title": "Batteryhookup.com’s Customer DIY Projects and Builds",
      "type": "story",
      "url": "https://batteryhookup.com/pages/customer-projects"
    },
    {
      "by": "voisin",
      "descendants": 0,
      "id": 27743312,
      "score": 1,
      "time": 1625533370,
      "title": "'Supertrees' engineered to capture more carbon stir anti-GMO backlash",
      "type": "story",
      "url": "https://geneticliteracyproject.org/2021/07/02/why-is-the-us-so-retrograde-when-it-comes-to-biotech-supertrees-engineered-to-capture-more-carbon-stirs-anti-gmo-backlash/"
    },
    {
      "by": "holycrapguys",
      "descendants": 0,
      "id": 27743303,
      "score": 3,
      "text": "I&#x27;ve been out of high school for almost 12 years. \nAnd I&#x27;ve never had a job I really loved.<p>I&#x27;ve worked in about 20 different industries from the oilfield to construction to food service, to debt collection, to transportation, to everything in between.  Nothing in tech though.<p>Some were possible &quot;good&quot; jobs, but often they&#x27;re very dangerous. I was an apprentice in a trade that has the potential to earn a lot 5 years in.<p>It&#x27;s like I work for a bit and I&#x27;ll get to a point where I just want to quit and be done with it.  Or there are conditions I just don&#x27;t want to put up with anymore so I just walk.<p>I&#x27;ve never felt content or joy at work, which I think is normal, but I also think some other people enjoy their work.<p>It&#x27;s also part laziness, I can be slothful without a routine.<p>But I just feel so lost. I almost feel too old to keep constantly moving on to something else.<p>Has anybody else been in this situation and come out the other side with meaningful work that they like? And they&#x27;re able to support themselves?<p>Just feel lost, I guess. Thank you.",
      "time": 1625533280,
      "title": "30 years old with no career",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 27743294,
      "score": 1,
      "time": 1625533152,
      "title": "Ubuntu 21.10 Compressing Debian Packages with Zstd",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Zstd-Debs"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 27743289,
      "score": 1,
      "time": 1625533076,
      "title": "Ultrasounds Could Restore Human Memory and Reverse Dementia",
      "type": "story",
      "url": "https://interestingengineering.com/ultrasounds-restore-human-memory-reverse-dementia"
    }
  ]
}