{
  "stories": [
    {
      "by": "myroon5",
      "descendants": 0,
      "id": 30141073,
      "score": 1,
      "time": 1643576673,
      "title": "Okta app usage annual report [pdf]",
      "type": "story",
      "url": "https://www.okta.com/sites/default/files/2022-01/Business-at-Work-2022-Annual-Report-Okta.pdf"
    },
    {
      "by": "ianopolous",
      "descendants": 0,
      "id": 30141069,
      "score": 1,
      "time": 1643576668,
      "title": "Show HN: Release the BATs (block level access control in IPFS)",
      "type": "story",
      "url": "https://peergos.org/posts/bats"
    },
    {
      "by": "arunbahl",
      "descendants": 0,
      "id": 30141068,
      "score": 1,
      "time": 1643576664,
      "title": "I Am a Meme Now – and So Are You",
      "type": "story",
      "url": "https://humanparts.medium.com/i-am-a-meme-now-and-so-are-you-3bae8ecf9971"
    },
    {
      "by": "lifeplusplus",
      "descendants": 0,
      "id": 30141066,
      "score": 1,
      "text": "I want simple schema editor, where I can add&#x2F;change sql schema, preferably simple GUI that generates update&#x2F;alter&#x2F;etc commands and it&#x27;d generate up&#x2F;down migrations which then can also be ran then on prod.",
      "time": 1643576656,
      "title": "Ask HN: How can I get clean solution for migrations in Node.js?",
      "type": "story"
    },
    {
      "by": "jordigh",
      "descendants": 0,
      "id": 30141063,
      "score": 1,
      "time": 1643576644,
      "title": "Recovering Nintendo’s Lost SimCity for the NES",
      "type": "story",
      "url": "https://gamehistory.org/simcity/"
    },
    {
      "by": "chelmrocks",
      "descendants": 0,
      "id": 30141046,
      "score": 2,
      "time": 1643576515,
      "title": "Joe Rogan Says: Delete Spotify",
      "type": "story",
      "url": "https://www.deletespotify.org"
    },
    {
      "by": "Fnalsk",
      "descendants": 0,
      "id": 30141037,
      "score": 1,
      "text": "We just launched the first version of Pidgeon. It’s meant to be a sort of “reddit for photos”, and we’re trying to fix a lot of the problems instagram has.<p>Quite a lot of people these days hate instagram for one reason or another. Maybe you hate the amount of ads it has. Maybe you hate the algorithm. Maybe you hate the shop section that no one ever uses. Maybe you hate the data collection, or reels, or that it just seems like a giant popularity contest.<p>We want to address all of the above.<p><i>Organic outreach</i><p>The feed is organized chronologically. Here you will only see your own posts and the posts of people you follow. Don’t worry about bots or engagement because that won’t tank your reach.<p>The discovery queue is split into different categories, kind of like subreddits. Each post is then ranked by how good users think the photos in the post are, divided by a function of the age of the post - essentially the upvote&#x2F;downvote system that exists on reddit. There are also no hashtags, because we didn’t want people to waste time coming up with a bunch. We think that in the long term, hashtags are a net negative as a feature.<p>Of course, you can’t pay to promote your post, and this will never change.<p><i>Photo based chat rooms</i><p>When you share a photo, it’s a natural thing to want to talk about it. But comments aren’t always the nicest way to do this. So we made photo based chat rooms. You can create or join chat rooms and specify a couple categories for the room. Any time someone in the room makes a post to a category that’s associated with the room, the post will be shared to the room as well.<p>So every time you make a post, your photos will be shared with a group of people who have a similar interest in the type of photo you’re posting. This also has another effect - usually social platforms need a couple million users to reach a “critical mass”, or a point where there’s any value at all to using the app. But with a chat room, you only need a hundred or so users for it to have value - and in fact, oftentimes you don’t want much more than that in the room anyway. We’re hoping this allows people to find value in using the app before we grow to a massive userbase.<p><i>We won’t run ads</i><p>Besides the obvious upside of not seeing ads, this also means we don’t have an incentive to collect your personal data and sell it to advertisers. Discord has shown that the freemium model can work, and that’s what we plan to do - most of the app being free, with none of the paid features being “essential”. In fact, for the near future we still have a ton of features we’d like to add to the app, and none of them are paid.<p><i>Other things…</i><p>We won’t add something stupid like the shop tab or snap scrolling on instagram. In fact, if we add something that our users end up hating, we’ll get rid of it. We have to, because our business model relies on keeping our users happy.<p>In addition, only you can see who you’re following. So no more of that “follow me follow back” nonsense. Only follow people whose content you actually want to see, and unfollow them whenever you want without them knowing. Follower counts will still be public.<p>We also have dark mode from day 1<p>If you want to check it out, it’s on the app store and play store:<p>https:&#x2F;&#x2F;apps.apple.com&#x2F;app&#x2F;id1605784768<p>https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=app.pidgeon.pidgeon",
      "time": 1643576462,
      "title": "Show HN: An Instagram Alternative",
      "type": "story"
    },
    {
      "by": "rkachowski",
      "descendants": 0,
      "id": 30141024,
      "score": 1,
      "time": 1643576423,
      "title": "The Fun Scale: The three different types of fun",
      "type": "story",
      "url": "https://www.rei.com/blog/climb/fun-scale"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 30140999,
      "score": 3,
      "time": 1643576288,
      "title": "Howard Hesseman, Star of ‘WKRP in Cincinnati,’ 'Head of the Class', Dies at 81",
      "type": "story",
      "url": "https://variety.com/2022/tv/news/howard-hesse-man-dead-wkrp-in-cincinnati-police-academy-1235167152/"
    },
    {
      "by": "radley",
      "descendants": 0,
      "id": 30140984,
      "score": 3,
      "time": 1643576121,
      "title": "A UX designer walks into a Tesla Bar",
      "type": "story",
      "url": "https://jenson.org/tesla/"
    }
  ]
}