{
  "stories": [
    {
      "by": "pjfin123",
      "descendants": 1,
      "id": 29387405,
      "kids": [
        29387416
      ],
      "score": 2,
      "time": 1638233251,
      "title": "Open source minimalist translation API",
      "type": "story",
      "url": "https://github.com/dothq/translate"
    },
    {
      "by": "ageofwant",
      "descendants": 0,
      "id": 29387391,
      "score": 1,
      "time": 1638233114,
      "title": "Emacs Docs The modern documentation website Emacs deserves",
      "type": "story",
      "url": "https://www.emacsdocs.org/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29387380,
      "score": 1,
      "time": 1638232988,
      "title": "Review: Netgate 6100",
      "type": "story",
      "url": "https://ipng.ch/s/articles/2021/11/26/netgate-6100.html"
    },
    {
      "by": "snthd",
      "descendants": 0,
      "id": 29387344,
      "score": 1,
      "time": 1638232726,
      "title": "ICCL Submits EC Oversight Complaint about Ireland's Failure to Uphold GDPR",
      "type": "story",
      "url": "https://www.iccl.ie/news/iccl-launches-european-ombudsman-complaint-against-european-commissions-failure-to-take-ireland-to-court-over-the-gdpr/"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29387340,
      "score": 1,
      "time": 1638232711,
      "title": "Deceive the Heavens to Cross the Sea",
      "type": "story",
      "url": "https://www.threatfabric.com/blogs/deceive-the-heavens-to-cross-the-sea.html"
    },
    {
      "by": "1cvmask",
      "descendants": 1,
      "id": 29387308,
      "kids": [
        29387332
      ],
      "score": 1,
      "time": 1638232562,
      "title": "Google Play apps downloaded 300k times stole bank credentials",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/11/google-play-apps-downloaded-300000-times-stole-bank-credentials/"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 29387292,
      "score": 1,
      "time": 1638232459,
      "title": "Long View: Is the World Deglobalising?",
      "type": "story",
      "url": "https://www.realchinacharts.com/p/8-long-view-is-the-world-deglobalising"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 29387289,
      "score": 1,
      "time": 1638232432,
      "title": "The Hartz employment reforms in Germany",
      "type": "story",
      "url": "https://www.centreforpublicimpact.org/case-study/hartz-employment-reforms-germany"
    },
    {
      "by": "ablekh",
      "descendants": 0,
      "id": 29387266,
      "score": 1,
      "time": 1638232270,
      "title": "IPOs and Beyond: A Guide to Exit Options for Companies",
      "type": "story",
      "url": "https://future.a16z.com/ipos-and-beyond-a-guide-to-exit-options-for-companies/"
    },
    {
      "by": "danrocks",
      "descendants": 0,
      "id": 29387264,
      "score": 1,
      "text": "Recently I interviewed with Stripe for an engineering MoM (Manager of Managers) for one of their teams. I interview regularly, so I am used to many types of processes, feedback mechanisms, and so on. I won&#x27;t go into details about the questions because there&#x27;s nothing special about them, but I wanted to share some details of my experience for people thinking of interviewing there.<p>1) About 35-40% of the interviewers started their questioning by saying &quot;I will only need 20 minutes for this&quot;, while emphasizing it is an important leadership position that they are hiring for. So 20 minutes is all needed to identify &quot;important, critical leaders&quot;? What a strange thing to say - also a GREAT way to make candidates feel important and wanted!<p>2) There is significant shuffling of interviewers and schedules. One almost has to be on-call to be able to react quickly.<p>3) For an engineering manager position, I only interviewed with only technical person. To me it hints that Engineering MoM is not a very technical position.<p>4) Of all the people I spoke to, the hiring manager was the one I spoke the least with. The phone screen was one of the &quot;I only need 20 minutes for this&quot; calls. The other one was quite amusing, and is described below.<p>5) After the loop was done, the recruiter called me to congratulate me on passing, and started discussing details of the offer, including sending me a document described the equity program. Recruiter mentioned that the hiring manager would be calling me to discuss the position next.<p>6) SURPRISE INTERVIEW! I get a call from the hiring manager, he congratulates me on passing the loop, then as I prepare to ask questions about the role, he again says &quot;I need to ask you two questions and need 20 minutes for this&quot;. Then proceeds to ask two random questions about platforms and process enforcement, then hangs up the call after I answer. Tells me he&#x27;d be calling in a week to discuss the position.<p>7) I get asked for references.<p>8) After passing the loop, have the recruiter discuss some details of the offer, have the hiring manager tell me they&#x27;d be calling me after a week, I get ghosted for about 3.5 weeks. References are contacted and feedback is confirmed positive.<p>9) I ping the recruiter to see when the offer is coming - it&#x27;s not coming. They chose another candidate. I am fine with it, even after being offered verbally, but the ghosting part after wasting so much of my time seems almost intentional.<p>10) I call up a senior leader in the office I applied to, an acquaintance of mine. His answer: &quot;don&#x27;t come. It&#x27;s a mess and a revolving door of people&quot;. I was shocked with the response.<p>11) I get called by the recruiter saying that another director saw my feedback and is very interested in talking to me and do an interview loop.<p>Guess I&#x27;m not joining, then.<p>I am ok with passing loops, being rejected, I&#x27;ve seen it all. But being ghosted after acceptance is a first. What a bizarre place this is.",
      "time": 1638232259,
      "title": "Accepted and ghosted: interviewing for a leadership position at Stripe",
      "type": "story"
    }
  ]
}