{
  "stories": [
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30997139,
      "score": 1,
      "time": 1649723887,
      "title": "Ukrainian Twitch Stars Are Streaming the War to Their Russian Audience",
      "type": "story",
      "url": "https://www.vice.com/en/article/wxda45/ukrainian-twitch-stars-are-streaming-the-war-to-their-russian-audience"
    },
    {
      "by": "CPLX",
      "descendants": 1,
      "id": 30997123,
      "kids": [
        30997140
      ],
      "score": 3,
      "text": "Just received a very strange email from Bill.com:<p>Hello,<p>We wanted to let you know that as of March 21st, 2022 we enabled a new feature called Bill.com balance for your account. We apologize for not communicating this ahead of time which is our standard practice.<p>This new Bill.com balance capability enables you to pre-fund your Bill.com account, store funds for payment flexibility, and enable faster payment delivery times with no additional fees.<p>It’s important to note that this change means that as of March 21st all payments received through Bill.com are automatically routed to your Bill.com balance instead of your connected bank accounts. As long as Bill.com balance is activated, the funds will continue to be routed this way.<p>To withdraw funds from your Bill.com balance:<p>From the Overview section of your Bill.com account, select Manage Balance\nIn the Manage Balance section, select the three dots, then select Withdraw Money\nEnter the amount you want to withdraw in the Amount field, choose which connected account you want to withdraw the money to, and select the Withdraw button\nWithdrawals initiated by 5pm pacific time will lead to funds being available next business day by 10am pacific time\nOnce you’ve withdrawn all funds from your Bill.com balance, you can also choose to turn the feature off.<p>To turn Bill.com balance off:<p>In your Bill.com account, select Settings, then select Bank &amp; Payment Accounts, then select Bill.com balance\nSelect the Turn off button\nQuestions? Learn more about Bill.com balance or contact us by clicking HERE. We’re here to help.<p>Thank you,\nThe Bill.com Team<p>This seems genuinely crazy. Like without warning, without prior opt-in authorization, a company that&#x27;s responsible for vast amounts of business to business payments, made the call that it was OK to, just, not actually send money onwards to their customers? Not as a feature they enabled, or even something that&#x27;s a little aggressively pitch, they just did it. So a customer of yours decided to send you money, and thought they&#x27;d sent it to you, but instead it never got to you, your payment intermediary just held it in some kind of new payments account they decided to assign in your name without even getting your permission.",
      "time": 1649723751,
      "title": "Bill.com Apparently Decided to Keep Customer Money",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30997104,
      "score": 1,
      "time": 1649723647,
      "title": "Intel Thermal daemon: Linux daemon used to prevent the overheating of platforms",
      "type": "story",
      "url": "https://github.com/intel/thermal_daemon"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30997093,
      "score": 1,
      "time": 1649723564,
      "title": "Tickets Available for Session 12 of the Story of Industrial Civilization: Can",
      "type": "story",
      "url": "https://rootsofprogress.org/tickets-available-for-session-12-of-the-story-of-industrial-civilization-can-progress-continue"
    },
    {
      "by": "alain_bianchini",
      "descendants": 0,
      "id": 30997083,
      "score": 2,
      "time": 1649723437,
      "title": "A Social Network for Challenges",
      "type": "story",
      "url": "https://blog.tulin.app/launching-tulin-d11591ae713"
    },
    {
      "by": "themerone",
      "descendants": 0,
      "id": 30997073,
      "score": 2,
      "text": "Where are the standard documents for the various ATX and ITX specifications published?",
      "time": 1649723384,
      "title": "Ask HN: Where are ATX and ITX standards published?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30997070,
      "score": 2,
      "time": 1649723358,
      "title": "Meta Tests Letting Creators Sell Items in Horizon Worlds",
      "type": "story",
      "url": "https://uploadvr.com/meta-horizon-worlds-payments/"
    },
    {
      "by": "apstats",
      "descendants": 0,
      "id": 30997007,
      "score": 1,
      "time": 1649722889,
      "title": "Cruise Driverless Car Pulled Over in San Francisco",
      "type": "story",
      "url": "https://www.cnbc.com/2022/04/10/video-shows-what-happens-when-a-driverless-car-gets-pulled-over.html"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30997004,
      "score": 1,
      "time": 1649722873,
      "title": "“Decolonising Math”: Durham U Asks Professors to Consider Race of Mathematicians",
      "type": "story",
      "url": "https://jonathanturley.org/2022/04/11/decolonising-math-durham-university-asks-professors-to-consider-the-race-of-mathematicians-before-relying-on-their-work/"
    },
    {
      "by": "ffhhj",
      "descendants": 0,
      "id": 30996966,
      "score": 1,
      "text": "Some websites present a block of text for different tags or links that are popular, and each of these words have different font sizes, what is this called? It seems to me there aren&#x27;t other compact ways to represent a graph in text mode. In 2D&#x2F;3D graphs are represented with connected nodes, but when there are too many nodes the result is very cluttered. The most similar presentation in text mode is the directory tree, but it isn&#x27;t compact, the list will grow vertically.",
      "time": 1649722635,
      "title": "Ask HN: Ways to represent graph of nodes with text?",
      "type": "story"
    }
  ]
}