{
  "stories": [
    {
      "by": "generichuman",
      "descendants": 0,
      "id": 31345873,
      "score": 1,
      "time": 1652303674,
      "title": "Fips – an Integrated Build Environment for C/C++",
      "type": "story",
      "url": "https://floooh.github.io/fips/"
    },
    {
      "by": "ossusermivami",
      "descendants": 0,
      "id": 31345872,
      "score": 1,
      "time": 1652303673,
      "title": "Red Hat RHEL 9 release",
      "type": "story",
      "url": "https://www.redhat.com/en/about/press-releases/red-hat-defines-new-epicenter-innovation-red-hat-enterprise-linux-9"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 31345853,
      "score": 1,
      "time": 1652303599,
      "title": "Electrifying: Startup’s Add-On Turns Trucks into Hybrids in Minutes",
      "type": "story",
      "url": "https://blog.hubspot.com/the-hustle/add-on-turns-trucks-into-hybrids"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 31345845,
      "score": 1,
      "time": 1652303564,
      "title": "Crypto Billionaires’ Vast Fortunes Are Destroyed in Weeks",
      "type": "story",
      "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=1c028f42-d16f-11ec-a56c-454367504655&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNS0xMS9jcnlwdG8tYmlsbGlvbmFpcmVzLXZhc3Qtd2VhbHRoLWRlc3Ryb3llZC1pbi13ZWVrcy1hbWlkLXR1cm1vaWw="
    },
    {
      "by": "jcs87",
      "descendants": 0,
      "id": 31345840,
      "score": 1,
      "time": 1652303548,
      "title": "A Tactical Guide to Working with EAs: How to Make Delegation Your Superpower",
      "type": "story",
      "url": "https://review.firstround.com/a-tactical-guide-to-working-with-eas-how-to-make-delegation-your-superpower"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 31345835,
      "score": 2,
      "time": 1652303508,
      "title": "Why is the open source driver release from Nvidia so important for Linux?",
      "type": "story",
      "url": "https://blogs.gnome.org/uraeus/2022/05/11/why-is-the-open-source-driver-release-from-nvidia-so-important-for-linux/"
    },
    {
      "by": "Kononiukjacob",
      "descendants": 1,
      "id": 31345815,
      "kids": [
        31345816
      ],
      "score": 1,
      "time": 1652303434,
      "title": "Have your online return picked up",
      "type": "story",
      "url": "https://readilyau.com"
    },
    {
      "by": "jeffbee",
      "descendants": 0,
      "id": 31345811,
      "score": 1,
      "time": 1652303419,
      "title": "Google Cloud unveils world’s largest publicly available ML hub",
      "type": "story",
      "url": "https://cloud.google.com/blog/products/compute/google-unveils-worlds-largest-publicly-available-ml-cluster"
    },
    {
      "by": "dadver",
      "descendants": 0,
      "id": 31345792,
      "score": 1,
      "text": "I hope this constitutes a worthy Ask HN topic.<p>As a family side project I&#x27;m trying to recreate my families&#x27; (maternal and paternal) trees into one big giant picture.<p>Currently I&#x27;m drawing a diagram in draw.io&#x2F;diagrams.net, but it gets messy, it requires alot of manual interventions of placing nodes as they come to my attention, it&#x27;s hard to add information and possibly graphics depending on edge cases (e.g. cohabits but no children, multiple marriages&#x2F;children with different fathers...) and make it all look nice and pretty.<p>I&#x27;ve searched HN and found one or two nice applications that do seem nice, but really doesn&#x27;t seem to handle the complexity I&#x27;m trying to deal with.<p>At this point, I&#x27;m considering using some kind of graph database and just let everything order itself out nice and evenly, but I have little experience with graph databases and don&#x27;t know what my options are in terms of adding information and possibly attaching images (person photo) to various nodes and make it nice and tidy and printable.<p>As a side note I&#x27;m considering skipping the whole diagram thing and just use a well-linked mediawiki or something instead with templates for family members parents&#x2F;children&#x2F;siblings along with other info. This approach seems pretty good, but judging by the fact that I&#x27;m the only one in my family doing this and knowing wiki markup and stuff, I&#x27;d imagine this would be a daunting task as well.<p>Have anyone else done visually appealing family trees before with great complexity? I&#x27;d like to have fields&#x2F;information as DOB, DOD, given names, surname and eventual past surnames, and relationships (child of &#x2F; parent of, married to, cohabited with, one night standed with causing a child.....).<p>Roughly I&#x27;m at 110 nodes&#x2F;persons at the moment, spanning over eight or nine generations [0], and adding information, nodes and stuff in draw.io just doesn&#x27;t seem convenient or easy enough for what I one day hope to be a &#x27;finished product&#x27;, i.e. a nice and intuitive image I can print out on anything between A2-A3 page size and distribute to family members.<p>Surely someone on HN has done something like this before? What are the pitfalls (e.g. should I skip both maternal and paternal linage and concentrate on one side of the family)? Are there any obvious solutions I&#x27;m missing? Am I right to take the approach of doing a diagram for visual &#x2F; esthetic reasons, or would the use of say a mediawiki&#x2F;wiki instance outweigh the visual niceness, allowing other information (anecdotes, family members&#x27; reminiscence of dead relatives etc.) maybe make it a better choice? Or is there something else completely?<p>[0] https:&#x2F;&#x2F;i.imgur.com&#x2F;RecRPDy.png\nNote: Unfinished image. Bottom colored lines are ordered into decades by year born, white white backgrounds are nodes missing information.",
      "time": 1652303302,
      "title": "Ask HN: What are some good ways to create a complex family tree?",
      "type": "story"
    },
    {
      "by": "laurex",
      "descendants": 0,
      "id": 31345780,
      "score": 1,
      "time": 1652303247,
      "title": "Finding wisdom in Charles Baudelaire’s mad scribblings",
      "type": "story",
      "url": "https://www.washingtonpost.com/books/2022/05/11/finding-wisdom-charles-baudelaires-mad-scribblings/"
    }
  ]
}