{
  "stories": [
    {
      "by": "samspenc",
      "descendants": 0,
      "id": 32065368,
      "score": 1,
      "time": 1657597665,
      "title": "India to surpass China as most populous country in 2023: U.N. report",
      "type": "story",
      "url": "https://www.reuters.com/world/india/india-surpass-china-most-populous-country-2023-un-report-2022-07-11/"
    },
    {
      "by": "nabilhat",
      "descendants": 0,
      "id": 32065356,
      "score": 1,
      "time": 1657597576,
      "title": "Post-Dispatch reporter wins press freedom award after attack by MO governor",
      "type": "story",
      "url": "https://www.stltoday.com/news/local/govt-and-politics/post-dispatch-reporter-wins-press-freedom-award-after-attack-by-missouri-governor/article_f76cf9b4-3adb-560c-aa6b-fe5ece6aed87.html"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 32065351,
      "score": 1,
      "time": 1657597506,
      "title": "Linux kernel support for hardware-based control-flow integrity",
      "type": "story",
      "url": "https://lwn.net/SubscriberLink/900099/278cbf4e1b2add3d/"
    },
    {
      "by": "dbennett",
      "descendants": 0,
      "id": 32065326,
      "score": 1,
      "time": 1657597296,
      "title": "ICBM Address",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/ICBM_address"
    },
    {
      "by": "LordNibbler",
      "descendants": 0,
      "id": 32065319,
      "score": 1,
      "time": 1657597269,
      "title": "Leechblock",
      "type": "story",
      "url": "https://www.proginosko.com/leechblock/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 32065306,
      "score": 2,
      "time": 1657597144,
      "title": "Ruby language evolution on a large scale (as observed from Ukraine)",
      "type": "story",
      "url": "https://zverok.space/blog/2022-06-11-ruby-evolution.html"
    },
    {
      "by": "zhangruinan",
      "descendants": 0,
      "id": 32065301,
      "score": 1,
      "text": "Hi HN, I started my side project 6 months ago. After developing for 6 months, I feel confident it is ready for some beta users. I would very much appreciate any contributing critics on my WIP website: www.superusapp.com<p>A bit intro to my project: I started with the idea of connecting all web-based apps and content in a canvas app. Two core features of my app: 1. you can put a browser tab on a canvas; 2. you can move data really easily cross-app.<p>The primary and secondary titles of the website:\nPrimary: Get Your Work Flowing\nSecondary: Streamline your cross-app workflow in a visual space.",
      "time": 1657597119,
      "title": "Ask HN: How to build effective website to attract early adopters",
      "type": "story"
    },
    {
      "by": "3a2d29",
      "descendants": 0,
      "id": 32065296,
      "score": 2,
      "text": "Hello all,<p>Curious how, as a junior engineer, I should be growing and building my skills.  I have always been pretty committed to what I do, but lately I feel a weird struggle with not really knowing the right path forward.<p>With my job, I feel like I am doing new things every day and a lot of random busy work with internal tools. What I do and what I need to learn seems to change often.<p>When you train for say sports, you go to practice and you do the same drills or lift weights, and over time your skills get better and you get bigger.  But that&#x27;s because you are doing those specific things over and over.  You wouldn&#x27;t get bigger if you lifted weights 3 times a week in March, then stopped for 6 months, then did once every week in August, then stopped again.<p>Even outside of work I have tried to improve my programming, but I feel like there is so much to do.  I want to learn how say certain applications work, then how to write good code when making those apps, then the larger system design decisions, then how other apps work that are not like it.  I could spend time learning system design for a while, but then my other skills will get rusty.<p>I just feel overloaded and I don&#x27;t feel like I can master engineering or programmer if my skills and time are spread among so many things.<p>What even is a master software engineer? What should my long-term goal be as a software engineer?  My goal was always to get a good job, now I am here and I am not sure what the next milestone is.",
      "time": 1657597085,
      "title": "Ask HN: How am I suppose to master software engineering?",
      "type": "story"
    },
    {
      "by": "amitmina",
      "descendants": 0,
      "id": 32065246,
      "score": 1,
      "time": 1657596673,
      "title": "End the Madness Around Productivity",
      "type": "story",
      "url": "https://twitter.com/Amitmina/status/1546697263522516995"
    },
    {
      "by": "nowherebeen",
      "descendants": 3,
      "id": 32065238,
      "kids": [
        32065292,
        32065346,
        32065342
      ],
      "score": 2,
      "text": "I am starting to notice that social media is having a negative effect on me.  I get value from places like Hacker News and others.  There are some good information on the internet.  The problem is that I seem to be addict to it and I need to stop.  How do you control your urge from checking social media websites often?   Do I have to leave my phone at home?",
      "time": 1657596564,
      "title": "Ask HN: How to stop my addiction to social media?",
      "type": "story"
    }
  ]
}