{
  "stories": [
    {
      "by": "katsura",
      "descendants": 0,
      "id": 29059006,
      "score": 1,
      "time": 1635704116,
      "title": "Fastmail Seems to Be Down",
      "type": "story",
      "url": "https://status.fastmail.com/"
    },
    {
      "by": "GaryTang",
      "descendants": 0,
      "id": 29059003,
      "score": 1,
      "time": 1635704104,
      "title": "The Demand for Money Behind Many Police Traffic Stops",
      "type": "story",
      "url": "https://www.nytimes.com/2021/10/31/us/police-ticket-quotas-money-funding.html"
    },
    {
      "by": "delinquent",
      "descendants": 0,
      "id": 29058998,
      "score": 1,
      "text": "I&#x27;m considering finding a new job with a relaxed attitude to hybrid&#x2F;fully remote working (long term, not just Covid-related), and a focus on delivery rather than physical presence.<p>My employer (large US financial firm) has taken the view that everyone needs to be present in the office now (hotdesking too), despite record productivity with everyone remote over the last 18 months. Nearly all meetings are still via Zoom with people in other global offices.<p>Which companies are going to be like this long-term?",
      "time": 1635704078,
      "title": "Ask HN: Which companies are forcing engineers back to the office?",
      "type": "story"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 29058989,
      "score": 1,
      "time": 1635703955,
      "title": "A performant SCSS-like rule expander using fuzzy parsing in under",
      "type": "story",
      "url": "https://datastation.multiprocess.io/blog/2021-10-31-building-a-nested-css-rule-expander.html"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 29058965,
      "score": 1,
      "time": 1635703786,
      "title": "The Views That Made Me Persona Non Grata at MIT",
      "type": "story",
      "url": "https://www.wsj.com/articles/cancel-culture-college-mit-dorian-abbot-university-chicago-representation-equity-equality-11635516316"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 29058942,
      "score": 1,
      "time": 1635703585,
      "title": "Heart attacks among youngsters on the rise",
      "type": "story",
      "url": "https://www.thehindu.com/news/cities/bangalore/heart-attacks-among-youngsters-on-the-rise/article37244462.ece"
    },
    {
      "by": "orsifrancesco",
      "descendants": 0,
      "id": 29058940,
      "score": 1,
      "time": 1635703573,
      "title": "Show HN: Tool to avoid some websites force you to register to read contents",
      "type": "story",
      "url": "https://textfrom.website"
    },
    {
      "by": "walrus01",
      "descendants": 0,
      "id": 29058933,
      "score": 1,
      "time": 1635703502,
      "title": "Afghanistan girls learn, 'code' underground",
      "type": "story",
      "url": "https://www.aljazeera.com/news/2021/10/29/afghanistan-girls-coding-underground-taliban-education"
    },
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 29058930,
      "score": 1,
      "time": 1635703476,
      "title": "Day: World’s deadliest tropical cyclone was 50 years ago",
      "type": "story",
      "url": "https://public.wmo.int/en/media/news/world%E2%80%99s-deadliest-tropical-cyclone-was-50-years-ago"
    },
    {
      "by": "HASim",
      "descendants": 0,
      "id": 29058926,
      "score": 1,
      "text": "Hashim Tariq Bhat (Born 12 October 2002) is a picture taker and founder of sonzal publishers from Ganderbal Kashmir. He was destined to a Kashmiri Muslim family. He finished his tutoring from neighborhood School in Ganderbal. “At the point when our educator used to get some information about our points numerous individuals would tell specialist, designing or something different, yet my answer was consistently a picture taker. I accept that camera has consistently assumed an extraordinary part in my life. It resembles a smaller than normal companion who goes with me in my knapsack. Hashim added.<p>He has worked with numerous magazines and taken part in may photowalk and workshops on photography. His clench hand representation became famous online via web-based media in year 2017, I recently caught that representation, with only one aim that this will be memory for me, well I thank web-based media that individuals adored that image and numerous pages even shared that. Said Hashim.<p>In 2018 Hashim was on a photograph shoot when he got a mishap that actually didn’t hurted him however sincerely broked him. His focal point and camera both got harmed, he couldn’t figure what he ought to do now. However, his persistent effort and commitment won there, he didn’t halted and proceeded with his work with the assistance of PDA. At the point when my camera stalled out briefly on the grounds that I had purchased this camera in the wake of setting aside my cash for very nearly 5 years. Well Allah designs better, without a doubt he is the expert organizer<p>I worked for certain Organizations and news entrances as understudy and buckled down.<p>As a writer Hashim has likewise distributed his own book “Tale” about his own work for certain short depictions. He additionally adores voyaging so he can investigate new places and catch them inside his camera. He as a rule journey to various high elevations of the valley. Hashim catches these perspectives and offers his astonishing work on various stages",
      "time": 1635703466,
      "title": "Hashim Tariq Bhat a photographer from kashmir",
      "type": "story"
    }
  ]
}