{
  "stories": [
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28742308,
      "score": 1,
      "time": 1633313734,
      "title": "The classic cars being converted to electric vehicles",
      "type": "story",
      "url": "https://www.bbc.com/news/business-58578061"
    },
    {
      "by": "wherearetheyhuh",
      "descendants": 1,
      "id": 28742292,
      "kids": [
        28742318
      ],
      "score": 1,
      "text": "I’ve had pretty much a failure of a career. For five years I was underpaid even when taking into consideration all the circumstances, stuck disorganized companies where tech was a cost center never in the sort of environment that let me grow, but I always said, next time I’ll be get there, but it seems that it’s too late at this point. A lot of it’s my fault, and I’m honestly really demotivated&#x2F;jaded now, but at the same time I don’t want to give up.<p>This time around I tried to be pickier, to target companies that looked like they paid well and could provide good growth, or in domains that interest me, but it was not working. Front door applications are a crapshoot, as I’m sure many are aware, and I could never manage to grab an interview. The frustrating part is it makes sense.<p>My resume, my work history, is nearly irrelevant to what many of these companies are looking for. Cloud technologies and services? I’m familiarly enough to know what they are&#x2F;how they’re used, but I’ve never worked anywhere where I’ve been exposed to them, so you won’t find them on my resume? Programming languages? I know enough about most of the ones that get used (and other that don’t) to be relatively productive very quickly, but I haven’t used them professionally so You won’t find them in my resume. Stories about me solving hard problems or taking leadership or managing large scale &#x2F; designing systems to last under heavy load? I’ve barely had the opportunity to write much code in my current role thanks to the sluggishness of corporate bureaucracy and I never have worked in an environment that would give me anything to write about.<p>In the end, it makes perfect sense my applications get rejected or tossed to the void. Everything I’ve done has been unremarkable even compared to every day unremarkable development. Especially for how long I’ve been doing this. I can get interviews sure, I can even get offers if I want. Granted none of them are paying that great and almost of all of them are going to leave me in the same position as I am now <i>X</i> years down the road.<p>I admittedly don’t do as much in the side anymore, though I do have some really neat (at least IMHO) projects in the world, and some extremely trivial, but nonetheless useful  contributions to OSS you’ve probably heard of. Nobody ever cares. It’s never brought up when I include it on my resume and if I bring it up, it doesn’t really seem to generate any interest. I’ve also been told straight up in some interviews that they’re less interested in my non-professional work (in the context of asking me about technical challenges&#x2F;feats)<p>I’m not sure what do now. I’m sure if I dedicated my life to something (i.e. start making substantial contributions to Linux or something or start pumping content on every idea that pops in my head, or deep diving into some hot domain), I could generate enough interest to revive myself, but that’s a whole career on its own.",
      "time": 1633313514,
      "title": "Ask HN: Can I save my career?",
      "type": "story"
    },
    {
      "by": "karmanyaahm",
      "descendants": 0,
      "id": 28742261,
      "score": 2,
      "time": 1633313113,
      "title": "Engineer Identification Test (2000)",
      "type": "story",
      "url": "https://web.archive.org/web/20010424073233/http://www.geocities.com/tech_chick01/stories/engineerid.html"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 28742256,
      "score": 1,
      "time": 1633313071,
      "title": "A Simple Bug Is Leaving AirTag Users Vulnerable to an Attack",
      "type": "story",
      "url": "https://www.wired.com/story/simple-bug-leaving-airtag-users-vulnerable-attack/"
    },
    {
      "by": "mynegation",
      "descendants": 0,
      "id": 28742231,
      "score": 1,
      "text": "I started listening to today’s episode of Software Engineering Daily and the host did not seem to be in the clear mental state. After a while I found this submission on HN from 3 weeks ago: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28504276\nI think Jeff needs help from his friends again.",
      "time": 1633312801,
      "title": "Ask HN: Host of Software Engineering Daily likely needs help again",
      "type": "story"
    },
    {
      "by": "room505",
      "descendants": 0,
      "id": 28742228,
      "score": 2,
      "time": 1633312699,
      "title": "Covid-19 Scenario Modeling Hub",
      "type": "story",
      "url": "https://covid19scenariomodelinghub.org/"
    },
    {
      "by": "georgeoliver",
      "descendants": 0,
      "id": 28742224,
      "score": 1,
      "time": 1633312643,
      "title": "Pinscape the Virtual Pinball Cabinet",
      "type": "story",
      "url": "http://mjrnet.org/pinscape/"
    },
    {
      "by": "qwertyuiop_",
      "descendants": 0,
      "id": 28742206,
      "score": 4,
      "time": 1633312470,
      "title": "Jessica Berg Wilson – Johnson and Johnson Death – Telling Our Stories",
      "type": "story",
      "url": "https://nomoresilence.world/johnson/jessica-berg-wilson-johnson-johnson-death/"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 28742181,
      "score": 1,
      "time": 1633312104,
      "title": "Over the Course of the Pandemic, Bugs Have Invaded the World’s Museums",
      "type": "story",
      "url": "https://www.architecturaldigest.com/story/museum-bug-problem"
    },
    {
      "by": "williswee",
      "descendants": 0,
      "id": 28742160,
      "score": 2,
      "time": 1633311932,
      "title": "Tencent leads $87m round of Indonesian B2B ecommerce startup Ula",
      "type": "story",
      "url": "https://www.techinasia.com/tencent-prosus-ventures-87m-indonesian-b2b-ecommerce-startup-ula"
    }
  ]
}