{
  "stories": [
    {
      "by": "Der_Einzige",
      "descendants": 0,
      "id": 30181736,
      "score": 1,
      "time": 1643826562,
      "title": "Show HN: HF-BERTopic – Transformer based topic modeling in the browser",
      "type": "story",
      "url": "https://huggingface.co/spaces/Hellisotherpeople/HF-BERTopic"
    },
    {
      "by": "pimterry",
      "descendants": 0,
      "id": 30181710,
      "score": 2,
      "time": 1643826469,
      "title": "How to stop running out of ephemeral ports and love long-lived connections",
      "type": "story",
      "url": "https://blog.cloudflare.com/how-to-stop-running-out-of-ephemeral-ports-and-start-to-love-long-lived-connections/"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 30181696,
      "score": 2,
      "time": 1643826393,
      "title": "Why isn't there a replication crisis in math?",
      "type": "story",
      "url": "https://jaydaigle.net/blog/replication-crisis-math/"
    },
    {
      "by": "thearegee",
      "descendants": 0,
      "id": 30181691,
      "score": 1,
      "time": 1643826382,
      "title": "Hosting a blog using GitHub and Hugo",
      "type": "story",
      "url": "https://www.airinformation.com/posts/how-to-host-a-hugo-blog-with-github/"
    },
    {
      "by": "00000000005",
      "descendants": 0,
      "id": 30181689,
      "score": 2,
      "text": "I.e sites that are not companies and not trying to sell anything? Presumably advertisements are ok.",
      "time": 1643826375,
      "title": "Ask HN: Is there a search engine that only returns non-commercial sites?",
      "type": "story"
    },
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30181687,
      "score": 1,
      "text": "I have an original Barnes &amp; Noble Reader, but B &amp; N will no longer offer software updating for my old device. Is there a way for me to update it manually to version 1.4.4?",
      "time": 1643826366,
      "title": "BNTV250 Tablet Update",
      "type": "story"
    },
    {
      "by": "mvoodarla",
      "descendants": 0,
      "id": 30181676,
      "score": 4,
      "text": "Hi HN, we’re Mokshith and Abhi from Sieve (<a href=\"https:&#x2F;&#x2F;sievedata.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sievedata.com</a>). We’re building an API that lets you add video search to internal tools or customer applications, instantly. Sieve can process 24 hours of video in less than 10 minutes, and makes it easy to search video by detected objects &#x2F; characteristics, motion data, and visual similarity. You can use our models out of the box, or plug-in your own model endpoints into our infrastructure. Models can mean any software that produces output given an image.<p>Every industry from security, to media, supply chain, construction, retail, sports, and agriculture is being transformed by video analytics—but setting up the infrastructure to process video data quickly is difficult. Having to deal with video ingestion pipelines, computer-vision model training, and search functionality is not pretty. We’re building a platform that takes care of all of this so teams can focus on their domain-expertise, building industry-specific software.<p>We met in high school, and were on the robotics team together. It was our first exposure to computer vision, and something we both deeply enjoyed. We ended up going to UC Berkeley together and worked on computer vision at places like Scale AI, Niantic, Ford, NVIDIA, Microsoft, and Second Spectrum. We were initially trying to solve problems for ourselves as computer vision developers but quickly realized the unique problems in video having to do with cost, efficiency, and scale.  We also realized how important video would be in lots of verticals, and saw an opportunity to build infrastructure which wouldn’t have to be rebuilt by a fullstack dev at any company again.<p>Let’s take the example of cloud software for construction which might include tons of features from asset trackers to rental management and compliance checks. It doesn’t make sense for them to build their own video processing for telematics—the density and scale of video make this a difficult task. A single 30 FPS camera generates over 2.5M frames within a day of recording. Imagine this across thousands of cameras and many weeks of footage—not to mention the actual vertical-specific software they’re building for end users.<p>Sieve takes care of everything hard about processing and searching video. Our API allows you to process and search video with just two API calls. We use filtering, parallelization, and interpolation techniques to keep costs low, while being able to process 24 hours of video in under 10 minutes. Users can choose from our pre-existing set of models, or use their own models with our video processing engine. Our pricing can range anywhere from $0.08-$0.45 per minute of video processed based on the models clients are interested in and usage volume. Our FAQ page (<a href=\"https:&#x2F;&#x2F;sievedata.com&#x2F;faq\" rel=\"nofollow\">https:&#x2F;&#x2F;sievedata.com&#x2F;faq</a>) explains these factors in more detail.<p>Our backend is built on serverless functions. We split each video into individual chunks which are processed in parallel and passed through multiple layers of filters to determine which chunks are “important”. We’re able to algorithmically ignore parts of video which are static, or change minimally, and focus on the parts that contain real action. We then run more expensive models on the most “important” parts of video, and interpolate results across frames to return information to customers at 30 FPS granularity. Our customers simply push signed video URLs to our platform, and this happens automatically. You can then use our API to query for intervals of interest.<p>We haven’t built an automated sign up flow yet because of our focus on the core product, but we still wanted to give all of you the chance to try Sieve on your own videos for free. You’ll be emailed a personal, limited-access API key.<p>Try it out: <a href=\"https:&#x2F;&#x2F;sieve-data.notion.site&#x2F;Trying-Sieve-s-Video-Search-4bd7754bb04d468fb1a6c98225f68ccb\" rel=\"nofollow\">https:&#x2F;&#x2F;sieve-data.notion.site&#x2F;Trying-Sieve-s-Video-Search-4...</a><p>Visual dashboard demo: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_uyjp_HGZl4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_uyjp_HGZl4</a><p>We’d love to hear what you think about the product and vision, and ideas on how we can improve it. Thanks for taking the time to read this, we’re grateful to be posting here :)",
      "time": 1643826321,
      "title": "Launch HN: Sieve (YC W22) – Pluggable APIs for Video Search",
      "type": "story"
    },
    {
      "by": "theRealDrahakar",
      "descendants": 0,
      "id": 30181671,
      "score": 1,
      "time": 1643826292,
      "title": "Leveling in Code Review",
      "type": "story",
      "url": "https://source.coveo.com/2022/02/01/leveling-code-review/"
    },
    {
      "by": "robin_reala",
      "descendants": 0,
      "id": 30181662,
      "score": 1,
      "time": 1643826256,
      "title": "Sponsors-Only Repositories",
      "type": "story",
      "url": "https://github.blog/changelog/2022-02-02-sponsors-only-repositories/"
    },
    {
      "by": "neiman1",
      "descendants": 0,
      "id": 30181636,
      "score": 3,
      "time": 1643826144,
      "title": "Solving (Some) Formal Math Olympiad Problems",
      "type": "story",
      "url": "https://openai.com/blog/formal-math/"
    }
  ]
}