{
  "stories": [
    {
      "by": "jrepinc",
      "descendants": 0,
      "id": 31874076,
      "score": 1,
      "time": 1656152973,
      "title": "Crypto’s biggest critics won’t back down",
      "type": "story",
      "url": "https://www.morningbrew.com/daily/stories/2022/06/23/meet-crypto-s-biggest-skeptics"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31874070,
      "score": 1,
      "time": 1656152780,
      "title": "Google Guide is an interactive tutorial and reference for experienced users",
      "type": "story",
      "url": "https://www.googleguide.com/"
    },
    {
      "by": "new23d",
      "descendants": 0,
      "id": 31874064,
      "score": 1,
      "time": 1656152742,
      "title": "Why filmmusic.io is stopping online sales (tl;dr humanity)",
      "type": "story",
      "url": "https://filmmusic.io/news/37"
    },
    {
      "by": "robingarnham",
      "descendants": 0,
      "id": 31874053,
      "score": 1,
      "text": "Long time reader, and read HN many times a day. Feel like it’s time to get some advice about my situation.<p>I’ve wanted to run a company for years, and finally bit the bullet and left a very successful startup where I was the VP of Engineering. COVID hit a week after I left!<p>I wanted to build a product company, but wanted control of my destiny and to be able to do it on my terms and without the risk of my IP being taken (contract with employer at the time)<p>I started a company and was offering consulting services to bootstrap the product side. Two years of consulting success later the wheels started to slow as I got tired of hustling so hard. We launched a product and get great feedback for it, but it’s been a limited commercial success. (https:&#x2F;&#x2F;www.pearler.ai)<p>I’ve been chasing a big enterprise client and they have helped us to refine the product dramatically- it seems like it’s going to come together but it feels like too little too late. I guess I’m just a bit burnt out.<p>I’ve stopped all the consulting services and taken a day job. I own all of the company and it’s just me now (after having nearly ten people working in the company). I feel like the company is well setup (legally and financially), and I have the skills to lead and run a company. Just I feel stuck in the chasm of low revenue from Product. We’ve had investors interested but I’ve never sought external capital because I don’t feel confident enough in its prospects. It feels unfair to put someone else’s capital on the line until it’s a confirmed success? I think that’s holding me back.<p>The product is a typical SaaS product but is still small revenue ($1000 MRR)<p>I think what I’ve been missing is a co-founder that can help with marketing, customer demos, helping with website and organic content to bring in more customers.<p>We get great feedback but I’ve always been time poor and never been able to go all-in. I feel a bit stuck.<p>Thanks in advance for your thoughts!",
      "time": 1656152544,
      "title": "Ask HN: Need some advice about my SaaS",
      "type": "story"
    },
    {
      "by": "MikeAshley178",
      "descendants": 0,
      "id": 31874042,
      "score": 1,
      "time": 1656152413,
      "title": "Crypto Exchange Bitpanda Cuts Staff by Hundreds",
      "type": "story",
      "url": "https://slashdot.org/story/22/06/24/2223259/european-crypto-exchange-bitpanda-cuts-staff-by-hundreds"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31874023,
      "score": 2,
      "time": 1656152189,
      "title": "The Science of Climate Change Explained: Facts, Evidence and Proof (2021)",
      "type": "story",
      "url": "https://www.nytimes.com/article/climate-change-global-warming-faq.html"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31873996,
      "score": 1,
      "time": 1656151865,
      "title": "Centenarian Tortoises May Set the Standard for Anti-Aging",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/23/science/tortoises-turtles-aging.html"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31873992,
      "score": 1,
      "time": 1656151848,
      "title": "Thinking Like a Scientist Will Make You Happier",
      "type": "story",
      "url": "https://nautil.us/thinking-like-a-scientist-will-make-you-happier-19974/"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31873967,
      "score": 1,
      "time": 1656151617,
      "title": "Kelsey Hightower on How to Become a Better Engineering Team",
      "type": "story",
      "url": "https://thenewstack.io/kelsey-hightower-on-how-to-become-a-better-engineering-team/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31873950,
      "score": 2,
      "time": 1656151451,
      "title": "If your website's full of assholes, it's your fault (2011)",
      "type": "story",
      "url": "https://anildash.com/2011/07/20/if_your_websites_full_of_assholes_its_your_fault-2/"
    }
  ]
}