{
  "stories": [
    {
      "by": "mmags",
      "descendants": 0,
      "id": 29447625,
      "score": 1,
      "text": "I have an idea, but after much thought I realized, it&#x27;s not a problem that (my target) people face every day or every week, maybe not even every year.<p>It&#x27;s a problem people face every time they start a project, my idea is basically a decision helper, and those decisions are just made every time they start a project.<p>I have no prior experience in building and running services (SaaS), so I would like your opinions on this matter.<p>And also, I can&#x27;t find other SaaS that solves passive problems like mine, so I can&#x27;t decide if this would be a good idea. So if you know any such service, please let me know.<p>Thanks.",
      "time": 1638691412,
      "title": "Ask HN: Shuold I continue to build a product for a passive problem?",
      "type": "story"
    },
    {
      "by": "baybal2",
      "descendants": 0,
      "id": 29447610,
      "score": 3,
      "time": 1638691101,
      "title": "Sheldon Whitehouse fighting to end the dark money plaguing the Supreme Court",
      "type": "story",
      "url": "https://www.businessinsider.com/sheldon-whitehouse-fighting-to-end-dark-money-at-supreme-court-2021-11"
    },
    {
      "by": "koliber",
      "descendants": 1,
      "id": 29447580,
      "kids": [
        29447591
      ],
      "score": 2,
      "text": "Services. Micro, macro. Love &#x27;em, hate &#x27;em.  The topic is not new on HN. A recent article prompted some good discussions ( [https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29379926](https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29379926) ). Let&#x27;s continue this conversation.<p>How do you decide whether to spin off a service, and how will it connect and interact with the rest of the system?<p>A service is a capability. It&#x27;s something that allows you achieve a behavior in a system. Functionality should be broken into a service only in places where it makes sense, and provides clear benefits to the system and the team. You can have good service-based architectures that are a pleasure to build and maintain. And yet, there are countless stories of teams breaking their system up into services, and then deciding to go back to a monolith.<p>How do you decide when to develop something as a service?<p>How do you decide when to refactor a system and split some functionality out into a service?<p>Are there any key questions that you must ask your team before deciding to do so?<p>What will make a service-based architecture pleasurable to build and maintain?<p>Can you share any short-form (articles, presentations) or long-form (books, courses) resources to learn how to do this well?",
      "time": 1638690625,
      "title": "Ask HN: How to decide whether to spin off a [micro]service?",
      "type": "story"
    },
    {
      "by": "amadeuspagel",
      "descendants": 4,
      "id": 29447574,
      "kids": [
        29447669,
        29447632
      ],
      "score": 5,
      "time": 1638690545,
      "title": "Show HN: Dfeed – a feed reader you can use without an account",
      "type": "story",
      "url": "https://dfeed.net/"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 29447565,
      "score": 4,
      "time": 1638690364,
      "title": "Elon Musk’s Starlink to apply for licence to offer satellite services in India",
      "type": "story",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-s-starlink-to-apply-for-licence-to-offer-satellite-services-in-india-in-january-1884038-2021-12-04"
    },
    {
      "by": "susam",
      "descendants": 0,
      "id": 29447559,
      "score": 2,
      "time": 1638690319,
      "title": "Are Mathematicians Scientists? (2012)",
      "type": "story",
      "url": "https://old.reddit.com/r/math/comments/11nauz/are_mathematicians_scientists/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29447553,
      "score": 2,
      "time": 1638690236,
      "title": "Creating a Solaris 10 zone on OpenIndiana",
      "type": "story",
      "url": "https://rqsall.com/posts/creating-a-solaris-10-zone-on-openindiana"
    },
    {
      "by": "News-Dog",
      "descendants": 1,
      "id": 29447544,
      "kids": [
        29447555
      ],
      "score": 3,
      "time": 1638690029,
      "title": "Omicron Data – another month away",
      "type": "story",
      "url": "https://www.technologyreview.com/2021/12/01/1040802/how-bad-will-omicron-get/"
    },
    {
      "by": "camelcasing",
      "descendants": 0,
      "id": 29447535,
      "score": 2,
      "text": "Hey all! I&#x27;m starting my first swe job out of grad school soon. From a few internship experiences, I found myself going all out on the project at hand while not doing anything else.<p>Now that I have a permanent job, I want to keep my job time restricted to 9-5 and outside of it, I&#x27;m interested in learning about multiple topics unrelated to the job like Natural Language Processing, Topics in Economics&#x2F;Finance&#x2F;Management, Information Retrieval, etc.<p>How do you all go about choosing what to read&#x2F;learn when you have many options to consider? Do you employ any framework for doing this? How have you been able to keep your job time separate from personal development time? Thanks!",
      "time": 1638689917,
      "title": "Ask HN: Framework to explore multiple topics of interest?",
      "type": "story"
    },
    {
      "by": "rdpintqogeogsaa",
      "descendants": 0,
      "id": 29447533,
      "score": 4,
      "time": 1638689898,
      "title": "“LLVM-Libc” C Standard Library",
      "type": "story",
      "url": "https://llvm.org/docs/Proposals/LLVMLibC.html"
    }
  ]
}