{
  "stories": [
    {
      "by": "ishishah",
      "descendants": 0,
      "id": 28009972,
      "score": 1,
      "text": "Hi, I&#x27;m Ishita, cofounder of Matrubials. We are developing milk-derived therapeutics to address infectious diseases.<p>I have extensive experience in microbiology and infectious diseases in both academia and industry. Taken together, our founding team has ~100 years of combined experience in microbiology and ecology, food science and chemistry. My cofounders have previously founded other health companies with specialized products (eg. Evolve Biosystems and BCD Bioscience).<p>We have been focused on structure-function analysis of mammalian milk and the benefits individual components can bring to human health for about two decades. In recent years, we discovered peptides in milk that have selective antimicrobial activity, meaning that they know who the pathogens are, and essentially go after them fast for elimination while bypassing the &quot;good&quot; bugs, leaving them around to continue their jobs. That was the moment we decided we needed to bring these to the market.<p>One niche in the human body where the imbalance between the good and the bad is really bad, is the human vagina. We&#x27;ve been focusing on specific bacteria that reside in the normal human vagina and those that take over to cause disease. In particular, we hope to reduce the burden of bacterial vaginosis, which remains unresolved with current antibiotics. This is especially important because these infections tend to recur, and can lead to secondary infections and reproductive issues.<p>Antibiotic discovery is hard, technically and financially. To develop candidate molecules from early stage research to clinically viable products, with efficacy and safety that do better than current standard-of-care, is a major challenge. An opportunity like this one doesn&#x27;t come around often so we&#x27;re pretty excited about it.<p>Converting milk components into therapeutics- now isn&#x27;t that a great hack? We think so! Happy to hear your thoughts and answer questions!",
      "time": 1627664392,
      "title": "Launch HN: Matrubials (YC S21) Milk-derived therapeutics for infectious diesases",
      "type": "story"
    },
    {
      "by": "deobald",
      "descendants": 0,
      "id": 28009967,
      "score": 1,
      "time": 1627664367,
      "title": "Crux 1.18.0 Is Out",
      "type": "story",
      "url": "https://github.com/juxt/crux/releases/tag/1.18.0"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28009961,
      "score": 1,
      "time": 1627664326,
      "title": "Building an Investment Career on Writing",
      "type": "story",
      "url": "https://thereformedbroker.com/2021/07/25/building-an-investing-career-based-on-writing/"
    },
    {
      "by": "keewee7",
      "descendants": 0,
      "id": 28009957,
      "score": 1,
      "text": "I got over 7000. Most of it is probably school related or something I found on HN or reddit that I saved to later but will never actually read.<p>I started using Chrome in 2009 as a first-year high school student so it&#x27;s 12 years of high school, university, and work related bookmarks.<p>How do you organize and read through many bookmarks?",
      "time": 1627664300,
      "title": "Ask HN: How many bookmarks do you have in the browser?",
      "type": "story"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 28009956,
      "score": 1,
      "time": 1627664284,
      "title": "Political violence related to Covid-19 could lead to 'unravelling of societies'",
      "type": "story",
      "url": "https://www.cbc.ca/news/world/political-violence-related-to-covid-19-could-lead-to-unravelling-of-societies-worldwide-observers-say-1.6122381"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 28009953,
      "score": 1,
      "time": 1627664266,
      "title": "China’s Sputnik Moment? How Washington Boosted China’s Quest for Tech Dominance",
      "type": "story",
      "url": "https://www.foreignaffairs.com/articles/united-states/2021-07-29/chinas-sputnik-moment"
    },
    {
      "by": "lawrenceyan",
      "descendants": 0,
      "id": 28009944,
      "score": 1,
      "time": 1627664234,
      "title": "Fireside Chat with Baiju Bhatt, Co-Founder of Robinhood (2018)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=TkRWQ7XX6XI"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28009936,
      "score": 1,
      "time": 1627664193,
      "title": "Elon Musk: Cook and I have never spoken or written to each other ever",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1421150913075503112"
    },
    {
      "by": "toomuchtodo",
      "descendants": 0,
      "id": 28009926,
      "score": 1,
      "time": 1627664142,
      "title": "$Hood",
      "type": "story",
      "url": "https://www.profgalloway.com/hood/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28009868,
      "score": 2,
      "time": 1627663780,
      "title": "1 out of every 153 American workers is an Amazon employee",
      "type": "story",
      "url": "https://www.businessinsider.com/amazon-employees-number-1-of-153-us-workers-head-count-2021-7"
    }
  ]
}