{
  "stories": [
    {
      "by": "jhack",
      "descendants": 0,
      "id": 29190668,
      "score": 1,
      "time": 1636652240,
      "title": "Nix and NixOS Get So Close to Perfect",
      "type": "story",
      "url": "https://christine.website/talks/nixos-pain-2021-11-10"
    },
    {
      "by": "saranshk",
      "descendants": 0,
      "id": 29190656,
      "score": 2,
      "time": 1636652178,
      "title": "Rich Harris, Creator of Svelte, Joins Vercel",
      "type": "story",
      "url": "https://vercel.com/blog/vercel-welcomes-rich-harris-creator-of-svelte"
    },
    {
      "by": "cprogrammer1994",
      "descendants": 0,
      "id": 29190633,
      "score": 1,
      "time": 1636652091,
      "title": "High-performance rendering for Python with ZenGL",
      "type": "story",
      "url": "https://github.com/szabolcsdombi/zengl"
    },
    {
      "by": "schrijver",
      "descendants": 0,
      "id": 29190603,
      "score": 1,
      "time": 1636651923,
      "title": "Copy This Book. An artist’s guide to copyright",
      "type": "story",
      "url": "https://copy-this-book.eu/"
    },
    {
      "by": "hospadar",
      "descendants": 0,
      "id": 29190602,
      "score": 2,
      "time": 1636651920,
      "title": "From Programmer to Computer (1958)",
      "type": "story",
      "url": "https://pubs.acs.org/doi/pdf/10.1021/ie50587a038"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29190582,
      "score": 1,
      "time": 1636651772,
      "title": "Apple loses bid for second bite at Qualcomm patents after license",
      "type": "story",
      "url": "https://www.reuters.com/legal/transactional/apple-loses-bid-second-bite-qualcomm-patents-after-license-2021-11-10/"
    },
    {
      "by": "mathgorges",
      "descendants": 1,
      "id": 29190537,
      "kids": [
        29190604
      ],
      "score": 1,
      "text": "I received the email at the bottom of this post from Google this morning (I&#x27;m a Google Workspace Customer in the US).<p>It struck me as odd they&#x27;d reach out to me directly about <i>proposed</i> legislation, and frankly made me feel a bit awkward.<p>Anyone else get this email? Have they done this before? This isn&#x27;t a normal thing for mega-corporations to do, right?<p>---<p>Subject: Take action: Understand the impact of new legislation on your business<p>From: Google Customer Solutions &lt;no-reply@google.com&gt;<p>Dear Mathgorges,<p>Right now, Congress is considering regulations that would have unintended consequences for your business – costing you time and money.<p>If passed, these bills could disrupt many of the digital tools you rely on every day – including Google Ads and Analytics, Gmail and Docs, and your business listing on Google Search and Maps. These changes could make it harder for customers to find your business and could hurt your productivity.<p>If you&#x27;re interested in learning more about these bills, their impact on your business, and what you can do about it, we invite you to sign up to stay informed.<p>Stay Informed [1]<p>By clicking this button I consent that Google can contact me about legislative and regulatory issues, events, and advocacy opportunities related to my business.<p>Google&#x27;s public policy team is working with members of Congress to share concerns about how these bills could impact businesses like yours. Together, we can be an important voice in the policy conversation about the regulations that affect you - and your business.<p>Thank you,\nThe Google Customer Solutions Team<p>---<p>[1]: When I clicked the button I was taken to a page which read:<p>You&#x27;ve signed up<p>You will soon receive Digital Regulation Updates messages.<p>You will receive communications about legislative and regulatory issues, events and advocacy opportunities related to your business.",
      "time": 1636651560,
      "title": "From Google – Take action: Understand the impact of new legislation on your biz",
      "type": "story"
    },
    {
      "by": "aerophilic",
      "descendants": 0,
      "id": 29190531,
      "score": 1,
      "time": 1636651543,
      "title": "Apple Business Essentials",
      "type": "story",
      "url": "https://www.apple.com/business/"
    },
    {
      "by": "Beefin",
      "descendants": 0,
      "id": 29190527,
      "score": 2,
      "text": "Is anybody storing non-text files in S3 for their software? I&#x27;m referring to pdf, video, audio, images, etc.<p>If so, it would mean the world if I could talk to you and just ask about some of your experience with uploading&#x2F;retrieving these files within your software.<p>To give context: I have a free managed API that offers full-text-search for your S3 bucket to integrate into your software. The website is https:&#x2F;&#x2F;mixpeek.com<p>Let me know if this matches you and if you&#x27;re willing to answer some quick Qs in exchange to be involved in the free pilot :)",
      "time": 1636651532,
      "title": "Ask HN: Does anybody store files in S3 for their SaaS?",
      "type": "story"
    },
    {
      "by": "takhchi",
      "descendants": 0,
      "id": 29190514,
      "score": 1,
      "time": 1636651447,
      "title": "Apple Business Essentials, a new service for businesses",
      "type": "story",
      "url": "https://free-ecom.com/apple-business-essentials-a-new-service-for-businesses/"
    }
  ]
}