{
  "stories": [
    {
      "by": "hyfen",
      "descendants": 0,
      "id": 30557256,
      "score": 2,
      "time": 1646413072,
      "title": "Heap memory corruption CVE for GitHub's Markdown table parsing",
      "type": "story",
      "url": "https://github.com/github/cmark-gfm/security/advisories/GHSA-mc3g-88wq-6f4x"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 30557255,
      "score": 1,
      "time": 1646413067,
      "title": "AWS Customer Carbon Footprint Tool",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/new-customer-carbon-footprint-tool/"
    },
    {
      "by": "DavidPBL",
      "descendants": 0,
      "id": 30557249,
      "score": 2,
      "text": "Hi HN, I am David Ortega, a bioengineer and founder at Phase Biolabs. We’re building technology that uses fermentation to turn CO2 emissions into carbon-neutral chemicals—specifically into sustainable, cost-competitive solvents for the pharma, cosmetics, and paint industries.<p>We’ve built a lab-scale prototype (demo here: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;RUIT3RUeUPE\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;RUIT3RUeUPE</a>) that is a 1.5L bioreactor with a microorganism inside that &#x27;eats&#x27; carbon dioxide and hydrogen gas, converting them into chemicals as it grows. We are currently making ethanol in the lab but unfortunately CO2-based ethanol cannot be legally sold as a beverage—so industrial solvents it is :)<p>You can do two things with carbon: you can capture it, or you can use it. Both are hard, but the latter is harder, mainly because carbon dioxide is so small.<p>Capturing CO2 is usually done by attaching it to something else, usually another molecule, which is how we can extract it from a dilute gas stream or &#x27;pull it&#x27; out of the air. But the CO2 molecule is only temporarily transformed.<p>Using CO2 is a different ball game, usually referred to as CCU (carbon capture and utilization). For this you need to permanently convert the molecular structure itself, and since you are working with extremely tiny pieces of matter, you need extremely precise machinery.<p>The challenge with converting CO2 is doing it efficiently. It needs to happen with as little energy as possible and to be as precise as possible. If you want to convert CO2 into X, but you also produce Y, and Z, that is a problem which will show up in the cost. Our solution is bio-based CCU, but there are also electrochemical and thermochemical technologies, each with advantages and disadvantages. And there are other bio-based approaches, such as making trees more efficient (e.g. Living Carbon W20). All are valid strategies.<p>In biology, CCU is known as carbon fixation. During my PhD I was engineering microbes to convert wastes into renewable chemicals and fuels, so I began to study biochemical carbon pathways, which led me to carbon fixation. I began to realize how important carbon fixation is at a macro level (carbon cycle) and how the process works, but also that it is extremely inefficient and can be optimized. For example, the trees in your garden don’t grow very fast. This is due to photosynthesis being 2-4% efficient. I’ve always wanted to start a startup and that has always been in the back of my mind, so I did things that I enjoyed that could also help towards reaching that goal, which led me to this.<p>Advances in synthetic biology mean we can do things that weren&#x27;t possible 20-30 years ago. The amount of tinkering that we can do has substantially increased (and costs have dropped), and our understanding has grown due to a rise in data and analytics. We can borrow strategies that have worked in the past in other fields and apply them in new ways.<p>Most biological carbon fixation is precise, but very inefficient. Our approach is to take that precision and enhance it using synthetic biology into a process that is efficient, scalable, and productive enough for industrial application. We&#x27;re using microorganisms that can naturally fix carbon, and transforming them into mini factories. Our microorganisms are 7x more energy efficient than naturally occurring plants or algae and in theory can produce almost any molecule found in nature directly from CO2.<p>Carbon fixation is catalysed by a carbon fixation (biochemical) pathway, which is simply a set of enzymes that catalyse a sequence of steps&#x2F;reactions. The enzymes attach electrons and hydrogen ions onto the CO2 molecule, while removing the oxygen, one step at a time. This process can be called reverse combustion, but whereas combustion is uncontrolled and explosive (literally), carbon fixation is highly controlled. It’s a stepwise progression from a single CO2 molecule, adding hydrogen&#x2F;electrons one at a time and eventually carbon (going from 1C -&gt; 2C, then 3C etc.) to get to your target product. Enzymes are the perfect molecular machines for this as precision is their speciality.<p>Our plan is to initially sell our technology to CO2 emitters so that they can reduce emissions and make money by converting a problem&#x2F;cost (emissions) into new revenue. The technology scales to the size of the emitter. The cost is very different for a company that emits 50,000 tons per year vs 500,000 tons per year. We have some early estimates based on some economic modelling we’ve done.<p>We are at an early stage and have a long way to go but we have big ambitions for using CCU technology to decarbonise heavy industry, make sustainable chemicals and transition towards a circular economy.<p>Fermentation processes are well understood, easily scalable and easy to operate. We think gas fermentation can be easily deployed around the world to convert &#x2F; recycle CO2 into sustainable products and Phase is aiming to use it to recycle emissions on the gigaton scale by 2040.<p>I hope this short summary provides you with new or renewed interest in the age-old process of fermentation, something that has been with us for millennia. My family has been making homemade wine for many years, have you ever considered brewing at home?",
      "time": 1646413048,
      "title": "Launch HN: Phase Biolabs (YC W22) – Converting CO2 to Carbon-Neutral Chemicals",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30557246,
      "score": 1,
      "time": 1646413032,
      "title": "Microsoft’s Project Silica offers robust thousand-year storage (2019)",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2019/11/microsofts-project-silica-offers-robust-thousand-year-storage/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30557243,
      "score": 1,
      "time": 1646413021,
      "title": "The wonderful world of Chinese hi-fi (2019)",
      "type": "story",
      "url": "https://www.theverge.com/2019/11/7/20943377/chinese-hi-fi-audio-chifi-fiio-hifiman-tin-audio"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 30557240,
      "score": 1,
      "time": 1646413017,
      "title": "Tank Biathlon",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Tank_biathlon"
    },
    {
      "by": "mytailorisrich",
      "descendants": 0,
      "id": 30557239,
      "score": 1,
      "time": 1646413016,
      "title": "Ukraine says it is fighting first 'hybrid war'",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-60622977"
    },
    {
      "by": "marinesebastian",
      "descendants": 0,
      "id": 30557227,
      "score": 1,
      "time": 1646412952,
      "title": "Caddy: Fast, multi-platform web server with automatic HTTPS",
      "type": "story",
      "url": "https://github.com/caddyserver/caddy"
    },
    {
      "by": "zikohh",
      "descendants": 0,
      "id": 30557206,
      "score": 2,
      "time": 1646412834,
      "title": "Create Videos Programmatically in React",
      "type": "story",
      "url": "https://github.com/remotion-dev/remotion"
    },
    {
      "by": "polar8",
      "descendants": 0,
      "id": 30557205,
      "score": 6,
      "time": 1646412828,
      "title": "Apple CEO Tim Cook tells employees to return to office April 11",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/4/22961592/apple-april-11-return-office-corporate-pandemic-tim-cook"
    }
  ]
}