{
  "stories": [
    {
      "by": "sexy_panda",
      "descendants": 0,
      "id": 30244146,
      "score": 1,
      "text": "Hi HN,<p>I&#x27;m looking for advice on calculating my market value.<p>I live in central Europe and work as a Cloud Architect, that also does DevOps and pretty much everything required project-wise.<p>I make 32k per year and it seems hard getting an average market pay. I have no university degree, but 6 years experience in IT, 3 years experience in CI&#x2F;CD and 2 years experience with AWS and IaC.<p>How can I figure out my market worth?",
      "time": 1644238487,
      "title": "Ask HN: How can I calculate my market value?",
      "type": "story"
    },
    {
      "by": "kandruszkow",
      "descendants": 0,
      "id": 30244104,
      "score": 3,
      "text": "Hi HN,<p>I&#x27;m Karol and I&#x27;ve always been fascinated by problem solving and building something of my own.<p>A few years ago, we were working on our startup - an agency. After interacting with and speaking to many clients (smaller and medium international businesses), we came up with an idea they gave us.<p>We saw a common need. We created portfolios, vouchers, etc., for some of them and when they saw that it was making their business grow, they came to us for further advice. They often gave us WordPress pages, asking us to maintain and adapt them to their needs, as they didn&#x27;t want to&#x2F;were afraid of doing it themselves.<p>The problem?<p>No one was paying us for it.<p>The solution?<p>Back in 2013, when the idea came up, there weren&#x27;t many website builders. And the ones existing on the market were undeveloped, limited, and allowed designers to have very little originality and flexibility with their projects. We wanted to create something that would allow businesses to express themselves and attract potential customers.<p>Goal: This tool aims to enable businesses to grow and attract loyal clients. We didn&#x27;t want just a website builder but a growth supporter.<p>So we came up with our solution and created BOWWE - a website builder with great SEO where users can create a website, Landing and Micro Page, portfolio, or CV.<p>We built BOWWE on a stable foundation. Clean code - developer&#x27;s like, efficient, without the usual limitations of web builders (ones then and now), development-oriented, with perfectly integrated applications.<p>BOWWE users can build even the most advanced websites without restrictions with pixel-perfect technology and developer quality. And do it 10X faster, which is an excellent basis for further development and pre-launched campaigns.<p>We aimed to deliver results for the clients.<p>Here is the link to the tool: <a href=\"https:&#x2F;&#x2F;bowwe.com&#x2F;en&#x2F;how-it-works\" rel=\"nofollow\">https:&#x2F;&#x2F;bowwe.com&#x2F;en&#x2F;how-it-works</a><p>We&#x27;ve been developing this tool for over seven years but we&#x27;re still focused on change.<p>What do you think of my current solution? Do you agree with my mission and solution?<p>I&#x27;m really curious to know what the HN community thinks.",
      "time": 1644238297,
      "title": "Show HN: Bowwe – web builder to develop your projects 10x more efficiently",
      "type": "story",
      "url": "https://bowwe.com/en/how-it-works"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30244070,
      "score": 1,
      "time": 1644238106,
      "title": "Jobs recovery far more rapid in right-to-work states",
      "type": "story",
      "url": "https://www.washingtonexaminer.com/opinion/op-eds/jobs-recovery-far-more-rapid-in-right-to-work-states"
    },
    {
      "by": "stichers",
      "descendants": 0,
      "id": 30244048,
      "score": 1,
      "time": 1644238010,
      "title": "Networking design for a turn-based game",
      "type": "story",
      "url": "https://longwelwind.net/blog/networking-turn-based-game/"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 30244045,
      "kids": [
        30244081
      ],
      "score": 1,
      "time": 1644238007,
      "title": "Bricksmith – virtual Lego modeling for your Macintosh",
      "type": "story",
      "url": "https://bricksmith.sourceforge.io/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30244036,
      "score": 1,
      "time": 1644237956,
      "title": "I’m not ready to give up my Nintendo 3DS yet (2018)",
      "type": "story",
      "url": "https://www.theverge.com/2018/5/16/17357848/nintendo-3ds-switch-upgrade"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30244035,
      "score": 1,
      "time": 1644237947,
      "title": "The Philosophy of Stoicism (2017)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=R9OCA6UFE-0"
    },
    {
      "by": "frogger8",
      "descendants": 0,
      "id": 30244027,
      "score": 1,
      "time": 1644237873,
      "title": "Putin Quotes about Russia",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zLljLNkw_VM"
    },
    {
      "by": "pedrodelfino",
      "descendants": 0,
      "id": 30244022,
      "score": 1,
      "text": "Books? Videos? Best articles? Communities?",
      "time": 1644237841,
      "title": "Ask HN: What are some good resources to learn about the Web3?",
      "type": "story"
    },
    {
      "by": "doublevcodes",
      "descendants": 0,
      "id": 30244000,
      "score": 1,
      "time": 1644237751,
      "title": "Making APIs shine like stars",
      "type": "story",
      "url": "https://github.com/doublevcodes/sirius"
    }
  ]
}