{
  "stories": [
    {
      "by": "untangle",
      "descendants": 0,
      "id": 30007226,
      "score": 1,
      "time": 1642675761,
      "title": "Rare unseen downtown San Francisco 1940s in color [60fps, Remastered]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=bZub2tAk69s"
    },
    {
      "by": "Archelaos",
      "descendants": 0,
      "id": 30007216,
      "score": 1,
      "time": 1642675694,
      "title": "Wannsee Conference [today is the 80th anniversary]",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Wannsee_Conference"
    },
    {
      "by": "KoftaBob",
      "descendants": 0,
      "id": 30007214,
      "score": 1,
      "time": 1642675673,
      "title": "Pocket Migration to Firefox Accounts",
      "type": "story",
      "url": "https://support.mozilla.org/en-US/kb/pocket-firefox-account-migration"
    },
    {
      "by": "GirlBASE",
      "descendants": 0,
      "id": 30007207,
      "score": 1,
      "text": "Welcome to Sakura College. There are 3,000 enrolled students and you have the chance to be the owner of those anime NFT girls. You&#x27;re able to get whitelisted by inviting 5 friends to our Discord and advancing level 5 in chat channel.<p>The world&#x27;s first star-raising game NFT is officially launched\n3000 girl NFTs will be admitted to Sakura College. From freshman to senior, your engagement and company in training could earn them more interesting attributes. After the launch of Girl GAMEFI, you will get a more immersive gaming experience by being a talent agent to sparkle their star careers.\nThe attributes of NFTs are determined by the users\nBefore the public release of NFT, Sakura College will organize several activities for girls to take, which include: Election of the Student Union, Group up Pop Girls, Valentine Masked Ball, etc. Champions could obtain precious titles, attributes, honors. Therefore, the rarity of NFTs is determined by the participation and selection of the audience. Meanwhile, the most popular ones will be the main characters of Girl EDU game launched this year later. Consequently, the most voted NFT characters represent significant values.<p>The world&#x27;s first EDU GAMEFI will come out this year\nEDU is the abbreviation of Education, a type of cultivation and romance game. &quot;Princess Maker&quot; is the milestone of the game category. GirlBASE will be the first EDU game with far-reaching effects in the GAMEFI world. Our game will be released later this year. Currently, our team is still working on thousands of original character drawings, as well as devising the storylines. Artworks will be sold periodically.\nEasy access to get whitelisted\nIn the pre-promotion phase of the project, the standard to get in is very low. Presently, you&#x27;re able to get whitelisted by inviting 5 friends to our Discord and advancing level 5 in the chat channel. Due to the low standard, there are only 100 spots available. Good Luck!\n    More coming, stay tuned. Keep following. The difficulty to get whitelisted and rewards will be leveled up over time.",
      "time": 1642675632,
      "title": "A Girl NFT will be available soon",
      "type": "story"
    },
    {
      "by": "headalgorithm",
      "descendants": 0,
      "id": 30007203,
      "score": 1,
      "time": 1642675594,
      "title": "My Out-of-Body Experience",
      "type": "story",
      "url": "https://nautil.us/issue/112/inspiration/my-out_of_body-experience"
    },
    {
      "by": "cheerioty",
      "descendants": 0,
      "id": 30007178,
      "score": 1,
      "text": "&quot;Facebook versus The BMJ: When fact checking goes wrong&quot;\n&quot;The internet changed my life&quot;\n&quot;Google is wrong. Apple&#x27;s iMessage is a failure&quot;<p>Or is it just me?",
      "time": 1642675411,
      "title": "Ask HN: Why does HN Top read like a tabloid front page today?",
      "type": "story"
    },
    {
      "by": "mostlystatic",
      "descendants": 0,
      "id": 30007160,
      "score": 1,
      "time": 1642675220,
      "title": "Should B2B SaaS businesses accept payment by bank transfer?",
      "type": "story",
      "url": "https://www.mattzeunert.com/2022/01/20/saas-payment-by-bank-transfer.html"
    },
    {
      "by": "papaver-somnamb",
      "descendants": 0,
      "id": 30007158,
      "score": 1,
      "text": "Founder of Vivid, maker of Vivid Trace for Atlassian Jira and Confluence. Landing page:<p>https:&#x2F;&#x2F;vivid-inc.net<p>I&#x27;d like to put this up (primarily the landing page) for constructive critique. Hopefully there is an opportunity for all of us to learn here.<p>While there are some people behind the scenes and many outsourcers, I have been doing all marketing by myself. Crucially, I recognize that I have a severe lack of skill in this department. I&#x27;ve been running this business for 8 years and have &quot;enough&quot; skills in value creation, customer development &amp; support, etc. The product has traction, it solves real problems for currently paying customers. BUT after reading much Indie Hackers etc. and HN items on marketing like<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29538355<p>marketing feels like a gaping void to me. And that deficiency has been acting as a dis-abler to the business. So, last week, I decided to dive into the deep end of marketing.<p>The current landing page was completed several months ago in 2021 October. Perhaps it&#x27;s a reasonable image of my current thinking and abilities. Transforming customer problems into messaging was interesting and even fun, but I still find writing to be excruciating. I believe in focusing on the desired outcomes for people, and in truthful representation of reality; so that should be on the page. The main purpose (CTA or Call To Action) is for the reader to start a 30-day free trial.  The landing page content is structured to be later divided into targeted landing pages, one per profession (software dev, QA tester, lead, etc.), and also one per vertical (insurance, banking, manufacturing, and so on) where current customers are (also thinking case studies here). Each landing page will harmonize well with targeted SEO and ads.<p>Point of interest: This is how I have grown in terms of awareness of marketing, off the top of my head:<p>Early 2010s: Importance of SEO, on-page SEO (WWW), &quot;The SEO Periodic Table&quot;, Google Webmaster &#x2F; Search Console (or whatever it was called). Business Model Canvas. Customer Development (marketing materials speak in the customers&#x27; own language). Book &quot;Nail It then Scale It&quot; by Nathan Furr. Pirate metrics, AIDA. Customer Experience, and in particular Customer Journey and touchpoints.<p>Late 2010s: Features&#x2F;Advantages&#x2F;Benefits (FAB). Importance of positioning &amp; declaring your niche amongst the competition, Book &quot;Positioning: The Battle for Your Mind&quot; by Al Ries. Jobs To Be Done. Headline writing. Tone, phrasing.<p>This week: Initiated Google Ads and Facebook Ads campaigns to build up high-intent top-of-funnel leads. Book: &quot;The 1-Page Marketing Plan&quot; by Allan Dib (pragmatic + really good so far), &quot;Obviously Awesome&quot; by April Dunford.",
      "time": 1642675202,
      "title": "Ask HN: Pls critique my product landing page marketing",
      "type": "story"
    },
    {
      "by": "WithinReason",
      "descendants": 0,
      "id": 30007128,
      "score": 1,
      "time": 1642675035,
      "title": "Nocebo responses explain up to 76% of Covid vaccine side effects",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/01/up-to-76-of-covid-vaccine-side-effects-are-just-in-peoples-heads-study-finds/"
    },
    {
      "by": "ajot",
      "descendants": 0,
      "id": 30007120,
      "score": 1,
      "time": 1642674948,
      "title": "A Pair of Dice Which Never Roll 7",
      "type": "story",
      "url": "https://www.chiark.greenend.org.uk/~sgtatham/dice/"
    }
  ]
}