{
  "stories": [
    {
      "by": "MikeUt",
      "descendants": 0,
      "id": 27790032,
      "score": 1,
      "time": 1625877321,
      "title": "Channel 4 pulls abuse film after police fears (2004)",
      "type": "story",
      "url": "https://www.theguardian.com/media/2004/may/20/channel4.broadcasting1"
    },
    {
      "by": "node-bayarea",
      "descendants": 1,
      "id": 27790024,
      "kids": [
        27790030
      ],
      "score": 1,
      "text": "Hi there, I&#x27;m looking for a technical discussion. I&#x27;m looking for technical debate and I know what MySQL&#x2F;PG and Redis are capable of. What I&#x27;m looking for is a debate where you <i>disagree</i> that following. I want to start with an analogy.\nGasoline cars vs. Electric cars We all know that you can use an electric battery to run a car.<p>But the thing is, when it comes to a gasoline car, even though it does literally have a battery, it’s not used for running the car. It uses batteries for starting the cars (generating an electric spark to light up the gas), A&#x2F;C, audio systems, lights, sensors, locks, and so on but not for running the car. Instead, it relies on an internal combustion engine (ICE) to run the car.<p>It turns out, ICE cars are highly inefficient. Only 16% to 25% of the power that’s generated actually makes it into the wheels. On the other hand, electric vehicles provide about 90% power to the wheels! Further, EVs also have major and additional advantages when it comes to the environment, repair costs, and so on.<p>If you are looking from the First Principles, even though virtually most cars that are built even today are gasoline cars, the fundamental truth is that they use an inefficient system.<p>Now if you look at an electric car, it takes advantage of this inefficiency to build a new type of car. In this case, it simply gets rid of the complex and highly inefficient engine and replaces it with a large battery and a motor to directly spin the wheels.<p>------------- Now coming to the Databases...<p>In the traditional architecture, you have a primary database (Postgres, Mongo, etc.) and a secondary database, a.k.a, cache (e.g. Redis or Memcache). The primary DB is used to store all the data and support CRUD operations. The caching DB is used for caching, session storage, rate-limiting, IP-whitelisting, Pub&#x2F;Sub, queuing, and many other things.<p>And if you think about it, when there is a cache-hit, we are practically using the secondary DB for part of the CRUD operations, but still not fully utilizing it as a primary database.<p>Does this remind you of the issue with gasoline cars? Just like they literally carry a battery to power numerous things except moving the car, the traditional architectures use things like Redis for everything else except as the main DB.<p>Do you see the similarities?<p>What if we use the First Principles thinking to do what the electric car did? Similar to how EVs got rid of the engine, what if we get rid of the slow and inefficient primary database and simply use the cache DB as the main database?<p>https:&#x2F;&#x2F;redislabs.com&#x2F;blog&#x2F;dbless-architecture-and-why-its-the-future&#x2F;",
      "time": 1625877242,
      "title": "Can you replace Postgres with Redis (for some usecases)?",
      "type": "story"
    },
    {
      "by": "caymanjim",
      "descendants": 0,
      "id": 27790005,
      "score": 1,
      "time": 1625877083,
      "title": "C64 Demo, No C64",
      "type": "story",
      "url": "https://hackaday.com/2021/07/08/c64-demo-no-c64/"
    },
    {
      "by": "throwawaysea",
      "descendants": 1,
      "id": 27790001,
      "kids": [
        27790018
      ],
      "score": 2,
      "time": 1625877043,
      "title": "Executive Order on Promoting Competition in the American Economy",
      "type": "story",
      "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/07/09/executive-order-on-promoting-competition-in-the-american-economy/"
    },
    {
      "by": "sdan",
      "descendants": 0,
      "id": 27789999,
      "score": 1,
      "time": 1625877039,
      "title": "Compose.ai raises $2.1M to help everyone write faster and#8211; TechCrunch",
      "type": "story",
      "url": "https://techcrunch.com/2021/06/08/compose-ai-raises-2-1m-to-help-everyone-write-faster/"
    },
    {
      "by": "SQL2219",
      "descendants": 0,
      "id": 27789995,
      "score": 2,
      "time": 1625877011,
      "title": "It's Official. We Can Now Harvest Usable Lithium from Seawater",
      "type": "story",
      "url": "https://interestingengineering.com/lithium-from-seawater"
    },
    {
      "by": "karlzt",
      "descendants": 0,
      "id": 27789969,
      "score": 1,
      "time": 1625876799,
      "title": "Steve Wozniak: Bitcoin Is ‘Mathematical Miracle’",
      "type": "story",
      "url": "https://decrypt.co/75591/apple-co-founder-steve-wozniak-calls-bitcoin-mathematical-miracle?"
    },
    {
      "by": "beprogrammed",
      "descendants": 1,
      "id": 27789952,
      "kids": [
        27790037
      ],
      "score": 3,
      "time": 1625876601,
      "title": "Linux Audio Is Dead",
      "type": "story",
      "url": "https://non.tuxfamily.org/wiki/2021-02-07%20Linux%20Audio%20is%20Dead"
    },
    {
      "by": "pjfin123",
      "descendants": 0,
      "id": 27789943,
      "score": 1,
      "time": 1625876558,
      "title": "Dining Philosophers Problem Animation",
      "type": "story",
      "url": "https://commons.wikimedia.org/w/index.php?title=File%3ADining_Philosophers_Problem.webm"
    },
    {
      "by": "alok-g",
      "descendants": 1,
      "id": 27789920,
      "kids": [
        27789924
      ],
      "score": 1,
      "time": 1625876389,
      "title": "A motorless vehicle driven solely by wind, goes faster than the wind itself",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=jyQwgBAaBag"
    }
  ]
}