{
  "stories": [
    {
      "by": "ElectricMind",
      "descendants": 0,
      "id": 27953260,
      "score": 1,
      "text": "Hello All,<p>As you know, now days job description&#x2F;requirements are so vague and includes so many things for just one role that it is hard to understand what is realistically needed or actually being used for that role in any organization. So this is one attempt to solve this puzzle, hopefully, with your help.<p>So maybe if you could write something on below format that would be helpful to everyone<p>Your Role&#x2F;Title [1]:\nExtensive Used technologies in last 24 months [2]: \nRarely&#x2F;Sometimes used technologies in last 24 months [3]:<p>[1] For example: Senior Java Developer, Full Stack Developer etc...\n[2] Almost every day or most days in week\n[3] Not used in [2] but requires sometimes<p>Also one last question to this, if you could write job posting for your job today, what list of technologies bare minimum candidate must know to be successful in your job?<p>Thanks for your time. I hope it will help everyone to get realistic idea what is actually needed for any job :)",
      "time": 1627249902,
      "title": "Ask HN: What are list of technologies you used in your job for last 24 months?",
      "type": "story"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 27953257,
      "score": 2,
      "time": 1627249884,
      "title": "The Rise of Olympic Skateboarding and the Debate over Skating Culture",
      "type": "story",
      "url": "https://www.theringer.com/2021/7/22/22587848/rise-of-olympic-skateboarding-debate-over-skating-culture"
    },
    {
      "by": "misterxi",
      "descendants": 0,
      "id": 27953214,
      "score": 1,
      "time": 1627249588,
      "title": "WebKit Quirks",
      "type": "story",
      "url": "https://github.com/WebKit/WebKit/blob/31b77296cf6d85c40313812d9f65a003cf41f440/Source/WebCore/page/Quirks.cpp"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 27953209,
      "score": 3,
      "time": 1627249574,
      "title": "Large study finds Covid-19 is linked to a substantial drop in intelligence",
      "type": "story",
      "url": "https://www.psypost.org/2021/07/large-study-finds-covid-19-is-linked-to-a-substantial-drop-in-intelligence-61577"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 27953205,
      "score": 1,
      "time": 1627249558,
      "title": "It’s All Training Data: Using Lessons from Machine Learning to Retrain Your Mind",
      "type": "story",
      "url": "https://thegradient.pub/its-all-training-data/"
    },
    {
      "by": "lamplightdev",
      "descendants": 1,
      "id": 27953202,
      "kids": [
        27953237
      ],
      "score": 1,
      "time": 1627249515,
      "title": "Show HN: Wafer – a small Web Component base library for the client and server",
      "type": "story",
      "url": "https://waferlib.netlify.app/"
    },
    {
      "by": "Anon84",
      "descendants": 0,
      "id": 27953185,
      "score": 1,
      "time": 1627249387,
      "title": "Four golden lessons: Advice to students at the start of their scientific careers [pdf]",
      "type": "story",
      "url": "https://www.nature.com/articles/426389a.pdf"
    },
    {
      "by": "TechBro8615",
      "descendants": 0,
      "id": 27953174,
      "score": 1,
      "text": "In a time when the in-group is increasingly self-defined, as geography becomes decoupled from allegiance, does the nation state seem like an anachronism?<p>As a thought experiment, what would the world look like if we had:<p>- opt-out citizenship based on birth location<p>- opt-in subscription citizenship decoupled from geography<p>- voluntary and public tax payments (subscription fees)<p>The idea is to &quot;put your money where your mouth is,&quot; taken to the extreme – even the playing field with opt-out citizenship, create equity by decoupling it from geography, and provide accountability by transacting in public. To me, this seems like it solves some people&#x27;s alleged grievances, but creates new problems. It also raises other questions, like switching costs – can you move between governments as frequently as you&#x27;d like?<p>Ignoring the fact that this is totally implausible for a number of reasons – mostly due to violence – I&#x27;ve been finding it a fun idea to think about recently.<p>Would you want to live in this world? Will we inevitably converge on something approaching it?",
      "time": 1627249327,
      "title": "Ask HN: What comes after the nation state?",
      "type": "story"
    },
    {
      "by": "thcipriani",
      "descendants": 0,
      "id": 27953172,
      "score": 1,
      "time": 1627249312,
      "title": "Code Review Is Work",
      "type": "story",
      "url": "https://tylercipriani.com/blog/2021/07/25/code-review-is-work/"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 27953162,
      "score": 1,
      "time": 1627249262,
      "title": "Ohio Scientific and Commodore 64 Environments",
      "type": "story",
      "url": "https://xp123.com/articles/osi-and-c64-environments/"
    }
  ]
}