{
  "stories": [
    {
      "by": "chasebrignac",
      "descendants": 0,
      "id": 32139918,
      "score": 1,
      "text": "Chase here - our mission is to build an open source AI company focused on developing products for enterprises. The repo is at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;humanishai\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;humanishai</a> (please take a moment to star!) and our home page is <a href=\"https:&#x2F;&#x2F;beta.humanish.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.humanish.ai</a><p>After a decade of working at several labs and companies including NASA and Target, I originally quit my job to start a generative media company at YC. We didn’t manage to solve that problem, but we learned how hungry people are to use the biggest AI models.<p>However, when we signed up for access we were put on a waitlist, it bothered us how we needed to send our users data to third parties and get approval before launching our product. Waiting weeks or even months for access felt exclusive if we could get access at all to the big models, and it felt wrong from a privacy perspective. AI should be accessible to anyone. We designed Humanish AI to solve these problems.<p>We made Humanish AI with a set of features that can be extended easily. All of the code will be open source. And all of the models will be too. There is a Discord server where we will train models together with the Open Source community. We&#x27;ll post on Twitter and Instagram. Anyone can help out training, adding features, or making suggestions on Github rather than being excluded. I am personally stoked to read every single one of your suggestions and reply myself!<p>You can have source code access to every part of the process from data collection and cleaning, to training and infrastructure, to backend and frontend, to challenger&#x2F;champion deployment systems, and we are building a cloud version you can sign up for too. That means our plan is to have the best parts of the 3rd party deep learning model providers but are more privacy and developer friendly.<p>We’re thinking of adding features around many more modalities, so please let us know what you would find useful for an enterprise you know.<p>We are platform and language agnostic, with a very simple setup. If you want Python, we give you a library. For anything else, there’s a REST API you can signup for to get early access <a href=\"https:&#x2F;&#x2F;beta.humanish.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.humanish.ai</a> The repos have instructions for AWS, Terraform, or Docker.<p>We’ve launched this repo under MIT license so any developer can use the tools. The goal is to not charge individual developers. We make money by charging a license fee for things like multiple users, user permissions, training or fine tuning custom models, providing a hosted version, support, and any new features or models an enterprise needs.<p>Give us suggestions for your enterprise: github.com&#x2F;humanishai Leave a star! Is there something you want? Make a suggestion in Github discussions or make a PR and I&#x27;ll personally merge it in. For any new paid feature, to help us out, or for investment reach out to sales at contact@humanish.ai",
      "time": 1658160552,
      "title": "Show HN: Humanish AI – open-source Version of OpenAI",
      "type": "story",
      "url": "https://beta.humanish.ai"
    },
    {
      "by": "c-forster",
      "descendants": 0,
      "id": 32139910,
      "score": 1,
      "time": 1658160511,
      "title": "Are Large Language Models Operationalizations of Saussurean Structure?",
      "type": "story",
      "url": "https://c-forster.github.io/2022/07/on-words/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32139908,
      "score": 1,
      "time": 1658160506,
      "title": "Open Source Monthly: July 2022 Edition",
      "type": "story",
      "url": "https://github.blog/2022-07-18-open-source-monthly-july-2022-edition/"
    },
    {
      "by": "sylvainkalache",
      "descendants": 0,
      "id": 32139862,
      "score": 2,
      "time": 1658160190,
      "title": "Liberty Mutual’s Container Deployment – From Docker to Kubernetes",
      "type": "story",
      "url": "https://www.itprotoday.com/containers/liberty-mutual-s-container-deployment-docker-kubernetes"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32139854,
      "score": 1,
      "time": 1658160138,
      "title": "Robot dog learns to walk in one hour",
      "type": "story",
      "url": "https://techxplore.com/news/2022-07-robot-dog-hour.html"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32139850,
      "score": 1,
      "time": 1658160124,
      "title": "Taiwan prosecutors claim Chinese biz swiped IP and R&D team from Apple supplier",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/18/apple_ip_theft_taiwan/"
    },
    {
      "by": "andrewdubinsky",
      "descendants": 0,
      "id": 32139844,
      "score": 1,
      "text": "They got bought by Zoom in May 2020 and have seemingly not updated anything since.<p>Is this just a dead product, an acquihire?",
      "time": 1658160115,
      "title": "Ask HN: What Happened to Keybase.io?",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32139843,
      "score": 1,
      "time": 1658160107,
      "title": "China once saw Europe as a counter to US power. Now ties are at an abysmal low",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_29009dff99c7dfe148bf1af4b25244bf"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32139841,
      "score": 1,
      "time": 1658160092,
      "title": "Why people watch pornography at work",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20220714-why-people-watch-pornography-at-work"
    },
    {
      "by": "Lucab12",
      "descendants": 0,
      "id": 32139839,
      "score": 1,
      "text": "Hi. Sorry if this question seems silly. I was wondering how common it is to sign a SAFE for a specific value of money that is not actually paid by the investor to the startup, but instead, he provides a service congruent to that value.<p>How is this usually handled?\nThank you very much!",
      "time": 1658160090,
      "title": "Safe in exchange of a service rather than cash",
      "type": "story"
    }
  ]
}