{
  "stories": [
    {
      "by": "nowherebeen",
      "descendants": 0,
      "id": 28029758,
      "score": 1,
      "text": "I need to draft a Terms of Service for my marketplace product.  I am struggling to find any good references online.",
      "time": 1627850612,
      "title": "Ask HN: Know any good marketplace ToS/ToC I can reference or use?",
      "type": "story"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 28029747,
      "score": 2,
      "time": 1627850543,
      "title": "Philippine President Tells Vaccine Deniers: 'You Can Die Anytime'",
      "type": "story",
      "url": "https://www.businessinsider.com/philippines-president-tells-vaccine-deniers-die-any-time-2021-7"
    },
    {
      "by": "devjeffops",
      "descendants": 1,
      "id": 28029722,
      "kids": [
        28029723
      ],
      "score": 1,
      "time": 1627850408,
      "title": "Show HN: Docmir – CLI application to sync images from dockerhub",
      "type": "story",
      "url": "https://www.npmjs.com/package/docmir"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28029702,
      "score": 2,
      "time": 1627850315,
      "title": "On Veganism – and why it shouldn't be easily mocked and written off",
      "type": "story",
      "url": "https://www.aliciakennedy.news/p/on-veganism"
    },
    {
      "by": "rtbtobi",
      "descendants": 1,
      "id": 28029682,
      "kids": [
        28029683
      ],
      "score": 1,
      "time": 1627850242,
      "title": "How to unite and manage the world by a natural/logical religion",
      "type": "story",
      "url": "https://github.com/rene-tobner/unity/create/main"
    },
    {
      "by": "Hedgemaster",
      "descendants": 1,
      "id": 28029670,
      "kids": [
        28029720,
        28029692
      ],
      "score": 5,
      "text": "Hi HN community!<p>Below I briefly share my views on certain practices currently employed by ALL retail brokerages (including Robinhood), how those practices contribute to rising inequality, insiders’ attempts to defend such practices and how retail trading community could break the mould. Would love to hear your thoughts and counter-arguments!<p>First of all, retail brokers do not provide many intuitive tools that professionals are using. The worst in that respect would be Robinhood and Webull. Apart from gamifying the whole trading experience their apps lack even the basic indicators, essentially turning stock and options trading into compulsive gambling. The end result is that retail traders are armed with inferior tools and are more likely to lose money by making some very basic trading mistakes.<p>Secondly, there is a practice called PFOF (Payment for Order Flow). Retail brokers do not directly route their clients’ orders to the exchanges but to yet another intermediary: market-makers. Those are sitting in between the actual exchanges and retail brokers making money on the bid-ask spreads (differences between buying and selling prices). Those market-makers incentivize retail brokers by paying them for the order flow they route, therefore creating a conflict of interest: retail brokers are inclined to seek higher PFOF rather than the best price for their end-users. What’s worse, retail traders tend to get lower quality execution compared to institutional traders (like hedge funds and family offices). Professional traders (from my own experience) route their orders directly to the exchanges oftentimes earning that way rebates from exchanges. As such, retail traders are put at a disadvantage.<p>Some retail brokers decide to take the offensive and publicly praise(!) the PFOF practice. One of them is the founder of Think or Swim (sold to TD Ameritrade) and Tastyworks, Tom Sosnoff. As can be seen on this video<p>https:&#x2F;&#x2F;www.facebook.com&#x2F;watch&#x2F;?v=5658429654182670<p>He suggests that retail investors would be worse off without the middleman since “they would be ripped off by the exchanges”. As someone who worked in the financial markets I find such statement rather amusing, given that the fund I worked for never used one... He then advocates the existence of the intermediary by the fact that “Tastyworks doesn’t have such technologies...” but careful enough not to present it as a weakness :)<p>The bottom line is that the practice introduced by Bernie Madoff is here to stay. At least for now.<p>What public can do about that? First of all, we should not resort to spreading falsehoods and conspiracy theories; those will only prolong and strengthen the status quo. The flat-Earth-like theories about market-makers “secretly short-selling stocks” that are so dominant on Reddit and other sources (even on HN: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27924556) do not only cause any damage to the market-makers, they are essentially their shield and a best chance for survival. Those conspiracy theories serve as a distraction from the actual issues that retail trading is facing.<p>What the public can do:<p>1. Lobbying lawmakers for at least a possibility to opt out of PFOF<p>2. Monitor and compare brokers&#x27; execution quality; some (Robinhood, Fidelity and Charles Schwab) make it publicly available:<p>https:&#x2F;&#x2F;www.schwab.com&#x2F;execution-quality&#x2F;quality-statistics<p>3. Consider switching to PFOF-free brokerages, there are a few initiatives out there. That way the incumbents would be forced to provide PFOF-free options just like they were forced to drop stock trading commissions.<p>4. Shun any broker that does not provide meaningful trading tools that would ALSO be comprehensible to the general public. Again, that would give a signal to Robinhood and the likes to add useful indicators and insights.",
      "time": 1627850163,
      "title": "Modern-day Robinhoods, the ones that contribute to rising inequality",
      "type": "story"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28029667,
      "score": 1,
      "time": 1627850145,
      "title": "Mark Crispin Miller – 2020: A Propaganda Masterpiece",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=w0bC6CAtfBE"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28029634,
      "score": 2,
      "time": 1627849962,
      "title": "Now, risks of further isolation are worse than Covid",
      "type": "story",
      "url": "https://www.hmbreview.com/opinion/matters_of_opinion/now-risks-of-further-isolation-are-worse-than-covid/article_3f02540e-efcf-11eb-b48d-837249cc878e.html"
    },
    {
      "by": "exar0815",
      "descendants": 0,
      "id": 28029632,
      "score": 1,
      "time": 1627849927,
      "title": "Terror, survival, tragedy and the house that floated away",
      "type": "story",
      "url": "https://www.washingtonpost.com/world/2021/07/23/germany-floods-street-night/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 28029600,
      "score": 2,
      "time": 1627849745,
      "title": "How Minecraft is helping children with autism make new friends",
      "type": "story",
      "url": "https://www.newscientist.com/article/mg23030713-100-how-is-helping-children-with-autism-make-new-friends/"
    }
  ]
}