{
  "stories": [
    {
      "by": "Trias11",
      "descendants": 0,
      "id": 31184269,
      "score": 1,
      "time": 1651085883,
      "title": "Ask HN: How would you invest $1M for passive income/cash flow?",
      "type": "story"
    },
    {
      "by": "mjul",
      "descendants": 0,
      "id": 31184249,
      "score": 1,
      "time": 1651085809,
      "title": "Bitcoin becomes official currency in Central African Republic",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/world-africa-61248809"
    },
    {
      "by": "strangattractor",
      "descendants": 0,
      "id": 31184235,
      "score": 2,
      "text": "There has been much speculation as to why Musk wants to own Twitter. I would like to add to it.  His 2 hobbies appear to be 1. Trolling people on Twitter 2. Trolling about Cryto.<p>Maybe Twitter could be a vehicle for promoting&#x2F;implementing a new coin or FinTech. Musk isn&#x27;t stupid and neither are the backers of the 44 billion in loans.  It seems ludicrous to me that he would be able to do this without a serious plan to increase the value of the investment. Having guarantied access as some have suggested just isn&#x27;t enough. Any thoughts?",
      "time": 1651085756,
      "title": "Ask HN: Why does Musk want to own Twitter?",
      "type": "story"
    },
    {
      "by": "razcle",
      "descendants": 0,
      "id": 31184232,
      "score": 1,
      "time": 1651085754,
      "title": "Some Intuition for Jensen's Inequality",
      "type": "story",
      "url": "https://razcle.github.io/jensen"
    },
    {
      "by": "mbauer42",
      "descendants": 0,
      "id": 31184223,
      "score": 1,
      "time": 1651085709,
      "title": "Show HN: Alceris – Privacy focused analytics solution",
      "type": "story",
      "url": "https://alceris.com"
    },
    {
      "by": "josteink",
      "descendants": 0,
      "id": 31184196,
      "score": 1,
      "time": 1651085576,
      "title": "Dirty Secrets of the Linux and Open Source Industry",
      "type": "story",
      "url": "https://lunduke.substack.com/p/6-dirty-secrets-of-the-linux-and"
    },
    {
      "by": "flurie",
      "descendants": 0,
      "id": 31184189,
      "score": 1,
      "time": 1651085556,
      "title": "AWS's Open Source Problem",
      "type": "story",
      "url": "https://www.lastweekinaws.com/blog/awss-open-source-problem/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31184185,
      "score": 2,
      "time": 1651085539,
      "title": "Archegos founder Bill Hwang arrested on US fraud charges",
      "type": "story",
      "url": "https://www.ft.com/content/acc0158d-77cd-422d-b8be-d3ae64b588a1"
    },
    {
      "by": "janandonly",
      "descendants": 0,
      "id": 31184170,
      "score": 1,
      "time": 1651085443,
      "title": "Malicious relays and the health of the Tor network",
      "type": "story",
      "url": "https://blog.torproject.org/malicious-relays-health-tor-network/"
    },
    {
      "by": "eternalban",
      "descendants": 0,
      "id": 31184114,
      "score": 2,
      "text": "I was thinking about the latest human folly and in an uber objective mode of not trying to paint one or the other as &#x27;evil incarnate&#x27; happened on the conclusion that the core issue is fundamentally that of a deficient working model for civilization (as a unit) and composition of these units into a larger harmonious whole. That doesn&#x27;t predictably periodically descends into warfare.<p>The basic idea that drove policy in the last century (and this century was supposed to be the proof of the idea) was that (a) civilization units have core, not necessarily physical, centers; and (b) trade between these units is how they compose to higher harmonious forms.<p>So, there are 2 fronts to innovate here. One is the unit model. Is it possible for example to have a stripped down version of what constitutes a civilization (think micro kernel) and then have global level integration? What are the components of the stripped core model? Can there be symbiotic types? Binary or higher order partial civilizations that collectively become one? I think possibly historic Europe qualifies for that with its mix of Latin, German, etc. that naturally fall under an umbrella of European. These forms seem to require one unifying shared element, here the Church.<p>The second front is how these units compose. Warfare, trade, cultural exchange. Also population exchanges are a historic specimen of inter-unit interactions. So Q here is, given that the 20th century emphasis on &#x27;trade&#x27; as the singular most important dimension is now shown to be false, and some units are resorting to &#x27;warfare&#x27; to affect changes in global order, is there actually a solution to this problem short of supremacy of a victorious unit? If you take a moralist stance, you&#x27;ll need to answer questions such as &#x27;is it OK for liberal civilizations to interact with authoritarian ones?&#x27;.<p>As a kind of a third rail there is the fact that availability of certain technologies provide a sort of ground level constraint to any consideration since even disputes involving other 3rd parties can have very local detrimental effects.<p>So is there a compositional solution or are we destined to duke it out for a final round?<p>[p.s. things like &#x27;ritualized warfare&#x27; for example are on the table.]",
      "time": 1651085163,
      "title": "Ask HN: Devise a Civilizational Model",
      "type": "story"
    }
  ]
}