{
  "stories": [
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 31944724,
      "score": 1,
      "time": 1656673436,
      "title": "SLINKY: Static Linking Reloaded",
      "type": "story",
      "url": "https://www.usenix.org/legacy/publications/library/proceedings/usenix05/tech/general/full_papers/collberg/collberg_html/main.html"
    },
    {
      "by": "daveys110",
      "descendants": 0,
      "id": 31944717,
      "score": 1,
      "text": "I&#x27;m a big believer in Kubernetes, but was amazed to read that Mercedes-Benz recently shared they operate over 900 Kubernetes clusters - https:&#x2F;&#x2F;www.infoworld.com&#x2F;article&#x2F;3664052&#x2F;why-mercedes-benz-runs-on-900-kubernetes-clusters.html<p>Excluding hosting providers (e.g. AWS for EKS, Google for GKE, etc) how many Kubernetes clusters does your company operate, and what information can you share about them?<p>Example:\n- How many k8s clusters do you have?<p>- How many VMs in total or typical cluster size?<p>- How many containers do you run?<p>- Why so many? (e.g. lots of customers, lots of internal developers, cell-based architecture, etc)\n- Do you run on EKS, GKE, AKS, OpenShift, bare metal etc?\n- How do you manage them (Rancher, Crossplane, Terraform, etc)?\n- Is the platform growing or shrinking?\n- What&#x27;s the split between development &amp; production?\n- If you&#x27;re able to share the company name, great... if not, can you explain the space you&#x27;re in (e.g. SaaS provider, AdTech, etc)\n- For those at scale (more than 500), what have you found that a) works well b) doesn&#x27;t work well?<p>Thanks for sharing!",
      "time": 1656673400,
      "title": "Ask HN: How many Kubernetes clusters does your company operate?",
      "type": "story"
    },
    {
      "by": "Abishek_Muthian",
      "descendants": 0,
      "id": 31944705,
      "score": 1,
      "time": 1656673266,
      "title": "How Many Decimals of Pi Do We Need?(2016)",
      "type": "story",
      "url": "https://www.jpl.nasa.gov/edu/news/2016/3/16/how-many-decimals-of-%20pi-do-we-really-need/"
    },
    {
      "by": "remoteshifts",
      "descendants": 0,
      "id": 31944701,
      "score": 1,
      "time": 1656673223,
      "title": "Ask HN: Please recommend free iPhone app to use as webcam at 1080p",
      "type": "story"
    },
    {
      "by": "espadrine",
      "descendants": 0,
      "id": 31944680,
      "score": 2,
      "time": 1656672984,
      "title": "Minerva: Solving Quantitative Reasoning Problems with Language Models",
      "type": "story",
      "url": "https://minerva-demo.github.io/"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 31944671,
      "score": 1,
      "time": 1656672912,
      "title": "‘An old strain of English magic had returned’: stars on love for Kate Bush",
      "type": "story",
      "url": "https://www.theguardian.com/music/2022/jul/01/an-old-strain-of-english-magic-had-returned-stars-on-why-they-fell-in-love-with-kate-bush"
    },
    {
      "by": "CaptainZapp",
      "descendants": 0,
      "id": 31944650,
      "score": 2,
      "time": 1656672729,
      "title": "McKinsey Guided Companies at the Center of the Opioid Crisis",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/29/business/mckinsey-opioid-crisis-opana.html"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31944636,
      "score": 12,
      "time": 1656672548,
      "title": "Germany’s move to legalise cannabis expected to create ‘domino effect’",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/jul/01/germanys-move-to-legalise-cannabis-expected-to-create-domino-effect"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31944622,
      "score": 1,
      "time": 1656672300,
      "title": "Cold-blooded animals that never seem to age",
      "type": "story",
      "url": "https://english.elpais.com/science-tech/2022-07-01/cold-blooded-animals-that-never-seem-to-age.html"
    },
    {
      "by": "dodoso",
      "descendants": 0,
      "id": 31944616,
      "score": 3,
      "text": "I submitted this 2 weeks ago: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31736853 (Do people want a LinkedIn alternative?) and tallied up everyone&#x27;s opinion (both negative and positive).<p>Here&#x27;s a breakdown of what people said:<p><i>Want</i> - <i>Count</i><p><pre><code>  No social media - 13\n  Keep in touch with old colleagues - 7\n  No recruiter spam - 6\n  Find new job - 5\n  Pressure to grow with leads to social media - 5\n  Passive network - 5\n  Focus on skill, not resume - 4\n  No random contacts &#x2F; connections - 4\n  Public profile page - 4\n  Use email - 3\n  Find candidates (search companies) - 2\n  No approach from recruiter if not looking for a job -2\n  Community - 1\n</code></pre>\nI developed 4 personas based on this survey.<p><pre><code>  The cynic\n  1) Dislike social media\n  2) Need for growth and monetization will ruin your product\n  3) LinkedIn does it&#x27;s job and let&#x27;s leave it at that\n\n  The networker\n  1) Want to keep in contact with old colleagues\n  2) Dislike recruiter spam\n  3) Dislike social media\n  4) Use only email\n\n  The job hunter\n  1) Want to find new job\n  2) Want recruiters to propose new jobs to them\n  3) Want to focus on skill rather than resume\n  4) Use LinkedIn as a passive static page\n\n  The recruiter&#x2F; hiring manager\n  1) Search companies for candidates\n  2) Skills validation\n</code></pre>\nThe networkers seems unhappy with LinkedIn.  The job hunters and recruiters are willing to deal with tons of spam for the chance of finding their next opportunity or the right candidate.   Everyone seems to agree that social media is the worst part of LinkedIn and is a net negative to the user experience.    So much so that many users do not login for months on end other than occasionally updating their resume or checking inMail.<p>Taking the breakdown of what people said, I want to propose an alternative version that focuses more on the social capital aspect of professional networking.   We are primarily targeting the networker persona that do not feel LinkedIn fulfills their needs.  Such as meeting other professionals in the industry, understanding the local industry landscape, and asking for advice for professional challenges.<p>Our platform will be a professional directory based on location and industry.   Users will need a work email to register to validate their company.   In order to add someone to their connections, they need to know the specific person’s work email.  This can help users stay in touch with one another after they leave their current role.  There is no global candidate search by name to cut the number of random connection requests.<p>Add your LinkedIn link (or any personal homepage) to your profile if you want to redirect users to your resume.  We believe this is best for our users that want a single source of truth for their experience.<p>There will be NO social media.  You don’t want to read about other people’s personal update.<p>The platform does one thing only: connecting industry professionals that have legitimate reason to with one another.  We aren’t looking to replace LinkedIn.  We want to focus more on that parts that LinkedIn doesn’t do well at.<p>Is this something you are willing to try out?  We are looking for feedback&#x2F; validation and early beta users.   If you could, would you mind dropping your email in this form:<p>https:&#x2F;&#x2F;forms.gle&#x2F;abw59j8FZBXKJRNa7<p>Let me know if you have any questions.",
      "time": 1656672218,
      "title": "Ask HN: Want feedback on LinkedIn alternative",
      "type": "story"
    }
  ]
}