{
  "stories": [
    {
      "by": "sharestuff",
      "descendants": 0,
      "id": 28326561,
      "score": 1,
      "time": 1630064654,
      "title": "How to set up Docker for Varnish HTTP/2 request smuggling",
      "type": "story",
      "url": "https://labs.detectify.com/2021/08/26/how-to-set-up-docker-for-varnish-http-2-request-smuggling/"
    },
    {
      "by": "_benj",
      "descendants": 0,
      "id": 28326546,
      "score": 2,
      "text": "Hello everyone,<p>I recently got a job offer but it contains the troubling clause that any the employee couldn’t engage in any employment, contract or any other  business activity without a written consent from the company.<p>Having a few projects that I do evenings and weekends it seems like a big overreaching by the company to require disclosure of any business activity in order to get permission from them.<p>Have you guys come across a clause like this before? Is it standard and I’m overreacting? How have you dealt with it?<p>Thx",
      "time": 1630064579,
      "title": "Ask HN: Job contract limiting Outside Activities?",
      "type": "story"
    },
    {
      "by": "Geee",
      "descendants": 0,
      "id": 28326540,
      "score": 1,
      "time": 1630064523,
      "title": "The Bitcoin Revolution in Africa: Explained",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=r7lm7IHnKDw"
    },
    {
      "by": "user_235711",
      "descendants": 0,
      "id": 28326539,
      "score": 1,
      "time": 1630064513,
      "title": "Art Makes the Familiar New Again",
      "type": "story",
      "url": "http://passionatereason.com/2021/08/art-makes-the-familiar-new-again/"
    },
    {
      "by": "elsus",
      "descendants": 0,
      "id": 28326536,
      "score": 1,
      "text": "Hello,<p>I&#x27;m currently working for a small company (3-6 people) that has an ambition to grow slightly in a future but not too much. We have arrived to a point where our customers are used to calling us or sending us an email explaining the problem.<p>After a disussion we arrived to a conclusion that an upgrade of the current system is needed.<p>Here is my idea of the whole project: - Customer would have an access to the helpdesk from anywhere\n- If they would like to send a ticket, some sort of verification to databes would be needed (I was toying with an idea of just checking the users name&#x2F;telephone&#x2F;date of birth to allow the ticket to fallthrough eliminating intruders)\n- The ticket would arrive to a destination where it would be organized among other tickets (It could be software running on a physical server or even a cloud solution I don&#x27;t really care)\n- There would be a basic way of managing the tickets (the ability to modify the text of the ticket, adding labels to existing tickets, retention of tickets)<p>The main goal is to organize workflow a bit better so I would like to keep it simple. Basically all I need is a universal system of &quot;seeing the tickets&#x2F;problems&quot;. Our current solution is a tad chaotic.<p>Scalability would be nice but we have no ambitions of growing past let&#x27;s say 10 people so any features beyond the solutions to the main problem would only make the overall process of creation and maintaining the software too complicated.<p>Thanks for any advice on this topic since I really don&#x27;t know where to start.\nJust please keep it minimalistic and simple. Like I said our main goal is a better inner organization of resources and problems.<p>Have a nice day y&#x27;all",
      "time": 1630064502,
      "title": "I'm searching for an easy way of setting up a minimalistic ticketing system",
      "type": "story"
    },
    {
      "by": "nexus_dave",
      "descendants": 1,
      "id": 28326528,
      "kids": [
        28326529
      ],
      "score": 1,
      "time": 1630064474,
      "title": "I Created a List of SaaS Companies Ranked by Fastest Landing Page",
      "type": "story",
      "url": "https://superthread.fyi"
    },
    {
      "by": "Misiek_k",
      "descendants": 0,
      "id": 28326502,
      "score": 1,
      "time": 1630064304,
      "title": "Managing suicidal depression – real-life stories",
      "type": "story",
      "url": "https://twitter.com/mich_kanka/status/1430966714523660295"
    },
    {
      "by": "job977",
      "descendants": 0,
      "id": 28326496,
      "score": 1,
      "time": 1630064281,
      "title": "Can donate you old unused RPI for testing",
      "type": "story"
    },
    {
      "by": "lanna",
      "descendants": 0,
      "id": 28326479,
      "score": 4,
      "time": 1630064139,
      "title": "Who Would Kidnap a Space Telescope?",
      "type": "story",
      "url": "https://www.theatlantic.com/science/archive/2021/03/nasa-james-webb-space-telescope-pirates/618268/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28326464,
      "score": 1,
      "time": 1630064024,
      "title": "Women's Sumo",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Women%27s_sumo"
    }
  ]
}