{
  "stories": [
    {
      "by": "MzHN",
      "descendants": 0,
      "id": 31099458,
      "score": 1,
      "time": 1650472369,
      "title": "Payment system for tomorrow: Frictionless, sustainable, low-cost and scalable",
      "type": "story",
      "url": "https://taler-systems.com/en/"
    },
    {
      "by": "vmullin",
      "descendants": 0,
      "id": 31099450,
      "score": 1,
      "time": 1650472337,
      "title": "Discussions in Brave Search: real human answers in search results",
      "type": "story",
      "url": "https://brave.com/discussions-in-brave-search/"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31099431,
      "score": 1,
      "time": 1650472271,
      "title": "The Lady Vanishes",
      "type": "story",
      "url": "https://aeon.co/essays/why-are-women-philosophers-often-erased-from-collective-memory"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31099427,
      "score": 2,
      "time": 1650472261,
      "title": "LinkedIn can’t use anti-hacking law to block web scraping, judges rule",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/04/linkedin-cant-use-anti-hacking-law-to-block-web-scraping-judges-rule/"
    },
    {
      "by": "lucasbotzen",
      "descendants": 0,
      "id": 31099426,
      "score": 1,
      "text": "Remote work is here to stay. With more companies going remote, the need for a global payroll solution is inevitable.<p>Hiring employees in other countries as an extremely complicated and costly process for companies. In order to hire someone in another country, you would need to setup an entity in that country in order to place them on payroll. There is one other way, which is using an Employer of Record. This is a company that hires the employee for you, taking care of payroll, compliance, benefits and taxes.<p>Companies like Deel and Remote have raised enormous amounts of venture capital, which proves that the market is going to become huge.<p>In December 2020 I started working on Rivermate. Rivermate makes it easy for companies to hire anyone, anywhere. We take care of the entire process for you (payroll, compliance, benefits, taxes). We are a team of three currently (one developer, one copy writer and me). The platform has been built already and we are onboarding clients at this moment. Our platform offers access to both the employer and employee. And we offer adjacent products, such as contractor payments, time off and expense management<p>My goal is to build out this company to become the #1 global payroll provider in Europe.<p>Once I find the right co-founder, I will reach out to investors to get funding. I know many big VC&#x27;s in Europe and can call them when we are ready to get funded.<p>This business has a shot at becoming a HUGE company. The market is hot (look at Deel, Remote, Papaya Global, that focus on the US market) and we can capitalize the European market.<p>What I&#x27;m looking for?<p>There is one thing holding me back from making this a successful company: I have yet to find the right co-founder. I&#x27;m not only looking for a technical co-founder, but also someone who wants to dedicate all of his time on building this company and who is willing to put skin in the game for at least the coming 5 years.<p>Criteria<p>Full stack development experience<p>Technically very strong<p>40+ hours available per week<p>Ready to put skin in the game<p>No payment, only equity until we get to the market<p>Good to have<p>Experience in fast growing startups<p>Entrepreneurial attitude<p>Experience in leading teams<p>Preferably same timezone (CEST)<p>About me<p>Successfully co-founded a startup, grew it to €3M+ yearly revenue and sold the company<p>From The Netherlands<p>Age: 26<p>Language: Dutch and English<p>My skills<p>Business innovation and management (two studies on Business Innovation and Management)<p>Huge network of potential customers<p>Huge network of angel investors and VC firms.<p>Technical and marketing experience<p>Experience in early-stage startups and product management<p>Incredibly hard worker<p>If you are interested email me at lucas@rivermate.com with your LinkedIn and we&#x27;ll schedule a meeting",
      "time": 1650472253,
      "title": "Looking for a tech co founder for fintech startup",
      "type": "story"
    },
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 31099422,
      "score": 2,
      "time": 1650472228,
      "title": "Tripping in LSD's Birthplace: A Story for \"Bicycle Day\"",
      "type": "story",
      "url": "https://blogs.scientificamerican.com/cross-check/tripping-in-lsds-birthplace-a-story-for-e2809cbicycle-daye2809d/"
    },
    {
      "by": "eternalban",
      "descendants": 0,
      "id": 31099395,
      "score": 1,
      "time": 1650472146,
      "title": "ClickHouse Founders: We Stand with Ukraine",
      "type": "story",
      "url": "https://web.archive.org/web/20220407215624/https://clickhouse.com/blog/we-stand-with-ukraine/"
    },
    {
      "by": "thoughtpeddler",
      "descendants": 0,
      "id": 31099389,
      "score": 2,
      "time": 1650472129,
      "title": "Will Internet’s third iteration free our virtual selves from BigTech?",
      "type": "story",
      "url": "https://www.newstatesman.com/science-tech/big-tech/2022/04/will-the-internets-third-iteration-free-our-virtual-selves-from-big-techs-control"
    },
    {
      "by": "jayra",
      "descendants": 1,
      "id": 31099366,
      "kids": [
        31099497
      ],
      "score": 1,
      "time": 1650472014,
      "title": "Show HN: I created a collection of insanely useful websites from around the web",
      "type": "story",
      "url": "https://www.insanelyusefulwebsites.com"
    },
    {
      "by": "vishnugupta",
      "descendants": 1,
      "id": 31099365,
      "kids": [
        31099411
      ],
      "score": 1,
      "time": 1650472003,
      "title": "Netflix loses $45B in value as subscriber numbers drop",
      "type": "story",
      "url": "https://www.cnn.com/2022/04/19/media/netflix-earnings/index.html"
    }
  ]
}