{
  "stories": [
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28112097,
      "score": 1,
      "time": 1628475585,
      "title": "Disentangled Lifespan Face Synthesis",
      "type": "story",
      "url": "https://senhe.github.io/projects/iccv_2021_lifespan_face/"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28112086,
      "score": 1,
      "time": 1628475433,
      "title": "Soil maps help scientists dig up dirt in criminal investigations",
      "type": "story",
      "url": "https://www.sciencemag.org/news/2021/08/soil-maps-help-scientists-dig-dirt-criminal-investigations"
    },
    {
      "by": "arabadzhiev",
      "descendants": 0,
      "id": 28112058,
      "score": 1,
      "time": 1628475225,
      "title": "Supermetrics for Azure Storage",
      "type": "story",
      "url": "https://datastudio.ca/supermetrics/supermetrics-for-azure-storage-step-by-step-guide/"
    },
    {
      "by": "wirshad",
      "descendants": 0,
      "id": 28112032,
      "score": 1,
      "text": "I am Wasim, Founder of Real Life Apps. I have spent the past 3 years building my startup, team and products. Without a doubt, it has been the most difficult journey of my life. Our mission was to make getting things done as simple as sending a snap or a tweet. To make productivity both cool and social. I believe we have realized this goal. I would be grateful if you take our app for a spin and give us your feedback. The app is named Looksee and is completely free.<p>Looksee is an innovative Social Productivity app. The app allows people to get things done through a friendly visual presentation rather than old-fashioned “to-do” lists. As a visual person, I was tired of tedious checklists and text-based tools like Notion, Evernote, Todoist etc. That inspired me to create Looksee which uses the power of visuals (photos or video) to capture any task. Looksee enables the user to manage their own tasks, as well as delegate to others in their social circles<p>Looksee merges two completely different genres of apps, Social Networking and Productivity, into a new breakthrough category of “Social Productivity.”<p>Here is a 1-minute video that explains Looksee:\nhttps:&#x2F;&#x2F;youtube.com&#x2F;watch?v=gfBK9L_woH0<p>Looksee is live on the Apple App Store. Here is a direct link:\nhttps:&#x2F;&#x2F;apps.apple.com&#x2F;us&#x2F;app&#x2F;looksee&#x2F;id1535769409<p>We are a small tech startup based in Austin, Texas. As a founder, I am requesting the community&#x27;s help, advice &amp; feedback!<p>Thank you so much,<p>Dr. Wasim Irshad<p>PhD Electrical &amp; Computer Engineering (Purdue University)<p>CEO &amp; Founder of Real Life Apps (www.reallifeapp.com)",
      "time": 1628474967,
      "title": "Productivity Meets Social-Networking = Looksee",
      "type": "story"
    },
    {
      "by": "Khaine",
      "descendants": 0,
      "id": 28112010,
      "score": 1,
      "time": 1628474744,
      "title": "Backpage.com’s Vicious Battle with the Feds",
      "type": "story",
      "url": "https://www.wired.com/story/inside-backpage-vicious-battle-feds/"
    },
    {
      "by": "neilv",
      "descendants": 0,
      "id": 28111995,
      "score": 1,
      "text": "Constitutional questions of Apple&#x27;s move aside... I don&#x27;t know whether we&#x27;re going to see Swatting-like attacks using this mechanism, nor an activist&#x2F;troll mass attack with it, and I don&#x27;t want to find out firsthand.<p>Looking into US privacy-respecting alternatives to iPhone this weekend, both T-Mobile and Apple are imminently forcing VoLTE.  I&#x27;ve not yet found reputable Android AOSP-derived ROMs or other open source firmware supporting that.  (Also, carriers reportedly will allow&#x2F;deny devices by IMEI model.)  Looks like regulatory authorities are OK with all this.<p>Stock Android installs on devices carriers will permit are more respectful than iPhone in some regards, but are still very heavy on commercial privacy invasion and security vulnerabilities.  They&#x27;ll also probably get abandoned for security updates, etc., and alternative ROMs no longer mitigating that.<p>Librem 5 looks good in principle, but the only Librem 5 on eBay just now was a preproduction one for $700+, and dunno how long Purism will be wrangling carriers.<p>The few featurephones seem to be crap and&#x2F;or include integrations with the most infamous social media services, which is a really bad sign.<p>None of the various Linux phone efforts seem ready even today, and carriers are a moving target.<p>I just spent the weekend trying to move from my iPhone.  (And, when I tried a SIM in a stock Android phone, the carrier suspended my service, taking many hours of misery to get it restored in the iPhone it had been in.)<p><i>How do we keep even a minimal phone number (voice &amp; SMS), without all these privacy&amp;security regressions?</i>  (Practically, and solid, and through at least the 2021-2022 VoLTE switchover, and hopefully years after.  A phone number is still required by some gov&#x27;t and critical services.  Wireless data would be nice, but we currently could survive with WiFi, etc.)",
      "time": 1628474556,
      "title": "Ask HN: Privacy&security-respecting alternatives to iPhone, with VoLTE in mind?",
      "type": "story"
    },
    {
      "by": "8bitsrule",
      "descendants": 0,
      "id": 28111976,
      "score": 1,
      "time": 1628474375,
      "title": "Kevin Kelly: The Case for Optimism",
      "type": "story",
      "url": "https://www.warpnews.org/premium-content/kevin-kelly-the-case-for-optimism/"
    },
    {
      "by": "throwawaysea",
      "descendants": 1,
      "id": 28111971,
      "kids": [
        28112080
      ],
      "score": 2,
      "time": 1628474322,
      "title": "SpaceX launching satellite to display billboard ads in space",
      "type": "story",
      "url": "https://futurism.com/the-byte/spacex-billboard-ads-space"
    },
    {
      "by": "webmaven",
      "descendants": 1,
      "id": 28111962,
      "kids": [
        28111989
      ],
      "score": 1,
      "time": 1628474239,
      "title": "MIT Researchers Devise a Way to Program Memories into Bacteria by Rewriting DNA",
      "type": "story",
      "url": "https://scitechdaily.com/mit-researchers-devised-a-way-to-program-memories-into-bacterial-cells-by-rewriting-their-dna/"
    },
    {
      "by": "rexreed",
      "descendants": 0,
      "id": 28111957,
      "score": 1,
      "time": 1628474197,
      "title": "Amazon Third-Party Sellers Reportedly Hound Customers Who Leave Bad Reviews",
      "type": "story",
      "url": "https://gizmodo.com/heres-how-amazon-third-party-sellers-reportedly-hound-c-1847446648"
    }
  ]
}