{
  "stories": [
    {
      "by": "asimjalis",
      "descendants": 0,
      "id": 28598721,
      "score": 1,
      "time": 1632170475,
      "title": "Synsepalum Dulcificum",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Synsepalum_dulcificum"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 28598717,
      "score": 1,
      "time": 1632170456,
      "title": "Ask HN: Why haven't the vaccines been updated to combat the variants directly?",
      "type": "story"
    },
    {
      "by": "wheybags",
      "descendants": 0,
      "id": 28598705,
      "score": 1,
      "time": 1632170412,
      "title": "Lucasfilm – Composing Digital Images (1984) [pdf]",
      "type": "story",
      "url": "https://graphics.pixar.com/library/Compositing/paper.pdf"
    },
    {
      "by": "creata",
      "descendants": 0,
      "id": 28598691,
      "score": 1,
      "time": 1632170329,
      "title": "The blue-eyed islanders puzzle",
      "type": "story",
      "url": "https://terrytao.wordpress.com/2011/04/07/the-blue-eyed-islanders-puzzle-repost/"
    },
    {
      "by": "davidajackson",
      "descendants": 0,
      "id": 28598673,
      "score": 1,
      "text": "Screenr blocks job spam and hides your email address. It’s perfect for everywhere you used to list your email, like “Who Wants To Be Hired?” You can also add your own custom questions that you want companies to answer upfront. Too often companies avoid giving concrete answers about job offerings or double back on vague promises later. Screenr eliminates this ambiguity — if you want to know what the minimum and maximum salary range is, just add it as a custom question to your Screenr. You can use Screenr on resumes, Hacker News profiles, or anywhere you would otherwise share your email. If you want to add a brief bio and your full name you can do that too. You can use Screenr to fight back against vague LinkedIn messages, or even use it as a first response to cold emails.<p>Try out the product here:\nhttps:&#x2F;&#x2F;www.screenr.app&#x2F;<p>Here’s a sample Screenr profile:\nhttps:&#x2F;&#x2F;www.screenr.app&#x2F;?id=mkcMfL<p>Please try out the product and let me know if there’s anything you’d like added. You don’t even need an account to use the product and making your own Screenr takes less than 60 seconds. Responses to your Screenr’s will get emailed directly to you (small note, I am working on getting SES sending out of sandbox but Amazon is being slow so responses are getting forwarded from a previously production approved email blocktimize.io from a previous side project), I’ll move it over to info@screenr.app once that’s approved but the sending email really doesn’t matter.",
      "time": 1632170223,
      "title": "Show HN: Screenr – Block Recruiter Spam Effortlessly",
      "type": "story"
    },
    {
      "by": "CanyonsFerdy",
      "descendants": 0,
      "id": 28598670,
      "score": 1,
      "text": "My wife and I have some intimate photos. They&#x27;re actually pretty tame, but nothing we&#x27;d want anyone else to see. I&#x27;d rather not store them on any cloud service, anything online has the potential to be public.<p>I tried using a USB flash drive that encrypts itself when unmounted. It has a physical keypad to unencrypt. However when using with an iPhone the photos become corrupt as there is no &quot;unmount&quot; method on the iPhone.<p>Any other ideas?",
      "time": 1632170214,
      "title": "Where do you store private photos",
      "type": "story"
    },
    {
      "by": "mohaknahta",
      "descendants": 1,
      "id": 28598648,
      "kids": [
        28598649
      ],
      "score": 1,
      "time": 1632170139,
      "title": "Apparently, Fb is on the rise again do you use it?",
      "type": "story",
      "url": "https://www.atlys.com/post/travel-post-covid-19-emerging-trends-and-new-realities"
    },
    {
      "by": "andreag11",
      "descendants": 0,
      "id": 28598607,
      "score": 2,
      "time": 1632169905,
      "title": "GitHub Africa",
      "type": "story",
      "url": "https://www.meetup.com/GitHub-Africa/events/280303655/"
    },
    {
      "by": "shubb",
      "descendants": 0,
      "id": 28598576,
      "score": 3,
      "text": "Is anyone aware of a company like this that exists?<p>The problem:\nYou want to hire the best, and sometimes the best person is not willing or able to move to your country. International employment law is very complex.<p>You want to access hires who are not willing to work as independent contractors &#x2F; freelancers, or you want to hire a long term member of staff and would prefer to hire someone who likes to work perm.<p>Solution:\nThis company has virtual offices all over the world, and will hire your perm staffer, or create a company for you to hire them through. They handle the legals, payroll, etc - like an agency, and always use your branding to communicate with the new hire, giving them a direct hire experience.<p>You advertise the role as a direct hire, so the existence of this company is largely transparent to the employee, and hopefully they are contracting with a local branded ltd that was set up for you.<p>Contracts between your company and the hiring company ensure that you are on the hook for any obligations the hiring company has to their employees.<p>Umbrella companies exist, and agencies exist. This is really just an umbrella with a bit of a branding twist and more mutual obligation.",
      "time": 1632169739,
      "title": "Startup Idea: Shared remote hiring umbrella",
      "type": "story"
    },
    {
      "by": "historynops",
      "descendants": 0,
      "id": 28598528,
      "score": 3,
      "time": 1632169548,
      "title": "Reading Code Is a Skill",
      "type": "story",
      "url": "https://trishagee.com/2020/09/07/reading-code-is-a-skill/"
    }
  ]
}