{
  "stories": [
    {
      "by": "notmuffin",
      "descendants": 0,
      "id": 30896661,
      "score": 1,
      "time": 1648991756,
      "title": "Mataroa blog-Naked blogging platform, for minimalists. Just write",
      "type": "story",
      "url": "https://mataroa.blog/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30896639,
      "score": 1,
      "time": 1648991606,
      "title": "Big Mac Index Manipulation",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Big_Mac_Index"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30896604,
      "score": 1,
      "time": 1648991323,
      "title": "Two Best Friends Beat Amazon: First U.S. Warehouse Union",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/02/business/amazon-union-christian-smalls.html"
    },
    {
      "by": "sdevonoes",
      "descendants": 0,
      "id": 30896582,
      "score": 1,
      "time": 1648991160,
      "title": "The Future of Vagrant (2021)",
      "type": "story",
      "url": "https://www.hashicorp.com/resources/the-future-of-vagrant-toward-3-0"
    },
    {
      "by": "Kalanos",
      "descendants": 0,
      "id": 30896576,
      "score": 1,
      "time": 1648991135,
      "title": "Dash is deeper than dashboards; it's fullstack Python",
      "type": "story",
      "url": "https://aiqc.medium.com/dash-is-deeper-than-dashboards-5ab7414f121e"
    },
    {
      "by": "oriettaxx",
      "descendants": 0,
      "id": 30896564,
      "score": 1,
      "text": "My client has been charged for stopped EC2 instances (Ireland).<p>I am the one who assured him he would not have any computing cost (while the volume costs will still run, of course): I am migrating his instances out of AWS, one by one: it takes time, and I left all migrated instances as &#x27;stopped&#x27;, until the migration will be completed.<p>I&#x27;ve been pushing myself to migrate (so to stop) as many instances as possible to have a reduced monthly AWS bill, but my client realized nothing changed.<p>This official doc is pretty clear https:&#x2F;&#x2F;docs.aws.amazon.com&#x2F;AWSEC2&#x2F;latest&#x2F;UserGuide&#x2F;Stop_Start.html but I also see in https:&#x2F;&#x2F;docs.aws.amazon.com&#x2F;AWSEC2&#x2F;latest&#x2F;UserGuide&#x2F;Stop_Start.html a comment stating &quot;I just got a reply from AWS customer support explaining a stopped instance in the same region could cause it be treated as running and hence charged&quot;: this user have been refunded, so I guess we will contact support and ask the same.<p>* Did any of you hit something similar?<p>Since my client had several EC2 in stopped state in the past years, how the hell are we going to be able to check the amount of the overcharge?",
      "time": 1648991071,
      "title": "AWS charged my client for stopped EC2 Instances",
      "type": "story"
    },
    {
      "by": "tomohawk",
      "descendants": 1,
      "id": 30896551,
      "kids": [
        30896565
      ],
      "score": 2,
      "time": 1648991023,
      "title": "Ukraine Situation Report",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/45043/ukraine-situation-report-kyiv-region-now-fully-in-government-control-according-to-defense-official"
    },
    {
      "by": "sideway",
      "descendants": 1,
      "id": 30896512,
      "kids": [
        30896675
      ],
      "score": 1,
      "text": "I am..<p>- 36yo<p>- most probably not depressed<p>- live in a 1st world country<p>- privileged to have a job that pays well<p>- expecting my first child after years of trying<p>..and deeply believe the future will be truly bleak. Even if we somehow manage to not find ourselves in a nuclear holocaust, there is no escape from climate change.<p>I really want to be optimistic, both for me and the people around me, but it&#x27;s hard to see how or why I could start being an optimist.<p>Reading the stoics didn&#x27;t have a significant effect; it felt more like a coping mechanism than a way forward. Moving to an industry that tries to build a future - not a better future, just a future - is quite challenging without a meaningful background in hard sciences. &quot;Think globally, act locally&quot; is a dogma I&#x27;ve been following since forever but it feels insufficient when it comes to some of the great challenges we are going to face soon.<p>Help me and others like me see the world with different eyes.",
      "time": 1648990689,
      "title": "Ask HN: How can I start thinking optimistically?",
      "type": "story"
    },
    {
      "by": "epimetheus3",
      "descendants": 0,
      "id": 30896493,
      "score": 1,
      "text": "I&#x27;d like to find out where and how I spent time precisely, is there some software that would monitor myself precisely? How much time in which window and tab and VSCode etc. is spent? I&#x27;m on Ubuntu, I&#x27;d be willing to pay for it.",
      "time": 1648990484,
      "title": "Ask HN: Improving my productivity – how to monitor my usage of apps and browser",
      "type": "story"
    },
    {
      "by": "lifeisstillgood",
      "descendants": 0,
      "id": 30896471,
      "score": 1,
      "time": 1648990352,
      "title": "Information Wants to Be Free",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Information_wants_to_be_free"
    }
  ]
}