{
  "stories": [
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 28786745,
      "score": 1,
      "time": 1633617051,
      "title": "Gitlab user profiles have just become more personal",
      "type": "story",
      "url": "https://about.gitlab.com/blog/2021/09/30/personal-profile/"
    },
    {
      "by": "gbseventeen3331",
      "descendants": 0,
      "id": 28786743,
      "score": 1,
      "time": 1633617048,
      "title": "Police influencers pushing a controversial anti-fraud app go viral in China",
      "type": "story",
      "url": "https://restofworld.org/2021/why-viral-police-influencers-are-promoting-an-anti-fraud-app-in-china/"
    },
    {
      "by": "hihat",
      "descendants": 0,
      "id": 28786725,
      "score": 1,
      "time": 1633616972,
      "title": "The New Kaleidoscope",
      "type": "story",
      "url": "https://blog.kaleidoscope.app/2021/10/07/meet-the-new-kaleidoscope/"
    },
    {
      "by": "ecliptik",
      "descendants": 0,
      "id": 28786714,
      "score": 1,
      "time": 1633616933,
      "title": "Hacking ZX Spectrum Games Like It's 1989",
      "type": "story",
      "url": "https://thedorkweb.substack.com/p/hacking-zx-spectrum-games"
    },
    {
      "by": "hartserver",
      "descendants": 0,
      "id": 28786708,
      "score": 1,
      "time": 1633616918,
      "title": "We've just lowered our cloud hosting prices – come join us",
      "type": "story",
      "url": "https://hartserver.net/"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 28786693,
      "score": 1,
      "time": 1633616879,
      "title": "Mathematicians Prove Melting Ice Stays Smooth",
      "type": "story",
      "url": "https://www.quantamagazine.org/mathematicians-prove-melting-ice-stays-smooth-20211006/"
    },
    {
      "by": "harporoeder",
      "descendants": 0,
      "id": 28786674,
      "score": 2,
      "time": 1633616771,
      "title": "NUMA Siloing in the FreeBSD Network Stack [pdf]",
      "type": "story",
      "url": "https://2019.eurobsdcon.org/slides/NUMA%20Optimizations%20in%20the%20FreeBSD%20Network%20Stack%20-%20Drew%20Gallatin.pdf"
    },
    {
      "by": "Frajedo",
      "descendants": 0,
      "id": 28786673,
      "score": 1,
      "text": "I am getting in touch with you in order to retrieve some feedback on the security aspect of a project that I have released. The objective of this question is to challenge the concept of the project and eventually retrieve constructive improvement tips you might see appropriate. The project is named GetMyMfa.io (https:&#x2F;&#x2F;get.mymfa.io) and it aims to provide Just-In-Time and nominative access to virtual phone numbers SMS MFA codes for testing and approval processes for organizations.\nWhere the idea came from:<p>I am currently working with multiple customers in the FSI domain (Financial Services Industry) and I am often required to perform tests in production environments with multiple accounts with different attributes. As production accounts, these accounts are generally required to have at least an SMS 2FA system in place. When performing tests in such sensitive accounts, a single individual usually owns all phone numbers linked to these accounts and shares received MFA codes via a phone call with the various people performing tests in these accounts. I believe this represents a security concern and a bypass of the Multi-Factor Authentication principles.<p>In addition, when submitting iOS applications to the App Store, Apple performs a human review process in which they need to login to the application. When MFA is enforced for all production accounts, Apple rejects the application unless a way is implemented to allow them to login. This often leaves developers with two options: Develop a front-end only demonstration mode, or bypass the MFA mechanism for a specific account.<p>Therefore, the project aims to:<p>Allow organizations to rent virtual phone numbers and have their SMS MFA codes be displayed in a private web interface; Organizations have a fine-grained access control system that allows them to control who can access their virtual phone numbers MFA Codes; Access granting can be time-based.<p>With this project, I aim to help businesses to:<p>Avoid spending time in building a security login &quot;bypass&quot; (and all the security issues that often come with it); Avoid building a &quot;demonstration&quot; mode exclusively for Apple on their mobile applications; Avoid using public websites with public phone numbers accessible to anyone. What do you think? Would you use such product for your business in order to safely manage SMS Multi-Factor-Authentication sharing in production accounts? If not, what would be your recomendations?<p>Thank you very much in advance!",
      "time": 1633616754,
      "title": "Ask HN: Cybersecurity-wise, what do you think of an MFA-sharing application?",
      "type": "story"
    },
    {
      "by": "harporoeder",
      "descendants": 0,
      "id": 28786643,
      "score": 1,
      "time": 1633616630,
      "title": "Dear Privacy Aware Android App Devs – Please Use UnifiedPush",
      "type": "story",
      "url": "https://www.andrewjvpowell.com/articles/dear-privacy-aware-android-app-devs-please-use-unifiedpush/"
    },
    {
      "by": "throwoutway",
      "descendants": 0,
      "id": 28786610,
      "score": 1,
      "time": 1633616482,
      "title": "CircuitMaker – Free PCB Design Software",
      "type": "story",
      "url": "https://circuitmaker.com/#download"
    }
  ]
}