{
  "stories": [
    {
      "by": "herodoturtle",
      "descendants": 0,
      "id": 31535474,
      "score": 1,
      "text": "For example, if I made $10m, I&#x27;d take a break from full time work to prioritise hanging out with my loved ones, whilst experimenting with ideas and exploring nature.",
      "time": 1653689219,
      "title": "Ask HN: What Is Your Number?",
      "type": "story"
    },
    {
      "by": "biancagus",
      "descendants": 0,
      "id": 31535471,
      "score": 1,
      "time": 1653689190,
      "title": "When the Best Available Home Is the One You Already Have",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/27/upshot/housing-market-slow-moving.html"
    },
    {
      "by": "version_five",
      "descendants": 0,
      "id": 31535418,
      "score": 1,
      "time": 1653688782,
      "title": "A Baseball Non-Fight Illustrates Our Weird Journalistic Discourse on Racism",
      "type": "story",
      "url": "https://reason.com/2022/05/27/how-a-baseball-non-fight-illustrates-our-weird-journalistic-discourse-on-racism/"
    },
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 31535397,
      "score": 2,
      "time": 1653688680,
      "title": "CLASH: CLisp As SHell",
      "type": "story",
      "url": "https://clisp.sourceforge.io/clash.html"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 31535383,
      "score": 1,
      "time": 1653688529,
      "title": "Lessons from Deploying Deep Learning to Production",
      "type": "story",
      "url": "https://thegradient.pub/lessons-from-deploying-deep-learning-to-production/"
    },
    {
      "by": "dontbenebby",
      "descendants": 1,
      "id": 31535362,
      "kids": [
        31535420,
        31535416
      ],
      "score": 1,
      "text": "Or, to give a longer, more descriptive question:<p>How do I, for lack of better phrasing, &quot;retire from antifa&quot; and move on to a more typical 9-5 when folks seem to WANT to exhaust me then punish me for my response any time I make a decision they don&#x27;t like, and &quot;they&quot; are often feel like some of the the worst people on the planet?<p>For context, I&#x27;m on the autistic spectrum, and like a lot of folks, I spent my 20s bouncing from job to job, often leaving employers under a cloud.<p>Throughout this time, I focused on censorship circumvention, because I became trapped in a police riot in my hometown shortly after leaving K12, after having felt unsafe pretty much my entire life leading up to that moment.<p>Allegedly, I lead (and continue to lead) a privileged life.<p>But in therapy, when I finally found someone skilled and empathetic, I was told on top of the autistic spectrum disorder (it had just shifted in the DSM-V), I had a set of symptoms that could be C-PTSD or generalized anxiety disorder).<p>(And that the C in CPTSD was because rather the being an entitled white male, I was someone who&#x27;d suffered not one, but multiple severe traumas -- just none of them fit the typical buckets we slot victims into.)<p>I went to therapy, I was told I was perfectly within my rights to lead a secular life, and that is what I am attempting to do today, and every day. I went to confession as well, and they confirmed my interpretation of Luke 20:20-26 was correct before absolving me of my sins:<p>&gt;Luke 20:20-26: So they watched him and sent spies who pretended to be honest, in order to trap him by what he said and then to hand him over to the jurisdiction and authority of the governor.[1][2]<p>Growing up with this so called &quot;privilege&quot; in America meant growing up knowing that one day you will &quot;go to a protest&quot; and it will not be at all performative... it&#x27;ll be a signal you, the chicken fingers loving autist who may have single-handedly inspired the &quot;Sir, this is  a [restaurant name]&quot; meme think that literal totalitarians about to Start Shooting, and he&#x27;s got a friend of a friend who stood next to a tank at the fall of the USSR, so when given the A&#x2F;B test of &quot;go big or go home&quot;... he went left.<p>I very purposefully used that privilege to get people internships, professorships, tenure, with the hope someone would look at what I&#x27;ve done, what I know, and connect me with something other than some temporary soft money position where I lift up everyone around me then move on to the next precarious thing.<p>If anyone has any advice on life, the universe, or whatever... I did a lot of research on places to move, jobs I could, all that good stuff, but anytime I talk about renting folks want W2 income, and I can&#x27;t seem to find a full time job.<p>(This is a pseudonym, but I put my email in my bio)<p>If anyone has any advice, I feel pretty lost.<p>It feels like folks have this kind of... schoolteacher mentality that if they follow all the guidelines when I&#x27;m around, they can ride out the year and hand me off.<p>It&#x27;s distressing and causes me to act out. It makes me feel like no matter what I learn, no matter how hard I work, folks will refuse to make good decisions, even when they know it may cause someone with my diagnoses (autistc spectrum, CPTSD, generalized anxiety disorder) to act out. Like the world is one big Stanford Prison Experiment, and I&#x27;m forever the prisoner.<p>How do I move on? What do I do next?<p>Despite the tone, I cannot emphasize enough that I am asking sincerely for help and advice.<p>[1]Luke only mentions &quot;&quot;spies&quot; sent by &quot;teachers of the law and the chief priests&quot;, not anything specific like  Pharisees or Herodians\n[2] This PDF is a primary source discussing the concept of the nuclear family: http:&#x2F;&#x2F;www.chrisknight.co.uk&#x2F;wp-content&#x2F;uploads&#x2F;2007&#x2F;09&#x2F;Early-Human-Kinship-Was-Matrilineal.pdf\n[3] I&#x27;m... uh... &quot;culturally Catholic&quot;. It&#x27;s hard to explain to folks who haven&#x27;t been through the altar server training.",
      "time": 1653688385,
      "title": "Ask HN: Learned coding, primaried my enemies, got better laws passed. Now what?",
      "type": "story"
    },
    {
      "by": "lukeplato",
      "descendants": 0,
      "id": 31535343,
      "score": 1,
      "time": 1653688160,
      "title": "Unpublished proof four color theorem",
      "type": "story",
      "url": "https://twitter.com/neil_calkin/status/1530288990431195136"
    },
    {
      "by": "nickcw",
      "descendants": 0,
      "id": 31535313,
      "score": 2,
      "time": 1653687984,
      "title": "Hacking Ham Radio: WinAPRS",
      "type": "story",
      "url": "https://www.coalfire.com/the-coalfire-blog/hacking-ham-radio-winaprs-part1"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31535297,
      "score": 1,
      "time": 1653687911,
      "title": "IndyCar is moving to 100% renewable ethanol in 2023",
      "type": "story",
      "url": "https://arstechnica.com/cars/2022/05/indycar-is-moving-to-100-renewable-ethanol-in-2023/"
    },
    {
      "by": "sraffa",
      "descendants": 0,
      "id": 31535286,
      "score": 1,
      "time": 1653687855,
      "title": "On Hiring: Seven Principles (Version 1.0)",
      "type": "story",
      "url": "https://medium.com/@rafr/on-hiring-seven-principles-version-1-0-4d31b739322f"
    }
  ]
}