{
  "stories": [
    {
      "by": "nimbius",
      "descendants": 0,
      "id": 31265196,
      "score": 1,
      "time": 1651694987,
      "title": "The Fed raises interest rates by the most in over 20 years to fight inflation",
      "type": "story",
      "url": "https://www.npr.org/2022/05/04/1096111642/federal-reserve-interest-rates-inflation-prices"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 31265193,
      "score": 1,
      "time": 1651694979,
      "title": "Public Comments on the California Math Framework",
      "type": "story",
      "url": "https://sites.google.com/view/publiccommentsonthecmf/#h.ns5n6hdqa4x8"
    },
    {
      "by": "afrcnc",
      "descendants": 0,
      "id": 31265163,
      "score": 1,
      "time": 1651694860,
      "title": "Shady Economics of Proxy Services",
      "type": "story",
      "url": "https://rushter.com/blog/proxy-services/"
    },
    {
      "by": "sharkweek",
      "descendants": 0,
      "id": 31265122,
      "score": 1,
      "time": 1651694643,
      "title": "Check-Out Donations Aren't a Scam",
      "type": "story",
      "url": "https://lifehacker.com/check-out-donations-arent-a-scam-actually-1846432598"
    },
    {
      "by": "harambae",
      "descendants": 0,
      "id": 31265094,
      "score": 3,
      "time": 1651694474,
      "title": "Living in a Stranger's Abandoned House Might Be Your Best Rental Option",
      "type": "story",
      "url": "https://www.vice.com/en/article/88gya5/living-in-a-strangers-abandoned-house-might-be-your-best-rental-option"
    },
    {
      "by": "mooreds",
      "descendants": 1,
      "id": 31265089,
      "kids": [
        31265127
      ],
      "score": 1,
      "time": 1651694462,
      "title": "I don't give party favors at my kid's bday. I wish more parents would join me",
      "type": "story",
      "url": "https://www.insider.com/i-dont-give-out-party-favors-at-my-kids-birthday-2022-5"
    },
    {
      "by": "sumanmd",
      "descendants": 1,
      "id": 31265086,
      "kids": [
        31265087
      ],
      "score": 1,
      "time": 1651694458,
      "title": "Science of Fasting",
      "type": "story",
      "url": "https://spyderdoc.substack.com/p/doctors-heart-series-part-6-science"
    },
    {
      "by": "scottc",
      "descendants": 0,
      "id": 31265082,
      "score": 1,
      "text": "The last 3 years, I’ve been selling SaaS and digital courses on my website<p>And while it’s very fun and freeing, I’ve always dreaded the moment when I had to plop down own the used office chair my old boss gave me and bust out the sales copy for my products. Back then, switching from “product creation mode” to “copywriter mode” was more difficult than that 2,000-piece jigsaw puzzle I did last weekend with my grandma<p>Sitting in front of a blank google docs screen, I would start writing the sales copy for sales pages, email blasts, etc., and it would just take me days before I could get in the swing of writing good copy and truly hum along. Days I could not really afford to lose.<p>I’ve tried to learn as much as I could about writing good sales copy. I read books, took courses, watched videos, but when it came time to putting together my own sales page, and putting the right words into place, I would just spin my wheels. You can learn all the techniques and best practices, but figuring out <i>how to apply it to your stuff in the right order on your website</i> is a skill in its own right.<p>I have worked with professional copywriters and freelancers for help on improving my landing pages, and they have always been downright impressive. But sometimes, my products are not 100% complete or validated yet, and I’m simply just testing the waters—so it wouldn’t make sense to hire a pro yet.<p>I always had the itch to make some kind of tool that aids hackers in copywriting. It wouldn’t generate my entire landing page with AI or anything too fancy. But it swiftly would guide me along so that I could mindlessly plug-and-play the right copy in the right place on my sales page, resulting in higher conversions and ultimately, more sales.<p>So I decided, eff it, I will make a tool that does exactly this. I have created what is essentially a gsheet where I plug in the value prop, benefits, customer problems, features, urgency &amp; scarcity, etc. into my gsheet and then multiple visual landing page variants are created for me.<p>I still have to fill in some of the gaps, but 80% of the page is &quot;organized&quot; for me in a visual hierarchy based on my inputs. I mostly took advice from CROs and copywriters and tried to make a tool so that I didn&#x27;t have to re-read the how-to&#x27;s on copywriting.<p>*I want to know which parts of copywriting are hardest for you.* I would be so grateful to get your opinion here in this short 9-question survey! https:&#x2F;&#x2F;forms.gle&#x2F;S2ewFBybpL4ndWdy8<p>I think HN&#x27;s got some awesome hackers and founders in here that might be able to relate to my story and just wanted to get some honest feedback about the clarity of the value proposition and whether this is a tool that you&#x27;d use or not.",
      "time": 1651694443,
      "title": "Ask HN: What do you think of my landing page copywriting tool idea?",
      "type": "story"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31265080,
      "score": 1,
      "time": 1651694440,
      "title": "Working in Public",
      "type": "story",
      "url": "https://blueskyweb.xyz/blog/5-4-2022-working-in-public"
    },
    {
      "by": "sanj",
      "descendants": 0,
      "id": 31265072,
      "score": 1,
      "time": 1651694395,
      "title": "Google Overhauls Perf",
      "type": "story",
      "url": "https://stocks.apple.com/A0Ci8sks_QT-MDxRx_RbfPQ"
    }
  ]
}