{
  "stories": [
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28757642,
      "score": 1,
      "time": 1633430630,
      "title": "How Complex Wholes Emerge from Simple Parts (2018)",
      "type": "story",
      "url": "https://www.quantamagazine.org/emergence-how-complex-wholes-emerge-from-simple-parts-20181220/"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 28757638,
      "score": 1,
      "time": 1633430618,
      "title": "'Carthago delenda est'",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Carthago_delenda_est"
    },
    {
      "by": "letsdoreviews",
      "descendants": 1,
      "id": 28757609,
      "kids": [
        28757626
      ],
      "score": 1,
      "text": "11 Best iPhone 13-Pro-Max-Mini Accessories\nhttps:&#x2F;&#x2F;letsdoreviews.com&#x2F;11-best-iphone-13-pro-max-mini-accessories&#x2F;",
      "time": 1633430426,
      "title": "Best iPhone 13-Pro-Max-Mini Accessories",
      "type": "story"
    },
    {
      "by": "Jugurtha",
      "descendants": 0,
      "id": 28757596,
      "score": 1,
      "time": 1633430343,
      "title": "I just bought my first billboard in front of Apple's headquarters",
      "type": "story",
      "url": "https://twitter.com/levelsio/status/1401649846117830659"
    },
    {
      "by": "gadmm",
      "descendants": 0,
      "id": 28757594,
      "score": 1,
      "time": 1633430337,
      "title": "Does the Bronze GC Make Rust Easier to Use? A Controlled Experiment",
      "type": "story",
      "url": "https://arxiv.org/abs/2110.01098"
    },
    {
      "by": "kr1m",
      "descendants": 0,
      "id": 28757587,
      "score": 1,
      "time": 1633430290,
      "title": "2021 Nobel Prize in Physics",
      "type": "story",
      "url": "https://www.nobelprize.org/prizes/physics/"
    },
    {
      "by": "Borkdude",
      "descendants": 0,
      "id": 28757556,
      "score": 1,
      "time": 1633430049,
      "title": "Interactive CLJS REPL browser testing with nbb, VS Code and puppeteer",
      "type": "story",
      "url": "https://www.reddit.com/r/Clojure/comments/q13kio/instant_browser_testing_from_calva_with_nbb_and/"
    },
    {
      "by": "p2hari",
      "descendants": 0,
      "id": 28757551,
      "score": 1,
      "text": "Dear HN,<p>We are a startup based in Denmark and have been operating in the space similar to &#x27;NextDoor&#x27;. In fact we consider them as our biggest and important competitor.\nWe have been in operation for close to 4 years now. The first two years we had our MVP tested in the market and then we had good feedback and had paying users. Our revenues grew from approx.. 20k USD to approx. 50k USD over the first two years. One thing that helped increase the revenue was, we were on Danish reality TV show which is similar to &#x27;Shark Tank&#x27; and we got funding from 2 investors for a very low valuation. We were excited and took it which we think was wrong as we were early and lost good equity.<p>Then COVID hit us. However we did not think it will affect us since we had good interest in the platform and started building a new web facing product and added features by outsourcing dev to increase roll out speeds.\nAlso we had an annual pricing strategy which is costing us on support. We have lot of tech debt and bugs in the product and needs to be addressed. The customers are still showing interest and asking to be on platform. But we cannot scale since we are cash crunched and revenues are down to year 1 numbers. \nWe are a small team of 3 founders and the have been working on this with very less to no salary for few years now.<p>We also have a good advisory board but less said of that the better.<p>Some suggestions we got is to join an accelerator program. I have already been in one of the top programs in EU and feel we are little ahead and might not be right fit. Second is to raise money from crowd funding platforms. But we do not have real expertise to do this nor importantly have something to give back of value.<p>I am trying to raise funds, and getting some interests but only if there are other investors. So, getting a group of them excited on the mission is what is challenging. We have learnt a lot very quickly and adapting to these hard times also but still having a challenge to raise funds.<p>Looking for suggestions and advice. Thanks.",
      "time": 1633429992,
      "title": "Ask HN: How to raise money when the revenues are down but the product is liked?",
      "type": "story"
    },
    {
      "by": "wslh",
      "descendants": 0,
      "id": 28757537,
      "score": 1,
      "time": 1633429857,
      "title": "Modern Payment Schemes in Brazil with Neutral QRs",
      "type": "story",
      "url": "https://www.bcb.gov.br/en/financialstability/paymentschemes"
    },
    {
      "by": "shounak594",
      "descendants": 0,
      "id": 28757531,
      "score": 1,
      "time": 1633429815,
      "title": "Seven Biggest landing page mistakes to avoid for your SaaS business",
      "type": "story",
      "url": "https://www.marketcurve.org/essays/7-biggest-landing-page-mistakes-to-avoid"
    }
  ]
}