{
  "stories": [
    {
      "by": "wheelerof4te",
      "descendants": 0,
      "id": 29360137,
      "score": 1,
      "text": "Modern Python versions (3.6+) have a memory performance optimization for dictionaries, where dict keys are shared between various class instances.<p>I am asking if plain Python&#x27;s dictionaries have the same optimization?<p>Given the two dicts with shared keys:\nd1 = {&quot;name&quot;: &quot;Havoc&quot;, &quot;hand&quot;: &quot;left&quot;}\nd2 = {&quot;name&quot;: &quot;Malice&quot;, &quot;hand&quot;: &quot;right&quot;}<p>Are &quot;name&quot; and &quot;hand&quot; shared between these two or does each one have a separate key inside Python&#x27;s memory pool?",
      "time": 1638021161,
      "title": "Ask HN: Is Python's dict key-sharing exclusive to class instance variables?",
      "type": "story"
    },
    {
      "by": "microphp",
      "descendants": 0,
      "id": 29360122,
      "score": 2,
      "time": 1638020988,
      "title": "DDoS Stress Test for Sites",
      "type": "story",
      "url": "https://ddosattack.online/"
    },
    {
      "by": "man-next-door",
      "descendants": 0,
      "id": 29360119,
      "score": 3,
      "text": "I&#x27;ve been working in software engineering for 18 years. I worked mostly as individual contributor  (now as a Senior Staff Engineer), also I was an Engineering Manager for couple years. Now I am interviewing after a few years at the company, and I am hit by harsh reality. For the context, I am in Europe, not in the US.<p>I like technologies and programming, I want to further improve my skills in designing and developing reliable and maintainable distributed system, make better technical decisions. Also, I want to keep learning and playing with new techs. I am now interviewing for the roles like Staff &#x2F; Principal Engineer, My expectations for the roles like  Staff &#x2F; Principal Engineer are that while staying hands-on, say for 30%, I will primarily use more my skills in architecture, engineering, and communications to focus on large, important pieces of functionality, technical decisions with big impact, etc. I expect that I would report to a Director or VP level manager, so that I could be exposed to a big picture, collaborate with and learn from a professional who operated on strategic level.<p>In reality, I am now interviewing for Staff &#x2F; Principal roles and see a few problems that make me rethink my carrier plans. First, the definion for the most of those positions looks Senior Engineers with a few more years of experience: so you are limited to the scope of a single team scope, report to an Engineering manager, just be a worker at a feature conveyor, just be faster, mentor young workers, maybe get some devops skill. I feel limited in impact in such roles, my borders and carrier are defined by Engineer Managers, who are usually less experienced in engineering and leadership topics than I am. The work is also very repetitive, there is not much meaningful progression, next level. I think those titles are created to cover problems caused by diluted Senior titles: an illusional career progression candy for ICs with some salary increase.<p>I saw a few Staff &#x2F; Principal roles that put a very high bar on technical expertise, when only 3-4 percent of all the engineers have such levels, and again usually limited to a lot of coding and a single team scope. They usually have long exhaustive interview process.<p>An important problem with Staff+ IC roles is that there is a low salary limit as well, and you will face much more competition for top roles. Mostly salaries top at the level of a director of engineering. It is typical for a company to have 10 directors, but only 1-2 IC with a similar compensation.<p>I want to work hard, and see meaningful progression: in salary, in impact, in respect.<p>I would like to ask for advice. I believe there are qute a lot 35+ engineers here that faced similar problems and made some decisions for their careers. Now I think to plan switching to a EM track or to Technical Product management. Thank you!",
      "time": 1638020928,
      "title": "Software Engineer hitting 40: what's next?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 29360100,
      "score": 2,
      "time": 1638020718,
      "title": "Germany’s current Covid-19 crisis is mainly driven by the unvaccinated",
      "type": "story",
      "url": "https://rocs.hu-berlin.de/news/role_of_vaccinated/"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 29360078,
      "score": 2,
      "time": 1638020558,
      "title": "Improving overconstrained Rust library APIs",
      "type": "story",
      "url": "https://blog.logrocket.com/improving-overconstrained-rust-library-apis/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 29360065,
      "score": 2,
      "time": 1638020454,
      "title": "‘Casablanca’ Review: 1942 Movie",
      "type": "story",
      "url": "https://www.hollywoodreporter.com/news/general-news/casablanca-review-1942-movie-752498/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29360047,
      "score": 2,
      "time": 1638020293,
      "title": "Bison in Canada Discover Ancient Petroglyphs, Fulfilling an Indigenous Prophecy",
      "type": "story",
      "url": "https://www.smithsonianmag.com/history/bison-in-canada-discover-ancient-petroglyphs-fulfilling-an-indigenous-prophecy-180979119/"
    },
    {
      "by": "arkj",
      "descendants": 1,
      "id": 29360006,
      "kids": [
        29360107
      ],
      "score": 3,
      "time": 1638019796,
      "title": "How I Made My Own iPhone [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=leFuF-zoVzA"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 29360004,
      "score": 2,
      "time": 1638019785,
      "title": "IDEs and Macros",
      "type": "story",
      "url": "https://rust-analyzer.github.io//blog/2021/11/21/ides-and-macros.html"
    },
    {
      "by": "Clockface12",
      "descendants": 1,
      "id": 29360001,
      "kids": [
        29360035
      ],
      "score": 2,
      "time": 1638019766,
      "title": "What Does It Mean to ‘Yassify’ Anything?",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/24/style/yassify-bot-meme.html"
    }
  ]
}