{
  "stories": [
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 30185500,
      "score": 1,
      "time": 1643843260,
      "title": "Complementary Efforts on Anomalous Health Incidents",
      "type": "story",
      "url": "https://www.dni.gov/index.php/newsroom/reports-publications/reports-publications-2022/item/2273-complementary-efforts-on-anomalous-health-incidents"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 30185484,
      "kids": [
        30185491,
        30185487
      ],
      "score": 2,
      "time": 1643843178,
      "title": "Filing Taxes Could Be Free and Simple. But H&R Block and Intuit Lobby Against It (2017)",
      "type": "story",
      "url": "https://www.propublica.org/article/filing-taxes-could-be-free-simple-hr-block-intuit-lobbying-against-it#"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30185477,
      "score": 2,
      "time": 1643843134,
      "title": "Notorious YouTube Streamer Stole $500k from Fans in Crypto Scheme",
      "type": "story",
      "url": "https://kotaku.com/youtube-twitch-streamer-ice-poseidon-stole-money-crypto-1848463229"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 30185467,
      "score": 1,
      "time": 1643843077,
      "title": "Y Combinator: Successful Founders Are OK with Rejection [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zB_SkaERWZY"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 30185452,
      "score": 1,
      "time": 1643843009,
      "title": "Trough of Inefficiency",
      "type": "story",
      "url": "https://seths.blog/2022/02/the-trough-of-inefficiency/"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 30185447,
      "score": 1,
      "time": 1643842982,
      "title": "“Tell me about yourself” but not boring",
      "type": "story",
      "url": "https://www.productlessons.xyz//article/answer-tell-me-about-yourself-framework-examples"
    },
    {
      "by": "jedwhite",
      "descendants": 0,
      "id": 30185439,
      "score": 2,
      "time": 1643842967,
      "title": "Volcanoes, plague, famine and endless winter: 536, the 'worst year to be alive'",
      "type": "story",
      "url": "https://theconversation.com/volcanoes-plague-famine-and-endless-winter-welcome-to-536-what-historians-and-scientists-believe-was-the-worst-year-to-be-alive-175654"
    },
    {
      "by": "pettycashstash2",
      "descendants": 0,
      "id": 30185395,
      "score": 1,
      "text": "My wife’s trusty Honda Pilot from 2006 died at the shopping center.   She called in panic, and I rushed to the scene, switching cars so she could pick our children up from school.<p>I called for a tow, had it jumpstarted and soon was on my way.   Three miles later it came to a halt.  Another call to the tow service, this time had to have it hauled 2 miles on a flatbed.   After some troubleshooting, I identified the alternator as the culprit.  Some more troubleshooting, and it turned out that the battery was at the end of its life.  The Honda had been very reliable so far, but it was time for a new car.<p>We felt comfortable enough to visit dealerships.  We started our search with the current year Pilot.  We started our search in the summer knowing that it was a question of time when the car would start to be unreliable.  Visiting one of the dealerships close to us we test drove trims and finalized what we wanted.  We were not picky when it came to options, but with growing teenagers the back seats needed to be captain’s chairs and not bench and a little more leg room.  It was early summer and we needed to bring the kiddos to sit and measure the 2nd row.  We received the pricing and happily were on our way.  Several weeks later, we called the same dealership and set up an appointment with the salesperson to fit the kids.  We arrived earlier than anticipated due to favorable traffic, and our salesperson had not arrived for his shift yet.  We were greeted by one of the dealer managers, and test drove the preferred trim.   Our salesperson had not arrived yet, and the manager indicated for us to sit with financing to close the deal.<p>We had actually decided on the trim and preferred colors and were ready to purchase.  This is when one of the managers approached and gave us a quote.  When we inquired about pricing differential from what we were given previously, our character and integrity were questioned in front of my children.  When it became evident, we had documentation, the individual in question then proceeded to throw the staff under the bus, in turn calling them liars.  I watched as most of the staff in the showroom actually look at the floor.     This was the moment I knew that I can’t trust this individual.   This person clearly did not have my family’s best interest and customer experience in mind.<p>Suddenly a pleasant buying experience turned into an episode of twilight zone.<p>My wife and I looked at each other and with determination called the manager on his verbal assault with all his staff present.  As we were leaving, we ran into the salesperson, who unfortunately lost a definitive sale.<p>I called Honda Corporate to complain.  To my surprise Honda corporate had zero power over dealership pricing.  The COVID driven market conditions, combined with chip shortage changed the car buying experience within a two-to-three-week period, with prices soaring.<p>We ended up purchasing a 2021 Chevy Traverse, but that’s a separate experience, and another story, with its own twists and turns.<p>Anyone have a similar experience?",
      "time": 1643842754,
      "title": "Car Buying – Covid Edition",
      "type": "story"
    },
    {
      "by": "danbolt",
      "descendants": 0,
      "id": 30185369,
      "score": 1,
      "time": 1643842649,
      "title": "Interview with Former Square Enix Translator Tom Slattery",
      "type": "story",
      "url": "https://archive.rpgamer.com/features/insidegaming/tslatteryint.html"
    },
    {
      "by": "thibaut_barrere",
      "descendants": 0,
      "id": 30185353,
      "score": 2,
      "time": 1643842603,
      "title": "Docker makes comeback with over $50M in ARR two years into restructuring",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/01/docker-makes-comeback-reaching-over-50m-in-arr/"
    }
  ]
}