{
  "stories": [
    {
      "by": "theslurmmustflo",
      "descendants": 0,
      "id": 28830253,
      "score": 1,
      "time": 1633970696,
      "title": "From designing interfaces to designing systems",
      "type": "story",
      "url": "https://thehistoryoftheweb.com/from-designing-interfaces-to-designing-systems/"
    },
    {
      "by": "aiNohY6g",
      "descendants": 0,
      "id": 28830243,
      "score": 1,
      "time": 1633970604,
      "title": "FugueSQL: SQL-ish for pandas, dask, spark",
      "type": "story",
      "url": "https://fugue-tutorials.readthedocs.io/en/latest/tutorials/fugue_sql/index.html"
    },
    {
      "by": "n0000d3js",
      "descendants": 0,
      "id": 28830236,
      "score": 1,
      "text": "After seeing Ashley&#x27;s viral tweet yesterday claiming she was suspended and fired in retaliation, I read through her entire Twitter feed and found she is misrepresenting what occurred and libeling Apple.<p>I am not an Apple employee, nor an Apple fanboy.<p>I stand strongly with Frances Haugen, Ifeoma Ozoma, Timnit Gebru, Cher Scarlett, and other whistleblowers against the evil corporate tech giants.<p>Whatever may have actually happened to Ashley is destroyed entirely by her lies. I believe she is only trying to jumpstart her law career and make money.<p>Ashley posted a screenshot of this email from July 27, 2021, to prove that she did not request paid leave. In it, it shows she asks for a paid exit through the remainder of her law education, at which time she planned to leave Apple (Dec 31, 2022), or alternatively, to be placed in a temporary role within the company, without having to actually apply for the role. In return, they suggested she apply for Medical Leave, which would continue to pay her full salary while mitigating the toxic work environment (physically and emotionally, by her own account).<p>https:&#x2F;&#x2F;pbs.twimg.com&#x2F;media&#x2F;E-YWLeEUYAEgHWb?format=jpg&amp;name=large<p>She declined Medical Leave and asked instead for Paid Administrative Leave and they accommodated that request, as she is quoted in this article, \n&quot;I asked them to mitigate the hostile work environment while they investigate, and they initially offered me EAP therapy and medical leave. I told them that made no sense, and said they should talk to my leadership and set up oversight and boundaries. I added that if there was no other option they could give me paid administrative leave.&quot; (https:&#x2F;&#x2F;www.theverge.com&#x2F;2021&#x2F;8&#x2F;4&#x2F;22610112&#x2F;apple-female-engineering-manager-leave-sexism-work-environment)<p>After she went on leave, and immediately claimed it was forced on her, she tweeted the correspondence from HR expressing that if she did not want to be on leave, she was free to return at any time.<p>https:&#x2F;&#x2F;pbs.twimg.com&#x2F;media&#x2F;E-mP2FkVkAU29LE?format=jpg&amp;name=large<p>For her claim of being fired in retaliation, this article discusses an unreleased product.<p>https:&#x2F;&#x2F;www.theverge.com&#x2F;22648265&#x2F;apple-employee-privacy-icloud-id<p>The video in the article is her, which she further cross-posted to her Twitter account, and from reading about the application, could only have come from her.<p>I feel sorry for her, given the harassment she may have endured over the prior 6 years, but I don&#x27;t understand why she felt the need to lie about what has happened in the past few months, as it completely destroys her credibility, and likely puts her in a situation where Apple can sue her for defamation (I&#x27;m not a lawyer, but this seems obvious).<p>- Not a troll, just works on nodejs",
      "time": 1633970567,
      "title": "Ashley Gjovik requested paid leave after requesting a severance package",
      "type": "story"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 28830234,
      "score": 1,
      "time": 1633970555,
      "title": "On “natural immunity” to Covid-19 (and every other vaccine-preventable disease)",
      "type": "story",
      "url": "https://respectfulinsolence.com/2021/10/11/on-natural-immunity-to-covid-19-and-every-other-vaccine-preventable-disease/"
    },
    {
      "by": "justindomke",
      "descendants": 0,
      "id": 28830226,
      "score": 1,
      "time": 1633970521,
      "title": "Confidence Games",
      "type": "story",
      "url": "https://justindomke.wordpress.com/2021/10/11/confidence-games-1-2/"
    },
    {
      "by": "spansoa",
      "descendants": 0,
      "id": 28830218,
      "score": 1,
      "time": 1633970501,
      "title": "Using Jaws to Evaluate Web Accessibility",
      "type": "story",
      "url": "https://webaim.org/articles/jaws/"
    },
    {
      "by": "ArtTimeInvestor",
      "descendants": 2,
      "id": 28830211,
      "kids": [
        28830235,
        28830221
      ],
      "score": 2,
      "time": 1633970462,
      "title": "The original Bitcoin code included functions related to playing Poker",
      "type": "story",
      "url": "https://github.com/trottier/original-bitcoin/blob/master/src/uibase.cpp"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28830206,
      "score": 1,
      "time": 1633970433,
      "title": "Be Kind",
      "type": "story",
      "url": "https://letterstoanewdeveloper.com/2021/10/11/be-kind/"
    },
    {
      "by": "ldbooth",
      "descendants": 0,
      "id": 28830193,
      "score": 1,
      "text": "A friend works at a company that was acquired and the entire staff was demoted in title by the acquiring company.<p>Acquisition to employees meant not only a new boss, unrealized equity compensation bumps, but a title demotion. It seems more psychologically significant to me but also affects the pay scale comparable, and a speed bump in some or all career paths.<p>The private company stock options are being traded for new stock in the public acquiring company based on the lower-tier demotion pay-scale now offered to the employees. The bump in equity value went unrealized, and it is likely the new public company stock is overvalued in public markets at the present valuation, though the long term may not be (and thus less options are being offered at inflated values).<p>I am curious if others have had any similar experiences in acquisitions, advice, and why an acquiring team would demote the entire acquired company staff for morale reasons when acquiring IP and engineering talent? Does this signal anything about the acquiring company ethics or am I reading too much into it?",
      "time": 1633970366,
      "title": "Ask HN: Demoting a common cost strategy for tech acquisitions",
      "type": "story"
    },
    {
      "by": "Jesus_piece",
      "descendants": 0,
      "id": 28830182,
      "score": 1,
      "time": 1633970309,
      "title": "China has won the AI battle against the US – Pentagon ex-software chief",
      "type": "story",
      "url": "https://www.jpost.com/jpost-tech/us-loses-to-china-in-ai-battle-pentagon-ex-software-chief-681624"
    }
  ]
}