{
  "stories": [
    {
      "by": "awelkjlek",
      "descendants": 1,
      "id": 31388940,
      "kids": [
        31388941
      ],
      "score": 1,
      "time": 1652634272,
      "title": "Xi Jinping is suffering from brain aneurysm",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10816327/Chinas-leader-Xi-Jinping-suffering-brain-aneurysm-snub-new-medicine-reports-claim.html"
    },
    {
      "by": "kordlessagain",
      "descendants": 0,
      "id": 31388928,
      "score": 1,
      "time": 1652634180,
      "title": "Birdfeeder Application",
      "type": "story",
      "url": "https://docs.vizycam.com/doku.php?id=wiki:birdfeeder_app"
    },
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31388926,
      "score": 2,
      "text": "It&#x27;s bugged me for a long time but it seems so much of the working world is filled with sloppy, poorly done jobs. Maybe not the tech jobs and other higher-paying jobs, but definitely the lower-paying jobs where people are only concerned with fulfilling the most minimal of duties. It&#x27;s understandable of course, so I don&#x27;t blame the <i>people</i>, but I&#x27;m still quite bothered by the lack of attention people give to their work. My guess is that it has to do with our culture&#x27;s increasing obsession with speed and &quot;efficiency&quot;, rather than quality of work. And it&#x27;s impossible to take any pride in your work if an organization&#x27;s bottom line is speed, so much so that any attention paid to quality can become detrimental. Amazon comes to mind, but I see it in many other companies, small and large.<p>Do you observe this as well? Is it a trend, or has it always been like this? Are there ways to restore pride and quality in people&#x27;s work?",
      "time": 1652634167,
      "title": "Ask HN: What's with all the sloppy work? What's happened to quality?",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 31388914,
      "score": 1,
      "time": 1652634118,
      "title": "The Surprising Truth About Pixels and Accessibility",
      "type": "story",
      "url": "https://www.joshwcomeau.com/css/pixels-and-accessibility/"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 31388908,
      "score": 2,
      "time": 1652634103,
      "title": "Europe’s CSAM scanning plan unpicked",
      "type": "story",
      "url": "https://techcrunch.com/2022/05/11/eu-csam-detection-plan/"
    },
    {
      "by": "mkmk",
      "descendants": 0,
      "id": 31388907,
      "score": 1,
      "time": 1652634091,
      "title": "Pigeon Guys Face Tough Times",
      "type": "story",
      "url": "https://www.nytimes.com/2021/02/18/nyregion/pigeons-rooftop-brooklyn.html"
    },
    {
      "by": "nfrankel",
      "descendants": 0,
      "id": 31388883,
      "score": 1,
      "time": 1652633954,
      "title": "Toying with Kotlin's Context Receivers",
      "type": "story",
      "url": "https://blog.frankel.ch/kotlin-context-receivers/"
    },
    {
      "by": "mateusfreira",
      "descendants": 0,
      "id": 31388870,
      "score": 1,
      "time": 1652633831,
      "title": "Run your home on a Raspberry Pi",
      "type": "story",
      "url": "https://changelog.com/podcast/489"
    },
    {
      "by": "bambax",
      "descendants": 0,
      "id": 31388863,
      "score": 1,
      "text": "Backstory: I have a kid learning to play the clarinet in a music conservatory, which involves compulsory sight reading classes. Teaching for sight reading is done on books. The idea for this app is to port the method online, so that it&#x27;s easier to practice and follow one&#x27;s progress. It should also be more fun, and, for those so inclined, competitive.<p>The learning method is based on landmarks: for each clef one first learns the position of 2-3 landmarks, and then each note is in relation to a landmark. So for example, if you know where the middle G is on the treble clef, then you can learn fast that 2 positions up (next line) is B, and two positions down is E. (Anecdotally, in an earlier iteration of the app, landmark notes were displayed using specific colors; but users learned colors instead of the note position on the staff, and when they moved to a level without colors (or an actual score) they were completely lost.)<p>The app doesn&#x27;t try to teach keyboard playing, or fingering for any other instrument for that matter. It only helps associate the position of a note on the staff with a name, in a given clef. It doesn&#x27;t deal with octaves: a C3 is a C4 is a C; or accidentals: a sharp G is a flat G is a G. It also doesn&#x27;t wait for user input, as other apps do. Music doesn&#x27;t work that way; but more importantly, the point is to learn to recognize intervals instantly, <i>not</i> count them.<p>No account is necessary to use the app, only to participate in the leaderboard, and save one&#x27;s score in case of device reset (or to use more than one device). When an account is created, the data is stored on the server in SQLite; I&#x27;m curious to see how far it can go. (Without an account, no data leaves the device.)<p>It&#x27;s still a little rough around the edges but should work ok in reasonably recent browsers. On the client side, it uses VexFlow to display notes, staff and clefs, but animations are done using CSS transitions (not JS), to be mobile friendly. Tone.js helps provide a more accurate timing than a simple setInterval. Icons are coded in SVG by hand; for simple shapes, this is surprisingly fun and straightforward to do.",
      "time": 1652633756,
      "title": "Show HN: Babeloop, a simple music sight-reading webapp",
      "type": "story",
      "url": "https://www.babeloop.com/"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 31388855,
      "score": 4,
      "time": 1652633670,
      "title": "ICE uses data brokers to bypass surveillance restrictions, report finds",
      "type": "story",
      "url": "https://www.theverge.com/2022/5/10/23065080/ice-surveillance-dragnet-data-brokers-georgetown-law"
    }
  ]
}