{
  "stories": [
    {
      "by": "carride",
      "descendants": 0,
      "id": 28143001,
      "score": 1,
      "time": 1628694891,
      "title": "Valve’s upcoming Steam Deck will be based on Arch Linux–not Debian",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2021/08/valves-upcoming-steam-deck-will-be-based-on-arch-linux-not-debian/"
    },
    {
      "by": "eplanit",
      "descendants": 0,
      "id": 28142993,
      "score": 1,
      "time": 1628694847,
      "title": "YouTube suspends Sen. Rand Paul for 1 week for claiming masks are ineffective",
      "type": "story",
      "url": "https://www.mercurynews.com/2021/08/11/youtube-suspends-gop-sen-rand-paul-for-seven-days-for-claiming-masks-are-ineffective/"
    },
    {
      "by": "pramodbiligiri",
      "descendants": 0,
      "id": 28142979,
      "score": 1,
      "time": 1628694779,
      "title": "Preparing for performance analysis at exascale",
      "type": "story",
      "url": "https://arxiv.org/abs/2108.04002"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28142974,
      "score": 1,
      "time": 1628694766,
      "title": "Bootstrappable Builds",
      "type": "story",
      "url": "https://lwn.net/SubscriberLink/841797/a3778b257ba47cd4/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28142972,
      "score": 1,
      "time": 1628694757,
      "title": "The New Old Way of Learning Languages (2008)",
      "type": "story",
      "url": "https://theamericanscholar.org/the-new-old-way-of-learning-languages/"
    },
    {
      "by": "kiscica",
      "descendants": 0,
      "id": 28142971,
      "score": 2,
      "text": "We have Amazon Alexa devices in most rooms of the house. We all sometimes use them as an &quot;intercom&quot; to get the attention of other family members. For those not familiar with this feature, basically, you say &quot;Alexa, announce $FOO&quot; and ever device in the house makes an attention-getting noise and then says &quot;$FOO&quot; (it&#x27;s an actual recording of what you said, not Alexa repeating it in her own voice).  Mildly useful.<p>Now, I&#x27;ve noticed that Alexa also <i>transcribes</i> the announcement, and sends a text notification to my iPhone (where I have the Alexa app installed).  The transcription is generally quite accurate -- except when my daughter is saying something to get my attention, or vice-versa. That&#x27;s because she and I usually speak Hungarian and Alexa, of course, does not know how to transcribe Hungarian. If one of us makes a Hungarian announcement, Alexa just transcribes it as some English gibberish that sounds vaguely similar.<p>So far so good. Last night, my daughter made an announcement (in English) that included our cat&#x27;s name. Our cat is named Meeka Macska. It&#x27;s a rather unique name (there are, for example, zero hits on Google for the phrase &quot;Meeka Macska&quot; or &quot;Meekamacska&quot;). The name means, basically, &quot;Meeka the Cat&quot;; &quot;macska&quot; is Hungarian for &quot;cat,&quot; but Meeka is written in English orthography; in Hungarian it would be &quot;Mika.&quot; Alexa transcribed the announcement correctly.<p>I cannot for the life of me understand how Alexa knows the spelling of our cat&#x27;s name. My daughter and I did some experiments. Announcements (again, in English) containing the word &quot;macska&quot; without &quot;Meeka,&quot; regardless of context, were never transcribed with that orthography; it was <i>always</i> gibberish. Actual examples: &quot;much go,&quot; &quot;Marsha.&quot; &quot;much Scott,&quot; &quot;March come.&quot; We never once got &quot;macska&quot; back. On the other hand, announcements containing &quot;Meeka&quot; without &quot;Macska&quot; were reliably transliterated with &quot;Mika,&quot; which makes some sense, because &quot;Mika&quot; seems to be an established name (2 orders of magnitude more hits on Google than &quot;Meeka&quot;).<p>In fact, the announcement &quot;Meeka the macska,&quot; i.e. including both components of the name but separated by one word, came out &quot;Mika the Much Car.&quot; The variant &quot;Mooka Macska,&quot; on the other hand, was usually transcribed as &quot;Meeka Macska&quot; (I got &quot;Luke much dog&quot; and &quot;Luke must go&quot; on two occasions), even when I was vary careful in articulating the &quot;oo&quot; sound.  &quot;Mooka Kutya&quot; (&quot;Mooka the dog,&quot; a purely hypothetical name) was transcribed with various kinds of gibberish, e.g. &quot;Mukul Cloutier&quot; (!) and &quot;Move the couch&quot; (!!).  and once I was rewarded with a disconcerting &quot;whooop!&quot; noise -- it turns out that if Alexa thinks you said &quot;good job,&quot; which I must admit is not a bad guess for &quot;kutya,&quot; it makes that noise before the announcement.<p>My conclusion is that &quot;Meeka Macska&quot; is a phrase in Alexa&#x27;s voice transcription database -- I <i>assume</i> it&#x27;s customized to our voices, and not global. It seems far too consistent to be random chance. &quot;Mukul Cloutier&quot; isn&#x27;t a phrase that appears in Google either, but I only elicited that once.  &quot;Meeka Macska,&quot; on the other hand, comes out every time.<p>I&#x27;m forced to assume that Alexa&#x2F;Amazon knows the phrase because of text that originated from me at some point.  The part that is a mystery is this: I have <i>never</i> entered the words &quot;Meeka Macska&quot; into any website or application that I know to be linked to Amazon in any way. It&#x27;s not like I have much occasion to write down our cat&#x27;s name, anyway.  It&#x27;s probably been in a few private emails, text messages, and the occasional Facebook post (always visible only to my friends list).  I hate to blame Facebook or Google (Gmail) by default, and I also find it hard to believe that they&#x27;d be sharing the actual text content of posts or messages with Amazon.<p>What&#x27;s going on here? Anyone have any ideas?",
      "time": 1628694744,
      "title": "How does Amazon Alexa know my cat's name?",
      "type": "story"
    },
    {
      "by": "NickDuncan",
      "descendants": 0,
      "id": 28142967,
      "score": 1,
      "text": "Hi Everyone<p>It&#x27;s evident that today&#x27;s founder needs more support and powerful tools in order to break out and be noticed. One of the most fundamental steps in getting your startup to be a success (apart from the product itself) is Content Marketing. I know first-hand how hard it is to create content consistently so that your product has a chance of ranking for those long-tail keywords. Over and above that, I realize how hard it is to keep swapping &quot;hats&quot; from product to marketing to sales and back again. This is one of the main reasons I started ContentBot. I needed help. I needed help to get things done quicker and bridge the gap between myself and the competition. This is where the beauty and magic of ContentBot comes into play.<p>We&#x27;ve built something new that allows you to use the world&#x27;s most advanced AI to write for you, wherever you are on the web!<p>The new AI Writer Chrome Extension allows you to generate AI content at the click of a button on nearly every and any website. Be inspired wherever you go - from WordPress and Wix, to Quora and even StackOverflow.<p>I&#x27;m so excited to get this out and I can&#x27;t wait for you to try it.<p>There is a free plan and a paid plan.<p>You can grab it here: https:&#x2F;&#x2F;chrome.google.com&#x2F;webstore&#x2F;detail&#x2F;contentbotai&#x2F;ehliocfmgnkdcgigclppnodpgkiodfco",
      "time": 1628694704,
      "title": "Show HN: AI Writer, Chrome Extension",
      "type": "story"
    },
    {
      "by": "jdmark",
      "descendants": 0,
      "id": 28142938,
      "score": 1,
      "time": 1628694573,
      "title": "Configure Ubuntu 18.04 LTS for smart card login [pdf]",
      "type": "story",
      "url": "https://pages.ubuntu.com/rs/066-EOV-335/images/SmartCardLogin_WhitePapaer_04.03.20.pdf"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28142916,
      "score": 1,
      "time": 1628694423,
      "title": "Dog ‘Mummified’ Inside the Trunk of a Tree",
      "type": "story",
      "url": "https://www.snopes.com/fact-check/dog-found-mummified-inside-tree/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28142909,
      "score": 1,
      "time": 1628694393,
      "title": "Apple drops intellectual property lawsuit against maker of security tools",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2021/08/10/apple-drops-corellium-lawsuit/"
    }
  ]
}