{
  "stories": [
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28974019,
      "score": 1,
      "time": 1635038498,
      "title": "Braces to Pixels",
      "type": "story",
      "url": "https://alistapart.com/article/braces-to-pixels/"
    },
    {
      "by": "losfair",
      "descendants": 0,
      "id": 28974014,
      "score": 1,
      "time": 1635038455,
      "title": "Show HN: Superscalar RISC-V CPU written in Clash",
      "type": "story",
      "url": "https://github.com/losfair/Violet"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28974012,
      "score": 1,
      "time": 1635038423,
      "title": "A Complete Guide to Flexbox",
      "type": "story",
      "url": "https://css-tricks.com/snippets/css/a-guide-to-flexbox/"
    },
    {
      "by": "carabiner",
      "descendants": 0,
      "id": 28973972,
      "score": 1,
      "time": 1635037942,
      "title": "Easy way to understand statistical recall and precision",
      "type": "story",
      "url": "https://old.reddit.com/r/datascience/comments/qdai89/i_just_explained_recallprecision_to_a_nonds_and/"
    },
    {
      "by": "noobhacker",
      "descendants": 2,
      "id": 28973942,
      "kids": [
        28974013,
        28974042
      ],
      "score": 7,
      "text": "According to the media and from watching my professional circle, it seems that many are indeed changing jobs with significant pay raises--the so-called Great Resignation.<p>I&#x27;d like to hear from HN about job changes and raises. Anecdotes are welcome, but ideally one of us works in HR and has systematic data.<p>But more importantly, I&#x27;d like to think through the reasons driving the Great Resignation. Below are several explanations with my own assessments.<p>1. People die from Covid, reducing the labor force. \n-&gt; Irrelevant for tech workers<p>2. People get large checks from the gov and are not pressured to find job. \n-&gt; Irrelevant for tech workers<p>3. People avoided changing jobs during the pandemic. So the high turnover now is simply making up for low turnover in 2020.\n-&gt; This does explain the high turnover, but not the significant raises. Indeed, the number of workers and jobs remains the same--people are shuffling between places. To be convinced of this theory, I&#x27;d like to see that raises are flat.<p>3. Senior workers are retiring early due to pandemic-related revelation. Mid-level workers are thus getting more promos than usual.\n-&gt; Seems plausible. To be convinced, I need to see mid-level workers getting raises, and entry-level workers NOT getting raises.<p>4. [My theory] Remote work allows better matching of people and jobs. Imagine that person A can deliver lots of value to company B, but is hitherto prevented to do so due to location. With remote work, Person A can now work for Company B and get paid higher accordingly.\n-&gt; To be convinced, I need to see that remote job offers have higher comp vs comparable non-remote job offers. If this theory is true, then the Great Resignation&#x2F;Remote Work makes the job market more efficient, creates value for society, and should be celebrated by employees and employers alike.<p>5. [My theory] The pandemic pushes society forward in terms of tech adoption, making tech workers even more valuable than before.\n-&gt; Seems plausible, since tech has become more valuable as a whole (e.g. stock price), not just salary. If this theory is true, then it is again a good thing for both tech workers and the broader society.",
      "time": 1635037611,
      "title": "Ask HN: Is the Great Resignation in tech real? If so, why?",
      "type": "story"
    },
    {
      "by": "MarkMc",
      "descendants": 0,
      "id": 28973930,
      "score": 1,
      "time": 1635037513,
      "title": "Show HN: A Hacker News mobile app with crowdsourced images and subtitles",
      "type": "story",
      "url": "https://mclarentimes.com/"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 28973924,
      "score": 1,
      "time": 1635037488,
      "title": "Prosecutors uncover money-laundering operation between US and Dubai",
      "type": "story",
      "url": "https://samsung.tribunecontentagency.com/2021/10/23/prosecutors-in-detroit-uncover-massive-money-laundering-operation-between-us-and-dubai/"
    },
    {
      "by": "maddynator",
      "descendants": 0,
      "id": 28973921,
      "score": 1,
      "time": 1635037465,
      "title": "We All Are Playing Squid Game with One Exception",
      "type": "story",
      "url": "https://thinkingthrough.substack.com/p/we-all-are-playing-squid-game-with"
    },
    {
      "by": "nobody9999",
      "descendants": 0,
      "id": 28973899,
      "score": 1,
      "time": 1635037172,
      "title": "Internal Alarm, Public Shrugs: Facebook’s Employees Dissect Its Election Role",
      "type": "story",
      "url": "https://electionlawblog.org/?p=125407"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28973887,
      "score": 1,
      "time": 1635037068,
      "title": "Stunts: Not just another racing game",
      "type": "story",
      "url": "https://www.ultimatestunts.nl/"
    }
  ]
}