{
  "stories": [
    {
      "by": "ihuman",
      "descendants": 0,
      "id": 30381811,
      "score": 1,
      "time": 1645154705,
      "title": "Where Mac Catalyst Falls Short",
      "type": "story",
      "url": "https://www.highcaffeinecontent.com/blog/20220216-Where-Mac-Catalyst-Falls-Short"
    },
    {
      "by": "cliffordfajardo",
      "descendants": 0,
      "id": 30381806,
      "score": 1,
      "text": "As a basis:\nDB validating the format of an email address: No\nDB validating the price of a product can&#x27;t be negative: Yes\nHow would you define the line between them?",
      "time": 1645154621,
      "title": "Ask HN: How much logic should I keep at the database vs. app layer?",
      "type": "story"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 30381798,
      "score": 1,
      "time": 1645154544,
      "title": "Pinecone: Fast, fresh, and filtered vector search",
      "type": "story",
      "url": "https://www.pinecone.io/"
    },
    {
      "by": "j765",
      "descendants": 0,
      "id": 30381797,
      "score": 1,
      "time": 1645154542,
      "title": "Encapsulate successful or failed function execution",
      "type": "story",
      "url": "https://github.com/Kotlin/KEEP/blob/master/proposals/stdlib/result.md"
    },
    {
      "by": "lostwhitewalker",
      "descendants": 1,
      "id": 30381766,
      "kids": [
        30381788
      ],
      "score": 1,
      "text": "I&#x27;m a month and a half into the job, and I feel lost and scared. I&#x27;m scared that they will fire me because they think I&#x27;m incompetent. I&#x27;m working on a ticket that should take me a day to finish but it has taken me almost a week. I hate that I am always asking people for help, like today I asked for help to rebase my branch since I have never done it before. The fear itself makes me want to quit. At my old job I was the guy that got things done, gathering requirements, designing and developing new features, and e.c.t. I didn&#x27;t have any mentors at the old company and since it was a small company we didn&#x27;t follow the industry standards, like code review or using git (we used svn). So everything we do here is new, except the development aspect. I guess what I want to know is, did anyone else ever feel this way and if so how did you over come, did anyone get fired because they are incompetent?",
      "time": 1645154274,
      "title": "Ask HN: I started a new job and I'm scared",
      "type": "story"
    },
    {
      "by": "arvidkahl",
      "descendants": 0,
      "id": 30381751,
      "score": 1,
      "time": 1645154066,
      "title": "How big technology systems are slowing innovation",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/02/17/1044711/technology-slowing-innovation-disruption/"
    },
    {
      "by": "graderjs",
      "descendants": 1,
      "id": 30381746,
      "kids": [
        30381749
      ],
      "score": 1,
      "time": 1645154009,
      "title": "Mikaela Shiffrin shares nasty comments after 2022 Olympics disappointment",
      "type": "story",
      "url": "https://nypost.com/2022/02/17/mikaela-shiffrin-shares-nasty-comments-after-2022-olympics-letdown/"
    },
    {
      "by": "legerdemain",
      "descendants": 0,
      "id": 30381742,
      "score": 1,
      "text": "I have had a lot of trouble breaking into software engineering with just a Github portfolio and an unrelated degree. Basically, my applications get no response from companies.<p>I discussed my plans to join a bootcamp-style program with a friend who is a Google engineer. My friend told me that bootcamps are a waste of my time and money, and that he believes that anyone can break into SWE with just a few weeks of trying.<p>His suggestion was to join and do well on programming competitions (he suggested Google Kickstart), which he describes as a direct funnel to SWE jobs. I have not heard of this option before. I have never tried competitive programming, so I do not know how much effort it takes to win at them. My Google friend says that the effort is minimal and that these competitions have a low bar to score well.<p>Have you found code competitions useful in your job search? Is competitive programming a good time investment if I&#x27;m trying to break into SWE roles?",
      "time": 1645153982,
      "title": "Ask HN: Breaking into SWE",
      "type": "story"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30381741,
      "score": 1,
      "time": 1645153973,
      "title": "On the $500k Y Combinator standard deal",
      "type": "story",
      "url": "https://jaredheyman.medium.com/on-the-500k-y-combinator-standard-deal-b45fd8bd867c"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 30381740,
      "score": 1,
      "time": 1645153968,
      "title": "Gradients Without Backpropagation",
      "type": "story",
      "url": "https://arxiv.org/abs/2202.08587"
    }
  ]
}