{
  "stories": [
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31886922,
      "score": 1,
      "time": 1656270600,
      "title": "Red Sox CTO: Baseball teams need modern tech stack as much as any other biz",
      "type": "story",
      "url": "https://techcrunch.com/2022/06/26/red-sox-cto-baseball-teams-need-modern-tech-stack-as-much-as-any-other-biz/"
    },
    {
      "by": "randomlytyping",
      "descendants": 0,
      "id": 31886920,
      "score": 1,
      "text": "Are you satified of what you have become?",
      "time": 1656270591,
      "title": "Ask HN: How good of a developer were you in your 20s?",
      "type": "story"
    },
    {
      "by": "jamessun",
      "descendants": 0,
      "id": 31886908,
      "score": 1,
      "time": 1656270478,
      "title": "Can a Company Trademark a Color?",
      "type": "story",
      "url": "https://thehustle.co/can-a-corporation-trademark-a-color/"
    },
    {
      "by": "n42",
      "descendants": 0,
      "id": 31886907,
      "score": 1,
      "text": "I own four different Apple computers -- a 2017 MacBook Pro, an M1 MacBook Air, and M1 MacBook Pro, and most recently a maxed out Mac Studio. I also have had in that timespan three different Windows desktops that I have built and a ThinkPad running Windows or Linux depending on the mood.<p>I have spent countless dollars on cables and adapters in an attempt to find the magic combination. I have read DisplayPort specs, I know every brand of certified cable. I now know way more than I would ever care to know about DisplayPort and HDMI protocols. I have tried 4 different brands and models of monitor. For one of those models, I had three of the exact same model. All combinations work flawlessly with anything that is not one of the Apple devices. I have all but eliminated any of these components being the problem.<p>Depending on the device and the day I will get:<p>- Visual artifacts like snow, lines, flickering<p>- Failure to support native resolution on any high resolution monitors<p>- Failure to support high refresh rates<p>- Forced scaling, detecting monitor as a TV and using interlacing<p>- Most reliably of all, failure to wake from sleep without plugging&#x2F;unplugging; doing a dance with power cycling my monitor or device until it finally works, or just giving up and logging into my Windows PC because today I can&#x27;t use my Apple computer<p>It&#x27;s never all at once, but it&#x27;s always at least one thing. In the time of owning any of these devices, I have without exaggeration, not once had the expected experience of sitting down at my desk and starting my day without fighting my computer to work properly with my monitor.<p>Searching the internet, I can&#x27;t be alone. All of the problems I have, as far as I can tell, other people experience. And as far as I can tell, no one has an answer. I&#x27;m at a breaking point after ordering this $4k desktop Mac Studio. I hoped that, being a device that requires an external display, they at least worked it out with this one.<p>They did not.<p>So how does the entire professional industry working with Apple computers manage to start their day, every day, like this? Am I insane? Is no one else dealing with this? Are you all just using the built in display? This has been going on for YEARS for me, across multiple generations of devices.",
      "time": 1656270465,
      "title": "Ask HN: How on earth are you using your Apple computer with external displays?",
      "type": "story"
    },
    {
      "by": "gbrown_",
      "descendants": 0,
      "id": 31886884,
      "score": 2,
      "time": 1656270334,
      "title": "On Identifiable Aborts",
      "type": "story",
      "url": "https://cronokirby.com/posts/2022/06/on-identifiable-aborts/"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 31886866,
      "score": 1,
      "time": 1656270236,
      "title": "Poly Keyboard",
      "type": "story",
      "url": "https://kbd.news/Poly-Keyboard-1484.html"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31886855,
      "score": 2,
      "time": 1656270146,
      "title": "What Should We Do About Inflation? (Part 2)",
      "type": "story",
      "url": "https://theovershoot.co/p/what-should-we-do-about-inflation-3fe"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31886848,
      "score": 2,
      "time": 1656270112,
      "title": "God Mode: Authoritarianism is now a preset",
      "type": "story",
      "url": "https://leightonwoodhouse.substack.com/p/god-mode"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31886837,
      "score": 2,
      "time": 1656270031,
      "title": "Rage Against the Touchscreen",
      "type": "story",
      "url": "https://gurwinder.substack.com/p/rage-against-the-touchscreen"
    },
    {
      "by": "jbotz",
      "descendants": 0,
      "id": 31886828,
      "score": 1,
      "time": 1656269980,
      "title": "HIGP-developed Biofinder advances detection of extraterrestrial life",
      "type": "story",
      "url": "https://www.soest.hawaii.edu/soestwp/announce/news/higp-developed-biofinder-advances-detection-of-extraterrestrial-life/"
    }
  ]
}