{
  "stories": [
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28904625,
      "kids": [
        28904626
      ],
      "score": 1,
      "time": 1634559416,
      "title": "How Many People Can the Earth Support? (1998)",
      "type": "story",
      "url": "https://www.nybooks.com/articles/1998/10/08/how-many-people-can-the-earth-support/"
    },
    {
      "by": "U1F984",
      "descendants": 0,
      "id": 28904624,
      "score": 1,
      "time": 1634559392,
      "title": "Is Agility Related to Commitment? – Money Flows Part II",
      "type": "story",
      "url": "https://zwischenzugs.com/2021/10/18/is-agility-related-to-commitment-money-flows-part-ii/"
    },
    {
      "by": "bratao",
      "descendants": 0,
      "id": 28904617,
      "score": 1,
      "time": 1634559317,
      "title": "Nuxt 3 Beta",
      "type": "story",
      "url": "https://nuxtjs.org/announcements/nuxt3-beta/"
    },
    {
      "by": "GarethX",
      "descendants": 0,
      "id": 28904603,
      "score": 1,
      "time": 1634559168,
      "title": "Move Fast and Fix Things",
      "type": "story",
      "url": "https://orbit.love/blog/move-fast-and-fix-things"
    },
    {
      "by": "smm-ninjas",
      "descendants": 0,
      "id": 28904601,
      "score": 1,
      "time": 1634559166,
      "title": "Linked Marketing Blog",
      "type": "story",
      "url": "https://www.linked-assist.com/./blog/"
    },
    {
      "by": "fxtentacle",
      "descendants": 1,
      "id": 28904591,
      "kids": [
        28904599
      ],
      "score": 2,
      "time": 1634559093,
      "title": "Windows 10, iOS 15, Ubuntu, Chrome fall at China’s Tianfu hacking contest",
      "type": "story",
      "url": "https://therecord.media/windows-10-ios-15-ubuntu-chrome-fall-at-chinas-tianfu-hacking-contest/"
    },
    {
      "by": "junhyun82",
      "descendants": 1,
      "id": 28904585,
      "kids": [
        28904586
      ],
      "score": 2,
      "time": 1634559030,
      "title": "We Built an All-in-One DeFi Portal (DeFi “R” Us)",
      "type": "story",
      "url": "https://defiportal-6ccb6.web.app/"
    },
    {
      "by": "phenkdo",
      "descendants": 2,
      "id": 28904583,
      "kids": [
        28904632,
        28904613
      ],
      "score": 1,
      "text": "The conversation is almost all Austin (TX) and a lesser extent Miami (FL). Why isn&#x27;t Seattle a more popular destination?",
      "time": 1634559016,
      "title": "Ask HN: Why isn't Seattle(WA) more popular destination for California exiteers?",
      "type": "story"
    },
    {
      "by": "eganist",
      "descendants": 1,
      "id": 28904559,
      "kids": [
        28904640
      ],
      "score": 26,
      "time": 1634558774,
      "title": "Colin Powell has died",
      "type": "story",
      "url": "https://www.cnn.com/2021/10/18/politics/colin-powell-dies/index.html"
    },
    {
      "by": "Bradley-W",
      "descendants": 0,
      "id": 28904556,
      "score": 2,
      "text": "Hello everyone<p>So recently I graduated from University as a Software Engineer in Sweden. I’ve been taking some time off to recover during the summer and to think through what to do next.<p>What I’ve come to realize during my education is that I am not a hardcore careerist. I prefer to work the standard 9-5 and then call it a day and go home, preferably no overtime (unless it’s really needed), but not as standard. I value my spare time and time to recover.<p>I understand many of you live in the U.S. and other countries where it’s very easy to fire someone. I live in Sweden. We earn a lot less compared to you but we also have great job security. After the initial trial period at work when you get a permanent spot, you cannot get fired unless you constantly underperform, come in too late or in other ways break the company rules. In general I think we also have a lower workload. Oftentimes when I watch videos on Youtube about coding, it is a guy from the U.S. making the video saying how hard programmers have to work, and the guy assumes that it is the same all across the world or that all his viewers are also from the U.S. In Sweden it is more relaxed, and our education at University is also free.<p>I also did not like the hectic periods at University where we had to learn new code languages and frameworks under extreme time pressure. I love coding but I prefer to be an expert within a field of coding and get really good at it. At the moment I am thinking about making websites (I enjoyed JSF&#x2F;JSP with Hibernate and SQL-databases) or Android apps. Working for a company that makes Android apps to me sounds like it’s the same process over and over. Some company buys an app from my company. We start making the app, always laying almost the same foundation with google&#x2F;facebook logins, a database, some front-end activities etc. Then after that it’s gonna vary a bit depending on what kind of app it is. But I want to do have those kind of tasks at work that are repetitive and very similar where over time I become an expert, and then maybe become an intermediary boss,  instead of working at a company that has a totally different project every other month and you need to research a lot of new information and solve many difficult new problems that you have never seen before. The latter probably appeals to many people and they live for their career and to develop within it, but like I said I am more of the expert type who wants to be good at one specific thing.<p>That brings me to my next concern about this. Some languages and frameworks are going to be irrelevant soon. An example from what I’ve heard is that within Android programming is Java which will be replaced by Cotlin.<p>For me this is important. I know many languages after having graduated, in my spare time after I’ve done my daily job searching I want to find a language in which I will specialize, but I have to choose the right one and within the right field. So I want to enjoy working within that field and know that the language&#x2F;techniques will be around for some time. Which languages&#x2F;frameworks do you think will last the longest and within which fields of programming would you say that these languages&#x2F;frameworks could be combined with my preference of doing repetitive things such as websites&#x2F;apps? (Could be anything, those are just two examples). Also if anyone here works as an app developer or with creating websites, are you satisfied with your daily work, what do you enjoy the most and the least? What does a normal day look like and in what country do you live? (relevant due to the work situation)",
      "time": 1634558759,
      "title": "What Language and Framworks to Choose?",
      "type": "story"
    }
  ]
}