{
  "stories": [
    {
      "by": "ciprian_craciun",
      "descendants": 0,
      "id": 29151917,
      "score": 2,
      "time": 1636393518,
      "title": "How to write software than will keep working for decades without problems",
      "type": "story",
      "url": "https://unixsheikh.com/articles/how-to-write-software-than-will-keep-working-for-decades.html"
    },
    {
      "by": "madmax108",
      "descendants": 0,
      "id": 29151898,
      "score": 2,
      "time": 1636393432,
      "title": "Focusing on What Is Most Important",
      "type": "story",
      "url": "https://pomp.substack.com/p/focusing-on-what-is-most-important"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 29151889,
      "score": 1,
      "time": 1636393374,
      "title": "Maath",
      "type": "story",
      "url": "https://maath.pmnd.rs/"
    },
    {
      "by": "JonathanBuchh",
      "descendants": 0,
      "id": 29151879,
      "score": 1,
      "text": "Most (if not all) of the most popular programming languages use English syntax, however, for many programmers, English is not their first language. What is it like to learn English programming languages as a non-native speaker? Can you easily learn from online resources or read read documentation? Are classes taught in your native language or English? When learning syntax, do words feel arbitrary or can you tell why they were chosen?",
      "time": 1636393332,
      "title": "Ask HN: Experience learning English programming syntax as a non-native speaker?",
      "type": "story"
    },
    {
      "by": "arenaninja",
      "descendants": 0,
      "id": 29151878,
      "score": 1,
      "text": "I am thinking of offering the services of a remote engineering team to build&#x2F;deploy&#x2F;maintain projects within the US<p>For context, in my home country there is a lot of engineering talent who graduate from university but don&#x27;t have the means to work remotely for a US firm or there isn&#x27;t a pipeline to help them migrate. Many times these CS graduates end up taking up jobs in construction, car mechanic and other trades to keep a roof over their heads. But I know where&#x2F;how to find them and I&#x27;d like to provide them with opportunity - very likely earning more than the local job market would pay them while providing a service to US businesses<p>My plan is to start off taking on projects that I can handle by myself in a reasonable timeframe while I recruit and train abroad. Then take on larger projects but I would remain the customer&#x27;s primary contact point<p>Is this something you or your business would be interested in or am I naive? The pessimist in me thinks this is freelancing with extra steps; the optimist in me says there&#x27;s so much talent available there that would love an opportunity like this<p>If you have time please fill the survey (all questions optional): https:&#x2F;&#x2F;forms.gle&#x2F;tzLGrZoEya16wtco9",
      "time": 1636393332,
      "title": "Ask HN: Hiring a remote engineering team abroad?",
      "type": "story"
    },
    {
      "by": "oazizi",
      "descendants": 0,
      "id": 29151869,
      "score": 1,
      "time": 1636393295,
      "title": "Where are my container's files? Inspecting container filesystems",
      "type": "story",
      "url": "https://blog.px.dev/container-filesystems/"
    },
    {
      "by": "bangonkeyboard",
      "descendants": 0,
      "id": 29151820,
      "score": 1,
      "time": 1636393032,
      "title": "Will Apple honour its promises on OCSP certificate checks?",
      "type": "story",
      "url": "https://eclecticlight.co/2021/11/08/will-apple-honour-its-promises-on-ocsp-certificate-checks/"
    },
    {
      "by": "thelastgallon",
      "descendants": 0,
      "id": 29151811,
      "score": 1,
      "time": 1636392992,
      "title": "Incoming New York mayor Eric Adams vows to take first three paychecks in Bitcoin",
      "type": "story",
      "url": "https://www.cnbc.com/2021/11/04/new-york-mayor-elect-eric-adams-to-take-first-3-paychecks-in-bitcoin.html"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29151804,
      "score": 1,
      "time": 1636392950,
      "title": "DoubleX: Statically Detecting Vulnerable Data Flows in Browser Extensions [pdf]",
      "type": "story",
      "url": "https://swag.cispa.saarland/papers/fass2021doublex.pdf"
    },
    {
      "by": "lynnforbes",
      "descendants": 0,
      "id": 29151787,
      "score": 3,
      "time": 1636392884,
      "title": "A technique for producing ideas: James Webb Young's 5-step system",
      "type": "story",
      "url": "https://memod.com/Cian/how-do-people-come-up-with-ideas-264"
    }
  ]
}