{
  "stories": [
    {
      "by": "djrobstep",
      "descendants": 0,
      "id": 30083180,
      "score": 1,
      "time": 1643186343,
      "title": "Most Russians are poorer now than under Communism in 1989",
      "type": "story",
      "url": "https://westernsydneywonk.wordpress.com/2017/08/12/most-russians-are-poorer-now-than-under-communism-in-1989/"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 30083152,
      "score": 1,
      "time": 1643186148,
      "title": "Debugging Compilers with Optimization Fuel",
      "type": "story",
      "url": "http://blog.ezyang.com/2011/06/debugging-compilers-with-optimization-fuel/"
    },
    {
      "by": "jayalammar",
      "descendants": 1,
      "id": 30083135,
      "kids": [
        30083161
      ],
      "score": 1,
      "time": 1643185904,
      "title": "Intro to Basic Semantic Search",
      "type": "story",
      "url": "https://docs.cohere.ai/semantic-search/"
    },
    {
      "by": "kgwgk",
      "descendants": 1,
      "id": 30083130,
      "kids": [
        30083195
      ],
      "score": 1,
      "time": 1643185847,
      "title": "Mark Zuckerberg’s Stablecoin Ambitions Unravel with Diem Sale Talks",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-01-25/zuckerberg-s-stablecoin-ambitions-unravel-with-diem-sale-talks"
    },
    {
      "by": "yayr",
      "descendants": 1,
      "id": 30083115,
      "kids": [
        30083138
      ],
      "score": 3,
      "time": 1643185721,
      "title": "Google Drive flags files for copyright infringement due to digit combinations",
      "type": "story",
      "url": "https://www.theregister.com/2022/01/25/google_drive_copyright_infringement/"
    },
    {
      "by": "wusspuss",
      "descendants": 0,
      "id": 30083104,
      "score": 2,
      "text": "Twitter takes 20 seconds to load on my phone made in 2020. It then takes about 5-10 more seconds for me to close all the popups and that&#x27;s IF it doesn&#x27;t fail along the way (which it does sometimes), IF I don&#x27;t misclick anything (which the website makes painstakingly easy).<p>All of that to load a list of 280 chars text messages, occasionally with a picture or a video. How come even my pocket supercomputer with 8 cores and 8GB RAM takes that much time to display just some text and pictures?<p>It&#x27;s yet worse with reddit.<p>I do understand that some companies may be motivated to break their own websites to force users to install spyware (&quot;it&#x27;s better in the app!&quot;), but making a broken website doesn&#x27;t take dozens of megabytes of JS. Same slowness could be achieved with a few setTimeout()s. What&#x27;s more, websites are slow even when they aren&#x27;t trying to push an app down your throat - e.g. the desktop versions of those same websites are hardly better, and even websites that don&#x27;t have an app to &quot;offer&quot; are oftentimes just as overengeneered.<p>What I&#x27;m trying to understand is what is the motivation behind this? I wouldn&#x27;t have any questions if webpages required manpower and optimizations to be fast - but on the contrary, anyone with most basic html skills can come up with a faster frontend than twitter&#x27;s[1] AND cover that same functionality (text, a few images and a couple of forms - ALL of this is covered by HTML alone, doesn&#x27;t even need a single line of JS!). This means that companies pay people to make their websites worse, and to do that in a laborious manner - again, not just some setTimeouts()s, but dozens of megabytes of code (and that&#x27;s compressed!). And I can&#x27;t help but wonder - what is the incentive for that? Why? A business should generally save money wherever possible and only spend it to make profits, shouldn&#x27;t it? I just can&#x27;t see how the crime against everything decent that is the twitter frontend could possibly benefit the company, or anyone for that matter. If anything it would harm it. And it costs it money.<p>[1] - see e.g. Nitter, Invidious, Teddit - all of those much more robust than the sites they grab data from. Also pretty sure that even if the people behind these did get paid, it was orders of magnitude less than what the people these companies have working on their frontends get paid.",
      "time": 1643185552,
      "title": "Ask HN: Why does the modern web hate users?",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 30083091,
      "score": 2,
      "time": 1643185364,
      "title": "What’s New in DevTools?",
      "type": "story",
      "url": "https://www.smashingmagazine.com/2022/01/devtools-updates-2022/"
    },
    {
      "by": "thret",
      "descendants": 0,
      "id": 30083089,
      "score": 1,
      "time": 1643185346,
      "title": "Tesla's HEPA filtration removes 99.97% of airborne particulates",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Dx9wrIfqhjM"
    },
    {
      "by": "bagelowl",
      "descendants": 0,
      "id": 30083061,
      "score": 1,
      "text": "TL;DR: If you&#x27;ve participated in a summer school program or your university has one, I&#x27;m curious about your opinion.<p>Living in extremely un-techy city where the software industry is basically non-existent, I want to at least try what it&#x27;s like to live in a hotspot. I figured that the best way to do so could be through a summer school program, as that gives me 1-2 months and exposes me to others as well.<p>Do you know any universities that actually have nice summer schools? I&#x27;m primarily looking for its networking aspect, and therefore it&#x27;d be important to be in-person. Despite primarily targeting the EU, other parts of the world aren&#x27;t off the table either, yet the costs are presumably higher.",
      "time": 1643185038,
      "title": "Ask HN: Summer schools in the EU worth their salt?",
      "type": "story"
    },
    {
      "by": "jillesvangurp",
      "descendants": 0,
      "id": 30083056,
      "score": 1,
      "time": 1643184950,
      "title": "Hundreds of Y Combinator alumni join crypto collective to back Web3 startups",
      "type": "story",
      "url": "https://techcrunch.com/2022/01/24/hundreds-of-y-combinator-alumni-join-crypto-collective-to-back-web3-startups/"
    }
  ]
}