{
  "stories": [
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 31890063,
      "score": 1,
      "time": 1656297832,
      "title": "Sad Trek – How an exhausted liberalism killed sci-fi’s sunniest franchise",
      "type": "story",
      "url": "https://www.thenewatlantis.com/publications/sad-trek"
    },
    {
      "by": "fra",
      "descendants": 0,
      "id": 31890048,
      "score": 1,
      "time": 1656297715,
      "title": "Why America Can’t Build",
      "type": "story",
      "url": "https://palladiummag.com/2022/06/09/why-america-cant-build/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31890041,
      "score": 1,
      "time": 1656297641,
      "title": "Shacl: A Description Logic in Disguise",
      "type": "story",
      "url": "https://arxiv.org/abs/2108.06096"
    },
    {
      "by": "lifeplusplus",
      "descendants": 0,
      "id": 31890031,
      "score": 1,
      "text": "Just wanted to share a personal observation, I dropped out of college in 2012, and went to a coding bootcamp then got a job, worked my way from code monkey to sr dev, got bored after 5 years and thought why not finish degree just needed 1.5 of a semester. When I went back in 2018ish I really noticed how now at least 40% kids were fat FAT. I&#x27;m obese too but not Walmart fat. Before there used to be like 2 people among 400. I felt alarmed and sad. I&#x27;ve struggled with weight all my life, don&#x27;t even eat pizza or touch soda for years. I envy people who complain about not being able to gain weight. So it was sad knowing how much it sucks. So many now are way overweight. Which sucks because being handsome kind of matter more in 20s than say in 40s if you are married and have kids etc.<p>I also read that even wild animals are getting fatter. That&#x27;s really big clue, why all humanity is getting obese. Maybe in future we will look back pitifully knowing the true reasons.",
      "time": 1656297496,
      "title": "Tell HN: College students are now considerably more fat",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 31890030,
      "score": 1,
      "time": 1656297495,
      "title": "Misunderstandings of pregnancy biology that cloud the abortion debate",
      "type": "story",
      "url": "https://www.sciencenews.org/article/abortion-roe-v-wade-pregnancy-biology-supreme-court-ruling"
    },
    {
      "by": "smcleod",
      "descendants": 0,
      "id": 31890024,
      "score": 1,
      "time": 1656297432,
      "title": "Multi-gitter – CLI to update multiple Git repositories in bulk",
      "type": "story",
      "url": "https://github.com/lindell/multi-gitter"
    },
    {
      "by": "dlcmh",
      "descendants": 0,
      "id": 31890022,
      "score": 2,
      "time": 1656297423,
      "title": "China unveils EV battery with unprecedented 1,000km on single charge",
      "type": "story",
      "url": "https://news.cgtn.com/news/2022-06-25/China-unveils-EV-battery-with-unprecedented-1-000km-on-single-charge-1b9cdk88QG4/index.html"
    },
    {
      "by": "keooodev",
      "descendants": 0,
      "id": 31890001,
      "score": 1,
      "text": "I have created a tool where we can input products we found difficult to find when abroad in diffrent countries.\nusers will be able to search for the best alternative in that country.\n we can also rate the products and leave comments on them to help other travellers.",
      "time": 1656297072,
      "title": "Show HN: Tool to find product alternatives when nomading",
      "type": "story",
      "url": "https://www.worldalternative.org/"
    },
    {
      "by": "fairytalemtg",
      "descendants": 3,
      "id": 31889965,
      "kids": [
        31890051,
        31890044,
        31889981
      ],
      "score": 1,
      "text": "It is so much easier to read and continue reading more or rate what is just read, rather then navigate back.<p>Curious if the decision to open in same browser window was intentional.",
      "time": 1656296595,
      "title": "Ask HN: HN why don't you open the article in new tab by default?",
      "type": "story"
    },
    {
      "by": "nomilk",
      "descendants": 0,
      "id": 31889958,
      "score": 1,
      "text": "I self taught back end, and can now make full apps with ruby on rails. Unsurprisingly, my finished applications never look quite right. I use bootstrap which helps a lot.<p>I think the problem is mostly with the layout of elements on the page. I try not to overdo things with unnecessary elements, and I&#x27;ve gotten to a point where each individual piece of the webpage (e.g. a button, a logo, a navbar, a form) looks fine <i>on its own</i>, but as a whole it doesn&#x27;t look professional (for reasons I&#x27;m not yet perceptive enough to detect - I can tell it&#x27;s clunky but I can&#x27;t articulate <i>why</i> it doesn&#x27;t look great).<p>I know 30 minutes is ambitious, but I&#x27;m working on an MVP and don&#x27;t have a lot of time <i>right now</i> (in the future, absolutely).<p>Any recommendations for crash courses, videos, articles, or tutorials greatly appreciated! Particularly interested to hear from anyone who wasn&#x27;t a design &#x27;natural&#x27;, and had to self teach as I am.",
      "time": 1656296503,
      "title": "Ask HN: Recommended crash courses in web UI design (30 minutes or less)",
      "type": "story"
    }
  ]
}