{
  "stories": [
    {
      "by": "JacobHenner",
      "descendants": 0,
      "id": 29948782,
      "score": 1,
      "time": 1642270761,
      "title": "Readout of White House Meeting on Software Security",
      "type": "story",
      "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2022/01/13/readout-of-white-house-meeting-on-software-security/"
    },
    {
      "by": "zarfzarf",
      "descendants": 0,
      "id": 29948766,
      "score": 1,
      "time": 1642270685,
      "title": "Learn PWA",
      "type": "story",
      "url": "https://web.dev/learn/pwa/"
    },
    {
      "by": "tomohawk",
      "descendants": 1,
      "id": 29948721,
      "kids": [
        29948768
      ],
      "score": 2,
      "time": 1642270362,
      "title": "Mass Formation: Deployed on You After over 200 Years of Study",
      "type": "story",
      "url": "https://rwmalonemd.substack.com/p/mass-formation-deployed-on-you-after"
    },
    {
      "by": "neilfrndes",
      "descendants": 1,
      "id": 29948699,
      "kids": [
        29948739
      ],
      "score": 1,
      "time": 1642270222,
      "title": "London Stock Exchange Proposes Special Listings for Private Companies",
      "type": "story",
      "url": "https://www.wsj.com/articles/london-stock-exchange-proposes-special-listings-for-private-companies-11642248741"
    },
    {
      "by": "bigbillheck",
      "descendants": 0,
      "id": 29948684,
      "score": 1,
      "time": 1642270145,
      "title": "The genetic identity of the earliest human-made hybrid animals, the kungas",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/sciadv.abm0218"
    },
    {
      "by": "mustafa_pasi",
      "descendants": 0,
      "id": 29948673,
      "score": 2,
      "text": "I have a very cool research job at a university. I am good at my job, productive and have results. My boss likes me and I like my research group, and the topic is the intersection of all the things I love and am good at, and because it is an applied project, the salary is also not very bad. And my boss likes me so much he wants me to undertake a big project i.e. apply for funding for a multiyear contract.<p>There is only one minor problem. The location is horrible. It is a tiny city, with only a few big engineering campuses. I hate living here primarily because there are very few social opportunities. I am 30 soon and am thinking hard about my future. I like my job, but I do not live to work. I work to live and my life here is making me depressed. I don&#x27;t know if I should spell it out further, but here goes: I want to settle down and there are basically no women here. Being that I am 30, I don&#x27;t want to get stuck in some 5+ year contract in this location.<p>The problem is, how do I explain this to my boss? Will he understand? And am I making the right decision? I worked so very hard to arrive here and now I made it and maybe I will never get as good an opportunity. But does it make sense to continue living in a state where outside of work I have basically no life and feel constantly depressed? I want to move to a big city where I can meet people easier. I might never get as good an opportunity again, career wise. But I also won&#x27;t get my early 30s back if I spend them here. I am myself confused.<p>But the main problem is, how do I explain this to my boss? It feels like bringing personal issues in a professional setting is always a big no-no. But then again, my personal life is just as important to me.<p>Or maybe should I just lie and invent some other plausible excuse instead? I usually like being honest, but maybe it might not be the right way to go about things here.",
      "time": 1642270026,
      "title": "Ask HN: How do I explain to my boss the real reason I want to move away?",
      "type": "story"
    },
    {
      "by": "jean310",
      "descendants": 0,
      "id": 29948633,
      "kids": [
        29948688
      ],
      "score": 1,
      "time": 1642269709,
      "title": "Five Questions to Ask to Have Influence over People",
      "type": "story",
      "url": "https://www.exaltitude.io/blogs/five-questions-to-ask-to-have-influence-over-people"
    },
    {
      "by": "onteri",
      "descendants": 0,
      "id": 29948625,
      "score": 1,
      "time": 1642269675,
      "title": "How to Build and Deploy a Next.js Site to Netlify Manually (Command Line or CI)",
      "type": "story",
      "url": "https://paulonteri.com/thoughts/deploy-nextjs-to-netlify-manually"
    },
    {
      "by": "lakis",
      "descendants": 0,
      "id": 29948624,
      "score": 1,
      "time": 1642269673,
      "title": "Large volcanic eruption near Tonga today as seen from outer space",
      "type": "story",
      "url": "https://twitter.com/NWSHonolulu/status/1482259099458932737"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 29948623,
      "score": 1,
      "time": 1642269670,
      "title": "Apache Software Foundation Statement on White House Open Source Security Summit",
      "type": "story",
      "url": "https://blogs.apache.org/foundation/entry/apache-software-foundation-statement-on"
    }
  ]
}