{
  "stories": [
    {
      "by": "kome",
      "descendants": 0,
      "id": 28466600,
      "score": 1,
      "time": 1631165502,
      "title": "Facebook says it doesn't read WhatsApp messages, but it does",
      "type": "story",
      "url": "https://www.businessinsider.com/facebook-reads-whatsapp-messages-encryption-2021-9"
    },
    {
      "by": "amir734jj",
      "descendants": 0,
      "id": 28466586,
      "score": 2,
      "text": "I had an interview yesterday with Twitter for a senior software engineer role. I applied for the position about three months ago and after multiple rounds of screening, yesterday was the final round of technical questions. There were three parts with two person asking me questions in each part:<p>1) system design question<p>2) coding exercise<p>3) behavioral questions<p>I got a call today saying that I have been rejected. But I was also surprised that HR person gave me a feedback which usually never happens. I was told the first round and third round went great and they were really &quot;impressed&quot; with my answers. However, the second round I &quot;didn&#x27;t listen to interviewer&#x27;s feedbacks&quot; and I am &quot;not proficient&quot; in selected language and lastly said I should &quot;apply to other teams&quot;. I thanked the HR person for their time and said goodbye.<p>After a few hours I started to think about the HR&#x27;s feedback. It really hit me hard.<p>Throughout the interview, one of the interviewers used &quot;hands up&quot; feature of Google meet but I didn&#x27;t hear the sound that he raised his hands. The other interviewer asks me question directly without using &quot;hands up&quot; feature to gain my attention. I tell this interviewer that I do not hear the sound and I do not get a notification that someone raised their hand as I am working on the code so please just ask your question instead of doing that. But it causes a misunderstanding.<p>Also, during the second half of the coding part, other interviewer said: &quot;oh, he will be working in your team&quot;. Suddenly, I see a major change of attitude of that interviewer who is also senior engineer. He has been quiet before this point but now he starts nitpicking on my coding style, asking me explain the code even though I explained my code multiple times already, asks hypothetical questions all after my code has passed all the tests. This is at 40 minutes mark. Then he leaves for 7-10 minutes and comes back. During that time, I work on improving the code with the other interviewer who was polite and understanding. When he comes back he starts asking me questions about edge cases.<p>The second item HR said was I am not proficient in the selected language (Java). But I have been teaching (and TA) Data Structures with Java during my PhD studies for 2 years so I am very sure that&#x27;s a made up complaint.<p>I may be wrong but I feel he thought I am going to replace him or work closely with him and doesn&#x27;t like my attitude. Overall, I heard a lot of good things about work culture at Twitter but I feel disappointed.<p>Sorry for talking too much, I wanted to share my experience.",
      "time": 1631165378,
      "title": "Not so great experience interviewing at Twitter",
      "type": "story"
    },
    {
      "by": "om154",
      "descendants": 1,
      "id": 28466544,
      "kids": [
        28466545
      ],
      "score": 2,
      "time": 1631165020,
      "title": "Australia's COVID-19 Vaccine Claims Scheme",
      "type": "story",
      "url": "https://www.health.gov.au/initiatives-and-programs/covid-19-vaccines/covid-19-vaccine-claims-scheme"
    },
    {
      "by": "kxrm",
      "descendants": 0,
      "id": 28466543,
      "score": 1,
      "time": 1631165017,
      "title": "Internet Explorer vulnerability threatens Microsoft Office users",
      "type": "story",
      "url": "https://www.kaspersky.com/blog/cve-2021-40444-vulnerability-mshtml/41728/"
    },
    {
      "by": "bb88",
      "descendants": 0,
      "id": 28466503,
      "score": 2,
      "time": 1631164601,
      "title": "Coin Shrinking",
      "type": "story",
      "url": "http://www.capturedlightning.com/frames/shrinkergallery.html"
    },
    {
      "by": "panabee",
      "descendants": 0,
      "id": 28466486,
      "score": 4,
      "time": 1631164395,
      "title": "Can mRNA vaccines do for cancer what they did with Covid-19?",
      "type": "story",
      "url": "https://medcitynews.com/2021/08/can-mrna-vaccines-do-for-cancer-what-they-did-with-covid-19/"
    },
    {
      "by": "curmudgeon22",
      "descendants": 0,
      "id": 28466483,
      "score": 1,
      "time": 1631164378,
      "title": "Superconductivity in cuprates: ‘from max to min dissipation’ – a new paradigm?",
      "type": "story",
      "url": "https://www.ru.nl/hfml/research/research-highlights/highlights/superconductivity-cuprates-from-maximal-minimal/"
    },
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 28466455,
      "score": 2,
      "time": 1631164118,
      "title": "In the Memory Ward: Britain's most eccentric and original library (2015)",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2015/03/16/in-the-memory-ward"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 28466441,
      "score": 1,
      "time": 1631163991,
      "title": "Effectiveness of Covid-19 Vaccines in Ambulatory and Inpatient Care Settings",
      "type": "story",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2110362"
    },
    {
      "by": "asplake",
      "descendants": 0,
      "id": 28466436,
      "score": 1,
      "time": 1631163938,
      "title": "Facebook accused of allowing sexist job advertising",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-58487026"
    }
  ]
}