{
  "stories": [
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 29283013,
      "score": 1,
      "text": "So say I want to write some software involving a specific domain. Let’s say the particular domain is <i>very</i>mm mating heavy, in particular calculus. The parts of calculus find in upper level undergraduate programs. Now I’ve never been particularly good at math, in part because I didn’t really care about it when I was younger.<p>So basic in order to even get started on this project, I have to be at least somewhat familiar with<p>1) The tools I want to use to write the software \n2) The domain \n3) The prerequisite knowledge required to understand the domain (in the case the upper level math and a few other things.\n4) The prerequisite knowledge for <i>3</i> (which involves more basic calculus, algebra etc. basically the stuff I never paid much attention to in school)<p>My problem is I have to learn that from the bottom up. Now if I was just starting at <i>2</i> or even <i>3</i>, it would be no problem. My problem is at the fourth level.<p>At this point, I know the resources to use, but I find it extremely difficult to even get started, as it involves grinding through hours of videos, books, etc. to reviews &#x2F; learn &#x2F; relearn stuff that’s so abstracted and far away from my original goal that I just can’t keep the motivation. It adds significant time cost and removes the lesrning benefit that comes with a concrete, interest and is basically a return to everything I disliked about math when I was younger.<p>Does anyone have any advice on how one could motivate themselves through something like this?",
      "time": 1637358577,
      "title": "Ask HN: Keeping focused on learning several layers of abstraction deep",
      "type": "story"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 29282999,
      "score": 1,
      "time": 1637358523,
      "title": "Endaoment",
      "type": "story",
      "url": "https://endaoment.org/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29282978,
      "score": 1,
      "time": 1637358398,
      "title": "Lawsuit: Tesla is like a “frat house” with “frequent groping on the factory",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/11/lawsuit-tesla-is-like-a-frat-house-with-frequent-groping-on-the-factory-floor/"
    },
    {
      "by": "solo1preneur",
      "descendants": 0,
      "id": 29282922,
      "score": 1,
      "text": "I&#x27;d like to start a consultancy focused on automating &#x2F; streamlining operational inefficiencies in small&#x2F;med sized businesses. I&#x27;ve learned through the years at various jobs that I&#x27;m good at automating these type of things, but unfortunately I can&#x27;t use those as part of my portfolio since the projects are not able to be discussed publicly.<p>What I&#x27;m offering:<p>Do you have a process in your business that requires a lot of manual back-and-forth between humans? For example - when an order is created, I have to update a spread sheet, reach out to my vendor, submit the order, buy a postage label, and send the customer an email update with the tracking information. Specifically, I&#x27;m looking for processes that depend upon the coordination of multiple people working on a repetitive process. Anything from order fulfillment, landlord maintenance requests, to customer onboarding processes.<p>I&#x27;m not charging anything. This is just me putting in the work to build up a portfolio of examples I can use for my consultancy. If we do launch an automated version of your process, I may just ask that you pay for the hosting costs (like $10-$20 max) per month.",
      "time": 1637358073,
      "title": "Ask HN: Can I (a software dev) automate a tedious business process for you?",
      "type": "story"
    },
    {
      "by": "holonomically",
      "descendants": 0,
      "id": 29282909,
      "score": 2,
      "time": 1637357984,
      "title": "Introduction to Category Theory",
      "type": "story",
      "url": "https://www.cs.nott.ac.uk/~pszgmh/cat.html"
    },
    {
      "by": "philipkiely",
      "descendants": 0,
      "id": 29282891,
      "score": 1,
      "time": 1637357906,
      "title": "Short-Cycle Recurring Revenue",
      "type": "story",
      "url": "https://philipkiely.com/essays/recurring_revenue.html"
    },
    {
      "by": "andrewon",
      "descendants": 1,
      "id": 29282889,
      "kids": [
        29282904
      ],
      "score": 1,
      "time": 1637357904,
      "title": "3D hierarchical image of human brain with new non-destructive technique",
      "type": "story",
      "url": "https://static-content.springer.com/esm/art%3A10.1038%2Fs41592-021-01317-x/MediaObjects/41592_2021_1317_MOESM3_ESM.mp4"
    },
    {
      "by": "lapitopi",
      "descendants": 0,
      "id": 29282874,
      "score": 2,
      "time": 1637357845,
      "title": "Tesla servers throwing 500 errors. People unable to unlock their cars",
      "type": "story",
      "url": "https://teslamotorsclub.com/tmc/threads/app-is-getting-500-server-error-cant-connect.247264/"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 29282870,
      "score": 2,
      "time": 1637357821,
      "title": "The ‘Zelle Fraud’ Scam: How It Works, How to Fight Back",
      "type": "story",
      "url": "https://krebsonsecurity.com/2021/11/the-zelle-fraud-scam-how-it-works-how-to-fight-back/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29282824,
      "score": 2,
      "time": 1637357575,
      "title": "The Unfulfilled Promise of Serverless",
      "type": "story",
      "url": "https://www.lastweekinaws.com/blog/the-unfulfilled-promise-of-serverless/"
    }
  ]
}