{
  "stories": [
    {
      "by": "yarapavan",
      "descendants": 0,
      "id": 29824427,
      "score": 1,
      "time": 1641481744,
      "title": "The fast and the curious: the rise of the running club",
      "type": "story",
      "url": "https://www.ft.com/content/9a777a67-8d8e-40c5-a03b-286ceab99aa7"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 29824418,
      "score": 1,
      "text": "Undoubtedly, one major difference between the Android and iOS is the coherent ecosystem that Apple provides among its devices and OSs. But is it something that&#x27;s unique to Apple, or is it possible to replicate some of it with a mixture of Android and Windows devices?<p>I like Android, and I like that it&#x27;s possible to de-google many Android devices using custom ROMs. But I don&#x27;t think it&#x27;s possible to de-apple any iDevice (and why would you, because that&#x27;d take away all the nice ecosystem features). Still though, I hate it when there&#x27;s no easy way to share files between Android and Windows even in 2022 (as opposed to AirDrop), there&#x27;s no way I can &quot;easily&quot; copy my hand-drawn figures on iPad to Windows (as opposed to Hand-off feature between macOS and iOS devices), and there&#x27;s still no viable alternative to Apple Watch for Android.<p>This means that despite Apple&#x27;s greedy pricing and some really great Android phones introduced each year, still, IMO Apple provides a higher value because of its tight ecosystem:<p><pre><code>    Value(iPhone) + Value(iPad) + Value(MacBook Pro) &lt; Value(All three)</code></pre>",
      "time": 1641481707,
      "title": "Ask HN: What's the value of Apple's ecosystem to you?",
      "type": "story"
    },
    {
      "by": "akudha",
      "descendants": 0,
      "id": 29824405,
      "score": 1,
      "text": "One of my favorites is postcrossing.com - a <i>huge</i> community of people interested in postcards. some 65 million postcards sent, tons of friendships formed, thousands of meetups etc. I&#x27;d have never guessed that so many people can be so passionate about postcards - I doubt most young people today have sent&#x2F;received even a single postcard.<p>What are some of your favorite corners of the web? There was one site where someone was digitizing tens of thousands of newspapers all by himself, one where a couple (I think) wrote passionately about various plants... I forgot to bookmark them, my bad.<p>Anyway, please share your favorites and why. Not just websites, apps are good too. I am tired of going to the same websites everyday (reddit, some youtube channels...) - would be nice to discover projects that are primarily born out of passion, unlike the 99.99% of the web whose primary goal is money.",
      "time": 1641481629,
      "title": "Ask HN: Share your fav quirky, weird, interesting websites (like postcrossing)?",
      "type": "story"
    },
    {
      "by": "intunderflow",
      "descendants": 0,
      "id": 29824397,
      "score": 1,
      "time": 1641481602,
      "title": "North Korea says it tested hypersonic missile",
      "type": "story",
      "url": "https://www.france24.com/en/live-news/20220105-north-korea-says-it-tested-hypersonic-missile"
    },
    {
      "by": "viginti_tres",
      "descendants": 0,
      "id": 29824395,
      "score": 1,
      "text": "I&#x27;m 23, me and all my friends are alcoholic. I just can&#x27;t have fun without alcohol. Been looking for solutions to replace alcohol to have fun but I couldn&#x27;t. How do you have fun without alcohol? Thanks",
      "time": 1641481588,
      "title": "Ask HN: How do you have fun without alcohol?",
      "type": "story"
    },
    {
      "by": "r4id4",
      "descendants": 0,
      "id": 29824366,
      "score": 1,
      "time": 1641481478,
      "title": "Show HN: WikiBites, receive weekly pills of culture about Art, History and more",
      "type": "story",
      "url": "https://wikibites.substack.com/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29824362,
      "score": 1,
      "time": 1641481443,
      "title": "New York Attorney General flags 1.1M online accounts compromised by",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/new-york-attorney-general-flags-1-1-million-online-accounts-compromised-by-credential-stuffing-attacks"
    },
    {
      "by": "felixxx118",
      "descendants": 0,
      "id": 29824329,
      "score": 1,
      "time": 1641481335,
      "title": "How to solve The Social Dilemma: Facebook's nightmare",
      "type": "story",
      "url": "https://www.telosguide.com/blog/01"
    },
    {
      "by": "Deinos",
      "descendants": 0,
      "id": 29824317,
      "score": 1,
      "time": 1641481281,
      "title": "Hedgehogs to Blame for a MRSA Superbug, Not Modern Antibiotics, Study Suggests",
      "type": "story",
      "url": "https://gizmodo.com/hedgehogs-to-blame-for-a-mrsa-superbug-not-modern-anti-1848301189"
    },
    {
      "by": "davinchia",
      "descendants": 0,
      "id": 29824311,
      "score": 1,
      "time": 1641481261,
      "title": "Scaling Data Pipelines on Kubernetes",
      "type": "story",
      "url": "https://airbyte.com/blog/scaling-data-pipelines-kubernetes"
    }
  ]
}