{
  "stories": [
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30770156,
      "score": 1,
      "time": 1647976176,
      "title": "Guarding The Lunar Gateway’s goodness: protecting a steppingstone’s utility",
      "type": "story",
      "url": "https://www.thespacereview.com/article/4343/1"
    },
    {
      "by": "Buttons840",
      "descendants": 0,
      "id": 30770152,
      "score": 1,
      "text": "The US is again warning of potential cybersecurity attacks against the US. Hearing this, I can&#x27;t help but roll my eyes and lament the way we treat those who report cybersecurity vulnerabilities.<p>Recently, the governor of Missouri made it a personal political goal to prosecute a &quot;hacker&quot; who did nothing more than view the source of a government web page. It&#x27;s easy to find other cases where people are harassed, prosecuted, and sometimes jailed, after reporting a vulnerability.<p>I myself once discovered an apparent security vulnerability, but I just closed my browser and walked away. I didn&#x27;t want to deal with the potential harassment or worse. I think many are like me.<p>What changes can lawmakers make to improve this situation? How can we protect those who report security vulnerabilities?",
      "time": 1647976157,
      "title": "Ask HN: What laws can be changed to improve cybersecurity?",
      "type": "story"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 30770114,
      "score": 1,
      "time": 1647975932,
      "title": "Steam on Chrome OS Finally Available in Alpha State for Select Chromebooks",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Chrome-OS-Alpha"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 30770112,
      "score": 2,
      "time": 1647975928,
      "title": "Maersk to completely leave Russia and sell its Russian assets",
      "type": "story",
      "url": "https://trans.info/en/russia-maersk-281292"
    },
    {
      "by": "more_corn",
      "descendants": 0,
      "id": 30770110,
      "score": 1,
      "text": "Take a look at the linked document.\nIAM is the cornerstone of good access control. This document is utterly useless for actually doing anything (and it is massive!) Ask yourself any question, any question at all about setting up or configuring IAM. This document will fail to help. It might help if you&#x27;ve already got most of the way there and need the specific role name, but it cannot get you from task to solution.\nThis is a prime example of how GCP is not customer-centric. Customers have tasks they&#x27;re trying to get done. (&quot;As a customer I&#x27;m trying to do X&quot;). Failure to create task oriented documentation (or interfaces) means your customers can&#x27;t (easily) solve their problems which means customers will end up gravitating to cloud providers who DO take their perspective seriously.\nI think this is an example of failing to follow one of Dale Carnegi&#x27;s fundamental principles of getting along with people (and who better to get along with than your customers!) &quot;Talk in terms of the other person&#x27;s interest.&quot;<p>If anyone at Google is looking to improve GCP marketshare or turn it&#x27;s fortunes around I highly recommend reorienting the product around customer needs. It baffles me that I&#x27;d need to say this but here we are.",
      "time": 1647975920,
      "title": "Show HN: Someone asked recently why GCP more popular as a cloud provider",
      "type": "story",
      "url": "https://cloud.google.com/iam/docs/understanding-roles"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 30770108,
      "score": 1,
      "time": 1647975918,
      "title": "Dissent from Within – It's Not Just Russia",
      "type": "story",
      "url": "https://jeffreycarter.substack.com/p/dissent-from-within"
    },
    {
      "by": "grogu88",
      "descendants": 0,
      "id": 30770096,
      "score": 2,
      "time": 1647975829,
      "title": "Okta hack puts thousands of businesses on high alert",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/22/22990637/okta-breach-single-sign-on-lapsus-hacker-group"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30770082,
      "score": 2,
      "time": 1647975766,
      "title": "Ukraine: The small town which managed to block Russia's big plans",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/world-europe-60840081"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 30770080,
      "score": 1,
      "time": 1647975765,
      "title": "GTR North America – Swap Data Repository",
      "type": "story",
      "url": "https://www.dtcc.com/repository-and-derivatives-services/repository-services/gtr-north-america"
    },
    {
      "by": "boringg",
      "descendants": 0,
      "id": 30770076,
      "score": 2,
      "time": 1647975712,
      "title": "Ask HN: Something you learned recently that is exciting and fascinating?",
      "type": "story"
    }
  ]
}