{
  "stories": [
    {
      "by": "zdw",
      "descendants": 0,
      "id": 29947809,
      "score": 1,
      "time": 1642265000,
      "title": "The Gritty, Underground Network Bringing Japan’s Arcades to the US",
      "type": "story",
      "url": "https://www.wired.com/story/gritty-underground-network-bringing-japan-arcades-to-us/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 29947803,
      "score": 1,
      "time": 1642264988,
      "title": "Fact check: The Theory that SARS-CoV-2 is becoming Milder?",
      "type": "story",
      "url": "https://text.npr.org/1072504127"
    },
    {
      "by": "headalgorithm",
      "descendants": 0,
      "id": 29947801,
      "score": 1,
      "time": 1642264976,
      "title": "The Lies That Powered the Invention of Pong",
      "type": "story",
      "url": "https://spectrum.ieee.org/pong"
    },
    {
      "by": "wombatmobile",
      "descendants": 0,
      "id": 29947795,
      "score": 1,
      "time": 1642264928,
      "title": "Jailed 'Pharma Bro' Martin Shkreli ordered to repay $64m",
      "type": "story",
      "url": "https://www.bbc.com/news/business-60001147"
    },
    {
      "by": "labrador",
      "descendants": 0,
      "id": 29947785,
      "score": 1,
      "text": "Imagine as a thought experiment that they&#x27;re not very good at articulating what the intuitively feel to be right about web3. When they talk about decentralization it much less about technology than routing around the central locus of control that serve as gatekeepers to keep people down.<p>Perhaps the really big idea is that lower middle, working class and poor people have access to the financial system that they never had before, and access to business formation that does not have to satisfy the gatekeepers.<p>In this new world the large corporations, banks, brokerage firms and financial institutions most supremely symbolized by Wall Street and The City in London will suffer a declining influence as security guards watching and controlling access to the immense wealth of the very rich. This could explain why the ultra rich like Bill Gates, Jamie Dimon and Warren Buffet hate bitcoin.<p>Put in a historical context, before the printing press people were ignorant. After the printing press, the common folk had access to books and learned to read, democratizing both information and religion. People no longer had to have a priest to read the Bible to them. This knowledge explosion among the ordinary people fueled the industrial revolution.<p>Before the internet it was difficult to publish your writings. You had to write a letter to the editor, print pamphlets and hand them out, or if you were lucky get someone to publish you. After the internet everyone could publish to the whole world. People began to teach each other. What people learned was that the money system was rigged against them.<p>web3 is an attempt to decentralize and democratize finance and business.<p>When I think about my working class father, who had plenty of great ideas, I remember how he had to go to a stuffy bank hat in hand to try to get a personal loan. This was difficult and mostly did not work.<p>When I think about myself, I was able to participate in the stock market through an IRA, but I had to deal with a broker and buy in lots of 100 usually and pay a fee. I had to park money and couldn&#x27;t do anything with it.<p>Now anyone can download an app and buy fractional shares and then trade them like money. A digital coin is essentially a hybrid between a stock and money. DAO&#x27;s circumvent normal corporations. And so on.<p>I could be wrong, I could be right",
      "time": 1642264875,
      "title": "Ask HN: What if a new generation of developers is right about Web3?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29947784,
      "score": 1,
      "time": 1642264864,
      "title": "Pi4 USB-C Gadget (2019)",
      "type": "story",
      "url": "https://www.hardill.me.uk/wordpress/2019/11/02/pi4-usb-c-gadget/"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29947773,
      "score": 1,
      "time": 1642264830,
      "title": "Low tech restoration of acid lead battery",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9I0IAwOIwXo"
    },
    {
      "by": "skilled",
      "descendants": 0,
      "id": 29947766,
      "score": 1,
      "time": 1642264786,
      "title": "People, Serendipity, and Technology",
      "type": "story",
      "url": "https://ahmann.io/people-serendipity-and-technology/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29947763,
      "score": 1,
      "time": 1642264764,
      "title": "Is the Universe a Fractal?",
      "type": "story",
      "url": "https://bigthink.com/starts-with-a-bang/universe-fractal/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29947755,
      "score": 1,
      "time": 1642264717,
      "title": "Postel's Law as a Profunctor",
      "type": "story",
      "url": "https://blog.ploeh.dk/2021/11/29/postels-law-as-a-profunctor/"
    }
  ]
}