{
  "stories": [
    {
      "by": "l2silver",
      "descendants": 0,
      "id": 30968961,
      "score": 1,
      "text": "We know Wordle was bought for more than 1 million dollars, but generally speaking, how much money do these games generate? I see them all the time, and if Wordle is the best case scenario, I am guessing most of these game make, if they&#x27;re lucky, 100 dollars a month. (https:&#x2F;&#x2F;time.com&#x2F;6143832&#x2F;new-york-times-buys-wordle&#x2F;)",
      "time": 1649518758,
      "title": "Ask HN: How much do little games like Wordle make developers",
      "type": "story"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30968955,
      "score": 1,
      "time": 1649518707,
      "title": "U.S. Copyright Office Rules A.I. Art Can't Be Copyrighted",
      "type": "story",
      "url": "https://www.smithsonianmag.com/smart-news/us-copyright-office-rules-ai-art-cant-be-copyrighted-180979808/"
    },
    {
      "by": "rl1987",
      "descendants": 0,
      "id": 30968906,
      "score": 2,
      "time": 1649518369,
      "title": "Writing web scrapers in Go with Colly framework",
      "type": "story",
      "url": "https://www.trickster.dev/post/writing-web-scrapers-in-go-with-colly-framework/"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 30968904,
      "score": 1,
      "time": 1649518366,
      "title": "Digital footprints could help hackers infiltrate computer networks",
      "type": "story",
      "url": "https://theconversation.com/your-digital-footprints-are-more-than-a-privacy-risk-they-could-help-hackers-infiltrate-computer-networks-177123"
    },
    {
      "by": "ngaut",
      "descendants": 0,
      "id": 30968853,
      "score": 1,
      "time": 1649518092,
      "title": "Compactionary: A Dictionary for LSM Compactions(demo)",
      "type": "story",
      "url": "https://disc-projects.bu.edu/compactionary/#interactiveDemo"
    },
    {
      "by": "yamrzou",
      "descendants": 1,
      "id": 30968848,
      "kids": [
        30968863
      ],
      "score": 1,
      "time": 1649518060,
      "title": "The end of Victorian culture, part I: structural forces",
      "type": "story",
      "url": "https://wyclif.substack.com/p/the-end-of-victorian-culture-part"
    },
    {
      "by": "konschubert",
      "descendants": 1,
      "id": 30968846,
      "kids": [
        30968908
      ],
      "score": 1,
      "time": 1649518048,
      "title": "Lead Time Is Critical in a Hardware Business",
      "type": "story",
      "url": "https://www.invisible-computers.com/2022/04/09/lead-time.html"
    },
    {
      "by": "entaloneralie",
      "descendants": 0,
      "id": 30968838,
      "score": 2,
      "time": 1649517954,
      "title": "What might degrowth computing look like?",
      "type": "story",
      "url": "https://criticaledtech.com/2022/04/08/what-might-degrowth-computing-look-like/"
    },
    {
      "by": "naissa",
      "descendants": 0,
      "id": 30968820,
      "score": 1,
      "time": 1649517754,
      "title": "I sold my first tech company at 15 years old",
      "type": "story",
      "url": "https://medium.com/@mentordial/how-i-sold-my-first-tech-company-at-15-7384997d166b"
    },
    {
      "by": "bagelowl",
      "descendants": 1,
      "id": 30968817,
      "kids": [
        30968833
      ],
      "score": 1,
      "text": "Hey everyone, I believe I&#x27;m in a unique situation, and therefore I feel the need for sharing my backstory.\nTL;DR: Should I jump ship to launch an idea of mine, or wait until I saw more?\nI&#x27;m relatively young, nearing the end of my teenage years. I&#x27;ve been working as a full-stack software developer for more than a year, where I&#x27;ve learned an incredible amount owing to the excellent internal mentoring. I&#x27;m also attending my high school &quot;on the side&quot;, and simultaneously also have a decent income. Currently I&#x27;m living in a noname place with little to no IT industry&#x2F;startup ecosystem. Yet, as I&#x27;ll be attending university, I&#x27;ll also move close to a major tech hub in 1.5 years.\nOn the other hand, I participated in a half-year program aimed at my age group, which had the goal of familiarizing my generation with entrepreneurship and startups. We worked out many details of a promising idea (I&#x27;m aware - who doesn&#x27;t say that their idea is promising?), and based on the validation we&#x27;ve done, the business might have legs.\nOur&#x2F;my obvious choice was to abandon the idea, yet there are voices attempting to convince me to continue working on it, as it can give me a competitive edge on the future, especially if we gain some traction. On the flip side, I&#x27;d prefer playing the &quot;long-game&quot; and waiting 3-4 years.\nCons:\n- If 11 out of 12 startups fail on average, odds are already bad. Besides, there are also other factors. I&#x27;m rather inexperienced (~1 year), many are discriminating me negatively due to age. Finding good co-founders locally is also challenging.\n- I&#x27;m better off gaining some experience first (3-5 years), and then starting something at a tech hub. Significantly bigger talent pool, more support, tons of capital, enormous community.\n- Sure, I won&#x27;t have this particular idea, but I might have new ones, and even if I don&#x27;t, as a technical co-founder I&#x27;ll have the opportunity to choose from other ideas craving for a technical person.\n- If I pursued the idea right now, I&#x27;m well aware that I wouldn&#x27;t stop at 30-40h&#x2F;week. Owing to this, my workload would increase, leading to the negligence of my other responsibilities (social life, studies).\n- Currently I&#x27;m saving for university, which means that I&#x27;ll be able to afford better universities than I normally would access to.\n- I have plenty of opportunities while maintaining the status quo and working. Eg. getting involved in &quot;research&quot; at a university, participating in the local ecosystem, pitching at competitions just for the sake of practice.<p>Pros:\n- Even if the idea fails, I&#x27;ll learn an incredible amount, which gives me a competitive edge and will also increase my chances of succeeding later.\n- I&#x27;ll find reasons later too why I should not pursue something on my own, and it won&#x27;t get easier (family, living, loans).\n- My age will give me a competitive edge as I&#x27;ll be often judged based on my future potential.\n- I have a &quot;safety net&quot; that can catch me when failing&#x2F;falling.\n- I&#x27;ll have plenty of time to work during my life.\nMany other arguments were rather ambiguous and emotional, and were based on the fact that the other people were older and allegedly had more experience, which ought to have compensated for the lack of rational reasoning. Being an aspiring rationalist, this is as big of a red flag as it could be, still, I&#x27;m also open to hearing that I&#x27;m being overly rational.\nI&#x27;m advocating for delaying launching something on my own, still, I&#x27;m trying to be as open-minded as possible. The question is: would you maintain the status quo with some extras, or jump without and figure out how to open the parachute while falling. New perspectives and arguments are welcome too! ;)\nI&#x27;ve also thought about involving two or three co-founders to launch the product, while I keeping an advisory position for significantly less equity (think of 5-10%). This doesn&#x27;t appear viable, hence I&#x27;m curious about other such alternatives.",
      "time": 1649517729,
      "title": "Found it now, or wait until being more experienced",
      "type": "story"
    }
  ]
}