{
  "stories": [
    {
      "by": "coffeepot0",
      "descendants": 0,
      "id": 32100526,
      "score": 1,
      "time": 1657827131,
      "title": "SQL vs. NoSQL in the Modern Data Stack",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_rL65XsrB-o"
    },
    {
      "by": "agent008t",
      "descendants": 0,
      "id": 32100524,
      "score": 1,
      "text": "I feel like we are living in uniquely pessimistic times, at least when compared to the last ~70 years. The world order is being challenged, and not for the better. Massive geopolitcal problems are ahead with no good prospects - continuing Russian aggression in Europe, looming aggression in Taiwan, gloomy prospects over Iran nuclear situation. The US may well see a new civil war in the next few decades. Demographics, particularly in Europe, are not looking good. There are climate change risks to look forward to. Deglobalisation will lead to less global economic efficiency&#x2F;prosperity. Tech advancement appears to have stagnated, and in any case the dream of technological innovation making tomorrow better has been replaced with the reality of tech making a lot of our lives worse, disconnecting people, pitting people against each other, hijacking our attention.  Culturally, we seem to be getting worse at getting along with each other. Generally, we seem to have given up on making things better overall, and instead just focus on trying to prevent bad&#x2F;worse outcomes. I can&#x27;t remember when I last saw someone outline a positive vision of the world we are building with a rough idea of how to get there - mostly, anything referring to the future is some cyberpunk dystopia.<p>Given all the above, what makes you optimistic about the future? Why do you believe that the world of tomorrow will be better than the world of today? What do you look forward to in the world of the future?",
      "time": 1657827117,
      "title": "Ask HN: What makes you optimistic about the future?",
      "type": "story"
    },
    {
      "by": "hayduke",
      "descendants": 1,
      "id": 32100507,
      "kids": [
        32100538
      ],
      "score": 2,
      "time": 1657827017,
      "title": "Elected official conducted 'brute force attack' on Alberta vaccine records site",
      "type": "story",
      "url": "https://www.cbc.ca/news/canada/edmonton/court-documents-allege-mla-conducted-brute-force-attack-on-alberta-vaccine-records-site-1.6520023"
    },
    {
      "by": "jtsymonds",
      "descendants": 0,
      "id": 32100495,
      "score": 2,
      "time": 1657826901,
      "title": "Transparent compression at IO speed for object storage",
      "type": "story",
      "url": "https://blog.min.io/transparent-data-compression/"
    },
    {
      "by": "ag8",
      "descendants": 1,
      "id": 32100487,
      "kids": [
        32100490
      ],
      "score": 1,
      "time": 1657826865,
      "title": "Show HN: A US Evolution Simulator",
      "type": "story",
      "url": "https://us-evolution-simulator.andrew.gr/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 32100484,
      "score": 1,
      "time": 1657826853,
      "title": "Evaluating Mechanical Keyboard Delivery Estimates with Python Web Scraping",
      "type": "story",
      "url": "https://wcedmisten.fyi/post/analyzing-keycap-estimates/"
    },
    {
      "by": "soheilpro",
      "descendants": 0,
      "id": 32100449,
      "score": 1,
      "time": 1657826685,
      "title": "How the James Webb Telescope's cosmic pictures impacted the Internet",
      "type": "story",
      "url": "https://blog.cloudflare.com/how-the-james-webb-telescopes-cosmic-pictures-impacted-the-internet/"
    },
    {
      "by": "LostDevOpsGuy",
      "descendants": 0,
      "id": 32100416,
      "score": 1,
      "text": "For the last two years I have been a DevOps and AWS cloud architect at a FinTech startup in Europe.<p>I have just been offered to take on a project which would consist on transferring ~300M EUR worth of customers from a partner to our company as a Project Manager.<p>Previously to being a DevOps, I was a Cybersecurity consultant for a Big4 company for two years.<p>As I am still 27 years old and I have always having dreamt of joining a FAANG company and&#x2F;or starting my very own startup, I am unsure whether this opportunity (which looks like being a project coordinator) would be positive to my CV in the tech world especially in non-european countries such as the USA. Although I have the feeling that I&#x27;d love the job, I am afraid this would be the &quot;beginning of the end&quot; for a short tech career.<p>How did you guys face this kind of situation? What would you do?<p>Thanks for your feedback",
      "time": 1657826531,
      "title": "Ask HN: Should I accept this project management role?",
      "type": "story"
    },
    {
      "by": "spideymans",
      "descendants": 0,
      "id": 32100414,
      "score": 1,
      "time": 1657826498,
      "title": "Google exec suggests Instagram and TikTok are eating into Search and Maps",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/12/google-exec-suggests-instagram-and-tiktok-are-eating-into-googles-core-products-search-and-maps/"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 32100398,
      "score": 1,
      "time": 1657826411,
      "title": "Georgia Guidestones: 1980 to 2022",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Georgia_Guidestones"
    }
  ]
}