{
  "stories": [
    {
      "by": "Greg-J",
      "descendants": 0,
      "id": 30994581,
      "score": 1,
      "text": "After burning myself out in the 2000s working 60-80 hour weeks and spending another 40 learning new skills, I took a different approach in the 2010s. Instead of going after a position I was qualified for, I took multiple positions below my pay-grade. It worked out great. I made more money, had less responsibility, and the companies I worked for were ecstatic to have someone with my skillset on their payroll. It was great and I&#x27;d definitely recommend it to anyone that is at the top of their field and good with time-management. There are caveats and it&#x27;s not for everyone, but there are enough pros that it warrants consideration.<p>A few years ago I got an offer I couldn&#x27;t refuse and gave it up for my current position that was effectively tailor-made for me. It&#x27;s reward work and I get to solve a lot of problems ranging from ideation and design to development to productization, and everything in-between. Once I took the position, I got more comfortable talking to people about the way I worked through the previous decade and found that there were a lot more people that did the same thing, but only got comfortable talking about it when they moved on.<p>I find myself in a position with my current company where I am essential and effective, but I have a considerable amount of time to either pursue my own thing again or help out a smaller company in the way I used to.<p>Which brings me to my question. It was a hustle when I started working that way and with the number of people I&#x27;ve spoken with who had done the same, I can&#x27;t help but wonder if there&#x27;s a service or community of people looking to do the same.<p>Really just looking to start an open discussion around the topic.",
      "time": 1649709251,
      "title": "Getting a gig below your skill level to give you extra income and/or more time?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30994557,
      "score": 1,
      "time": 1649709162,
      "title": "We Need Better Diagnostic Tests for Autism in Women",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/we-need-better-diagnostic-tests-for-autism-in-women/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30994501,
      "score": 1,
      "time": 1649708998,
      "title": "Understanding Gartner’s Hype Cycles",
      "type": "story",
      "url": "https://www.gartner.com/en/documents/3887767"
    },
    {
      "by": "paganel",
      "descendants": 0,
      "id": 30994496,
      "score": 1,
      "time": 1649708980,
      "title": "Eduard Artemyev, Soviet and Russian composer of electronic music and film scores",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Eduard_Artemyev"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30994483,
      "score": 2,
      "time": 1649708929,
      "title": "As Remote Work Becomes Permanent, Can Manhattan Adapt?",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/11/nyregion/remote-work-hybrid-manhattan.html"
    },
    {
      "by": "nixass",
      "descendants": 0,
      "id": 30994414,
      "score": 2,
      "time": 1649708726,
      "title": "Apparent software signing issue breaks updates for some Studio Displays",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/04/apparent-software-signing-issue-breaks-updates-for-some-studio-displays/"
    },
    {
      "by": "jyu",
      "descendants": 0,
      "id": 30994384,
      "score": 1,
      "text": "listened to this podcast episode and they mentioned a tool called &quot;yahoo arranger&quot; where someone can use it to scan your email account to know accounts associated with the email. https:&#x2F;&#x2F;darknetdiaries.com&#x2F;episode&#x2F;112&#x2F;<p>Is there something I can use to scan my email account to help sanitize and improve my security?",
      "time": 1649708615,
      "title": "Ask HN: Email Security?",
      "type": "story"
    },
    {
      "by": "chmaynard",
      "descendants": 0,
      "id": 30994302,
      "score": 1,
      "time": 1649708301,
      "title": "Parallel Histories: A Tale of Two Viruses",
      "type": "story",
      "url": "https://inference-review.com/article/parallel-histories#When:12:41:00Z"
    },
    {
      "by": "Claude_Shannon",
      "descendants": 0,
      "id": 30994301,
      "score": 1,
      "time": 1649708293,
      "title": "How to Ask Questions the Smart Way",
      "type": "story",
      "url": "http://www.catb.org/~esr/faqs/smart-questions.html"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 30994293,
      "score": 1,
      "time": 1649708277,
      "title": "Epic Games valued at about $32 bln",
      "type": "story",
      "url": "https://www.reuters.com/technology/epic-games-raises-2-bln-valuation-nearly-32-bln-2022-04-11/"
    }
  ]
}