{
  "stories": [
    {
      "by": "ph0rque",
      "descendants": 0,
      "id": 27979941,
      "score": 1,
      "time": 1627442617,
      "title": "Earth's interior is swallowing up more carbon than thought",
      "type": "story",
      "url": "https://phys.org/news/2021-07-earth-interior-swallowing-carbon-thought.html"
    },
    {
      "by": "typeformer",
      "descendants": 0,
      "id": 27979937,
      "score": 1,
      "text": "The media is not giving citizens the full extent of how bad and unexpected the recent global weather has been. Partially, this is due to the fact that only a handful of dedicated climate scientists were talking about the consequences of severe jet stream disturbance. This is what is know technically as quasi-resonate amplification (QRA) of Rossby waves. Basically, as the warm air from C02 induced global warming moves north to the Artic the jet stream gets very chaotic and you get stalled heat domes, stalled polar vortex&#x27;s, flash flooding and other weather anomalies.<p>This climate chaos is not going to go away and will only get worse each year. There is nothing stopping it from being 120F next year in British Columbia as it was just a few weeks ago this summer.<p>To paint a terrifying picture, we have 90% of the US west in brutal drought and even parts of the US midwest are now in drought conditions. Lake Powell, one of the largest reservoirs in the US southwest is at its lowest point in history. Nearly all the young salmon in northern California&#x27;s Klamath and Sacramento Rivers may perish due to heat stress low water, and disease this year. There are major unprecedented wildfires all over North America, the coldest reaches of Siberia, in Italy, and Spain.<p>Devastating flooding in Colombia, Costa Rica, the US Southwest, huge areas of China, India, Bangladesh, the UK, Germany, the Netherlands, Luxembourg, Belgium, Italy, Switzerland, Indonesia and the Philippines.<p>There is unusual frost in Brazil destroying thousands of acres of food and coffee. There have been videos of giant hail balls the size of tennis balls that have pummeled cars and houses in the UK, Switzerland and Texas.<p>We have passed the tipping point and the chickens have come home to roost...<p>1.5C of average global warming seems like a quaint notion now, strange times are upon us. It could take a larger than WWII mobilization around the globe just to ensure the survival of humanity and that may not be enough. G8 governments should be spending at least 1&#x2F;4 of total yearly GDP to find a solution because as we are clearly seeing that the costs could be so, so much more.",
      "time": 1627442575,
      "title": "It's Not Climate Change It's Climate Changed",
      "type": "story"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 27979935,
      "score": 1,
      "time": 1627442502,
      "title": "DOJ says it's legal to mandate Covid vaccines",
      "type": "story",
      "url": "https://news.yahoo.com/doj-says-legal-mandate-covid-173600309.html"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 27979907,
      "score": 2,
      "time": 1627442172,
      "title": "Millennials don't own fewer cars (2019)",
      "type": "story",
      "url": "https://mitsloan.mit.edu/ideas-made-to-matter/actually-millennials-dont-own-fewer-cars"
    },
    {
      "by": "mattdeitke",
      "descendants": 0,
      "id": 27979906,
      "score": 1,
      "time": 1627442168,
      "title": "Digital People Would Be an Even Bigger Deal",
      "type": "story",
      "url": "https://www.cold-takes.com/how-digital-people-could-change-the-world/#space-expansion"
    },
    {
      "by": "perryizgr8",
      "descendants": 0,
      "id": 27979887,
      "score": 1,
      "time": 1627441905,
      "title": "Personal Holographic Display for $299",
      "type": "story",
      "url": "https://lookingglassfactory.com/portrait"
    },
    {
      "by": "Eric_WVGG",
      "descendants": 0,
      "id": 27979879,
      "score": 2,
      "time": 1627441732,
      "title": "Coding with Character – Monospaced fonts can be playful and fun",
      "type": "story",
      "url": "https://realdougwilson.com/writing/coding-with-character"
    },
    {
      "by": "amsully",
      "descendants": 0,
      "id": 27979878,
      "score": 1,
      "time": 1627441711,
      "title": "Alkemstone: All the Clues",
      "type": "story",
      "url": "https://bluerenga.blog/2021/07/27/alkemstone-all-the-clues"
    },
    {
      "by": "exolymph",
      "descendants": 0,
      "id": 27979864,
      "score": 2,
      "time": 1627441437,
      "title": "Ask a Bartender a Question",
      "type": "story",
      "url": "https://www.datasecretslox.com/index.php/topic,4086.msg135692.html"
    },
    {
      "by": "nanxiaobei",
      "descendants": 1,
      "id": 27979859,
      "kids": [
        27979860
      ],
      "score": 1,
      "time": 1627441359,
      "title": "Flooks v4, auto optimized re-render. The simplest React Hooks state manager",
      "type": "story",
      "url": "https://nanxiaobei.medium.com/flooks-v4-auto-optimize-update-on-demand-the-simplest-react-hooks-state-manager-f5371c634bda"
    }
  ]
}