{
  "stories": [
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 29351802,
      "score": 1,
      "time": 1637945355,
      "title": "The Ancient History of Intelligent Machines",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/the-ancient-history-of-intelligent-machines/"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 29351779,
      "kids": [
        29351797
      ],
      "score": 1,
      "time": 1637945217,
      "title": "Heimer 3.0",
      "type": "story",
      "url": "https://github.com/juzzlin/Heimer/releases/tag/3.0.0"
    },
    {
      "by": "informationslob",
      "descendants": 0,
      "id": 29351771,
      "score": 1,
      "text": "So I am trying to get internet service for my dad. He stays in South Florida. The community he lives in doesn&#x27;t have internet and everyone has to use mobile Hotspot or hubs, internet service through towers as opposed to fiber optics. The area is congested so the internet speed reminds me of dial up. I&#x27;ve talked to the front office and asked what service is provided here, and they said ATT. I call ATT they say Xfinity and ATT are the only ones who provide service to that area but for some reason not the community.  XFINITY says that two other companies own the area, Spectrum and Atlantic Broadband. I go to their websites and they both redirect me to Xfinitys website and have me search there to see if service is available. The Xfinity representative told me Spectrum or Atlantic isn&#x27;t owned by Xfinity, and as I suspected, they aren&#x27;t owned but they clearly work together at least on a level that deals with web coding. So these companies control the area and are also unable to service here, yet right across the street they used to have Xfinity Representatives trying to sell their services in Wal-Mart. Are companies legally lower to do this? Force people onto mobile networks and Hotspots, not allowing high-speed internet?",
      "time": 1637945153,
      "title": "Ask HN: Do you think ISP should be allowed to duopolize a community?",
      "type": "story"
    },
    {
      "by": "henvic",
      "descendants": 0,
      "id": 29351766,
      "score": 2,
      "time": 1637945138,
      "title": "Exiting the Vietnam of Programming: Our Journey in Dropping the ORM (In Golang)",
      "type": "story",
      "url": "https://alanilling.medium.com/exiting-the-vietnam-of-programming-our-journey-in-dropping-the-orm-in-golang-3ce7dff24a0f"
    },
    {
      "by": "jtruk",
      "descendants": 0,
      "id": 29351751,
      "score": 1,
      "time": 1637945086,
      "title": "UK Snow Map (#uksnow)",
      "type": "story",
      "url": "https://uksnowmap.com/"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 29351723,
      "score": 1,
      "time": 1637944856,
      "title": "Log-Structured Protocols in Delos, a platform for control plane databases",
      "type": "story",
      "url": "https://www.micahlerner.com/2021/11/23/log-structured-protocols-in-delos.html"
    },
    {
      "by": "wyrm",
      "descendants": 0,
      "id": 29351690,
      "score": 1,
      "time": 1637944690,
      "title": "Signs You Are Anxious and Don’t Know It",
      "type": "story",
      "url": "https://www.psychologytoday.com/us/blog/pain-rehabilitation/202111/6-signs-you-are-anxious-and-don-t-know-it"
    },
    {
      "by": "wrycoder",
      "descendants": 0,
      "id": 29351676,
      "score": 1,
      "time": 1637944583,
      "title": "What We Know About the New Coronavirus Variant Now Spreading",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-11-26/what-we-know-about-the-new-virus-variant-that-s-rocking-markets"
    },
    {
      "by": "flerovium",
      "descendants": 0,
      "id": 29351674,
      "score": 2,
      "time": 1637944582,
      "title": "Algorithms interviews aren't that bad",
      "type": "story",
      "url": "https://multipad.io/blog/algorithms-interviews-arent-all-bad"
    },
    {
      "by": "notpachet",
      "descendants": 2,
      "id": 29351635,
      "kids": [
        29351709,
        29351795
      ],
      "score": 7,
      "text": "A friend and I were discussing what it is about HN that maintains such a grip on our attention, and I realized something which is probably obvious to a lot of you: I often spend just as much time reading through and digesting the comments here as I do the original posts. It isn&#x27;t uncommon for me to learn way more about the subject matter from comments than from the post itself.<p>Are there other communities, online or off, with a similar balance between the quality of the original source material (whatever that means in context) and the responses to it? For example: an online forum dedicated to an esoteric interest; a book club or writing group; your local bicycle repair shop; etc.<p>(A lot of workplaces probably exhibit this balance, but let&#x27;s leave them out of the definition of &quot;communities&quot; for the purposes of this post.)",
      "time": 1637944324,
      "title": "Ask HN: Other communities with responses as good as the submissions?",
      "type": "story"
    }
  ]
}