{
  "stories": [
    {
      "by": "r_singh",
      "descendants": 2,
      "id": 27929150,
      "kids": [
        27929190,
        27929184
      ],
      "score": 5,
      "time": 1627036351,
      "title": "BirdNet – The Easiest Way to Identify Birds by Sound",
      "type": "story",
      "url": "https://birdnet.cornell.edu"
    },
    {
      "by": "sjreese",
      "descendants": 0,
      "id": 27929145,
      "score": 1,
      "time": 1627036305,
      "title": "Natto extract blocks coronavirus infection in lab tests; efficacy in food form?",
      "type": "story",
      "url": "https://mainichi.jp/english/articles/20210722/p2a/00m/0sc/022000c"
    },
    {
      "by": "l31g",
      "descendants": 0,
      "id": 27929091,
      "score": 12,
      "time": 1627035745,
      "title": "Apple to Pull 'iDOS 2' DOS Emulator from App Store",
      "type": "story",
      "url": "https://www.macrumors.com/2021/07/22/apple-to-pill-idos-2-emulator-from-app-store/"
    },
    {
      "by": "revolucien",
      "descendants": 0,
      "id": 27929084,
      "score": 3,
      "time": 1627035648,
      "title": "Babies Switched at Birth",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Babies_switched_at_birth"
    },
    {
      "by": "suprfnk",
      "descendants": 0,
      "id": 27929075,
      "score": 3,
      "time": 1627035554,
      "title": "It's so hot in Dubai that the government is artificially creating rainstorms",
      "type": "story",
      "url": "https://www.cbsnews.com/news/dubai-uae-government-creating-rain-drones-cloud-seeding/"
    },
    {
      "by": "alex313",
      "descendants": 0,
      "id": 27929053,
      "score": 2,
      "time": 1627035339,
      "title": "Support over 36 programming languages running and code snippets",
      "type": "story",
      "url": "https://kunming.io/blog/post/14/support-over-36-programming-languages-running-and-code-snippets"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 27929031,
      "score": 2,
      "time": 1627034989,
      "title": "OsmAnd 4.0 (iOS)",
      "type": "story",
      "url": "https://osmand.net/blog/osmand-ios-4-0-released"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 27929009,
      "score": 4,
      "time": 1627034644,
      "title": "A friendly introduction to linear algebra for ML",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LlKAna21fLE"
    },
    {
      "by": "SimRen",
      "descendants": 0,
      "id": 27928985,
      "score": 2,
      "time": 1627034373,
      "title": "MPC with Gaussian processes for data-efficient reinforcement learning",
      "type": "story",
      "url": "https://github.com/SimonRennotte/Data-Efficient-Reinforcement-Learning-with-Probabilistic-Model-Predictive-Control"
    },
    {
      "by": "MathieuSneep",
      "descendants": 0,
      "id": 27928966,
      "score": 3,
      "text": "Hey HN! We’re Guido, Jeroen and Mathieu, the founders of Tablevibe.co!<p>Tablevibe enables restaurants to capture customer feedback and incentivise direct reorders via QR codes on food boxes and bill folders.<p>Restaurants and Cloud Kitchens increasingly rely on delivery and booking apps which demand a revenue share of up to 40%. It’s uber expensive (pun intended). Many of these apps don’t share customer data. This results in two fundamental problems. First, restaurateurs often don’t know who their customers are and what they experience. Second, profits are decimated.<p>About 1.5 years ago we spotted paper feedback forms in our neighbourhood restaurants. Almost no one used them. If customers did, restaurant staff spent ~10 mins entering feedback into a spreadsheet. Meanwhile, people shared negative feedback directly online. Restaurateurs said it was painful. We set out on a mission to fix this.<p>We got 3 restaurant owners to pilot our MVP. They added a QR code to their bill folders, which directed to a Google Form survey. We used Google Data Studio to share customer feedback with the owners. To boost response rates, we offered customers a $5 discount on their next visit. Restaurateurs loved it. They got a 20% response rate, actionable performance insights and way more repeat business.<p>This laid the foundation for Tablevibe.co. Over time, we added two unique features: First, we encourage positive customers to share their 5-star rating on Google. With anger being a more powerful emotion than love, this brings back some balance to online reviews.<p>Second, restaurants became far more delivery-dependent, so we added delivery surveys (QR code printed on food boxes) with an incentive to reorder directly from the restaurant. This save up to 40% in commission fees for restaurants and cloud kitchens.<p>To date, we captured over 120,000 customer insights and drove thousands of Google reviews + direct orders for our partners. Our vision is to develop the #1 customer relationship management platform for restaurants. Stay tuned!<p>We&#x27;re a young business and we&#x27;d love to learn from you. Thanks in advance for your ideas, suggestions and feedback!<p>Best,<p>Jeroen, Guido and Mathieu",
      "time": 1627034136,
      "title": "Show HN: Tablevibe (YC S21) – Restaurant surveys which drive direct sales",
      "type": "story"
    }
  ]
}