{
  "stories": [
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 28390442,
      "score": 1,
      "time": 1630578833,
      "title": "Steganography with Clojure – Hiding Text in Images",
      "type": "story",
      "url": "https://nakkaya.com/2010/03/23/steganography-with-clojure-hiding-text-in-images/"
    },
    {
      "by": "seinecle",
      "descendants": 0,
      "id": 28390441,
      "score": 1,
      "time": 1630578818,
      "title": "The Long Game",
      "type": "story",
      "url": "https://nocodefunctions.com/blog/long-game/"
    },
    {
      "by": "artsy",
      "descendants": 0,
      "id": 28390434,
      "score": 1,
      "text": "In the next few months, I’ll be starting a new company after a long wait. The product we are building is technology-enabled and is targeted at a professionals within a specific industry. The product idea is not a secret as we’ve interviewed and surveyed members of this profession&#x2F;industry extensively. The product will be an application on the web and on mobile.<p>We know how much this will assist them in their day to day work and the technical requirements of such a system do not require any new technology beyond what many apps already utilise. The price point that many people termed as ‘easily affordable’ on our surveys will hopefully allow us stay profitable and make our product accessible to even new entrants to the profession and students. This assumption will remain true even if only 10% become paying customers. Our ability to keep it that low will be re-assessed after hiring decisions and technology requirements have been ascertained.<p>We do not intend to use third party analytics or include any kind of advertising, and will not be selling user data for any reason.<p>I have been in the industry for 15 years and have extensive personal experience of the job we do and how such a product would cut down on time wasted while improving efficiency and productivity.<p>While I am not a technical person, I did spend some time learning and do understand some basics about UI &amp; UX design, software architecture and software development life cycle. The limit of my technical education was HTML, CSS and JavaScript that I’m not entirely proficient with.<p>I want our product to be easily maintainable, reliable, scalable and fast. I don’t want to have a small set of early employees who know everything and then any new people would struggle to understand what they did after they’re gone especially if they leave abruptly. I don’t want code that is difficult for a colleague or subsequent employee to update and improve. I don’t want a product that’s slow and frustrating to end users. I don’t want a product that requires too much education for a basic non-techie person to use comfortably. I also don’t want a structure that doesn’t scale as users grow beyond the small subset we are beginning with since the product may be relevant to other industries beyond the initial one I am focused on.<p>Our budget is significant but not open ended so I also want to have all of these expectations met as reasonably as possible.<p>I have several advisers and one is a CTO at a major tech company and he would be helping me with the hiring process for the engineers. I will not be sitting through those conversations mindlessly or just nodding along so I want to know what questions I should ask and what aspects of our relationship need definition so that these expectations are met and I’m not at risk of dealing with the same problems I’m actively trying to avoid or requiring a full-rebuild after a short while.<p>We are building an app for iOS and android and the web portal will allow users manage their accounts&#x2F;payments and also allow for admin access to continually update the app’s content.",
      "time": 1630578693,
      "title": "Ask HN: Need Advice before hiring engineers for new startup as a non-tech person",
      "type": "story"
    },
    {
      "by": "ciconia",
      "descendants": 0,
      "id": 28390430,
      "score": 1,
      "time": 1630578632,
      "title": "I Write Code: Pen and Paper",
      "type": "story",
      "url": "https://noteflakes.com/articles/2021-09-02-how-i-write-code-pen-paper"
    },
    {
      "by": "luccams",
      "descendants": 0,
      "id": 28390429,
      "score": 2,
      "time": 1630578616,
      "title": "Scramjet Transform Hub – new data processing engine for Node.js applications",
      "type": "story",
      "url": "https://github.com/scramjetorg/scramjet-cloud-docs"
    },
    {
      "by": "sovushka",
      "descendants": 0,
      "id": 28390418,
      "score": 1,
      "time": 1630578471,
      "title": "Is Aluminum Regaining Popularity Among EV Makers?",
      "type": "story",
      "url": "https://pse.is/3m6gms"
    },
    {
      "by": "daniaal",
      "descendants": 0,
      "id": 28390415,
      "score": 1,
      "time": 1630578454,
      "title": "Deploying Ghost to Azure Linux app service MySQL sendgrid MySQL Azure storage",
      "type": "story",
      "url": "https://daniaal.com/deploying-ghost-blog-to-azure-linux-app-service-mysql-sendgrid-mysql-azure-storage/"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28390401,
      "score": 1,
      "time": 1630578273,
      "title": "Multi-blockchain smart contract monitoring and alerting service",
      "type": "story",
      "url": "https://tenderly.co/"
    },
    {
      "by": "ericdanielski",
      "descendants": 0,
      "id": 28390396,
      "score": 1,
      "time": 1630578209,
      "title": "Nuclear energy is key in fight for climate",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/aug/31/nuclear-energy-is-key-in-fight-for-climate"
    },
    {
      "by": "dkljsfzsx",
      "descendants": 0,
      "id": 28390385,
      "kids": [
        28390386
      ],
      "score": 1,
      "time": 1630578050,
      "title": "Level Goods CBD Gummies Safe to Utilize",
      "type": "story",
      "url": "https://sites.google.com/view/levelgoodscbdgummiesorder/"
    }
  ]
}