{
  "stories": [
    {
      "by": "mesofile",
      "descendants": 0,
      "id": 31155566,
      "score": 1,
      "time": 1650897815,
      "title": "GM boss confirms hybrid Corvette due in 2023",
      "type": "story",
      "url": "https://arstechnica.com/cars/2022/04/gm-boss-confirms-hybrid-corvette-due-in-2023/"
    },
    {
      "by": "whit537",
      "descendants": 0,
      "id": 31155555,
      "score": 1,
      "time": 1650897779,
      "title": "The Spotify FOSS Fund",
      "type": "story",
      "url": "https://engineering.atspotify.com/2022/04/announcing-the-spotify-foss-fund/"
    },
    {
      "by": "icecrime",
      "descendants": 0,
      "id": 31155542,
      "score": 1,
      "text": "Hi HN! I’m Arnaud, founder of Echoes HQ (<a href=\"https:&#x2F;&#x2F;echoeshq.com\" rel=\"nofollow\">https:&#x2F;&#x2F;echoeshq.com</a>). Echoes lets you connect engineering work to its intent directly from your product development tools, and uses this information to create activity reports that focus on the purpose of engineering work.<p>I&#x27;ve been an engineering manager for over a decade, and I know how hard it is to navigate the chaos of product development. Engineering management requires data — to inform decisions on priorities and hiring, and to communicate activity to our partners in other functions. But how software development insights are collected and used today is at odds with the developer’s experience. The data is typically gathered by enforcing heavyweight, one-size-fits-all processes, such as manual timesheets or mandatory tickets for every commit. Its use can easily turn into individual surveillance and misguided performance management. Indicators focused on efficiency of the development process alone perpetuate an outdated view of engineering as a &quot;feature factory&quot;. For all these reasons, we created Echoes. Echoes provides engineering organizations with the data they need to succeed, without compromising the developer experience.<p>Many existing solutions collect data from GitHub and issue trackers to produce insights, but Echoes differs in important ways:<p>* We care about the purpose of engineering efforts over the efficiency of the development process. Purpose is defined in Echoes a the set of outcomes your are pursuing as an organization (e.g., reducing the onboarding time for your users) and the initiatives aiming to influence these outcomes (e.g., a templating feature). Echoes publishes this configuration to your development tools of choice (e.g., as repository labels on GitHub, as a custom issue field in JIRA, or labels in Linear) and allows to tag day-to-day efforts with their intent, consistently throughout the organization. Echoes’ focus on purpose makes the reports understandable beyond engineering, and shifts the conversation away from engineering productivity to the collective prioritization choices.<p>* We strive to answer engineering managers needs without compromising on developer experience, in its broadest sense. We believe that builders should pick the tools and workflows which make them most productive and that management needs should accommodate for that, not the other way around. Echoes’ contract is that engineering efforts be tagged with their intent, but leaves tooling and workflow choices to each team. The resulting reports are team-centric and never about the individuals.<p>Check out our website (<a href=\"https:&#x2F;&#x2F;echoeshq.com\" rel=\"nofollow\">https:&#x2F;&#x2F;echoeshq.com</a>) and introductory video (<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Y2ochIr4obw#t=58s\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Y2ochIr4obw#t=58s</a>) to learn more. We offer free trials (no credit card required) if you’d like to give it a try.<p>We look forward to hearing your feedback and answering your questions. Many thanks!",
      "time": 1650897734,
      "title": "Launch HN: Echoes HQ (YC S21) – Developer-friendly activity reports",
      "type": "story"
    },
    {
      "by": "Anon84",
      "descendants": 0,
      "id": 31155527,
      "score": 1,
      "time": 1650897679,
      "title": "Can brain scans reveal behaviour? Bombshell study says not yet",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-00767-3"
    },
    {
      "by": "o-",
      "descendants": 0,
      "id": 31155489,
      "score": 1,
      "time": 1650897563,
      "title": "Abcdesktop – a cloud native desktopless system",
      "type": "story",
      "url": "https://www.abcdesktop.io/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31155473,
      "score": 1,
      "time": 1650897476,
      "title": "New and surprising duality found in theoretical particle physics",
      "type": "story",
      "url": "https://phys.org/news/2022-04-duality-theoretical-particle-physics.html"
    },
    {
      "by": "doppp",
      "descendants": 0,
      "id": 31155470,
      "score": 1,
      "time": 1650897470,
      "title": "Epic Games Invests in M-XR",
      "type": "story",
      "url": "https://www.m-xr.com/blog/epic-games-invests-in-m-xr/"
    },
    {
      "by": "madmulita",
      "descendants": 0,
      "id": 31155467,
      "score": 1,
      "time": 1650897465,
      "title": "Making Lambda Island Free",
      "type": "story",
      "url": "https://lambdaisland.com/blog/2022-04-25-making-lambda-island-free"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31155456,
      "score": 2,
      "time": 1650897425,
      "title": "Tape storage is anything but dead, it's going from strength to strength",
      "type": "story",
      "url": "https://www.techradar.com/news/tape-storage-is-anything-but-dead-its-going-from-strength-to-strength"
    },
    {
      "by": "dizainlv",
      "descendants": 0,
      "id": 31155437,
      "score": 1,
      "time": 1650897358,
      "title": "2022 IIHF Ice Hockey World Championships",
      "type": "story",
      "url": "https://en.pribalt.info/world-championship"
    }
  ]
}