{
  "stories": [
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29706647,
      "score": 1,
      "time": 1640638327,
      "title": "Richard Marcinko, Founding Commander of Seal Team 6, Dies at 81",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/27/us/richard-marcinko-dead.html"
    },
    {
      "by": "kamrau",
      "descendants": 0,
      "id": 29706639,
      "score": 1,
      "time": 1640638300,
      "title": "Iptv Replacement",
      "type": "story",
      "url": "http://jackal.surge.sh"
    },
    {
      "by": "purplesnowflake",
      "descendants": 0,
      "id": 29706636,
      "score": 1,
      "time": 1640638294,
      "title": "The Biggest Crypto-Heists of 2021",
      "type": "story",
      "url": "https://gizmodo.com/6-of-the-biggest-crypto-heists-of-2021-1848262016"
    },
    {
      "by": "purplesnowflake",
      "descendants": 0,
      "id": 29706628,
      "score": 2,
      "time": 1640638244,
      "title": "Russia Blocks Privacy Service Tor in Latest Move to Control Internet",
      "type": "story",
      "url": "https://www.rferl.org/a/russia-blocks-tor-internet/31599622.html"
    },
    {
      "by": "ebenh",
      "descendants": 0,
      "id": 29706615,
      "score": 1,
      "time": 1640638133,
      "title": "Recursive Algorithms for Ethiopic Numerals",
      "type": "story",
      "url": "https://blog.derso.org/recursive-algorithms-for-geez-numerals/"
    },
    {
      "by": "pookietuesdays",
      "descendants": 0,
      "id": 29706613,
      "score": 3,
      "text": "I am 28 and a third-year medical student with a minor in CS from undergrad (biology major). I like medicine but I really don&#x27;t feel it&#x27;s my calling.<p>I do however enjoy software engineering but admittedly, I have never done it outside of my own hobbies, which it&#x27;s been many years since I&#x27;ve coded. Therefore, I don&#x27;t know if I would love it because doing it as a career is much different than toying around on things I&#x27;m interested in. I&#x27;m really interested in backend  &amp; API engineering and building scalable systems, things like applications that support huge loads and concurrency and learning that at large organizations and then eventually helping a  startup scale up as an early engineer.<p>I was interested in software engineering as a career (and finishing with a CS degree with the CS credits I&#x27;ve completed from undergrad), but as Paul Graham most famously said not to hire engineers over 30.<p>While that, as an absolute, may be BS, I do have a lurking fear that I&#x27;ll never fit in at this stage in my life.<p>From software engineers I&#x27;ve asked there seems to be an implicit agreement that ageism is very real against older developers. I am also worried because if I get started at this point, I would be way behind people who started right out of college and I&#x27;d be in my 40s by the time I could catch up financially.<p>I am also worried about employability after 40, when almost everyone will be significantly younger than me, and then being laid off and afterwards finding it very difficult to find a job.<p>So while I understand I can get a job in the near future, I am terrified of long-term prospects. For context, I really don&#x27;t have any money saved and am in debt because of school loans.<p>I feel as if I&#x27;ve already too deep in the hole and that I should just only do programming after my residency is over. I am not happy at all, but changing careers also has to make financial sense and if I am going to be discriminated against just because of my age then I don&#x27;t think it is worth it.<p>Many people have told me &quot;do what your heart wants&quot; but they don&#x27;t wake up with my debt.<p>Would love your opinions!",
      "time": 1640638109,
      "title": "At what age is “too old” to work in tech as a software engineer?",
      "type": "story"
    },
    {
      "by": "metalised",
      "descendants": 0,
      "id": 29706571,
      "score": 2,
      "text": "I have been the owner of a facebook page [0], which I created more than 10 years ago, and has built into a nice community (focused around heavy metal) in that time. It is the sister page of the website https:&#x2F;&#x2F;metalised.wordpress.com&#x2F;. The biggest feature of this site and facebook page are the end-of-year metal reviews, which have been very popular, and have been often re-shared on facebook by the featured bands with a lot of gratitude.<p>Recently, someone hacked the page somehow, and managed to make themselves the owner of the page. They also created a business account, and gave it full admin access.<p>For some reason they either couldn&#x27;t or simply didn&#x27;t kick me out completely before updating my passwords, and I still have some editing&#x2F;posting privileges, but I cannot kick out the new owner or admin, and I have no idea what they&#x27;re going to do with this power. As far as I know, they can delete the page, or start spamming&#x2F;scamming my community any moment now.<p>I have been going through facebook&#x27;s official pages and reporting processes for about a month now, but there has been zero response, and facebook makes it impossible to talk to a human. Furthermore, the &quot;I&#x27;ve been hacked&quot; page [1] only deals with personal accounts, not pages; there is no option on recovering ownership of stolen pages. In fact, their only suggested solution, here [2], seems to be &quot;Ask the new owner to give you back access&quot;. Are they serious???<p>Has anyone here had any similar experiences and a solution to this problem? I saw someone here the other day suggest &quot;buying an Oculus&quot; in order to get help with a personal account, but I don&#x27;t see that working for page ownership, since my account is technically fine. I find it very difficult to believe that a community of 57k metalheads can disappear in an instant like this (or worse, be used for scams) and there&#x27;s not a single person at Facebook I can email about it!<p>[0] https:&#x2F;&#x2F;www.facebook.com&#x2F;metalised.net&#x2F;\n[1] facebook.com&#x2F;hacked\n[2] https:&#x2F;&#x2F;www.facebook.com&#x2F;help&#x2F;738660629556925",
      "time": 1640637830,
      "title": "Facebook makes it impossible to regain ownership of a hacked page",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 29706558,
      "score": 1,
      "time": 1640637748,
      "title": "AQB: A Basic Compiler and IDE for Amiga Computers",
      "type": "story",
      "url": "https://github.com/gooofy/aqb"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 29706542,
      "score": 1,
      "time": 1640637597,
      "title": "Flight ST37 successfully placed 36 more OneWeb satellites into orbit",
      "type": "story",
      "url": "https://www.arianespace.com/press-release/flight-st37-the-15th-operated-by-arianespace-in-2021-sucessfully-placed-36-more-oneweb-satellites-into-orbit/"
    },
    {
      "by": "ScottyFillups",
      "descendants": 0,
      "id": 29706533,
      "score": 2,
      "text": "Sometimes I want to create a short 10 second video showcasing a feature to share social media and in the product (e.g. in-app release notes).<p>What is everyone using in 2021? :)",
      "time": 1640637530,
      "title": "Ask HN: How do you produce product/feature demo videos?",
      "type": "story"
    }
  ]
}