{
  "stories": [
    {
      "by": "kith",
      "descendants": 0,
      "id": 31653290,
      "score": 2,
      "time": 1654605452,
      "title": "Show HN: Resize Your Images in Bulk",
      "type": "story",
      "url": "https://sizematters.app/"
    },
    {
      "by": "sgt",
      "descendants": 0,
      "id": 31653286,
      "score": 1,
      "time": 1654605409,
      "title": "Tell HN: Facebook Is Down",
      "type": "story"
    },
    {
      "by": "occamschainsaw",
      "descendants": 0,
      "id": 31653283,
      "score": 1,
      "time": 1654605389,
      "title": "China’s Top Influencer Is Cancelled over a Piece of Cake",
      "type": "story",
      "url": "https://www.vice.com/en/article/k7be7e/china-influencer-tiananmen-square-lipstick-king"
    },
    {
      "by": "yuvadam",
      "descendants": 0,
      "id": 31653271,
      "score": 1,
      "time": 1654605301,
      "title": "Letter in Support of Responsible Crypto Policy",
      "type": "story",
      "url": "https://www.financialinclusion.tech/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 31653267,
      "score": 1,
      "time": 1654605287,
      "title": "Venture Capital Internal Rates of Return",
      "type": "story",
      "url": "https://vcirr.com"
    },
    {
      "by": "magneticmonkey",
      "descendants": 0,
      "id": 31653250,
      "score": 1,
      "time": 1654605181,
      "title": "Refilling the non-refillable Miele AutoDos Dishwasher",
      "type": "story",
      "url": "https://mcuoneclipse.com/2022/06/04/refilling-the-non-refillable-miele-autodos-dishwasher-automatic-detergent-dispensing-disks/"
    },
    {
      "by": "booteille",
      "descendants": 1,
      "id": 31653242,
      "kids": [
        31653252
      ],
      "score": 1,
      "time": 1654605120,
      "title": "PeerTube v4.2 Is Out",
      "type": "story",
      "url": "https://joinpeertube.org/en_US/news#release-4.2"
    },
    {
      "by": "CupofChineseTea",
      "descendants": 0,
      "id": 31653236,
      "score": 2,
      "time": 1654605099,
      "title": "Using a 1930 Teletype as a Linux Terminal",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2XLZ4Z8LpEE"
    },
    {
      "by": "de_or_ca",
      "descendants": 0,
      "id": 31653233,
      "score": 1,
      "text": "I&#x27;m at a crossroads in my life. My wife and I are trying to figure out if we should move back to California or move to Germany to be closer to her parents.<p>A bit of background: We&#x27;re in our mid-30s. Both in tech. I&#x27;m a software engineer. She&#x27;s a product manager. I&#x27;m American and she&#x27;s German. We met in SF in 2014 and left together in 2017. We traveled for a while, then moved to Amsterdam where we live now. We have a 1 year old daughter with another on the way in October. We don&#x27;t plan on having more kids after that. We&#x27;d like to leave the Netherlands soon, but haven&#x27;t decided yet if we should move back to California or move close to her parents in Germany.<p>There&#x27;s tons of variables to consider, but the 2 main ones I&#x27;m focused on right now is the tradeoff between family support vs career prospects. In short: if we move to Bavaria, my wife&#x27;s parents would be a huge help with our kids. They&#x27;re natural and eager grandparents and they&#x27;re great with our daughter. But, they live in a small village in Bavaria. If we moved to Germany, I assume we&#x27;d want to be close to them, so we&#x27;d end up in a similarly small village near them.<p>My family is scattered around CA and NY and, while it&#x27;d be nice to be closer to them, I don&#x27;t think we&#x27;d get nearly the same kind of natural support network from them. If we did move to CA though, I assume we&#x27;d move closer to either my Dad (down in San Diego) or my Mom (around Sacramento).<p>On the career side, I&#x27;m assuming our career options and pay would be a lot higher in CA. I work as a senior eng at a large tech company and based on levels.fyi, it looks like my SF colleagues make somewhere between 2 and 4 times what I do. I know money isn&#x27;t everything, but I&#x27;ve experienced the pain and stress that not having enough causes. I see it with all my family members now. Since moving to the Netherlands, I haven&#x27;t been able to save or invest nearly as much as I could back in CA. Maybe it&#x27;s the American in me, or a vestige from my childhood, but I feel uneasy not building more wealth. Money smooths everything over - from relationships, to the options you have available, to the time you can buy with it. But, that additional pay would come at the expense of being more on our own raising our kids, which adds another set of stressors and difficulties. Additionally, for the sake of our kids, we think it&#x27;d be good for them to have more involved relatives.<p>Any SWE parents out there who have insights? How hard is it raising kids in CA if you have limited family support? What&#x27;s your quality of life in CA as a parent? Does cost of living eat up all the additional money I assume we could make? We&#x27;d eventually like to buy a house, but the markets seem so crazy that even with the pay raises I wonder if we could swing it.<p>What about quality of life and career prospects in Germany? Anyone living there have any insights? Since we&#x27;d be looking at being closer to my wife&#x27;s parents, I think we&#x27;d need to find remote work, so that would also be a limiting factor. I&#x27;m assuming we couldn&#x27;t build as much individual wealth, but perhaps the services of the state compensate enough for that and I should let go of that obsession?",
      "time": 1654605093,
      "title": "Ask HN: Should I move to California or Germany as a SWE with 2 small kids?",
      "type": "story"
    },
    {
      "by": "aroccoli",
      "descendants": 0,
      "id": 31653232,
      "score": 1,
      "time": 1654605092,
      "title": "Haskell in Production: Haskoin",
      "type": "story",
      "url": "https://serokell.io/blog/haskell-in-production-haskoin"
    }
  ]
}