{
  "stories": [
    {
      "by": "tuyguntn",
      "descendants": 0,
      "id": 31222521,
      "score": 1,
      "text": "full disclosure: based on my previous comments, people think I am a troll or Putin propaganda, I don&#x27;t care! Truth should be told anyway. I am a European and directly feeling the impact.<p>It is becoming obvious that war in Ukraine is a proxy war between US&#x2F;west and Russia.<p>Who is suffering:<p>* Ukrainian people! millions of civilians! Some of whom might never see their homes again.<p>* Europeans (except politicians). I am feeling substantial price hikes, as an engineer with slightly above the market pay I can cope with it, imagine how it impacts others<p>* Other developing countries. Don&#x27;t have a direct network in Africa, but pretty sure food security in some of African and Middle Eastern poor countries will be severely impacted. We are not talking about price increase, we are talking about people are starving and dying because no food!<p>* Russian civilians, in the form of sanctions. I don&#x27;t think ordinary people deserve it.<p>* US civilians. Money which is sent to support war could be used to support people in the US, we all remember 2T$ spent by US government in Afghanistan which could go to citizen. US has awful medical support comparing to EU countries.<p>Who is benefiting:<p>* US government. by leasing weapons to make Ukraine more dependent in the long term. By creating Disinformation Governance Board which is basically censoring people with the excuse of fighting &quot;Russian propaganda&quot;<p>* Gun makers. Germany increased military spending to 100B$, others could also follow soon, take in mind NATO countries should have similar equipment, they can buy so much weapon mostly from US.<p>Who else?<p>Say whatever you want, but this war is provoked war and everyone is impacted negatively, except US government",
      "time": 1651383896,
      "title": "Tell HN: Ukraine war is just a proxy war between US and Russia",
      "type": "story"
    },
    {
      "by": "beanlog",
      "descendants": 0,
      "id": 31222506,
      "score": 1,
      "time": 1651383680,
      "title": "I accidentally loaned all my money to the government",
      "type": "story",
      "url": "https://beanlog.vercel.app/ibonds"
    },
    {
      "by": "Sincere",
      "descendants": 0,
      "id": 31222496,
      "score": 1,
      "time": 1651383515,
      "title": "Ask HN: What were software engineering job interviews like decades ago?",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31222494,
      "score": 1,
      "time": 1651383510,
      "title": "VFIT – Variable Font Instancing Tool",
      "type": "story",
      "url": "https://github.com/jonpalmisc/vfit"
    },
    {
      "by": "rdegges",
      "descendants": 0,
      "id": 31222490,
      "score": 1,
      "time": 1651383441,
      "title": "Terminal Multiplexers Are Hacks (2020)",
      "type": "story",
      "url": "https://github.com/kovidgoyal/kitty/issues/391"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 31222486,
      "score": 1,
      "time": 1651383395,
      "title": "Red Panda",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Red_panda"
    },
    {
      "by": "tech-sucker",
      "descendants": 0,
      "id": 31222482,
      "score": 1,
      "time": 1651383332,
      "title": "Bloomberg Open-Sources Memray: A Memory Profiler in Python Code",
      "type": "story",
      "url": "https://www.marktechpost.com/2022/04/30/bloomberg-open-sources-memray-a-memory-profiler-that-can-track-memory-allocations-in-python-code-in-native-extension-modules-and-python-interpreter/"
    },
    {
      "by": "lettergram",
      "descendants": 0,
      "id": 31222476,
      "score": 1,
      "time": 1651383280,
      "title": "Handbook of Biomass Downdraft Gasifier Engine Systems (1988) [pdf]",
      "type": "story",
      "url": "https://www.nrel.gov/docs/legosti/old/3022.pdf"
    },
    {
      "by": "Pranav2612000",
      "descendants": 0,
      "id": 31222472,
      "score": 1,
      "text": "I am the founding team member of a small startup. I was thinking about using Linear as our project management tool. The UI&#x2F;UX is amazing and I&#x27;ve heard great things about it which makes me want to try it out even more.\nThe problem is, since we are a very early stage startup, I don&#x27;t think we&#x27;ll be able to afford Linear for maybe the next 3 months or so ( India based so the USD to INR conversion makes it worse ). I can see linear has a very generous plan but the things I am worried about is the 250 issue limit, and the 150 MB file upload limit. \nIs anyone using Linear Free tier one and have you faced any crucial issues with using it?",
      "time": 1651383256,
      "title": "Linear App Project Management Tool Free Tier",
      "type": "story"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 31222458,
      "score": 2,
      "time": 1651383043,
      "title": "Russia Is Being Hacked at an Unprecedented Scale",
      "type": "story",
      "url": "https://www.wired.com/story/russia-hacked-attacks/"
    }
  ]
}