{
  "stories": [
    {
      "by": "davesailer",
      "descendants": 0,
      "id": 27832549,
      "score": 1,
      "time": 1626267835,
      "title": "How to Improve Your Digital Life with BJ Fogg",
      "type": "story",
      "url": "https://www.fastmail.com/digitalcitizen/how-to-improve-your-digital-life-with-bj-fogg/"
    },
    {
      "by": "melenaboija",
      "descendants": 0,
      "id": 27832545,
      "score": 1,
      "time": 1626267794,
      "title": "EU proposes effective ban on new fossil-fuel car sales from 2035",
      "type": "story",
      "url": "https://www.reuters.com/business/retail-consumer/eu-proposes-effective-ban-new-fossil-fuel-car-sales-2035-2021-07-14/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27832532,
      "score": 1,
      "time": 1626267704,
      "title": "Apple deploys $1B in affordable housing support across California",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2021/07/apple-deploys-1-billion-in-affordable-housing-support-across-california/"
    },
    {
      "by": "marleonid",
      "descendants": 0,
      "id": 27832531,
      "score": 1,
      "text": "Hi HN,<p>I really into NFT and believe that it can be a perfect fit for mass adoption in the future. If you&#x27;re an NFT creator or collector let&#x27;s talk!<p>Just imagine people can collect NFT&#x27;s to own a little piece of the internet while it belongs to all internet users. Having a piece of the internet that&#x27;s fundamentally yours — something that you think is beautiful and unique and special — is not something we’ve been able to do until now. Or you can support your favorite artist, brand, or community by collecting their NFT&#x27;s.<p>Right now I see several problems:<p>1. It is hard to create, sell or buy an NFT because of the poor UX of crypto billings. You need to set up your wallet, buy some crypto, spent it on gas and etc. This problem is similar for both creators and NFT collectors. I see it&#x27;s as a bottleneck for mass adoption. Maybe it is needed to create a simple payment system that connects your credit card with crypto so you can buy NFT just like you buy any other stuff on Amazon. Something like Stripe for NFT.<p>2. There&#x27;s a lot of competition between creators on popular marketplaces. Most talented creators need to promote themselves and learn how to sell, while they want just to create a new type of art.<p>3. There&#x27;s no place to show your NFT collection. When in the offline world we can go to galleries or museums, online we only have marketplaces like OpenSea and Rarible.<p>If you&#x27;re an NFT creator, collector or just interested in it let&#x27;s talk to find out what we can do with that!",
      "time": 1626267698,
      "title": "Ask HN: Help me find out what problems NFT creators and collectors have?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 27832527,
      "score": 1,
      "time": 1626267639,
      "title": "Rockley Photonics Unveils Health Tracking Tech Likely to Come to Apple Watch",
      "type": "story",
      "url": "https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/"
    },
    {
      "by": "starkd",
      "descendants": 0,
      "id": 27832526,
      "score": 1,
      "time": 1626267638,
      "title": "Which Came First: Low Testosterone Levels or Severe Covid-19?",
      "type": "story",
      "url": "https://www.medpagetoday.com/meetingcoverage/additionalmeetings/93534"
    },
    {
      "by": "hheikinh",
      "descendants": 0,
      "id": 27832517,
      "score": 1,
      "time": 1626267575,
      "title": "The European Green Deal",
      "type": "story",
      "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_21_3541"
    },
    {
      "by": "BigBalli",
      "descendants": 0,
      "id": 27832514,
      "score": 1,
      "time": 1626267553,
      "title": "Italy bans cruiseships from Venice, after years of hesitation",
      "type": "story",
      "url": "https://cruiseable.com"
    },
    {
      "by": "merijndewit",
      "descendants": 0,
      "id": 27832493,
      "score": 1,
      "text": "Hey, I am Merijn! I am currently making a project called Office Portal for my internship.\nI am currently doing the study software developer (2nd year). I am still a beginner in writing code so contributors are welcome on the GitHub page!<p>In these times of covid people usually work in separate rooms to prevent the spreading of the virus. When your colleagues are working in separate rooms the office can feel very lonely. So we came up with the idea “Office Portal” and make the project accessible for everyone on GitHub. Office Portal is inspired by the game Portal from Valve. With this project, we are creating 2 portals using a raspberry pi, television, and a camera module.\nthen hang both portals in 2 separate rooms and you will be able to see the other room “through” the portal. With this project, we hope to bring your colleagues a bit closer and make your office feel a bit less lonely.<p>I’ve written the instructions step by step so everyone even with little experience with a Raspberry pi can follow them.<p>All the instructions and necessary code to make this project are available on GitHub:\nhttp:&#x2F;&#x2F;github.com&#x2F;merijndewit&#x2F;Office_Portal<p>All the instructions for making your own Office Portal are written there from hardware to software. For the software, I made a GUI to make everything a bit easier. This program will help you install all the necessary dependencies and help you setting up the stream. It also has a few extra features: use an led strip or digital portal mast to make it look more like a portal. \nFor the hardware I’ve written in detail what you need and where you need to look out for when buying parts, and how to install everything to make an awesome portal!\nI’ve tested the program a lot and I was able to stream at a resolution of 1080p with a delay of around 400ms while receiving a stream from another raspberry pi.<p>I’ve Had a lot of fun making this project. One of the biggest challenges was streaming the video of the camera and receiving the video from the other pi in decent quality and low delay due to hardware limitations. Luckily I’ve found a way to do it with omxplayer and GStreamer. \nIf you just want to stream video from one pi to another without using the python program (doing everything manually) then follow the instructions on this readme:\nhttp:&#x2F;&#x2F;github.com&#x2F;merijndewit&#x2F;Office_Portal&#x2F;blob&#x2F;main&#x2F;Other.md<p>I want to say thank you to my internship supervisor: Rens \nAnd the company where I did my internship: Rapide<p>Thanks for reading!",
      "time": 1626267424,
      "title": "Office Portal: A nerdy solution to make distant colleagues feel nearby",
      "type": "story"
    },
    {
      "by": "simonpure",
      "descendants": 0,
      "id": 27832487,
      "score": 1,
      "time": 1626267338,
      "title": "Zig, Skia, Clojure, Geometry and the Japanese TV Show: ICFP Contest 2021",
      "type": "story",
      "url": "https://tonsky.me/blog/icfpc-2021/"
    }
  ]
}