{
  "stories": [
    {
      "by": "nikodunk",
      "descendants": 0,
      "id": 31177350,
      "score": 1,
      "time": 1651045213,
      "title": "Flathub: New website and API monorepo in Next.js and Flask",
      "type": "story",
      "url": "https://github.com/flathub/website"
    },
    {
      "by": "jamesdwilson",
      "descendants": 0,
      "id": 31177349,
      "score": 1,
      "text": "Hi HN, \nDoes anyone remember a supposedly new wireless power transmission mechanism?<p>I don&#x27;t remember much about it but the way it was supposed to work is it would beam the power to the device back the way some original signal was sent FROM the device,  regardless of how many other things it bounced off of, it would trace the signal back and send it power by the same route it received the original signal.<p>Thanks in advance",
      "time": 1651045151,
      "title": "Ask HN: Tip of my tongue – Reverse path wireless power solution?",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31177346,
      "score": 1,
      "time": 1651045120,
      "title": "Google at ICLR 2022",
      "type": "story",
      "url": "https://ai.googleblog.com/2022/04/google-at-iclr-2022.html"
    },
    {
      "by": "telecomsteve",
      "descendants": 0,
      "id": 31177331,
      "score": 1,
      "text": "A recent post asked a question similar to &#x27;Am I going insane or is there no value in blockchain tech&#x27;. I have been thinking more about the idea that perhaps blockchain tech has reached maturity, and that we are instead waiting on the remainder of &#x27;Web3&#x27; to mature.<p>I may be oversimplifying, but if I look at Web3 as the existing internet, but without central intermediaries; then most applications can be built this way today. If we want a Clubhouse, or Zoom clone, these could be built atop existing WebRTC infrastructure. A Whatsapp clone can be built atop libp2p messaging (again I oversimplify). From the internet infrastructure view, the part that was missing has always been mechanisms of identity, ownership, and payment (trust mechanics in general). Today, blockchains handle these in a variety of formats, such that a project can just pick the chain that fits best with the application architecture. In &#x27;Web 2.0&#x27;, if I want auth, payments, file storage, etc - I would simply stitch together one or more infrastructure providers such as AWS. This feels very natural today.<p>Is it possible that blockchain has already reached maturity for the value it brings to the decentralized web? Are there any popular applications today that could not be built peer-2-peer in this context?<p>The big gap I still see in this view is who pays for services that are free in Web 2.0 (such as Facebook). But even in this case, blockchains provide a variety of incentive mechanics where increasing usage could appreciate a digital token, which in turn gives incentive for people to run the underlying infrastructures.<p>I also feel crazy in that there seems to be consensus that blockchain is suppose to do everything, or should be doing more than it does. In all of this, I am viewing the problem space from the domain of infrastructure, agnostic of application. Is blockchain tech already everything we need it to be?",
      "time": 1651044991,
      "title": "Ask HN: Is blockchain tech already everything we need it to be?",
      "type": "story"
    },
    {
      "by": "Sincere",
      "descendants": 0,
      "id": 31177328,
      "score": 1,
      "time": 1651044963,
      "title": "Ask HN: Is the interview process status quo working well for big tech companies?",
      "type": "story"
    },
    {
      "by": "njacobs5074",
      "descendants": 0,
      "id": 31177277,
      "score": 1,
      "time": 1651044622,
      "title": "Elon, you have no idea what the hell you're talking about",
      "type": "story",
      "url": "https://techcrunch.com/2022/04/26/elon-you-have-no-idea-what-the-hell-youre-talking-about/"
    },
    {
      "by": "snadahalli",
      "descendants": 0,
      "id": 31177246,
      "score": 1,
      "time": 1651044397,
      "title": "How to bully-proof your kids for life",
      "type": "story",
      "url": "https://www.theguardian.com/society/2022/mar/19/how-to-bully-proof-your-kids-for-life-according-to-the-expert"
    },
    {
      "by": "alexellisuk",
      "descendants": 1,
      "id": 31177240,
      "kids": [
        31177247
      ],
      "score": 1,
      "time": 1651044372,
      "title": "Managing remote hosts at the edge with Kubernetes and SSH",
      "type": "story",
      "url": "https://inlets.dev/blog/2022/04/14/ssh-k8s-fleet-management.html"
    },
    {
      "by": "Anilm3",
      "descendants": 0,
      "id": 31177194,
      "score": 1,
      "time": 1651043861,
      "title": "The Gruesome History of Eating Corpses as Medicine",
      "type": "story",
      "url": "https://www.smithsonianmag.com/history/the-gruesome-history-of-eating-corpses-as-medicine-82360284/"
    },
    {
      "by": "frederikvs",
      "descendants": 0,
      "id": 31177185,
      "score": 1,
      "time": 1651043792,
      "title": "Crew-4 Mission – Launch",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=orN0PaqQECs"
    }
  ]
}