{
  "stories": [
    {
      "by": "yagiznizipli",
      "descendants": 0,
      "id": 29328534,
      "score": 1,
      "time": 1637748821,
      "title": "iCloud Private Relay can be turned off by your ISP",
      "type": "story",
      "url": "https://twitter.com/oskar/status/1463421809240510468"
    },
    {
      "by": "madspindel",
      "descendants": 0,
      "id": 29328518,
      "score": 1,
      "time": 1637748682,
      "title": "Pentagon Forms a Group to Examine Unexplained Aerial Sightings",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/24/us/politics/pentagon-ufos.html"
    },
    {
      "by": "questiondev",
      "descendants": 0,
      "id": 29328509,
      "score": 1,
      "text": "i’ve code my whole lot, it’s one of my few talents where it comes a lot easier than most things i do. i’ve been told my whole life i was gifted, i shrugged it off thinking it was just flattery, later on in life decided to talk to other more experienced devs, i was shocked that i was not only able to keep up but confuse them with things that i thought was how every coder was able to do. i have somewhat low self worth because of being raised in extreme poverty and having little to no guidance when it came to career advice. i am able to understand code, even if i haven’t read a document on it after like a week of studying and tinkering around with things, i assume this is somewhat normal, my question is, how can i get past the whole intimidation during an interview, i know i can give them what they want but, i feel somewhat unorthodox, i don’t think it’s an issue all the time but i am def not 100% tech bro, any advice would be helpful. thanks!",
      "time": 1637748533,
      "title": "What is the best advice for a cowboy coder interviewing for a senior position",
      "type": "story"
    },
    {
      "by": "mehdix",
      "descendants": 0,
      "id": 29328503,
      "score": 1,
      "text": "I work for a small VC-funded hardware startup in Germany and would like to help them&#x2F;founders make good decsions going forward regarding adding a SaaS product on top of their industrial hardware offerings (which are already doing great). Currently, I run and maintain a very cost-effective semi-automated data-aquisition and ETL pipeline for them.<p>However, mutual understanding proved to be difficult between me as a unix-minded software engineer and the hardware&#x2F;business people running the company.<p>Often the founders&#x2F;CEO hear from investors about new technologies such as Kubernetes or cloud offerings from the big fishes such as AWS and Azure or some cathy term and believe just using them will immediately contribute to their success (it will immediately contribute to their costs with no clear gains, investores like it however).<p>How could I best support the founders and CEO in making a software product and let them focus on &quot;what&quot; needs to be done, instead of &quot;how&quot; to do it in your opinion? Or perhaps I need to change my expectations? Either way, I appreciate your input.<p>Thanks.",
      "time": 1637748475,
      "title": "Ask HN: How to advice a HW startup with building a SaaS product?",
      "type": "story"
    },
    {
      "by": "Ldorigo",
      "descendants": 0,
      "id": 29328500,
      "score": 1,
      "text": "I am using Dropbox to keep my laptop and desktop data in sync. It works fantastic except it&#x27;s impossible to choose what to sync and what not to sync, meaning a lot of things that shouldn&#x27;t be synced get messed up (virtual environments, node-modules, etc.).<p>What do you use to keep your data in sync across multiple computers?",
      "time": 1637748438,
      "title": "Ask HN: An alternative to Dropbox giving finegrained control over what to sync?",
      "type": "story"
    },
    {
      "by": "l0b0",
      "descendants": 0,
      "id": 29328497,
      "score": 1,
      "text": "After using about half a dozen different email clients I don&#x27;t trust <i>any</i> of them to keep my messages safe indefinitely. I would much rather have several copies of every email all over the globe in a system which is fast and easy to sync, search, and reorganize, and which has easy recovery of deleted files: A self-hosted Git repository.<p>A quick search didn&#x27;t come up with any obvious candidates. There seems to be some projects out there for saving IMAP contents to various file formats, but none of the ones I found seem to have a big community, and I&#x27;ve no idea which file formats would be easily amenable to version control. Also, should I save the attachments embedded in the emails or as separate files (better version control and smaller email files, but breaks the explicit connection to the email file, and makes relocating them harder)? Finally, is there any reason why this is a terrible idea altogether, and I should just accept that personal messages from many years ago are just going to randomly disappear at some point?",
      "time": 1637748363,
      "title": "Ask HN: Is There an IMAP2Git?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29328491,
      "score": 1,
      "time": 1637748256,
      "title": "Twind: Tailwind-in-JS",
      "type": "story",
      "url": "https://github.com/tw-in-js/twind"
    },
    {
      "by": "mcholen",
      "descendants": 0,
      "id": 29328473,
      "score": 1,
      "time": 1637747998,
      "title": "Open-source home cloud OS allows you to run Docker applications without coding",
      "type": "story",
      "url": "https://github.com/IceWhaleTech/CasaOS"
    },
    {
      "by": "BXWPU",
      "descendants": 0,
      "id": 29328465,
      "score": 2,
      "time": 1637747801,
      "title": "Vim with ADHD",
      "type": "story",
      "url": "https://old.reddit.com/r/vim/comments/r0mou0/as_a_complete_n00b_id_like_to_share_some_of_my/"
    },
    {
      "by": "gkorland",
      "descendants": 0,
      "id": 29328448,
      "score": 1,
      "time": 1637747593,
      "title": "PipelineWise Illustrates the Power of Singer",
      "type": "story",
      "url": "https://www.stitchdata.com/blog/pipelinewise-singer/"
    }
  ]
}