{
  "stories": [
    {
      "by": "intunderflow",
      "descendants": 0,
      "id": 32098244,
      "score": 1,
      "time": 1657816439,
      "title": "Microsoft held a mock funeral for the iPhone when launching Windows Phone 7",
      "type": "story",
      "url": "https://www.cnet.com/pictures/microsofts-funeral-for-the-iphone-photos/"
    },
    {
      "by": "amin",
      "descendants": 0,
      "id": 32098203,
      "score": 2,
      "time": 1657816308,
      "title": "Show HN: I built a tiny platform where you can say anything you want",
      "type": "story",
      "url": "https://boomers.dog"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 32098201,
      "score": 1,
      "time": 1657816291,
      "title": "Tesla loses its head of AI and vision Andrej Karpathy",
      "type": "story",
      "url": "https://electrek.co/2022/07/13/tesla-loses-head-ai-vision-andrej-karpathy-big-loss-autopilot-team/"
    },
    {
      "by": "purplerabbit",
      "descendants": 0,
      "id": 32098199,
      "score": 1,
      "time": 1657816286,
      "title": "Quine – streaming graph with materialized views",
      "type": "story",
      "url": "https://quine.io/"
    },
    {
      "by": "oidar",
      "descendants": 0,
      "id": 32098194,
      "score": 1,
      "time": 1657816278,
      "title": "52% of YouTube videos live in 2010 have been deleted",
      "type": "story",
      "url": "https://datahorde.org/youtube-was-made-for-reuploads/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32098193,
      "score": 1,
      "time": 1657816276,
      "title": "DALL·E 2: Extending Creativity",
      "type": "story",
      "url": "https://openai.com/blog/dall-e-2-extending-creativity/"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 32098180,
      "score": 1,
      "time": 1657816210,
      "title": "Restoration of a 1959 IBM-1620 Computer",
      "type": "story",
      "url": "https://www.pictorialism.com/IBM1620.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32098171,
      "score": 1,
      "time": 1657816169,
      "title": "Crypto Is Crashing. Where Were the Regulators?",
      "type": "story",
      "url": "https://www.nytimes.com/2022/07/11/opinion/cryptocurrency-federal-reserve.html"
    },
    {
      "by": "forrestbrazeal",
      "descendants": 0,
      "id": 32098161,
      "score": 3,
      "text": "I initially created the Cloud Resume Challenge [0] a couple of years ago because I was seeing a huge wave of people trying to get &quot;six-figure cloud jobs&quot; off the back of little more than a couple of certifications. This is not sufficient and it contributes to the industry&#x27;s bad attitude toward hiring and mentoring juniors.<p>The goal of the CRC was to set people new to cloud a REAL challenge: not to give them a paint-by-numbers tutorial, but to lay out a spec that would require them to open a bunch of search tabs, stay up late, go down rabbit holes, and learn through pain. It self-selects for people who are self-motivated and know how to learn.<p>If you try the Cloud Resume Challenge and can&#x27;t complete it, or you hate it, then you&#x27;ll have learned a valuable lesson about whether you really want a job in the cloud right now - because these are the type of problems that cloud teams really work on.<p>But if you can complete the Cloud Resume Challenge, you will learn something about:<p>Front end and back end software development<p>Cloud services and &quot;serverless&quot;<p>Cloud networking, particularly DNS and CDNs<p>Cloud security<p>DevOps principles (version control, infrastructure-as-code, CI&#x2F;CD)<p>And you&#x27;ll learn by doing, because the spec doesn&#x27;t give you enough help to figure any of this out without a lot of trial and error. It&#x27;s a messy way to learn, but reality is messy. That&#x27;s why it works as a talking point in real-life job interviews.<p>People sometimes get hung up on the &quot;resume&quot; part of the Cloud Resume Challenge, saying &quot;who would be impressed by a resume site?&quot; Fine, whatever, put something else on your site, it doesn&#x27;t have to be your resume. (Though I believe personal websites are underrated as learning tools, simply because they give you built-in motivation to keep maintaining and updating the site over time, which gives 90% of the value in any side project.) The important thing is to build something real, something with a purpose in the world - not a toy tutorial. That will give you a baptism by fire that you will not forget.<p>Last thing: though there is a guidebook [1] for the challenge that you can buy (actually 3, one for each cloud! I just updated them! They&#x27;re great!) the challenge itself is and will remain free for everyone to do. Happy to answer any questions - the CRC is not my job, it&#x27;s a passion project and I&#x27;m always open to suggestions for how to make it a better experience.<p>[0] https:&#x2F;&#x2F;cloudresumechallenge.dev&#x2F;docs&#x2F;the-challenge\n[1] https:&#x2F;&#x2F;cloudresumechallenge.dev&#x2F;book&#x2F;",
      "time": 1657816121,
      "title": "Show HN: The Cloud Resume Challenge",
      "type": "story"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 32098152,
      "score": 1,
      "time": 1657816094,
      "title": "People are falling off buildings in search of the perfect Instagram shot",
      "type": "story",
      "url": "https://www.fastcompany.com/90287323/people-are-falling-off-buildings-in-search-of-the-perfect-instagram-shot"
    }
  ]
}