{
  "stories": [
    {
      "by": "VGltZUNvbnN1",
      "descendants": 0,
      "id": 31493313,
      "score": 1,
      "time": 1653405844,
      "title": "Cryptographic Beings – Biology as digital storage",
      "type": "story",
      "url": "https://www.creativeapplications.net/derivative-touchdesigner/cryptographic-beings-biology-as-digital-storage/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31493306,
      "score": 1,
      "time": 1653405815,
      "title": "One step closer to making terahertz technology usable in the real world",
      "type": "story",
      "url": "https://phys.org/news/2022-05-closer-terahertz-technology-usable-real.html"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31493297,
      "score": 1,
      "time": 1653405801,
      "title": "Representing logic gates over Euclidean space via heaviside step function",
      "type": "story",
      "url": "https://www.nature.com/articles/s41598-022-11941-y"
    },
    {
      "by": "eawosika",
      "descendants": 0,
      "id": 31493287,
      "score": 1,
      "time": 1653405760,
      "title": "Web3 for Product Managers: A Guide for the Crypto-Curious",
      "type": "story",
      "url": "https://www.departmentofproduct.com/blog/web3-for-product-managers-a-guide-for-the-crypto-curious/"
    },
    {
      "by": "kite_and_code",
      "descendants": 0,
      "id": 31493281,
      "score": 1,
      "text": "Some examples:<p>I think that grocery store analysts found that mum&#x27;s are likely to change their purchasing behavior before&#x2F;after the birth of their child. The new habits might stick for a long time.<p>Sometimes (not always) I change some behavior when I read a book.<p>I know people who stopped eating meat almost entirely after they watched a movie about the meat industry. The reason was that they felt disgust and were not able to eat it any more.",
      "time": 1653405744,
      "title": "Ask HN: Situations when people changed their behaviors / habits?",
      "type": "story"
    },
    {
      "by": "Goofy_teckel",
      "descendants": 0,
      "id": 31493274,
      "score": 1,
      "time": 1653405727,
      "title": "A highly-effective alliance to build an insurtech founder’s vision – Marble App",
      "type": "story",
      "url": "https://z1.digital/blog/a-highly-effective-alliance-to-build-an-insurtech-founders-vision"
    },
    {
      "by": "yurisagalov",
      "descendants": 0,
      "id": 31493266,
      "score": 1,
      "time": 1653405696,
      "title": "Debugging models with the bias-variance trade-off",
      "type": "story",
      "url": "https://www.unbox.ai/blog/post/debugging-models-with-the-bias-variance-trade-off"
    },
    {
      "by": "trafnar",
      "descendants": 0,
      "id": 31493263,
      "score": 1,
      "text": "Today I launched an Imba course for Scrimba.com. Imba is an amazing language for building web applications, that deserves more attention.<p>Watch my announcement video: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=CDSIsvZJhow<p>Take the course (it&#x27;s free): https:&#x2F;&#x2F;www.scrimba.com&#x2F;learn&#x2F;imba<p>Some context:<p>I fell in love with the Imba programming language a couple years ago and quit my job to spend all my time building projects with Imba. The first one being TaskTXT (https:&#x2F;&#x2F;www.tasktxt.com), a plaintext notepad with built-in timers. It&#x27;s full of UI details that were a joy to build with Imba. Trying to build things like this with React in the past honestly made me feel dumb.<p>Imba (https:&#x2F;&#x2F;www.imba.io) is a language that compiles to Javascript, like TypeScript or JSX. Imba&#x27;s syntax diverges much more from Javascript, looking more like Python or Ruby. It&#x27;s compatible with Javascript and Typescript and NPM modules. It also has fantastic VSCode tooling and even supports TypeScript types.<p>I like Imba syntax better than JS, but the real selling point is the built-in features for building web UI. Imba has first-class support for html tags, css styles, and custom web components. Those are all parts of the language. For me, Imba has replaced Javascript, HTML, CSS and React.<p>Imba&#x27;s &quot;Memoized DOM&quot; model for updating the UI is an order of magnitude faster than virtual DOM approaches. This allows for simple state management, because you can pretty much re-render the whole UI whenever you want and Imba manages to do that very efficiently. There&#x27;s an older article about this here (https:&#x2F;&#x2F;www.freecodecamp.org&#x2F;news&#x2F;the-virtual-dom-is-slow-meet-the-memoized-dom-bb19f546cc52&#x2F;) if you want to dig into the technical details.<p>People often ask for examples of things made with Imba, and the most prominent one is the learn-to-code site, Scrimba.com and its interactive editor. Scrimba was was built by Sindre (creator of Imba) and the Scrimba team. The fact that Scrimba&#x27;s editor was made with Imba grabbed my attention when I first learned about the language. It&#x27;s one of the most impressive web applications I&#x27;ve ever seen.<p>Sindre originally built Scrimba to share Imba, but until now there&#x27;s not been a real Imba course on Scrimba! So, I&#x27;m pleased to be fixing that today.<p>I know Imba looks strange to a lot of people. Imba programmers are used to people looking at it and declaring it to be stupid and wrong. An open mind is required. Imba doesn&#x27;t have to be for everyone, but for a certain type of developer who values design, and wants to build expressive UI quickly, it&#x27;s pure magic.",
      "time": 1653405667,
      "title": "Show HN: Learn Imba course on Scrimba.com",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 31493247,
      "kids": [
        31493257
      ],
      "score": 1,
      "time": 1653405576,
      "title": "How to deal with a bad smell when using the washing machine",
      "type": "story",
      "url": "https://www.washingtonpost.com/home/2022/05/23/how-deal-with-bad-smell-when-using-washing-machine/"
    },
    {
      "by": "excel-slave",
      "descendants": 0,
      "id": 31493237,
      "score": 1,
      "text": "Been building something that will hopefully be useful to the community and Gmail users in general - would love to get any feedback &#x2F; thoughts!<p>So my Gmail inbox used to be a mess, especially after I signed up for a few newsletters. I tried creating filters by using &quot;Filter messages like these&quot;, but I ended up with 50 rules that could be condensed to ~20. It was also difficult to get a good overview of what all the different rules are doing.<p>So a friend and I built a website called SortEm to help us out.<p>Check out some the rules we added in this link and apply them to your inbox if you find them useful!<p>The 10 rules in the link are for stuff like:<p>Marking large emails with the label &quot;&gt;10MB&quot;<p>Marking emails from eBay and Amazon with &quot;e-com&quot; labels<p>Marking emails with keywords of newsletters and promotions as &quot;Newsletter | Promotion&quot; and making them skip the inbox<p>Marking emails with keywords of security notifications as &quot;Security notification&quot; and making sure they are in Primary<p>Marking emails from sites like GitHub, Reddit<p>etc.<p>BTW: In SortEm you can also upload a Gmail filter file, edit the different filters, add some useful filters that we collected from friends and from our own inboxes, and apply them all to your own Gmail. Also, you can create a unique link that will save your rules.<p>Would love to hear what you guys think, and feel free to spread the word! :)",
      "time": 1653405541,
      "title": "Show HN: Make your Gmail Inbox easier to use with a better rule manager",
      "type": "story",
      "url": "https://sortem.co/editor/5f8b13116e77616e832b08159bfdfa9e364e61f5"
    }
  ]
}