{
  "stories": [
    {
      "by": "juliend2",
      "descendants": 0,
      "id": 28292225,
      "score": 1,
      "time": 1629826473,
      "title": "Tools for Thinking",
      "type": "story",
      "url": "https://www.juliendesrosiers.com/2021/08/21/tools-for-thinking.php"
    },
    {
      "by": "sakopov",
      "descendants": 0,
      "id": 28292215,
      "score": 1,
      "time": 1629826444,
      "title": "USA Today fact checked a PayDay candybar joke",
      "type": "story",
      "url": "https://www.usatoday.com/story/news/factcheck/2021/07/23/fact-check-hersheys-payday-candy-bar-name-isnt-changing/8057943002/"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 28292213,
      "score": 1,
      "time": 1629826433,
      "title": "A 5G Shortcut Leaves Phones Exposed to Stingray Surveillance",
      "type": "story",
      "url": "https://www.wired.com/story/5g-network-stingray-surveillance-non-standalone/"
    },
    {
      "by": "rnavara",
      "descendants": 0,
      "id": 28292206,
      "score": 4,
      "text": "Hey HN! We&#x27;re Rachita Navara, MD and Kunj Patel, MD, MSc: co-founders of SafeBeat Rx (<a href=\"https:&#x2F;&#x2F;www.safebeatrx.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.safebeatrx.com</a>). I (Rachita) am a bioengineer and cardiologist specializing in heart rhythm disorders, and Kunj is a pain physician with a Masters in applied mathematics. We make life-saving ECG software to replace a 3-day hospitalization and let patients start heart meds safely at home.<p>34M people have atrial fibrillation (AFib), the most common heart rhythm disorder in the world. It causes 1 in 4 strokes in people over 40 and increases the risk of death by 4x. Antiarrhythmic meds improve symptoms and save lives. Unfortunately, these pills can only be started during a 3+ day hospitalization because early drug trials showed &lt;0.6% risk of causing sudden cardiac death. This can be prevented by ECG monitoring, but there hasn&#x27;t been an alternative to hospitalization since the drugs were approved 30 years ago.<p>For low-risk patients, the risks of hospitalization outweigh the risk of medication side effects, and patients in underserved areas often don&#x27;t even have access to hospitals. From a hospital&#x2F;insurer perspective, each of these hospitalizations costs $17k and takes a hospital bed that would otherwise go to someone who actually needs hospital-level care. Because of unnecessary expenditures like this, AFib costs &gt;$26B in the US alone, 75% of which is for hospitalizations.<p>As a cardiologist specializing in heart rhythm disorders, I regularly cared for patients who were stuck in the hospital just to start these oral pills. All I was doing for these folks (as a physician with &gt;10 years of medical training!) was making a tiny measurement on a paper ECG with physical calipers to check for drug side effects. Given my engineering background, I knew we could develop software that automates this process. I also knew, as an AFib researcher presenting at international heart rhythm conferences, that this was a large market desperate for improvement. When COVID-19 brought telehealth to the forefront, it became clear that we should build a startup to solve this.<p>Our take-home kit combines FDA-approved wearable hardware devices with our ECG software that automates measurements, recommends drug dosing, and catches changes before they become heart attacks. Here’s a demo of our portal, which is a functional prototype that allows doctors to interact with our algorithm (and helps us get feedback on performance): <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;10iBo_EznZOQ_RHLiFzcGTnA-GERUlI6M&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;10iBo_EznZOQ_RHLiFzcGTnA-GER...</a>. Doctors approve our algorithm’s measurements and dosing at every step for safety. Our interface aims for simplicity, based on what we wanted ourselves while treating patients.<p>We’ve done a 103 patient pilot study, which showed that our software successfully interpreted 100% of ECGs and could even replicate doctors’ clinical decisions. Our FDA path is short due to using existing FDA-cleared hardware, and we are seeking EUA (Emergency Use Authorization) during the pandemic. Some drugs tried on COVID-19 early in the pandemic caused people to die due to heart rhythm side effects. Our technology can prevent such deaths—not only from heart meds, but from 300+ meds that can cause sudden cardiac death, and thus require close ECG monitoring.<p>Insurers are incentivized to reimburse our kit, and hospitals want to preserve valuable beds for sicker patients. Because heart rhythm side effects are the #1 reason drugs are declined FDA approval, we also aim to partner with pharmaceutical companies testing new drugs. Our automated system to monitor heart rhythm safety while starting drugs can tap the giant market of drug safety trials.<p>We’re excited to share what we’ve been building and look forward to your thoughts!",
      "time": 1629826415,
      "title": "Launch HN: SafeBeat Rx (YC S21) - At-home ECG kit to replace hospitalizations",
      "type": "story"
    },
    {
      "by": "optimalsolver",
      "descendants": 0,
      "id": 28292174,
      "score": 1,
      "time": 1629826314,
      "title": "Were There Dark Ages? (2017)",
      "type": "story",
      "url": "https://slatestarcodex.com/2017/10/15/were-there-dark-ages/"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 28292166,
      "score": 1,
      "time": 1629826295,
      "title": "Most authoritative AI textbook code does not work on Apple devices",
      "type": "story",
      "url": "https://github.com/aimacode/aima-python"
    },
    {
      "by": "JProthero",
      "descendants": 0,
      "id": 28292143,
      "score": 1,
      "time": 1629826195,
      "title": "Eavesdropping on the Taliban",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/08/what-i-learned-while-eavesdropping-on-the-taliban/619807/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28292103,
      "score": 1,
      "time": 1629826041,
      "title": "Italy’s famous dome is cracking, and cosmic rays could help save it (2018)",
      "type": "story",
      "url": "https://arstechnica.com/science/2018/08/cosmic-rays-could-help-unlock-the-secrets-of-brunelleschis-dome/"
    },
    {
      "by": "koolba",
      "descendants": 0,
      "id": 28292104,
      "score": 3,
      "time": 1629826041,
      "title": "New CDC studies point to waning immunity from vaccines",
      "type": "story",
      "url": "https://www.politico.com/news/2021/08/24/cdc-studies-vaccine-immunity-506782"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28292100,
      "score": 1,
      "time": 1629826032,
      "title": "Is there any way I can alter my driving behaviour to help reduce traffic? (2016)",
      "type": "story",
      "url": "https://www.reddit.com/r/AskEngineers/comments/4e80uu/traffic_engineers_is_there_any_way_i_can_alter_my/d1y78fb"
    }
  ]
}