{
  "stories": [
    {
      "by": "mmastrac",
      "descendants": 0,
      "id": 31073062,
      "score": 1,
      "time": 1650299964,
      "title": "Show HN: Automedia – a tool for managing bitrot and formats in media libraries",
      "type": "story",
      "url": "https://github.com/mmastrac/automedia"
    },
    {
      "by": "Vladimof",
      "descendants": 0,
      "id": 31073044,
      "score": 1,
      "time": 1650299905,
      "title": "US man wins $450k lawsuit after unwanted office birthday party",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-61141421"
    },
    {
      "by": "wenbin",
      "descendants": 0,
      "id": 31073025,
      "score": 1,
      "time": 1650299812,
      "title": "Podcast Search Engine",
      "type": "story",
      "url": "https://www.listennotes.com/"
    },
    {
      "by": "sidgarimella",
      "descendants": 0,
      "id": 31073000,
      "score": 2,
      "text": "Hey HN,<p>Screenshots of bugs are no substitute for reproducing issues, but clearly annotated&#x2F;laid out images do go a long way for developers to understand what’s going on and start working on them sooner. These remain an odd amount of work&#x2F;overhead to do well— no one is going to fire up photoshop here, and most QA folks I’ve talked to have a simple trick or two up their sleeve for assembling screenshots&#x2F;repro content quickly.<p>A friend of mine’s spent the last few years working to improve this process and threw together what’s quite possibly the most functional screenshot tool (on windows) I’ve seen out there, meant specifically for QA teams (one click share to issue trackers, some annotation tools useful there, etc), and I wanted to share it with the HN community on behalf of them. They’ve put in pretty much zero marketing efforts so far and I’m trying to encourage them to get started— I think this could be useful for quite a few people, but other than some surface blog content, this is literally the first public post of their product.<p>There’s a free version (and like, $2&#x2F;mo for premium), it’s my hope some of you can try it out and find it useful. A bit on their product here: https:&#x2F;&#x2F;www.pixtel.us&#x2F;product.html, and you can grab a download here: https:&#x2F;&#x2F;www.pixtel.us&#x2F;download.html.",
      "time": 1650299702,
      "title": "Show HN: QA teams deserve better than SnagIt",
      "type": "story"
    },
    {
      "by": "m348e912",
      "descendants": 0,
      "id": 31072973,
      "score": 2,
      "text": "Any website following GDPR guidelines presents annoying preference options regarding which cookies the user wishes to accept. Some sites categorize the cookies from &quot;cookies needed for functionality&quot; all the way to &quot;third party advertiser cookies&quot;  \nI&#x27;d like to be able to pre-define what kind of cookies to accept in my browser. \nSince most content providers won&#x27;t like the approach I think it might have to be legislated, since most users would probably opt for &quot;cookies required for functionality&quot;",
      "time": 1650299587,
      "title": "Leave it to the browser to opt out of cookies",
      "type": "story"
    },
    {
      "by": "sizzle",
      "descendants": 0,
      "id": 31072944,
      "score": 1,
      "time": 1650299467,
      "title": "One Step Closer to Creating New Hair Follicles – Yale School of Medicine",
      "type": "story",
      "url": "https://medicine.yale.edu/news-article/one-step-closer-to-creating-new-hair-follicles/"
    },
    {
      "by": "yandrypozo",
      "descendants": 1,
      "id": 31072936,
      "kids": [
        31072937
      ],
      "score": 1,
      "time": 1650299432,
      "title": "Generate PostgreSQL Credentials with HashiCorp Vault and Go",
      "type": "story",
      "url": "https://splitmind.dev/posts/generate-creds-postgres-vault-with-golang/"
    },
    {
      "by": "throwaway894345",
      "descendants": 1,
      "id": 31072931,
      "kids": [
        31073027
      ],
      "score": 3,
      "text": "I understand the high level reasoning is “government corruption”, but I’m trying to understand what efforts have been made to allow people to rip their own lawfully purchased media. Are any congresspeople fighting to repeal this section of the DMCA? Has any legislation been proposed? Which senators are most firmly advocating for this overt MPAA rent seeking? Why is this not as popular as “right to repair” considering how many more people this impacts? This is a pretty wide-open question, so anything people can add to help me understand this history of this conflict is welcome.<p>For those who don’t know, Section 1201 makes it illegal to break any DRM or to make or distribute software useful for this purpose. The effect is that people who have a valid license to the content must pay over and over to consume that content (once for blu-ray, once for Apple TV, once for Amazon, etc).",
      "time": 1650299421,
      "title": "Ask HN: Why has DMCA Circumvention Prohibition not been repealed?",
      "type": "story"
    },
    {
      "by": "eysquared",
      "descendants": 0,
      "id": 31072905,
      "score": 1,
      "time": 1650299344,
      "title": "The rise of brand-new, second-hand electric vehicles",
      "type": "story",
      "url": "https://www.wired.com/story/secondhand-new-evs-price-rise/"
    },
    {
      "by": "jaredgorski",
      "descendants": 1,
      "id": 31072902,
      "kids": [
        31072990
      ],
      "score": 1,
      "time": 1650299340,
      "title": "Unlock neat handwriting by adopting a font",
      "type": "story",
      "url": "https://jaredgorski.org/writing/penmanship/"
    }
  ]
}