{
  "stories": [
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27916793,
      "score": 1,
      "time": 1626943635,
      "title": "Poor security exposes data of magacoin buyers",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/jul/22/magacoin-pro-trump-cryptocurrency-attracts-over-1000-people-to-sign-up"
    },
    {
      "by": "WolfOliver",
      "descendants": 0,
      "id": 27916792,
      "score": 1,
      "time": 1626943626,
      "title": "Ask HN: What is the difference between group calls and Huddles in Slack?",
      "type": "story"
    },
    {
      "by": "manjana",
      "descendants": 0,
      "id": 27916782,
      "score": 1,
      "time": 1626943460,
      "title": "CSS Scrollbars (Firefox)",
      "type": "story",
      "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Scrollbars"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 27916774,
      "score": 1,
      "time": 1626943404,
      "title": "British man arrested over alleged role in Twitter hack of high-profile accounts",
      "type": "story",
      "url": "https://www.euronews.com/2021/07/21/british-man-arrested-in-spain-over-alleged-role-in-twitter-hack-of-high-profile-accounts"
    },
    {
      "by": "nkjoep",
      "descendants": 0,
      "id": 27916766,
      "score": 1,
      "time": 1626943331,
      "title": "Nativefier/nativefier: Make any web page a desktop application",
      "type": "story",
      "url": "https://github.com/nativefier/nativefier"
    },
    {
      "by": "asukhwani",
      "descendants": 0,
      "id": 27916764,
      "score": 1,
      "text": "Hi HN, we are Benoît and Avi, co-founders at Payflow (<a href=\"https:&#x2F;&#x2F;www.payflow.es&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.payflow.es&#x2F;</a>). We’re making a better app for workers to instantly access their earned wages. We launched a year ago in Spain (where we’re based!). Anyone in Spain can try our product. Otherwise, here’s a demo video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=GSDlGhoFNyM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=GSDlGhoFNyM</a>.<p>75% of employees in Spain and Latam live paycheck to paycheck and many have no savings. They often run out of cash before payday, especially if they have an unexpected expense. This is an issue for employers too, because high employee turnover amongst low-income employees is costly. Most employee perks (e.g. health insurance, flexible benefits, snacks in the office), which are so familiar to HN, are usually reserved to white-collar workers in Latam. Said employee perks are too expensive for blue-collar employers, and more importantly are not what employees who are struggling with financial instability actually need.<p>Given the inequality (and wealth) of our societies, we could argue that low-wage workers ought to be making more in the first place, but in the meantime people are making what they make and often have an urgent need to access that money faster. For example, a few weeks ago, we received a call from an employee who was stuck at a gas station in the middle of nowhere. He was out of gas and out of money. We helped him activate his Payflow account so he was able to instantly stream a portion of his earned wages. This allowed him to pay for gas and to continue on the road.<p>Every week we receive emails from potential users (who are unable to use our app because their employer has not yet signed a contract with us) and they literally tell us “I need money”. We thought employees would use our app because it’s innovative, but they mostly use it because they really need the money. This came as a surprise to us. We knew there was a need, but we did not realise the need would be so pronounced.<p>We met 8 years ago at MIT and discovered a company called DailyPay that was offering on-demand pay in the USA. We thought this was really cool, but didn’t really see it working outside of the USA. 8 years down the line, we saw a couple of players pop up in Europe and realised there was an opportunity to take on-demand pay to other countries. The pandemic was the perfect time to start because demand for short-term credit spikes in a crisis. That’s when we decided to get back together in Spain and launch Payflow for Spain and Latam.<p>Our mobile app allows users to see and withdraw their accrued wages in real-time. Employees value our product because it’s free, private and instantaneous. It’s free because we charge employers, not workers. More on that below.<p>When the user makes a withdrawal, we issue a real-time payment to their bank account, so they receive the money within seconds. On the backend, we have an integration with the employer’s payroll software so we know how much should be available for them. This is the tricky part. We need to know how much they have earned and if they are still employed by their company. It is hard to gather this information: payroll systems are complex in large companies, most integrations are on-premise, the market is fragmented and it is hard to create plug and play solutions. We realised we could solve it when payroll providers started opening their APIs to third parties. We saw this as an opportunity to solve a longstanding problem using technology. In reality, things were (as usual) harder than expected because a lot of payroll software integrations still have to be done on-premise.<p>This is a hot market right now: there are 150+ startups worldwide working on it! The hype is recent, most of the 150+ are just getting started, less than 10 have raised $5M+ in funding. However, almost all of these startups charge employees a fee for each transaction. That makes them effectively a payday loan in disguise. By contrast, we sell our service as a true employee benefit, which the <i>employer</i> pays for. Our solution is completely free for employees. This is an important distinction!<p>Workers living from pay check to pay check have traditionally been vulnerable to exploitation, and the entire payday industry has a bad reputation because of this. We’re building on what we hope is a much better foundation by being free for the employee and selling the product to companies. Our product means that people are much less likely to go into overdraft at their bank or to take out a payday loan. Both of those solutions are extremely costly. We want to fight financial institutions who are taking money from people who don’t have any. Second, we are truly committed to financial inclusion: we have launched two more products, Learnflow (a financial education platform to allow employees to learn about how to manage their personal finances better) and Saveflow (a saving tool that allows people to set money aside because we believe that financial freedom starts with healthy saving habits). Third, numbers show that people use our main service Payflow for very small amounts ($50-70) so we are not reinventing a loan but instead helping employees cover unexpected expenses and get paid in a more flexible way. In fact, we even give employers an optional feature where they can set a cap on the % of salary that their employees can withdraw. Some employers really like this function because it ensures employees will have enough money left over at the end of the month to pay for their rent!<p>Building a product, as you all know, is hard! We have a long way to go, but we are passionate about what we’re building. We’d really appreciate any comments and feedback, we’d love to hear anything that can help make Payflow better. Thanks in advance!",
      "time": 1626943318,
      "title": "Launch HN: Payflow (YC S21) – Allow workers to access their wages instantly",
      "type": "story"
    },
    {
      "by": "montalbano",
      "descendants": 0,
      "id": 27916756,
      "score": 1,
      "time": 1626943202,
      "title": "Deadly coral disease sweeping Caribbean linked to wastewater from ships",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/jul/22/deadly-coral-disease-sweeping-caribbean-linked-to-wastewater-from-ships"
    },
    {
      "by": "viseztrance",
      "descendants": 0,
      "id": 27916736,
      "score": 1,
      "time": 1626942946,
      "title": "Ethan “Flibitijibibo” Lee May Retire from Programming Due to Valve’s Proton",
      "type": "story",
      "url": "https://nuclearmonster.com/2021/07/ethan-flibitijibibo-lee-may-retire-from-programming-due-to-valves-proton/"
    },
    {
      "by": "TeresaaChristie",
      "descendants": 0,
      "id": 27916733,
      "score": 3,
      "time": 1626942930,
      "title": "Haiti vs. the Dominican Republic",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/haiti-vs-the-dominican-republic"
    },
    {
      "by": "vansul",
      "descendants": 1,
      "id": 27916705,
      "kids": [
        27916763
      ],
      "score": 2,
      "time": 1626942650,
      "title": "Stinky Bay? Local names added to map to aid coastal rescue",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-57916520"
    }
  ]
}