{
  "stories": [
    {
      "by": "FailMore",
      "descendants": 0,
      "id": 30488850,
      "score": 1,
      "text": "Hi HN,<p>Not expecting this to get to the front page! But hoping for one or two responses.<p>I am a junior software engineer and work at a company that uses Apache Kafka. I also have a side project which is a website for ongoing text-based interviews called Taaalk (https:&#x2F;&#x2F;taaalk.co). I am looking to interview someone about Kafka, starting with the basics and getting increasingly complex (eventually with some code examples).<p>[To get a better understanding of a format, here is an example of a Taaalk: https:&#x2F;&#x2F;www.taaalk.co&#x2F;t&#x2F;repopulating-the-taaalk-database-from-archive-org. It is a quite meta, as it is myself and another software engineer discussing how to repopulate the Taaalk database from an archive.org download after a server incident which wiped my database. However, it should give you an idea of the format.]<p>If you are interested in &quot;Taaalking&quot; with me about Kafka, please get in touch via the email on my profile.<p>Thank you!",
      "time": 1645972808,
      "title": "Ask HN: Request for interviewee to discuss Apache Kafka",
      "type": "story"
    },
    {
      "by": "DisjointedHunt",
      "descendants": 1,
      "id": 30488835,
      "kids": [
        30488845
      ],
      "score": 1,
      "time": 1645972715,
      "title": "Potential Nuclear war scenario between NATO and Russia",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2jy3JU-ORpo"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30488833,
      "score": 1,
      "time": 1645972710,
      "title": "What It Would Take to Bring the ISS Back to Earth in One Piece",
      "type": "story",
      "url": "https://www.wired.com/story/what-it-would-take-to-bring-the-iss-back-to-earth-in-one-piece/"
    },
    {
      "by": "hcbogdan",
      "descendants": 1,
      "id": 30488812,
      "kids": [
        30488813
      ],
      "score": 1,
      "time": 1645972544,
      "title": "Antiput.in",
      "type": "story",
      "url": "https://antiput.in/"
    },
    {
      "by": "yessirwhatever",
      "descendants": 0,
      "id": 30488786,
      "score": 1,
      "time": 1645972449,
      "title": "Solo Along the Ukrainian-Russian Border, One Day Before War",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=f2rBUvWKSZw"
    },
    {
      "by": "nemoniac",
      "descendants": 0,
      "id": 30488763,
      "score": 2,
      "time": 1645972294,
      "title": "Using Ansible and Nomad for a homelab (part 1)",
      "type": "story",
      "url": "https://blog.aleksic.dev/using-ansible-and-nomad-for-a-homelab-part-1"
    },
    {
      "by": "wslh",
      "descendants": 0,
      "id": 30488746,
      "score": 4,
      "time": 1645972231,
      "title": "Turkish drone strike Russian forces",
      "type": "story",
      "url": "https://www.middleeasteye.net/news/russia-ukraine-war-turkey-drone-strike-kherson-first-ever"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30488731,
      "score": 2,
      "time": 1645972084,
      "title": "The Twitching Girls: Is this the first illness spread by social media?",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2022/02/social-media-illness-teen-girls/622916/"
    },
    {
      "by": "puglr",
      "descendants": 0,
      "id": 30488722,
      "score": 1,
      "text": "(Embassies as well as consulates.)<p>Whatever happens inside these locations &quot;never happened&quot; so to speak. Ironclad plausible deniability.<p>I&#x27;ve seen several comments from software engineers saying that they&#x27;d love to join the cyber fight but won&#x27;t because doing so is, of course, illegal.<p>But San Francisco has a consulate, and so it got me thinking about this option.<p>Ukraine is now openly calling for international volunteers to support both combat and cyberwarfare operations. Perhaps they&#x27;d be amenable to allowing some of the best hackers on the planet through their doors to fight with impunity.<p>I&#x27;m not encouraging people to do this, more just a morbid curiosity about the mechanics and plausibility of it as a strategy. We&#x27;re seeing a whole lot of technological elements we (or at least most people) have never seen in war over the past few days.",
      "time": 1645972027,
      "title": "Ask HN: Could Ukrainian embassies facilitate US hackers to join the cyber front?",
      "type": "story"
    },
    {
      "by": "iafrikan",
      "descendants": 0,
      "id": 30488700,
      "score": 1,
      "time": 1645971900,
      "title": "Afrikan Fintech startups that should be on your radar",
      "type": "story",
      "url": "https://www.iafrikan.com/5-afrikan-fintech-startups-to-watch/"
    }
  ]
}