{
  "stories": [
    {
      "by": "amits1995",
      "descendants": 0,
      "id": 31314308,
      "score": 1,
      "time": 1652105975,
      "title": "Terraform for databases: Announcing the official Terraform provider for Atlas",
      "type": "story",
      "url": "https://atlasgo.io/blog/2022/05/04/announcing-terraform-provider"
    },
    {
      "by": "gherlein",
      "descendants": 0,
      "id": 31314305,
      "score": 1,
      "text": "https:&#x2F;&#x2F;www.electronicsfleamarket.com&#x2F; is cancelled.  I was so hoping to go this Saturday.  Anyone at a BigCo have a parking lot that can be used to preserve this incredible event?  Write them not me.  I just want it to happen again.",
      "time": 1652105935,
      "title": "Bay Area Electronics Flea Market cancelled for want of a new location location",
      "type": "story"
    },
    {
      "by": "Schiphol",
      "descendants": 0,
      "id": 31314292,
      "score": 1,
      "time": 1652105906,
      "title": "About those kill-switched Ukrainian tractors",
      "type": "story",
      "url": "https://doctorow.medium.com/about-those-kill-switched-ukrainian-tractors-bc93f471b9c8"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31314291,
      "score": 1,
      "time": 1652105898,
      "title": "Integers are enough to write a Snake Game",
      "type": "story",
      "url": "https://www.andreinc.net/2022/04/10/4-integers-are-enough-to-write-a-snake-game"
    },
    {
      "by": "srevenant",
      "descendants": 0,
      "id": 31314274,
      "score": 1,
      "text": "An observation: after being an elixir developer for a few years now, and bringing new talent into the mix (no pun intended), is that it&#x27;s a friction point for new devs learning Elixir when they invariably stumble across the things in erlang — libraries and the like.  I&#x27;d hoped I could avoid it myself, but it&#x27;s too interdependent.<p>The notion that to learn a language you also need to learn a second one is not great.  Imagine people saying &quot;cool, learn python, but oh, you also should brush up on cobol while you are at it, you know.&quot;  It&#x27;s just bizarre.<p>And before the vocal defenders kick in I want to clarify that the following response (which is what I usually hear) is NOT a valid response to the question being posed:<p>&quot;Erlang is easy, it&#x27;s just semantics that are different&quot;<p>While this statement might be true, it doesn&#x27;t address my point. That something is easy to do for one person is irrelevant to the fact it causes friction for new devs and may hinder adoption.<p>I think there are many amazing points to Elixir, and thanks to Erlang it has a lot of amazing roots. \n I know both communities are trying to make both co-exist well.  But every time I come across an Erlang library, invariably the documentation is a nightmare (if it exists at all) and I have to read the code just to figure something out.  This is true also of many system level things even in Erlang.  The docs are horrific.  Reading the code is NOT an answer.<p>I don&#x27;t know what a solution is, but perhaps a concerted effort to create a documentation and library ecosystem that never links back to Erlang would help.  And where there are critical systems that use an Erlang library, perhaps rebuilding it in Elixir is in order?<p>Flame away :)  I ask the question because I&#x27;m curious how others feel about it.",
      "time": 1652105817,
      "title": "Is Erlang an albatross to Elixir adoption?",
      "type": "story"
    },
    {
      "by": "elkip",
      "descendants": 0,
      "id": 31314261,
      "score": 1,
      "text": "In March 2020 I started working DevOps for a large insurance company in the US. I was persuaded to accept a salary under the usual industry starting wage because I didn&#x27;t have enough experience, but was assured there would be room for growth. It&#x27;s been 2 years of working 100% remotely with 24&#x2F;7 oncall rotations, coming in to work on weekends and filling in for co-workers who are many paygrades above me, and I&#x27;m only barely making more than I started. I have friends who do the same thing (often with less work) and get paid almost twice as much, it&#x27;s embarrassing to admit. I&#x27;ve asked for raises but always get BS about how it will have to wait until next quarter to get approved by HR. It&#x27;s clear to me now I&#x27;ve been waiting for something that&#x27;s never going to happen.<p>Anyways enough ranting about my job. I leave for grad school in 3 months and am planning on quitting then anyways, but I can&#x27;t keep working this job where I feel undervalued and unmotivated. I want to quit now but I don&#x27;t want to live off savings for the next 3 months. I&#x27;m experienced in full-stack web application development and have a BS in Data Science. I&#x27;ve never tried freelancing but could I find something short term to make enough to cover my rent and living expenses (about 3k&#x2F;month)? Or have I waited too long and should just stick it out? Any advice is appreciated.",
      "time": 1652105732,
      "title": "Advice needed: How to make money freelancing short term?",
      "type": "story"
    },
    {
      "by": "theo_england",
      "descendants": 0,
      "id": 31314260,
      "score": 1,
      "time": 1652105730,
      "title": "Streaming real-time data has been around longer than you think",
      "type": "story",
      "url": "https://quix.ai/history-streaming-real-time-data/"
    },
    {
      "by": "el_duderino",
      "descendants": 0,
      "id": 31314257,
      "score": 2,
      "time": 1652105727,
      "title": "Ransomware-as-a-service: Understanding the cybercrime gig economy",
      "type": "story",
      "url": "https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/"
    },
    {
      "by": "bovermyer",
      "descendants": 0,
      "id": 31314253,
      "score": 2,
      "time": 1652105699,
      "title": "The New Cncf.io",
      "type": "story",
      "url": "https://www.cncf.io/blog/2022/05/09/introducing-the-new-cncf-io/"
    },
    {
      "by": "kaashif",
      "descendants": 0,
      "id": 31314228,
      "score": 1,
      "time": 1652105604,
      "title": "Adam Savage's Rant on Laser Printers [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=m9lFcduaZPU"
    }
  ]
}