{
  "stories": [
    {
      "by": "spekcular",
      "descendants": 0,
      "id": 28387696,
      "score": 1,
      "time": 1630546252,
      "title": "Pure Earth – Support for Reducing Lead Exposure in Low/Middle-Income Countries",
      "type": "story",
      "url": "https://www.givewell.org/research/incubation-grants/Pure-Earth-lead-exposure-July-2021"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 28387695,
      "score": 2,
      "time": 1630546242,
      "title": "Lenovo tablet was remotely modified via forced update to have ad notifications",
      "type": "story",
      "url": "https://twitter.com/BenKrasnow/status/1433096367992295427"
    },
    {
      "by": "WXLCKNO",
      "descendants": 0,
      "id": 28387689,
      "score": 1,
      "text": "An acquaintance of mine is a bit of serial solo entrepreneur and he&#x27;s had great financial success in the past.<p>After a mutual friend spoke to me about one of his projects, I decided to reach out because we have a lot in common and we talked about his current business.<p>* it started a few months ago\n* it&#x27;s already generating substantial revenues\n* there&#x27;s not much structure in place<p>He has quickly reached a point where he needs help or he won&#x27;t be able to expand. In our first discussion we quickly got to the topic of maybe contracting me for help or otherwise if I&#x27;d be more interested in a partnership and becoming a co-founder.<p>I spent about a week in the evenings and on the weekend (for free) helping out because of my personal interest in the field he&#x27;s working in and to see if we&#x27;d get along further.<p>I helped automate part of his process, saving him manual work and I&#x27;ve started building out a new backend as well since his code was hastily written and is just a bunch of isolated scripts.<p>In addition I&#x27;ve started putting structure into place to organize work better.<p>He has asked me to join him full time but I currently work a full time job (making low six figures) but don&#x27;t have kids so I&#x27;ve got time in the evenings and weekends.<p>After thinking about a proposal, I came back to him and asked for 20% of the business, for which I would join and commit ~20 hours per week.<p>Reverse vesting quarterly over a year (not the standard four) because despite its current success, there are risks in the field.<p>He&#x27;s very focused on sales but is dropping a lot of them due to lack of time. My thinking was that with my help he could focus on sales and marketing, while I take over development and automation, as well as organizing work, which would ensure an increase in sales and a better foundation for the business.<p>My experience is in software development and product management so I think I can bring value despite the part time position.<p>I can&#x27;t see myself leaving my current role right away as I&#x27;d like to see how the business evolves first and I have a good career. Over time I can see myself joining him full time.<p>He accepted the offer verbally with enthusiasm and we are about to draw up a contract. However, with the 20% I would make more part time with him than I do full time at my job.<p>If it was only about the money, I&#x27;d go full time with him, but it&#x27;s not. The 20% ask was also a number which would make me feel valued considering my contribution and would show his commitment to me.<p>The 20% would basically be ownership but also 20% of profit, paid out weekly. Now that we got close to the date to make it official, he&#x27;s sort of soft-backtracked on his initial enthusiasm.<p>In the sense that he says he would &quot;feel weird&quot; paying me large sums for part time work (on the order of 2.5k-10k per day).<p>I realize it&#x27;s a large sum but I don&#x27;t find it strange. If by my contribution we increase productivity and sales, a part of the profits doesn&#x27;t seem unusual. And I think he needs a co-founder and not and employee.<p>Sorry for the long post but essentially, what are your thoughts? Is it wrong to ask for this percentage of a business which already makes money? With the reverse vesting i feel like there are plenty of opportunities for the partnership to end without too much risk for him. And I&#x27;d contribute to the long term success of the business.<p>Thanks!",
      "time": 1630546152,
      "title": "Ask HN: Equity for Part Time",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28387678,
      "score": 1,
      "time": 1630545929,
      "title": "The Eye of Argon",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/The_Eye_of_Argon"
    },
    {
      "by": "vthallam",
      "descendants": 0,
      "id": 28387656,
      "score": 4,
      "time": 1630545748,
      "title": "Apple to Allow Spotify, Other Media Apps to Link to Websites for Payment Options",
      "type": "story",
      "url": "https://www.wsj.com/articles/apple-to-allow-spotify-other-media-apps-to-link-to-websites-for-payment-options-11630544101"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 28387646,
      "score": 2,
      "time": 1630545626,
      "title": "Kenneth E. Iverson",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Kenneth_E._Iverson"
    },
    {
      "by": "eliotpeper",
      "descendants": 0,
      "id": 28387635,
      "score": 1,
      "time": 1630545536,
      "title": "Crypto sci-fi book recommendations",
      "type": "story",
      "url": "https://jfredrickson.com/day-244-and-crypto-fiction/"
    },
    {
      "by": "jeffthechimp",
      "descendants": 0,
      "id": 28387633,
      "score": 2,
      "time": 1630545515,
      "title": "Survey shows 45% of Googlers visited office, lower at Facebook, PayPal, others",
      "type": "story",
      "url": "https://www.sfexaminer.com/news/survey-shows-tech-workers-returning-to-office-at-various-speeds/"
    },
    {
      "by": "flywind",
      "descendants": 0,
      "id": 28387626,
      "score": 1,
      "time": 1630545461,
      "title": "This Month with Nim: August 2021",
      "type": "story",
      "url": "https://nim-lang.org/blog/2021/09/01/this-month-with-nim.html"
    },
    {
      "by": "jger15",
      "descendants": 1,
      "id": 28387613,
      "kids": [
        28387714
      ],
      "score": 22,
      "time": 1630545319,
      "title": "The World After Capital",
      "type": "story",
      "url": "https://worldaftercapital.org/"
    }
  ]
}