{
  "stories": [
    {
      "by": "caaqil",
      "descendants": 0,
      "id": 30035826,
      "score": 1,
      "time": 1642851583,
      "title": "A rare case report – Ovary attached to testicle inside hernia sac",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S2214442021001133"
    },
    {
      "by": "neumll",
      "descendants": 0,
      "id": 30035822,
      "score": 1,
      "time": 1642851538,
      "title": "Run your own locally-hosted translation service with a couple lines of code",
      "type": "story",
      "url": "https://neuml.github.io/txtai/pipeline/text/translation/"
    },
    {
      "by": "bonniesimon",
      "descendants": 0,
      "id": 30035821,
      "score": 1,
      "time": 1642851534,
      "title": "Ask HN: What are some free back end hosting platforms that you know about?",
      "type": "story"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 30035814,
      "score": 1,
      "time": 1642851460,
      "title": "This week in KDE: You wanted stability? Here’s some stability",
      "type": "story",
      "url": "https://pointieststick.com/2022/01/21/this-week-in-kde-you-wanted-stability-heres-some-stability/"
    },
    {
      "by": "throwawaynay",
      "descendants": 0,
      "id": 30035812,
      "score": 1,
      "text": "Hi!<p>Like many others, I quit almost all social medias over the years because of the rampant ignorance, toxicity, hostility, trolling, manipulations etc...<p>So I just had an idea, a social media where only really interesting people could contribute: artists, entrepreneurs, scientists, activists, writers, educators....<p>First of all, I don&#x27;t want this to be a big circle jerk like Mensa or your local country club, but a place where truly exceptional people can talk about great ideas and create interesting content, without interference from 14yo trolls, propagandists, or just willfully ignorant people.<p>I&#x27;m not even remotely sure I&#x27;d make the cut depending on how selective it ends up being.<p>The vision I have for this is a place where people like Gandhi, Einstein, Picasso and Shakespeare could raise important questions, debate, share ideas or their work, and have interesting discussions about all kind of topics for everyone to see.<p>Anyone could access the website, but only vetted people could contribute.<p>I feel like HN is accidentally a bit like that, but only for engineers&#x2F;tech entrepreneurs, I&#x27;d like to create something more diverse, I rarely see dumb stuff here, but it&#x27;s mostly about a really narrow set of topics.<p>For the first wave of users, I&#x27;m thinking about a system where each aspiring user would post a small description to explain why they want to join, what they want to talk about, what they can contribute, with maybe links to their work, and we would all rate each other,\nthen only the top 1%&#x2F;5%&#x2F;10%&#x2F;20% would be allowed to join.<p>There could be either one or multiple communities with different levels of selectivity.<p>Also this may be controversial but I think the admins&#x2F;moderators or some kind of &quot;board&quot;(which should be as diverse as possible) should be able to veto people, there is plenty of people with a cult-like following who could easily game the system, I don&#x27;t think we&#x27;d want a Kardashian or a Trump joining.<p>What do you think?\nWould you apply or checkout the content if this came into existence?<p>Thanks for your feedback!",
      "time": 1642851419,
      "title": "Ask HN: Would you try an intellectually elitist social media?",
      "type": "story"
    },
    {
      "by": "1_player",
      "descendants": 0,
      "id": 30035811,
      "score": 1,
      "time": 1642851414,
      "title": "Easy Anti-Cheat gets much simpler for Proton and Steam Deck",
      "type": "story",
      "url": "https://www.gamingonlinux.com/2022/01/easy-anti-cheat-gets-much-simpler-for-proton-and-steam-deck/"
    },
    {
      "by": "sofixa",
      "descendants": 0,
      "id": 30035776,
      "score": 1,
      "time": 1642850932,
      "title": "Irishman faces 20 years in jail after exposing himself on flight to New York",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/jan/22/irishman-faces-20-years-in-jail-after-exposing-himself-on-flight-to-new-york"
    },
    {
      "by": "surihae93",
      "descendants": 1,
      "id": 30035769,
      "kids": [
        30035781
      ],
      "score": 1,
      "text": "Over the last year, we built Padka.com from the ground up.<p>We have developed:  A virtual camera for video meeting platforms like Zoom, which can add layers of photos, animation, and videos directly in the streaming video.\nThe product is ready for macOS (you can download directly from our website - test it out) and in Beta for Windows.<p>Now due to some personal reasons, we can not continue... We will be so happy if some of you guys can find applications and will continue building this great product that we believe so much in. Of course,   you will get all the technical help that we can give you.<p>All of these can be exchanged for equity or the return on our investment. Any other advice on these please feel free to email me (in About section). Thanks so much for reading :)",
      "time": 1642850904,
      "title": "Ask HN: Any advice in returning investment? We believe we have a good product",
      "type": "story"
    },
    {
      "by": "YeGoblynQueenne",
      "descendants": 0,
      "id": 30035761,
      "kids": [
        30035762
      ],
      "score": 1,
      "time": 1642850867,
      "title": "Love jihad: India's lethal religious conspiracy theory",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=8ZoCEA_V8GA"
    },
    {
      "by": "heijmans",
      "descendants": 0,
      "id": 30035751,
      "score": 2,
      "time": 1642850801,
      "title": "Pure ESM Package",
      "type": "story",
      "url": "https://gist.github.com/sindresorhus/a39789f98801d908bbc7ff3ecc99d99c"
    }
  ]
}