{
  "stories": [
    {
      "by": "reeboo",
      "descendants": 0,
      "id": 29916970,
      "score": 2,
      "time": 1642049213,
      "title": "Deep Dive: 5G C-Band Interference with Radar Altimeters in Aviation",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=942KXXmMJdY"
    },
    {
      "by": "mleonhard",
      "descendants": 0,
      "id": 29916913,
      "score": 1,
      "time": 1642048644,
      "title": "Epidemiologists demand Spotify deal with lying podcasts",
      "type": "story",
      "url": "https://www.rollingstone.com/culture/culture-news/covid-misinformation-joe-rogan-spotify-petition-1282240/"
    },
    {
      "by": "cialowicz",
      "descendants": 0,
      "id": 29916909,
      "score": 1,
      "time": 1642048586,
      "title": "Here’s what your timeline was saying 14 years ago",
      "type": "story",
      "url": "https://twitter.com/anildash/status/1481293970135212037"
    },
    {
      "by": "CrazedGeek",
      "descendants": 0,
      "id": 29916908,
      "score": 1,
      "time": 1642048578,
      "title": "Useful Notes",
      "type": "story",
      "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/UsefulNotes"
    },
    {
      "by": "avl999",
      "descendants": 0,
      "id": 29916899,
      "score": 1,
      "text": "I have to admire the guy for sticking to his guns and his vision and not monetizing it. It would be so easy too- keep the existing version free but create an iOS&#x2F;Android app with some bells and whistles like longer words and boom rake in the cash. Being so hell bent on your vision commands respect. But I can&#x27;t help but feel that the guy is about to let someone else benefit from his creation and am not sure how to feel about that (see https:&#x2F;&#x2F;twitter.com&#x2F;zachshakked&#x2F;status&#x2F;1481345622938685443).<p>Apple is cracking down on blatant Wordle clones in the appstore right now but there is demand there, there is going to be a different app with a different name with a different ui with some added features like multiplayer that is probably gonna make some good money for a few months.<p>If someone is gonna inevitably end up benefiting from it, I&#x27;d rather the guy who made the original rather than an app cloning team in China or some bay area tech bro. I am putting myself in his shoes and even if I had the vision that he has, I would not be able to stop myself from monetizing it even if just to not let the copycats make as much of a windfall.<p>What do people here think of this situation?",
      "time": 1642048428,
      "title": "Ask HN: What does everyone here think of the Wordle guy not monetizing it?",
      "type": "story"
    },
    {
      "by": "raymondh",
      "descendants": 0,
      "id": 29916880,
      "score": 2,
      "time": 1642048156,
      "title": "What Happened to the Eviction Tsunami?",
      "type": "story",
      "url": "https://fivethirtyeight.com/features/what-happened-to-the-eviction-tsunami/"
    },
    {
      "by": "robbiet480",
      "descendants": 1,
      "id": 29916859,
      "kids": [
        29916882
      ],
      "score": 4,
      "time": 1642047951,
      "title": "Incoming North Korean Missile Warning Prompted FAA's Mysterious Air Traffic Halt",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/43859/mysterious-faa-order-to-halt-flights-was-prompted-by-incoming-north-korean-missile-warning"
    },
    {
      "by": "dvtrn",
      "descendants": 0,
      "id": 29916823,
      "score": 3,
      "text": "A few jobs ago a coworker of mine, a fellow Senior Site Reliability Engineer who-like I-was frustrated with how our company manifested &#x27;Devops&#x27;, and also-like I-had zero interest in trying to play the &#x27;hearts and minds&#x27; game of undergoing a devops transformation did something stunning (to me):<p>Because we were embedded with different development teams, we attended their stand ups and got intimate knowledge of what they were working on.<p>This friend of mine decided one day he&#x27;d pick a random ticket from this team&#x27;s backlog, and assigned it to himself. He worked it, he wrote the code, followed all the same testing and QA steps the dev team did, merged it in, it got deployed.<p>Some would argue &quot;this is what SRE&#x27;s ought to be doing in the first place&quot; and I agree, but lived experience has shown me the philosophy of Google&#x27;s SRE way either gets perverted and bastardized entirely, or just completely abandoned for reasons that are taken entirely out of the hands of the SRE practitioners by engineering managers and org leaders (Warning, cynicism ahead: In my opinion for reasons due to poor capacity and resource planning by those very same managers and leaders)<p>Anyway, my friend started doing this more and more. To the point that he messaged me one day saying he was leaving the team. I asked him where his new offer was. He said &quot;no I&#x27;m not leaving the <i>company</i>, I&#x27;m leaving the <i>team</i>&quot;.<p>The dev team manager noticed his work contribs, and when one of their developers left, grabbed our guy and pulled him onto their team proper.<p>My questions:\n- Is the a thing that anyone else has seen happen?\n- Have you done this&#x2F;had this kind of internal &quot;poach&quot; happen to you (or someone you care about?) \n- ....would you do it?",
      "time": 1642047647,
      "title": "Ask HN: Have you ever been “poached” internally? Is this even a thing?",
      "type": "story"
    },
    {
      "by": "stanislavb",
      "descendants": 0,
      "id": 29916787,
      "score": 2,
      "time": 1642047231,
      "title": "2021 Emoji Law Year-in-Review",
      "type": "story",
      "url": "https://blog.ericgoldman.org/archives/2022/01/2021-emoji-law-year-in-review.htm"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 29916766,
      "score": 1,
      "time": 1642047015,
      "title": "Apple will clarify iCloud Private Relay error messages in iOS 15.3",
      "type": "story",
      "url": "https://www.theverge.com/2022/1/12/22880835/apple-clarify-icloud-private-relay-error-messages-ios-15-3-cell-carriers"
    }
  ]
}