{
  "stories": [
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 27893211,
      "score": 1,
      "time": 1626786286,
      "title": "Officers who caused giant blast likely to have made 'significant miscalculation'",
      "type": "story",
      "url": "https://www.nbcnews.com/news/us-news/l-officers-who-caused-giant-blast-fireworks-likely-made-significant-n1274441"
    },
    {
      "by": "rossdavidh",
      "descendants": 0,
      "id": 27893209,
      "score": 1,
      "time": 1626786267,
      "title": "Over 97% of currently hospitalized for Covid-19 were unvaccinated",
      "type": "story",
      "url": "https://www.axios.com/coronavirus-cases-deaths-infections-vaccines-abbce96a-3e31-459e-a09f-41d88bb0f749.html"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 27893204,
      "score": 1,
      "time": 1626786210,
      "title": "Twitter Suspends Marjorie Taylor Greene for Anti-Vaccine Tweets",
      "type": "story",
      "url": "https://gizmodo.com/twitter-suspends-marjorie-taylor-greene-for-12-hours-ov-1847325429"
    },
    {
      "by": "squarefoot",
      "descendants": 0,
      "id": 27893201,
      "score": 1,
      "time": 1626786189,
      "title": "T-10 to Blue Origin flight",
      "type": "story",
      "url": "https://www.blueorigin.com/"
    },
    {
      "by": "Nocutriv",
      "descendants": 0,
      "id": 27893199,
      "score": 1,
      "time": 1626786177,
      "title": "Crash your iPhone keyboard on iOS 14.7 by deleting 睷\\u0000睷睷\\u0000",
      "type": "story",
      "url": "https://twitter.com/nocutriv/status/1417202635237576715"
    },
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 27893192,
      "score": 2,
      "time": 1626786132,
      "title": "Police in Latin America are turning activists’ phones against them",
      "type": "story",
      "url": "https://restofworld.org/2021/latin-america-phone-security/"
    },
    {
      "by": "thinkingemote",
      "descendants": 0,
      "id": 27893186,
      "score": 1,
      "time": 1626786095,
      "title": "Why Sexual Morality May Be Far More Important Than You Ever Thought",
      "type": "story",
      "url": "https://www.kirkdurston.com/blog/unwin"
    },
    {
      "by": "kbennatti",
      "descendants": 0,
      "id": 27893182,
      "score": 2,
      "text": "We’re Kris, Suhas, and Heather (YCS21) and we’re building Bedrock AI (<a href=\"https:&#x2F;&#x2F;bedrock-ai.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;bedrock-ai.com&#x2F;</a>).  We use machine learning to extract hard-to-find information and assess risk in public company reports (SEC filings). Our platform is used by investors to improve portfolio returns and mitigate downside risks.<p>Most public company data is unstructured and textual. Because relevant information is hard to find, a lot of corporate data is radically underused, to the detriment of investors. For example, our research shows it can take 12-18 months for corporate malfeasance to be incorporated into stock price after clear warning signs appear in financial text.  Hard-to-find information that we extract includes accounting and governance choices, product defects, regulatory issues, customer&#x2F;market reliance and much more.<p>One example is Sino-Forest, Canada&#x27;s Enron. Sino-Forest was a darling of Canadian investors until an infamous exposé, by short-seller Muddy Waters, in 2011. It turned out it was a forestry company that didn’t actually own any forests. Months before the exposé and crash, there were obvious red flags in the company’s disclosures including buying and selling from companies controlled by their directors and problems with the review of their bookkeeping! Our algorithms picked up these red flags and more, and assessed Sino-Forest as high risk when we ran our models on the company’s historical filings.<p>I’m a CPA and a developer (odd combo).  The tech community has largely ignored public company financial disclosure.  A few years ago, I published a basic piece using computational methods to analyze cannabis disclosure. The local regulatory agency contacted me to give them a workshop on text analytics. It was then that it hit home how little was being done in the field.<p>Information drives financial markets. The difficulty of assessing risks hidden in long public filings makes earning manipulation, and even fraud, both possible and profitable. Earnings manipulation involves using the flexibility in accounting standards to make financial statements look better than reality. This is easier than most people realize because accounting involves MANY choices and estimates.<p>There is money to be made by accessing and trading on underused predictive signals. Making money by stopping fraud is a win-win situation.<p>There are two main technical challenges thwarting progress in the field: (1) NLP models work best on short (500 character) text, but financial filings are hundreds of pages long, and (2) important and unimportant language sounds very similar in financial text. For instance, this sentence sounds like it could be indicative of terrible things going on behind the scenes but is in fact, just boilerplate disclosure: “We face risks and uncertainties related to litigation, regulatory actions and government investigations and inquiries.” You can see how ML models easily get confused.<p>There’s a big gap in both academia and industry. A lot of effort is being put into forcing results from non-existent linguistic signals. Models that claim to predict specific outcomes often don’t hold up to scrutiny in practice.<p>In order to overcome the technical challenges we used supervised and semi-supervised learning with high quality labels, we focused on tangible facts represented in textual context, and we adapted language models using domain expertise.<p>As far as we know, no other solution is able to identify problematic&#x2F;risky disclosure algorithmically. Using search terms to do something similar results in overwhelming noise. The disclosure selected by our algorithms is highly predictive of downside risk - validated in deployment and also in backtesting.<p>We launched our core product in April 2021 (see <a href=\"https:&#x2F;&#x2F;bedrock-ai.com\" rel=\"nofollow\">https:&#x2F;&#x2F;bedrock-ai.com</a>) and it’s used by hedge funds and institutional investors. We’re also doing a pilot to support Canadian securities regulators (<a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;3wOwOj6\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;3wOwOj6</a>).  We’ve also just launched a minimalist free site, Ledge (<a href=\"https:&#x2F;&#x2F;ledge.bedrock-ai.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ledge.bedrock-ai.com</a>), to help retail investors stay up to date on material events at companies they follow. Companies are required to disclose material events between their quarterly reports, but these disclosures rarely make the news.<p>Our core&#x2F;premium product is currently only available to institutions, in part because retail investors generally don’t prioritize risk management and therefore aren’t committed customers. We plan to expand the free site and better support individual investors as we grow.<p>We would love to hear from you. Have you tried to read annual reports and gotten lost in the weeds? What has your experience been in making NLP models work on financial text?",
      "time": 1626786058,
      "title": "Launch HN: Bedrock AI (YC S21) – Using ML to identify red flags in SEC filings",
      "type": "story"
    },
    {
      "by": "jwilk",
      "descendants": 0,
      "id": 27893181,
      "score": 1,
      "time": 1626786055,
      "title": "CVE-2021-33909: size_t-to-int vulnerability in Linux's filesystem layer",
      "type": "story",
      "url": "https://www.openwall.com/lists/oss-security/2021/07/20/1"
    },
    {
      "by": "a_imho",
      "descendants": 0,
      "id": 27893175,
      "score": 1,
      "time": 1626785992,
      "title": "Marek's Disease",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Marek%27s_disease"
    }
  ]
}