{
  "stories": [
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 32139764,
      "score": 1,
      "time": 1658159650,
      "title": "Git 2.37.0, you can run just “Git push” to push new branches",
      "type": "story",
      "url": "https://twitter.com/ji/status/1546948817462800384"
    },
    {
      "by": "adamrezich",
      "descendants": 0,
      "id": 32139762,
      "score": 2,
      "time": 1658159630,
      "title": "Practical Real-Time Hex Tiling",
      "type": "story",
      "url": "https://github.com/mmikk/hextile-demo"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 32139760,
      "score": 1,
      "time": 1658159629,
      "title": "Microsoft launches simulator to train drone AI systems",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-62202118"
    },
    {
      "by": "user239",
      "descendants": 0,
      "id": 32139750,
      "score": 2,
      "text": "Even though Wave was killed more than 10 years ago, I didn&#x27;t fully appreciate its value until recently, when I had to spend a fair amount of time in some group email threads discussing complex subjects.<p>Would using chat instead solve the problem? Not really. In my opinion, chats are great for exchanging quick single-line replies. But to have a real discussion and arrive at a meaningful conclusion, we actually need more structure, not less structure. Which made me realize I wanted a product that worked exactly like Wave, but without some of its annoying features.<p>In my opinion, the real-time typing feature was one of the main things that killed Wave. It&#x27;s a very helpful feature for document editing, but maybe not so desirable when exchanging regular messages. Taking this feature out of the equation, it amazes me that no one (that I&#x27;m aware of) has built a product with basic Wave features to support intuitive threaded discussions with granular access control that can be used in both social and workplace settings.<p>Reading some of the threads here on HN with people saying they wouldn&#x27;t mind giving this idea a second chance if some product implemented it properly (with clean user-friendly design etc.), made me realize I might not be alone in this thinking. So after building and using it myself for taking notes and communicating with a couple of friends, I&#x27;m now ready to start sharing it with the rest of the world hoping to get some feedback on whether this implementation can be of any interest for others.<p>Thank you for reading this long introduction! Please let me know what you think of this idea.<p>My goal with this project is to small steps, iterate, and based on any feedback I can get, hopefully, eventually produce something that can provide a non-zero value :)",
      "time": 1658159560,
      "title": "Show HN: I decided to re-create a mini Google Wave",
      "type": "story",
      "url": "https://reresponse.com/about"
    },
    {
      "by": "Brajeshwar",
      "descendants": 1,
      "id": 32139737,
      "kids": [
        32139742
      ],
      "score": 1,
      "time": 1658159490,
      "title": "The U.S. Needs a Million Talents Program to Retain Technology Leadership",
      "type": "story",
      "url": "https://foreignpolicy.com/2022/07/16/immigration-us-technology-companies-work-visas-china-talent-competition-universities/"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 32139735,
      "score": 2,
      "time": 1658159481,
      "title": "Crypto miners aren't honest about power use – time for a crackdown",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/18/cryptominers_us_crackdown/"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 32139734,
      "score": 1,
      "time": 1658159478,
      "title": "The Hypocrisy of Elites",
      "type": "story",
      "url": "https://eriktorenberg.substack.com/p/the-hypocrisy-of-elites"
    },
    {
      "by": "gentleman11",
      "descendants": 0,
      "id": 32139727,
      "score": 1,
      "time": 1658159444,
      "title": "HP Printers Try to Send Data Back to HP About Your Devices and What You Print",
      "type": "story",
      "url": "https://robertheaton.com/2019/09/15/hp-printers-send-data-on-what-you-print-back-to-hp/"
    },
    {
      "by": "yonis",
      "descendants": 0,
      "id": 32139716,
      "score": 1,
      "time": 1658159400,
      "title": "Ricky Romero: Design and Code",
      "type": "story",
      "url": "https://hello.rickyromero.com"
    },
    {
      "by": "chazeon",
      "descendants": 0,
      "id": 32139707,
      "score": 1,
      "time": 1658159354,
      "title": "Scrape and import AppStore order & receipt into Beancount",
      "type": "story",
      "url": "https://github.com/chazeon/beancount-extra/tree/master/importers/itunes"
    }
  ]
}