{
  "stories": [
    {
      "by": "Redoubts",
      "descendants": 0,
      "id": 28196664,
      "score": 1,
      "time": 1629110373,
      "title": "Python Packaging: A Thread",
      "type": "story",
      "url": "https://twitter.com/glyph/status/1427077655627661315"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28196661,
      "score": 1,
      "time": 1629110310,
      "title": "EasyWSL: Use Docker Containers as WSL Distros",
      "type": "story",
      "url": "https://github.com/redcode-labs/easyWSL"
    },
    {
      "by": "shivbhatt",
      "descendants": 0,
      "id": 28196658,
      "score": 1,
      "time": 1629110295,
      "title": "Social media fraud: The influencers promoting criminal scams",
      "type": "story",
      "url": "https://www.bbc.com/news/uk-58223499"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 28196649,
      "score": 1,
      "time": 1629110196,
      "title": "Washington state confirms the first report of a live murder hornet this year",
      "type": "story",
      "url": "https://agr.wa.gov/about-wsda/news-and-media-relations/news-releases?article=32673"
    },
    {
      "by": "willbenito",
      "descendants": 0,
      "id": 28196642,
      "score": 1,
      "text": "Battleface seem to be the only player doing this (quite poorly).  Tech-phobic industry in need of overhaul?",
      "time": 1629110136,
      "title": "On demand/bespoke travel insurance",
      "type": "story"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 28196638,
      "score": 1,
      "time": 1629110104,
      "title": "Living with Flare",
      "type": "story",
      "url": "https://briankoberlein.com/blog/living-with-flare/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28196629,
      "score": 1,
      "time": 1629110030,
      "title": "Ramanujan Summation",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ramanujan_summation"
    },
    {
      "by": "elenaturner",
      "descendants": 0,
      "id": 28196622,
      "score": 1,
      "time": 1629109924,
      "title": "Tech Can't Fix It",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/10/technology/tech-solutions.html"
    },
    {
      "by": "rich-cartwright",
      "descendants": 0,
      "id": 28196603,
      "score": 1,
      "text": "Hey HN! I&#x27;m Richie from Fella (www.joinfella.com), a telehealth clinic for men with obesity. We match fellas with a board-certified obesity doctor to prescribe an FDA-approved medication, and also match them with a psychological coach to tackle emotion-driven overeating.<p>I personally struggled in private with stress eating for 6 years [1]. During that time, I was at Cambridge University then built and sold my first company working with the UK government. It was stressful, and poor eating habits as a teenager became a coping mechanism as an adult.<p>Fella first started as a CBT+community product to help men struggling with stress eating. It resonated due to the stigma around men&#x27;s eating struggles. But we realized we were only half-serving most of our customers: even when no longer stress eating, most guys weren&#x27;t getting to a healthier weight.<p>So we started researching about effective, evidence-backed treatments for obesity.<p>When I say &quot;we&quot;, I really mean my co-founder Luke. He studied medicine at Cambridge University before transitioning into digital health, developing a patented AI approach to detecting cancer at a YC bio company, before moving to Microsoft Research. He parses bio papers better than me...<p>We learned that obesity treatment is about to radically change due to a breakthrough medication — NY Times called it a &quot;game changer&quot; in Feb 2021 [2]. The medication was FDA approved in June 2021 [3]. Main paper [4] and summary of phase 3 trials [5] are at the bottom of this post. But we also learned a medication-based approach is still stigmatized and hard to access.<p>So we pivoted to the Fella you see today: a telehealth experience with a board-certified obesity doctor for FDA-approved medication, and 1-on-1 psychological coaching to address emotion-driven overeating. We went live in Texas in July and are soon to be live in California &amp; New York. Fella costs $149&#x2F;month, paid quarterly.<p>We all know why obesity is a difficult problem to solve: for the vast majority of people willpower is not enough in today&#x27;s world. The deeper causes of obesity (metabolic issues &amp; emotion-driven eating) are mostly overlooked by the weight loss industry and family doctors, who focus too much on &quot;eat less, move more&quot;.<p>Why our solution is needed:\n1. Medication-assisted treatment for obesity is still stigmatized and hard to access.\n2. Stress eating is wildly prevalent among bigger guys, but it&#x27;s rarely recognized as a problem and there is a perception that eating struggles are a &quot;woman thing&quot; — so men often don&#x27;t seek help.\n3. Men represent only 10% of those using weight management services despite men representing 50% of those with obesity. Almost all programs market to women, often placing too much emphasis on looks and not enough on health for a male audience.<p>We still have lots of difficulties ahead. The main one could be insurance reimbursement: the latest wave of medications are expensive and insurers don&#x27;t like to cover them [6].<p>We’re excited to hear your ideas, questions, concerns, feedback — and maybe any personal stories. I’ll be responding to comments all day, or please feel free to shoot me an email at richie@joinfella.com.<p>[1] https:&#x2F;&#x2F;www.itv.com&#x2F;news&#x2F;anglia&#x2F;2020-11-09&#x2F;cambridge-graduate-who-ate-10k-calories-in-1-day-starts-online-eating-disorders-support-network<p>[2] https:&#x2F;&#x2F;www.nytimes.com&#x2F;2021&#x2F;02&#x2F;10&#x2F;health&#x2F;obesity-weight-loss-drug-semaglutide.html<p>[3] https:&#x2F;&#x2F;www.fda.gov&#x2F;news-events&#x2F;press-announcements&#x2F;fda-approves-new-drug-treatment-chronic-weight-management-first-2014<p>[4] https:&#x2F;&#x2F;www.nejm.org&#x2F;doi&#x2F;full&#x2F;10.1056&#x2F;NEJMoa2032183<p>[5] https:&#x2F;&#x2F;www.thelancet.com&#x2F;journals&#x2F;landia&#x2F;article&#x2F;PIIS2213-8587(21)00081-4&#x2F;fulltext<p>[6] https:&#x2F;&#x2F;www.bloomberg.com&#x2F;opinion&#x2F;articles&#x2F;2021-07-19&#x2F;weight-loss-drug-wegovy-could-help-millions-will-insurers-buy-in",
      "time": 1629109717,
      "title": "Fella (YC W20) – Helping men tackle obesity using medication and therapy",
      "type": "story"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 28196581,
      "score": 1,
      "time": 1629109448,
      "title": "Chrome's automatic updates is the real source of power it holds on the web",
      "type": "story",
      "url": "https://utcc.utoronto.ca/~cks/space/blog/web/ChromeAutoupdatesAndPower"
    }
  ]
}