{
  "stories": [
    {
      "by": "HieronymusBosch",
      "descendants": 0,
      "id": 31203187,
      "score": 1,
      "time": 1651224796,
      "title": "Mesa Can Be Built with Select Video Codecs Disabled for Software Patent Concerns",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Optional-Video-Codecs"
    },
    {
      "by": "throwmeawayapr",
      "descendants": 0,
      "id": 31203186,
      "score": 1,
      "text": "Two years ago I had an option to go into the management path. My leadership was supportive and wanted me to take up the opportunity. I chose to pivot into the product management instead. My peer took that role. My role change didn’t go very well. Personally i was unhappy and felt unfulfilled at work. While I was respected at work and my manager very supportive I didn’t enjoy it. I quit and joined another company and pivoted into program management. Since then my work hours have doubled and while I am earning the highest paycheck I could have dreamed of, I am extremely unhappy being an IC.  I have 25 years of industry experience and I feel I should mentor people instead of moving JIRA tickets around.<p>Yesterday I saw my former colleague who grabbed the manager role, got promoted to a director. I was hard working and intelligent than him. I could’ve played my card right and be in that place. Yet here I am being ‘advanced beginner’ in a different role every couple of years doing grunt IC work. How do I turn the wheel of time back and undo my career mistake. I feel incredibly stupid. I am losing confidence in making good decisions.<p>How do I deal with my feelings? Should I seek professional help?",
      "time": 1651224790,
      "title": "Ask HN: Dealing with Career Mistakes",
      "type": "story"
    },
    {
      "by": "ZionSpirit",
      "descendants": 0,
      "id": 31203181,
      "score": 1,
      "time": 1651224736,
      "title": "After $2k in earnings I almost didn't publish this copywriting masterpiece",
      "type": "story",
      "url": "https://zionspirit.medium.com/stop-dreaming-start-earning-621dbf445bec"
    },
    {
      "by": "mariuz",
      "descendants": 0,
      "id": 31203178,
      "score": 1,
      "time": 1651224713,
      "title": "Russia rolls back vehicle standards over 30 years as sanctions hit supply chains",
      "type": "story",
      "url": "https://trans.info/en/russia-vehicle-standard-285647"
    },
    {
      "by": "nola-a",
      "descendants": 0,
      "id": 31203154,
      "score": 1,
      "time": 1651224496,
      "title": "Telegram Bot API vs. Curl",
      "type": "story",
      "url": "https://gist.github.com/nola-a/32fd5081baa717c6fe653bd92d9e64e9"
    },
    {
      "by": "redocecin",
      "descendants": 0,
      "id": 31203144,
      "score": 1,
      "text": "Building a website from scratch is hard and takes a lot of time. That&#x27;s why there are many website designing tools out there which let users to design a beautiful website with ease. However, their generated code is not easy to be reused or maintained by developers. If you know or experience with any tool being good at code generation, please share with me, thanks a lot.",
      "time": 1651224377,
      "title": "Ask HN: Which are the best tools for generating websites?",
      "type": "story"
    },
    {
      "by": "jonquark",
      "descendants": 0,
      "id": 31203114,
      "score": 1,
      "time": 1651223974,
      "title": "IoT code smells: Work triggered by a device reconnection",
      "type": "story",
      "url": "https://amlen.org/index.php/2022/04/29/iot-code-smells-work-triggered-by-a-device-reconnection/"
    },
    {
      "by": "konsalexee",
      "descendants": 0,
      "id": 31203108,
      "score": 1,
      "time": 1651223932,
      "title": "Slack notification removal for Chrome to reclaim your attention span",
      "type": "story",
      "url": "https://gist.github.com/konsalex/4dada233754998d993385a518017b856"
    },
    {
      "by": "madmax108",
      "descendants": 0,
      "id": 31203093,
      "score": 1,
      "time": 1651223764,
      "title": "How Big Tech Runs Tech Projects and the Curious Absence of Scrum",
      "type": "story",
      "url": "https://blog.pragmaticengineer.com/project-management-at-big-tech/"
    },
    {
      "by": "altacc",
      "descendants": 1,
      "id": 31203079,
      "kids": [
        31203105
      ],
      "score": 2,
      "time": 1651223641,
      "title": "The billable hour is a trap more and more of us are falling into",
      "type": "story",
      "url": "https://www.ft.com/content/3d4e70e2-43db-4180-add8-4656b42189bd"
    }
  ]
}