{
  "stories": [
    {
      "by": "mindcrime",
      "descendants": 0,
      "id": 31823347,
      "score": 1,
      "time": 1655816304,
      "title": "Analog Computing for Molecular Dynamics",
      "type": "story",
      "url": "https://arxiv.org/abs/2107.06283"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31823342,
      "score": 2,
      "time": 1655816281,
      "title": "Thinking Like a Scientist Will Make You Happier – Science Connected",
      "type": "story",
      "url": "https://nautil.us/thinking-like-a-scientist-will-make-you-happier-19974/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31823339,
      "score": 1,
      "time": 1655816275,
      "title": "Reproducible Development with Devcontainers",
      "type": "story",
      "url": "https://www.infoq.com/articles/devcontainers/"
    },
    {
      "by": "anupamchugh",
      "descendants": 0,
      "id": 31823332,
      "score": 1,
      "time": 1655816239,
      "title": "Working on Cloud vs. Mobile Is Different: From a Google and Ex-Microsoft Dev",
      "type": "story",
      "url": "https://betterprogramming.pub/why-working-on-cloud-vs-mobile-edge-is-so-different-e32930f1c801"
    },
    {
      "by": "fresh2dev",
      "descendants": 0,
      "id": 31823303,
      "score": 1,
      "text": "Years ago, I worked for a pittance as a Windows SysAdmin at a non-profit. In my off-hours, I hacked away creating many open-source tools in hopes of padding the resume and blossoming into a new gig.<p>I did eventually land a more fruitful role as a software dev at MegaCorp. Fast-forward to now, I&#x27;m a much more seasoned developer&#x2F;engineer, though my passion for the Windows ecosystem has diminished (I still love you, Powershell). However, one of the Windows tools I developed years back has experienced impressive organic growth, despite getting few commits since its introduction. It&#x27;s a tool for creating tools, specifically desktop apps for Windows, and it&#x27;s dead-simple; the lowest learning curve one could hope for. In the past, I used this tool daily, but haven&#x27;t needed it since switching to Linux some years ago.<p>I recently got some time off, and revisited this project. I intended to spend a few days on it. Those days naturally turned into weeks, but it was fun to reminisce. This old project is now refreshed and looking <i>good</i>, with new capabilities, and even decent documentation.<p>Now that I&#x27;m essentially ready to release, I&#x27;m just now asking myself &quot;why?&quot;, and am feeling a bit foolish. Even with these updates, I&#x27;m not going to rely on this app; I&#x27;m out of the Windows space. But I like that the project has received sustained interest and is apparently providing value. While this tool can take many forms, the dominant use-case for this tool is IT folks creating desktop apps for their companies. But my tool is MIT-licensed, FOSS. With that understanding, I feel like a bit of a... cuck developer. With this tool, an individual can do in minutes what would usually take a team weeks. Despite the value-add my tool is introducing, I&#x27;ve never received (or asked for) a dollar.<p>I&#x27;m both deciding <i>if</i> I should monetize, and also <i>how</i>. I want this tool to continue to free for personal use, but if its being used at at a company, I want payment (even if its mostly symbolic). I do not want to assume an aggressive position, but I do want to be assertive and self-respecting. I&#x27;m considering the following:<p>1. accept donations, and strongly encourage tips&#x2F;donations if this tool is used in an enterprise.\n2. change the license, add telemetry to the app, check for license keys, nag users, yada-yada. i.e., follow the WinZip model. This is the Windows ecosystem afterall; maybe I could throw some ads in there x)<p>Seems like both approaches rely on good-faith, since any license-check measures wouldn&#x27;t be difficult to block&#x2F;bypass. I&#x27;m hesistant about #2 because (1) it would require additional work, and (2) user backlash. When I think about my goals here, I feel like there&#x27;s a dilemma (possibly a false dilemma) between:<p>1. many users using my app for free.\n2. very few (or none) using my app, but those users are paying users.<p>If money is the motivation, then one user paying $1 is better than millions paying nothing. But I also like the satisfaction I get seeing my work be consumed and appreciated by folks all over the world.<p>I never met my grandfather, but I&#x27;m told he was unanimously adored by his community, partly due to his endless generosity. Flat tire? He&#x27;d fix it; no charge. Help moving? Sure thing; no charge. That was his M.O. He also struggled to feed his family, Grandma divorced, and he died young and poor. I admire my grandfather&#x27;s passion, but I took this as a lesson of what <i>not</i> to do. If my grandfather were alive today, I suspect he&#x27;d be slaving away on FOSS projects for GitHub stars, and I believe he would want better for me.<p>Money is not <i>the</i> motivation, but money is <i>a</i> motivation.<p>HN, what do you recommend?",
      "time": 1655816079,
      "title": "Ask HN: (How) Should I monetize this?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31823258,
      "score": 1,
      "time": 1655815834,
      "title": "Micron shows off 1.5TB microSD card for embedded apps",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/21/micron_i400_microsd/"
    },
    {
      "by": "carlyboy",
      "descendants": 0,
      "id": 31823257,
      "score": 1,
      "time": 1655815829,
      "title": "Show HN: The Shapley Value in Machine Learning",
      "type": "story",
      "url": "https://github.com/AstraZeneca/awesome-shapley-value"
    },
    {
      "by": "Aldipower",
      "descendants": 0,
      "id": 31823252,
      "score": 1,
      "time": 1655815808,
      "title": "Sennheiser Vocoder and Moog Synthesizer Presented in German TV (1978) [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=FLljyZ2ojbA"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 31823237,
      "score": 2,
      "time": 1655815704,
      "title": "TikTok commits to align with EU rules to better",
      "type": "story",
      "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_22_3823"
    },
    {
      "by": "thestrangeroots",
      "descendants": 0,
      "id": 31823226,
      "score": 2,
      "time": 1655815659,
      "title": "An infographic about the etymology of personal computer names",
      "type": "story",
      "url": "https://pbs.twimg.com/media/FVxvArKX0AA7Zxc?format=jpg&name=4096x4096"
    }
  ]
}