{
  "stories": [
    {
      "by": "cosmorocket",
      "descendants": 0,
      "id": 30191017,
      "score": 1,
      "text": "I am almost 40 and have been working as a fullstack and frontend web developer for last 12 years as a contractor or a full-time employee for different companies. I learnt and familiar with quite a bunch of tech stack, libraries and tooling around it, using them when needed.<p>During last 3-4 years I had to end my relationship with with 3 clients&#x2F;employers due to me being slow in producing code. The reason was always - I cannot deliver as much as my colleagues could or as the employer expected me to.<p>I am good at communication. People I work with always say I am nice to work with, adding vitality to the daily team work, but eventually things go worse as I am usually slower than my colleagues.<p>I sincerely love technology, web stuff, API, structuring, organising and connecting things together, but it ultimately takes more time for me to get things done than other people.<p>The problem is quite clear to me but I don’t see the way to improve the situation. I cannot deliver faster because I already optimise everything I can. Even during the tech interviews (one was just today) I see that I don’t achieve the expected result.<p>If the time pressure is lower, at the end I deliver high-quality readable code, but the time is always the part of the formula, and I understand it, because business needs everything to be delivered faster and sooner.<p>I feel quite sad and depressed when I see how easily and quickly my colleagues get into the problems and find solutions while I have to spend more time and as a result I question myself as a professional.<p>How can I improve or should I lower my expectations for the employers and look for less-demanding lower-paying clients&#x2F;companies? Should I switch to some other tech area where the time to deliver is not the key factor (are there any)? May be there are techniques to improve my thought process?<p>Any advise is appreciated as I feel like if things keep going this way, I won’t be able to keep staying on a par with other developers around.",
      "time": 1643886406,
      "title": "Ask HN: I am a slow developer. What can I do with this?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30190986,
      "score": 1,
      "time": 1643886080,
      "title": "Freud's Nephew and the Origins of Public Relations",
      "type": "story",
      "url": "https://www.npr.org/templates/story/story.php?storyId=4612464"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 30190985,
      "score": 1,
      "text": "If you want to have a sense of how those languages translate into machine code, they have just been made available.<p>Nothing to do with it, just spreading the word.<p>https:&#x2F;&#x2F;godbolt.org&#x2F;<p>https:&#x2F;&#x2F;twitter.com&#x2F;CompileExplore&#x2F;status&#x2F;1488656420736274437",
      "time": 1643886075,
      "title": "Compiler Explorer now supports C#, F# and Visual Basic",
      "type": "story"
    },
    {
      "by": "dandare",
      "descendants": 0,
      "id": 30190984,
      "score": 1,
      "text": "Here is the paper: https:&#x2F;&#x2F;sites.krieger.jhu.edu&#x2F;iae&#x2F;files&#x2F;2022&#x2F;01&#x2F;A-Literature-Review-and-Meta-Analysis-of-the-Effects-of-Lockdowns-on-COVID-19-Mortality.pdf<p>Here is a random article: https:&#x2F;&#x2F;www.dailywire.com&#x2F;news&#x2F;johns-hopkins-study-lockdowns-had-little-to-no-effect-on-covid-19-mortality-but-had-devastating-effects-on-society<p>There is very little coverage in mainstream media, is it because the study is not influential?",
      "time": 1643886033,
      "title": "Ask HN: John Hopkins study says lockdowns are ineffective. What do you think?",
      "type": "story"
    },
    {
      "by": "Stevvo",
      "descendants": 0,
      "id": 30190982,
      "score": 1,
      "time": 1643886025,
      "title": "Glorified Electric Golf Carts for All",
      "type": "story",
      "url": "https://www.vice.com/en/article/y3vny5/glorified-electric-golf-carts-for-all"
    },
    {
      "by": "throwawayffffas",
      "descendants": 0,
      "id": 30190968,
      "kids": [
        30190994
      ],
      "parts": [
        30190969,
        30190970,
        30190971,
        30190972,
        30190973,
        30190974,
        30190975,
        30190998
      ],
      "score": 1,
      "time": 1643886011,
      "title": "Poll: How do you package/distribute your app for Linux?",
      "type": "poll"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30190959,
      "score": 2,
      "time": 1643885887,
      "title": "How One Company Took over the NFT Trade",
      "type": "story",
      "url": "https://www.theverge.com/2022/2/2/22914081/open-sea-nft-marketplace-web3-fundraising-finzer-a16z"
    },
    {
      "by": "brlnwest",
      "descendants": 0,
      "id": 30190955,
      "score": 1,
      "time": 1643885870,
      "title": "Getting Started with Git Bash",
      "type": "story",
      "url": "https://www.git-tower.com/blog/git-bash/"
    },
    {
      "by": "dantti",
      "descendants": 0,
      "id": 30190930,
      "score": 1,
      "time": 1643885664,
      "title": "Qt Allstack I – Setup",
      "type": "story",
      "url": "https://www.kdab.com/qt-allstack-part-1-setup/"
    },
    {
      "by": "WalterGR",
      "descendants": 0,
      "id": 30190925,
      "score": 1,
      "time": 1643885606,
      "title": "FCC proposal would stop spammers leaving ringless voicemails on cellphones",
      "type": "story",
      "url": "https://www.engadget.com/fcc-ringless-voicemail-proposal-190626636.html"
    }
  ]
}