{
  "stories": [
    {
      "by": "gcheong",
      "descendants": 0,
      "id": 31756600,
      "score": 1,
      "time": 1655315358,
      "title": "Apple's Backup Plan to Stop Antitrust Legislation",
      "type": "story",
      "url": "https://mattstoller.substack.com/p/apples-backup-plan-to-stop-antitrust"
    },
    {
      "by": "happyopossum",
      "descendants": 0,
      "id": 31756591,
      "score": 1,
      "time": 1655315333,
      "title": "Bill Gates says crypto and NFTs are a sham",
      "type": "story",
      "url": "https://www.cnn.com/2022/06/15/tech/bill-gates-crypto-nfts-comments/index.html"
    },
    {
      "by": "henkie_bk5",
      "descendants": 1,
      "id": 31756589,
      "kids": [
        31756590
      ],
      "score": 1,
      "time": 1655315331,
      "title": "GPU ray tracing tutorial – 10 articles",
      "type": "story",
      "url": "https://jacco.ompf2.com/2022/06/15/how-to-build-a-bvh-part-9b-massive/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31756573,
      "score": 1,
      "time": 1655315270,
      "title": "M2 Geekbench",
      "type": "story",
      "url": "https://browser.geekbench.com/v5/cpu/15482594"
    },
    {
      "by": "Doches",
      "descendants": 1,
      "id": 31756569,
      "kids": [
        31756588
      ],
      "score": 1,
      "text": "Hey, HN -- I just received the following email and I&#x27;m not sure what to do about it. Obviously I want to discourage requested-posting like this; is there some structured way that we can do that? One of the things I love about HN is how high the signal-to-noise ratio is relative to...pretty much the rest of the internet.<p>I wouldn&#x27;t ordinarily call someone out like this, but I want to innoculate HN against this sort of thing.<p>----<p>Hey doches,<p>Not sure if it&#x27;s conventional, but thought I&#x27;d ask anyway.<p>Would you be open to posting about my product on Hacker News?<p>I understand that similar to Product Hunt, HN gives higher priority to users with higher karma. I usually keep up with recent discussions via RSS feed on Feedly, but almost neve post. So I thought I&#x27;d reach out to someone that has authority.<p>My product is called Popupular and it helps embed just about anything into a popup via a Google Chrome extension.<p>[rest of email truncated]",
      "time": 1655315266,
      "title": "Show HN: Soliciting post placement on Hacker News",
      "type": "story"
    },
    {
      "by": "s_mausi",
      "descendants": 0,
      "id": 31756567,
      "score": 1,
      "text": "Some background:\nWe are a seed stage startup, we built a chrome extension that allows u to record audio messages anywhere, it gets transcribed, some ml stuff. Then u can share the link, if the other person also has the CE they can play it wherever they find the link. Of course, we also have a web app that does normal messaging app stuff. \nRegister for testing: https:&#x2F;&#x2F;app.getvoiceline.com&#x2F;6b29fbc80d<p>Question: We have some problems with CSP violations. Some pages like StackOverflow don’t even prompt the user for microphone permissions.<p>Others, like Twitter, allow specific media sources. As long as they still allow blobs, we can work around that by sending the blob as a stringified message over the chrome messaging and rebuilding it in the DOM to then play it. Github and Gitlab are much more restrictive.\nIMO google should allow chrome extensions to change certain aspects of the CSPs, after all, you want to transform your browser experience with the extensions.\nIt works well on the major co-working tools like gsuite or notion, but we would really like to bring it to more engineers and the websites they use.<p>Did any of you deal with similar constraints before?",
      "time": 1655315256,
      "title": "Ask HN: Would you deal with CSPs when building audio- Chrome Extensions",
      "type": "story"
    },
    {
      "by": "carlycue",
      "descendants": 0,
      "id": 31756518,
      "score": 1,
      "time": 1655315051,
      "title": "Geekbench 5 score for Apple M2 chip: 1919 single core, 8929 multi core",
      "type": "story",
      "url": "https://twitter.com/tapbot_paul/status/1537123331790491650"
    },
    {
      "by": "lando2319",
      "descendants": 0,
      "id": 31756515,
      "score": 2,
      "time": 1655315029,
      "title": "Come across a charming small biz in a sea of generic chains, ask about landlord",
      "type": "story",
      "url": "https://twitter.com/McReynoldsJoe/status/1536811067992678400"
    },
    {
      "by": "bewuethr",
      "descendants": 0,
      "id": 31756507,
      "score": 1,
      "time": 1655314991,
      "title": "Important Changes to Our Business",
      "type": "story",
      "url": "https://medium.com/wealthsimple/important-changes-to-our-business-ee2b8b54c7a2"
    },
    {
      "by": "securitythrown",
      "descendants": 0,
      "id": 31756476,
      "score": 1,
      "text": "I’m sitting pretty comfy and decently paid (not faang) in a senior security position in a rather good company.<p>With the current market looks coupled with some upgrades I would like to do to my house and hobbies I would like to do some extra work instead of changing my currently strict budgeting.<p>I’ve tried to look industry work outside of “normal business” hours but I’ve come up short. Unless I want to do tier 1 help desk or SOC monitoring. Which I don’t want to do as I’ve already paid my dues in those trenches.<p>I’ve thought about consulting but I don’t really see a market. Typical consumers don’t care about “enterprise” grade security. I’ve thought about double dipping as I’ve seen a ton of openings in my wheelhouse. I do have some moral issues with double dipping. Currently I have full control of my schedule and it’s very lite on meetings. I could probably handle 2 9-5 jobs simultaneously. I worry about employment verifications and how my current employer could find out via background checks or credit reports.<p>Anyways looking for any advice from anyone who currently or formally double dipped and or finding after hours work.",
      "time": 1655314853,
      "title": "How do you obtain “after hours” work / double dip?",
      "type": "story"
    }
  ]
}