{
  "stories": [
    null,
    null,
    {
      "by": "commoner",
      "descendants": 0,
      "id": 30027649,
      "score": 1,
      "time": 1642789129,
      "title": "System76’s Cosmic Desktop Panel Looks Refreshing",
      "type": "story",
      "url": "https://news.itsfoss.com/system76-cosmic-panel/"
    },
    {
      "by": "stakkur",
      "descendants": 0,
      "id": 30027639,
      "score": 3,
      "time": 1642789083,
      "title": "Nurses: We Know the Real Cause of the Crisis in Our Hospitals. It’s Greed",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/19/opinion/nurses-staffing-hospitals-covid-19.html"
    },
    {
      "by": "LeslieDewhurst",
      "descendants": 0,
      "id": 30027634,
      "score": 1,
      "text": "Why Snark Hunting is the new obsession of Health-Tech VC’s.<p>Not everybody will have read The Hunting of the Snark, a nonsense poem by Victorian writer and Alice in Wonderland creator, Lewis Carroll. In it a hunting team, including a Barrister, Butcher, Baker, Banker and Broker - just the crew today’s working-from-home VC needs! - pursue the far-away and elusive but much prized Snark whilst carefully avoiding the Boojum, a lethal creature that’s been known to masquerade as a Snark. Many Snark hunters think they’ve netted their quarry, only to discover at the very last moment that they’ve found something far more lethal as the Boojum vanishes them quietly, never to be seen again.<p>Of course Carroll’s poem is an allegory,  initially thought to be about the challenges of finding a cure for TB (not really provided until the advent of modern antibiotics in the 1930’s) and in Carroll’s own words some 20 years after publication: about the search for happiness. Now, nearly 150 years on, we can see clearly what the sagacious Lewis Carroll had in mind when he wrote his poem: Digital Health VC’s in their hunt for the next great, great health-tech breakthrough, are the real Snark Hunters.<p>There’s been an outbreak of VC Snark Hunting in the last couple of years. Finding and financing that elusive next big big digital health thing that’s far away into the future is the new obsession. This is no idle theory, as I’ve had it confirmed in the last few days by two respected German VCs. Essentially both said:\n“We are looking for investments in markets that will be worth many Billions in a decade or so’s time. These are the markets where true innovation lies and they are very, very difficult to find.”\nIn other words: they’re Snark Hunting.<p>If you’re a VC or an investment fund, there are good reasons to go Snark Hunting, one of the best being that hunting for multi-billion dollar Snarks ten years hence, discounts to billion dollar Snarks at today’s prices. Good news if your fund is looking for a further raise or two on the back of those billion-dollar Snarks you’ve already snagged.<p>Equally attractive, though missed by Snark Hunters in their rush to invest, are today’s digital health businesses that are looking for funding now and are addressing Billion-Dollar markets that are here now and not ten years hence. Health-AI is one of them and they’ll be many more spread globally; but if the VC Radar setting’s on long-distance those here and now opportunities are going to be missed in the chaff from distant, far away digital Snarks.<p>And let’s remember, there’s also those Billions of Investor’s money tied-up in Snark Hunting.<p>We should leave the last words to Lewis Carroll who towards the poem’s end, relates that the Baker, anxious to bag the Snark, rushes ahead and cries out that the Shark has been found:\n“In the midst of the word he was trying to say,\nIn the midst of his laughter and glee,\nHe had softly and suddenly vanished away -\nFor the Snark was a Boojum, you see”<p>Many Snark Hunting VC’s will be encountering Boojums in the next 10 or so years.<p>@DewhurstLeslie",
      "time": 1642789072,
      "title": "Why Snark Hunting Is the New Obsession of Health-Tech VC's",
      "type": "story"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30027633,
      "score": 1,
      "time": 1642789065,
      "title": "Notice anything about the Google Image Search results for 'frustrating'?",
      "type": "story",
      "url": "https://www.google.com/search?q=frustrating&tbm=isch"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30027628,
      "score": 2,
      "time": 1642789056,
      "title": "European Commission launches new open source software bug bounty program",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/european-commission-launches-new-open-source-software-bug-bounty-program"
    },
    {
      "by": "EZ-Cheeze",
      "descendants": 0,
      "id": 30027620,
      "score": 1,
      "time": 1642789046,
      "title": "Primates vs. Snakes (An Evolutionary Arms Race) (9m10s)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=FbCoKIW0LGE"
    },
    {
      "by": "furcyd",
      "descendants": 0,
      "id": 30027589,
      "score": 2,
      "time": 1642788968,
      "title": "Alexander Grothendieck",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Alexander_Grothendieck"
    },
    {
      "by": "JaimeThompson",
      "descendants": 0,
      "id": 30027538,
      "score": 2,
      "time": 1642788771,
      "title": "Company plans to send metal extractor to the Moon in mid-2020s",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/01/machine-to-melt-moon-rocks-and-derive-metals-may-launch-in-2024/"
    }
  ]
}