{
  "stories": [
    {
      "by": "andyjohnson0",
      "descendants": 0,
      "id": 30946802,
      "score": 1,
      "time": 1649349268,
      "title": "Keeping Time into the Great Beyond",
      "type": "story",
      "url": "https://www.noemamag.com/keeping-time-into-the-great-beyond/"
    },
    {
      "by": "iimpact",
      "descendants": 0,
      "id": 30946797,
      "score": 1,
      "text": "Looking for solutions out there, or recommendations for macOS. Specifically, static log files (structured JSON) that is easy to filter and has color coding (log levels).<p>What I am finding is that there are mainly &quot;tail&quot; type log viewers via the terminal, or cloud based. I&#x27;m looking for something local I can install.",
      "time": 1649349222,
      "title": "Ask HN: What do you use to view logs?",
      "type": "story"
    },
    {
      "by": "greentfrapp",
      "descendants": 1,
      "id": 30946792,
      "kids": [
        30946795
      ],
      "score": 1,
      "time": 1649349195,
      "title": "Show HN: Redditle.com – For those of us who add 'Reddit' to every Google search",
      "type": "story",
      "url": "https://redditle.com"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30946763,
      "score": 1,
      "time": 1649349049,
      "title": "David Chaum Went from Inventing Digital Cash to Pioneering Digital Privacy",
      "type": "story",
      "url": "https://decrypt.co/95109/david-chaum-from-inventing-digital-cash-to-pioneering-digital-privacy"
    },
    {
      "by": "NelsonMinar",
      "descendants": 1,
      "id": 30946746,
      "kids": [
        30946762
      ],
      "score": 2,
      "time": 1649348996,
      "title": "Deception, exploited workers, and cash handouts: Worldcoin recruitment",
      "type": "story",
      "url": "https://www.technologyreview.com/2022/04/06/1048981/worldcoin-cryptocurrency-biometrics-web3/"
    },
    {
      "by": "sudhirj",
      "descendants": 0,
      "id": 30946708,
      "score": 1,
      "time": 1649348838,
      "title": "Generic slice/collection utility methods for Go",
      "type": "story",
      "url": "https://github.com/sudhirj/slicy"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30946701,
      "score": 1,
      "time": 1649348803,
      "title": "Battery Management Getting Competitive for EVs",
      "type": "story",
      "url": "https://semiengineering.com/battery-management-getting-competitive-for-evs/"
    },
    {
      "by": "frank2568",
      "descendants": 1,
      "id": 30946679,
      "kids": [
        30946680
      ],
      "score": 1,
      "time": 1649348749,
      "title": "Dbosoft Hosuto version 1.0 released",
      "type": "story",
      "url": "https://github.com/dbosoft/Hosuto"
    },
    {
      "by": "Volrath89",
      "descendants": 0,
      "id": 30946641,
      "score": 6,
      "text": "I&#x27;m a mid 30s male, software developer, married without children.<p>I started playing a video game at the end of 2019, and played every time I could when my wife was not home. Then came 2020, covid lockdowns, also I started getting better at the game (the ladder systems are so addictive) and played more. In 2021 I just didn&#x27;t care anymore whether my wife was home or not or even if I was supposed to be working and started playing all the time. I&#x27;d wake up early to play and would go to bed late to catch up with work I had not done during the day.<p>According to Steam I played over 2.000 hours during 2020 and 2021.<p>Finally I decided I was seriously addicted and uninstalled the game, unsubscribed from everyone related to the game in youtube, quit all discord communities, and it worked.<p>I have been now &quot;clean&quot; for 4 months. But sometimes I crave to go back and play. I watched a youtube video in incognito recently of some famous player and had so much urge to play again. But I&#x27;m afraid just by installing the game I will be going back to the addiction.<p>Is it possible to have a &quot;healthy&quot; amount of playing? Let&#x27;s say just a couple of hours in the weekends? The only reason I think I have been able to not play for 4 months is because it&#x27;s time consuming for me to download&#x2F;install the game again, set my keyboard shortcuts, etc. It will take at least 1 hour for me to set up everything and that&#x27;s what is preventing me to go back. But if I had the game available and ready to launch in a click I am not sure I would be able to play only some hours on the weekends.<p>What I love about this particular game is how I can totally focus mind and body for each 30-40 minutes match where I won&#x27;t take a look at my cellphone or anything can distract me really because I&#x27;m totally focused basically in a real &quot;flow&quot; state. Of course it&#x27;s a flow state for something irrelevant to my life or society, so it&#x27;s basically a waste of time I guess... But I also don&#x27;t have the change to get to this flow state in my day job or in other activity really, adult life can be so boring sometimes...<p>Really curious if someone else has experienced something similar",
      "time": 1649348617,
      "title": "Ask HN: How do you avoid video game addiction?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30946640,
      "score": 1,
      "time": 1649348614,
      "title": "Seven years of interesting datasets from Data Is Plural newsletter",
      "type": "story",
      "url": "https://docs.google.com/spreadsheets/d/1wZhPLMCHKJvwOkP4juclhjFgqIY8fQFMemwKL2c64vk/edit#gid=0"
    }
  ]
}