{
  "stories": [
    {
      "by": "elephant_burger",
      "descendants": 0,
      "id": 28116304,
      "score": 1,
      "time": 1628514593,
      "title": "Charlie Munger Inversion: Suppose I want an easy way to kill a lot of pilots?",
      "type": "story",
      "url": "https://mannhowie.com/inversion"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28116297,
      "score": 1,
      "time": 1628514574,
      "title": "Get the Drop on Sorting",
      "type": "story",
      "url": "https://kevlinhenney.medium.com/get-the-drop-on-sorting-4d8cd1b91780"
    },
    {
      "by": "konne88",
      "descendants": 0,
      "id": 28116288,
      "score": 1,
      "text": "Hi HN, we are Stefan and Konstantin, co-founders of Financial Choice (<a href=\"https:&#x2F;&#x2F;financialchoice.com\" rel=\"nofollow\">https:&#x2F;&#x2F;financialchoice.com</a>). We offer a checking account alternative that lets users invest their balance (not FDIC insured), otherwise it works just like a normal checking account.<p>Our background is in computer science (we’re ex-Googlers), but we also love modern portfolio theory, and long-term investment in low-cost, broadly diversified index funds (we’re big Bogleheads fans). Annoyed by our checking account’s low returns, we asked ourselves if there was a way to invest our checking account balances, but still keep the checking account features.<p>Financial Choice (FC) is our answer. When a user deposits money with FC, like a paycheck, FC automatically invests that money according to our user’s investment preference. When a user withdraws money, e.g. for rent&#x2F;mortgage or at the ATM, they get money instantly, while FC automatically triggers a sale of their investments to cover the withdrawal. In many cases, investments sell in time to directly cover the withdrawal, while other times, the withdrawal is made on margin until the investments’ sale completes.<p>Users choose what they want to invest in based on what risk they are comfortable with. Many invest in stock index funds (e.g. S&amp;P500 with 10.3% average annual return, -43.1% worst year [1]). Some users invest in bond index funds (e.g. 6.1% average annual return, -8.1% worst year [1]). Some choose socially responsible investments. Those with the lowest risk tolerance invest in US treasuries.<p>On a macroeconomic scale, we believe that our approach can solve major problems of the current banking system. Today, banks invest customers&#x27; deposits and keep the returns mostly for themselves (the national average interest rate is just 0.03% [2]). When there are losses, FDIC guarantees that customer deposits never lose money, but when the losses become significant enough (like they did in 2008 [3]), the taxpayer ends up paying with bailouts. With FC, users invest their money directly, so returns are transparent and there’s no need for bailouts.<p>Beyond giving people a choice, there’s also a couple other cool features that we’re excited about. Naturally there are funds flowing in and out of a checking account (paycheck, rent, bills, etc), and we can use these to automatically rebalance a portfolio. Similarly, we can optimize our users’ tax burden by being smart about which investments get sold and performing tax-loss harvesting.<p>Financial Choice is currently free to use and available in the US. We build on top of Fidelity that provides all checking and investing features. Building on top of an existing financial institution has been hugely helpful to get a full-featured product to our customers quickly (but it does mean that users have to share their credentials with us, similar to Plaid).<p>We’d love for you to try it out (sign up at <a href=\"https:&#x2F;&#x2F;financialchoice.com&#x2F;signup\" rel=\"nofollow\">https:&#x2F;&#x2F;financialchoice.com&#x2F;signup</a>), and give us feedback. We would also love to hear what you do with your checking account balance, and what you think the major problems with today’s banking system are (and how they can be fixed).<p>[1] <a href=\"https:&#x2F;&#x2F;investor.vanguard.com&#x2F;investing&#x2F;how-to-invest&#x2F;model-portfolio-allocation\" rel=\"nofollow\">https:&#x2F;&#x2F;investor.vanguard.com&#x2F;investing&#x2F;how-to-invest&#x2F;model-...</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.fdic.gov&#x2F;regulations&#x2F;resources&#x2F;rates&#x2F;historical&#x2F;2021-03-29.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fdic.gov&#x2F;regulations&#x2F;resources&#x2F;rates&#x2F;historical&#x2F;...</a>\n[3] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Financial_crisis_of_2007%E2%80%932008\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Financial_crisis_of_2007%E2%80...</a>",
      "time": 1628514538,
      "title": "Launch HN: Financial Choice (YC S21) – Checking accounts with market returns",
      "type": "story"
    },
    {
      "by": "eidam",
      "descendants": 1,
      "id": 28116284,
      "kids": [
        28116285
      ],
      "score": 1,
      "time": 1628514535,
      "title": "Show HN: Personal Zero-Trust HashiCorp Vault",
      "type": "story",
      "url": "https://github.com/eidam/personal-zero-trust-hashicorp-vault"
    },
    {
      "by": "vegetablepotpie",
      "descendants": 0,
      "id": 28116270,
      "score": 1,
      "time": 1628514450,
      "title": "Prolonged period of 'potentially dangerous heat' more likely for the Northwest",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/08/weather/heat-high-temperatures-northwest-northeast/index.html"
    },
    {
      "by": "woliveirajr",
      "descendants": 0,
      "id": 28116251,
      "score": 2,
      "time": 1628514324,
      "title": "AI has the worst superpower medical racism",
      "type": "story",
      "url": "https://lukeoakdenrayner.wordpress.com/2021/08/02/ai-has-the-worst-superpower-medical-racism/"
    },
    {
      "by": "lifechoice",
      "descendants": 1,
      "id": 28116188,
      "kids": [
        28116293
      ],
      "score": 3,
      "text": "I have an offer for a semi-tech role at a startup and they&#x27;re giving me solid equity. Like if it moderately works out I&#x27;ll get the price of a house.<p>What I&#x27;d rather do is code - either work on my own thing (who doesn&#x27;t I guess) or just be a SWE at a cool startup. To do that I&#x27;d like to take a year out of my current (semi-tech) role and do a MSc.<p>How do I balance these priorities? I don&#x27;t have a wife and kids yet.",
      "time": 1628514035,
      "title": "Ask HN: Money vs. Passion – What would you do?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 28116174,
      "score": 1,
      "time": 1628513959,
      "title": "Examining the consumption of radical content on YouTube",
      "type": "story",
      "url": "https://www.pnas.org/content/118/32/e2101967118"
    },
    {
      "by": "leoloso",
      "descendants": 0,
      "id": 28116169,
      "score": 1,
      "time": 1628513940,
      "title": "GraphQL should not be in WordPress core",
      "type": "story",
      "url": "https://graphql-api.com/blog/why-graphql-should-not-be-in-wordpress-core/"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 28116155,
      "score": 1,
      "time": 1628513872,
      "title": "Call centre used by UK firms accused of intrusively monitoring home workers",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/aug/08/call-centre-uk-firms-accused-intrusively-monitoring-home-workers-teleperformance"
    }
  ]
}