{
  "stories": [
    {
      "by": "PaulDavisThe1st",
      "descendants": 0,
      "id": 31913970,
      "score": 1,
      "text": "Following the SCOTUS Robb decision last week, there&#x27;s a lot of talk about the possibilty of medication-by-mail becoming a dominant means of abortion is those US states that pass laws to ban or severely limit the procedure.<p>For this this to be possible and safe will require a website somewhat akin to Silk Road, but unlike SR, one built without the ego-driven errors of its founder. Presumably onion routing, ex-USA hosting, a network of US-based individuals functioning as mailers in abortion-legal jurisdictions and much else will be necessary.<p>What would the full technological scope of such a site look like? I am assuming one impervious to anything except the NSA or its equivalent (for the time being, the NSA is not going to assist states investigating such a system, though that could change in the future).<p>Who should build it?",
      "time": 1656455707,
      "title": "Ask HN: Who will build a legal abortion medication website and with what tech?",
      "type": "story"
    },
    {
      "by": "prismatic",
      "descendants": 0,
      "id": 31913956,
      "score": 1,
      "time": 1656455607,
      "title": "Precedents of the Unprecedented: Black Squares Before Malevich",
      "type": "story",
      "url": "https://publicdomainreview.org/essay/black-squares-before-malevich/"
    },
    {
      "by": "b1n",
      "descendants": 0,
      "id": 31913944,
      "score": 2,
      "text": "EXAMPLES:<p>- &quot;I love how I have to watch 3 minutes of adverts before I watch the video.&quot;<p>- &quot;This [DISGUSTING LOOKING FOOD] looks delicious.&quot;<p>QUESTIONS:<p>- Wouldn&#x27;t the AI have to have human level understanding of the subject and the context around it?<p>- Couldn&#x27;t this lead to AIs creating products&#x2F;suggestions that are the opposite of what people want?<p>- If this is a real problem, is there a technical name for it?",
      "time": 1656455508,
      "title": "Ask HN: How can an AI/ML model distinguish between normal vs. sarcastic opinion?",
      "type": "story"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 31913939,
      "score": 1,
      "time": 1656455500,
      "title": "Electrify America Raises $450M to Further Boost Expansion",
      "type": "story",
      "url": "https://insideevs.com/news/594889/electrify-america-raises-450-million/"
    },
    {
      "by": "needdesigner",
      "descendants": 0,
      "id": 31913922,
      "score": 1,
      "text": "I&#x27;m the founder of a startup &amp; an engineer. My biggest pain point right now is finding a good designer.<p>We have tried just about everything:<p>- $2k&#x2F;day freelancer through a highly recommended design agency: lackluster, very little value for the money spent<p>- Remote agencies based in Europe: Moderately successful but the design feels a little amateur, and has no personality, i like that they propose lots of options but few of them are close to being usable.<p>- Individual freelancers found on WNW and similar sites: These are ok, they know how to use Figma and can work quickly, but they very rarely propose major improvements. Have to spend lots of time with them and nitpick obvious things to get a good result.<p>I look at other startups sites &amp; apps and they seem polished, fresh, modern, and have some personality to them as well. Did they struggle through many iterations to get there, or are there good designers out there that I am just not finding? Where can I find a designer or agency with good taste, creativity, and high attention to detail to revamp a homepage + web app of 5 pages.<p>Sincerely,<p>A very frustrated non-designer",
      "time": 1656455355,
      "title": "Ask HN: Where do you find great designers for startups?",
      "type": "story"
    },
    {
      "by": "Barrera",
      "descendants": 0,
      "id": 31913909,
      "score": 1,
      "time": 1656455302,
      "title": "Tesla Lays Off About 200 Autopilot Workers in Latest Cuts",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-06-28/tesla-lays-off-hundreds-of-autopilot-workers-in-latest-staff-cut"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 31913908,
      "score": 1,
      "time": 1656455300,
      "title": "Architecture without architects, an intro to nonpedigreed architecture [pdf]",
      "type": "story",
      "url": "https://www.moma.org/documents/moma_catalogue_3459_300062280.pdf"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31913904,
      "score": 1,
      "time": 1656455263,
      "title": "Sony announces InZone gaming monitors and headsets for PC and PS5",
      "type": "story",
      "url": "https://www.theverge.com/2022/6/28/23180410/sony-inzone-gaming-monitors-hands-on-specs-price-ps5-pc"
    },
    {
      "by": "dijksterhuis",
      "descendants": 0,
      "id": 31913896,
      "score": 1,
      "time": 1656455245,
      "title": "Sounds for Synths (Jexus / WC Olo Garb)",
      "type": "story",
      "url": "http://sounds-for-synths.com"
    },
    {
      "by": "socialdemocrat",
      "descendants": 1,
      "id": 31913894,
      "kids": [
        31913895
      ],
      "score": 1,
      "time": 1656455233,
      "title": "Camping in the Clouds: The Aeromodeller II",
      "type": "story",
      "url": "https://www.lowtechmagazine.com/2009/02/gipsy-zeppelin-baseship.html"
    }
  ]
}