{
  "stories": [
    {
      "by": "davikrr",
      "descendants": 0,
      "id": 29097347,
      "score": 1,
      "time": 1635958829,
      "title": "Ahsohtoa: Structure-of-Array Synthesis in C++20",
      "type": "story",
      "url": "https://github.com/celtera/ahsohtoa"
    },
    {
      "by": "mgarfias",
      "descendants": 0,
      "id": 29097342,
      "score": 1,
      "text": "Hello HN, I need some advice here: bossman is not fun to work for.  Raises his voice in meetings, gets upset, and fails to listen to what I have to say. I’ll point out a problem with how we do things, and he says I’m complaining.  Also completely unreasonable with my time: mandatory meetings at 7am, and then 7pm. Sometimes with little warning.  Frequent calls after hours, on weekends, when I’m trying to enjoy time with my family.<p>Starting to get PTSD from it. Awhile back he threatened to fire me for things like being blocked by other things.<p>Last Friday night, I was part of a deal to migrate an AWS EMR cluster from Intel instances, to graviton. My end went fine. A pair of apps was having issues coming up. I was released as I was done. I made sure to let everyone know that they could call me and I’d come help.<p>The next afternoon, Saturday, I got a call from bossman.  I was in the middle of a home project that has been repeatedly delayed due to work things happening off hours. I didn’t answer, and was left a vm\nThat I can only describe as psychotic, where I was threatened with being fired due to the “failed migration” - no room for human error, didn’t follow SOPs, maximum punishment of firing, under investigation, but the co prides itself on being very fair (???).<p>At this point I had assumed the apps with issues were back up as I’d had no comms to say otherwise. None. Not an email,\nNot a slack msg, no one had called looking for help.  I was very concerned.<p>So, my question: at what point does this become actionable harassment?<p>My actions so far: fwd vm to HR (after having previously talked to them about the threats). Also sent vm to a director level dude outside of my chain of command, that went to his vp, and the CTO with this.<p>I’d add that we’ve lost at least 3 people since this guy took over, and morale absolutely sucks in my group right now.<p>And yes, I am TOTALLY, looking for a new gig. I thought I had something lined up, but the department was given enough headcount after fiscal year end and reqs had to be shuffled around and my position was tossed over board.<p>I intend to vote with my feet, but in the mean time I. We’d to protect myself and my fam.<p>Advice kindly requested.",
      "time": 1635958801,
      "title": "Ask HN: What constitutes actionable workplace harassment?",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 29097314,
      "score": 1,
      "time": 1635958702,
      "title": "U.S. air safety chief says Boeing has 'more work to do'",
      "type": "story",
      "url": "https://www.reuters.com/business/aerospace-defense/faa-administrator-says-boeing-has-more-work-do-2021-11-03/"
    },
    {
      "by": "samjs",
      "descendants": 0,
      "id": 29097307,
      "score": 3,
      "time": 1635958685,
      "title": "Building a runtime reflection system for Rust",
      "type": "story",
      "url": "https://www.osohq.com/post/rust-reflection-pt-1"
    },
    {
      "by": "devsecopsify",
      "descendants": 0,
      "id": 29097274,
      "score": 1,
      "time": 1635958541,
      "title": "Dynamic alert routing with Prometheus and Alertmanager",
      "type": "story",
      "url": "https://tech.loveholidays.com/dynamic-alert-routing-with-prometheus-and-alertmanager-f6a919edb5f8?gi=e67549c9541e"
    },
    {
      "by": "codetrotter",
      "descendants": 0,
      "id": 29097247,
      "score": 1,
      "time": 1635958436,
      "title": "How AdamCYounis Made a Top 10 Ludum Dare Game",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=8nnFZrwqLfE"
    },
    {
      "by": "tectonic",
      "descendants": 0,
      "id": 29097234,
      "score": 1,
      "time": 1635958401,
      "title": "Where will we point the largest space telescope ever built?",
      "type": "story",
      "url": "https://orbitalindex.com/archive/2021-11-03-Issue-141/"
    },
    {
      "by": "Bomba82",
      "descendants": 0,
      "id": 29097220,
      "score": 1,
      "time": 1635958334,
      "title": "Show HN: Pangea.ai going the extra mile in vetting remote software dev teams",
      "type": "story",
      "url": "https://www.pangea.ai/"
    },
    {
      "by": "WaitWaitWha",
      "descendants": 0,
      "id": 29097188,
      "score": 1,
      "time": 1635958231,
      "title": "Experimental depression treatment is nearly 80% effective in controlled study",
      "type": "story",
      "url": "https://med.stanford.edu/news/all-news/2021/10/depression-treatment.html"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 29097187,
      "score": 1,
      "time": 1635958230,
      "title": "I accidentally built a Podcast API business",
      "type": "story",
      "url": "https://www.listennotes.com/blog/how-i-accidentally-built-a-podcast-api-business-46/"
    }
  ]
}