{
  "stories": [
    null,
    {
      "by": "petecooper",
      "descendants": 0,
      "id": 28911191,
      "score": 1,
      "text": "I&#x27;ve been with Fastmail for 6 or so years. I am ready to move. Who should I consider? I&#x27;d prefer to not use Google or Microsoft, though I realise this might not be practical. I would prefer not to self-host, I just want email to work.<p>It appears Fastmail consider Mail.app on Catalina insecure, and it requires its own 16-character alphanumeric password to access my email via IMAP. I set a password, and tried it in Mail.app…and it didn&#x27;t work. It <i>did</i> work in Thunderbird. I tried their pre-made .mobileconfig file to set up the account via System Preferences…and that didn&#x27;t work in Mail.app.<p>I raised a support ticket asking for some guidance on what to do next – explicitly mentioning that the app password <i>did</i> work in Thunderbird – but was told my password was wrong and I have to reset it…and the ticket was closed. I&#x27;ve spent most of a day trying various things and I&#x27;m done. My email has been just fine for 6 years, it started getting a bit wobbly about a week or so ago, and I&#x27;ve lost all patience trying to resolve this. So, I&#x27;m looking for another provider.<p>I am looking at Protonmail, since I have no requirement for any of the Google or Microsoft productivity suites…anyone else sensible I could look into? I don&#x27;t need turbo levels of privacy or suchlike, just a setup that works (that I don&#x27;t have to self host, since I do a lot of that and self-hosted email is a nut I haven&#x27;t cracked yet).<p>Thank you.",
      "time": 1634588660,
      "title": "Ask HN: Paid email hosting for domains, but not Fastmail",
      "type": "story"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28911186,
      "score": 1,
      "time": 1634588650,
      "title": "People living on Earth: All on this page, one by one",
      "type": "story",
      "url": "https://www.worldometers.info/watch/world-population/"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 28911146,
      "score": 1,
      "time": 1634588497,
      "title": "Axboe Achieves 9M IOPS Per-Core one day after achieving 8M",
      "type": "story",
      "url": "https://twitter.com/axboe/status/1450188650852065291"
    },
    {
      "by": "AhmadHamze",
      "descendants": 0,
      "id": 28911142,
      "score": 1,
      "time": 1634588484,
      "title": "Mapping Earthquakes on a Map using Proscessing.py",
      "type": "story",
      "url": "https://ahmadhamze.github.io/posts/earthquakes/"
    },
    {
      "by": "stunt",
      "descendants": 0,
      "id": 28911127,
      "score": 1,
      "text": "All great changes and I was enjoying the event summary until they talked about &quot;STUDIO quality microphones&quot;. Seriously Apple! How am I supposed to believe all the other claims now?<p>I know you can interpreter what studio quality mics or what quality means here, but we all know that&#x27;s not how vast majority of viewers will understand it.<p>Love all the new changes but wanted to point this out because it&#x27;s just crooked.<p>https:&#x2F;&#x2F;youtu.be&#x2F;1qtH5pdd4Q4?t=642",
      "time": 1634588432,
      "title": "New MacBook Pro has STUDIO quality microphones",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28911125,
      "score": 1,
      "time": 1634588427,
      "title": "The Every: When Big Tech rules all, don’t say Dave Eggers didn’t warn us",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2021/10/the-every-when-big-tech-rules-all-dont-say-dave-eggers-didnt-warn-us/"
    },
    {
      "by": "sillysaurusx",
      "descendants": 0,
      "id": 28911055,
      "score": 1,
      "time": 1634588140,
      "title": "Nomic",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Nomic"
    },
    {
      "by": "vonadz",
      "descendants": 0,
      "id": 28911047,
      "score": 1,
      "time": 1634588109,
      "title": "Show HN: A Byte of Coding – A curated newsletter of programming articles",
      "type": "story",
      "url": "https://abyteofcoding.com/?"
    },
    {
      "by": "joepawdog",
      "descendants": 1,
      "id": 28911026,
      "kids": [
        28911027
      ],
      "score": 1,
      "time": 1634588036,
      "title": "The Agony over Dorland vs. Larson: The Case of the Bad Art Friend Explained",
      "type": "story",
      "url": "https://www.blawggers.com/agony-dorland-larson-bad-art-friend-explained/"
    }
  ]
}