{
  "stories": [
    {
      "by": "juancolamendy",
      "descendants": 0,
      "id": 28416257,
      "score": 1,
      "text": "On-page SEO tip. Include answers to your customers&#x27; questions in your article. This can improve your ranking position. The &quot;People also ask&quot; suggestions are great for content ideas",
      "time": 1630771457,
      "title": "SEO Tips",
      "type": "story"
    },
    {
      "by": "lisper",
      "descendants": 0,
      "id": 28416227,
      "score": 1,
      "time": 1630771250,
      "title": "New Evidence Against the Standard Model of Cosmology [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=JETGS64kTys"
    },
    {
      "by": "mathchick",
      "descendants": 0,
      "id": 28416225,
      "score": 1,
      "time": 1630771249,
      "title": "Sync fork with the original repository using Git",
      "type": "story",
      "url": "https://isabelcmdcosta.medium.com/sync-fork-with-the-original-repository-using-git-24da99df916a"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 28416155,
      "score": 1,
      "time": 1630770779,
      "title": "How the Twin Cities Abolished Parking Minimums (and How Your City Can, Too)",
      "type": "story",
      "url": "https://usa.streetsblog.org/2021/09/02/how-the-twin-cities-abolished-parking-minimums-and-how-your-city-can-too/"
    },
    {
      "by": "slickrick216",
      "descendants": 0,
      "id": 28416148,
      "score": 1,
      "text": "Hi HN,<p>I’ve worked in a company for 4 years. Prior to that I’ve worked at 3 other similar companies for similar amounts of time. About 12 YOE in my field in total. The company I’m in has a change of leadership at VP to director level around every 6 months. It’s quite draining but I enjoy what I do so I’ve put up with it. I’m a high performer get along with my team and those across the company and consistently get good reviews but was only promoted once. I’m also not based in the country where most of the team is.<p>Recently a new VP has taken over the dept. He is from a large tech company not saying which one as it’s not really about that. He has brought in his people at the level below him. Anyone that was there in that level already has been kicked out of his leadership team. His people are now hiring their people. It feels like this is going to continue to all the levels. Due to all the new hires my teams role and my own role has been diminished in importance and neglected to the point our existence is an open question. Honestly everyone here is a bit cynical as it feels like there’s no hope of further career advancement due to all the new hires at high levels. Even staying still will be difficult and I’ve got 3 kids with a 4th on the way due in late February.<p>I don’t like being the guy to throw in the towel but I don’t think I can contribute to this team anymore. My compensation is quite good and the difficulty of finding a match in level, pay and interesting work will be quite hard due to my location. I feel stuck if I’m being honest as my partner would like me to stay in the role just until our new child arrives and we are sorted but I just helplessness in it all.<p>Any advice from folks who have experienced something similar?<p>Thanks",
      "time": 1630770724,
      "title": "Ask HN: What advice would you give about feeling stuck and helpless in a job",
      "type": "story"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 28416093,
      "score": 2,
      "time": 1630770421,
      "title": "Our Universe may have a 5th dimension that would change everything about physics",
      "type": "story",
      "url": "https://www.sciencefocus.com/space/fifth-dimension/"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 28416086,
      "score": 1,
      "time": 1630770378,
      "title": "Sub7",
      "type": "story",
      "url": "https://sub7crew.org/"
    },
    {
      "by": "moxylush",
      "descendants": 0,
      "id": 28416073,
      "score": 1,
      "time": 1630770327,
      "title": "Skills Visualized with Cytoscape Network Graph",
      "type": "story",
      "url": "https://www.thescottkrause.com/emerging_tech/cytoscape_dataviz_skills/"
    },
    {
      "by": "xcodevn",
      "descendants": 0,
      "id": 28416043,
      "score": 1,
      "time": 1630770126,
      "title": "Pax: a PyTorch-like pytree module on top of Jax",
      "type": "story",
      "url": "https://github.com/NTT123/pax"
    },
    {
      "by": "deegles",
      "descendants": 1,
      "id": 28416035,
      "kids": [
        28416094
      ],
      "score": 2,
      "time": 1630770098,
      "title": "Melatonin: Much More Than You Wanted to Know",
      "type": "story",
      "url": "https://slatestarcodex.com/2018/07/10/melatonin-much-more-than-you-wanted-to-know/"
    }
  ]
}