{
  "stories": [
    {
      "by": "als0",
      "descendants": 0,
      "id": 28732288,
      "score": 2,
      "time": 1633210457,
      "title": "Mac SE/30 Odyssey",
      "type": "story",
      "url": "https://axio.ms/blog/2021/10/02/MacSE30.html"
    },
    {
      "by": "The_openBSD_guy",
      "descendants": 0,
      "id": 28732270,
      "score": 1,
      "time": 1633210316,
      "title": "How to Connect to WiFi on OpenBSD",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=xnL8WKzemZ8"
    },
    {
      "by": "daenz",
      "descendants": 1,
      "id": 28732236,
      "kids": [
        28732290
      ],
      "score": 1,
      "text": "I know of an engineer who recently obtained the &quot;senior&quot; title. Though they are talented, they lack the experience that comes with many years of solving problems involving technology + people + process. As such, they sometimes make decisions that don&#x27;t come from a place of seeing the 30k foot view. This is all normal and expected, and we were all once this person.<p>However, what doesn&#x27;t seem normal and expected is the arrogance and friction that this person brings.<p>They argue incessantly, and (it seems) not always in good faith. Petty arguments, filled with &quot;ha-ha gotchas&quot; that are more about flexing what they think they know versus actually trying to find meaningful solutions. They over-optimize, spending endless time hurting readability and breaking abstractions to optimize code that will likely never need it. Their explanation? Matter-of-factly: &quot;It&#x27;s faster.&quot; Then they leave their esoteric over-optimized code undocumented for the next person who &quot;should be able to just figure it out.&quot;<p>They frequently try to bond with people by shitting on popular projects, tools, or methods of doing things, without attempting to understand any of the justifications for why those methods made sense at the time, with the information that was available. It&#x27;s all &quot;trash&quot; that elicits groans of disapproval and smirking and eye-rolling if it&#x27;s not the latest, hottest shit. They talk with a shitty, pointed tone in their voice and make no effort to conceal it.<p>They&#x27;ve been the last hold-out on the team, when the rest of the team has aligned around a solution, because what was aligned around wasn&#x27;t &quot;their preference.&quot; They frequently have to be &quot;overruled&quot; because of their refusal to compromise, and make it loudly clear that they are being overruled when it happens.<p>I know that some of these concerns have been brought to this person&#x27;s manager, but my sense of the outcome is that the manager is in a precarious position of trying to keep the team together and everyone getting along, so that forward progress is made. I&#x27;m honestly not sure what I expect from the manager. If I had it my way, this person would be let go. But they aren&#x27;t, for whatever reason.<p>I need a strategy for communicating with this person. How do I persuade them to listen to other points of view? How do I prevent debates from devolving into petty gridlocks? I used to think that anyone could be reasoned with and compromise found, so long as everyone is acting in good faith, but this person challenges that belief. They have one way of seeing the world, and if something doesn&#x27;t align with that, they don&#x27;t budge. How do I minimize the damage?",
      "time": 1633210062,
      "title": "Ask HN: Dealing with frustrating newly-senior engineer?",
      "type": "story"
    },
    {
      "by": "diegopacheco",
      "descendants": 0,
      "id": 28732226,
      "score": 1,
      "time": 1633209940,
      "title": "Re-Write or Strangler",
      "type": "story",
      "url": "http://diego-pacheco.blogspot.com/2021/10/re-write-or-strangler.html"
    },
    {
      "by": "diegopacheco",
      "descendants": 0,
      "id": 28732225,
      "score": 1,
      "time": 1633209929,
      "title": "Migrations",
      "type": "story",
      "url": "http://diego-pacheco.blogspot.com/2021/10/migrations.html"
    },
    {
      "by": "diegopacheco",
      "descendants": 0,
      "id": 28732221,
      "score": 1,
      "time": 1633209907,
      "title": "Breaking Problems Down",
      "type": "story",
      "url": "http://diego-pacheco.blogspot.com/2021/10/breaking-problems-down.html"
    },
    {
      "by": "lifeisstillgood",
      "descendants": 0,
      "id": 28732209,
      "score": 2,
      "time": 1633209807,
      "title": "Is Stock Market Rigged? Insider Trading by Executives Is Pervasive, Critics Say",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2021-09-29/is-stock-market-rigged-insider-trading-by-executives-is-pervasive-critics-say"
    },
    {
      "by": "vibien",
      "descendants": 0,
      "id": 28732189,
      "score": 1,
      "time": 1633209651,
      "title": "Bloodybelly Comb Jelly",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LbcnRVkzy8A"
    },
    {
      "by": "TheAuditor",
      "descendants": 0,
      "id": 28732158,
      "score": 1,
      "time": 1633209395,
      "title": "I Used to Read a Lot but Now I Don’t",
      "type": "story",
      "url": "https://medium.com/@tinyfleu/i-used-to-read-a-lot-but-now-i-dont-how-to-get-back-into-reading-books-d73c5cee9ef6"
    },
    {
      "by": "breck",
      "descendants": 0,
      "id": 28732155,
      "score": 1,
      "time": 1633209386,
      "title": "The science of cycology: Failures to understand how everyday objects work (2006) [pdf]",
      "type": "story",
      "url": "https://link.springer.com/content/pdf/10.3758/BF03195929.pdf"
    }
  ]
}