{
  "stories": [
    {
      "by": "cleanbrowsing",
      "descendants": 0,
      "id": 29584823,
      "score": 1,
      "time": 1639693452,
      "title": "Log4j exploits realtime honeypot logs (jndi)",
      "type": "story",
      "url": "https://reputation.noc.org/jndi-attack-logs/"
    },
    {
      "by": "laurex",
      "descendants": 0,
      "id": 29584814,
      "score": 1,
      "time": 1639693412,
      "title": "Author and Poet bell hooks Has Died",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/15/books/bell-hooks-dead.html"
    },
    {
      "by": "plainjane",
      "descendants": 0,
      "id": 29584784,
      "score": 1,
      "time": 1639693212,
      "title": "It's Jane Austen's birthday today. We're celebrating",
      "type": "story",
      "url": "https://austenconnection.substack.com/"
    },
    {
      "by": "brunosutic",
      "descendants": 0,
      "id": 29584772,
      "score": 1,
      "text": "I&#x27;m working on a custom stripe subscription integration for my SaaS web app for more than a month now. I implemented the same thing 5 years ago, and it somehow feels a lot harder now.<p>The biggest part of added complexity is &quot;SCA&quot; (like 2FA for payments) which was enforced to the whole industry by the EU regulation. Writing custom JavaScript is now required to get custom integration working :&#x2F;<p>But, despite this external complexity, I&#x27;m also constantly struggling with Stripe&#x27;s API and the overall approach. Their docs are terse and concise - written like manpages: you have to have an overall understanding of the system to use them effectively. I turned to their tutorials and videos, but they&#x27;re very simplistic: they explain only the most basic scenarios.<p>I find myself doing a lot of manual testing - using stripe&#x27;s API with a variety of scenarios just to figure out how things work. Then, once I understand a certain feature I have to figure how it works with the rest of the integration.<p>Example feature: &quot;only add product to the subscription once it&#x27;s paid for&quot;. Not even Stripe support developers knew how to handle this correctly - they did point me to the right direction, but I had to do a lot of manual API testing.<p>TL;DR I feel Stripe&#x27;s API became too complex, and too &quot;low-level&quot; to work with directly. I often wish there was a library that would handle all the communication with Stripe. Or at least an extensive video-course that would get you very familiar with all the scenarios.<p>Am I the only one that has this impression?",
      "time": 1639693118,
      "title": "Ask HN: Why is custom stripe integration so hard?",
      "type": "story"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 29584759,
      "score": 1,
      "time": 1639692980,
      "title": "Documents link Huawei to China’s surveillance programs",
      "type": "story",
      "url": "https://www.washingtonpost.com/world/2021/12/14/huawei-surveillance-china/"
    },
    {
      "by": "iroh2727",
      "descendants": 1,
      "id": 29584750,
      "kids": [
        29584751
      ],
      "score": 1,
      "time": 1639692952,
      "title": "Why “Good” Research Ideas Fail",
      "type": "story",
      "url": "https://nathanieltravis.com/2021/12/16/why-good-research-ideas-fail/"
    },
    {
      "by": "lsllc",
      "descendants": 0,
      "id": 29584739,
      "score": 1,
      "time": 1639692899,
      "title": "CDC panel votes to recommend mRNA Covid-19 vaccines over J&J's",
      "type": "story",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/blood-clot-rates-after-jj-vaccine-higher-than-previous-estimates-cdc-advisers-2021-12-16/"
    },
    {
      "by": "josuaio",
      "descendants": 0,
      "id": 29584736,
      "score": 1,
      "text": "After reading both Range and Outliers there‘s one worry that has stayed with me.<p>I would like to start my sidehustle and start off with a blog, but whenever I pick out an area, I get an uncomfortable feeling.<p>Mainly because I have the feeling that only one area will bore me and that all other skills would remain unused.<p>I know that as a founder you need to master many things and I would love to develop software, but I can&#x27;t code.<p>Whenever I think of a business that I could start, e.g. ecommerce or marketing service, I feel like I&#x27;m at a disadvantage because there are hundreds of thousands of competitors who do it successfully as specialists.<p>How do I deal with the worry if I want to focus on one subject area as a generalist, 1. leave other skills unused and 2. probably never become as good and ambitious as a specialist?<p>Have you guys ever dealt with this question and&#x2F;or have any tips on this dilemma?",
      "time": 1639692882,
      "title": "Ask HN: How do generalists find a service/skill to focus on?",
      "type": "story"
    },
    {
      "by": "tomwas54",
      "descendants": 0,
      "id": 29584726,
      "score": 1,
      "time": 1639692840,
      "title": "When Is a Scrape a Breach?",
      "type": "story",
      "url": "https://www.troyhunt.com/when-is-a-scrape-a-breach/"
    },
    {
      "by": "reTensor",
      "descendants": 1,
      "id": 29584716,
      "kids": [
        29584749
      ],
      "score": 2,
      "time": 1639692766,
      "title": "Dan Ammann (CEO of Cruise) is leaving the company",
      "type": "story",
      "url": "https://www.cnbc.com/2021/12/16/ceo-of-gms-electric-vehicle-branch-cruise-is-leaving-the-company.html"
    }
  ]
}