{
  "stories": [
    {
      "by": "start123",
      "descendants": 0,
      "id": 29624502,
      "score": 1,
      "text": "Back when I was 24, I pretty much hated my 9-5 job because of lack of control over my destiny, the limit of earnings and growth and the idea of going to the office every single day. I realized I could start something of my own.<p>So I started to look for something easy to do work on that would not consume a lot of my time. Blogs were a rage back then and multi-million dollar exits were quite common. I bought a domain and installed WordPress and started blogging after my working hours. I started a technology blog in the hope to replicate the success of Mashable and Techcrunch. I spent about 4 hours every night covering tech news about companies and social media in general.<p>2 years passed and I burned out myself. Traffic to the blog was flat and I was not making any meaningful money. I shut it down.<p>A few months later, I started a website that pulled information from Amazon and displayed dresses in a fancy and intuitive website. I opened a Facebook page, spent a lot of time marketing it and eventually made a grand total of 2 sales in a span of 3 months.<p>I decided to give up.<p>The very next year, I decided to build a note-taking web app that was a mash of Google calendar and a to-do list app. The idea was that people would see today&#x27;s schedule by default and they would easily add and manage tasks.<p>I hosted it for a few months and lost interest due to a lack of customers.<p>After taking a break for a year or so, I decided to do something ground-breaking. I built my version of Facebook Groups&#x2F;Slack that would allow people to share something interesting with others. You could create groups and add&#x2F;remove people from them. The UI was fancy and a few of my friends and family loved it.<p>A few months after running it, I shut it down. I found it hard to justify its existence since everybody else was using Facebook groups and with the rise of mobile apps that allowed seamless sharing, my application made no sense.<p>Sensing an opportunity in media space again, I then started a news aggregator website that aggregated news titles from hundreds of outlets storing thousands of news articles per day. The website was smart enough to cluster the news articles based on topics which, Google news does well. People loved it and it got great reviews, but it was not growing fast enough.<p>And like earlier, I ran out of patience after 6 months and I shut it down.<p>After multiple failures, I decided to take a longer break. I had pretty much given up my entrepreneurship journey knowing there was no way I could build a reasonably successful business.<p>A year passed and I started to feel uneasy with myself and my day job.<p>So, I built a stupid web app that cleaned new articles by stripping them off of ads and showing only the relevant content. I shared it and got no real feedback from others. Nobody cared.<p>That&#x27;s where it hit me, why not pivot to and a link management platform? I thought it&#x27;s so easy to build and manage it. I could feel the tingling in my body. I built https:&#x2F;&#x2F;blanq.io with the excitement of a toddler.<p>I was so wrong.<p>I spent the next 1 year building the landing page, the entire web app plus some extra features in a hope that it will take off.<p>For the first 18 months, I had no paying customers. I put everything into this. All my previous experiences of failures and learning went into building this platform. &quot;How could I fail?&quot; I thought.<p>I then decided to stick to it and give myself 3 years to decide its fate.<p>On the 19th month, my efforts started to pay off. I landed my first customers then 2nd and then 3rd.... and so on. It&#x27;s been 8 months since then and I now have 10 paying customers using my platform almost every day and growing every month.<p>My learning:<p>1.Don&#x27;t quit too soon and don&#x27;t be too hard on yourself.<p>2.With each failure, you do get better at not failing.<p>3.You improve at everything as time passes - marketing, programming, sales, operations.",
      "time": 1640005850,
      "title": "Failed for the past 12 years as an tech entrepreneur",
      "type": "story"
    },
    {
      "by": "schleck8",
      "descendants": 0,
      "id": 29624499,
      "score": 2,
      "time": 1640005832,
      "title": "RipRequests Dead After RIAA ‘Hand Delivers’ Piracy Cease-and-Desist",
      "type": "story",
      "url": "https://torrentfreak.com/riprequests-dead-after-riaa-hand-delivers-piracy-cease-and-desist-211220/"
    },
    {
      "by": "eigenhombre",
      "descendants": 0,
      "id": 29624462,
      "score": 1,
      "time": 1640005584,
      "title": "Webb Telescope Approaches Launch, with an Eye Toward Cosmic Origins",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/20/science/webb-telescope-astronomy.html"
    },
    {
      "by": "jsjohnst",
      "descendants": 0,
      "id": 29624461,
      "score": 2,
      "time": 1640005583,
      "title": "Bad things come in threes: Apache reveals another Log4j bug",
      "type": "story",
      "url": "https://www.theregister.com/2021/12/19/log4j_new_flaw_cve_2021_45105/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 29624460,
      "score": 1,
      "time": 1640005581,
      "title": "Light-powered soft robots could suck up oil spills",
      "type": "story",
      "url": "https://news.ucr.edu/articles/2021/12/02/light-powered-soft-robots-could-suck-oil-spills"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 29624456,
      "score": 1,
      "time": 1640005541,
      "title": "DockerHub Is Experiencing an Outage",
      "type": "story",
      "url": "https://status.docker.com/pages/history/533c6539221ae15e3f000031"
    },
    {
      "by": "thesuperbigfrog",
      "descendants": 0,
      "id": 29624422,
      "score": 1,
      "time": 1640005321,
      "title": "Elon Musk says he’ll pay over $11B in taxes this year",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/20/22846170/elon-musk-tax-bill-2021-tesla-stock-selloff-11-billion"
    },
    {
      "by": "filip_cl",
      "descendants": 0,
      "id": 29624418,
      "score": 1,
      "time": 1640005287,
      "title": "React-query look alike in Flutter for better API caching",
      "type": "story",
      "url": "https://coreline.agency/blog/flutter-package-for-cached-http-layer/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29624411,
      "score": 1,
      "time": 1640005249,
      "title": "Using JavaScript-style async promises in Python – miguelgrinberg.com",
      "type": "story",
      "url": "https://blog.miguelgrinberg.com/post/using-javascript-style-async-promises-in-python"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29624385,
      "score": 2,
      "time": 1640005097,
      "title": "eIDAS",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/EIDAS"
    }
  ]
}