{
  "stories": [
    {
      "by": "Twixes",
      "descendants": 0,
      "id": 31770618,
      "score": 1,
      "time": 1655411414,
      "title": "CockroachDB's Consistency Model",
      "type": "story",
      "url": "https://www.cockroachlabs.com/blog/consistency-model/"
    },
    {
      "by": "algoeci",
      "descendants": 0,
      "id": 31770615,
      "score": 1,
      "time": 1655411391,
      "title": "Yogababble",
      "type": "story",
      "url": "https://www.profgalloway.com/yogababble/"
    },
    {
      "by": "lasftew",
      "descendants": 0,
      "id": 31770573,
      "score": 1,
      "time": 1655411231,
      "title": "Into the core – squeezing Haskell into nine constructors",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Gml1m-3L47s"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31770534,
      "score": 1,
      "time": 1655411013,
      "title": "What Business Problems Does WebAssembly Solve?",
      "type": "story",
      "url": "https://thenewstack.io/what-business-problems-does-webassembly-solve/"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31770508,
      "score": 1,
      "time": 1655410855,
      "title": "A glucose meter could soon say whether you have SARS-CoV-2 antibodies",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2022/06/220616152456.htm"
    },
    {
      "by": "de_or_ca",
      "descendants": 1,
      "id": 31770475,
      "kids": [
        31770504
      ],
      "score": 2,
      "text": "I asked this same question a week ago[1]. I got lots of really great perspectives which I very much appreciated. Overwhelmingly, people suggested we move to Bavaria. A couple of responders pointed out (I think rightfully) that the answers may have be skewed slightly due to my having posted around 2pm CET. Most of CA was still waking up.<p>I&#x27;d like to ask one last time in a more CA-friendly time. Sorry if posting again is noisy. This will be the last time I ask.<p>I&#x27;m at a crossroads in my life. My wife and I are trying to figure out if we should move back to California or move to Germany to be closer to her parents.<p>A bit of background: We&#x27;re in our mid-30s. Both in tech. I&#x27;m a software engineer. She&#x27;s a product manager. I&#x27;m American and she&#x27;s German. We met in SF in 2014 and left together in 2017. We traveled for a while, then moved to Amsterdam where we live now. We have a 1 year old daughter with another on the way in October. We don&#x27;t plan on having more kids after that. We&#x27;d like to leave the Netherlands soon, but haven&#x27;t decided yet if we should move back to California or move close to her parents in Germany.<p>There&#x27;s tons of variables to consider, but the 2 main ones I&#x27;m focused on right now is the tradeoff between family support vs career prospects. In short: if we move to Bavaria, my wife&#x27;s parents would be a huge help with our kids. They&#x27;re natural and eager grandparents and they&#x27;re great with our daughter. But, they live in a small village in Bavaria. If we moved to Germany, I assume we&#x27;d want to be close to them, so we&#x27;d end up in a similarly small village near them.<p>My family is scattered around CA and NY and, while it&#x27;d be nice to be closer to them, I don&#x27;t think we&#x27;d get nearly the same kind of natural support network from them. If we did move to CA though, I assume we&#x27;d move closer to either my Dad (down in San Diego) or my Mom (around Sacramento).<p>On the career side, I&#x27;m assuming our career options and pay would be a lot higher in CA. I work as a senior eng at a large tech company and based on levels.fyi, it looks like my SF colleagues make somewhere between 2 and 4 times what I do. I know money isn&#x27;t everything, but I&#x27;ve experienced the pain and stress that not having enough causes. I see it with all my family members now. Since moving to the Netherlands, I haven&#x27;t been able to save or invest nearly as much as I could back in CA. Maybe it&#x27;s the American in me, or a vestige from my childhood, but I feel uneasy not building more wealth. Money smooths everything over - from relationships, to the options you have available, to the time you can buy with it. But, that additional pay would come at the expense of being more on our own raising our kids, which adds another set of stressors and difficulties. Additionally, for the sake of our kids, we think it&#x27;d be good for them to have more involved relatives.<p>Any SWE parents out there who have insights? How hard is it raising kids in CA if you have limited family support? What&#x27;s your quality of life in CA as a parent? Does cost of living eat up all the additional money I assume we could make? We&#x27;d eventually like to buy a house, but the markets seem so crazy that even with the pay raises I wonder if we could swing it.<p>What about quality of life and career prospects in Germany? Anyone living there have any insights? Since we&#x27;d be looking at being closer to my wife&#x27;s parents, I think we&#x27;d need to find remote work, so that would also be a limiting factor. I&#x27;m assuming we couldn&#x27;t build as much individual wealth, but perhaps the services of the state compensate enough for that and I should let go of that obsession?<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31653233",
      "time": 1655410714,
      "title": "Ask HN: Should I move to California or Germany as a SWE with 2 small kids? (pt2)",
      "type": "story"
    },
    {
      "by": "shartshooter",
      "descendants": 0,
      "id": 31770474,
      "score": 1,
      "time": 1655410712,
      "title": "Legendary Spanish galleon shipwreck discovered on Oregon coast",
      "type": "story",
      "url": "https://www.nationalgeographic.com/history/article/legendary-spanish-galleon-shipwreck-discovered-on-oregon-coast"
    },
    {
      "by": "oldlang",
      "descendants": 4,
      "id": 31770457,
      "kids": [
        31770559,
        31770540,
        31770557,
        31770514
      ],
      "score": 1,
      "text": "Languages go through their lifecycles, but oftentimes never die. Even great languages like COBOL or Pascal become obsolete, yet thousands(?) of mission-critical products continue to run successfully and direly depend on outdated technologies — these codebases need continued maintenance and improvements.<p>What would it take to convince you to accept a job coding in an &quot;obsolete&quot; language every day, like COBOL, Pascal, or Fortran?<p>Is it money, and there&#x27;s a salary number? Is there a unique benefit (perhaps an annual 3 month sabbatical or 20-hour work weeks)? Or do you love an obsolete lang, and are already looking for that job?",
      "time": 1655410634,
      "title": "Ask HN: What would convince you to take a job coding in Pascal?",
      "type": "story"
    },
    {
      "by": "cpeterso",
      "descendants": 0,
      "id": 31770432,
      "score": 3,
      "time": 1655410478,
      "title": "Calling for Antitrust Reform",
      "type": "story",
      "url": "https://blog.mozilla.org/en/mozilla/calling-for-antitrust-reform/"
    },
    {
      "by": "tzach",
      "descendants": 0,
      "id": 31770399,
      "score": 1,
      "time": 1655410293,
      "title": "Autogenerating Documentation for a Golang CLI with Sphinx",
      "type": "story",
      "url": "https://davidgarcia.dev/posts/autogenerating-documentation-for-a-cli/"
    }
  ]
}