{
  "stories": [
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29382241,
      "score": 1,
      "time": 1638205636,
      "title": "Scientists use seismic noise to image first hundred meters of Mars",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/11/scientists-use-seismic-noise-to-image-first-hundred-meters-of-mars/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29382227,
      "score": 1,
      "time": 1638205553,
      "title": "Nurdles: The worst toxic waste you’ve probably never heard of",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/nov/29/nurdles-plastic-pellets-environmental-ocean-spills-toxic-waste-not-classified-hazardous"
    },
    {
      "by": "jacquesm",
      "descendants": 0,
      "id": 29382213,
      "score": 1,
      "time": 1638205517,
      "title": "Pigs can play video games with their snouts, scientists find",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-56023720"
    },
    {
      "by": "ranuzz",
      "descendants": 0,
      "id": 29382212,
      "score": 1,
      "text": "There are various skill based reality shows that focus on people&#x2F;teams building stuff along with the usual drama. (like cooking, fashion, crafts, architecture etc).<p>What if there was a reality show where contestants were software engineers working on projects (like hackathons).<p>Do you see it happening ?<p>What else would you like to add ?",
      "time": 1638205514,
      "title": "Ask HN: What would a reality show for Software Engineers look like?",
      "type": "story"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 29382183,
      "score": 1,
      "time": 1638205422,
      "title": "Firefox brings the fire: shifting from GLX to EGL",
      "type": "story",
      "url": "https://hackaday.com/2021/11/23/firefox-brings-the-fire-shifting-from-glx-to-egl/"
    },
    {
      "by": "allard",
      "descendants": 0,
      "id": 29382181,
      "score": 1,
      "time": 1638205409,
      "title": "Lina Khan’s Battle to Rein in Big Tech",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/12/06/lina-khans-battle-to-rein-in-big-tech"
    },
    {
      "by": "CinematicStudio",
      "descendants": 1,
      "id": 29382159,
      "kids": [
        29382167
      ],
      "score": 5,
      "time": 1638205313,
      "title": "Show HN: I Made a Final Cut for Windows",
      "type": "story",
      "url": "https://cinematicstudio.app"
    },
    {
      "by": "zonito",
      "descendants": 0,
      "id": 29382156,
      "score": 1,
      "time": 1638205310,
      "title": "How to Remove Duplicate Records from 1B records without any Index in MySQL?",
      "type": "story",
      "url": "https://zonito.medium.com/how-to-remove-duplicate-records-from-1-billion-records-without-any-index-in-mysql-44b15b2d0ec1"
    },
    {
      "by": "hidden-spyder",
      "descendants": 3,
      "id": 29382150,
      "kids": [
        29382244,
        29382203,
        29382192
      ],
      "score": 2,
      "time": 1638205274,
      "title": "Ask HN: Curators of /new, how do you prevent it from overwhelming you?",
      "type": "story"
    },
    {
      "by": "alexray",
      "descendants": 0,
      "id": 29382127,
      "score": 7,
      "text": "Hey HN! We’re Alex and David, the founders of Parade (<a href=\"https:&#x2F;&#x2F;getparade.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getparade.com</a>). Parade uses software to guide founders through early branding decisions, including designing a basic logo, selecting fonts, selecting colors, and defining their company’s overall aesthetic.<p>A lot of early stage founders are incredible engineers, but lack the ability to make things look “right”. We’ve seen a bunch of our friends launch products to no reception, some of which seemed due to poor design decisions (like, making buttons hard to find or a landing page that looks like it might steal your credit card).<p>Two years ago, two of my closest friends started a company, raised a small round, and spent tens of thousands of dollars on their initial branding. That was a substantial percentage of their funding, and then their brand entirely changed once they learned more about their customer. After I saw them waste a ton of time and money on this, I realized that it ought to be possible to build software that could have done just as good of a job as the design agency. At the core of it, the designers asked my friends a bunch of questions about how they want their company to be perceived by customers, offered them colors and fonts and a design aesthetic that conveyed those feelings, and then created a mockup of a website that incorporated those elements. So, I decided to build software to do just that.<p>With Parade, we have taken a traditional brand design interview and turned it into a self-serve software product. You answer a series of questions about how you want your brand to be perceived and receive design aesthetic suggestions based on them. We use machine learning to identify design elements (such as fonts, colors, layouts, use of color, density of information, line and button styles, and visuals) that project the way you want your brand to feel, then present them to you as simple choices. To power the suggestions, we collected training data from both designers and non-designers to understand what emotional reactions these design elements evoke. Because of this technology, we are able to identify the design aesthetics that you want without having to iterate repeatedly or spend hours searching for inspiration. After you make your choices, we use the math behind design theory (such as an algorithm to expand one color into a range of colors that accounts for the difference in perceived contrast based on hue, saturation, and lightness) to flesh out your brand [0].<p>Right now, after onboarding, you are able to access all of your design elements in a style guide for free through the dashboard. It includes your colors and your fonts, plus a place to download your logo and icon in a few colors. You can see an example of what this looks like here: <a href=\"https:&#x2F;&#x2F;app.getparade.com&#x2F;hackernews&#x2F;style-guide\" rel=\"nofollow\">https:&#x2F;&#x2F;app.getparade.com&#x2F;hackernews&#x2F;style-guide</a> or here: <a href=\"https:&#x2F;&#x2F;app.getparade.com&#x2F;hooli&#x2F;style-guide\" rel=\"nofollow\">https:&#x2F;&#x2F;app.getparade.com&#x2F;hooli&#x2F;style-guide</a>. This is similar to the output startups get from a first engagement with a designer, which helps you set up basic, consistent styling for your website and social media profiles.<p>At this point, we’ve helped thousands of companies create their brands, including YC-backed companies like WellPrincipled (<a href=\"https:&#x2F;&#x2F;www.wellprincipled.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wellprincipled.com&#x2F;</a>), Enable (<a href=\"https:&#x2F;&#x2F;www.enable.us&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.enable.us&#x2F;</a>) and MeterFeeder (<a href=\"https:&#x2F;&#x2F;www.meterfeeder.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meterfeeder.com&#x2F;</a>).<p>The next step beyond style guides would be to automatically generate brand assets—things like pitch decks, landing pages, and social media posts. We&#x27;re working on that. We haven&#x27;t completely automated it yet, but we are able to create these assets with very rapid turnaround time. Once we get it fully automated, we plan to add subscription features that enable founders to make ready-to-use assets themselves.<p>In the meantime, we run an agency, serving customers using our work-in-progress software. It’s different from a traditional agency, though—while traditional agencies spend many days asking you about how you want your brand to look, seeking inspiration, and iterating based on your feedback, we are able to capture what you describe through our onboarding survey and create assets with your design elements algorithmically. We are able to deliver most designs within 48 hours, and almost all of our customers have been satisfied without any iteration. Right now, a lot of the algorithmic design work happens via an in-house Figma plugin, which we plan to move onto our platform in 2022 and open up to self-service.<p>Something that’s surprised us while working on this: we’ve found that our users don’t always believe that their choices are really great. Design is intimidating—you’re aware that there is some psychology of color and also some color theory rules, but aren’t exactly sure what they are. You’ve built things in the past that just didn’t look quite right—how can you be sure the choices you made on Parade are good? Oftentimes, designers will even use words to make themselves seem to know some secret you don’t. We’re trying to reassure our users by surfacing more of the science behind the suggestions we make, and to make sure we encode rules that prevent any bad design decisions.<p>We would love to hear your thoughts, questions, concerns, or ideas about what we’re building - or about your experiences with automating design in general. We appreciate all feedback and suggestions!<p>[0] See  <a href=\"https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;AERT&#x2F;#color-contrast\" rel=\"nofollow\">https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;AERT&#x2F;#color-contrast</a> for math on color contrast, or <a href=\"https:&#x2F;&#x2F;alienryderflex.com&#x2F;hsp.html\" rel=\"nofollow\">https:&#x2F;&#x2F;alienryderflex.com&#x2F;hsp.html</a> for a good writeup on perceived brightness.",
      "time": 1638205134,
      "title": "Launch HN: Parade (YC S20) – Launch your company without hiring a designer",
      "type": "story"
    }
  ]
}