{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28371449,
      "score": 1,
      "time": 1630433409,
      "title": "Cybercriminal sells tool to hide malware in AMD, Nvidia GPUs",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/cybercriminal-sells-tool-to-hide-malware-in-amd-nvidia-gpus/"
    },
    {
      "by": "5faulker",
      "descendants": 0,
      "id": 28371441,
      "score": 1,
      "time": 1630433379,
      "title": "A first introduction to Laplace Transform",
      "type": "story",
      "url": "https://mathvault.ca/laplace-transform/"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 28371397,
      "score": 2,
      "time": 1630433138,
      "title": "On the front lines, here’s what the seven stages of severe Covid-19 look like",
      "type": "story",
      "url": "https://www.latimes.com/opinion/story/2021-08-26/pandemic-covid-19-stages-vaccination-intensive-care-respiratory-therapist"
    },
    {
      "by": "andwaal",
      "descendants": 0,
      "id": 28371370,
      "score": 1,
      "text": "Anyone using https:&#x2F;&#x2F;nx.dev&#x2F; for Javascript monorepos that could give some insight in their experience? We are evaluating it as an attempt to solve how to share UX component&#x27;s (React) among all our frontend products.\nI&#x27;m keen to hear about your evaluation for using, pros, cons, challenges etc.",
      "time": 1630433011,
      "title": "Ask HN: Experiences with NX for JavaScript Monorepo",
      "type": "story"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28371363,
      "score": 2,
      "time": 1630432980,
      "title": "FBI-CISA Advisory on Ransomware Awareness for Holidays and Weekends",
      "type": "story",
      "url": "https://us-cert.cisa.gov/ncas/current-activity/2021/08/31/fbi-cisa-advisory-ransomware-awareness-holidays-and-weekends"
    },
    {
      "by": "theshirin",
      "descendants": 0,
      "id": 28371327,
      "score": 2,
      "time": 1630432782,
      "title": "Dockerizing Mongo for Test and Development",
      "type": "story",
      "url": "https://www.tonic.ai/blog/dockerizing-and-seeding-your-development-mongodb-database"
    },
    {
      "by": "zikohh",
      "descendants": 0,
      "id": 28371318,
      "score": 2,
      "time": 1630432731,
      "title": "Can't make or receive calls since 23AUG due to carrier services update",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=com.google.android.ims&hl=en_GB&gl=US&reviewId=gp%3AAOqpTOGYpdDlUG3__M3MwahgQXigh-OH5apYlNoYu4NiwqR7_C-8K-rBE6ELGjfrRG8AeeJXFPziFGfkjg0Od0E"
    },
    {
      "by": "OyvoindSolheim",
      "descendants": 0,
      "id": 28371300,
      "score": 1,
      "text": "Til de som stemmer på MDG og andre som vil avvikle vårt sorte gull og med det vår velstand\nEn liten tankevekker\nDe som ønsker at Norge og resten av verden skal slutte med olje, kan få lov å gå foran og vise hvordan vi skal leve uten olje i fremtiden.\nDe kan starte med å:\n- fjerne samtlige elektriske ledninger, kontakter og brytere i boligen sin, siden all isolasjon er laget av plast.\n- Slutte å male husene sine (gjelder det meste av &quot;vannbasert&quot; maling også)\n- Fjerne inventaret i bilen sin, setene, gummilister, alle motordeksel, og bildekkene. Gjelder også elbiler.\n- Fjerne engangs- og oppladbare batteriet. (Bruker plast som isolasjon&#x2F;dielektrikum mellom &quot;polene&quot;.\n- Kaste ut nettbrett, smarttelefoner og pc&#x27;er\n- si farvel til internet og rutere, TV og radio, samt det meste av kabling i bakken.\n- Fjerne de fleste avløpsrør og kloakkrør i huset sitt som er av plast.\n-Kaste kjøleskap, komfyrer, elektriske varmeovner og gå tilbake til vedfyring eller kull.\n- Fjerne alle tetningslister rundt dører og vinduer.\n- Kvitte seg med plast- og gummibåter, campingvogner og telt.\n- Gå uten gummistøvler, regnjakker, votter, paraplyer, og hive de fleste klærne sine i skap og skuffer.\n- Fjerne all plast rundt matvarer som forlenger holdbarheten.\n- Slutte å kjøpe saft, brus og øl som ikke er tappet på glassflasker.\n- Begynne å gå til jobben, siden biler, tog og sykler ikke lenger kommer til å være i drift lenger (uten isolasjon rundt elektriske kabler vil tog måtte stoppe, og dekkene på bilene&#x2F;syklene må fjernes)\n- Kaste gressklippere, og det meste av elektriske hageverktøy.\n- Hive ut mange av møblene som inneholder plast både på verandaen, i stue og de fleste rom i huset.\n- Dagens brann- og sykebiler kan vi glemme, og du må selv komme deg til sykehuset som ikke vil kunne bruke elektriske instrumenter, eller det meste av hjelpemidler de har i dag. Å ringe etter hjelp med telefonen vil være umulig uten strøm.\n- Si farvel til mange av dagens medisiner og innpakning (som øker holdbarheten) fordi fremstillingen ofte benytter oljebaserte kjemikalier i fremstillingen av virkestoffer. Innpakningen er også ofte i plast.\n- Begynne å bruke mynter&#x2F;metall&#x2F;gull som betalingsmiddel, siden det i trykksverten og pengeseddelen er brukt oljebasert materialer.\n- Slutte å lese bøker og aviser. (Trykksverten er fremstilt med oljebaserte materialer)\n- Slutte å bruke bank&#x2F;kreditkort&#x2F;bankterminaler, og bytte inn førerkort og pass til papirbasert materiale.\n- Slutte å drikke kaffe laget av kaffetraktere i plast, og begynne å kjøpe kaffe i metallbokser eller tre.\n- Kaste det meste av sminke og kremer, samt slutte å bruke solkrem med solfaktor.\n- Si farvel til barnebleier og bind.\n- Fjerne alt av plast på kjøkken + i skap og skuffer.\n- Begynne å grave en brønn etter vann i hagen, fordi de fleste vannrør i dag er i plast, eller har isolasjon (isopor) laget med oljeprodukter.\n- Fjerne alle asfalterte veier og bytte det ut med brostein, sand eller grus.\n- Fjerne aller betongbroer, og bytte de ut med treverk eller stål. De kan heller ikke males eller impregneres, siden dette krever oljebaserte produkter.\n- Slutte å kjøpe utenlandske eller langreiste produkter, siden transport av varer vil foregå med hest og vogn, eller seilbåter i tre eller metall. Dagens seil må byttes ut og erstattes med tøy.\nEr det slik DU ønsker å ha det?\nFør DU gjennomfører alt som står over så vil jeg ikke høre mer gnål om sluttdato for norsk oljeindustri, da er du så full av dobbeltmoral at jeg blir helt matt.\nSånn, godt å få det ut.\nKopi delt!",
      "time": 1630432665,
      "title": "TIL de som vil avvikle oljen",
      "type": "story"
    },
    {
      "by": "webscout",
      "descendants": 0,
      "id": 28371297,
      "score": 1,
      "time": 1630432649,
      "title": "The Silent Partner Cleaning Up Facebook for $500M a Year",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/31/technology/facebook-accenture-content-moderation.html"
    },
    {
      "by": "jdkee",
      "descendants": 0,
      "id": 28371283,
      "score": 2,
      "time": 1630432599,
      "title": "Survival of the Richest",
      "type": "story",
      "url": "https://onezero.medium.com/survival-of-the-richest-9ef6cddd0cc1"
    }
  ]
}