{
  "stories": [
    {
      "by": "sebg",
      "descendants": 0,
      "id": 27778975,
      "score": 1,
      "time": 1625788079,
      "title": "Apple Music Streaming Analysis",
      "type": "story",
      "url": "https://deepnote.com/@ashish-karhade/Apple-Music-Streaming-analysis-RZehtt6QT5q1nWDC6mwXrQ"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 27778964,
      "score": 1,
      "time": 1625787956,
      "title": "ZubyMusic: Things I've Learned (Or Confirmed) About Humanity During Pandemic",
      "type": "story",
      "url": "https://twitter.com/ZubyMusic/status/1412012537986568193"
    },
    {
      "by": "johnnyApplePRNG",
      "descendants": 0,
      "id": 27778951,
      "score": 1,
      "text": "I always considered myself to be a &quot;good&quot; programmer. Been at it on and off for 20 years now. Have been building my own desktops for just as long.<p>That idealization lasted until I decided to tackle a massive software project on my own recently, and I&#x27;m feeling increasingly unconfident about my abilities.<p>The more example code I look at implementing, the more I realize just how spaghetti-like what-I-call-programming really is.<p>I have never had any formal programming education. I took a &quot;Java for beginners&quot; course in university once and dropped out after 2 weeks because everybody in the course seemed to already know everything about Java and I was entirely lost.<p>I am embarrassed to admit that I don&#x27;t have the slightest idea what &quot;object oriented&quot; even means.<p>I have cracked open &quot;Clean Code&quot; recently and have made it half way through &quot;The Pragmatic Programmer&quot; a few years ago ... but can&#x27;t even find that book anymore :S<p>Are those even good suggestions for someone like me?<p>How would you suggest to somebody who already thinks they&#x27;re a good programmer to go about actually becoming a good programmer?<p>A bit about me...<p>- comfortable w&#x2F;HTML+CSS 20 years go with a SAMS 24 hour book<p>- comfortable w&#x2F;PHP 15 years ago with a PHP for Dummies book<p>- comfortable w&#x2F;Javascript 15 years ago with the web<p>- comfortable w&#x2F;Python 5 years ago through the web<p>- comfortable w&#x2F;Node 2 years ago through the web<p>Thank you so much for reading this far. Really! I appreciate  it!",
      "time": 1625787830,
      "title": "Ask HN: How to Learn to Code Better?",
      "type": "story"
    },
    {
      "by": "yusuf_giftworks",
      "descendants": 1,
      "id": 27778943,
      "kids": [
        27778961
      ],
      "score": 2,
      "time": 1625787780,
      "title": "Why are gas, groceries, and used cars prices going up?",
      "type": "story",
      "url": "https://www.vox.com/the-goods/22549250/inflation-consumer-prices-lumber-used-cars-gas"
    },
    {
      "by": "arthurcolle",
      "descendants": 0,
      "id": 27778940,
      "score": 1,
      "time": 1625787731,
      "title": "Ask HN: Have you ever been sued by investors? If so, what was that like?",
      "type": "story"
    },
    {
      "by": "sharjeelsayed",
      "descendants": 0,
      "id": 27778936,
      "score": 1,
      "time": 1625787708,
      "title": "M1 iMacs offers use as an external monitor with a workaround",
      "type": "story",
      "url": "https://9to5mac.com/2021/04/21/m1-imac-target-display-mode/"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 27778888,
      "score": 1,
      "time": 1625787186,
      "title": "The Tantalizing Nuclear Mirage (2019)",
      "type": "story",
      "url": "https://prospect.org/greennewdeal/the-tantalizing-nuclear-mirage/"
    },
    {
      "by": "loopz",
      "descendants": 1,
      "id": 27778865,
      "kids": [
        27778963
      ],
      "score": 2,
      "time": 1625786954,
      "title": "Mass infection is not an option: we must do more to protect our young (UK)",
      "type": "story",
      "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01589-0/fulltext"
    },
    {
      "by": "iafrikan",
      "descendants": 0,
      "id": 27778842,
      "score": 1,
      "time": 1625786783,
      "title": "A Reflection on the Arrest of South Africa's Ex-President, Jacob Zuma",
      "type": "story",
      "url": "https://www.iafrikan.com/2021/07/08/iafrikan-daily-brief-190-his-story/"
    },
    {
      "by": "SMAAART",
      "descendants": 0,
      "id": 27778839,
      "score": 1,
      "text": "Is depression good of bad for business?<p>There are many reasons why it&#x27;s good, escapism for one: who doesn&#x27;t want to reward themselves after a crappy day by buying something they don&#x27;t need, with money they don&#x27;t have, to impress people they don&#x27;t like? So that can facebook it or tweet it or IG it. Vacations, cars, clothes, fancy restaurants.....<p>On the other hand, a lot of entrepreneurs wannabes can&#x27;t get past the risk of not having a steady income, or being ridiculed by family, friends, and peers (depression&#x27;s cousin anxiety would do that), and all those insecurities and sense of doom is not good to start something, to give light to the multitude of ideas in someone&#x27;s creative head.<p>So, is depression good or bad for the economy?",
      "time": 1625786772,
      "title": "Is depression good of bad for the economy?",
      "type": "story"
    }
  ]
}