{
  "stories": [
    {
      "by": "jonathanberi",
      "descendants": 0,
      "id": 30433281,
      "score": 1,
      "time": 1645561779,
      "title": "Remote Zephyr RTOS Development Using Segger Tunnel and a Raspberry Pi",
      "type": "story",
      "url": "https://blog.golioth.io/remote-zephyr-development-using-segger-tunnel-and-a-raspberry-pi/"
    },
    {
      "by": "petercooper",
      "descendants": 0,
      "id": 30433269,
      "score": 1,
      "time": 1645561747,
      "title": "Optimizing Postgres Text Search with Trigrams",
      "type": "story",
      "url": "https://alexklibisz.com/2022/02/18/optimizing-postgres-trigram-search.html"
    },
    {
      "by": "amarsahinovic",
      "descendants": 0,
      "id": 30433252,
      "score": 1,
      "time": 1645561672,
      "title": "IrfanView Graphic Viewer",
      "type": "story",
      "url": "https://www.irfanview.com/"
    },
    {
      "by": "Angius",
      "descendants": 0,
      "id": 30433243,
      "score": 1,
      "time": 1645561633,
      "title": "Early peek at C# 11 features",
      "type": "story",
      "url": "https://devblogs.microsoft.com/dotnet/early-peek-at-csharp-11-features/"
    },
    {
      "by": "maddynator",
      "descendants": 0,
      "id": 30433185,
      "score": 1,
      "time": 1645561412,
      "title": "How to Switch Career to Tech",
      "type": "story",
      "url": "https://thinkingthrough.substack.com/p/how-to-switch-career-to-tech"
    },
    {
      "by": "Outofthebot",
      "descendants": 1,
      "id": 30433145,
      "kids": [
        30433162
      ],
      "score": 5,
      "time": 1645561233,
      "title": "Show HN: I made a tool to create the best product tutorials",
      "type": "story",
      "url": "https://textframe.app"
    },
    {
      "by": "cris3",
      "descendants": 0,
      "id": 30433122,
      "score": 1,
      "time": 1645561091,
      "title": "Remove any object in a video with a simple brush stroke",
      "type": "story",
      "url": "https://runwayml.com/inpainting/"
    },
    {
      "by": "lycopodiopsida",
      "descendants": 0,
      "id": 30433115,
      "score": 2,
      "time": 1645561032,
      "title": "Humble Chronicles: Developer Experience",
      "type": "story",
      "url": "https://tonsky.me/blog/humble-dx/"
    },
    {
      "by": "declan_g",
      "descendants": 0,
      "id": 30433104,
      "score": 7,
      "text": "Hi HN, we’re Philip, Amby, and Declan from Hyperbeam (<a href=\"https:&#x2F;&#x2F;www.hyperbeam.dev\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hyperbeam.dev</a>). Hyperbeam is an API that makes it easy for developers to embed real-time multiplayer capabilities into their web apps—including any other web app that you want to provide multiplayer access to.<p>Building software to connect people in real time is hard. We experienced this in college when we built a “watch party” site for people to watch movies together (<a href=\"https:&#x2F;&#x2F;hyperbeam.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hyperbeam.com</a>). Other watch party solutions were unreliable, so we spent two years building tech to allow friends to watch stuff together with ease.<p>The key piece was a “multiplayer web browser”. By that we mean a Chromium instance that you embed inside your own web app (i.e. web browser inception) which is actually hosted on a server and streamed via WebRTC, and so can be shared and controlled by multiple people at the same time.<p>For example, say you have an online tutoring platform. An instructor can open any application in the embedded web browser and then work on it with the student together.<p>Another use case is making non-multiplayer apps multiplayer. One of our customers wanted to add a collaborative version of Google Slides to their product, so multiple participants could navigate the slides at once. Google doesn&#x27;t provide an API for that, so users had to screen share, which isn&#x27;t multiplayer. With Hyperbeam, you just open up a shared instance of Google Slides and then multiple people can control it.<p>We didn’t learn about those use cases until later, though. What happened was that we grew hyperbeam.com to 150k monthly active users and over 1M hours of video per month, but then it stopped growing. Despite this, we got into YC, and soon had multiple companies asking to buy our multiplayer browsing tech. After closing three deals, we decided to sell our multiplayer web browsers as an API. That way other companies can build products to connect others without going through two years of WebRTC hell like we did.<p>We allow developers to embed multiplayer web browsers in their web apps with a few lines of code. Users can then visit any website from inside that web app together. Developers can specify control permissions, programmatically navigate to specific URLs, and hide the browser UI so apps appear as if they are natively integrated.<p>Unlike screen share solutions that upload your personal computer stream to participants, Hyperbeam’s multiplayer web browsers run on our own virtual machines. This eliminates the upload speed bottleneck that many users experience.<p>We host a Chromium browser instance on our server, record the video and audio output and stream it to all participants using WebRTC. That sounds simple, but hosting full-blown Chromium instances is challenging, especially doing it cost-effectively: what we learned is Chromium instances, at scale, love memory bandwidth a lot more than the amount of memory. Also, network unreliability, like last-mile packet loss, is also a problem, especially audio packet loss which is a lot more noticeable than video packet loss. A simple hack we have in place is literally sending every audio RTP packet twice, which improves audio quality drastically over spotty connections.<p>Anyone is welcome to get a free playground API key and try our product! Rather than spend time building a UI for that, we’ve just put up a Google Form in the spirit of do-things-that-don’t-scale. Go to <a href=\"https:&#x2F;&#x2F;forms.gle&#x2F;RSQhbFXbdrcqwqsc9\" rel=\"nofollow\">https:&#x2F;&#x2F;forms.gle&#x2F;RSQhbFXbdrcqwqsc9</a>, fill in your email and we promise to send you an API key right away. The API docs are here: <a href=\"https:&#x2F;&#x2F;showy-backpack-b3f.notion.site&#x2F;Hyperbeam-API-eb9874bd1ef54c22ba7197324ce2223\" rel=\"nofollow\">https:&#x2F;&#x2F;showy-backpack-b3f.notion.site&#x2F;Hyperbeam-API-eb9874b...</a>.<p>Pricing is not transparent on our website yet—we’re still working it out. However, we’re going to use the same business model as CPaaS companies such as Agora and Twilio. We’ll charge customers a minimum amount per month and provide a set amount of participant hours. If a customer exceeds the provided participant hours, we continue charging at a fixed rate.<p>If you want to try out tech in action, you can do that by signing up for free and creating a room using our original Hyperbeam watch party platform: <a href=\"https:&#x2F;&#x2F;hyperbeam.com&#x2F;app&#x2F;register\" rel=\"nofollow\">https:&#x2F;&#x2F;hyperbeam.com&#x2F;app&#x2F;register</a><p>We’re happy to answer any questions you have, and would love to hear your ideas for other potential use cases as well. Thanks!",
      "time": 1645560993,
      "title": "Launch HN: Hyperbeam API (YC W22) – Multiplayer embeds of any website",
      "type": "story",
      "url": "https://www.hyperbeam.dev/"
    },
    {
      "by": "hindsightbias",
      "descendants": 0,
      "id": 30433088,
      "score": 2,
      "time": 1645560918,
      "title": "Global COBOL Growth Spurs Reevaluation of ‘Legacy’ Assets",
      "type": "story",
      "url": "https://www.itjungle.com/2022/02/16/global-cobol-growth-spurs-reevaluation-of-legacy-assets/"
    }
  ]
}