{
  "stories": [
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 31404145,
      "score": 1,
      "time": 1652742580,
      "title": "Row Highlighter for Gmail and Inbox",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/row-highlighter-for-gmail/ijfolchflbmnfopmpmodilcelmdakbfl"
    },
    {
      "by": "eluda",
      "descendants": 0,
      "id": 31404123,
      "score": 1,
      "time": 1652742421,
      "title": "100 Unique CSS Button Designs. Free and Open Source on Github.",
      "type": "story",
      "url": "https://github.com/eludadev/css-buttons"
    },
    {
      "by": "throwaway888abc",
      "descendants": 0,
      "id": 31404113,
      "score": 1,
      "time": 1652742345,
      "title": "Diamond Hands: The Legend of WallStreetBets",
      "type": "story",
      "url": "https://www.imdb.com/title/tt17662108/"
    },
    {
      "by": "needof",
      "descendants": 0,
      "id": 31404083,
      "score": 1,
      "text": "Long time lurker, always pull inspiration from show HN.<p>For the longest time, i thought my career path was to be senior developer, an architect, maybe one day a CTO.\nOnce i got into some of these positions i had major imposture syndrome, especially because i never finished college and only worked with select web languages (PHP, JS, Python). Yet i could lead a team, do the work, and for the most part was extremely passionate about it.<p>After years of successes and failures i became burnt out putting in 12+ hour days, constant feelings of imposture syndrome, not knowing how to get to the next level (lack of mentorship or a good manager), and not knowing how to handle the failures; i switched careers. \nThought maybe going into management would feel better, so an easy transition was becoming a (technical) project manager. At first it felt easy, some of the responsibilities were the same as what i had been doing before! However, lately i’ve realized that both the place i am working and this shift wasn’t necessarily right for me, that i hadn’t been growing, learning how to be a better PM or even working on that many projects due to the slow pace of the company.<p>With that, i’ve tried to spend time figuring out what could be a natural career progression based off my experience - and honestly i’m so unsure of which way to go or how to build a solid career path.\nI keep thinking either going back to development (but i’m a few years rusty now and don’t know how well i’ll be accepted even if i spend a few months sharpening those skills) or trying out product management (which excites me, and feels very challenging).<p>Are there other paths I should consider?\nAre any of the mentorship &#x2F; career coaching services good?\nI’ve seen things like Pathrise, BetterUp, Mento - but really unsure if they actually would help.<p>i’m hoping someone on here can help me out or point me to some good resources.",
      "time": 1652742030,
      "title": "Ask HN: Career Transition / Advice",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31404080,
      "score": 1,
      "time": 1652742011,
      "title": "How we handle multi-region sessions at Clever (2021)",
      "type": "story",
      "url": "https://engineering.clever.com/2021/08/10/how-we-handle-multi-region-sessions-at-clever/"
    },
    {
      "by": "chermanowicz",
      "descendants": 0,
      "id": 31404078,
      "score": 1,
      "time": 1652741968,
      "title": "Global Internet Access Network Token – Web3 Telecom Protocol",
      "type": "story",
      "url": "https://giantprotocol.org/litepaper/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31404040,
      "score": 2,
      "time": 1652741536,
      "title": "Apple and Google’s outdated apps ban would cut each store by a third",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/05/apple-and-googles-outdated-apps-ban-would-cut-each-store-by-a-third/"
    },
    {
      "by": "moffkalast",
      "descendants": 0,
      "id": 31404039,
      "score": 1,
      "time": 1652741522,
      "title": "Heh (God)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Heh_(god)"
    },
    {
      "by": "mmmmkay",
      "descendants": 0,
      "id": 31404014,
      "score": 2,
      "time": 1652741333,
      "title": "Console Services: A curated list of console services",
      "type": "story",
      "url": "https://github.com/chubin/awesome-console-services"
    },
    {
      "by": "vo2maxer",
      "descendants": 0,
      "id": 31404006,
      "score": 2,
      "time": 1652741265,
      "title": "Ad-tech firms grab email addresses from forms before they're even submitted",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/16/ad_companies_data/"
    }
  ]
}