{
  "stories": [
    {
      "by": "mkrecny",
      "descendants": 0,
      "id": 30092026,
      "score": 1,
      "time": 1643231918,
      "title": "Walmart’s FinTech Hazel Acquires Even and One to Build Finance Super App",
      "type": "story",
      "url": "https://www.pymnts.com/acquisitions/2022/walmarts-fintech-hazel-acquires-even-and-one-to-build-finance-super-app/"
    },
    {
      "by": "actionherobiju",
      "descendants": 0,
      "id": 30092019,
      "score": 2,
      "text": "Companies are will to pay big money to developers, however they issue crappy laptops as development machines. Laptops are designed for mobility, not for performance. Sure, you can use a dock and plug a keyboard and external monitor(s), but a Core i5 laptop with 16GB of ram running at 1.6GHz won&#x27;t cut it as a dev machine. I would imagine that companies would want to provide the best tools for their developers so that they can be happy and productive. What is the rationale for companies to do this kind of short-sighted thing?",
      "time": 1643231894,
      "title": "Why does companies issue crappy machines to developers?",
      "type": "story"
    },
    {
      "by": "codemersdev",
      "descendants": 0,
      "id": 30092011,
      "score": 1,
      "text": "You will get 3 months for free for feedback.farm pro plan. Gather YOUR customer feedback.<p>Just comment your Twitter Handle and I will reach out\nhttps:&#x2F;&#x2F;feedback.farm",
      "time": 1643231827,
      "title": "First 5 comments with Twitter handle will get 3 month free for feeddback.farm",
      "type": "story"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30092009,
      "score": 1,
      "time": 1643231815,
      "title": "The S&P 500 has outperformed Cathie Wood's ARKK since the March 2020 crash",
      "type": "story",
      "url": "https://markets.businessinsider.com/news/stocks/stock-market-analysis-sp500-cathie-wood-ark-tech-selloff-rotation-2022-1"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30091994,
      "score": 2,
      "time": 1643231759,
      "title": "iCloud failures, developer relations, and the 30 percent",
      "type": "story",
      "url": "https://www.jessesquires.com/blog/2022/01/26/icloud-failures-developer-relations/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 30091991,
      "score": 1,
      "time": 1643231744,
      "title": "A Student Loan Crisis Is Worse Than You Think",
      "type": "story",
      "url": "https://www.forbes.com/sites/zackfriedman/2021/11/13/the-student-loan-crisis-is-worse-than-you-think/"
    },
    {
      "by": "codemersdev",
      "descendants": 0,
      "id": 30091981,
      "score": 1,
      "time": 1643231713,
      "title": "You need feedback for your SaaS",
      "type": "story",
      "url": "https://feedback.farm?ref=hn"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30091980,
      "score": 1,
      "time": 1643231709,
      "title": "About the security content of macOS Monterey 12.2",
      "type": "story",
      "url": "https://support.apple.com/en-us/HT213054"
    },
    {
      "by": "gautamcgoel",
      "descendants": 0,
      "id": 30091974,
      "score": 2,
      "time": 1643231686,
      "title": "A critique of longtermism: why you shouldn't worry about the far future",
      "type": "story",
      "url": "https://gautamcgoel.substack.com/p/a-critique-of-longtermism-why-you"
    },
    {
      "by": "eezurr",
      "descendants": 0,
      "id": 30091931,
      "score": 1,
      "text": "Or non fiction. All the recent posts about the &quot;old internet&quot; are reminding me of the content I came across in the late 90s&#x2F;00s that I cant find anymore.<p>I remember coming across a cache of great short stories (some related to tech) over those years. One of them really stands out and I would love to read it again. The gist of it:<p>The main character (1st person) goes into work and some casual games are played that day (throughout the story he remains neutral). Over time, more games are played and everyone begins taking them more seriously. Soon the office separates into different cliques (marketing, sales, IT, etc), and the games evolve into competitive, office wide nerf gun fights. People start making bases out of their cubicles (roofs and all), eventually sleeping inside of them, fearing to leave them unguarded. It keeps escalating. People begin bringing hand guns&#x2F;rifles into work and plot how to knock out the other teams. Then I think it ends with the guy walking outside to the parking lot to have a smoke after speaking to the head IT guy (who hasnt showered nor left his base in days).",
      "time": 1643231553,
      "title": "Ask HN: Where can I find the old internet's short stories/fiction?",
      "type": "story"
    }
  ]
}