{
  "stories": [
    {
      "by": "mapmap",
      "descendants": 0,
      "id": 30028672,
      "score": 1,
      "text": "Is your company authorizing pay raises in-line with what we are seeing with inflation? Or are you having to move jobs to get that?",
      "time": 1642793029,
      "title": "Ask HN: Is your company paying cost of living increases?",
      "type": "story"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 30028659,
      "score": 1,
      "time": 1642792969,
      "title": "Seeking Enlightenment, He Disappeared into a Hiker’s Bermuda Triangle",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/21/books/review/lost-in-the-valley-of-death-harley-rustad.html"
    },
    {
      "by": "larryfreeman",
      "descendants": 0,
      "id": 30028651,
      "score": 1,
      "text": "Some say web3 is about cryptocurrency and decentralizatioan, others say it is about the metaverse with focus on VR&#x2F;AR, and some are bringing up the semantic web.  What do folks think?  What are the major features&#x2F;trends of Web 3.0?",
      "time": 1642792944,
      "title": "Ask HN: What are the features/technologies that make up Web 3.0?",
      "type": "story"
    },
    {
      "by": "artea73",
      "descendants": 0,
      "id": 30028620,
      "score": 1,
      "text": "I’ve never been an overachiever in school. I’ve always just been in the normal classes because I didn’t want to put in the time when I had other, more genuine interests. And I don’t mean playing video games all day. I mean things like programming and hacking with different electronics.<p>I don’t know very many people that aren’t hell-bent on getting into the best universities. Most of them are taking a significant number of advanced classes (by choice), then going home after school and doing hours and hours of homework, only to get up the very next day and repeat. I constantly wonder where they find the motivation to do this. I’ve talked to a lot of them and many don’t even seem to have any clear motivation except that of getting into the best universities. Maybe it’s not even them but someone else, like their parents.<p>Now I’ve started shifting my focus even further away from school. I’ve got a failing grade in math class, and I’m not even bothered by it. I care about math and believe it is important to solving many real-world problems, but I can’t get myself behind the idea of math class, and school in general. I’d rather learn these things on my own where I can work to apply them to meaningful problems. In other words, there needs to be more of a purpose.<p>So what if there were more opportunities for people who are not having it in high school? By this I mean something similar to a trade school. A place to go and learn all about a specific topic you are genuinely interested in, or think you would be interested in. And from there have the option to continue through on your current path, or pivot.",
      "time": 1642792857,
      "title": "Ask HN: Should there be more alternatives to high school?",
      "type": "story"
    },
    {
      "by": "CynicusRex",
      "descendants": 0,
      "id": 30028599,
      "score": 1,
      "time": 1642792758,
      "title": "Prime 997 Revisited",
      "type": "story",
      "url": "https://www.cynicusrex.com/file/997.html"
    },
    {
      "by": "kjhughes",
      "descendants": 0,
      "id": 30028576,
      "score": 2,
      "time": 1642792686,
      "title": "Netflix and Microsoft show video gaming has become too big to ignore",
      "type": "story",
      "url": "https://www.cnbc.com/2022/01/21/netflix-and-microsoft-show-video-gaming-has-become-too-big-to-ignore.html"
    },
    {
      "by": "tomwas54",
      "descendants": 0,
      "id": 30028547,
      "score": 2,
      "time": 1642792573,
      "title": "Transport Security for Recursive to Authoritative DNS",
      "type": "story",
      "url": "https://educatedguesswork.org/posts/dns-security-adox/"
    },
    {
      "by": "going_ham",
      "descendants": 1,
      "id": 30028534,
      "kids": [
        30028555
      ],
      "score": 2,
      "time": 1642792521,
      "title": "Inkdrop",
      "type": "story",
      "url": "https://www.inkdrop.app"
    },
    {
      "by": "alexrustic",
      "descendants": 0,
      "id": 30028533,
      "score": 1,
      "time": 1642792520,
      "title": "Omicron changed the pandemic. What happens next?",
      "type": "story",
      "url": "https://www.buzzfeednews.com/article/danvergano/omicron-future-variants"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30028528,
      "score": 2,
      "time": 1642792510,
      "title": "Tinder charges more for young gays, lesbians and the over-30s, says Which?",
      "type": "story",
      "url": "https://www.independent.co.uk/business/tinder-charges-more-for-young-gays-lesbians-and-the-over30s-says-which-b1997636.html"
    }
  ]
}