{
  "stories": [
    {
      "by": "fsflover",
      "descendants": 0,
      "id": 29296084,
      "score": 1,
      "time": 1637501046,
      "title": "Bitcoin Core adds support for I2P",
      "type": "story",
      "url": "https://geti2p.net/en/blog/post/2021/09/18/i2p-bitcoin"
    },
    {
      "by": "b0ner_t0ner",
      "descendants": 0,
      "id": 29296073,
      "score": 1,
      "text": "If big corporations can buy up smaller companies, then why can’t big cities buy up small towns?<p>Countless dying small towns in the US have had their population numbers decline over the years with many young people and families moving to bigger cities. You see so many “Help Wanted” signs at different restaurants and shops with nobody fill these positions.\nSimilarly, other small towns in the US South get hit by massive floods, tornadoes and hurricanes year after year and yet, they still rebuild in the same place.<p>So why don’t big cities like New York City buy up some of these small towns, help move the people, give them priority (affordable &#x2F; subsidized) housing, help them find jobs and invite them to integrate with a larger community?<p>Wouldn’t it be a positive for everyone involved? Some of the changes:<p><pre><code>  • People earning minimum wage in a small town with no future now have much bigger and better opportunities and choices in a big city\n  • Small town folks who get moved to a big cities will be exposed to a much larger culture (some may not have even seen or talked to black people or Asians in person); not to mention all the different foods they’d get exposed to\n  • The small towns are demolished and are turned back into what they were 100+ years ago fixing the environment: forests, swamps or land given back to the Aboriginals\n  • No more re-building homes in these tornado &#x2F; flooded &#x2F; hurricane damaged small towns year after year; it’s not wise and it’s just a waste of time, money and resources</code></pre>",
      "time": 1637500838,
      "title": "Ask HN: Why can’t big cities buy up small towns?",
      "type": "story"
    },
    {
      "by": "hidden-spyder",
      "descendants": 0,
      "id": 29296056,
      "score": 1,
      "time": 1637500625,
      "title": "Learning CSS Grid (2017)",
      "type": "story",
      "url": "https://varun.ca/css-grid/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29296054,
      "score": 1,
      "time": 1637500578,
      "title": "Colleges are walking away from remote education – and that’s a good thing",
      "type": "story",
      "url": "https://www.salon.com/2021/11/20/colleges-are-walking-away-from-remote-education--and-thats-a-good-thing/"
    },
    {
      "by": "realsid",
      "descendants": 0,
      "id": 29296049,
      "score": 1,
      "text": "I have been planning to join a funded startup that is working in checkout free technology space. They use weight sensors and over head cameras to ease the checkout experience of their users. Is this gimmicky or the future of retail ? What do you guys think ?",
      "time": 1637500485,
      "title": "Ask HN: What is the state of checkout free technology?",
      "type": "story"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29296033,
      "score": 1,
      "time": 1637500188,
      "title": "Webless Jumping Spiders Spin Super Strong Silk",
      "type": "story",
      "url": "https://www.the-scientist.com/news-opinion/webless-jumping-spiders-spin-super-strong-silk-69414"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 29296030,
      "kids": [
        29296064
      ],
      "score": 1,
      "time": 1637500054,
      "title": "What the end of anonymity means for consumers and brands",
      "type": "story",
      "url": "https://www.thedrum.com/opinion/2021/11/19/what-the-end-anonymity-means-consumers-and-brands"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29296024,
      "score": 1,
      "time": 1637499991,
      "title": "Breeding plants with genes from one parent",
      "type": "story",
      "url": "https://phys.org/news/2021-11-genes-parent.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29296023,
      "score": 1,
      "time": 1637499982,
      "title": "Hyperscan",
      "type": "story",
      "url": "https://www.hyperscan.io/"
    },
    {
      "by": "amelius",
      "descendants": 0,
      "id": 29296015,
      "score": 1,
      "time": 1637499812,
      "title": "Spotify has removed the shuffle button on its album pages after request by Adele",
      "type": "story",
      "url": "https://uk.news.yahoo.com/adele-shuffle-spotify-albums-124834967.html"
    }
  ]
}