{
  "stories": [
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 30579053,
      "score": 1,
      "time": 1646586885,
      "title": "Pension funds divesting from Russia may be new weapon in sanctions war",
      "type": "story",
      "url": "https://www.usatoday.com/story/money/2022/03/04/pension-funds-retirement-divest-russia-ukraine/9378810002/?gnt-cfr=1"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 30579048,
      "score": 1,
      "time": 1646586869,
      "title": "The Coder Supply Chain Runs Through Ukraine",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-03-01/ukraine-outsourcing-is-a-major-part-of-global-tech-supply-chain"
    },
    {
      "by": "Orfita",
      "descendants": 0,
      "id": 30579043,
      "score": 1,
      "text": "I&#x27;m not sure if this is the right place to ask, but I can&#x27;t figure out what could technically cause what just happened, and I thought you might know.<p>A few days ago I noticed something strange, the netflix account my friend was sharing with me started showing up in Spanish, I didn&#x27;t think much of it.\nNow I started getting really confused when my youtube subtitles had now also switched to Spanish as well, despite my youtube account language and location being set to an other country.<p>Note that I tried on both firefox and chrome and got spanish default in both cases.<p>Also note that I don&#x27;t use a VPN.<p>- I looked at my browsers language, it&#x27;s set to English<p>- Tried on private tab, same result<p>- Checked my OS language &#x2F; timezone, nothing about Spain here<p>- Checked my google account connections, nothing weird showing up here either<p>I simply cannot make sense of this, and that&#x27;s what made me want to post here. \nHow could both the netflix account of my friend, as well as my youtube subtitles start defaulting to Spanish given all the above points I mentioned?",
      "time": 1646586831,
      "title": "Ask HN: Why default language is mysteriously changing on online services?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30579041,
      "score": 1,
      "time": 1646586799,
      "title": "We have food safety laws thanks to 19th century “poison squad” (2018)",
      "type": "story",
      "url": "https://arstechnica.com/science/2018/11/meet-the-father-of-the-fda-a-fearless-crusader-for-food-safety/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 30579036,
      "score": 1,
      "time": 1646586765,
      "title": "California bill would ban 'squaw' in location names",
      "type": "story",
      "url": "https://www.latimes.com/california/story/2022-03-04/california-bill-would-ban-squaw-from-california-place-name"
    },
    {
      "by": "Garbage",
      "descendants": 0,
      "id": 30579008,
      "score": 1,
      "time": 1646586568,
      "title": "How to Live with Your Regrets",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20220207-how-to-live-with-your-regrets"
    },
    {
      "by": "donboscow",
      "descendants": 0,
      "id": 30579007,
      "score": 1,
      "text": "Hi, I am looking at Elasticsearch currently. Looks like a great search engine tool. I was wondering - what are its performance metrics relative to established players like Google? Like it uses Okapi BM25 algorithm, how does that measure up against Google&#x27;s PageRank? Is the quality and relevance of search results it offers at par with what Google offers? And secondly, what about the performance? Google handles 5 billion queries per day, with natural peak load scenarios like sports events, or other bid incidents like elections. is Elasticsearch capable of scaling to this level, with the right combination of sharding, distribution and indexing?",
      "time": 1646586564,
      "title": "Elasticsearch vs. Google",
      "type": "story"
    },
    {
      "by": "zeynepevecen",
      "descendants": 0,
      "id": 30578991,
      "score": 1,
      "text": "I&#x27;ve been coding for about 2 years and recently I noticed that I often encounter the same error messages in different projects.<p>I mostly remember how to solve a particular error but sometimes it takes a lot of time to figure out all over again. So I tried to store error messages and solutions on notion, but it got very complicated very quickly.<p>I am wondering are there methodologies for this issue or do you have any ideas how to store them?",
      "time": 1646586510,
      "title": "Ask HN: Is there a way to store encountred errors and their solutions?",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 30578975,
      "score": 1,
      "time": 1646586401,
      "title": "The Collapse of the Soviet Union – DW Documentary [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=JsPHKDuP-Hk"
    },
    {
      "by": "phsilva",
      "descendants": 1,
      "id": 30578973,
      "kids": [
        30579011
      ],
      "score": 2,
      "time": 1646586380,
      "title": "A free and open source PowerVR driver",
      "type": "story",
      "url": "https://twitter.com/alyssarzg/status/1499777071186391043"
    }
  ]
}