{
  "stories": [
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31628841,
      "score": 1,
      "time": 1654414685,
      "title": "Social media spreads rumours about vaccine harms, but doesn’t always start them",
      "type": "story",
      "url": "https://theconversation.com/social-media-spreads-rumours-about-covid-vaccine-harms-but-it-doesnt-always-start-them-184169"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31628836,
      "score": 1,
      "time": 1654414556,
      "title": "Self-Enforcing Contracts with Persistence",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S0304393222000411"
    },
    {
      "by": "sanketpatrikar",
      "descendants": 0,
      "id": 31628832,
      "score": 1,
      "time": 1654414456,
      "title": "RNA spontaneously forms on basalt lava glass (abundant on Earth 4.35B years ago)",
      "type": "story",
      "url": "https://www.liebertpub.com/doi/10.1089/ast.2022.0027"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31628823,
      "score": 1,
      "time": 1654414325,
      "title": "To boost South Korea’s basic science, look to values, not just budgets",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01529-x"
    },
    {
      "by": "brihanna",
      "descendants": 0,
      "id": 31628813,
      "score": 1,
      "text": "Fuck you",
      "time": 1654414217,
      "title": "Roblox",
      "type": "story"
    },
    {
      "by": "cpeterso",
      "descendants": 0,
      "id": 31628798,
      "score": 1,
      "time": 1654413929,
      "title": "Google wants a single video messaging app, will merge Google Meet and Duo",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/06/google-wants-a-single-video-messaging-app-will-merge-google-meet-and-duo/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31628788,
      "score": 1,
      "time": 1654413835,
      "title": "Should we protect nature for its own sake? For its economic value?",
      "type": "story",
      "url": "https://theconversation.com/should-we-protect-nature-for-its-own-sake-for-its-economic-value-because-it-makes-us-happy-yes-180302"
    },
    {
      "by": "vector_spaces",
      "descendants": 0,
      "id": 31628780,
      "score": 1,
      "time": 1654413723,
      "title": "Dubious Ways to Compute the Zeros of a Polynomial",
      "type": "story",
      "url": "https://blogs.mathworks.com/cleve/2016/06/27/19-dubious-ways-to-compute-the-zeros-of-a-polynomial/"
    },
    {
      "by": "ejahijagic",
      "descendants": 0,
      "id": 31628778,
      "score": 1,
      "text": "TLDR; I&#x27;m not linking any of my stories, profile, etc... Asking for advice and suggestions only, regarding blogging and Medium in particular. I had 35k views in the last 30 days, should I keep writing and pursue the partnership program? How much money can I earn?<p>So, a few weeks back I wanted to start my blog on various tech and software engineering topics. I wondered why not start writing on Medium, and I&#x27;ll see how it goes there, before starting my own website, blog, app, etc.\nSo, I started writing on the 15th of May. My first reads started bumping on the 19th of May.<p>I got much more response than I expected, so I&#x27;m wondering whether am I doing good, or if this is just average for new writers.<p>Stats<p>In the last 16 days - I&#x27;ve got 34k Views - 10.3k Reads - 310 Fans\nI have a total of 171 Followers.<p>I wrote 22 Stories - some of these were just experimental stories, so they didn&#x27;t perform at all. Most have under 400 Views, some even less than 50 Views.<p>I have some Stories, that perform really well or relatively well.\nOne with 18.1k Views\nOne with 7k Views\nTwo With ~2-3k Views\nOne with 1k Views<p>Personally, I didn&#x27;t expect this amount of views and reads even remotely. I average around a 40% read-view ratio.<p>Publications\nThe two stories with the most Views (7k, and 18k) were performing really well even before I submitted them to a publication.<p>The other ones started performing well once I published them in smaller publications, which have ~10-50k followers. The decent one with 7k, I later on published in one quite big publications on tech., on Medium. It has 650k followers.<p>The story with 18k views is published in a small publication, but still generates a decent amount of views, reads, and comments daily.<p>Topics<p>I mostly write on the same topics, and my audience is mostly evenly distributed between these tags: Programming, Technology, Software Engineering, Science, and Data Science.<p>I&#x27;m just throwing this out here, as another stat.<p>--<p>So Reddit, can you please give me some feedback on this?<p>How good are my stats? I&#x27;m unfortunately not from a country that Medium supports for their Partnership program. Stripe is however supported, so I know there are some workarounds - but is it worth it in my case? I heard it would cost you around $500 on Stripe, to get a business that can then be approved for a partnership or something under those lines.<p>Would that cost be justified? How much could I earn with these stats?<p>Also, what I was planning is to create my own blog, website, and app. I&#x27;m a developer, so I wouldn&#x27;t need to spend a lot of money, except my time, on this. I thought I&#x27;ll start linking my Medium, Blog, and App together, that should increase my reach I think. Is that a good idea?<p>Any suggestions, please. Should I go for Medium partnership workarounds, should I create the blog in combination with Medium, or should I even consider writing only on my blog without going through the Medium partnership hassle?<p>Thanks!",
      "time": 1654413681,
      "title": "New writer asking for advice, regarding writing on Medium. Am I doing it right?",
      "type": "story"
    },
    {
      "by": "moconnor",
      "descendants": 3,
      "id": 31628774,
      "kids": [
        31628811,
        31628781
      ],
      "score": 5,
      "time": 1654413598,
      "title": "Every photo I took of a NATO building disappeared from my camera roll",
      "type": "story",
      "url": "https://twitter.com/ethorkel/status/1533202626904350721"
    }
  ]
}