{
  "stories": [
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 31572239,
      "score": 1,
      "time": 1654017841,
      "title": "Mac’s Bugs Are Different",
      "type": "story",
      "url": "https://medium.com/@parttimeben/macs-bugs-are-different-209c29ac2488"
    },
    {
      "by": "svhnohio",
      "descendants": 0,
      "id": 31572224,
      "score": 1,
      "text": "I&#x27;m posting in hopes a few will volunteer for testing.<p>APK https:&#x2F;&#x2F;ufile.io&#x2F;kw5gonpc\n(APK is only downloadable until testing is satisfied - It&#x27;s free at UFile.io - no signing up required - choose Free Download)<p>YouTube https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OvpgviLECXA\n(Demonstration &#x2F; Instructions)<p>THE DETAILS...<p>ABOUT THE APP<p>My app is called ResearchDB, a &quot;documenting&quot; form of note taking app - meaning it requires you to &quot;document&quot; your source and has a 1&#x2F;2 dozen required fields. In other words, the purpose of this note taking app is not just noting something of interest, but &quot;supportively documenting&quot; the note and source. Whether the subject(s) of interests (i.e, databases created) are about cars, gardening, music, politics, medical, religion, movies, etc. this app requires your note (or thought&#x2F;belief) to be supported by a source (entered once and selectable). This is a way for a person to support and help them recall information supporting their beliefs without the necessity of having to memorize or have to say &quot;I read...&quot;, &quot;He said...&quot;, &quot;There was a video say show how...&quot;, etc. and it not be available... whereas now, they can provide the evidence supporting their beliefs or interest on the spot.<p>This is why I call it ResearchDB. We all have particular, beliefs, ideas, interests, and this note taking app is intended to be a way to document those beliefs, interests and ideas through the creation of multiple &quot;subject-based&quot; databases containing notes helping us remember and recall those things in a way that helps us remember them. And since it is a phone app, we can recall and pull up those supportive notes at any moment.<p>In addition, some perks are a person can:<p><pre><code>  - Attach nearly any type of file that their phone has an app to support (MS Office files, pics, audio, video, a broad range of attachments to each note).\n\n  - Share (export and send) selected individual notes or the databases on subjects they create with one another (import and upload them).\n\n  - 3 fields can be relabeled per subject (i.e., database) to be more specifically oriented to that subject, of which, one of the 3 fields is specifically a dropdown search field (similar to the &quot;TOPIC&quot; field) but yet is still included in the general field search function. So you could designate specifically the search dropdown to a detail you believe useful besides just a topic.\n\n</code></pre>\nABOUT THE LINKS<p>I have included a link to the Android APK for downloading and a YouTube link which demonstrates the intent and how to use the app in 9-10 minutes. The APK link takes you to &quot;ufile.io&quot; - a web storage source I use, but it is free to download, there is not a requirement to sign up, create an account or purchase, simply just choose the slower - free download option. The APK should be signed and I will assume a tester may know how to sideload it through developer options to their Android phone.<p>APK https:&#x2F;&#x2F;ufile.io&#x2F;kw5gonpc (APK is only downloadable during this posts testing time until testing is satisfied)<p>YouTube https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OvpgviLECXA<p>BTW, the app also includes a PDF pictorial guide on how to do everything - besides the YouTube video.<p>ABOUT ME and MY INTENTION:<p>For the past couple years I&#x27;ve been trying to learn Android app development. I&#x27;ve been working as a &#x27;software engineer&#x27; off and on for 10 years simply out of corporate need (didn&#x27;t go to school for). I had an idea for a personal note taking app and now I&#x27;m considering the possibility of releasing it.<p>Thanks for this opportunity and being willing to test and try this if you do.<p>- Scott",
      "time": 1654017791,
      "title": "Show HN: Test My New Documenting Research App (Free Android)",
      "type": "story"
    },
    {
      "by": "TimWolla",
      "descendants": 0,
      "id": 31572208,
      "score": 1,
      "time": 1654017736,
      "title": "HAProxy 2.6",
      "type": "story",
      "url": "https://www.haproxy.com/blog/announcing-haproxy-2-6/"
    },
    {
      "by": "mitchhentges",
      "descendants": 1,
      "id": 31572175,
      "kids": [
        31572184
      ],
      "score": 1,
      "time": 1654017614,
      "title": "Show HN: Pip-compile-cross-platform Python dependency pinning but cross-platform",
      "type": "story",
      "url": "https://gitlab.com/mitchhentges/pip-compile-cross-platform"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 31572169,
      "score": 2,
      "time": 1654017595,
      "title": "Django, The Right Way: An opinionated guide on Django",
      "type": "story",
      "url": "https://spookylukey.github.io/django-views-the-right-way/"
    },
    {
      "by": "starscrowding",
      "descendants": 1,
      "id": 31572165,
      "kids": [
        31572219
      ],
      "score": 3,
      "time": 1654017584,
      "title": "StarsCrowding whitepaper. Web3 platform for people",
      "type": "story",
      "url": "https://www.canva.com/design/DAFAfBQ0U1k/wY6y6w9qfOJzGLNiXugWrA/view"
    },
    {
      "by": "flapjack",
      "descendants": 0,
      "id": 31572149,
      "score": 1,
      "time": 1654017526,
      "title": "Reducing bias of networking A/B tests",
      "type": "story",
      "url": "https://blog.apnic.net/2022/05/11/reducing-bias-of-networking-a-b-tests/"
    },
    {
      "by": "FeaturelessBug",
      "descendants": 0,
      "id": 31572147,
      "score": 2,
      "time": 1654017517,
      "title": "Elon Musk Gets into Embarrassing Fight with Video Game Site, Loses",
      "type": "story",
      "url": "https://kotaku.com/elon-musk-hard-drive-stolen-meme-twitter-credit-1848995870"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31572135,
      "score": 1,
      "time": 1654017461,
      "title": "Programming with rules and everything else, seamlessly",
      "type": "story",
      "url": "https://arxiv.org/abs/2205.15204"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31572119,
      "kids": [
        31572176
      ],
      "score": 1,
      "time": 1654017400,
      "title": "How to Fix Higher Ed",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2022/05/student-loans-forgiveness-higher-ed/639438/"
    }
  ]
}