{
  "stories": [
    {
      "by": "Kinrany",
      "descendants": 0,
      "id": 28537275,
      "score": 1,
      "time": 1631700482,
      "title": "AWS Smithy – A language for defining services and SDKs",
      "type": "story",
      "url": "https://awslabs.github.io/smithy/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28537249,
      "score": 1,
      "time": 1631700242,
      "title": "‘Saluton ’: the surprise return of Esperanto (2017)",
      "type": "story",
      "url": "https://www.theguardian.com/science/2017/dec/06/saluton-the-surprise-return-of-esperanto"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28537245,
      "score": 1,
      "time": 1631700235,
      "title": "‘Blockchain’ is meaningless (2018)",
      "type": "story",
      "url": "https://www.theverge.com/2018/3/7/17091766/blockchain-bitcoin-ethereum-cryptocurrency-meaning"
    },
    {
      "by": "isaacfrond",
      "descendants": 0,
      "id": 28537229,
      "score": 2,
      "time": 1631700066,
      "title": "Disney+ is killing the blockbuster movie with its identikit mega-hits",
      "type": "story",
      "url": "https://www.theguardian.com/film/2021/sep/15/disney-plus-blockbuster-movie"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28537224,
      "score": 1,
      "time": 1631700026,
      "title": "Extraterrestrial Cause for the Cretaceous-Tertiary Extinction [pdf]",
      "type": "story",
      "url": "https://websites.pmc.ucsc.edu/~pkoch/EART_206/09-0305/Alvarez%20et%2080%20Science%20208-1095.pdf"
    },
    {
      "by": "tdido",
      "descendants": 1,
      "id": 28537179,
      "kids": [
        28537180
      ],
      "score": 1,
      "time": 1631699685,
      "title": "Seq: A programming language for high-performance computational genomics",
      "type": "story",
      "url": "https://github.com/seq-lang/seq"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 28537171,
      "kids": [
        28537172
      ],
      "score": 1,
      "time": 1631699612,
      "title": "Amateur astronauts set for SpaceX orbital flight",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-58561621"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28537146,
      "score": 1,
      "time": 1631699356,
      "title": "Google Sitelinks Documentation",
      "type": "story",
      "url": "https://developers.google.com/search/docs/advanced/appearance/sitelinks"
    },
    {
      "by": "srcoder",
      "descendants": 0,
      "id": 28537127,
      "score": 1,
      "time": 1631699130,
      "title": "Mage Open Source Community Alliance – The Future of Magento",
      "type": "story",
      "url": "https://www.mage-os.community/blog/the-future-of-magento"
    },
    {
      "by": "another_why",
      "descendants": 2,
      "id": 28537124,
      "kids": [
        28537239
      ],
      "score": 1,
      "text": "When it comes to climate change everyone here knows how to fix it: stop eating cows, use solar batteries, build you own windmill, grow your own food, jog... and other simple things. But I rarely see(if ever) that for achieving those things at once, lets say 10 years, taxes of most countries, including relatively rich European countries, will have to be channeled from social security to this noble cause. Therefore, elders in developed countries will lose several years of their life while people in the third world countries, the ones who will pay for the bigger part of this banquet,  will have to eat less. But that&#x27;s just a nuance.<p>Everyone is waiting until &quot;stupid and corrupted politicians&quot; will realize how important this threat is, but they won&#x27;t. Their job is not evaluating environmental threats, it&#x27;s evaluating of how much corporations can take at the moment without people going too angry and being reelected, so they could continue that next year. There is only one way for politicians to understand how important this is - you should stop being calm. No researches, graphs and posts on forums can make them do something about it<p>Many of you have relatively high salaries which cover all your basic needs:time, good food, shelter, clothes, personal transport, even kids(now THAT is a real luxury). So where do you spend the rest of your resources? I understand that reducing your carbon footprint, designing and building a house on a renewable energy(with a windmill) makes you feel like you did something useful, but it&#x27;s no different than growing a beautiful tree in your garden while looking how a whole forest is burning to the ground nearby. &quot;I made a difference! Everyone should do like me!&quot; But they wont, they dont have access to the same resources as you do - education, money and time. If you are THAT uninterested in doing something for the thing which you consider important, then, instead of pretending, you would&#x27;ve better donated all that for a medical research. You know, save a couple of lives for real<p>With the set of skills and resources people have here a real thing can be done, main thing, when it comes to influencing people:activism and propaganda. But you waste them on sorting trash.",
      "time": 1631699117,
      "title": "Climate change, simple things and hypocrisy",
      "type": "story"
    }
  ]
}