{
  "stories": [
    {
      "by": "bitbro",
      "descendants": 0,
      "id": 29614763,
      "score": 1,
      "text": "Traddit for Reddit allows you to Follow Subreddits and Stocks, Reddit Stock Trends, Short Interest data, Earnings Calendar, News with Sentiment Analysis, Real-Time Stock Prices and a Memes Page!\nFeatures that will be added soon: Fed data, FTD data, Darkpool data, Google search trends, politician trades data, daily short volume, whale trades, stock filter tool, Economic and special events calendar as well as podcasts and YouTube videos.",
      "time": 1639928691,
      "title": "Traddit- a Reddit Client That Eliminates Fud Using AI",
      "type": "story"
    },
    {
      "by": "matrione",
      "descendants": 0,
      "id": 29614761,
      "score": 1,
      "time": 1639928626,
      "title": "Datacamp 2.0",
      "type": "story",
      "url": "https://www.datacamp.com?irclickid=yA7VaS3zuxyIRn8yY1U4nQPsUkGwlszKhVrvX40&irgwc=1"
    },
    {
      "by": "launchiterate",
      "descendants": 0,
      "id": 29614738,
      "score": 1,
      "text": "Rest up for the new year, I’m grateful for each and every one of you for your contributions.",
      "time": 1639928476,
      "title": "Tell HN: Happy Holidays",
      "type": "story"
    },
    {
      "by": "DrHilarius",
      "descendants": 0,
      "id": 29614726,
      "score": 1,
      "time": 1639928361,
      "title": "EU to place order with Pfizer for Covid shots adapted to Omicron",
      "type": "story",
      "url": "https://www.reuters.com/world/europe/eu-place-order-with-pfizer-covid-shots-adapted-omicron-2021-12-17/"
    },
    {
      "by": "tcconsult",
      "descendants": 0,
      "id": 29614719,
      "score": 1,
      "time": 1639928281,
      "title": "Install Windows 10 without a Microsoft Account",
      "type": "story",
      "url": "https://www.telechronconsulting.com/installing-windows-10-without-a-microsoft-account/"
    },
    {
      "by": "sisishooman",
      "descendants": 0,
      "id": 29614713,
      "score": 3,
      "time": 1639928248,
      "title": "Who decided that Medicare needed an “Anti-Racism Plan”?",
      "type": "story",
      "url": "https://www.contemporaryidiot.com/p/did-you-know-that-medicare-needed"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 29614692,
      "score": 1,
      "time": 1639928026,
      "title": "Hive Mind – The collective intelligence of a mob",
      "type": "story",
      "url": "https://kk.org/mt-files/outofcontrol/ch2-b.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29614677,
      "score": 1,
      "time": 1639927939,
      "title": "Metal Gear Solid 2 and 3 pulled from stores over licensing issue",
      "type": "story",
      "url": "https://www.polygon.com/22770136/metal-gear-solid-2-3-takedown-removed-playstation-store-pc-gog"
    },
    {
      "by": "authed",
      "descendants": 0,
      "id": 29614648,
      "score": 11,
      "time": 1639927694,
      "title": "An iframe from googlesyndication.com tries to access the Camera and Microphone",
      "type": "story",
      "url": "https://techsparx.com/software-development/security/csp-camera-microphone.html"
    },
    {
      "by": "savolai",
      "descendants": 1,
      "id": 29614629,
      "kids": [
        29614720
      ],
      "score": 3,
      "text": "This is a request for help with FB and Insta accounts. I am aware this happens quite a bit, though not sure if it&#x27;s usually anything so completely unexplained. Any tips on how to approach this are appreciated.<p>No warning notice, just banned instantly from both Facebook and Instagram, which I use for marketing as an ISV and a coach. No real explanation.<p>Screenshots:\nhttps:&#x2F;&#x2F;savolai.net&#x2F;uncategorized-en&#x2F;banned-from-facebook-and-instagram-screenshots&#x2F;<p>In the facebook appeals form they request a photo of user identification such as passport. I&#x27;m not sure I feel comfortable sharing all the sensitive info on it. Is it i.e. okay to cover up my Finnish social security number ending part from this?<p>The whole process seems horribly broken. Is this normal?<p>Details:<p>On Friday night at around 9pm Finnish time (UTC+2) I was on my laptop. I switched to Facebook tab and it suddenly told me I had activity on facebook that goes against community guidelines.<p>I hadn&#x27;t posted anything this week, except as instagram stories that get synced to my coaching page, which hasn&#x27;t been closed. I don&#x27;t think I post anything very controversial, related to covid or otherwise.<p>In the first screen I saw (screenshot in above url)\nthey asked me to push a big blue button to indicate I disagree with the decision.<p>They sent me and I received a SMS verification code but the web ui still said sending the code failed so I couldn&#x27;t enter the code. After trying a couple of times, they say I&#x27;ve tried too many times and there is a delay of 24h. Even after the 24h passed, I still get this.<p>Every time I enter now on my cell phone, I get this screen that claims to show the violating content I have posted, except the photo grid only shows blank grey rectangles. Pressing the &quot;Continue&quot; button gives a grey spinner and does nothing.<p>Today the time at which they claim I posted those violating images had changed. Originally it was 8:51pm  on Friday night. Now they said it was 1:51 am yesterday, i.e on Saturday morning, by which time the account had already been suspended for several hours.<p>Accessing on my cell phone I managed to get the instagram verification process started. Just now I found another form where I could give my userid&#x2F;phone number and a scanned photo of personal ID.<p>My business pages are still up, but I have no way of accessing them.<p>Thanks for any pointers on how to proceed!",
      "time": 1639927551,
      "title": "Ask HN: Banned from Facebook/meta services without explanation",
      "type": "story"
    }
  ]
}