{
  "stories": [
    {
      "by": "doener",
      "descendants": 0,
      "id": 29576253,
      "score": 1,
      "time": 1639643483,
      "title": "The first YouTube Client for m68k Amiga",
      "type": "story",
      "url": "https://blog.alb42.de/amitube/"
    },
    {
      "by": "sofixa",
      "descendants": 0,
      "id": 29576239,
      "score": 1,
      "time": 1639643322,
      "title": "‘Silicon Saxony’ aims to be EU chipmaking hub",
      "type": "story",
      "url": "https://www.ft.com/content/75841b94-196e-466f-ad1b-72d3809c33fc?shareType=nongift"
    },
    {
      "by": "hgarg",
      "descendants": 0,
      "id": 29576226,
      "score": 1,
      "time": 1639643167,
      "title": "Show HN: AI Buddy – A GPT-3 Powered WhatsApp AI Chat Bot",
      "type": "story",
      "url": "https://website-aibuddy.onrender.com/"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 29576206,
      "score": 2,
      "time": 1639642904,
      "title": "Grindr’s $7M GDPR fine is a stark warning to adtech not to track",
      "type": "story",
      "url": "https://techcrunch.com/2021/12/15/grindr-final-gdpr-fine/"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 29576194,
      "score": 1,
      "time": 1639642824,
      "title": "Skills, not schools, are in demand among developers",
      "type": "story",
      "url": "https://stackoverflow.blog/2021/12/16/skills-not-schools-are-in-demand-among-developers/"
    },
    {
      "by": "thereare5lights",
      "descendants": 0,
      "id": 29576172,
      "score": 1,
      "time": 1639642527,
      "title": "Reddit confidentially files to go public",
      "type": "story",
      "url": "https://old.reddit.com/r/sanfrancisco/comments/rhk8mq/reddit_confidentially_files_to_go_public/"
    },
    {
      "by": "dundalk03",
      "descendants": 0,
      "id": 29576162,
      "score": 1,
      "time": 1639642420,
      "title": "How to Avoid Feature Bloat",
      "type": "story",
      "url": "https://userpilot.com/blog/feature-bloat/"
    },
    {
      "by": "duffsdevice",
      "descendants": 1,
      "id": 29576152,
      "kids": [
        29576230
      ],
      "score": 1,
      "time": 1639642344,
      "title": "Conan does not evaluate joint compatibility of version requirements by design",
      "type": "story",
      "url": "https://github.com/conan-io/conan/issues/8504"
    },
    {
      "by": "philonoist",
      "descendants": 1,
      "id": 29576123,
      "kids": [
        29576266
      ],
      "score": 2,
      "text": "I am not lucky to sit behind seniors at startups or FAANGs on desk to observe their thought process and creativity.<p>Please recommend me some good books which I should read repeatedly as I progress through years in software development. An experienced author, primary or secondary, is better. \nThe wisdom is something cemented with layers and layers of experiences over the years that they might as well be called epithets of software development.<p>I want to build an asset that stays for years. I want to portend and avoid security issues, avoid downward spiral of interconnected bugs, build code for extensible feature additions, design with keeping privacy and user power in mind; know how not to fall for the new tech fad, as in hold firm against the management pressure to change the product tech...; be able to lead a team of principle software engineer with ease without having the same YoE as requirement, etc.<p>When startups had consistently 99% fail rate, I am amazed at how VIM of 1990s could be so long-lasting, powerful, usable, dependable, and extensible till date. The paradigm shift also percolates into browsers, window managers and file explorers. Same goes for a lot of *nix tools like password managers come and go but &#x27;pass&#x27; just stays; X11-&gt;Wayland; Looking at PayPal in its early stage to now is another amazement to me. Same goes for Apple iOS features and Google web features.<p>On the other hand the virus vulnerable Windows95, its gui, its Ctrl+Alt+Del features took off because it feeds off on people&#x27;s laziness and profit for the sacrifice of everything good.<p>Currently I read some code on recommended open source projects at Github.<p>I want to focus in desktop, android, and web app development as priority but won&#x27;t limit myself to it.",
      "time": 1639641878,
      "title": "Ask HN: Good books that have documented software development wisdom of years?",
      "type": "story"
    },
    {
      "by": "vincent_s",
      "descendants": 0,
      "id": 29576113,
      "score": 1,
      "time": 1639641748,
      "title": "Google Says Links Are Not Mandatory for Ranking in Google Search",
      "type": "story",
      "url": "https://www.seroundtable.com/links-are-not-mandatory-for-ranking-in-google-search-32558.html"
    }
  ]
}