{
  "stories": [
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 32193038,
      "score": 1,
      "time": 1658503795,
      "title": "Eerie glow in sky confuses Australian town and outs cannabis farm",
      "type": "story",
      "url": "https://www.bbc.com/news/world-australia-62261094"
    },
    {
      "by": "ijlmond",
      "descendants": 0,
      "id": 32193034,
      "score": 1,
      "time": 1658503780,
      "title": "Scientists develop laser that can mark the air",
      "type": "story",
      "url": "https://www.independent.co.uk/tech/laser-wuhan-china-quantum-computers-b2128999.html"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 32193028,
      "score": 1,
      "time": 1658503759,
      "title": "Polio Detected in US",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/07/polio-detected-in-us-in-same-ny-county-with-explosive-measles-outbreak-in-2019/"
    },
    {
      "by": "tacostakohashi",
      "descendants": 0,
      "id": 32193017,
      "score": 1,
      "text": "One thing I have seen over and over again in many organizations is that a new product is designed and implemented from scratch, using a fairly logical and sensible structure &#x2F; architecture.<p>For example, maybe there is a frontend that connects to three separate backend servers, A, B, and C, which all handle some different, self-contained logical thing. Or maybe things are divided into key classes A, B and C, each of which encapsulates a self-contained piece of functionality. It&#x27;s possible for A or B to fail without affecting C. If B crashes, you know it is due to a problem with some particular feature. It&#x27;s all quite sensible and easy to reason about.<p>Then, later, after go-live... a new, unrelated major feature D is added. Instead of creating a new backend server or class to implement D, it is shoe-horned into the existing A&#x2F;B&#x2F;C backend server or classes or whatever. And then feature, E, feature F, etc... all shoehorned into whatever the original architecture &#x2F; components were, instead of adding dedicated new components for D and E and F, just like happened for A&#x2F;B&#x2F;C.<p>Obviously, over time, this just leads to a big mess. Not only do you not end up with a dedicated, self-contained implementation for D, you also destroy the dedicated, self-contained components you originally had for A&#x2F;B&#x2F;C in the process, and after a bit of time it turns into a big unstructured mess.<p>I always find this kind of bizarre, because often the original structure is pretty sensible, and all that&#x27;s required is to continue applying the same reasoning and techniques to new features as was applied to the original ones.<p>Sometimes there are administrative disincentives that encourage this, like requiring some onerous approval for a &quot;new&quot; server &#x2F; class &#x2F; source file, but a lightweight process for a &quot;change&quot; to an existing thing... but for the most part it just seems to be odd that people can&#x27;t apply more of what&#x27;s already in front of them, instead of destroying it.",
      "time": 1658503696,
      "title": "Ask HN: Any name/metaphor for this particular kind of entropy / tech debt?",
      "type": "story"
    },
    {
      "by": "pmanning11",
      "descendants": 0,
      "id": 32193016,
      "score": 2,
      "text": "So long story short, I was in Bali just before COVID and decided to stick around...for 3 years. After freelancing as a designer&#x2F;developer for nearly a decade I decided to look for a remote job - cuz why the fuck not everyone was hiring remote. I applied and got a job posted for &#x27;hybrid&#x27; work - took 2 months to convince them I would do the work and come back in the summer (traditional finance company not used to remote ).<p>Over the past 3 months, I solo built an entire application from scratch that was presented to the Board 3 times which my boss says they&#x27;re all ecstatic about. He mentioned the head of the project doesn&#x27;t know I exist - thinks my boss made the entire thing. CEO, President, etc. all know about the project and are excited about &#x27;my bosses project&#x27;. Basically the head of the project passed on sketches and screenshots of excel sheets which my boss would give me one sentence of what to build, no design. Usually, I don&#x27;t give a fuck but it&#x27;s different as a freelancer working directly with clients - definitely stings the ego thinking I was part of the company and having put in all the effort. Have I been freelancing so long I just forgot that&#x27;s how office work hierarchy goes? Kinda makes me wanna say  and go back to freelancing.<p>I&#x27;m moving back to NJ to be &#x27;hybrid&#x27; beginning of August...Do I mention to the head of the project the first time I meet him that I built the entire app or just let my boss have his glory and mention I&#x27;m on the team that helped build it?  Don&#x27;t want bad blood with the boss as he&#x27;s a nice guy and gives me freedom, but don&#x27;t mind if I need to find another job as I&#x27;m not stoked on this company and I&#x27;m financially stable.<p>I guess more generally...do more people in remote companies also feel not being acknowledged for their work?",
      "time": 1658503688,
      "title": "Remote Work Credit? I built an entire app that the company thinks my boss built",
      "type": "story"
    },
    {
      "by": "1sembiyan",
      "descendants": 0,
      "id": 32193012,
      "score": 2,
      "time": 1658503670,
      "title": "Misinformation Is Here to Stay",
      "type": "story",
      "url": "https://www.persuasion.community/p/misinformation-is-here-to-stay-and"
    },
    {
      "by": "samemail88",
      "descendants": 0,
      "id": 32192996,
      "score": 2,
      "time": 1658503610,
      "title": "Prostitution and Spam Killed Craigslist",
      "type": "story",
      "url": "https://ashlan.com/blog/prostitution-and-spam-killed-craigslist/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 32192982,
      "score": 1,
      "time": 1658503546,
      "title": "Program Management for Open Source Projects",
      "type": "story",
      "url": "https://pragprog.com/titles/bcosp/program-management-for-open-source-projects/"
    },
    {
      "by": "wakahiu",
      "descendants": 0,
      "id": 32192956,
      "score": 1,
      "time": 1658503416,
      "title": "Central Banker’s Crypto",
      "type": "story",
      "url": "https://economicinsights.substack.com/p/your-central-bankers-crypto"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 32192908,
      "score": 2,
      "time": 1658503229,
      "title": "HammerSpoon Window Management on Mac",
      "type": "story",
      "url": "https://freesoft.dev/program/64447464"
    }
  ]
}