{
  "stories": [
    {
      "by": "jayra",
      "descendants": 1,
      "id": 30969910,
      "kids": [
        30969917
      ],
      "score": 1,
      "text": "Hi HN,<p>This is the first issue of my new side project called Books In Short, a free weekly newsletter where I share the key insights and ideas from popular non-fiction books.<p>This week I&#x27;m sharing 10 powerful lessons from &quot;Atomic Habits&quot; by James Clear.<p>What’s included in this issue:<p>Summary<p>Key ideas<p>My top 3 quotes<p>—<p>Let’s dive in!<p>-<p>Summary<p>In Atomic Habits, Clear argues that big goals shouldn’t be your primary focus in life. Instead, you should be utilising frequent, repetitive actions and systems to help develop habits that stick.<p>The more significant changes you want to make in your life depend more on creating small habits rather than sizeable shifts.<p>Key Ideas<p>1. What are habits?<p>Habits are small, everyday behaviours that we perform automatically, with little or no thought. Habits are also powerful and they form our identity.<p>2. Habits are built through conditioning<p>We tend to repeat satisfying behaviours until they become automatic. You can use conditioning to help build good habits.<p>3. Small improvements can make a big difference<p>We fail to create good habits because we convince ourselves that massive success requires massive action, and we tend to underestimate the value of making small improvements.<p>Atomic habits are the compound interest of self improvement as the effect of your habits multiplies as you repeat them.<p>4. Forget about goals, concentrate on systems<p>Goals are the results you want to achieve. Systems are the processes that lead to those outcomes. Your focus should be on the systems. If you’re having trouble changing your habits, the problem isn’t you. The problem is your system.<p>5. Habits Loops<p>Habits are self-reinforcing, which means that doing the habit and receiving the reward strengthens your desire to do it again.<p>The habit loop consists of four steps - the Cue, Craving, Action and Reward.<p>6. Make it obvious (cue)<p>To take advantage of habit loops to build good habits, you want to make the cues obvious. And for bad habits, you want to make the cues invisible or remove them.<p>7. Make it attractive (craving)<p>To make a habit stick, you must get regular positive feedback from it. The more attractive something is, the more likely we are going to adopt it as a habit.<p>8. Make it easy (action)<p>You need to reduce the friction associated with positive behaviours. And the best way to break a bad habit? Make it impractical or impossible to do.<p>9. Make it satisfying (reward)<p>Habits can be hard to pick up because they don’t always provide the instant gratification. To make your habit stick, you need to figure out a way to give yourself an immediate reward.<p>10. The importance of habit tracking<p>Habit tracking is a simple but effective technique to ensure that you are staying on track and helps create a visual measure of your progress.<p>My Top 3 Quotes<p>“Every action you take is a vote for the type of person you wish to become. No single instance will transform your beliefs, but as the votes build up, so does the evidence of your new identity.”<p>“You do not rise to the level of your goals. You fall to the level of your systems.”<p>“Habits are the compound interest of self-improvement”<p>-----<p>Hope you enjoyed reading this :)<p>I&#x27;d love to hear your thoughts and any feedback",
      "time": 1649524758,
      "title": "Powerful lessons I learned from the book “Atomic Habits” by James Clear",
      "type": "story"
    },
    {
      "by": "mudita",
      "descendants": 0,
      "id": 30969884,
      "score": 1,
      "time": 1649524584,
      "title": "Iroha",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Iroha"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 30969881,
      "score": 1,
      "time": 1649524571,
      "title": "Stanford engineers create solar panel that can generate electricity at night",
      "type": "story",
      "url": "https://www.npr.org/2022/04/07/1091320428/solar-panels-that-can-generate-electricity-at-night-have-been-developed-at-stanf"
    },
    {
      "by": "dougcalobrisi",
      "descendants": 0,
      "id": 30969866,
      "score": 1,
      "time": 1649524503,
      "title": "Show HN: Reduce GitHub Action costs with nested runners",
      "type": "story",
      "url": "https://github.com/dougcalobrisi/nested-github-runners-action"
    },
    {
      "by": "pimlottc",
      "descendants": 0,
      "id": 30969825,
      "score": 1,
      "time": 1649524296,
      "title": "Just a Command Runner",
      "type": "story",
      "url": "https://github.com/casey/just"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30969811,
      "score": 1,
      "time": 1649524206,
      "title": "Problem of Time",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Problem_of_time"
    },
    {
      "by": "wintercarver",
      "descendants": 0,
      "id": 30969804,
      "score": 2,
      "time": 1649524120,
      "title": "New insight into the possible origins of life",
      "type": "story",
      "url": "https://phys.org/news/2022-03-insight-life.html"
    },
    {
      "by": "dataspun",
      "descendants": 0,
      "id": 30969797,
      "score": 1,
      "text": "I’m dealing with an iPaaS vendor that offers an SFTP connector in the standard contract.  FTPS, however, for some mysterious reason, deserves a premium charge.  I’m dealing with a separate storage vendor in which it’s essentially the opposite… they don’t allow SFTP connections.  What could explain this difference?",
      "time": 1649524079,
      "title": "Ask HN: How is FTPS more/less complicated than SFTP?",
      "type": "story"
    },
    {
      "by": "lai-yin",
      "descendants": 0,
      "id": 30969752,
      "score": 1,
      "time": 1649523869,
      "title": "How to Choose Trousers for Any Sport Coat",
      "type": "story",
      "url": "https://putthison.com/how-to-choose-trousers-for-any-sport-coat/"
    },
    {
      "by": "rolph",
      "descendants": 0,
      "id": 30969712,
      "score": 1,
      "time": 1649523648,
      "title": "Help: IPA/Inuktitut",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Help:IPA/Inuktitut"
    }
  ]
}