{
  "stories": [
    {
      "by": "MiguelHzBz",
      "descendants": 0,
      "id": 29239482,
      "score": 1,
      "time": 1637063377,
      "title": "Secure software supply chain: why every link matters",
      "type": "story",
      "url": "https://sysdig.com/blog/software-supply-chain-security/"
    },
    {
      "by": "judgementday",
      "descendants": 0,
      "id": 29239479,
      "score": 1,
      "time": 1637063346,
      "title": "Scotland Enters the Metaverse: Studio Launches with $1.7m Funding",
      "type": "story",
      "url": "https://metaverse.digital/scotland-enters-the-metaverse/"
    },
    {
      "by": "iamflimflam1",
      "descendants": 0,
      "id": 29239476,
      "score": 1,
      "time": 1637063330,
      "title": "Show HN: DIY Wireless LEDs",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=jdc_0r5pJPc"
    },
    {
      "by": "ogwh",
      "descendants": 0,
      "id": 29239475,
      "score": 1,
      "text": "Long story short over all these years I never bothered with Facebook. It turns out some hobby groups only exist on there, so I created an account about a week ago.<p>I&#x27;m shocked at how buggy the Android app is for such a large tech company with so many years and so much money being thrown at engineers. I hear on HN about massive 6-7 figure salaries yet their main product barely works.<p>Some of the bugs I see every time I use the app are:<p>1) App randomly closes<p>2) Hiding suggested group posts says they won&#x27;t show me that again... Followed by endless pages of posts from those groups<p>3) Closed suggested friends reappear as soon as I reopen the app<p>4) Pressing the back button sometimes closes the app instead of going back a screen<p>5) The bar to sort posts randomly appears when scrolling then disappears just as quickly with no known way to get it back<p>6) Tapping notifications doesn&#x27;t scroll to the comment referenced, half of the time it&#x27;s not even in the list<p>And overall just constant confusion because nothing seems to do what you expect.<p>It&#x27;s almost as if the app is actively trying to prevent the user doing what they want.<p>So I wanted to know if Facebook has always been this bad at UX and execution but people just put up with it or is it a recent phenomena? Or perhaps Facebook has become so widely used that no regular user even notices, like when you take a shit but don&#x27;t notice how bad it smells because your brain filters it out?",
      "time": 1637063329,
      "title": "Ask HN: Has Facebook always been this buggy?",
      "type": "story"
    },
    {
      "by": "GekkePrutser",
      "descendants": 0,
      "id": 29239471,
      "score": 1,
      "text": "I&#x27;m looking to start a blog, I&#x27;ve been thinking about it because I have a lot of stuff I&#x27;d like to write up both from a work point of view and privately. It&#x27;ll be very technical content mostly.<p>I really like Medium as a platform, but I hate their monetisaton by tracking. I don&#x27;t want to &#x27;sell out&#x27; my readers. I don&#x27;t need it to make money for me. If anything I&#x27;d pay to publish it.<p>However I&#x27;d like to get some kind of attention to it. I could of course publish it on a self-hosted wordpress or something but it means there&#x27;s hardly any point. Ideally I&#x27;d like to get likeminded sould to come across it by chance and I don&#x27;t want to actively promote it here (I know that&#x27;s not even allowed anyway) or anywhere, but it would be nice if people that are interested could at least have a chance to come across it.<p>In other words, I&#x27;m looking for the &quot;Hacker News&quot; of blogging sites :)<p>Any ideas? Of course I&#x27;ve been looking but the mainstream ones are all collecting data. I came across https:&#x2F;&#x2F;habr.com which kinda resonated with me: very technical content, not much marketing placement. But it&#x27;s very Russian focused. Digging into stuff about the site (like pricing and privacy: file:&#x2F;&#x2F;&#x2F;tmp&#x2F;mozilla_tycho0&#x2F;service_price-1.pdf ) turns up documents that are in Russian only.<p>So I was wondering if you&#x27;d have any other ideas. I&#x27;d appreciate any feedback!",
      "time": 1637063290,
      "title": "Ask HN: Blogging platforms for highly technical content?",
      "type": "story"
    },
    {
      "by": "Someone",
      "descendants": 0,
      "id": 29239458,
      "kids": [
        29239459
      ],
      "score": 1,
      "time": 1637063183,
      "title": "Back up and share text replacements on Mac",
      "type": "story",
      "url": "https://support.apple.com/en-gb/guide/mac-help/mchl2a7bd795/mac"
    },
    {
      "by": "winkywooster",
      "descendants": 0,
      "id": 29239452,
      "score": 1,
      "time": 1637063127,
      "title": "Why Emacs: Redux",
      "type": "story",
      "url": "https://batsov.com/articles/2021/11/16/why-emacs-redux/"
    },
    {
      "by": "stilisstuk",
      "descendants": 0,
      "id": 29239451,
      "score": 1,
      "text": "Outlook email search is ok. On Linux no gui client has decent search (wildcard, sent&#x2F;received date intervals, from, to, subject, body, attachment yes&#x2F;no type). Expression search for Thunderbird is probably best.<p>Which open source friendly provider has good search in webmail?",
      "time": 1637063126,
      "title": "Email Providers with Advanced Search",
      "type": "story"
    },
    {
      "by": "lyqht",
      "descendants": 0,
      "id": 29239428,
      "score": 1,
      "time": 1637062880,
      "title": "Introduction to Scalable Vector Graphics (SVG)",
      "type": "story",
      "url": "https://esteetey.dev/introduction-to-svg"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 29239426,
      "score": 1,
      "time": 1637062872,
      "title": "Proof-of-Concept Work Brings Systemd to Ubuntu WSL",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=PoC-Ubuntu-WSL2-systemd"
    }
  ]
}