{
  "stories": [
    {
      "by": "jbm",
      "descendants": 0,
      "id": 30996331,
      "score": 1,
      "time": 1649718437,
      "title": "Dan's Solar Scooter",
      "type": "story",
      "url": "https://www.builditsolar.com/Projects/PV/pvscooter.htm"
    },
    {
      "by": "tusslewake",
      "descendants": 0,
      "id": 30996318,
      "score": 1,
      "text": "I was reading Jay Caspian King in the New York Times today (&quot;Email Is Slow and Creates Distance. That’s Why It’s Great&quot;)[1]. The piece is about when email was used more often for lengthy personal correspondence (i.e., writing &#x27;letters&#x27;). I came across this paragraph:<p>&quot;&quot;&quot;\nI have one piece of advice for anyone who wants to return to the old days of email: Set up a separate account for all of your lengthy correspondences and check it about once every two or three days. This, more or less, is the relationship I have with the emails I receive from the readers of this newsletter. As I mentioned in last week’s edition, my reader email address has resulted in dozens of meaningful exchanges, the sort of stuff I rarely find on social media\n&quot;&quot;&quot;<p>Does anyone do anything like this? How did it work?<p>[1]:https:&#x2F;&#x2F;www.nytimes.com&#x2F;2022&#x2F;04&#x2F;11&#x2F;opinion&#x2F;email-slack-technology.html",
      "time": 1649718398,
      "title": "Ask HN: Set up different email address for 'meaningful' personal correspondence?",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30996270,
      "score": 1,
      "time": 1649718149,
      "title": "Deceptively Aligned Mesa-Optimizers: It's Not Funny If I Have to Explain It",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/deceptively-aligned-mesa-optimizers"
    },
    {
      "by": "andreag11",
      "descendants": 1,
      "id": 30996184,
      "kids": [
        30996277
      ],
      "score": 2,
      "time": 1649717649,
      "title": "Take the effort out of keeping your dependencies up to date with Dependabot",
      "type": "story",
      "url": "https://twitter.com/github/status/1513558541600276484"
    },
    {
      "by": "physicsfox",
      "descendants": 19,
      "id": 30996166,
      "kids": [
        30996344,
        30996369,
        30996242,
        30996287,
        30996226,
        30996291,
        30996330,
        30996313
      ],
      "score": 37,
      "time": 1649717548,
      "title": "Sex and gender education banned for K-3 in Florida",
      "type": "story",
      "url": "https://flgov.com/2022/03/28/governor-ron-desantis-signs-historic-bill-to-protect-parental-rights-in-education/"
    },
    {
      "by": "crescit_eundo",
      "descendants": 0,
      "id": 30996149,
      "score": 1,
      "time": 1649717457,
      "title": "Relating Transformers to Modes and Neural Representations of the Hippocampal",
      "type": "story",
      "url": "https://arxiv.org/abs/2112.04035"
    },
    {
      "by": "albingroen",
      "descendants": 0,
      "id": 30996117,
      "score": 1,
      "time": 1649717268,
      "title": "Lemon Design – A React component library based on Tailwind CSS",
      "type": "story",
      "url": "https://lemondesign.dev/"
    },
    {
      "by": "hashxyz",
      "descendants": 1,
      "id": 30996097,
      "kids": [
        30996325
      ],
      "score": 1,
      "text": "Context: I have been working multiple SWE jobs, remotely, since early in the pandemic. None of the companies know I am doing this. It&#x27;s been very time demanding, but also financially and intellectually rewarding. Some of the companies are FAANG.<p>I want to start a company, but I&#x27;m worried about the potential legal&#x2F;ethical fallout from what I have done. I&#x27;ve kept a low profile so far, but obviously if I start a company I will need do a lot of networking, and people will need to know my background. If my work history is publicly known, there is some risk of litigation from the massive-cap companies that I have worked for.<p>I don&#x27;t feel I&#x27;ve done anything ethically wrong. I work 80hrs most weeks, and received feedback and promotions from each of the companies. I have never breached any NDA or employment agreement, except for the obligatory clause in most salaried contracts: &quot;don&#x27;t engage in any other employment, not even as a cashier at Taco Bell&quot;. That said, it is a legal grey-area, and a well-funded lawsuit could drag on for a long time.<p>The company I want to start would be creating a software product which plugs into, or perhaps replaces one of the products I currently work on (it&#x27;s a very old piece of software). I don&#x27;t believe this would breach any contracts, since other competitors were born out of similar circumstances (minus the overemployment)<p>I wanted to get some other perspectives on my situation. Is it salvageable? Or did I ruin my chances by having a non-conventional work history?",
      "time": 1649717153,
      "title": "Ask HN: I want to start a company, but I am currently overemployed",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30996085,
      "score": 2,
      "time": 1649717089,
      "title": "Mount Hoverla",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Hoverla"
    },
    {
      "by": "Mobil1",
      "descendants": 0,
      "id": 30996069,
      "score": 2,
      "time": 1649717004,
      "title": "Behold a Pale Horse",
      "type": "story",
      "url": "https://archive.org/details/WilliamCooperBeholdAPaleHorse1991"
    }
  ]
}