{
  "stories": [
    {
      "by": "alicewinthrop",
      "descendants": 0,
      "id": 30614627,
      "score": 1,
      "text": "Finding a time to get together can turn into a flood of texts back and forth as people throw out times and shoot them down over and over again.<p>Frustrated by this, I started TimeCheck as a side project with the goal of making it easier to find a time to gather for drinks, a meeting, or to play games&#x2F;sports&#x2F;music.<p>TimeCheck takes a snapshot of each person&#x27;s availability for the selected dates, compares them, then presents the date&#x2F;times when all are free.<p>Everyone in the group can vote on a preferred time from the results and the person that created the TimeCheck confirms the final time.<p>Then you one-tap add the confirmed time to your iCal.<p>All via one app bubble inside an iMessage chat.<p>In the future I&#x27;d like to expand the scope so that TimeCheck works for iOS and Android users in the same chat, and make a WhatsApp version. The app already supports timezones but it only works for iCal right now.<p>TimeCheck is available for beta testing via Testflight.<p>If you would like to try it out please visit: <a href=\"https:&#x2F;&#x2F;timecheck.us\" rel=\"nofollow\">https:&#x2F;&#x2F;timecheck.us</a><p>Feedback from early adopters will shape the next iteration so if this could possibly be useful to you please give it a try and let me know what I can do to make it better for your use case!<p>Thank you!",
      "time": 1646835577,
      "title": "Show HN: TimeCheck compares availability to find times when people are free",
      "type": "story",
      "url": "https://timecheck.us"
    },
    {
      "by": "app4soft",
      "descendants": 0,
      "id": 30614626,
      "score": 1,
      "time": 1646835564,
      "title": "Twitter Spaces: Ask Ukrainian Open-Source Software Devs About War",
      "type": "story",
      "url": "https://twitter.com/i/spaces/1OyJADAEoAgGb/peek"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 30614623,
      "score": 1,
      "time": 1646835547,
      "title": "Some tiny personal programs I've written",
      "type": "story",
      "url": "https://jvns.ca/blog/2022/03/08/tiny-programs/"
    },
    {
      "by": "otomi-oss",
      "descendants": 0,
      "id": 30614621,
      "score": 1,
      "time": 1646835537,
      "title": "Zero trust Kubernetes network architecture",
      "type": "story",
      "url": "https://redkubes.com/network-traffic-filtering-zero-trust/"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 30614618,
      "score": 1,
      "time": 1646835525,
      "title": "Applying Product Thinking to Slack’s Internal Compute Platform",
      "type": "story",
      "url": "https://slack.engineering/applying-product-thinking-to-slacks-internal-compute-platform/"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 30614617,
      "score": 1,
      "time": 1646835505,
      "title": "What Does the “Connection Not Private” Warning Mean?",
      "type": "story",
      "url": "https://themarkup.org/ask-the-markup/2022/03/08/what-does-the-connection-not-private-warning-really-mean"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30614614,
      "score": 1,
      "time": 1646835494,
      "title": "Putin's military failures force bitter Russian reckoning",
      "type": "story",
      "url": "https://www.axios.com/putin-russia-invasion-failure-b7a63b7f-0198-4417-bf1d-3683607554bf.html"
    },
    {
      "by": "andrewl",
      "descendants": 0,
      "id": 30614607,
      "score": 1,
      "time": 1646835451,
      "title": "John von Neumann Thought He Had the Answers",
      "type": "story",
      "url": "https://newrepublic.com/article/165581/john-von-neumann-man-from-future-book-review"
    },
    {
      "by": "aclindsa",
      "descendants": 0,
      "id": 30614603,
      "score": 1,
      "text": "Hi HN,<p>I wanted to be able to easily compute my tax return using simple open-source software and be able to trust that it was correct. So I&#x27;m building that software, with a goal of keeping it simple to add and maintain tax forms&#x2F;logic so that portion can be crowdsourced.<p>At its core, HabuTax, is a very simple dependency solver. The tax logic is modular and specified at line-level granularity (one formula per line per tax form). This means there is less to keep in your head when implementing, since each field must only consider its own inputs and output, making it easier and less error-prone.<p>I would love your help, whether that is trying it out and reporting bugs&#x2F;suggesting improvements, implementing additional forms or adding support for more scenarios, or submitting anonymous tax data to help build a test suite.<p>Thanks!",
      "time": 1646835421,
      "title": "Show HN: Prepare your tax return on the command-line",
      "type": "story",
      "url": "https://github.com/habutax/habutax"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 30614588,
      "score": 1,
      "time": 1646835392,
      "title": "Cloudflare refuses to pull out of Russia, says Putin would celebrate shutoff",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/03/cloudflare-wont-cut-off-russia-says-it-needs-more-internet-access-not-less/"
    }
  ]
}