{
  "stories": [
    {
      "by": "henrik_w",
      "descendants": 0,
      "id": 27749677,
      "score": 1,
      "time": 1625584469,
      "title": "Polanyi's Paradox",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Polanyi%27s_paradox"
    },
    {
      "by": "karmanyaahm",
      "descendants": 0,
      "id": 27749669,
      "score": 2,
      "time": 1625584431,
      "title": "An Exxon lobbyist thought he was in a job interview. Instead, it was recorded",
      "type": "story",
      "url": "https://www.washingtonpost.com/climate-environment/2021/07/02/exxon-climate-change-video-leaked/"
    },
    {
      "by": "smitop",
      "descendants": 0,
      "id": 27749668,
      "score": 1,
      "time": 1625584427,
      "title": "Quantifying Copyright Reversion",
      "type": "story",
      "url": "https://pluralistic.net/2021/07/06/backsies/%22#take-backs"
    },
    {
      "by": "canato",
      "descendants": 0,
      "id": 27749658,
      "score": 1,
      "time": 1625584352,
      "title": "Show HN: Image Cropping Library for Android",
      "type": "story",
      "url": "https://github.com/CanHub/Android-Image-Cropper"
    },
    {
      "by": "anxiousfounder",
      "descendants": 0,
      "id": 27749651,
      "score": 2,
      "text": "I’m an extremely shy, socially awkward person who also struggles with poor self-esteem and low self confidence.<p>I&#x27;ve an idea and would like to start a SaaS business. I’m targeting small business owners and going out to talk to people is hell for me. My heart races, I speak in a low voice, have an awkward grin and my attempts to talk to people has been a disaster - most people find me uninteresting and want to just go on with their work.<p>I also have ADD, so I’ve to or feel like I’ve to try very hard to listen and which makes it very difficult to think on my feet and ask meaningful questions or make the conversation interesting. I’ve taken the usual medication for ADD, but those make my anxiety worse. I’ve been on some kind of anti depressant for the last 18 years.<p>Can you give me some tips and or something from your personal experience to overcome this issue. Getting a co-founder is not a viable option for me as I don’t have that big of a friend circle.<p>Thanks for reading!<p>Edit: changed some wording",
      "time": 1625584326,
      "title": "Ask HN: How to talk to customers as a socially awkward introvert?",
      "type": "story"
    },
    {
      "by": "christophilus",
      "descendants": 0,
      "id": 27749646,
      "score": 1,
      "text": "I was reflecting on the panic around India&#x27;s second wave, when it appeared to be going exponential. Base rates suggested that it would level off and decline similarly to the pattern seen around the world. It does look like that&#x27;s what ended up happening.<p>At the time, though, feeling the emotional impact of the tragedy made it quite difficult to apply base rates.<p>Also, why don&#x27;t more experts default to using base rates as the standard predictive model?<p>It seems that of all people, experts should be doing that. Is there a reason it&#x27;s not standard practice?",
      "time": 1625584314,
      "title": "Ask HN: How to improve at using base rates?",
      "type": "story"
    },
    {
      "by": "architrathi",
      "descendants": 0,
      "id": 27749645,
      "score": 1,
      "time": 1625584310,
      "title": "How to scale your SaaS organisation? Follow the 2021 data",
      "type": "story",
      "url": "https://www.oxx.vc/post/how-to-scale-your-saas-organisation"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 27749615,
      "score": 3,
      "time": 1625584165,
      "title": "The Reason for Windows 11",
      "type": "story",
      "url": "https://www.computerworld.com/article/3623772/the-real-reason-for-windows-11.html"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 1,
      "id": 27749590,
      "kids": [
        27749705
      ],
      "score": 2,
      "text": "I was having a chat with some friends about Brasilia and new capitols in other places came up (e.g. the new administrative city in Egypt, Abuja in Nigeria) and it seemed strange to me that the U.S. never shifted West as the country grew further. Would love if folks had some insight as to why some place like Dallas or St. Louis didn&#x27;t end up being the host of the national government?",
      "time": 1625584065,
      "title": "Ask HN: Why did the U.S. never move the capitol west?",
      "type": "story"
    },
    {
      "by": "lukaseder",
      "descendants": 0,
      "id": 27749585,
      "score": 1,
      "time": 1625584022,
      "title": "JOOQ 3.15’s New Multiset Operator Will Change How You Think About SQL",
      "type": "story",
      "url": "https://blog.jooq.org/2021/07/06/jooq-3-15s-new-multiset-operator-will-change-how-you-think-about-sql/"
    }
  ]
}