{
  "stories": [
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 31001248,
      "score": 1,
      "time": 1649763673,
      "title": "Psychological tips aren’t enough: policies need to address structural inequities",
      "type": "story",
      "url": "https://theconversation.com/psychological-tips-arent-enough-policies-need-to-address-structural-inequities-so-everyone-can-flourish-180224"
    },
    {
      "by": "takiwatanga",
      "descendants": 0,
      "id": 31001247,
      "score": 1,
      "time": 1649763661,
      "title": "Can you count on what you measure?",
      "type": "story",
      "url": "https://clearleft.com/posts/can-you-count-on-what-you-measure"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31001233,
      "score": 1,
      "time": 1649763579,
      "title": "What does Elon Musk's dance with Twitter mean?",
      "type": "story",
      "url": "https://www.stuff.co.nz/national/explained/300564580/what-does-elon-musks-dance-with-twitter-really-mean"
    },
    {
      "by": "kibwen",
      "descendants": 1,
      "id": 31001232,
      "kids": [
        31001268
      ],
      "score": 1,
      "time": 1649763579,
      "title": "Pointers Are Complicated part III, or: Pointer-integer casts in Rust exposed",
      "type": "story",
      "url": "https://www.ralfj.de/blog/2022/04/11/provenance-exposed.html"
    },
    {
      "by": "nirvanist",
      "descendants": 0,
      "id": 31001231,
      "score": 1,
      "text": "Hi all , I m a developer but a bad forex trader, \nI built Forex Neuron,it s a free forex signals provider backed by A.I for short-term trading.<p>This app monitors pairs rates in real-times, when the algorithm spots a signal a notification is broadcasted on Telegram, Twitter, facebook and Discord, signals are executed in real time and if it reaches the profit or loss price it will also send a notification.<p>the web app is free, no account required “ I m not interested in your data, I have a life and I respect yours “, to get real-time notification on signals you have just to follow the Twitter, Facebook, Discord, but I recommend Telegram it&#x27;s the best and the fast way to get notifications.<p>Signals are not 100% accurate, spotting the right pattern in a noisy data is very hard especially for short terms, but I&#x27;m working on it mostly every day to improve the algorithm, it&#x27;s the main reason why it&#x27;s free and friendly advice never buy a forex signal service it&#x27;s usually a scam , if someone can predict forex with 100% accuracy he will not need to sell his signals.<p>I have worked on this project since 2016, I have created many versions, some better than others and this is the last version.I&#x27;m trying to keep this web app trustable as much as possible, no data manipulation, no loss hiding and everything is executed in real time.<p>I plan to add many other features to this web app; a social network for traders, EA for Metatrader, prediction for crypto …etc depending on my free time :)<p>Your feedback will be appreciated so please feel free to comment and ask your questions , thank you all for your time .",
      "time": 1649763557,
      "title": "Show HN: Free forex signals provider backed by A.I",
      "type": "story",
      "url": "https://forexneuron.com"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 31001202,
      "score": 1,
      "time": 1649763343,
      "title": "Twitter Grapples with an Elon Musk Problem",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/11/technology/twitter-elon-musk-problem.html"
    },
    {
      "by": "WolfOliver",
      "descendants": 0,
      "id": 31001175,
      "score": 1,
      "time": 1649763178,
      "title": "Ask HN: How important is ontology engineering today?",
      "type": "story"
    },
    {
      "by": "acqbu",
      "descendants": 1,
      "id": 31001166,
      "kids": [
        31001174
      ],
      "score": 3,
      "time": 1649763157,
      "title": "Which countries offer gender-neutral passports?",
      "type": "story",
      "url": "https://www.economist.com/graphic-detail/2022/04/11/which-countries-offer-gender-neutral-passports"
    },
    {
      "by": "dvh1990",
      "descendants": 3,
      "id": 31001155,
      "kids": [
        31001195,
        31001213,
        31001181
      ],
      "score": 2,
      "text": "I grew up a millennial tech geek, spending my days lurking on Tom&#x27;s Hardware, playing and modding video games, tinkering with code and watching Star Trek. Wherever I looked at the world&#x27;s problems, more technology seemed to be the answer.<p>Nowadays I&#x27;m a software dev and tech entrepreneur. At best, technology bores me. At worst, it terrifies me. Today&#x27;s startups are solving the most boring problems imaginable. Gadgets are a snoozfest. Programming languages and frameworks seem to be running in circles.<p>We seem to be experiencing diminishing returns on tech for the past few years. More tech is no longer necessarily better. Is this just a phase before the next big industrial revolution?<p>When did this start, and when is the drought going to be over?",
      "time": 1649763096,
      "title": "Ask HN: When Did Tech Stop Being Cool?",
      "type": "story"
    },
    {
      "by": "aroccoli",
      "descendants": 0,
      "id": 31001153,
      "score": 2,
      "time": 1649763082,
      "title": "What Is a Monoid in Haskell?",
      "type": "story",
      "url": "https://serokell.io/blog/whats-that-typeclass-monoid"
    }
  ]
}