{
  "stories": [
    null,
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 31597687,
      "score": 1,
      "time": 1654189974,
      "title": "When Cars Kill Pedestrians",
      "type": "story",
      "url": "https://www.newyorker.com/news/our-local-correspondents/when-cars-kill-pedestrians"
    },
    {
      "by": "ARho24",
      "descendants": 0,
      "id": 31597685,
      "score": 1,
      "text": "What is the biggest threat to America? \nChina, population differences and GDP? Putin, Russia and nuclear weapons? Astroids or zombies?\nThe other day I went around a community, knocking on doors, asking people this question. \nWhat is the biggest threat to America?\nThe most popular response (more than 95% of answers)… the people on the political side opposite their own.<p>Fascinating it was to hear people on the right describe BLM the same. exact. way. people on the left describe Blue Lives Matter. \nFascinating it was to hear people on the left describe Fox News the same. exact. way. people on the right described MSNBC and CNN. \nExtremism and hatred, uncompromising and unwilling, without honor and with ego.. all things said by each side, describing the other.<p>Maybe both sides are all of these things. Maybe everyone is extreme, full of hate, unwilling to compromise, doing everything they can to sow division. \nYeah, that actually sounds pretty accurate.<p>Regardless of this^, the “other side” is still not, in my opinion, the biggest threat to America.\nThe biggest threat to America is each side’s inability and unwillingness to communicate with each other.\nIf we could begin having honest, calm, productive discussions about what we feel the most strongly about with the people who feel the most strongly about the opposite perspective, wouldn’t that be something. Wouldn’t that be everything?*<p>How is it to be done? By remembering the simple truth, we all want what is best for America. \nShouldn’t that be enough to give enough respect to the opposite viewpoint holder you’re talking with? Don’t think so? Get over your damn self and make it enough.\n50% of the population must be some level of incorrect on each issue. It is pure golden ignorance to think one is completely correct on everything.<p>Remember, if you believe so strongly that the other side’s opinions, policy proposals, and so on will completely ruin, change for the worse or disadvantage America, the best chance you have at preventing it is through honest conversation, black and white logic, and first principles analysis. NOT emotions.<p>We are all American. We all care about her and her future. Remember this.<p>No matter the threat that comes America&#x27;s way, the best chance we have at overcoming it will be with a populace that doesn’t want to kill each other.\nThat we don’t have that, is the biggest threat.<p>Do you agree?\nWhat do you think is the biggest threat to America?\nWhat are we doing &#x2F; not doing that prevents us from having the best shot at overcoming whatever difficulty comes our way?\n(tweet @arho242)<p>What I’m doing to spread this idea. \nhttps:&#x2F;&#x2F;www.etsy.com&#x2F;listing&#x2F;1069595466&#x2F;for-freedoms-sake-t-shirt?ref=listing_published_alert",
      "time": 1654189970,
      "title": "Division and an Attempt for Unity",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31597672,
      "score": 1,
      "time": 1654189927,
      "title": "Impact of DNA mutations on lifelong blood cell production uncovered",
      "type": "story",
      "url": "https://www.sanger.ac.uk/news_item/impact-of-dna-mutations-on-lifelong-blood-cell-production-uncovered/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31597631,
      "score": 2,
      "time": 1654189755,
      "title": "Goa: A Go DSL for describing and generating APIs in a transport agnostic way",
      "type": "story",
      "url": "https://goa.design/"
    },
    {
      "by": "stumarkin",
      "descendants": 0,
      "id": 31597616,
      "score": 8,
      "time": 1654189702,
      "title": "OpenCost: Open-source cost monitoring for cloud native environments",
      "type": "story",
      "url": "https://www.opencost.io/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31597613,
      "score": 2,
      "time": 1654189694,
      "title": "Facebook developing a privacy-safe ad product to save its advertising business",
      "type": "story",
      "url": "https://www.businessinsider.com/facebook-developing-ads-product-no-user-data-amid-privacy-changes-2022-6"
    },
    {
      "by": "jamesar",
      "descendants": 0,
      "id": 31597596,
      "score": 1,
      "time": 1654189624,
      "title": "Lessons from a Failed YC Interview",
      "type": "story",
      "url": "https://medium.com/@james.a.roland/3-lessons-from-a-failed-yc-interview-8dfb7ccffc11"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31597592,
      "score": 1,
      "time": 1654189615,
      "title": "It’s a Scandi scandal Why has social media turned on Sweden?",
      "type": "story",
      "url": "https://www.theguardian.com/lifeandstyle/2022/jun/01/its-a-scandi-scandal-why-has-social-media-turned-on-sweden"
    },
    {
      "by": "earlyriser",
      "descendants": 1,
      "id": 31597553,
      "kids": [
        31597666
      ],
      "score": 1,
      "text": "The other day there was a comment in a thread making reference to https:&#x2F;&#x2F;100r.co and I wonder if you know more dev teams creating something interesting.<p>I&#x27;m also interested in small for-profit teams, like Panic, as long as they work in multiple projects.",
      "time": 1654189437,
      "title": "Ask HN: Please mention dev collectives working on cool projects",
      "type": "story"
    }
  ]
}