{
  "stories": [
    {
      "by": "eddyerburgh",
      "descendants": 0,
      "id": 30552142,
      "score": 1,
      "time": 1646382871,
      "title": "Google Docs New Feature: Pageless",
      "type": "story",
      "url": "https://support.google.com/docs/thread/150905607/google-docs-new-feature-pageless?hl=en"
    },
    {
      "by": "sirteno",
      "descendants": 0,
      "id": 30552140,
      "score": 1,
      "time": 1646382855,
      "title": "BlackRock halting purchases and removing Russian securities across the board",
      "type": "story",
      "url": "https://www.linkedin.com/posts/laurencefink_i-know-i-speak-on-behalf-of-everyone-at-blackrock-activity-6905297027081871360-U_XN"
    },
    {
      "by": "jkaljundi",
      "descendants": 0,
      "id": 30552135,
      "score": 1,
      "time": 1646382798,
      "title": "How one Ukrainian startup is adapting its app during a time of war",
      "type": "story",
      "url": "https://www.theverge.com/2022/3/2/22957920/ukraine-startup-reface-app-adapt-russia-invasion"
    },
    {
      "by": "331c8c71",
      "descendants": 1,
      "id": 30552123,
      "kids": [
        30552124
      ],
      "score": 1,
      "time": 1646382677,
      "title": "Only US and Ukraine voted against anti-nazi resolution at UN in 2020",
      "type": "story",
      "url": "https://digitallibrary.un.org/record/3894841"
    },
    {
      "by": "EvgeniyZh",
      "descendants": 0,
      "id": 30552111,
      "score": 1,
      "time": 1646382615,
      "title": "End-to-End Referring Video Object Segmentation with Multimodal Transformers",
      "type": "story",
      "url": "https://github.com/mttr2021/MTTR"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 30552110,
      "score": 1,
      "time": 1646382615,
      "title": "Sequent Beagle-Pi “Raspberry Pi Emulator” Offers Stopgap for Shortages",
      "type": "story",
      "url": "https://www.hackster.io/news/sequent-microsystems-beagle-pi-raspberry-pi-emulator-offers-a-stopgap-for-shortages-eb0c4d48b8d2"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 30552101,
      "score": 1,
      "time": 1646382527,
      "title": "Ukraine and Russia’s History Wars",
      "type": "story",
      "url": "https://www.historytoday.com/archive/history-matters/ukraine-and-russias-history-wars"
    },
    {
      "by": "smugglerFlynn",
      "descendants": 0,
      "id": 30552091,
      "score": 5,
      "text": "Hello hn.<p>I believe that situation on Russian IT market is not being represented 100% clear right now in the Europe and US.<p>Yesterday I had to emergently evacuate my family from Moscow on a flight to Dubai, leaving behind my apartment, car and my whole life. Every single one of the people I know in IT considers doing the same, or is already in the process (I have 12+ years of networking in this industry, this is fully subjective, but should be representative evnough - I talked to more than 50 people I know directly). Out of my close friends 50% have either already left, or purchasing tickets as you read that.<p>Every single person I know has either full blown panic attacks, averages 2hr of sleep per night, or has extreme anxiety. Four close friends whom I met through IT are hiding from bombs in Kiev and Sumy. Every single one is shocked by decisions made by authoritative Russian government with no care for peoples lives, either in Ukraine or in Russia itself. As you read this, laws are being arranged to set criminal charges even for things like acknowledging the war.<p>My whole investment portfolio got frozen in the St. Pete stock exchange for indefinite period and little hope to get them back. On February 27 I was lucky to quickly get a $10k loan in rubles and purchase already expensive dollars to mitigate the risks, right before inflation skyrocketed to %20+. Most people are not that lucky, and banks have tightened any loans. My salary has already devalued by 50% after one week of war.<p>If anyone can provide any help, Russian IT community needs it. Please reach in comments below by providing your contacts and type of help you can offer, I will do my best to connect you with Russian-speaking communities on Telegram: three of them are communities of developers with 10k+ people in each of them.<p>_Any_ help with remote work or relocation offers to UAE, Georgia, Turkey, Serbia would be immense.<p>You can also reach me directly on 224.0.0.25@gmail.com<p>Hacker news, this is a crisis of extreme proportions. Please, we need your help.",
      "time": 1646382392,
      "title": "HN call for help: Thousand of IT specialists flee Russia as job market collapses",
      "type": "story"
    },
    {
      "by": "paulcarroty",
      "descendants": 0,
      "id": 30552085,
      "score": 2,
      "time": 1646382344,
      "title": "Google stops selling ads in Russia",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2022/03/04/google-ads-russia/"
    },
    {
      "by": "omnibrain",
      "descendants": 0,
      "id": 30552071,
      "score": 1,
      "time": 1646382213,
      "title": "Melinda French Gates Says Jeffrey Epstein Helped Break Up Marriage to Bill",
      "type": "story",
      "url": "https://www.thedailybeast.com/melinda-french-gates-says-jeffrey-epstein-helped-break-up-marriage-to-bill-gate"
    }
  ]
}