{
  "stories": [
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28654687,
      "score": 1,
      "time": 1632590245,
      "title": "How to write a text editor for a 31 year old computer",
      "type": "story",
      "url": "https://dstancu.net/retro/apple/2018/02/18/mr-buffer.html"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28654684,
      "score": 1,
      "time": 1632590232,
      "title": "2021 has broken the record for zero-day hacking attacks",
      "type": "story",
      "url": "https://www.technologyreview.com/2021/09/23/1036140/2021-record-zero-day-hacks-reasons/"
    },
    {
      "by": "nabilhat",
      "descendants": 0,
      "id": 28654657,
      "score": 1,
      "time": 1632590021,
      "title": "The Consumer Router Trap",
      "type": "story",
      "url": "https://cheapskatesguide.org/articles/consumer-router-trap.html/"
    },
    {
      "by": "anon-guy",
      "descendants": 0,
      "id": 28654651,
      "score": 1,
      "text": "The rent for my old crappy apartment was originally $1,900 for a 2BR 2B. It is now $3,200.<p>My current apartment was $2,700. It is now listing for $4,000.<p>$4,000 used to be able to give you a brand new luxury apartment in La Jolla.<p>This all occurred in the past year, maybe even the past two to three months.<p>What has changed in San Diego? Why are rent prices so expensive now?",
      "time": 1632589984,
      "title": "What is causing the astronomical increase in rents in San Diego?",
      "type": "story"
    },
    {
      "by": "app4soft",
      "descendants": 0,
      "id": 28654632,
      "score": 1,
      "time": 1632589839,
      "title": "DT-lite – a B&W optimised reduced fork of darktable app",
      "type": "story",
      "url": "https://github.com/GrahamByrnes/DT-lite"
    },
    {
      "by": "recursion",
      "descendants": 0,
      "id": 28654628,
      "score": 2,
      "time": 1632589813,
      "title": "Leonard vs. Pepsico, Inc. (Pepsi Points Case)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Leonard_v._Pepsico,_Inc."
    },
    {
      "by": "andrew-ld",
      "descendants": 0,
      "id": 28654625,
      "score": 2,
      "time": 1632589749,
      "title": "iot (internet of shit) is really happening.",
      "type": "story",
      "url": "https://www.theguardian.com/lifeandstyle/2021/sep/23/the-smart-toilet-era-is-here-are-you-ready-to-share-your-analprint-with-big-tech"
    },
    {
      "by": "mariocesar",
      "descendants": 0,
      "id": 28654615,
      "score": 1,
      "text": "I&#x27;m an experienced software developer who worked as a full-stack developer for 17 years and recently five years fully into infrastructure, backend, and frontend for big companies.<p>I have a long history of working full-time for early startups. Most of them went well; many failed and closed. I even started my own companies that later pivoted to Software Agencies, or I just part away and let my partners own the company.<p>I&#x27;m working now in a fantastic USA based Saas&#x2F;Technology company. I&#x27;m now Well paid and well connected.<p>That is the background.<p>My Problem:<p>I got &quot;in love&quot; with a local startup in my country, not just for the product. It&#x27;s more about the people and how they are building the company. They have a great culture that I think will disrupt how local businesses will see themselves. I believe that if they are growing and having success could be of significant impact on my country.<p>I want to get involved, and I have so many things to help and do right away. They lack engineers and are naive on building international products, and of course, they have little funding, and they only count on bootstrapping themselves. Regardless of all the problems, they are growing.<p>I don&#x27;t want to offer myself as CTO. Their current CTO is great, isn&#x27;t experienced, but he believes deeply in the company&#x27;s vision. I can&#x27;t replace him. I tried to help refer engineers to them, but the remuneration is so tiny that all my referrals just declined. They are on founder waters, which is risky for any engineer, especially those with secure offers in other places.<p>My current rate is almost 7x more than they offer to a Senior Developer. Quitting my job isn&#x27;t a great option, mainly because I have a family. And to make it complex, they already have some small amount of funding, and they don&#x27;t want to dilute equity more early.<p>What options do I have to get involved? They are welcoming to me, but they don&#x27;t know how that relationship will go. I already do some mentoring, but I want to sit down and program and get that product completed ASAP.<p>HN does anybody have some ideas?",
      "time": 1632589650,
      "title": "I want to work for a local startup, I'm a senior developer and don't know how",
      "type": "story"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28654597,
      "score": 1,
      "time": 1632589481,
      "title": "Make Python Run Faster: A Machine Learning Perspective",
      "type": "story",
      "url": "https://medium.com/geekculture/make-python-run-faster-c73137598bae"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 28654587,
      "score": 2,
      "time": 1632589361,
      "title": "Fast PCIe 5.0 SSD prototype hits sequential read speeds of 14,000 MB/s",
      "type": "story",
      "url": "https://www.notebookcheck.net/Blazing-fast-PCIe-5-0-SSD-prototype-hits-sequential-read-speeds-of-14-000-MB-s.564595.0.html"
    }
  ]
}