{
  "stories": [
    {
      "by": "cloudmatos",
      "descendants": 0,
      "id": 30911260,
      "score": 1,
      "text": "Hey guys, this is a story I wanted to share about how I learned to use cloud resource anomaly detection for my cloud infrastructure; this solution can be a real game changer for devs and I’m not sure I’ve seen too many people talking about it. Any other threads you guys can find on open source options for this, I would love to read them and see what people are doing. Gotta say it doesn’t seem like a ton of people are using this yet so if you would use it but didn’t know about it I hope this helps you and if you use something maybe you can tell me what you think about it and whether you recommend it?<p>I recently started reading in a newsletter about security concerns in cloud computing and how preventing breaches is so essential but there’s not really an easily implementable solution.<p>Obviously a great solution to this would be to write code that maintains your infrastructure in a hands off way. This is code that not just identifies the problem but actually fixes it without your intervention, I honestly thought it was pretty magical when I first heard of this idea but it doesn’t really solve my problem as a freelance dev to have to create this myself, right? That’s way too much time and effort. Well it’s basically a whole separate project to write a code that I can implement on all my different projects so I’d have to take a huge pause to get it done–I’m getting off track here but you get the idea.<p>Anyway, I started thinking maybe there was something open-source that I could use, like something pre-written that I could adapt for my own needs that would achieve the function of self-healing cloud infrastructure. don’t know about everyone else but it’s super frustrating as a freelancer to always hear about different options or resources to improve my work and then find out they’re only available for a high monthly fee or at a team price for companies (not saying I don’t think people should charge for their products at all, just always really nice to have something open source as an option!) Just loop it into your project, and immediately the problems you were having can be identified by the code, but truly even better SOLVED by the code, saving you a ton of time checking, and making your project super secure.<p>I started looking into this some and I found a few options. I know Red Hat might be a place where you could find more options, and Healenium could work depending on your project. One option I found was called Matos (https:&#x2F;&#x2F;github.com&#x2F;cloudmatos&#x2F;matos), based on their GitHub page it seems like it has pretty low usership so far. Has anyone used Matos and have an opinion about it? I chose to give it a shot and It was easier to get started than I expected because they have a quick start guide and they also have a community where you can ask questions and get information. They really provide all the info you need to start detecting some of issues from the cloud, so I found it a great value. Just seems like all they really need is more visibility and this kind of thing could really take off.<p>So, yeah I wanted to share my experience with learning about cloud resource anomaly detection in case it might help someone else and also find other people who have tried using open-source cloud anomaly detection and get their opinions about it. Is there anyone out there who has used anything like this or do you think it would be really good for any particular use cases I didn’t mention? If there’s anything like this you’ve used or if you have used this in a different way than I did, what did you like about it and what problems did you think it had?",
      "time": 1649102065,
      "title": "Any suggestions for cloud anomaly detection open sourced solution?",
      "type": "story"
    },
    {
      "by": "yonz",
      "descendants": 0,
      "id": 30911230,
      "score": 1,
      "time": 1649101901,
      "title": "Exact String Matching Algorithms",
      "type": "story",
      "url": "http://www-igm.univ-mlv.fr/~lecroq/string/"
    },
    {
      "by": "Barrera",
      "descendants": 0,
      "id": 30911200,
      "score": 1,
      "time": 1649101723,
      "title": "Watson: A wonderful CLI to track your time",
      "type": "story",
      "url": "https://tailordev.github.io/Watson/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30911178,
      "score": 2,
      "time": 1649101623,
      "title": "Supply chain flaws in PHP package manager PEAR lay undiscovered for 15 years",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/supply-chain-flaws-in-php-package-manager-pear-lay-undiscovered-for-15-years"
    },
    {
      "by": "mahathu",
      "descendants": 0,
      "id": 30911131,
      "score": 1,
      "time": 1649101379,
      "title": "Are You Nice or Kind?",
      "type": "story",
      "url": "https://haleynahman.substack.com/p/42-are-you-nice-or-kind"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30911114,
      "score": 1,
      "time": 1649101297,
      "title": "New Cell Type in Human Lung with Regenerative Properties",
      "type": "story",
      "url": "https://www.pennmedicine.org/news/news-releases/2022/april/penn-researchers-discover-new-cell-type-in-human-lung-with-regenerative-properties"
    },
    {
      "by": "slowhand09",
      "descendants": 0,
      "id": 30911112,
      "score": 2,
      "time": 1649101292,
      "title": "Why it's now illegal to melt down US coins(2006)",
      "type": "story",
      "url": "https://moneyweek.com/33401/why-its-now-illegal-to-melt-down-us-coins"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30911110,
      "score": 2,
      "time": 1649101272,
      "title": "KeenWrite 2.6.0",
      "type": "story",
      "url": "https://github.com/DaveJarvis/keenwrite/releases/tag/2.6.0"
    },
    {
      "by": "xrd",
      "descendants": 0,
      "id": 30911109,
      "score": 2,
      "time": 1649101271,
      "title": "Tailscale’s human-scale networks are still controlled by Google and Microsoft",
      "type": "story",
      "url": "https://iliana.fyi/blog/tailscale-auth-and-threat-modeling/"
    },
    {
      "by": "nullc",
      "descendants": 0,
      "id": 30911106,
      "score": 2,
      "time": 1649101270,
      "title": "OpenAI has solved the XY problem",
      "type": "story",
      "url": "https://nt4tn.net/articles/aixy.html"
    }
  ]
}