{
  "stories": [
    {
      "by": "acdanger",
      "descendants": 0,
      "id": 27824479,
      "score": 1,
      "time": 1626201267,
      "title": "The Wet Codebase [video]",
      "type": "story",
      "url": "https://www.deconstructconf.com/2019/dan-abramov-the-wet-codebase"
    },
    {
      "by": "xenocratus",
      "descendants": 0,
      "id": 27824457,
      "score": 1,
      "time": 1626201157,
      "title": "Keraunography",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Keraunography"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27824447,
      "score": 1,
      "time": 1626201128,
      "title": "“Long Covid”: More Than a 1/4 of Covid-19 Patients Symptomatic After 6 Months",
      "type": "story",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0254523"
    },
    {
      "by": "gandalfgeek",
      "descendants": 0,
      "id": 27824439,
      "score": 1,
      "time": 1626201084,
      "title": "Read a Paper: AI in Software Engineering at Facebook",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=F_ioJn7cSE4"
    },
    {
      "by": "Skilled_HTI",
      "descendants": 0,
      "id": 27824437,
      "score": 1,
      "text": "Where you work and what you do is one of the most defining pieces of your life. The job(s) you accept place you on a forever trajectory that dictates future earning potential, career opportunities, and even personal ambition. Unfortunately, most job-seekers find themselves settling in their careers due to the extreme economic pressures of finding employment as quickly as possible to pay for the debt brought on by education. Life is expensive, opportunities are scarce so job-seekers do what they must to survive, but are we as a generation thriving?<p>The education models we invest tens of thousands of dollars in claim to help us with career navigation through lackluster career centers. These Career Centers ultimately and consistently fail to democratize access to employers and career mobility. It is completely unsurprising that in a Gallop poll only 16% of graduates indicate that their career center experience was “very helpful”. At their very, very best these services provide resume tips, behavioral mock interviews, access to alumni, and some employer connections. In their worst form, a career center is an underwhelming department run by individuals who have zero experience in your desired trade or field and therefore provide little to-no-help in your journey to finding gainful employment.<p>In our opinion, schools and Career Centers have a moral obligation to GUARANTEE job offers to their students or refund their money.<p>We believe that any career service model that is unable to guarantee job outcomes for their students’ must be dismantled and replaced by a system that does.<p>In our opinion, career services should be a tool accessible to any job-seeker at any point in their career. It is not just recent grads who need help navigating their career, we all need it.<p>Most job-seekers are trained by their schools to treat their job hunt like a numbers game; you open an app and swipe right through all the various options until you receive a bite. When a job-seeker finally lands an interview there is zero preparation, zero studying, zero emphasis on training for the interview.<p>For most job-seekers, this cycle continues for months with you wasting your time, energy, and potential on a process that will continuously fail you. You play this numbers game thinking that getting more and more opportunities is the right approach. Even if you fail this time, you learn from your mistakes and correct them next time. There are always more fish in the sea, right?<p>But what happens if instead of tinderizing your job-search you become a master at interviewing? Just like athletes practice vigorously for games and students study endlessly for tests, you need to prepare just as rigorously for your interviews. When job interviews are treated like the most important test of a job seeker’s life, it increases the job offers they receive by 70%.<p>Practice makes perfect and job-seekers should begin training for their interviews from world class experts in their field. If a job-seeker is empowered and takes advantage of intensive practice they achieve a 98% success rate in getting an offer in 90 days.<p>Our team has proven through products like skilledinc.com and hacktheinterview.io that career outcomes are entirely predicated on having access to incredible mentors that they can train with and learn from.<p>With this level of proven success, we demand that every institution, every recruiter, every career center implements the Hack the Interview training system, with or without us. You do not need Skilled to practice and train for interviews. What you need is a dedicated staff and community willing to invest in job-seekers with the very best resources available.<p>Enough is enough. Our call to arms is to every job seeker out there; train for your interviews like it is the most important test of your life. Imagine what your life would look like if you aced every job interview you ever had. Together we will make this a reality.",
      "time": 1626201079,
      "title": "Job seekers aren't training for their interviews",
      "type": "story"
    },
    {
      "by": "Jabur",
      "descendants": 3,
      "id": 27824433,
      "kids": [
        27824434,
        27824474
      ],
      "score": 3,
      "time": 1626201073,
      "title": "Hiring Front end Engineers? Check our Free community",
      "type": "story",
      "url": "https://fotontech.io/"
    },
    {
      "by": "davikrr",
      "descendants": 0,
      "id": 27824400,
      "score": 1,
      "time": 1626200932,
      "title": "Hikaku Sitatter – comparing heights tool",
      "type": "story",
      "url": "https://hikaku-sitatter.com/en/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 27824376,
      "score": 1,
      "time": 1626200828,
      "title": "Can People Still Play the Same Games as They Get Older?",
      "type": "story",
      "url": "https://www.wired.com/story/can-people-still-play-the-same-games-as-they-get-older/"
    },
    {
      "by": "mancerayder",
      "descendants": 0,
      "id": 27824357,
      "score": 1,
      "time": 1626200747,
      "title": "Rodents chow down on Teslas, causing thousands in damage",
      "type": "story",
      "url": "https://nypost.com/2021/07/11/rodents-chow-down-on-teslas-causing-thousands-in-damage/"
    },
    {
      "by": "sturdygesture",
      "descendants": 0,
      "id": 27824350,
      "score": 2,
      "text": "I have an offer with a 50% pay rise, but with a long commute (1hr 40m train) Mon, hotel then return Tues night.<p>I currently work fully remote, I don&#x27;t need the extra money (live on ~40% of salary, invest the rest).<p>The new role is a big step up in scale and seems a good opportunity, but the commute is giving me huge anxiety.<p>The market seems hot at the moment (UK), so in theory could get a fully remote role somewhere else or promotion where I am.<p>Any opinions or past experiences would be helpful for perspective.",
      "time": 1626200723,
      "title": "Ask HN: Stuck on Accepting New Role",
      "type": "story"
    }
  ]
}