{
  "stories": [
    {
      "by": "hnhastheanswer",
      "descendants": 0,
      "id": 28482855,
      "score": 1,
      "text": "I&#x27;m curious as to what the best pricing model for an app that I&#x27;m piloting. It&#x27;s an &quot;experience app&quot;, in that the app allows you to live an experience from your living room that you&#x27;d normally get in a brick-and-mortar venue (sorry, contractually can&#x27;t go into more details).<p>We have currently a freemium model, where you get free unlimited access for a limited time (&lt; 1hr), and then these options:<p>1&#x2F; A one-shot &quot;x hours pass&quot; for a couple bucks (e.g, &lt;5 USD for 6 hours), which can be renewed on demand of course.<p>2&#x2F; A subscription or &quot;unlimited monthly pass&quot; for a bit more (e.g. &lt; 10 USD &#x2F; month, unlimited usage during the month), which automatically renews.<p>But we&#x27;ve seen that subscriptions are quite &quot;stable&quot; and we don&#x27;t get a positive increase in recurring subscribers. We get more or less a many new ones as we lose them. Most don&#x27;t cancel after 1 month, but generally within 2 or 3.<p>Visits are fine, but free base growth is not great (think ~10 to ~15 users&#x2F;day average) and conversion from free to a pass or subscription is rather low.<p>So, I&#x27;ve been trying out some numbers, and thought of trying another approach: a subscription or &quot;unlimited monthly pass&quot;, but for actually a lot less. My gut feeling based on our demographics are that this would encourage more people to register, and they&#x27;d be a lot less likely to get cancelled (e.g. &lt; 1USD &#x2F; month, unlimited usage during the month)<p>Does that fly? Do you have other ideas?<p>Adoption has bit a bit low - probably for a number of reasons - but I can see there&#x27;s definitely interest in that app, so I&#x27;m thinking that low-cost subscription is actually not too bad, as long as we&#x27;re careful that the influx of users doesn&#x27;t cost more to handle than they bring.<p>I&#x27;m thinking of trying of &quot;flash sale&quot; scenario of users to check what the result would be, but I&#x27;m a bit worried I&#x27;d burn a week or month of potential income for us.<p>Any pointers to actual models on this, or anecdotal experience, are all welcome.",
      "time": 1631287442,
      "title": "Ask HN: What pricing model for an experience app?",
      "type": "story"
    },
    {
      "by": "jedgardyson",
      "descendants": 0,
      "id": 28482852,
      "score": 1,
      "time": 1631287427,
      "title": "Comparison of AI/ML Writing Assistant for Fiction Writers",
      "type": "story",
      "url": "https://tooltip.com/blog/ai-writing-assistant"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 28482838,
      "score": 1,
      "time": 1631287397,
      "title": "Hacker Pioneers Who Turned the Early Internet on Its Head",
      "type": "story",
      "url": "https://gizmodo.com/6-hacker-pioneers-who-turned-the-early-internet-on-its-1847637936"
    },
    {
      "by": "notna4",
      "descendants": 1,
      "id": 28482833,
      "kids": [
        28482834
      ],
      "score": 1,
      "time": 1631287378,
      "title": "Show HN",
      "type": "story",
      "url": "https://github.com/notna4/altbackspace"
    },
    {
      "by": "Iasluhar",
      "descendants": 1,
      "id": 28482822,
      "kids": [
        28482829
      ],
      "score": 1,
      "time": 1631287335,
      "title": "Show HN: Kubedd – Check migration issues of Kubernetes Objects while K8s upgrade",
      "type": "story",
      "url": "https://github.com/devtron-labs/silver-surfer"
    },
    {
      "by": "asjdflakjsdf",
      "descendants": 0,
      "id": 28482816,
      "score": 2,
      "text": "Maybe there is none, and I have to just do it separately on each device.  \nI have a few websites that I would rather just cut from my life completely.<p>My assumption is that I should push a hosts file to github and clone it on each device I use?<p>That would be ok for windows, ubuntu and mac. But what would I best do for a non-rooted android, or an iphone?",
      "time": 1631287306,
      "title": "Ask HN: What is the best cross-platform approach to blocking websites?",
      "type": "story"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28482813,
      "score": 4,
      "time": 1631287291,
      "title": "Weird, Bone-Shaped Asteroid May Have Given Birth to Its Own Moons",
      "type": "story",
      "url": "https://www.sciencealert.com/this-weird-bone-shaped-asteroid-may-have-given-birth-to-its-two-moons"
    },
    {
      "by": "joshma",
      "descendants": 0,
      "id": 28482809,
      "score": 1,
      "time": 1631287281,
      "title": "Coinbase Y Combinator Demo Day Practice – August 2012",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=B_1XKxHk2vs"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28482797,
      "score": 3,
      "time": 1631287231,
      "title": "A newly discovered dinosaur with shark-like teeth was the T. rex of its day",
      "type": "story",
      "url": "https://edition.cnn.com/2021/09/10/world/new-shark-toothed-dinosaur-scn/index.html"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28482787,
      "score": 4,
      "time": 1631287191,
      "title": "All jokes aside, scientists find talking duck",
      "type": "story",
      "url": "https://news.trust.org/item/20210910105122-1jmtc"
    }
  ]
}