{
  "stories": [
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32188707,
      "score": 1,
      "time": 1658466196,
      "title": "Delta flies Heathrow plane loaded with 1k bags – and no passengers – to US",
      "type": "story",
      "url": "https://www.independent.co.uk/travel/news-and-advice/delta-luggage-flight-bags-heathrow-b2123041.html"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32188692,
      "score": 1,
      "time": 1658466086,
      "title": "Biden backs new NSF tech directorate, but Senate balks",
      "type": "story",
      "url": "https://www.science.org/content/article/biden-backs-new-nsf-tech-directorate-senate-balks"
    },
    {
      "by": "drekipus",
      "descendants": 0,
      "id": 32188691,
      "score": 1,
      "text": "(TL;DR: at bottom.)<p>A couple of years ago i used to work for a traditional company as a technical officer that had a lot of linear &#x2F; related workflows (with many external deadlines) that didn&#x27;t have any project management for any of it. Emails and &quot;final copy.xlsx&quot; was the only thing the company ever used besides printed sheets of paper.<p>I tried to use something like trello to keep on top of my work (which rapidly became &quot;everything&quot;), but because of the multitude of things I had to be on top of at once, I felt too restricted in the &quot;one row&quot; trello layout. I also didn&#x27;t like that people could just move things back and forth and mess up my card columns.<p>So as a side project I started to build my own trello like application that had what I felt I needed:<p>* multiple &quot;rows&quot; of projects, each with different number of columns if needed.<p>* cards can only flow left to right. and only when they fill requirements (ie file attached fill a certain naming scheme, not too many cards in a particular stage.)<p>* projects can connect to each other, so the end of one project would flow into another.<p>I thought this was a great project and was tinkering away at it, and in talking to others about it I actually got a much better job out of it as a python developer, which was completely the opposite in workflow (more single focused, simple workflows, internal deadlines, etc).<p>Since then the project has sorta fallen by the wayside. I still think it has merit, but I&#x27;m not that close to the heat anymore. My job uses asana and I am pretty comfortable with the workflow I have now.<p>I&#x27;ve since tried to slim back my hacky project and make it to a more robust online Saas thing for others, but without the heat of solving my own problem, I don&#x27;t feel like I can properly experience using my own tool. I merely have to rely on my memories of the chaos I was trying to solve.<p>I&#x27;m feeling conflicted now, because I really like the project idea. I try to use it now for my new job and other side projects, but I&#x27;m not its own target audience and I don&#x27;t know if it quite works for where I am at now, should I be changing it to work for me? what if there&#x27;s nothing I need to be improved yet, should I just put the project down, mark it as archived and move on?<p>To make matters worse, I really like the name&#x2F;domain of the project. it&#x27;s grown to its own little thing (almost like my pet) that has to sit nicely on the shelf and not be used.<p>I&#x27;ve shown my wife the project and she thinks that it would be a good tool for her (traditional) company to use as well, but she wants her company to already doing something like it, not for me to make it work for her company.<p>TL;DR: Should one continue to re-work side projects to your evolving requirements, or do you archive them and move on? do you bother with putting a side project &quot;out there&quot; even if you don&#x27;t have a need for it anymore? even if you like it?",
      "time": 1658466067,
      "title": "Ask HN: Iterating on Side Projects?",
      "type": "story"
    },
    {
      "by": "kgwgk",
      "descendants": 0,
      "id": 32188652,
      "score": 1,
      "time": 1658465555,
      "title": "Coinbase does not list securities. End of story",
      "type": "story",
      "url": "https://blog.coinbase.com/coinbase-does-not-list-securities-end-of-story-e58dc873be79"
    },
    {
      "by": "supremecompass",
      "descendants": 1,
      "id": 32188645,
      "kids": [
        32188646
      ],
      "score": 1,
      "time": 1658465466,
      "title": "75% of Middle Class Households Say Their Wages Aren't Keeping Up with Inflation",
      "type": "story",
      "url": "https://neverleave.substack.com/p/75-of-middle-class-households-say"
    },
    {
      "by": "cpncrunch",
      "descendants": 0,
      "id": 32188615,
      "score": 1,
      "time": 1658465105,
      "title": "The Ultimate Guide to Heart Rate Variability (HRV)",
      "type": "story",
      "url": "https://medium.com/@altini_marco/the-ultimate-guide-to-heart-rate-variability-hrv-part-1-70a0a392fff4"
    },
    {
      "by": "ellis0n",
      "descendants": 1,
      "id": 32188611,
      "kids": [
        32188669
      ],
      "score": 1,
      "text": "Until 2010, developers dreamed of convenient languages and frameworks, struggled with problems inherited from past implementations, and everything was dug up by bugs until better tools appeared, if the language can be considered a tool, of course. Now we have many languages and frameworks that solve a large number of tasks, if not all, that were 10 years ago. So what problem should solve next generation programming language 2022 ?",
      "time": 1658465081,
      "title": "Ask HN: New programming language, what problem to solve?",
      "type": "story"
    },
    {
      "by": "lyset",
      "descendants": 1,
      "id": 32188595,
      "kids": [
        32188596
      ],
      "score": 1,
      "time": 1658464874,
      "title": "Cool Linux Commands and Gists",
      "type": "story",
      "url": "https://usercept.eu.org/blog/cool-linux-commands/"
    },
    {
      "by": "jonah-archive",
      "descendants": 0,
      "id": 32188584,
      "score": 3,
      "time": 1658464764,
      "title": "ArchiveTeam File Format Wiki",
      "type": "story",
      "url": "http://fileformats.archiveteam.org/wiki/Category:File_formats_by_extension"
    },
    {
      "by": "Jerry2",
      "descendants": 0,
      "id": 32188582,
      "score": 2,
      "time": 1658464731,
      "title": "Working from home damages our eyes. Here’s how you can protect your vision",
      "type": "story",
      "url": "https://www.fastcompany.com/90770640/working-from-home-damages-our-eyes-heres-how-you-can-protect-them"
    }
  ]
}