{
  "stories": [
    {
      "by": "globalise83",
      "descendants": 0,
      "id": 29410473,
      "score": 1,
      "time": 1638401248,
      "title": "Munich WW2 bomb blows up near station, wounding four",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-59487910"
    },
    {
      "by": "Swizec",
      "descendants": 0,
      "id": 29410459,
      "score": 1,
      "time": 1638401202,
      "title": "San Francisco agency opposes Cruise robotaxi application, citing safety",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/san-francisco-agency-opposes-cruise-robotaxi-application-citing-safety-2021-12-01/"
    },
    {
      "by": "great_psy",
      "descendants": 0,
      "id": 29410451,
      "score": 3,
      "text": "I got an offer from Amazon, and I am trying to decide if moving to a FAANG is a good idea.<p>It would be my second job out of school. My current one is a no name company that pays 50-60th percentile. But, it’s not that stressful, I’m fast I would characterize it as pretty chill.<p>Amazon offer, would almost double my salary, and I don’t have to explain to anyone what Amazon does. \nSeems like a no brainer, but I have heard some pretty bad things about Amazon, their PIP program and so on, Blind is full of the stories.<p>So, is it worth moving from a relaxed position to something much more intense ? Will it pay in the long run having Amazon on my resume even if I get PIPed or leave after a year ? \nCurrently I’m “over performing” in my current position, and I’m getting raises and all the good stuff, but they would not be able to match FAANG on $ and brand anytime soon.<p>SDE1 position, just to be clear.",
      "time": 1638401113,
      "title": "Ask HN: Is working at Amazon worth it?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29410435,
      "score": 1,
      "time": 1638400954,
      "title": "Neues Telekommunikationsgesetz",
      "type": "story",
      "url": "https://www.bmwi.de/Redaktion/DE/Pressemitteilungen/2021/11/20211130-neues-telekommunikationsgesetz-tritt-am-1-dezember-in-kraft.html"
    },
    {
      "by": "flerovium",
      "descendants": 0,
      "id": 29410418,
      "score": 2,
      "text": "Why isn&#x27;t there more effort to build highway-bound self-driving cars?<p>1. Most commuting is on highways. A highway is a controlled environment with very few edge cases--less than existing L4 areas like Arizona and Pittsburgh suburbs.<p>2. A highway-capable self-driving car capture 90% of the value of a self-driving car, certainly for commuters. Any long trip, where it is valuable to disengage, spends most of its time on the highway.<p>3. An autonomous highway in a single city would save its commuters an absurd amount of time and attention.<p>4. To handle edge cases, it is always legal to slow, even stop on a highway, and there is always a shoulder to pull over on.[1]<p>5. Most new cars can navigate from onramp to offramp. But L4 providers haven&#x27;t taken the step to let drivers disengage, despite supporting L4 driving in limited non-highway environments.<p>6. One might claim that it isn&#x27;t as valuable for ridesharing, but it&#x27;s is hard to believe that there isn&#x27;t enough value for commuters, or there isn&#x27;t enough funding.<p>7. For rare edge cases, a remote driver can serve as a backstop, as in Waymo&#x27;s L4 driving.<p>I understand that it involves government collaboration, but companies have created significant regulatory change when necessary.<p>[1] There are rare exceptions, but the geofence could extend only to highways with a shoulder.",
      "time": 1638400852,
      "title": "Ask HN: Why isn't there more effort to build highway-bound self-driving cars?",
      "type": "story"
    },
    {
      "by": "kerblang",
      "descendants": 0,
      "id": 29410415,
      "score": 1,
      "time": 1638400824,
      "title": "Is DNA Hardware or Software?",
      "type": "story",
      "url": "https://www.growbyginkgo.com/2020/06/29/is-dna-hardware-or-software/"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 29410413,
      "score": 1,
      "time": 1638400806,
      "title": "Ethereum Emissions Tracker",
      "type": "story",
      "url": "https://kylemcdonald.github.io/ethereum-emissions/"
    },
    {
      "by": "reteltech",
      "descendants": 0,
      "id": 29410404,
      "score": 1,
      "time": 1638400730,
      "title": "Yandex delivery robots stuck in the snow in Moscow",
      "type": "story",
      "url": "https://old.reddit.com/r/diydrones/comments/r6jtly/yandex_delivery_drones_stuck_in_the_snow_in_moscow/"
    },
    {
      "by": "conanxin",
      "descendants": 0,
      "id": 29410382,
      "score": 1,
      "time": 1638400514,
      "title": "Legitimacy Lost",
      "type": "story",
      "url": "https://li.substack.com/p/legitimacy-lost"
    },
    {
      "by": "brudgers",
      "descendants": 0,
      "id": 29410339,
      "score": 1,
      "time": 1638400184,
      "title": "Oliver Percovich and Skateistan (2018)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=XAEIyvD8QeY"
    }
  ]
}