{
  "stories": [
    {
      "by": "MajstGad",
      "descendants": 0,
      "id": 32206789,
      "score": 1,
      "time": 1658604768,
      "title": "Why not adopt build2 a cargo-like solution for C++",
      "type": "story",
      "url": "https://old.reddit.com/r/cpp/comments/w699nv/why_not_adopt_build2_a_cargolike_solution_for_c/"
    },
    {
      "by": "adsal92",
      "descendants": 0,
      "id": 32206772,
      "score": 1,
      "text": "I intend to make an online course but I am not exactly able to gauge the demand. I have worked as both mobile and web developer with around 3+ years experience in both technologies. I am also pursuing my PhD in CS inclined more towards NLP and XAI. I also consider it as my area of expertise.\nThe purpose to make this course to gain experience in online teaching and teaching in general but also to earn some passive income.\nI have also published a course on Udemy for Laravel 3 weeks ago but it hasn&#x27;t gained much traction.",
      "time": 1658604681,
      "title": "Ask HN: What online course should I teach?",
      "type": "story"
    },
    {
      "by": "Kathandrax",
      "descendants": 1,
      "id": 32206770,
      "kids": [
        32206771
      ],
      "score": 1,
      "time": 1658604678,
      "title": "Find Startup Name with Available .Com Domain",
      "type": "story",
      "url": "https://domains.webrep.app/"
    },
    {
      "by": "deenamo",
      "descendants": 0,
      "id": 32206739,
      "score": 1,
      "time": 1658604503,
      "title": "Apple rescinds a job offer as it “can't run” a background check in Ukraine",
      "type": "story",
      "url": "https://www.linkedin.com/posts/katia-trusova-9a567568_standwithukraine-supportukraine-activity-6955941875551789056-9oyw"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 32206733,
      "score": 1,
      "time": 1658604470,
      "title": "Bqnpad",
      "type": "story",
      "url": "https://bqnpad.mechanize.systems/"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 32206645,
      "score": 1,
      "time": 1658603944,
      "title": "Why Trauma Doesn’t Exist According to Adlerian Psychology",
      "type": "story",
      "url": "https://theapeiron.co.uk/why-trauma-doesnt-exist-according-to-adlerian-psychology-db1368e1d667"
    },
    {
      "by": "mort96",
      "descendants": 0,
      "id": 32206579,
      "score": 3,
      "time": 1658603509,
      "title": "The tar archive format, and why GNU tar extracts in quadratic time",
      "type": "story",
      "url": "https://mort.coffee/home/tar/"
    },
    {
      "by": "Victerius",
      "descendants": 3,
      "id": 32206555,
      "kids": [
        32206806,
        32206661
      ],
      "score": 4,
      "text": "What do you think about this imaginary argument between an unnamed corporation and an unnamed engineer?<p>&quot;Software engineers ask for too much, and we will lower our salaries to line them up with the rest of the non-technical staff.&quot;<p>&quot;That&#x27;s a stupid decision.&quot;<p>&quot;Why?&quot;<p>&quot;Software engineers are less replaceable than non-technical staff and are the most important people in your company.&quot;<p>&quot;We do not share the belief that engineers are any less replaceable or more important than non-technical staff.&quot;<p>&quot;Then you will not attract top talent.&quot;<p>&quot;Top talent does not always chase the biggest paycheck. And we can do just fine without top talent.&quot;<p>&quot;Top talent will go to your competitors instead.&quot;<p>&quot;Top talent is overrated and will not give our competitors any meaningful edge. A team of ten average engineers can produce as much value as two self-claimed &#x27;top engineers&#x27; for the same price.&quot;<p>&quot;What makes you think that top talent is overrated?&quot;<p>&quot;Some engineers are better than others. We recognize that. But the top 20% of engineers is not that much better than the middle 60%. They do not produce significantly more code, or significantly better quality or scalable code. An average engineer can do almost anything a top engineer can, but for a much lower price. They cost-to-value ratio favors average engineers.&quot;",
      "time": 1658603377,
      "title": "Ask HN: Is top talent in software overrated?",
      "type": "story"
    },
    {
      "by": "reactspa",
      "descendants": 1,
      "id": 32206529,
      "kids": [
        32206569
      ],
      "score": 3,
      "time": 1658603258,
      "title": "Videos released by the Police are no longer welcome on YouTube",
      "type": "story",
      "url": "https://www.youtube.com/post/Ugkxn3JZ5kW0MOUrlBrqjE0U2TV1Zay_yqa4"
    },
    {
      "by": "jmfldn",
      "descendants": 0,
      "id": 32206500,
      "score": 4,
      "time": 1658603147,
      "title": "Peter Thiel on the dangers of progress",
      "type": "story",
      "url": "https://unherd.com/2022/07/peter-thiel-on-the-dangers-of-progress/"
    }
  ]
}