{
  "stories": [
    {
      "by": "1_over_epsilon",
      "descendants": 0,
      "id": 30753246,
      "score": 1,
      "time": 1647865572,
      "title": "Killed by NASA",
      "type": "story",
      "url": "https://www.killedbynasa.com/"
    },
    {
      "by": "hoffm",
      "descendants": 0,
      "id": 30753224,
      "score": 1,
      "time": 1647865444,
      "title": "A podcast generated by a bot: The Weather in Brooklyn",
      "type": "story",
      "url": "https://michaelshoffman.com/the-weather-in-brooklyn"
    },
    {
      "by": "ketanmaheshwari",
      "descendants": 0,
      "id": 30753222,
      "score": 1,
      "time": 1647865426,
      "title": "Shabdle: Wordle in Hindi",
      "type": "story",
      "url": "https://kach.github.io/shabdle/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30753219,
      "score": 1,
      "time": 1647865382,
      "title": "Science in the Southern Hemisphere: Sofia Deploys to Chile",
      "type": "story",
      "url": "https://blogs.nasa.gov/sofia/2022/03/18/science-in-the-southern-hemisphere-sofia-deploys-to-chile/"
    },
    {
      "by": "oakesm9",
      "descendants": 0,
      "id": 30753214,
      "score": 1,
      "time": 1647865345,
      "title": "Sabotage: Code added to popular NPM package wiped files in Russia and Belarus",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/03/sabotage-code-added-to-popular-npm-package-wiped-files-in-russia-and-belarus/"
    },
    {
      "by": "typeofhuman",
      "descendants": 0,
      "id": 30753213,
      "score": 1,
      "time": 1647865340,
      "title": "Better’s U.S. Zoom Firings Leave 1k More Workers in India",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-02-14/better-com-s-zoom-firings-leave-1-000-more-workers-in-india"
    },
    {
      "by": "atg_abhishek",
      "descendants": 0,
      "id": 30753206,
      "score": 1,
      "time": 1647865241,
      "title": "Accelerating Ukraine Intel Analysis with CV on Synthetic Aperture Radar Imagery",
      "type": "story",
      "url": "https://bair.berkeley.edu/blog/2022/03/21/ukraine-sar-maers/"
    },
    {
      "by": "austinjp",
      "descendants": 0,
      "id": 30753186,
      "score": 1,
      "text": "Is anyone successfully operating a business without email? Please describe pros, cons, how you got there, etc.<p>Rant:<p>I&#x27;m sick of email. It&#x27;s become the &quot;universal inbox&quot;. We never predicted just how awful that would be. Let me count the ways...<p>Chat. Email has become live chat, despite more suitable platforms existing. I first saw this with Blackberry, but this is now prevalent in white-collar industries. People expect rapid responses. This is hugely detrimetal to morale and work-life balance.<p>Fire-and-forget. Optional bonus: workload shuffling. We all send emails like &quot;Here&#x27;s X, let me know if&#x2F;when Y&quot; and tick-off a todo item. But this is emblematic of a terrible workflow: get it off my desk ASAP and off-load responsibility to someone else. Inevitably this multiplies someone else&#x27;s workload and encourages short-termism. The individual looks productive to management, since their throughput is high, but they&#x27;re contributing to a pervasive syrup which clogs the business and lowers morale.<p>Work multiplier. You get am email from a superior: &quot;I can&#x27;t find X, please send&quot;. You know X is in their mail archive&#x2F;shared drive because you sent it to them&#x2F;put it there, but their inability to find it means extra work for you. (Yes, this problem exists outside email, but email is a major force-magnifier here.) When you receive the email &quot;Here&#x27;s X, let me know if&#x2F;when Y&quot;, how do you handle it? Pin it, flag it, put a note in the calendar for the date, identify what Y involves, and... fire off a few emails?<p>Workflow management. Sure, &quot;inbox zero&quot;, &quot;GTD&quot;, etc, but there are an <i>infinite</i> number of ways individuals <i>actually</i> manage their work via email. Large orgs train staff how to &quot;effectively use email&quot;, inevitably involving poorly thought out workflows which favour certain types of individual and leaves no room for others. Email gets mangled to fit ad-hoc solutions, and the solutions are perennially updated to deal with shortcomings. It&#x27;s a vicious circle.<p>Knowledge base. Enabled by ubiquitous search, knowledge is dumped into email. This seems reasonable, but I&#x27;ve experienced real issues with this. Email is managed differently from knowledge bases. I had to move depts within an org once, entailing a change in email address, and hence account. The IT dept could not guarantee that I would retain access to my email archive. Yikes!<p>Audit trail. Like the knowledge base, but more personal. Who did what, when. Weaponised during one-to-ones and meetings with HR.<p>Magic. Email functionality is tightly entwined with calendaring and more. If I delete the email, will the calendar item be cancelled? If I cancel a meeting, will everyone get an email? Why can some people see the Teams button but some can&#x27;t? Why do some emails in Gmail offer to track a delivery, add to calendar, etc? I want colleagues to <i>understand</i> what&#x27;s going on, but nobody is confident how these things operate. It&#x27;s all magic.<p>Silos. Self-hosting email has become non-trivial, see HN conversations passim [0]. The incumbents (Gmail, Outlook, Mailgun, Sendgrid, etc etc) effectively determine what constiutes spam, making it risky to use anyone other than the major operators. The silos don&#x27;t always interoperate well; hence &quot;magic&quot;. Silo providers are also keen to exploit data, with obvious concerns for privacy.<p>Privacy. Plenty on this elsewhere. Silo providers read your emails, calendars, documents, etc etc. Yuck.<p>Identity. Email is synonymous with online identity, despite being unencrypted, non-private, and riddled with other design features which make it orthogonal to identity provision.<p>To pre-empt, a lot of these problems would exist without email. I&#x27;m still interested in how you&#x27;d cope with these issues if email ceased to exist. Perhaps email is simply &quot;surfacing&quot; the real, underlying issues.<p>Edit: perhaps <i>external</i> comms will always require email e.g. with Governments and service providers. If so, is it possible to get rid of email for internal comms?<p>Thanks all :)<p>[0] https:&#x2F;&#x2F;hn.algolia.com&#x2F;?query=self-hosted%20email",
      "time": 1647865080,
      "title": "Ask HN: Whose business operates without email?",
      "type": "story"
    },
    {
      "by": "gry_gh",
      "descendants": 0,
      "id": 30753153,
      "score": 3,
      "time": 1647864890,
      "title": "Mozilla Stops China IP from Using uBlock, Even on Firefox International",
      "type": "story",
      "url": "https://old.reddit.com/r/uBlockOrigin/comments/tie7un/ublock_origin_is_blocked_by_mozilla_in_china/"
    },
    {
      "by": "Eddy_Viscosity2",
      "descendants": 1,
      "id": 30753152,
      "kids": [
        30753166
      ],
      "score": 1,
      "time": 1647864874,
      "title": "Germany plans to build Europe's largest military",
      "type": "story",
      "url": "https://www.npr.org/2022/03/17/1087137501/germany-is-building-whats-expected-to-become-europe-s-largest-military"
    }
  ]
}