{
  "stories": [
    {
      "by": "malshe",
      "descendants": 0,
      "id": 29569624,
      "score": 1,
      "time": 1639592392,
      "title": "Hackers Backed by China Seen Exploiting Security Flaw in Internet Software",
      "type": "story",
      "url": "https://www.wsj.com/articles/hackers-backed-by-china-seen-exploiting-security-flaw-in-internet-software-11639574405"
    },
    {
      "by": "richardzyx",
      "descendants": 0,
      "id": 29569621,
      "score": 1,
      "time": 1639592366,
      "title": "Ensuring hydrogen supply chains don’t become ‘nobody’s problem’",
      "type": "story",
      "url": "https://www.canarymedia.com/articles/sponsored/ensuring-hydrogen-supply-chains-dont-become-nobodys-problem"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 29569610,
      "score": 1,
      "time": 1639592309,
      "title": "A Note to Potential Investors",
      "type": "story",
      "url": "https://www.toptal.com/investors"
    },
    {
      "by": "knoxa2511",
      "descendants": 0,
      "id": 29569587,
      "score": 1,
      "time": 1639592204,
      "title": "Exploiting and Mitigating CVE-2021-44228: Log4j Remote Code Execution (RCE)",
      "type": "story",
      "url": "https://sysdig.com/blog/exploit-detect-mitigate-log4j-cve/"
    },
    {
      "by": "benrothke",
      "descendants": 0,
      "id": 29569582,
      "score": 1,
      "time": 1639592180,
      "title": "Best Information Security Books of 2021",
      "type": "story",
      "url": "https://brothke.medium.com/the-5-best-information-security-books-of-2021-b796c189cba5"
    },
    {
      "by": "jasim",
      "descendants": 1,
      "id": 29569579,
      "kids": [
        29569622
      ],
      "score": 1,
      "time": 1639592156,
      "title": "Mold/design.md at main · rui314/mold",
      "type": "story",
      "url": "https://github.com/rui314/mold/blob/main/docs/design.md"
    },
    {
      "by": "gbrown_",
      "descendants": 0,
      "id": 29569571,
      "score": 1,
      "time": 1639592136,
      "title": "Journey to a Faster Concurrent Map",
      "type": "story",
      "url": "https://gopheradvent.com/calendar/2021/journey-to-a-faster-concurrent-map/"
    },
    {
      "by": "camhart",
      "descendants": 1,
      "id": 29569561,
      "kids": [
        29569567
      ],
      "score": 2,
      "text": "tldr:\nI launched Truple 4.5 years ago (see https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14113636).  2.5 years ago Apple froze my developer account.  Since that time competitors released similar functionality for Apple products.  Apple still has my Developer account on lockdown.  What can I do?<p>long version:<p>4.5 years ago I launched Truple (https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14113636), a bootstrapped parental control &#x2F; accountability app.  Truple is used by parents to gain insight into how their children use the internet, but also by adults who struggle with online habits they&#x27;d like to change (porn being chief among them).  The screenshot based approach Truple offers proves to work much better than other solutions.  It&#x27;s the only solution that allows you to use social media, but still have accountability for what you&#x27;re viewing through social media.  For example, if you have access to Twitter, you have access to porn.  You can&#x27;t use twitter without having that access.  Truple allows you to use twitter while still being held accountable for what you view on twitter.  No other solution offers this, because they don&#x27;t report what you&#x27;re viewing within an app.  Twitter is just an example, the same goes for all &quot;innocent&quot; apps (social media, streaming sites, etc) that contain concerning content.<p>2.5 years ago, I submitted an early version of a MacOS app for notarization.  A couple of days later my Apple Developer account was &quot;frozen&quot; without any message or indication why.  The signing certificates were just revoked.  After a year or so, Apple said they found &quot;potentially unwanted software&quot; in my app and were investigating.  I indicated that was unexpected (that&#x27;s the only question they asked me).  As background, to run the app you have to download and install it, login to your truple account, select what you want the monitoring settings to be, grant permissions, etc.  It&#x27;s a whole process.  I point this out because the app didn&#x27;t do anything malicious or against the device owners&#x27; will.<p>After nearly two years of waiting on Apple (I emailed regularly, they kept saying it was under review) Apple decided they wouldn&#x27;t finish the investigation but that I needed to create a new developer account.  I&#x27;ve since done so.  I submitted a redesigned version of the app for notarization, and now, while my account isn&#x27;t &quot;frozen&quot;, notarization is rejected with the message: &quot;Team is not yet configured for notarization.&quot;  I submitted a &quot;hello world&quot; app using boilerplate code for notarization, and I get the same rejection.  I now have another case open with Apple, and it&#x27;s going nowhere it seems.  I&#x27;m assuming Apple has flagged my second account due to the previous issue.  I fear I&#x27;m stuck in a continual loop.<p>Truple was the first to offer screenshot based monitoring as a parental control &#x2F; accountability app, but during the past 2.5 years, multimillion dollar competitors have been allowed by Apple to launch apps with similar functionality for Apple products.  I have read and reread the Apple developer agreement.  My app is in alignment with it... I&#x27;ve made sure since day one that a &quot;reasonably suspicious&quot; notification is present when the app is monitoring.  Once enabled, the data captured is end-to-end encrypted and only made accessible to the account owner and their chosen recipients.  I&#x27;ve expressed a willingness to make changes if need be, but Apple hasn&#x27;t indicated I need to make any.  They&#x27;ve just been silent.<p>What should I do?  I&#x27;ve been <i>extremely</i> patient with Apple.  But it&#x27;s now been 2.5 years and it&#x27;s gotten me nowhere.  Apple seems unwilling to do anything for me but take my annual developer fee.  I&#x27;m not famous and I have no significant following to rely on to garner attention to this unfair treatment. I ask for your help.",
      "time": 1639592099,
      "title": "Apple revoked developer account for 2.5 years and counting, unfair treatment",
      "type": "story"
    },
    {
      "by": "tumidpandora",
      "descendants": 0,
      "id": 29569524,
      "score": 1,
      "time": 1639591953,
      "title": "Show HN: Simple rule-based personal chatbots",
      "type": "story",
      "url": "https://www.presbot.com/"
    },
    {
      "by": "xkriva11",
      "descendants": 0,
      "id": 29569523,
      "score": 1,
      "time": 1639591953,
      "title": "ATX-80 – ZX-80 computer clone with ATmega8 processor",
      "type": "story",
      "url": "http://www.breatharian.eu/hw/atx80/index_en.html"
    }
  ]
}