{
  "stories": [
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31596028,
      "score": 1,
      "time": 1654183491,
      "title": "How the brain responds to surprising events",
      "type": "story",
      "url": "https://news.mit.edu/2022/noradrenaline-brain-surprise-0601"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31595991,
      "score": 1,
      "time": 1654183321,
      "title": "JEP 426: Vector API (Fourth Incubator)",
      "type": "story",
      "url": "https://openjdk.java.net/jeps/426"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31595987,
      "score": 1,
      "time": 1654183309,
      "title": "Behind the Scenes: The pots, pans, and people that make millions of meals",
      "type": "story",
      "url": "https://joseandres.substack.com/p/behind-the-scenes-the-pots-pans-and"
    },
    {
      "by": "saradhi",
      "descendants": 0,
      "id": 31595978,
      "score": 1,
      "text": "I have been running imagetoexcel.com registered with Google Domain. The service is live since May 2019 with 1000 DAUs. I have auto-renewal turned on, so every year it renews for one year charging my credit card linked in the account. I lost my cards in February, so I had to block my cards with the bank. Apparently, in May, Google Services tried to take the payment and hit a bad response from the Payment. I received an email stating the same, so when I tried to add a new card(s) it threw an error `OR-CCSEH-21`. Understandably they had to verify me and asked me to submit my ID, which I did. Two weeks to date no response from the Google Pay services, even on the follow-up. Now the site is down.<p>As a precautionary step, I&#x27;ve transferred my 4 other domains to the porkbun, which was super easy. I just thought of informing fellow hacker news followers to keep them out in such a situation.",
      "time": 1654183254,
      "title": "Tell HN: Transfer your Google domain to other registrar before it locks you out",
      "type": "story"
    },
    {
      "by": "kennyworkman",
      "descendants": 0,
      "id": 31595971,
      "score": 1,
      "time": 1654183215,
      "title": "LatchBio just raised a $28M Series A to build the AWS x GitHub for biocomputing",
      "type": "story",
      "url": "https://twitter.com/LatchBio/status/1532376887938338817"
    },
    {
      "by": "theory_of_10_1",
      "descendants": 0,
      "id": 31595966,
      "score": 4,
      "text": "Hey! I would like to build an online coaching network, where mentors and mentees can find each other and connect.<p>There are tons to validate at this stage so I am wondering what kind of tools do you know about that can help.<p>buddyboss.com was suggested at one point and potentially we might start with it, any suggestions&#x2F;recommendations?<p>bubble.io is also an option, but like a lower level comparing to buddyboss.com<p>anyway, thanks a lot!",
      "time": 1654183206,
      "title": "Ask HN: Recommend tools to build a coaching network",
      "type": "story"
    },
    {
      "by": "businessperson",
      "descendants": 0,
      "id": 31595954,
      "score": 1,
      "text": "TLDR: Reddit but competitive<p>I made PopResolve after experiencing the positive and fun side of fan wars, where two communities pretend to be against each other and the end result is, well... culture.<p>The website lets you create or join a team and go to war or become allies with other teams.\nEvery team votes for a president who takes control over the team&#x27;s resources, functions and gets to decide which teams are enemies and which are allies.\nRegular elections for presidents are triggered by the point system.<p>Future development may be aimed towards expanding the governmental structure of the teams.<p>More details on how it works: <a href=\"https:&#x2F;&#x2F;popresolve.com&#x2F;support\" rel=\"nofollow\">https:&#x2F;&#x2F;popresolve.com&#x2F;support</a><p>No real world politics are allowed, we have enough of that everywhere else.",
      "time": 1654183147,
      "title": "Show HN: A Battle of Ideas",
      "type": "story",
      "url": "https://popresolve.com/"
    },
    {
      "by": "da-x",
      "descendants": 0,
      "id": 31595927,
      "score": 1,
      "time": 1654183034,
      "title": "Putting Tests in a Separate Git Repo",
      "type": "story",
      "url": "https://blog.aloni.org/posts/tests-in-seperate-git-repo/"
    },
    {
      "by": "sgfgross",
      "descendants": 0,
      "id": 31595920,
      "score": 1,
      "time": 1654183004,
      "title": "Slightly head-down posture might help you look more friendly",
      "type": "story",
      "url": "https://oa.mg/blog/slightly-head-down-posture-might-help-you-look-more-friendly-research-says/"
    },
    {
      "by": "mjb",
      "descendants": 0,
      "id": 31595919,
      "score": 2,
      "time": 1654182987,
      "title": "Formal Methods Only Solve Half My Problems",
      "type": "story",
      "url": "https://brooker.co.za/blog/2022/06/02/formal.html"
    }
  ]
}