{
  "stories": [
    {
      "by": "lnwlebjel",
      "descendants": 0,
      "id": 30062588,
      "score": 1,
      "time": 1643052253,
      "title": "Shockwave from Tonga Explosion Visible in Global Water Vapor Data",
      "type": "story",
      "url": "https://cimss.ssec.wisc.edu/satellite-blog/images/2022/01/220115_goes17_waterVaporTimeDifference_anim.gif"
    },
    {
      "by": "s-xyz",
      "descendants": 0,
      "id": 30062586,
      "score": 1,
      "time": 1643052232,
      "title": "The State of Mobile in 2022 by App Annie",
      "type": "story",
      "url": "https://www.appannie.com/en/insights/market-data/state-of-mobile-2022/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30062558,
      "score": 1,
      "time": 1643052076,
      "title": "Chernobyl: How It Happened (2016)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Ijst4g5KFN0"
    },
    {
      "by": "abriosi",
      "descendants": 0,
      "id": 30062520,
      "score": 1,
      "text": "In this study we propose a new concept of databases (crowdsourced databases), adding a new conceptual approach to the debate on legal protection of databases in Europe. We also summarise the current legal framework and current indexing and web scraping practices - it would not be prudent to suggest a new theory without contextualising it in the legal and practical context in which it is developed.",
      "time": 1643051940,
      "title": "Show HN: Crowdsourced Databases and Sui Generis Rights",
      "type": "story",
      "url": "https://arxiv.org/abs/2108.04727"
    },
    {
      "by": "alestainer",
      "descendants": 0,
      "id": 30062514,
      "score": 1,
      "text": "Is there a guide on what steps I need to take to get rid of most of the tracking? I know basics - browser switch, migrate email, etc, but they don&#x27;t cover much. Any suggestions? Is it at all possible?",
      "time": 1643051916,
      "title": "Ask HN: How do you unplug from tracking infrastructure?",
      "type": "story"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 30062513,
      "score": 1,
      "time": 1643051905,
      "title": "El Salvador Is Now over 31% Down on Its Bitcoin Bet",
      "type": "story",
      "url": "https://cryptobriefing.com/el-salvador-is-now-over-31-down-on-its-bitcoin-bet/"
    },
    {
      "by": "encryptluks2",
      "descendants": 0,
      "id": 30062511,
      "score": 1,
      "text": "This is a warning to Xfinity customers. Today, I got a sophisticated spam email to an email address that was only ever provided to Xfinity. Note I am no longer an Xfinity customer since a few months ago, but my account still exists with Xfinity. I am using SimpleLogin to generate unique email addresses for every service that I signup for. Due to the way SimpleLogin forwards emails, I only have limited email header information. The email appears to be an invoice from Quickbooks for Norton AntiVirus suggesting I have a balance due of 256.89 for 5 copies of AntiVirus. The phone number provided, 1 (850) 806-2408, has a live person answer when called immediately suggested that I provide my credit card to cancel the order.<p>The email appears to have been sent from Teamnort@saless.cc. Interestingly enough when trying a WHOIS on saless.cc it appears the domain is not registered. However, according to this article the TLDs have been hijacked before:<p>https:&#x2F;&#x2F;labs.detectify.com&#x2F;2021&#x2F;01&#x2F;15&#x2F;how-i-hijacked-the-top-level-domain-of-a-sovereign-state&#x2F;<p>I immediately tried calling Xfinity to explain the issue to their security team, but their entry-level employees couldn&#x27;t understand the issue. I did some searches and appears that other Xfinity customers have experienced similar phishing emails. In this instance, he only way someone could have gotten that email is if an Xfinity employee is leaking emails or there has been a data breach with customer emails. This email was updated in April of 2021, so the breach would have had to occur after that time. The email is unique enough that it wouldn&#x27;t have been randomly sent, and note this is the first phishing email I&#x27;ve ever received from someone to my 400+ aliases that I&#x27;m using currently.",
      "time": 1643051901,
      "title": "Xfinity Data breach detected through email alias service",
      "type": "story"
    },
    {
      "by": "lanna",
      "descendants": 0,
      "id": 30062510,
      "score": 2,
      "time": 1643051900,
      "title": "The James Webb space telescope has arrived at L2",
      "type": "story",
      "url": "https://www.jwst.nasa.gov/content/webbLaunch/whereIsWebb.html?units=metric"
    },
    {
      "by": "SoylentOrange",
      "descendants": 0,
      "id": 30062470,
      "score": 1,
      "time": 1643051742,
      "title": "Why adieu is a terrible first guess in Wordle",
      "type": "story",
      "url": "https://kats.coffee/blog/wordle"
    },
    {
      "by": "michaeljolley",
      "descendants": 0,
      "id": 30062468,
      "score": 1,
      "time": 1643051729,
      "title": "Displaying your speech in real-time to help lipreaders in the mask era",
      "type": "story",
      "url": "https://twitter.com/_phzn/status/1478504862170161152"
    }
  ]
}