{
  "stories": [
    {
      "by": "somishere",
      "descendants": 0,
      "id": 32208258,
      "score": 1,
      "text": "I cobbled this together as part of a wlan project a few years ago. I am not an Ubuntu &#x2F; networking stack native and there was a decent amount of research involved to solve across platforms, browsers, etc. Following a HN discussion[1] last week I thought it might be worth extracting the relevant juicy bits into a gist.<p>Separate to this was an OS-specific landing page flow that explained how to &quot;accept&quot; the captive portal (with overlays &#x2F; pointers in the correct part of the screen). I haven&#x27;t included this but might add some screenshots per device when I get a chance.<p>Thoughts &#x2F; criticisms &#x2F; improvements most appreciated.<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32092104\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32092104</a>",
      "time": 1658615903,
      "title": "Show HN: A (Naive) Secure Captive Portal. Thoughts?",
      "type": "story",
      "url": "https://gist.github.com/theprojectsomething/a8406ba6be3ed3335fb3a2e5efea4b41"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 32208249,
      "score": 1,
      "time": 1658615838,
      "title": "Monkeypox Virus (MPXV) – 2022-Outbreak – (Spread of Disease as of 22 July, 2022)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/2022_monkeypox_outbreak"
    },
    {
      "by": "mlerner",
      "descendants": 0,
      "id": 32208248,
      "score": 1,
      "time": 1658615834,
      "title": "Metastable Failures in the Wild",
      "type": "story",
      "url": "https://www.micahlerner.com/2022/07/11/metastable-failures-in-the-wild.html"
    },
    {
      "by": "liberia",
      "descendants": 0,
      "id": 32208240,
      "score": 1,
      "time": 1658615740,
      "title": "How to Use Facebook Privacy Settings",
      "type": "story",
      "url": "https://www.consumerreports.org/privacy/facebook-privacy-settings-a1775535782/"
    },
    {
      "by": "andsoitis",
      "descendants": 0,
      "id": 32208211,
      "score": 1,
      "time": 1658615551,
      "title": "Favorite Quotes and Excerpts",
      "type": "story",
      "url": "https://shuvomoy.github.io/blogs/posts/Quotes-and-excerpts/"
    },
    {
      "by": "liberia",
      "descendants": 0,
      "id": 32208204,
      "score": 1,
      "time": 1658615509,
      "title": "Twitter Vulnerability Exposes Data from 5.4M Accounts",
      "type": "story",
      "url": "https://restoreprivacy.com/twitter-vulnerability-exposes-5-million-accounts/"
    },
    {
      "by": "atombender",
      "descendants": 0,
      "id": 32208191,
      "score": 1,
      "time": 1658615430,
      "title": "Puter, a Desktop Environment in the Browser",
      "type": "story",
      "url": "https://puter.com/"
    },
    {
      "by": "hui-zheng",
      "descendants": 0,
      "id": 32208170,
      "score": 1,
      "text": "Both Facebook and Craigslist automatically censors any rental listing with a gender&#x2F;sex keyword.<p>I am not even allowed to describe the sex of the other tenant who is already living in the suite.  It&#x27;s a machine algorithm block, they don&#x27;t even need other users to flag the posting. It&#x27;s an automatically ban.<p>Does any person think the wording below is prohibitive or discriminating?<p>&gt; We are renting out one room in a 2-bedroom basement suite. The suite has two rooms. One room is already rented by a university <i>male</i> student.\nWe are looking for a responsible and respectful tenant to rent the other room. This is ideal for a student or a young professional individual.<p>I confirm that the offensive word above is <i>male</i>. Once I remove it. the posting is ok.<p>My question is what algorithm Facebook and Craigslist use to flag and block posting. what&#x27;s the reason that they would flag a posting like this?",
      "time": 1658615253,
      "title": "What algorithm Facebook and Craigslist use to flag posting?",
      "type": "story"
    },
    {
      "by": "bmare",
      "descendants": 0,
      "id": 32208147,
      "score": 1,
      "text": "I&#x27;m working on a small SaaS site, both as an earnest attempt to create some income for myself and as an attempt to teach myself programming. At it&#x27;s core it involves scraping data from various places on the web, combining it, cleaning it, and laying it out in a useful way. I have made progress on my own, but I know I would make more progress if I had someone with experience helping me out. I don&#x27;t have the capital to hire someone to do it, nor do I want to just hire someone. The point is that even if this business doesn&#x27;t succeed, I will come away with a lot more knowledge on web development, site administration, and scraping and cleaning data. As an alternative to hiring someone to build the site, I&#x27;m wondering about hiring a tutor to help me move forward faster. It seems to me that there would be ethical and business problems that arise from this. Wouldn&#x27;t my tutor in a way be an employee? How could I protect the business idea while getting help from the tutor? I suppose one alternative would be signing a non-disclosure agreement and offering a certain amount of equity or revenue sharing. I am not out here to exploit someone else&#x27;s work and pass it off as my own. I want to build the service, run it, and maintain it, but I know that I would benefit from having more experienced eyes guiding me in my work. I&#x27;m hoping someone on here could offer some advice, ideas, or alternatives.",
      "time": 1658615073,
      "title": "Receiving Tutoring on a For-Profit Project",
      "type": "story"
    },
    {
      "by": "jgamman",
      "descendants": 0,
      "id": 32208146,
      "score": 2,
      "time": 1658615072,
      "title": "MecanoChemistry: H2 Gas Storage in Solids",
      "type": "story",
      "url": "https://newatlas.com/energy/mechanochemical-breakthrough-unlocks-cheap-safe-powdered-hydrogen/"
    }
  ]
}