{
  "stories": [
    {
      "by": "debanjan16",
      "descendants": 0,
      "id": 31049530,
      "score": 1,
      "time": 1650083764,
      "title": "Which not so well known books are suitable for beginners to learn programming?",
      "type": "story"
    },
    {
      "by": "pankajtanwar",
      "descendants": 0,
      "id": 31049524,
      "score": 2,
      "time": 1650083703,
      "title": "Show HN: I built an open dashboard for my website",
      "type": "story",
      "url": "https://www.pankajtanwar.in/open-dashboard"
    },
    {
      "by": "elamje",
      "descendants": 0,
      "id": 31049507,
      "score": 1,
      "time": 1650083540,
      "title": "Confidence Levels and Probability",
      "type": "story",
      "url": "https://www.lesswrong.com/s/TQW9brvXJ5Fajorr4/p/GrtbTAPfkJa4D6jjH"
    },
    {
      "by": "whitepoplar",
      "descendants": 0,
      "id": 31049497,
      "score": 1,
      "time": 1650083463,
      "title": "How Retool upgraded its 4 TB main application PostgreSQL database",
      "type": "story",
      "url": "https://retool.com/blog/how-we-upgraded-postgresql-database/"
    },
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 31049483,
      "score": 1,
      "time": 1650083353,
      "title": "Terence McKenna’s Anarchic Psychedelic Religion",
      "type": "story",
      "url": "https://daily.jstor.org/terence-mckennas-anarchic-psychedelic-religion/"
    },
    {
      "by": "bcaulfield",
      "descendants": 0,
      "id": 31049482,
      "score": 1,
      "time": 1650083353,
      "title": "Scientists Use AI to Improve Sequestering Carbon Underground",
      "type": "story",
      "url": "https://blogs.nvidia.com/blog/2022/04/08/ai-improves-carbon-sequestration/"
    },
    {
      "by": "punkst",
      "descendants": 1,
      "id": 31049463,
      "kids": [
        31049527
      ],
      "score": 2,
      "text": "Always keep the code…<p>TLDR: Keep the code, it’s your only defense against unscrupulous business d-bags<p>This is a throwaway account because I’m under negotiations and don’t want to expose the alleged criminals just yet.<p>So about 2 ½ years ago I found a job on upwork.com as an algorithmic developer. For 2 years, I developed the real algorithm and the algorithm returned 500% over five years and 50%  alone in 2021. It trades futures and has been trading for over 2 years. (I know that sounds a little outrageous, but can share actual trading records and backtested results, the volatility of 2020 helped profits.)<p>My job was to build a trading system and take a silly technical indicator that one of the partners had bought from someone else and turn it into profitable. The original code was in easy language&#x2F;trade station so I know it wasn’t not terribly sophisticated. The other two partners were providing money with money and the ability to sell to clients. Sales skills are something I have always been deficient in.<p>It’s a complicated mess and mistakes were made on my part, but my salary was calculated from the profits of the monthly trading profits. In late 2019, I desperately wanted to get out of my low-stress, high-paid programming job, so I threw caution into the market and jumped in, unhedged.<p>So there were some months that I got nothing and then other months I got my full payment. Based on my contact, anytime I didn’t get paid it would be turned into deferred income. That deferred income has come out to be roughly $500k, for 2 years. Recently, I requested the financial statements of the company and that deferred income isn’t on the books.<p>I kept up my end by building the algorithm, but the two other partners never sold the algorithm to potential clients. I think in the end they weren’t good salespeople and didn’t understand that if you make money in the market you are also going to have days that you lose money. Just ask the man whole solved the market…<p>Since Oct 2021 the algorithm is on autopilot and I haven’t had much communication with the other partners. I have moved on, but the AWS server is in my name and my cost. Of course, it never occurred to the two partners that I essentially controlled all the servers&#x2F;code.<p>I have asked for payment for the AWS costs, but now they don’t want to recognize my deferred income on the books, and they want me to move me down the list, in regards to payment if the company is ever profitable. They also want to give my code to another developer, who is going to take my work and probably make it a little better,  but this developer is going to get paid cash which would be ahead of me, in terms of payment.<p>So I have hired a lawyer, but they gave me some general advice &#x2F; and said that I had a contract and the other partners were violating it. However, I can sue them, they can sue me, it’s LLC vs. LLC and there are tremendous costs in just getting the issue to the court… at least $10,000 for arbitration. So at this point, it’s becoming quite an emotional drain and I would like to resolve this on a positive note of all my hard work. ( I don’t anticipate ever getting the $500k, I just don’t want them ever to have the code.)<p>Are there any lawyers that might be interested in some form of contingency, with the possibility of intellectual property? (I also have my own algorithms, that are far better than the one I’m currently arguing over.) Any thoughts, advice, or ideas would be greatly appreciated. Any website&#x2F;chat rooms for disgruntled coders?<p>So I have made some dumb mistakes, but at the end of the day, I have code, so sue me?",
      "time": 1650083118,
      "title": "Ask HN: Should I Keep the Code?",
      "type": "story"
    },
    {
      "by": "MichaelMoser123",
      "descendants": 0,
      "id": 31049458,
      "score": 1,
      "time": 1650083069,
      "title": "Elon Musk “Twitter should be an open source project on GitHub”",
      "type": "story",
      "url": "https://twitter.com/josephjacks_/status/1515035002173485056"
    },
    {
      "by": "Ballu",
      "descendants": 0,
      "id": 31049455,
      "score": 1,
      "time": 1650083060,
      "title": "Chrome reached Ver 100.xx, with new Chrome Logo",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Google_Chrome_version_history"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 31049453,
      "score": 1,
      "time": 1650083056,
      "title": "Alternatives to Shopify for Developers of Ecommerce Apps",
      "type": "story",
      "url": "https://capitalandgrowth.org/answers/Article/3994189/Alternatives-to-Shopify-for-Developers-of-Ecommerce-Apps"
    }
  ]
}