{
  "stories": [
    {
      "by": "garritfra",
      "descendants": 0,
      "id": 29458008,
      "score": 1,
      "time": 1638785691,
      "title": "Gravatar leaks data on millions of users",
      "type": "story",
      "url": "https://www.itnews.com.au/news/gravatar-profile-add-on-leaks-data-on-millions-of-users-573607"
    },
    {
      "by": "mycodepedia",
      "descendants": 0,
      "id": 29458004,
      "score": 1,
      "time": 1638785636,
      "title": "Array reverse method in JavaScript in 1 blog",
      "type": "story",
      "url": "https://www.thecodepedia.com/array-reverse-method-in-javascript"
    },
    {
      "by": "shlosky",
      "descendants": 0,
      "id": 29458003,
      "score": 1,
      "time": 1638785634,
      "title": "JavaScript Trivia",
      "type": "story",
      "url": "https://javascript-trivia.com/"
    },
    {
      "by": "morpheos137",
      "descendants": 0,
      "id": 29457997,
      "score": 1,
      "text": "Imagine a large asteroid impacts earth in the distant past, say several billion years ago. What does it mean physically when it is discovered in the 20th century and later in the early 21st century is read about by people world wide on the internet and in scientific publications? Since thinking and electronic and print texts are physical processes this event (cause) is still having real physical effects today including ones that encode the nature of the event. It is incredible to me that atoms moving 2 billion years ago can provide a cause that has as an effect description of specifically why atoms were\nmoving 2 or 3 billion years ago but whether or not this description (information transmission across time) was ever uncovered depends on the fine details of the configuration of other matter that  we call human beings. There is the proverbial butterfly effect where a butterfly in the Amazon causes are hurricane in the gulf of Mexico or whatever but I think the butterfly effect where an asteroid impact 2 billion years ago on one continent causes thoughts to form on another that recognize it as an asteroid impact is even more amazing.",
      "time": 1638785514,
      "title": "Thinking about physical causation and information",
      "type": "story"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 29457964,
      "score": 1,
      "time": 1638785214,
      "title": "Implementing Raft for Browsers with Rust and WebRTC",
      "type": "story",
      "url": "https://eevans.co/blog/wraft/"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 29457945,
      "score": 1,
      "time": 1638784880,
      "title": "Greatest Innovations of 2021",
      "type": "story",
      "url": "https://www.popsci.com/technology/best-of-whats-new-2021/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29457936,
      "score": 1,
      "time": 1638784786,
      "title": "Continuous Integration with Go and GitHub Actions",
      "type": "story",
      "url": "https://www.alexedwards.net/blog/ci-with-go-and-github-actions"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 29457935,
      "score": 1,
      "time": 1638784778,
      "title": "Tether created $1,5B Worth of USDT Out of Thin Air in the Last 24h",
      "type": "story",
      "url": "https://old.reddit.com/r/CryptoCurrency/comments/r9fni8/tether_usdt_created_1500000000_worth_of_usdt_out/"
    },
    {
      "by": "dmje",
      "descendants": 0,
      "id": 29457930,
      "score": 1,
      "text": "I&#x27;m getting on (I&#x27;m nearly 50) - not a software dev (thank god) but more a project manager. I do a lot of the &quot;knitting together&quot; type work between developers, UX people, designers, content owners, etc.<p>Until recently, we used to do things like write cheatsheets and other help docs for our clients for tools like Google Analytics. This was all fine, and they were appreciated, as clients just don&#x27;t know how to use these tools.<p>But recently, the rate of change has just made this untenable. I&#x27;d log into a tool like GA and the whole thing would be different. Not just the upgrade to 4, but then incremental changes there, too. So cheatsheets, training workshops, anything around support - just becomes untenable.<p>Another example: I log into Teamwork (my project management tool of choice) - and they&#x27;re &quot;retiring&quot; the plan I&#x27;ve been on (and very happy with) for years. Instead I have to choose &quot;Growth&quot; and now my dashboard is littered with a whole bunch of stuff I neither want or need. Nothing is where I&#x27;m used to it being.<p>And: we do a bunch of work with Wordpress. The rate of change here is insane, too - every single update brings new features, none of which is documented, bedded in or understood. None of which can be written about, supported or workshopped.<p>And: Trello. It was fine. And then Atlassian bought it and it became this horrific behemoth of &quot;features&quot;, all of which just clutter everything up, none of which seems to actually do anything useful.<p>And on, and on.<p>Is this rate of change supportable? Am I just too old? Help me put this in context, HN!",
      "time": 1638784722,
      "title": "Ask HN: Is everything changing too fast?",
      "type": "story"
    },
    {
      "by": "darkscape",
      "descendants": 0,
      "id": 29457926,
      "score": 1,
      "time": 1638784697,
      "title": "Surveillance Publishing",
      "type": "story",
      "url": "https://golem.ph.utexas.edu/category/2021/12/surveillance_publishing.html"
    }
  ]
}