{
  "stories": [
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31964326,
      "score": 1,
      "time": 1656812980,
      "title": "Innovation as a Fringe Activity",
      "type": "story",
      "url": "https://www.walloftext.ca/innovation-from-fringes/"
    },
    {
      "by": "8bitsrule",
      "descendants": 0,
      "id": 31964320,
      "score": 1,
      "time": 1656812911,
      "title": "Scientists decipher, catalog the diverse origins of Earth's minerals",
      "type": "story",
      "url": "https://www.eurekalert.org/news-releases/955683"
    },
    {
      "by": "LosMyke",
      "descendants": 0,
      "id": 31964316,
      "score": 1,
      "time": 1656812858,
      "title": "Why gamers will win the next war",
      "type": "story",
      "url": "https://mwi.usma.edu/why-gamers-will-win-the-next-war/"
    },
    {
      "by": "dksl",
      "descendants": 0,
      "id": 31964301,
      "score": 1,
      "time": 1656812735,
      "title": "Show HN: DatabaseMesh for distributed transaction、read write splitting、sharding",
      "type": "story",
      "url": "https://github.com/CECTC/dbpack"
    },
    {
      "by": "monroewalker",
      "descendants": 0,
      "id": 31964285,
      "score": 1,
      "text": "Assuming you&#x27;ve already bootRun or compiled once and are starting the app again, what&#x27;s your startup time? I&#x27;m currently working on an app where it&#x27;s taking ~30 seconds to get started and wondering what the lower bound could look like with the proper optimizations. I&#x27;m generally happy with Spring Boot + Kotlin but find it hard to cope with the turn around time for updates to take effect. With spring boot dev tools enabled, the hot reloading seems to take about 10 seconds. Might not be all that long objectively or compared to how long it used to take, but it certainly feels slow relative to backends in JS, Python, Ruby, etc.",
      "time": 1656812561,
      "title": "Ask HN: How fast is your Spring Boot startup time?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31964281,
      "score": 1,
      "time": 1656812544,
      "title": "iPod Touch Prototype – First Generation (PVT Stage) – Engineering Testing Unit",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=bia82GyypSE"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31964248,
      "score": 1,
      "time": 1656812236,
      "title": "Achieving period-correct graphics in personal computer emulators: The Amiga",
      "type": "story",
      "url": "https://blog.johnnovak.net/2022/04/15/achieving-period-correct-graphics-in-personal-computer-emulators-part-1-the-amiga/"
    },
    {
      "by": "digital79",
      "descendants": 0,
      "id": 31964243,
      "score": 1,
      "time": 1656812170,
      "title": "Reasons to learn JavaScript In 2022 and beyond",
      "type": "story",
      "url": "https://polypad.io"
    },
    {
      "by": "digitcatphd",
      "descendants": 0,
      "id": 31964234,
      "score": 1,
      "text": "The book &#x27;Think and Grow Rich&#x27; is partially premised on a person&#x27;s thoughts influencing her environment by altering the &#x27;ether&#x27; that surrounds it.<p>This, he later extends to directly making arguments for telepathy, even citing a scientific study claiming to conclusively demonstrate telepathy.<p>I found the basis of his book to be true, ultra successful people do seem to have a level of obsession and drive influence over every action, which led me to question the scientific basis of it, which seems today to be various laws of quantum mechanics.<p>If one accepts that the laws of quantum mechanics influence matter undetectable to humans (e.g. our sensory perception does not interpret the &#x27;frequency&#x27;) There is evidence of this in nature, commonly represented by the feeling one gets if another person is watching them.<p>The book implies human brains are able to communicate some degree of information through what today I suspect we refer to as quantum entanglement. Humans, as a species, potentially primarily communicated this way before language developed and has been slowly removed from the human evolution tree as was replaced with brain more configured for verbal language.<p>In a separate case, there are instances people cite positive and negative energy &#x27;vibes&#x27; which one may argue are also evolutionary communication mechanisms, possibly developed to detect threats or mating. This is more present likely because these traits are still useful today. This may be influenced by a body&#x27;s quantum field or some other quantum event releasing information. Mammals communicate differently. For instance, dogs primarily use scent to detect the same threat or mating signals, something humans are not evolutionarily equipped to do.<p>In perhaps its most controversial claim, the book seems to imply the possibility of being clairvoyant, citing instances of impending danger or even opportunity. At the time of the writing, did not understand the laws of quantum mechanics. Today, these rules are aligned with our elementary understanding of time as a dimension. If the universe is deterministic, which is an implied possibility with our understanding of time as a dimension, then knowledge of these future events would be one of many other dimensions humans do not have the evolutionarily capability to sense, possibility because its evolutionary value was limited compared to the body&#x27;s energy being applied to  alternative senses.<p>However, Darwin argued novel evolutionary traits are potentially 1 in 1 M or more, which if were true, suggests that clairvoyance is actually a rare trait of an early trait for detecting alternate dimensions, similar to that of the early teeth of a shark or eyes of an amphibian.<p>Im not implying these these are true, but it is interesting to see how they formed several arguments describing events today we have a more sophisticated understanding of.",
      "time": 1656812078,
      "title": "Harnessing telepathy using quantum mechanics",
      "type": "story"
    },
    {
      "by": "nobody9999",
      "descendants": 1,
      "id": 31964222,
      "kids": [
        31964228
      ],
      "score": 1,
      "time": 1656811885,
      "title": "New York Environmental Regulators Deny Greenidge’s Power Plant Permit",
      "type": "story",
      "url": "https://www.coindesk.com/business/2022/06/30/new-york-environmental-regulators-deny-greenidges-power-plant-permit/"
    }
  ]
}