{
  "stories": [
    {
      "by": "dtx1",
      "descendants": 0,
      "id": 30975719,
      "score": 1,
      "time": 1649584771,
      "title": "Can we UN-DELETE a lost Pokémon – 15 years after its death?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=XqgmR1Hqvbk"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30975703,
      "score": 1,
      "time": 1649584549,
      "title": "The Truman Doctrine: Beginnings of the Cold War [audio]",
      "type": "story",
      "url": "https://www.bbc.co.uk/programmes/w3ct38s4"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 30975614,
      "score": 1,
      "time": 1649583359,
      "title": "False Futurism",
      "type": "story",
      "url": "https://reallifemag.com/false-futurism/"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 30975613,
      "score": 2,
      "time": 1649583324,
      "title": "What science says: Could humans survive a nuclear war between NATO and Russia?",
      "type": "story",
      "url": "https://allianceforscience.cornell.edu/blog/2022/03/what-the-science-says-could-humans-survive-a-nuclear-war-between-nato-and-russia/"
    },
    {
      "by": "haunter",
      "descendants": 0,
      "id": 30975609,
      "score": 3,
      "time": 1649583255,
      "title": "Shanghai residents revolt over Covid lockdown: Videos shows mobs looting stores",
      "type": "story",
      "url": "https://www.dailymail.co.uk/news/article-10702811/Shanghai-residents-revolt-Zero-Covid-lockdown-Videos-shows-mobs-looting-stores-urgent-food.html"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 30975607,
      "score": 1,
      "time": 1649583242,
      "title": "Why I don't believe in long-term thinking",
      "type": "story",
      "url": "https://dynomight.net/longterm/"
    },
    {
      "by": "cconcepts",
      "descendants": 2,
      "id": 30975586,
      "kids": [
        30975707,
        30975706
      ],
      "score": 17,
      "text": "I have depended on Evernote for a long time without even realizing how much of a daily utility it is. It has been so seamless that I had forgotten I was rolling with the free version, until recently. I noticed a few UI changes which seemed a little unintuitive and some of my notes didn&#x27;t seem to sync as reliably between my phone and laptop. No biggie, I have gotten used to updates.<p>Then this week I was working through a new project on a customer&#x27;s site taking notes in Evernote as I normally do. I spent a good chunk of time going through the project onsite and making a comprehensive list of everything that would need to be done. I noticed the header on my note was grey but assumed it was a UI change. I had 4G reception on my phone and figured, even if something&#x27;s not quite right I can sync it up back at the office like I normally do as the note would be on my phone. So I proceeded like normal.<p>The whole note is gone as if it never existed.<p>Is this some sort of effort to onboard me to the paid version?\nHave I inadvertently clicked a &quot;yes I accept that the free version is going to become unreliable&quot; button?<p>I appreciate I am not a great customer - I have been using a free version for years without even thinking about it. But thats kind of the point, Evernote worked so well I never gave it a second thought.<p>Now I am not 100% sure on the safety of my notes...<p>What is other people&#x27;s experience? Have I just been caught napping because I mindlessly clicked an updated terms of use without reading it (as I do)?<p>If I go paid am I getting something as good as what the old Evernote was like?",
      "time": 1649582823,
      "title": "Ask HN: What Happened to Evernote?",
      "type": "story"
    },
    {
      "by": "rodrigo975",
      "descendants": 1,
      "id": 30975585,
      "kids": [
        30975678
      ],
      "score": 1,
      "time": 1649582818,
      "title": "Building Your Own FreeBSD-Based NAS with ZFS",
      "type": "story",
      "url": "https://klarasystems.com/articles/building-your-own-freebsd-based-nas-with-zfs/"
    },
    {
      "by": "A_No_Name_Mouse",
      "descendants": 0,
      "id": 30975583,
      "score": 1,
      "text": "I&#x27;m trying to get better at chess by solving chess problems on Chess.com and Lichess. All problems seem to be attack oriented, not defence. As a result in a chess match I constantly look for ways to attack my opponent, not to prevent an attack from my opponent. Why are chess puzzles not 50% about spotting and preventing attacks? Any advice to train that specifically?",
      "time": 1649582801,
      "title": "Ask HN: Why are chess problems attack oriented?",
      "type": "story"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 30975565,
      "score": 1,
      "time": 1649582576,
      "title": "Essential Guide to Feather Quill Pens",
      "type": "story",
      "url": "https://www.carlydrew.com/archive/2020/6/15/essential-guide-to-feather-quil-pens"
    }
  ]
}