{
  "stories": [
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 30268447,
      "score": 1,
      "text": "I was watching Airplane and one of the gags in it is that while the plane was crashing the passengers are watching a movie where the plane crashes in a fiery explosion. I think the effects of big distribution model changes (e.g. VHS &amp; DVDs at rental places, then redbox, then just streaming) have shifted the business model of the industry, but have there been other more niche things that shape what gets produced? For instance, are there fewer movies that feature plane crashes because they won&#x27;t get picked up by airlines to be shown on their planes?",
      "time": 1644377706,
      "title": "How have distribution changes shaped the movie industry over time?",
      "type": "story"
    },
    {
      "by": "propter_hoc",
      "descendants": 0,
      "id": 30268434,
      "score": 1,
      "text": "I run a smallish but growing, largely bootstrapped Fintech SaaS company. For whatever reason, we seem to have tripped some kind of VC attention radar and I now get 2-3 emails a day from VC analysts trying to speak with me. I generally politely decline and say I&#x27;m not raising now (truth is, I&#x27;d rather be profitable than raise VC anyway).<p>What should I be doing with all these emails? Is it worth replying to these folks? Are analysts even going to be in a position to help me if I did want to raise?<p>Thanks for any advice!",
      "time": 1644377609,
      "title": "Ask HN: How to Deal with VC Spam?",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30268422,
      "score": 1,
      "time": 1644377522,
      "title": "Joel Coen's “The Tragedy of Macbeth”, Reviewed by Ethan Coen",
      "type": "story",
      "url": "https://imightbewrong.substack.com/p/joel-coens-the-tragedy-of-macbeth"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 30268403,
      "score": 1,
      "time": 1644377299,
      "title": "Fluke",
      "type": "story",
      "url": "https://www.collaborativefund.com/blog/fluke/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30268369,
      "score": 2,
      "time": 1644377006,
      "title": "Prevalence and Durability of SARS-CoV-2 Antibodies Among Unvaccinated US Adults",
      "type": "story",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/2788894"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 30268358,
      "kids": [
        30268442
      ],
      "score": 1,
      "time": 1644376933,
      "title": "Rare kinds of coffee, wine, and other foods could go extinct",
      "type": "story",
      "url": "https://www.vox.com/down-to-earth/22906478/food-diversity-extinction-dan-saladino"
    },
    {
      "by": "GetJump",
      "descendants": 0,
      "id": 30268324,
      "score": 3,
      "text": "Getting ghosted or rejected only because of our current location and timezone is kinda frustrating. So we&#x27;ve decided to create this post to lookup for location agnostic, truly distributed companies. Which also can benefit digital nomads out there.<p>Please only post if you are not rejecting candidates based on timezone where they are currently at. Remote positions only.<p>Please only post if you personally are part of the hiring company—no recruiting firms or job boards. Only one post per company. If it isn&#x27;t a household name, please explain what your company does.<p>Commenters: please don&#x27;t reply to job posts to complain about something. It&#x27;s off topic here.",
      "time": 1644376632,
      "title": "Ask HN: Who is hiring independently of candidate location? (February 2022)",
      "type": "story"
    },
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 30268309,
      "score": 1,
      "time": 1644376481,
      "title": "Unethical human experimentation in the United States",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Unethical_human_experimentation_in_the_United_States"
    },
    {
      "by": "terrycody",
      "descendants": 0,
      "id": 30268261,
      "score": 1,
      "time": 1644376194,
      "title": "The West already monopolized scientific publishing. Covid made it worse",
      "type": "story",
      "url": "https://qz.com/2116375/covid-has-deepened-the-wests-monopoly-of-science-publishing/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30268243,
      "score": 1,
      "time": 1644376028,
      "title": "Giving to Freely Given Software – The Why",
      "type": "story",
      "url": "https://michaelscepaniak.com/2020s/giving-to-freely-given-software-the-why/"
    }
  ]
}