{
  "stories": [
    {
      "by": "iam-TJ",
      "descendants": 0,
      "id": 30576153,
      "score": 1,
      "text": "In comments on forums, Twitter, Telegram, and many other text based services, I&#x27;ve seen a lot of requests&#x2F;demands for translations of Ukrainian and Russian language content.<p>There&#x27;s a Mozilla Firefox add-on &quot;Translate Web Pages&quot; by Filipe Ps [0] available on Github [1] I&#x27;ve been using since the beginning of hostilities to automatically translate, and check existing English translations, of Ukrainian news web-sites, Twitter threads, etc.<p>Originally the Yandex engine worked but lately seems to be less useful - not sure if that is due to some interference on the Yandex side for Ukrainian translation or a side-effect of the sites I read. The Google engine continues to work reasonably.<p>The result sometimes needing a little mental gymnastics to help decode into a colloquial style.<p>Here&#x27;s a few of the Ukrainian language news and mapping web sites I read:<p>https:&#x2F;&#x2F;liveuamap.com&#x2F;en&#x2F;  = really good for geo-locating stories on map with links to original sources<p>https:&#x2F;&#x2F;www.pravda.com.ua&#x2F;news&#x2F; = natively Ukraine&#x2F;Russian&#x2F;English<p>https:&#x2F;&#x2F;www.epravda.com.ua&#x2F;news&#x2F; = economic news (Special Financial Operation - SPOs - aka Sanctions!)<p>https:&#x2F;&#x2F;www.ukrinform.net&#x2F;rubric-ato  = Natively Ukraine&#x2F;Russian&#x2F;English&#x2F;Spanish&#x2F;German&#x2F;French&#x2F;Japanese&#x2F;Polish<p>https:&#x2F;&#x2F;www.5.ua&#x2F;novyny&#x2F; = Channel 5 TV<p>https:&#x2F;&#x2F;prm.ua&#x2F;news&#x2F; = Direct TV<p>https:&#x2F;&#x2F;censor.net&#x2F;ua&#x2F;news&#x2F;all = Censor Net<p>https:&#x2F;&#x2F;war.ukraine.ua&#x2F; = Ukraine government news<p>https:&#x2F;&#x2F;tvzvezda.ru&#x2F; = Russian defence ministry<p>[0] https:&#x2F;&#x2F;addons.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;addon&#x2F;traduzir-paginas-web&#x2F;<p>[1] https:&#x2F;&#x2F;github.com&#x2F;FilipePS&#x2F;Traduzir-paginas-web",
      "time": 1646557738,
      "title": "Automatic in-browser Ukrainian text translation and local news sources to follow",
      "type": "story"
    },
    {
      "by": "EvgeniyZh",
      "descendants": 0,
      "id": 30576149,
      "score": 2,
      "time": 1646557660,
      "title": "“Vulva Spaceship” aims to counter prevalence of phallic spacecraft",
      "type": "story",
      "url": "https://www.dezeen.com/2022/03/03/vulva-spaceship-design-aims-to-counter-prevalence-of-phalluses/"
    },
    {
      "by": "djood",
      "descendants": 0,
      "id": 30576147,
      "score": 1,
      "time": 1646557631,
      "title": "Using Stack Overflow for Education in a Computer Science Bachelor Programme",
      "type": "story",
      "url": "https://dl.acm.org/doi/abs/10.1145/3478432.3499046"
    },
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 30576132,
      "score": 1,
      "text": "Before modern nation-states, we had empires and cities. Empires would simply conquer cities top-down. (I don&#x27;t agree we didn&#x27;t have nation-states before. The Bible for example describes the 12 tribes of Israel being united, as well as lots of other nation-states around them: Midian had cities, Philistines had the pentapolis, etc.)<p>But imagine if each neighborhood could pay for a free market of police agencies. The police agency would train local people to learn local laws and enforce them. If the agency and its tactics were too brutal or too ineffective, the neighborhood would simply give next year&#x27;s tonract to their competitors.<p>I think the same approach should be done with cities choosing the countries bottom-up. The UN could simply extend self-determination to cities and regions, allowing e.g. Lugano in Switzerland to join Italy if they felt it was in their best interests. Or Hong Kong could choose to secede from Mainland China. Then we wouldn&#x27;t have these stupid wars. Most wars start because some separatists (or armed opposition to the central government) seize a chance for their cities to leave the larger polity or federation. (Perhaps demographics changed, or there is a constitutional crisis, or another war.) Kurds, Basques, Catalonians, etc. are all looking for such an opportunity. If the UN recognized the self-determination of cities, then any armed gangs would just be arrested as criminals, by the city&#x27;s own police, since the city can simply vote democratically, there is no need for violence.<p>Instead, the revolution is usually nipped in the bud by violent arrests (e.g. in Catalonia by Spain, or Hong Kong by China) but once in a while, a larger country helps these separatists because of ethnic ties, or because of geopolitical interests (e.g. to keep the host country destabilized and weak). So you get a protracted war for many years, while the civilian population faces a humanitarian crisis. We have seen such things in Yemen, Syria. Rather than meeting up and holding diplomatic talks (like Iran and Saudis are finally doing) the two countries just keep throwing weapons at the region from both sides.<p>In Ukraine, this is like a matreshka doll[1] of this exact phenomenon on several levels:<p><pre><code>  1. Donetsk vs Ukraine  (to combat Donetsk distancing from Ukraine, but Donetsk is armed by Russia endlessly)\n\n  2. Ukraine vs Russia  (to combat Ukraine&#x27;s distancing from Russia, will be armed by US+EU endlessly)\n\n  3. Russia vs West    (to combat Russia&#x27;s naked imperialism distancing from Western Democracy, crippling sanctions)\n\n  4. West vs East       (Russia+China+India+Pakistan+Belarus+Kazakhstan etc.) build their own SWIFT, exit US hegemony\n</code></pre>\nIn each n+1 escalation, the same dynamics occur: the very use of force by a stronger power, to leverage its current dominance in the conflict, results in an even stronger power entering the conflict on the other side, and ultimately the severing of so much work of unification that was done in years prior.<p>[1] Yes I realize the matreshka is a Russian symbol not Ukrainian.",
      "time": 1646557357,
      "title": "Self-Determination for Cities can avert wars and crises in Ukraine, elsewhere",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 30576114,
      "score": 1,
      "time": 1646557100,
      "title": "Aspirin",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Aspirin"
    },
    {
      "by": "_ttg",
      "descendants": 0,
      "id": 30576109,
      "score": 2,
      "time": 1646556951,
      "title": "Pair Programming Antipatterns",
      "type": "story",
      "url": "https://tuple.app/pair-programming-guide/antipatterns"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30576103,
      "score": 1,
      "time": 1646556831,
      "title": "Russia-Ukraine War: What Happened March 5",
      "type": "story",
      "url": "https://text.npr.org/1084770677"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 30576101,
      "score": 1,
      "time": 1646556794,
      "title": "Lift's new lightweight eFoil promises newcomers a smoother ride",
      "type": "story",
      "url": "https://newatlas.com/marine/lift3-efoil/"
    },
    {
      "by": "tux1968",
      "descendants": 1,
      "id": 30576095,
      "kids": [
        30576123
      ],
      "score": 2,
      "time": 1646556752,
      "title": "Debug Adapter Protocol",
      "type": "story",
      "url": "https://microsoft.github.io/debug-adapter-protocol/overview"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30576069,
      "score": 1,
      "time": 1646556367,
      "title": "Information Operations – Twitter Transparency Center (2021)",
      "type": "story",
      "url": "https://transparency.twitter.com/en/reports/information-operations.html"
    }
  ]
}