{
  "stories": [
    {
      "by": "aspyct",
      "descendants": 0,
      "id": 29712129,
      "score": 1,
      "text": "Word of warning for backblaze users: it will keep backing up even if your computer is on a metered connection. Just cost me a lot of money...",
      "time": 1640685595,
      "title": "Tell HN: Backblaze backing up on a metered network",
      "type": "story"
    },
    {
      "by": "ceeb",
      "descendants": 0,
      "id": 29712118,
      "score": 1,
      "time": 1640685479,
      "title": "Is It Time for the JavaScript Temporal API?",
      "type": "story",
      "url": "https://blog.openreplay.com/is-it-time-for-the-javascript-temporal-api/"
    },
    {
      "by": "beermonster",
      "descendants": 0,
      "id": 29712107,
      "score": 1,
      "time": 1640685370,
      "title": "A man who was raised by wolves",
      "type": "story",
      "url": "https://www.theguardian.com/news/2018/aug/28/how-to-be-human-the-man-who-was-raised-by-wolves"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29712098,
      "score": 2,
      "time": 1640685239,
      "title": "Please don't use Discord for FOSS projects",
      "type": "story",
      "url": "https://drewdevault.com/2021/12/28/Dont-use-Discord-for-FOSS.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29712093,
      "score": 1,
      "time": 1640685224,
      "title": "Distributed Hash Table",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Distributed_hash_table"
    },
    {
      "by": "hidden-spyder",
      "descendants": 0,
      "id": 29712089,
      "score": 1,
      "time": 1640685181,
      "title": "Ask HN: What technology has changed your life that is relatively underused?",
      "type": "story"
    },
    {
      "by": "beermonster",
      "descendants": 0,
      "id": 29712085,
      "score": 1,
      "time": 1640685121,
      "title": "Police crack mafia's sheep-farming code",
      "type": "story",
      "url": "https://www.theguardian.com/world/2015/aug/03/police-arrest-sicilian-mafia-message-code-italian-denaro"
    },
    {
      "by": "AbbeFaria",
      "descendants": 0,
      "id": 29712075,
      "score": 1,
      "text": "Hi HN community,\nNeed some help in a predicament I am facing in my job hunting. I have on-site interviews ongoing with 6-7 companies but I have received an offer from a startup, bit unsure what to do here.<p>1. The startup offer is good compensation wise but it has a rider that I have to undergo a 6-month probation period (I am working in India). I honestly don&#x27;t know what to do here. When I was employed at my previous employer, I had no such condition. And from some Google-fu, I can only see that this is common in IT services based companies (TCS, Infosys etc). The startup is paying good money but its this probation period clause that is ringing alarm bells for me. Also, the tech interview process for the startup was a breeze for me. Didn&#x27;t get grilled technically that much, compared to some FAANG companies. Also, said startup is paying me what I was getting at my earlier employer, none of the fringe benefits though, its all cold-hard cash.<p>2. I really don&#x27;t want to do this but what If I take the startup&#x27;s offer since I can join a bit late and by that time I should have some onsites over so I could pick then best employer for me. I feel that with the probation period clause they are giving both of us a &quot;parachute&quot; in that either one of us can exit if it doesn&#x27;t work out for us.<p>3. Anyone working at a tech startup (helps if you are an Indian one!), can you please explain the rationale behind having a probation period clause. Is it common amongs Indian startups or startups in general ? This startup is &lt;100 person and couple of years old. The employment contract is suspiciusly mum on any details about the probation period. Just says, that the probation period is 6 months from joining.<p>Right now, I am not working but was previously employed as an SDE in BigTech. So I am aggressively looking to be employed.",
      "time": 1640685021,
      "title": "Ask HN: Should I join a startup that has a probation period for new employees.",
      "type": "story"
    },
    {
      "by": "homarp",
      "descendants": 0,
      "id": 29712068,
      "score": 2,
      "time": 1640684914,
      "title": "HiFi-GAN: Generative Adversarial Networks for Efficient and Hi-Fi Speech Synth",
      "type": "story",
      "url": "https://github.com/jik876/hifi-gan"
    },
    {
      "by": "captn3m0",
      "descendants": 0,
      "id": 29712054,
      "score": 1,
      "time": 1640684716,
      "title": "Immudb: A Lightweight, Performant Immutable Database [pdf]",
      "type": "story",
      "url": "https://codenotary.s3.amazonaws.com/Research-Paper-immudb-CodeNotary_v3.0.pdf"
    }
  ]
}