{
  "stories": [
    {
      "by": "pionar",
      "descendants": 0,
      "id": 30543006,
      "score": 1,
      "time": 1646324665,
      "title": ".NET Myths Dispelled – Celebrating 21 Years of .NET",
      "type": "story",
      "url": "https://blog.devgenius.io/6-net-myths-dispelled-celebrating-21-years-of-net-652795c2ea27"
    },
    {
      "by": "LucasLanglois",
      "descendants": 0,
      "id": 30542995,
      "score": 1,
      "text": "Hi HN,<p>We&#x27;ve just released the first open-source version of our model serving tool Inferrd. Our goal is making model deployment a breeze with:<p>Maintenance-free environments. Just drag and drop your models, and get an API.<p>Your data staying in your cloud. Have full control over where you send your data, and how it&#x27;s processed.<p>No more security compliance process to go through as Inferrd is self-hosted.<p>No more pricing indexed on volume, as cloud-based solutions offer.<p>You can host Inferrd on your own cloud at github.com&#x2F;inferrd or check out our managed version at Inferrd.com<p>This is the first version supporting SciKit, TensorFlow and ONNX. We&#x27;re super eager for feedback to improve it and start serving more framework with more advanced features !",
      "time": 1646324644,
      "title": "Creating the new open-source standard to deploy ML models",
      "type": "story"
    },
    {
      "by": "lovingCranberry",
      "descendants": 0,
      "id": 30542975,
      "score": 1,
      "text": "I always find me setting up typescript by hand when creating a new project.<p>This includes writing a nodemon-startup script in ``package.json``, setting an export for ``dist&#x2F;index.js``, setting the type to module, tweaking ``tsconfig.json`` to support ES2020 or newer etc.<p>Is there any sane boiler plate which you use? For next.js, CRA and other web framework stuff countless typescript boilerplates exist, but I have yet to find anything which works for &quot;normal&quot; node.js projects.",
      "time": 1646324498,
      "title": "Ask HN: How do you set up a new TypeScript project for Node.js?",
      "type": "story"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30542966,
      "score": 1,
      "time": 1646324460,
      "title": "Ion Thursters: not just for Tie Fighters anymore",
      "type": "story",
      "url": "https://hackaday.com/2022/03/03/ion-thrusters-not-just-for-tie-fighters-anymore/"
    },
    {
      "by": "MattGaiser",
      "descendants": 0,
      "id": 30542964,
      "score": 1,
      "time": 1646324434,
      "title": "Europe can cut natural gas imports from Russia significantly within a year",
      "type": "story",
      "url": "https://www.iea.org/news/how-europe-can-cut-natural-gas-imports-from-russia-significantly-within-a-year"
    },
    {
      "by": "eloff",
      "descendants": 0,
      "id": 30542955,
      "score": 2,
      "text": "I&#x27;m pretty discouraged, I&#x27;m 37 and I&#x27;ve tried numerous attempts over the last 20 years to start a software business as a solo founder and none have worked. I&#x27;ve been working part-time to cover the bills while I work on creating the software I hoped to turn into business. My wife and I plan to start a family in the next two years, and I need to start getting serious here for my family&#x27;s future. The industry is really hot right now, and I can make great money if I just get a full-time job.<p>I&#x27;m building a programmable PostgreSQL proxy in Rust. The idea is to make it easy to consume the replication stream so it can do query caching with automatic invalidation, and so that people can build custom partitioning, caching, or real-time features on top of PostgreSQL. The proxy part is implemented, but there&#x27;s still a lot of work to add the replication and caching features, and to test and polish everything to production standards - databases are serious business. The project is on github here: https:&#x2F;&#x2F;github.com&#x2F;riverdb&#x2F;riverdb<p>I don&#x27;t even know if this is something people would want or pay for if I completed it. And then there&#x27;s the task of marketing&#x2F;selling it, which is way outside of my skillset.\nShould I just give up (grow up?) and get a job? Is it worth pressing on here? I&#x27;m not consuming my savings, but neither am I making financial progress, and I&#x27;m not getting any younger.",
      "time": 1646324391,
      "title": "Ask HN: Should I give up and get a job?",
      "type": "story"
    },
    {
      "by": "waterchiller",
      "descendants": 0,
      "id": 30542954,
      "score": 1,
      "time": 1646324387,
      "title": "How to Pitch Big News: Embargo vs. Exclusive",
      "type": "story",
      "url": "https://www.prguy.io/blog/embargo-vs-exclusive-how-to-pitch-news"
    },
    {
      "by": "lopkeny12ko",
      "descendants": 0,
      "id": 30542953,
      "score": 3,
      "text": "Hi HN. I am at my wit&#x27;s end so I&#x27;m asking here. In the last few years, nearly half of all my online accounts for a variety of different services have been either restricted or banned for no reason. I have no idea what I could possibly be doing &quot;wrong&quot; here so I&#x27;m asking HN for help.<p>* Lyft. Got a generic error when requesting a ride, which told me to contact support. I contacted support and they said my account was suspended due to violation of ToS with fradulent activity. I asked exactly what they think I did to violate ToS and they would not tell me. I&#x27;ve taken hundreds of 5-star rides, never comitted any fraud, I don&#x27;t drive for Lyft or even know anyone who does. To this day I still don&#x27;t know what I did &quot;wrong.&quot;<p>* Instagram. Signed up for an account a couple years ago. Followed some celebrities and friends. A week later when I try to login, it errors saying my account has been suspended with no reason and recourse for recovery. I made another account. Banned again after a couple of days. Now, whenever I try to make a new account, the SMS verification never passes. It is like they have blacklisted my IP address.<p>* Letgo. It&#x27;s like Craiglist. I moved within San Francisco a few years ago and signed up for an account to get rid of some furniture that I would not be taking with me. Within a few days I couldn&#x27;t login and support told me my account was banned due to fradulent activity. All I did was create a listing for a couch with some pictures! I hadn&#x27;t even gotten responses to the post.<p>* Google. I tried logging in to an old account associated with some domains in Webmaster Tools. That&#x27;s all I use this account for and I haven&#x27;t logged in in years. I enter in the right password and am greeted with &quot;You’re trying to sign in on a device Google doesn’t recognize, and we don’t have enough information to verify that it’s you. For your protection, you can’t sign in here right now. Try again from a device or location where you’ve signed in before.&quot;. What am I supposed to do here? Last I used this account has at an old address (different IP) and on a computer that has since been retired (motherboard swapped out, OS reinstalled).<p>* Twitter. I created an account several years ago. After a week when I logged in it said my account was restricted and asked me to enter a phone number for SMS verification. I complied, and even after entering the correct code, it errored saying it cannot verify my identity. Haven&#x27;t used Twitter since.<p>* Fidelity. This morning I tried to log in to my investment account and it says my account has been blocked &quot;for security reasons&quot; with no other information or explanation. It says I have to call Fidelity. Over the phone they asked me to supply a ton of documents over fax for identity verification and a record of all the devices I&#x27;ve ever used to sign into Fidelity. They won&#x27;t even tell me why my account was blocked in the first place.<p>This is endlessly frustrating. There must be <i>something</i> unique about either me or my devices. I have a regular residental ISP in San Francisco, I&#x27;m not using Tor or VPNs, I use a vanilla Mac with Firefox. I use an adblocker (uBlock) but so does everyone else. I have a bog-standard Samsung phone running bog-standard unmodified Android.<p>Does HN know why my accounts keep getting banned? Especially for those who work on identity&#x2F;trust and safety teams in Silicon Valley who have inside knowledge of how this works.",
      "time": 1646324383,
      "title": "Ask HN: Why do my online accounts keep getting banned?",
      "type": "story"
    },
    {
      "by": "aiallthewaydown",
      "descendants": 0,
      "id": 30542952,
      "score": 2,
      "time": 1646324382,
      "title": "Ask HN: What are today’s tech sub-cultures?",
      "type": "story"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 30542939,
      "score": 1,
      "time": 1646324333,
      "title": "Running amd64 Docker images with Podman on Apple Silicon",
      "type": "story",
      "url": "https://edofic.com/posts/2021-09-12-podman-m1-amd64/"
    }
  ]
}