{
  "stories": [
    {
      "by": "EspadaV9",
      "descendants": 0,
      "id": 32201207,
      "score": 1,
      "time": 1658561360,
      "title": "Gitlab 15.2 released. Live wiki diagram previews,redesigned merge request report",
      "type": "story",
      "url": "https://about.gitlab.com/releases/2022/07/22/gitlab-15-2-released/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32201203,
      "score": 1,
      "time": 1658561315,
      "title": "Leon Trotsky: Why Marxists Oppose Individual Terrorism (1911)",
      "type": "story",
      "url": "https://www.marxists.org/archive/trotsky/1911/11/tia09.htm"
    },
    {
      "by": "mullikine",
      "descendants": 1,
      "id": 32201198,
      "kids": [
        32201199
      ],
      "score": 1,
      "time": 1658561286,
      "title": "How to draw a picture with GPT-3 and DALL-E-2",
      "type": "story",
      "url": "https://mullikine.github.io/posts/how-to-draw-a-picture/"
    },
    {
      "by": "kazinator",
      "descendants": 0,
      "id": 32201150,
      "score": 2,
      "text": "See: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32190032\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32190032</a><p>This was written in about the past hour or so; it has no documentation or test cases yet. Think twice before relying on it in production.<p>The idea is that we can perform a detailed validation of the trustworthiness of an absolute or relative path, as a simple function that can be reused anywhere: I call this function safepath_check.<p>A trustworthy path is one whose meaning cannot be changed by a third party: another user who isn&#x27;t root.<p>The path is therefore immune, for instance, to TOCtoTOU security problems, like the insertion of a symbolic link or other tampering.<p>A trustworthy path is allowed to contain symbolic links. Symbolic links can be validated to be safe. To that end, safepath_check performs its own symlink resolution, to ensure that every link resolution step substitutes path material that is trustworthy.",
      "time": 1658560597,
      "title": "Show HN: Code in Response to “The Trouble with Symlinks.”",
      "type": "story",
      "url": "https://www.kylheku.com/cgit/safepath/about/"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 32201145,
      "score": 2,
      "time": 1658560500,
      "title": "This week in KDE: Tons of UI improvements and bugfixes",
      "type": "story",
      "url": "https://pointieststick.com/2022/07/22/this-week-in-kde-tons-of-ui-improvements-and-bugfixes/"
    },
    {
      "by": "317070",
      "descendants": 0,
      "id": 32201137,
      "score": 1,
      "time": 1658560431,
      "title": "Comité Liquidant Ou Détournant Les Ordinateurs (C.L.O.D.O.) (1983)",
      "type": "story",
      "url": "https://theanarchistlibrary.org/library/le-clodo-clodo-speaks?v=1642397481"
    },
    {
      "by": "goindeep",
      "descendants": 0,
      "id": 32201126,
      "score": 1,
      "time": 1658560312,
      "title": "Google Fires Engineer Who Claimed Company's AI Is Sentient",
      "type": "story",
      "url": "https://www.theverge.com/2022/7/22/23274958/google-ai-engineer-blake-lemoine-chatbot-lamda-2-sentience"
    },
    {
      "by": "dinobones",
      "descendants": 0,
      "id": 32201115,
      "score": 1,
      "text": "This may be a naive question, but...<p>Cloud-first costs a lot of money. If your startup is doing something compute heavy, like ML or serving a lot of bandwidth, you&#x27;re going to have to pay boatloads just to even serve low DAU.<p>I&#x27;ll give an example:<p>Imagine you wanted to recreate some video upload&#x2F;streaming app. Fastly charges $0.12&#x2F;gb, AWS charges $0.05&#x2F;gb (and this is me being generous, they only give you this rate <i>after</i> 150tb&#x2F;month of volume).<p>1080p video uses about 25mb a minute. That means streaming a 5 minute video will use about 125mb of bandwidth, ~1&#x2F;10th of a gigabyte, meaning just to stream a 5 minute 1080p video, at the bare minimum you have just spent $0.005. If this video gets 10,000 views, that is a $50 video.<p>I realize that&#x27;s a fairly contrived scenario, and I&#x27;m going to be bombarded by people telling me X CDN offers Y bandwidth for cheaper or for much better price (spoiler alert: They don&#x27;t. CDNs like Cloudflare actually don&#x27;t allow dynamically generated user content or media).<p>I&#x27;ve rambled on my example enough. Bandwidth costs a lot of money, especially in the cloud world. But I&#x27;m sure I could setup some racks in various metros and pay way less than what I would have to on the cloud.<p>Whenever I see this mentioned on HN, people bring out their pitchforks. &quot;But... Cloud is cheaper!!! Infra is cheap! Engineers are expensive!!&quot; Yeah, I agree, in <i>most</i> scenarios, but there are some cases where cloud costs are just too ravaging to bear.<p>TLDR: The cloud-first culture is probably prohibiting a lot of startup ideas. I know I personally have not pursued some ideas just cause I know the infra costs would be gnarly. I don&#x27;t think the next TikTok, YouTube, or whatever could be bootstrapped, even with a $500k seed round, if you experience any volume of users that will be eaten away quickly.",
      "time": 1658560242,
      "title": "Ask HN: Do you think the “cloud-first” approach to startups is limiting?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 32201085,
      "score": 1,
      "time": 1658559851,
      "title": "World Fund joins $128M bet that quantum can deliver climate breakthroughs",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/22/climate-vc-world-fund-quantum-computing-iqm/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32201069,
      "score": 1,
      "time": 1658559669,
      "title": "Controlling the temperature inside equipment racks (2010) [pdf]",
      "type": "story",
      "url": "https://www.markertek.com/attachments/manuals/ThermalManagement.pdf"
    }
  ]
}