{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31400258,
      "score": 1,
      "time": 1652720393,
      "title": "Thoughts on CircuitPython2020",
      "type": "story",
      "url": "https://blog.thea.codes/thoughts-on-circuitpython-2020/"
    },
    {
      "by": "dash2",
      "descendants": 0,
      "id": 31400254,
      "score": 1,
      "time": 1652720369,
      "title": "Doubts about Viewpoint Diversity",
      "type": "story",
      "url": "https://wyclif.substack.com/p/doubts-about-viewpoint-diversity"
    },
    {
      "by": "mc4ndr3",
      "descendants": 0,
      "id": 31400246,
      "score": 1,
      "text": "First, note that each successive technical requirement, such as Ruby, git, or Jenkins, yields a unique combination of technical stacks. One company may substitute Python for Ruby, or Perforce for git, or GitHub Actions for Jenkins. As the number of technical requirements in a job posting grows, the likelihood of any candidate to have experience with the complete technology stack drops to zero. Even the most imminently qualified candidate is going to hit the 10% to 1% match mark, as the list of technologies grows and grows.<p>Recruiters do not always understand this. Managers who post such listings certainly do not understand this. The unfortunate young developer new to the hiring process almost certainly does not realize this. And yet the trend continues.<p>Technology is easy to learn. After all, technology has free tutorials available. Programming concepts are far more difficult to learn, hence why we have collegiate degrees. In the future, we can place a ceiling on our enthusiasm for the perfect candidate in terms of just a handful of technologies. And structure the interview questions so that they probe the candidate&#x27;s ability to reason about fundamental programming concepts. Instead of regurgitating (or lying) about tech familiarity.<p>&quot;But what about candidates with zero version control system experience, or zero CI&#x2F;CD experience, or zero (insert app language experience)?&quot;<p>That&#x27;s what 3-5 years experience in software engineering should already supply. Don&#x27;t restate your requirements twice.<p>In my experience, multiple jobs have strayed from their officially posted tech stack as time marches on. This is to be expected. Though no one bothers to update the job posting with the new details. Many still advertise Bush Jr. era buzzwords like &quot;SaaS&quot;, for example.<p>Yet other pernicious employers will straight up lie about technical stacks. I&#x27;ve taken more than one job that advertised Go coding but turned out to be Node.js. Go to hell.js. No individual in the hiring process, not the manager, the recruiter, nor the candidate, can act reliably on these overly detailed job postings.<p>And I&#x27;ve yet to find a job that didn&#x27;t pay lip service to Agile&#x2F;Scrum, it&#x27;s not worth the ink. Tell us what your company does. Tell us what makes your dev department special.",
      "time": 1652720320,
      "title": "A plea for more realistic job postings",
      "type": "story"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 31400198,
      "score": 1,
      "time": 1652720108,
      "title": "2022 SaaS Crash",
      "type": "story",
      "url": "https://mailchi.mp/6b739d73c3ad/meritech-insights-9029635?e=2f19e0e561"
    },
    {
      "by": "WaitWaitWha",
      "descendants": 0,
      "id": 31400194,
      "score": 1,
      "time": 1652720093,
      "title": "Metasurface-in-the-Middle Attack",
      "type": "story",
      "url": "https://dl.acm.org/doi/10.1145/3507657.3528549"
    },
    {
      "by": "aloukissas",
      "descendants": 0,
      "id": 31400190,
      "score": 1,
      "time": 1652720073,
      "title": "Figma Placeholder Magic",
      "type": "story",
      "url": "https://twitter.com/GK3/status/1526240646410797056"
    },
    {
      "by": "ekianjo",
      "descendants": 0,
      "id": 31400188,
      "score": 1,
      "time": 1652720069,
      "title": "Boosting a HP Z400 Workstation with a Modern GPU (GTX 1660 Ti)",
      "type": "story",
      "url": "https://boilingsteam.com/boosting-a-hp-z400-workstation-with-a-modern-gpu-gtx-1660-ti/"
    },
    {
      "by": "mthwl",
      "descendants": 0,
      "id": 31400166,
      "score": 2,
      "text": "Next year, my family is going to be relocating from the US to a country that drives on the left side of the road.<p>Anyone have experience making this transition (or the reverse)? Any tips or advice?<p>It&#x27;s an interesting change since it&#x27;s not easy to practice beforehand.",
      "time": 1652719984,
      "title": "Ask HN: Experiences learning to drive on the left?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31400110,
      "score": 2,
      "time": 1652719775,
      "title": "Eavesdroppers can hack some 6G frequency with easy DIY metasurface",
      "type": "story",
      "url": "https://news.rice.edu/news/2022/eavesdroppers-can-hack-6g-frequency-diy-metasurface"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31400094,
      "score": 1,
      "time": 1652719706,
      "title": "First plants grow in soil from the moon",
      "type": "story",
      "url": "https://www.futurity.org/moon-soil-plants-space-2739502/"
    }
  ]
}