{
  "stories": [
    null,
    null,
    {
      "by": "AdilZtn",
      "descendants": 0,
      "id": 31238130,
      "score": 1,
      "time": 1651512543,
      "title": "Cpad an alternative way to combine your commands",
      "type": "story",
      "url": "https://github.com/AmineZouitine/Cpad"
    },
    {
      "by": "gcheong",
      "descendants": 0,
      "id": 31238112,
      "score": 1,
      "time": 1651512470,
      "title": "A billion-dollar chip factory just opened in upstate New York",
      "type": "story",
      "url": "https://www.vox.com/recode/23048906/chip-shortage-manufacturing-america-biden"
    },
    {
      "by": "dbodin11",
      "descendants": 0,
      "id": 31238083,
      "score": 1,
      "text": "Hey, I’m Dave, the founder of Kontxt.io (https:&#x2F;&#x2F;www.kontxt.io). Engage directly on the web and save, organize, and share highlights and notes. Follow people. Join groups. And search content. Here’s a 2-minute demo (https:&#x2F;&#x2F;youtu.be&#x2F;Th4vaOzuGnU). It works on desktop and mobile.<p>The web layer is like Google-Doc collaboration on the entire web, and it’s connected to a web app that’s like a combo of DropBox to save and organize your findings, and Twitter&#x2F;Reddit to share and discover bite-sized article highlights with other people.<p>1.) The Social Web Layer has rich collaboration features with privacy and share controls: Inline highlights, tags, polls, comments, @mentions, deep-links to anything you add to the page, and navigation between parts. The web layer can be added to any site or PDF with a single line of javascript. This is done with a browser extension, bookmarklet, or added to a page directly by the site owner with the word-press plugin or hard-coded javascript.<p>2.) The CMS and Social Network lets you organize with folders that have privacy and share controls, a profile with your public highlights, a feed of highlights from people you follow, groups with feeds around topics, and the ability to search your content and what others share publicly.<p>For years, I had a long commute, so I read online a lot–from HN, of course. There’s too much to read everything, and you only know if an article is “worth-it” <i>after</i> you read it. Then it hit me. Highlights! 1.) On the page with navigation, 2.) visible before you open the link, and 3.) to increase quality and relevance, follow and search highlights by trusted people like friends, co-workers, university peers, and industry leaders.<p>There’s too much information and not enough time. Highlights are short, useful, and fast to read. Kontxt.io lets you direct attention to what matters. First, it lets you find quality sources from trusted people, then it lets you focus on the important parts of them. Kontxt basically turns the web into an interactive workspace so you can have rich web interactions with other Kontxt users. Or you can extract highlights into a shareable link and post it anywhere on the web–with analytics for what you share. Highlights are automatically saved to the CMS and based on their privacy settings, may be published to feeds in the social network for others to see. Naturally, you may want to discuss the same site with different people for disparate reasons, so you can create multiple highlight layers on a single site, each with Google-Doc-like sharing, privacy, and authorization controls.<p>It’s now evolved into a general communication and engagement platform for the web. Here’s how Kontxt has been used or where people expressed interest: social news aggregator, productivity, research &amp; planning (generally, and specifically for sales, law, &amp; finance), knowledge-base, training &amp; education, publisher inline-engagement system, etc.<p>Kontxt gets to the point fast. It brings collaboration directly to the web itself and is already part of your natural workflow since it&#x27;s always with you every click of the way. The social network is unique since it uses highlights to seed discussions. This has many benefits. Highlights mean people have actually read the article, the source is cited, and parts can’t be misconstrued because you have context. It’s also a human filter of the internet. A site is likely worthwhile if someone took the time to highlight it, and if someone found it useful, then someone “like” them probably will, too. Similarly, if someone’s not willing to highlight a site before they send it to you, it’s probably not worth your time. And highlights will increase how many people actually read what you send them because they’re short, useful, and fast to read.<p>I’m excited to share this with all of you. Thanks for your time. Please leave any feedback or questions in the comments. If you try it out, be sure to join the “Hacker News” group.",
      "time": 1651512364,
      "title": "Show HN: Social Web Layer with CMS and Social Network",
      "type": "story"
    },
    {
      "by": "ra7",
      "descendants": 0,
      "id": 31238079,
      "score": 1,
      "time": 1651512355,
      "title": "10-Year Treasury Yield Hits 3% for First Time Since 2018",
      "type": "story",
      "url": "https://www.wsj.com/articles/10-year-treasury-yield-hits-3-for-first-time-since-2018-11651511960"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 31238050,
      "score": 2,
      "time": 1651512238,
      "title": "Bhand",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bhand"
    },
    {
      "by": "nynyny7",
      "descendants": 0,
      "id": 31238001,
      "score": 3,
      "time": 1651511965,
      "title": "An Intro to x86_64 Reverse Engineering",
      "type": "story",
      "url": "https://nora.codes/tutorial/an-intro-to-x86_64-reverse-engineering/"
    },
    {
      "by": "makaimc",
      "descendants": 0,
      "id": 31237984,
      "score": 1,
      "time": 1651511894,
      "title": "MediaPipe for Dummies",
      "type": "story",
      "url": "https://www.assemblyai.com/blog/mediapipe-for-dummies/"
    },
    {
      "by": "Rperry2174",
      "descendants": 0,
      "id": 31237983,
      "score": 1,
      "time": 1651511893,
      "title": "Tracing a Single Operation in Distributed Systems",
      "type": "story",
      "url": "https://hazelcast.com/blog/tracing-a-single-operation-in-distributed-systems/"
    }
  ]
}