{
  "stories": [
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 30223919,
      "score": 1,
      "time": 1644084955,
      "title": "Controversial rent-free boat living in the Bay Area",
      "type": "story",
      "url": "https://www.sfgate.com/sf-culture/article/VICE-doc-explores-anchor-outs-16832332.php"
    },
    {
      "by": "jensneuse",
      "descendants": 1,
      "id": 30223855,
      "kids": [
        30223941
      ],
      "score": 3,
      "time": 1644084643,
      "title": "Show HN: WunderHub – The Package Manager for APIs",
      "type": "story",
      "url": "https://hub.wundergraph.com"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30223808,
      "score": 1,
      "time": 1644084389,
      "title": "All hail the absurd joy of Eurovision (2018)",
      "type": "story",
      "url": "https://www.cnn.com/2018/05/11/opinions/eurovision-what-europe-needs-james-ball-intl/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30223803,
      "score": 1,
      "time": 1644084380,
      "title": "Trek at 50: The quest for a unifying theory of time travel in Star Trek (2016)",
      "type": "story",
      "url": "https://arstechnica.com/gaming/2016/09/how-time-travel-works-in-star-trek/"
    },
    {
      "by": "throwawaysea",
      "descendants": 2,
      "id": 30223801,
      "kids": [
        30223865
      ],
      "score": 2,
      "time": 1644084375,
      "title": "Florida governor to investigate GoFundMe over Canada trucker donations",
      "type": "story",
      "url": "https://www.reuters.com/article/us-health-coronavirus-canada-trucking-go-idCAKBN2KA0H3"
    },
    {
      "by": "legrande",
      "descendants": 0,
      "id": 30223798,
      "score": 2,
      "time": 1644084349,
      "title": "First Recorded Usage of “Hacker”",
      "type": "story",
      "url": "https://manybutfinite.com/post/first-recorded-usage-of-hacker/"
    },
    {
      "by": "legrande",
      "descendants": 1,
      "id": 30223771,
      "kids": [
        30223883
      ],
      "score": 2,
      "text": "From my experience with the Software Center on Ubuntu, I have encountered many issues which I will outline here. Why is the Snap software center so buggy? I&#x27;m on version 18 of Ubuntu because version 20 of Ubuntu is incompatible with my laptop and crashes randomly, but the version 18 store should be smooth and non-buggy despite its legacy status. What&#x27;s going on?<p>- Most software is stuck on an older version and lags behind the latest release.<p>- Sometimes software hangs when installing. Gets stuck on 95% and stays that way, with no way to get it fully installed.<p>- Some of the comments on software are un-moderated and you read people trying to push a political agenda saying things like &#x27;This software is Marxist because it&#x27;s free&#x27;<p>- The Software Center is buggy as hell and constant error messages popup when trying to install software. (Yes I&#x27;ve done the update&#x2F;upgrade ritual before installing anything).<p>- Most software is lacking screenshots. I like to see what the UI looks like before I install.<p>- I often encounter the software I want flashing for three seconds on the screen, and then disappearing for no reason. The search functionality is broken.<p>- I sometimes see duplicate software packages, with one less popular version that has 1 star, and another with 4&#x2F;5 stars (guess which one I download and install?)",
      "time": 1644084164,
      "title": "Ask HN: Why is the Ubuntu Software Center so buggy?",
      "type": "story"
    },
    {
      "by": "eloff",
      "descendants": 0,
      "id": 30223766,
      "score": 2,
      "text": "I want backups for all data entering my system at the HTTP level. It happens fairly often in my career that the worst data loss bugs happen in ways where you&#x27;re not covered by backups. The data doesn&#x27;t get saved, validation goes amok, it gets saved them gets deleted. In all these cases having backups of the data as it enters the system would enable recovery of it.<p>Are there tools like this? It&#x27;s not enough to just save it, it would need to be searchable as well. The data may be sensitive so it would need to be encrypted too.",
      "time": 1644084149,
      "title": "Ask HN: How to log full HTTP requests",
      "type": "story"
    },
    {
      "by": "jdblair",
      "descendants": 0,
      "id": 30223739,
      "score": 3,
      "time": 1644084017,
      "title": "New July 17th Satellite Imagery Confirms Russia Produced Fake MH17 Evidence",
      "type": "story",
      "url": "https://www.bellingcat.com/news/uk-and-europe/2015/06/12/july-17-imagery-mod-comparison/"
    },
    {
      "by": "kozkozkoz",
      "descendants": 0,
      "id": 30223738,
      "score": 2,
      "text": "I&#x27;ve worked for corps and startups, everyone is building a fancy dashboards where the perfection is root cause analysis and the WHY made perfect.<p>It looks good of course, until its doesn&#x27;t.",
      "time": 1644084017,
      "title": "Ask HN: Why no one care about data quality?",
      "type": "story"
    }
  ]
}