{
  "stories": [
    {
      "by": "thesecretceo",
      "descendants": 0,
      "id": 30295060,
      "score": 1,
      "time": 1644539366,
      "title": "Apple to address AirTag stalking problem",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/10/apple-to-address-airtag-stalking-problem-with-upcoming-features/"
    },
    {
      "by": "simranjitk",
      "descendants": 0,
      "id": 30295029,
      "score": 1,
      "text": "DeliveryAssist will make you and your customers happier when it comes to setting local delivery costs. Shopify only allows you to set 5 delivery zones, which is very restrictive. If you want to charge the optimal price for each delivery, then you’ll want to ditch Shopify’s local delivery settings and use DeliveryAssist.<p>With DeliveryAssist, you can:<p><pre><code>    Create unlimited delivery zones\n    Set a base rate\n    Charge per kilometer&#x2F;mile\n    Have customers at specific distances contact you for more information\n</code></pre>\nUnlimited delivery zones:<p>With unlimited delivery zones, you never have to compromise when it comes to delivery charges. You can create ranges as big or small as you want.<p>Charging based on distance:<p>You can charge customer’s based on their exact distance from your location. This way, you can cover your cost per kilometer to deliver. You can also set a maximum distance where local delivery will be allowed. For example, $0.50 per kilometer up to a maximum of 100 kilometers.<p>Set a base rate:<p>DeliveryAssist lets you set a base rate for all deliveries, so this will be added to any other local delivery charges. This allows for any set costs on your end for delivery to always be covered, whether they are 1 kilometer or 100 kilometers away.<p>Have customers contact you if they are in a specific distance range:<p>When you are creating a delivery zone using DeliveryAssist, you can make it so that instead of being charged for delivery, they will instead have the option to contact you instead after the order has been placed. This can be useful if you want to delivery to further distances than you normally would but want to coordinate with the customer.<p>If you want help getting started with DeliveryAssist, you can email localdeliveryoptions@gmail.com and mention that you read about it on Hacker News. Our team will help you set it up on your store at NO EXTRA COST.",
      "time": 1644539237,
      "title": "Enhancing Local Delivery Using Shopify",
      "type": "story"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 30295025,
      "score": 1,
      "time": 1644539233,
      "title": "Exercise May Enhance the Effects of a Covid or Flu Shot",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/09/well/move/exercise-covid-flu-vaccine.html"
    },
    {
      "by": "p_mike_p",
      "descendants": 0,
      "id": 30294966,
      "score": 1,
      "text": "My co-founder and I used to be in the fintech space. We used Zendesk to answer customer support tickets. We found a few big shortcomings with Zendesk as we used it: (1) no good secured messaging&#x2F;PII masker to securely send KYC docs and ensure the info wasn&#x27;t seen by those that shouldn&#x27;t; (2) we hated tickets -- they felt transactional and we were running a company that was intended to have super long lifetime value, so a continuous feed would be preferable, and (3) it lacked an effective real-time collaboration interface a la Slack meaning we&#x27;d be talking tickets on Slack. We&#x27;re thinking more deeply now about what would make killer support software, especially for early-stage companies where moving and learning fast are necessary.<p>What say ye all!?",
      "time": 1644538902,
      "title": "Ask HN: What are you looking for in your ideal customer service platform?",
      "type": "story"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 30294922,
      "kids": [
        30294928
      ],
      "score": 1,
      "time": 1644538652,
      "title": "GitHub Removed Deprecation Notice for ECMAScript2020 Support",
      "type": "story",
      "url": "https://twitter.com/app4soft/status/1491923972430217229"
    },
    {
      "by": "arvindell",
      "descendants": 0,
      "id": 30294862,
      "score": 1,
      "time": 1644538363,
      "title": "Show HN: A CLI tool to verify the presence of environment variables",
      "type": "story",
      "url": "https://github.com/arvindell/envful"
    },
    {
      "by": "keshavmr",
      "descendants": 0,
      "id": 30294854,
      "score": 1,
      "time": 1644538307,
      "title": "Introduction to Couchbase for Oracle Developers and Experts:Part 8: Transactions",
      "type": "story",
      "url": "http://blog.planetnosql.com/2022/02/introduction-to-couchbase-for-oracle_10.html"
    },
    {
      "by": "stereoradonc",
      "descendants": 0,
      "id": 30294844,
      "score": 1,
      "time": 1644538240,
      "title": "India’s ShareChat and MX Player merge their short video apps to counter Reels",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/10/sharechat-mx-player-moj-mx-takatak/"
    },
    {
      "by": "ahiknsr",
      "descendants": 3,
      "id": 30294821,
      "kids": [
        30294944,
        30295061
      ],
      "score": 5,
      "time": 1644538138,
      "title": "Intel's Pay-as-You-Go CPU Feature Gets Launch Window",
      "type": "story",
      "url": "https://www.tomshardware.com/uk/news/intel-software-defined-cpu-support-coming-to-linux-518"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30294780,
      "score": 1,
      "time": 1644537936,
      "title": "Userland TCP/IP stack for external container connectivity",
      "type": "story",
      "url": "https://fosdem.org/2022/schedule/event/container_userlan_tcpip/"
    }
  ]
}