{
  "stories": [
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31559465,
      "score": 1,
      "time": 1653921573,
      "title": "Ilias: Readable aliases for core Ruby methods",
      "type": "story",
      "url": "https://github.com/siaw23/ilias"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 31559431,
      "score": 1,
      "time": 1653921436,
      "title": "A mechanism by which facemasks contribute to the Covid-19 case fatality rate",
      "type": "story",
      "url": "https://journals.lww.com/md-journal/fulltext/2022/02180/the_foegen_effect__a_mechanism_by_which_facemasks.60.aspx"
    },
    {
      "by": "advaitruia",
      "descendants": 0,
      "id": 31559412,
      "score": 1,
      "text": "I’ve summarized the top curated resources for navigating the downturn - thought it would be useful for everyone to refer to if they’re looking to understand whats happening .<p>All the Links to resources are at the bottom<p>Summary:<p>On managing your burn:\nThere is no certainty on when things will get better. It could take 6 months or 2 years. The general advice is to maintain 24+ months of runway (30 months to be safe so you can raise with sufficient buffer)<p>Valuation multiples:\nMedian public co multiples (those growing 20-30% YoY) were 13X+ before and are now down to 5.6X of revenue (60% down). For top tier public companies with growth higher than 40% YoY, the multiple is at 8X<p>Current activity:\nRight now, it is a terrible market and hence most companies are not raising. If you could raise, you probably did end of last year when it was a good time to do so. So there is low volume right now.<p>Rounds are either being done at the old price (they were close to being done when things changed) or are just not getting done at all.<p>Towards the end of this year &amp; early next, there will be lots of cos that just cant wait anymore. Thats when we&#x27;ll see a lot more data points<p>Seed &#x2F; Series A fundraises:\nIt will take longer to close and at lower valuations. The impact is not significant, yet (due to the above reason). The bar to raise is higher, will require more diligence and hence will take longer.<p>Deployment of capital:\nThere is a belief that since many firms recently raised large funds - there is lots of idle capital<p>However, since deployment was so quick, a large part of these new funds have already been deployed<p>Remaining funds will be used to support existing portco<p>Eg: Tiger&#x27;s $12.7B fund announced in March 2022 is already 65% deployed.<p>The same way startups think about their runway, VCs will be thinking about the limited amount of capital they have and will try to stretch it out.<p>Outlook:\nNo one knows but those that have guessed have said that a recession is likely in the next 6 months (GDP growth likely be negative in Q2).\nIf you are a growth stage startup and need to raise, then be great<p>The advice here is generalised but nuances will apply for your specific business. Eg: it may make sense for a category creating company with top tier growth to continue to focus on growth over runway<p>Resources:<p>[1] Craft Ventures: Operating in a downturn [https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=vBkzm4a7iY4]<p>[2] Unseen Sequoia deck on “Adapting to Endure” [https:&#x2F;&#x2F;s3.documentcloud.org&#x2F;documents&#x2F;22036831&#x2F;adaptingtoenduremay2022.pdf]<p>[3] YC note from Michael [https:&#x2F;&#x2F;twitter.com&#x2F;refsrc&#x2F;status&#x2F;1527238287471292417]<p>[4] A16Z Framework: more relevant for revenue generating Series A and beyond companies [https:&#x2F;&#x2F;future.a16z.com&#x2F;framework-valuation-navigating-down-markets&#x2F;]\n[5] Matt Turck, VC at FirstMark: [https:&#x2F;&#x2F;mattturck.com&#x2F;vcpullback&#x2F;]<p>[6] Personal experience from a Sequoia backed founder on what starting a company in 2000 was like: [https:&#x2F;&#x2F;twitter.com&#x2F;schrep&#x2F;status&#x2F;1527520245362982912?s=20&amp;t=NX-QGhQ5FBI1Id66zzlmIA]<p>[7] Ali Partovi providing a counter argument to being conservative: [https:&#x2F;&#x2F;twitter.com&#x2F;apartovi&#x2F;status&#x2F;1527440722219061248?s=20&amp;t=plBUZk93k50fCs0UupuCgw]",
      "time": 1653921337,
      "title": "Runway and growth advice compiled from Sequoia, A16Z, YC, Craft and founders",
      "type": "story"
    },
    {
      "by": "kevin_nisbet",
      "descendants": 0,
      "id": 31559410,
      "score": 1,
      "time": 1653921335,
      "title": "Outage Stories: When DNS takes out cell phone roaming",
      "type": "story",
      "url": "https://wdkwwdk.com/posts/outage-stories-dns/"
    },
    {
      "by": "stefanhoelzl",
      "descendants": 0,
      "id": 31559389,
      "score": 1,
      "time": 1653921197,
      "title": "Ampere Strategy and Product Roadmap Update, 2022",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=rxPt7bpXGSk"
    },
    {
      "by": "herodotus",
      "descendants": 0,
      "id": 31559388,
      "score": 4,
      "time": 1653921189,
      "title": "Shennat dissertation: Dimensional analysis of Lucid programs",
      "type": "story",
      "url": "https://billwadge.com/2022/05/29/shennat-dissertation-dimensional-analysis-of-lucid-programs/"
    },
    {
      "by": "throwaway305",
      "descendants": 2,
      "id": 31559387,
      "kids": [
        31559436
      ],
      "score": 2,
      "text": "Let us ignore management roles. Let us also assume equal soft skills and equivalent expertise (meaning, a wordpress developer is as good at wordpress as a GoLang developer is at Golang). Same for domain knowledge.<p>Given everything else is equal, what tech skill would you pick to earn the maximum? Both as a freelancer and as a full time employee?<p>In other words, what skill has paid you the most?<p>I am asking because I am sick of being poor and of doing the same CRUD apps over and over again. I am experimenting with a few skillsets to pick from - being interested in the skillset is obviously the first item on the list, closely followed by the pay.",
      "time": 1653921189,
      "title": "Ask HN: Which tech skill would you pick, if your goal is to maximize earnings?",
      "type": "story"
    },
    {
      "by": "hmart",
      "descendants": 0,
      "id": 31559384,
      "score": 1,
      "time": 1653921179,
      "title": "'Lots of companies are going to get vaporized”",
      "type": "story",
      "url": "https://www.businessinsider.com/twilight-of-tech-gods-recession-stock-market-crash-silicon-valley-2022-5"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31559377,
      "score": 1,
      "time": 1653921111,
      "title": "Better Robots Through Gallium",
      "type": "story",
      "url": "https://hackaday.com/2022/05/29/better-robots-through-gallium/"
    },
    {
      "by": "east60nyc",
      "descendants": 0,
      "id": 31559365,
      "score": 1,
      "text": "My wife and I are expecting our first child. We live in a 1BR in Manhattan and I am curious what “hacks” you’ve come up with when dealing with a child and a space constrained space.",
      "time": 1653921047,
      "title": "Ask HN: What 1BR apartment hacks do you have for an expecting family?",
      "type": "story"
    }
  ]
}