{
  "stories": [
    {
      "by": "orbitalhelix",
      "descendants": 0,
      "id": 32159760,
      "score": 1,
      "text": "I’m 29. I manage a small team of engineers who hate what they do. Even I don’t enjoy what I do. Together, we support a platform that’s is trying to be replaced. But supporting it sucks.<p>For the past two years I’ve been looking for a new job, something that makes me use my thinking skills and be appreciated for it. I haven’t got that. Each group of interviews yields problems for me:<p>* whilst I can code, I don’t do it often. I’m rusty and sometimes that shows. More often than not, I’m reading code and trying to find bugs in that code or fixing them. So late in an interview with a hedge fund for a reliability engineering role was i asked to write an in memory database that could handle SQL commands.. well ok, but that’s not representative of anything I’ve ever done (or would do). But an hour to build it the way I want to? Not enough time. Next I was asked about heaps etc (by using an example algorithm), again stuff I know about but because I never write things from scratch anymore, I suck at it. I’ve been coding more in my free time, but I’m beginning to resent it. It’s no longer a passion of mine as it once used to be. Every time I start to commit to writing code that I don’t need to do, I am reminded of prior interview failures I’ve had. As a reliability engineer, I guess I have to know everything? I don’t know everything, and I’m ok with that fact. Maybe I’m just not cut out for it.<p>* system design and troubleshooting and unix skills? Great. I love that. Interview feedback was strong here.<p>* I don’t know what I’m good at? Interviewed for an EM role at the start of the year. Got through the panels and the HM was super enthusiastic. Final role with someone more senior. Failed at that level: feedback was that I didn’t have the right strategy… yielded in 30 mins? Ok then. Feedback wasn’t super useful but the recruiter let me know the HM was fighting for me.<p>So I’ve been in my current role for just under a year now and I can’t say I’m growing much. The work is demanding and I don’t have enough people to support the workload. They’re also quite junior in their careers. I feel it’s unfair to force them to do support work, so I do my best to coach them in managing production systems, but it’s clear there is a lot of work to do there, but I am unconvinced they want to touch production systems. Most retrospectives indicate they want to do more coding. Hiring? Great idea! The calibre of candidates aren’t meeting my bar; and it’s not a high bar. Maybe getting consultants to do the drudge work is a good idea, we’ll see. This point is more of an organisational problem to be fair. My reports have had 12 managers in a year, including me, so attrition was expected. I spend more time in meetings shielding my team from the grunt than forcing it on them. I want the team to be happy.<p>I’m lost. I’m really lost. Nothing in my daily role makes me feel happy. I don’t feel like I’ve accomplished anything, neither in my career or life. Moreover, is it normal to not get any recognition for anything? (I stabilised a failing platform within the first month of joining the current workplace), and that took courage to make a change instead of be constantly paralysed and not look at the data and metrics. I am someone who’s data driven and practical. To that point, I make decisions based on empirical evidence over feelings.<p>I look at the job market and I don’t know whether I’m an IC or not. I feel more effective as a manager of sorts, but that’s based off my current trajectory. I could fit in an IC role but then what am I?<p>Is there such thing as a career coach in this industry? Do I need that? Or do I need to reset my expectations of everything?",
      "time": 1658276663,
      "title": "Ask HN: Dealing with Career Failures",
      "type": "story"
    },
    {
      "by": "herbertl",
      "descendants": 0,
      "id": 32159752,
      "score": 1,
      "time": 1658276624,
      "title": "What I Miss About Working at Stripe",
      "type": "story",
      "url": "https://every.to/p/what-i-miss-about-working-at-stripe"
    },
    {
      "by": "groffee",
      "descendants": 0,
      "id": 32159745,
      "score": 1,
      "time": 1658276578,
      "title": "Why BeReal is breaking out",
      "type": "story",
      "url": "https://www.platformer.news/p/why-bereal-is-having-a-moment"
    },
    {
      "by": "Sawpaw19",
      "descendants": 0,
      "id": 32159743,
      "score": 1,
      "text": "Hey HN,<p>I have been working on a new website to replace a site that I used to use multiple times a day. Sometime last week passwordsgenerator.net went down and has not come back online. Though I know there are a million ways to do this, and some that are probably faster than passwordsgenerator, the tool became a part of my day to day workflow when clients require I provision new unique keys (often!).<p>Like a good dev, in the wake of its absence, I decided just to build my own replacement. www.copypassword.com was born over the weekend while I was holed up battling a rough couple days with Covid and im stoked on how its come out. Traffic is light but not negligible and I am using my own tool just as much as I was using passwordsgenerator.<p>I&#x27;ve decided why stop here? Maybe I can replace another tool that I use all of the time which is pwpush.com - the tool that I would formerly pair with passwordsgenerator to quickly spin up a unique password and send it to a client. I figure I can easily just combine the two tools under one roof and away we go.<p>So I got to building and I wanted to make things as secure as possible. Unlike pwpush I am not storing passwords in a db to delete later. The application works as follows:<p>1. User generates a password\n2. On clicking &quot;Copy Secure Share Link&quot; the password is sent to a server side function via NextJS API route.\n3. The password is then encrypted (AES) with a secret key that lives in a server side environment variable + the timestamp for when the encryption is done (rounded to the nearest hour).\n4. The resulting hash is then used in the URL that gets shared i.e. &quot;copypassword.com&#x2F;share-pass&#x2F;{hash}&quot; \n5. When the url is visited (after having been shared), the hash in the url is sent to a server side function via NextJS api routes and decrypted. The decryption works by rounding the current time to the nearest hour, combining it with the secret key and looping backwards 24 hours until a successful decryption is performed. If no successful decryption occurs, we know that the password has expired.<p>So my question for you HN....is this secure? I am no cryptography expert, just a humble dev trying to turn 2 tools into 1.",
      "time": 1658276566,
      "title": "Ask HN: Help me understand if my site is secure",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32159733,
      "score": 1,
      "time": 1658276507,
      "title": "Semiconductor CEO Words to the Wise – EETimes eBook",
      "type": "story",
      "url": "https://www.eetimes.com/product/words-to-the-wise/"
    },
    {
      "by": "tfsh",
      "descendants": 0,
      "id": 32159725,
      "score": 1,
      "time": 1658276436,
      "title": "Nova Launcher Joins Branch",
      "type": "story",
      "url": "https://novalauncher.com/branch"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32159721,
      "score": 1,
      "time": 1658276389,
      "title": "V2 of “Ghost Protocol” appeal for backdoors in end-to-end encrypted messengers",
      "type": "story",
      "url": "https://alecmuffett.com/article/16208"
    },
    {
      "by": "walterbell",
      "descendants": 1,
      "id": 32159699,
      "kids": [
        32159757
      ],
      "score": 1,
      "time": 1658276245,
      "title": "Intel Begs for a Bailout",
      "type": "story",
      "url": "https://www.levernews.com/intel-begs-for-a-bailout/"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 32159683,
      "score": 2,
      "time": 1658276081,
      "title": "House passes same-sex marriage bill, with 47 Repubs and every Dem voting Yes",
      "type": "story",
      "url": "https://www.cbsnews.com/news/house-democrats-same-sex-marriage-contraception-supreme-court/"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 32159660,
      "score": 1,
      "time": 1658275904,
      "title": "Cognitive Distortions",
      "type": "story",
      "url": "https://quillette.com/2022/07/18/cognitive-distortions/"
    }
  ]
}