{
  "stories": [
    {
      "by": "csomar",
      "descendants": 0,
      "id": 28167188,
      "score": 1,
      "time": 1628848798,
      "title": "Map: How bad is the Siberian fire",
      "type": "story",
      "url": "https://www.ventusky.com/?p=63;80;2&l=co"
    },
    {
      "by": "collaborative",
      "descendants": 0,
      "id": 28167175,
      "score": 1,
      "time": 1628848720,
      "title": "Vaccine Disinformation Spreads on Social Media",
      "type": "story",
      "url": "https://www.mythdetector.ge/en/myth/vaccine-ingredient-or-toxic-acid-disinformation-spreads-vaccine-ingredients"
    },
    {
      "by": "shashkoff",
      "descendants": 0,
      "id": 28167161,
      "score": 2,
      "text": "Hey Hacker News! I&#x27;m Alex, an early-stage founder. I am working on a new idea for an AI landing page generator, where users can answer a few questions and get their landing page generated by AI.<p>Story<p>I started working on a side project at the beginning of 2021, it&#x27;s a no-code tool that lets people create simple landing pages on top of Notion. The MVP didn&#x27;t bring much value to non-tech people, but it was fun to build, and I made good friends among my first customers. Fast-forward to the first half of 2021, I immersed myself deeply in the area of landing page building and loved it.<p>Problem<p>While I was working on it, I talked to a lot of people who can&#x27;t code, don&#x27;t have design skills, but need to create landing pages. Such as startup founders, indie makers, marketers, product managers, influencers, online school owners, and small business owners.<p>But one thing surprised me so much that I decided to keep finding a new solution to solve it: while some of them were building their landing pages with website builder platforms like WordPress, Wix, Squarespace, Webflow, Tilda, or Carrd, businesses (marketers, managers, owners, founders) were (almost) always hiring contractors to build websites on those platforms because they didn&#x27;t want to learn to do it on their own.<p>The thing is, even with no-code website builders, most people are still forced to delegate it to webmasters&#x2F;developers.<p>That’s why I decided to work on the idea of a product that would allow business people to create their landing pages without contractors and no-code website builders.<p>Idea<p>The idea is to let AI do all of the grunt work and instantly generate multiple variants of landing pages based on user answers.\nNo learning curve.\nNo website builders.\nNo contractors.\nNo design or coding skills are needed.<p>How it works:<p>The product asks you some questions about your landing page and project.\nAI generates several variants of your landing page by clicking the «Generate» button.\nConnect your custom domain or use a free subdomain for publishing the ready landing page on the web.<p>Applications<p>The main applications of this product are:\nLaunching landing pages quickly, without the need for contractors;\nCreating landing pages at scale (hundreds of landing pages).<p>Functionality<p>An MVP can support only static websites such as landing pages, and maybe it can be expanded to full-blown marketing websites later.<p>To publish a landing page, users hit a «Publish» button, and the product pre-renders the site, optimizes the images, and deploys the files on a CDN.<p>Pricing<p>The MPV can have a free plan where users can build a site and redirect on their own domain name for free! The product can start charging a recurring fee when these landing pages become more mature.<p>Free plan - $0&#x2F;mo\n- Publish 1 page\n- Custom domain\n- SEO &amp; Metadata<p>Paid plan - $10&#x2F;mo\n- Publish an unlimited number of pages\n- Integrations like Airtable, Google Spreadsheets, Notion, Google Analytics, Stripe, etc.<p>Let me know what you think!<p>I&#x27;d love to hear your feedback about the idea. If you have any advice on this, I would be more than happy to hear it! Whether you see something you like or find an issue, I&#x27;d love to hear from you. Feel free to leave a comment below.",
      "time": 1628848410,
      "title": "Ask HN: What do you think about the «AI landing page generator»?",
      "type": "story"
    },
    {
      "by": "imartin2k",
      "descendants": 1,
      "id": 28167122,
      "kids": [
        28167126
      ],
      "score": 1,
      "time": 1628848020,
      "title": "Turkey became a star of European tech",
      "type": "story",
      "url": "https://www.ft.com/content/1010e729-a33f-4fd8-acd6-e5391bca45e0"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28167096,
      "score": 2,
      "time": 1628847756,
      "title": "AIX Running on Apple's M1",
      "type": "story",
      "url": "https://twitter.com/astr0baby/status/1425970552552964101"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 28167092,
      "score": 1,
      "time": 1628847740,
      "title": "Hermeus Fully-Funded to Flight with $60M U.S. Air Force Partnership",
      "type": "story",
      "url": "https://www.hermeus.com/press-release-funded-to-flight"
    },
    {
      "by": "stanrivers",
      "descendants": 0,
      "id": 28167078,
      "score": 1,
      "time": 1628847585,
      "title": "The First Delta Force Trainee Class",
      "type": "story",
      "url": "https://historyofyesterday.com/the-first-delta-force-trainee-class-fc46a131fea2"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28167066,
      "score": 1,
      "time": 1628847399,
      "title": "Pretty Good Phone Privacy: end-to-end perspective on the cellular architecture",
      "type": "story",
      "url": "https://arxiv.org/abs/2009.09035"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28167058,
      "score": 4,
      "time": 1628847323,
      "title": "What if Planet 9 is a Primordial Black Hole? A 1:1 black hole figure",
      "type": "story",
      "url": "https://arxiv.org/abs/1909.11090"
    },
    {
      "by": "samizdis",
      "descendants": 1,
      "id": 28167012,
      "kids": [
        28167037
      ],
      "score": 1,
      "time": 1628846840,
      "title": "Berlin, a divided city. The events of 60 years ago",
      "type": "story",
      "url": "https://www.dw.com/en/berlin-a-divided-city/a-58851305"
    }
  ]
}