{
  "stories": [
    {
      "by": "pponballs",
      "descendants": 0,
      "id": 31058797,
      "score": 1,
      "text": "pp",
      "time": 1650174303,
      "title": "Pp",
      "type": "story"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 31058756,
      "score": 1,
      "time": 1650173512,
      "title": "Disney's Nine Old Men",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Disney%27s_Nine_Old_Men"
    },
    {
      "by": "sjg007",
      "descendants": 0,
      "id": 31058747,
      "score": 1,
      "text": "Why are we here?  And what are we doing?",
      "time": 1650173405,
      "title": "The Hacker News Dumpster Fire",
      "type": "story"
    },
    {
      "by": "stephenbowden",
      "descendants": 0,
      "id": 31058738,
      "score": 1,
      "text": "Russians must be held to account, just like nazis in wwii",
      "time": 1650173173,
      "title": "Fred",
      "type": "story"
    },
    {
      "by": "ilrwbwrkhv",
      "descendants": 0,
      "id": 31058736,
      "score": 1,
      "text": "So I was wanting to replace Google Search for a long time due to the poor results filled with ads and content farmed articles.<p>I signed up for the Kagi Search beta (kagi.com) and finally received my invite this week.<p>So far, all the searches that I have tried, I have gotten better results than Google.<p>DuckDuckGo was something I sometimes used but I would often have to !g a lot of things or feel like I might be missing out on better results. So that would make me also Google search those things.<p>With Kagi I have not found that till now. In fact the results have been so good that I didn&#x27;t feel like I needed to also search Google for very important queries.<p>Amazingly my go to query to test search engines has been &quot;frozen record&quot; without the quotes which I want to point to: https:&#x2F;&#x2F;github.com&#x2F;byroot&#x2F;frozen_record.<p>It is a query which almost every other search engine doesn&#x27;t quite get since it contains two common words but surprisingly kagi gets it and places the result at number 2 which is huge.<p>I know a lot of people here have been clamouring for a different search so I thought this might be useful. No relations with Kagi.",
      "time": 1650173157,
      "title": "My Experience with Kagi Search (Google Search Replacement)",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31058729,
      "score": 1,
      "time": 1650172959,
      "title": "Bad but interesting mathematical notation idea",
      "type": "story",
      "url": "https://blog.plover.com/math/se/notation.html"
    },
    {
      "by": "jpsala",
      "descendants": 0,
      "id": 31058704,
      "score": 1,
      "text": "Hi\nI&#x27;m working for a software company in NY, remotely, they are paying me 40$&#x2F;h, that, for me, living in Arentina (sorry about my English), is a lot of money, BUT:\nI always worked alone, or with some ocational coworker or friend, I code since I was 18 and now I&#x27;m 54, so I had to view at my code from years back, so I like to write code that I will understand, I also love coding, so I studied a lot, always for my self, my work was for local clients, so remote working, and in a language that is not mine, is new for me.\nI coded since DOS, with basic, clipper, c, pascal, then win windows with visual c and lastley my beloved Delphi, then for the web with php, jquery and then my new beloved, JS, now with VUE which I LOVE since composition!!!\nWell, sorry if I&#x27;m just now going to the point.\nCan you please, please help me to know where I&#x27;m positioned, in your opinion, in the market, because I&#x27;m feeling insecure about my knowledge, this is my GitLab account, these are some of my projects that ended up there, if you are so kind to take a look and give me your opinion it would be so much for me.\nThanks a lot my friend.",
      "time": 1650172632,
      "title": "I'm not enjoining my job",
      "type": "story"
    },
    {
      "by": "amirGi",
      "descendants": 0,
      "id": 31058698,
      "score": 1,
      "time": 1650172544,
      "title": "Visualizing My Twitter Social Graph",
      "type": "story",
      "url": "https://twitter.com/amirbolous/status/1515388628326764549"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31058687,
      "score": 1,
      "time": 1650172401,
      "title": "The Pseudo-Time Arrow: Explaining Time (2018)",
      "type": "story",
      "url": "https://qualiacomputing.com/2018/11/28/the-pseudo-time-arrow-explaining-phenomenal-time-with-implicit-causal-structures-in-networks-of-local-binding/"
    },
    {
      "by": "georgia_peach",
      "descendants": 0,
      "id": 31058682,
      "score": 1,
      "time": 1650172289,
      "title": "Why Dan O'Dowd Has Blood on His Hands",
      "type": "story",
      "url": "https://wholemars.net/2022/01/17/why-dan-odowd-has-blood-on-his-hands/"
    }
  ]
}