{
  "stories": [
    {
      "by": "tylerhou",
      "descendants": 0,
      "id": 29628772,
      "score": 1,
      "time": 1640027508,
      "title": "Show HN: Python decorator that enables arbitrarily-deep tail/non-tail recursion",
      "type": "story",
      "url": "https://github.com/tylerhou/fiber"
    },
    {
      "by": "lkozma",
      "descendants": 0,
      "id": 29628769,
      "score": 1,
      "time": 1640027506,
      "title": "Finnish man blows up his Tesla Model S with 30kg dynamite",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=7_9aVzf5fC4"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29628763,
      "score": 1,
      "time": 1640027484,
      "title": "Limited brain capacity in humans and birds",
      "type": "story",
      "url": "https://news.rub.de/english/press-releases/2021-12-17-cognitive-neuroscience-limited-brain-capacity-humans-and-birds"
    },
    {
      "by": "abelsm",
      "descendants": 0,
      "id": 29628716,
      "score": 9,
      "text": "Hey HN! It’s Abel and Alex here to share what we’ve been working on for just over a year: FlutterFlow (<a href=\"https:&#x2F;&#x2F;flutterflow.io\" rel=\"nofollow\">https:&#x2F;&#x2F;flutterflow.io</a>). It’s like WebFlow, but for Flutter.<p>Flutter is an open source framework for building cross platform applications. FlutterFlow combines a UI builder with pre-built templates and Firebase&#x2F;API integrations, generates clean Flutter code, and allows you to deploy to app stores directly from your browser. This enables extremely fast iteration, from product idea concepts and designs to working Flutter apps. As an example of what’s possible, we built an internal app for playing trivia games by using the jservice.io API and Firebase all in under 2 hours:\nTime lapse of building game in FF: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;Fm4jjpuKM1E\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;Fm4jjpuKM1E</a>\nLink to live version of the app for web: <a href=\"https:&#x2F;&#x2F;app.flutterflow.io&#x2F;run&#x2F;ByqwG33rw80qyN39ooNq\" rel=\"nofollow\">https:&#x2F;&#x2F;app.flutterflow.io&#x2F;run&#x2F;ByqwG33rw80qyN39ooNq</a>\nExported source code: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;FlutterFlow&#x2F;ff-trivia&#x2F;tree&#x2F;flutterflow\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;FlutterFlow&#x2F;ff-trivia&#x2F;tree&#x2F;flutterflow</a><p>Alex and I, along with a friend of ours from Google, quit our jobs in 2019 to work on a cross-platform mobile app that ultimately failed. It was a learning opportunity, and it also led us to feel the pain of the slow iteration process every time we wanted to roll out a new experience. We were able to experiment with various landing pages within hours, but building new screens and app experiences took weeks or even months. For over a year now, we’ve been tirelessly working on fixing this problem.<p>I first fell in love with coding by pure luck as a kid in Ethiopia. My father, who at the time owned an internet cafe, decided to start taking night classes in CS in the late 90s. Ultimately he didn’t use his degree professionally, but I ended up with learning materials and a compiler, Turbo C++ 3.0. As I grew older, eventually ending up as an engineer at Google, I started to appreciate that as engineers we were often tasked with solving problems even when the solution didn’t necessarily involve writing code. Alex comes from a physics background, doing his undergrad at Stanford, and transitioned to study CS and AI there as well. In 2016 he joined the team I was on, a small ML group within Google Maps. He’ll often admit he had underestimated the amount of skill involved in building beautiful, fast and functional apps. And he certainly didn’t expect to love building with Flutter as much as he does, having been entrenched in ML for most of his career. Yet here we are.<p>There has recently been a healthy amount of skepticism towards no-code tools, mainly due to concerns of extensibility and scalability. This is definitely the case for some apps - a good example is a tool such as FlutterFlow itself. It would be very difficult to build all of FlutterFlow recursively. We do use it internally for many of our pages, but using a visual builder to implement our code generator seems far fetched. This doesn’t imply however that there isn’t a middle ground that enables fast iteration in a visual builder, coupled with the ability to write code that seamlessly integrates with the overall experience. We’re not quite there yet, but we believe this is the right direction.<p>Finally, we believe Flutter is going to be the catalyst that drives this movement. It’s composability, the fact that it’s super cross-platform (Android&#x2F;iOS&#x2F;Web&#x2F;Desktop&#x2F;Embedded), and the vibrant and passionate community it fosters give it a unique advantage. Whether we do it or someone else, the application builder of the future will be built on Flutter. Huge thanks to our users, the Flutter team and the Flutter community.<p>We’d love for you to give it a try and share your thoughts. What do you think the future of application development is going to be?<p>p.s. we were on HN when we announced our launch back in May: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27238381\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27238381</a>\nWe’ve made a lot of progress since then, enabling app store deployment, payments, ability to add custom code and much more: <a href=\"https:&#x2F;&#x2F;community.flutterflow.io&#x2F;c&#x2F;whats-new-in-flutterflow\" rel=\"nofollow\">https:&#x2F;&#x2F;community.flutterflow.io&#x2F;c&#x2F;whats-new-in-flutterflow</a>",
      "time": 1640027278,
      "title": "Launch HN: FlutterFlow (YC W21) – Build Apps Visually",
      "type": "story"
    },
    {
      "by": "Thevet",
      "descendants": 0,
      "id": 29628705,
      "score": 1,
      "time": 1640027231,
      "title": "How Is ‘Dune’ So Prescient About Climate Change?",
      "type": "story",
      "url": "https://www.nytimes.com/2021/10/23/opinion/culture/dune-frank-herbert-native-americans.html"
    },
    {
      "by": "coloneltcb",
      "descendants": 0,
      "id": 29628698,
      "score": 1,
      "time": 1640027208,
      "title": "Facebook will prevent, not create, the ‘metaverse’",
      "type": "story",
      "url": "https://mikeelgan.substack.com/p/how-facebook-will-prevent-not-create-428"
    },
    {
      "by": "toomanyrichies",
      "descendants": 0,
      "id": 29628670,
      "score": 1,
      "text": "Over the course of the pandemic, I&#x27;ve seen multiple anecdotes here on HN of engineers (and others) taking on additional full-time remote jobs and working them in parallel.  I&#x27;m wondering if there are folks here on HN who have made this work, either surreptitiously or with the consent of their current employer.<p>I&#x27;d like to hear about any and all gotchas you&#x27;ve encountered.  The one I&#x27;m most interested in is the juggling of meetings.  What if the current and new teams have overlapping stand-ups, for example?  Or what if an impromptu meeting gets added to the person&#x27;s calendar, creating a conflict with existing commitments?<p>I&#x27;m also looking for opinions on the morality of such an action.  To me, it seems equivalent to that same dev getting a job as a shared ride driver or something, if (and this is a BIG if) the employee is able to continue delivering the same quality of work to both employers, the two companies operate in separate spaces, and there&#x27;s no risk of improper IP transfer.<p>That said, I&#x27;m open to the possibility that I&#x27;m wrong here.  Hoping the HN hive mind will have insights that I haven&#x27;t considered.",
      "time": 1640027116,
      "title": "Ask HN: Have you gotten a 2nd full-time remote job since the start of lockdown?",
      "type": "story"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29628603,
      "score": 1,
      "time": 1640026814,
      "title": "Great Datasets for Kids",
      "type": "story",
      "url": "https://www.littlemissdata.com/blog/10-datasets-kids"
    },
    {
      "by": "ok123456",
      "descendants": 0,
      "id": 29628596,
      "score": 2,
      "time": 1640026786,
      "title": "Apple Lisa Sells for $95,000. Buyer sells shares of Lisa",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=1KNlhN2CEVk"
    },
    {
      "by": "TekMol",
      "descendants": 0,
      "id": 29628595,
      "score": 1,
      "time": 1640026784,
      "title": "For some reason, the Ethereum transaction fees are back to early 2020 level",
      "type": "story",
      "url": "https://www.blockchain.com/charts/fees-usd-per-transaction"
    }
  ]
}