{
  "stories": [
    {
      "by": "cwaffles",
      "descendants": 0,
      "id": 28117378,
      "score": 1,
      "time": 1628519657,
      "title": "LeanChess – 288 byte chess program",
      "type": "story",
      "url": "https://leanchess.github.io/"
    },
    {
      "by": "voisin",
      "descendants": 0,
      "id": 28117345,
      "score": 2,
      "time": 1628519541,
      "title": "Sulforaphane may provide a treatment for Balding",
      "type": "story",
      "url": "https://www.reddit.com/r/Biohackers/comments/p0htty/potential_biohack_using_sulforaphane_and/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28117324,
      "score": 1,
      "time": 1628519474,
      "title": "A Painless Guide to CRC Error Detections Algorithms (1993)",
      "type": "story",
      "url": "http://www.zlib.net/crc_v3.txt"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28117323,
      "score": 1,
      "time": 1628519468,
      "title": "On the Phenomenon of Bullshit Jobs: A Work Rant (2013)",
      "type": "story",
      "url": "http://strikemag.org/bullshit-jobs/"
    },
    {
      "by": "slowhand09",
      "descendants": 1,
      "id": 28117291,
      "kids": [
        28117311
      ],
      "score": 2,
      "time": 1628519363,
      "title": "Windpowered vehicle 2x speed of the wind – I laugh",
      "type": "story",
      "url": "https://www.avweb.com/aviation-news/rc-glider-hits-548-mph-in-record-flight/"
    },
    {
      "by": "EGreg",
      "descendants": 0,
      "id": 28117289,
      "score": 1,
      "text": "This is an interesting debate, about law and order on the one hand, and liberal democracy on the other. To me, crypto means cryptography, that enables both digital signatures and encryption. Those who are against crypto-currencies, should consider whether they against end-to-end encryption as well, for the same reasons, to arrive at consistent thinking on the issue. Let me dive into the root issue head-on.<p>This is generally about removing the middleman (Big Finance) from transactions, just as, say, scuttlebutt and bittorrent removed the middleman (Big Tech) from communications.<p>Now, there are (at least) two aspects by which they can be removed. One is control: they can’t prevent you from publishing X or sending Y. This causes people to be free to publish potentially seditious material, or otherwise objectionable or illegal material (eg child pornogrophy, or copies violating copyright law).<p>The other is removing them from having to collect data and report. Without middlemen, the government has a harder time going after everyone. For example, having every maker of a desktop printer or copier report metadata on what was printed, is infeasible. BUT in the past, when printing machinery was expensive, you could control what was published and sanction those who didn’t have the “imprimatur” authorizing the printing of a specific book or magazine. You could make sure to control what was distributed widely. With federated services like Mastodon or Matrix, the government can make a bill tomorrow to require them to report metadata on all speech they host, to make sure none of it is dangerous. From 2003: https:&#x2F;&#x2F;www.fourmilab.ch&#x2F;documents&#x2F;digital-imprimatur&#x2F;<p>This reminds of the disastrous SOPA bill that HN was pretty much against, but it has the exact same concerns, just in the area of speech rather than financial transactions: https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Stop_Online_Piracy_Act<p>So today, if governments allow people to have “unhosted” wallets, there could be a lot of flaunting of capital controls (by sending $2 billion internationally very quickly) and tax evasion (by not reporting certain sales of houses for crypto, for instance). This would have implications for money laundering and funding unsavory groups etc.<p>At the same time, however, for small amounts, people want to be able to transact freely, such as buying a pizza with cash. This might become impossible to do given where governments are going: they have nearly eliminated anonymous cash transactions and will do so with crypto as well. When it comes to financial transactions, they will insist that everything will be “hosted” by a third party who can be punished if they allow certain transactions to happen. This is in preparstion for massive centralization of the monetary system in the hands of the central banks, you will have an account at the central bank which picks winners and losers, instead of “so-called” stablecoins which present competition to them.<p>The problem is that this elimination of petty cash can easily lead to a “social credit system” like we have in China, and gradual tightening of screws on any participant in the economy.<p>Thankfully, the US government has not taken the same approach with speech (probably due to the first amendment) and Big Tech platforms can be disrupted (eg with https:&#x2F;&#x2F;qbix.com&#x2F;blog&#x2F;2021&#x2F;01&#x2F;15&#x2F;open-source-communities&#x2F;)<p>The only exception the US makes is for copyright enforcement, and there, you can see much the same argument and attempts to ban people from being able to use end-to-end encryption to host files using BitTorret, say. The difference is, there are no “gateways” to the regular system so the battle was lost.<p>However, that is NOT true in other countries, which have less respect for freedom of speech. If we as a global community allow these governments to insist on NEVER replacing middlemen with technology, if we let them ban end-to-end encryption until anyone using it is suspicious in and of themselves,then they will ALWAYS have someone to squeeze to make sure the “wrong” types of transactions or speech is chilld - no matter how small - until it is eradicated.",
      "time": 1628519354,
      "title": "Ask HN: If you support crypto reporting, what are you for?",
      "type": "story"
    },
    {
      "by": "jeffreyrogers",
      "descendants": 2,
      "id": 28117286,
      "kids": [
        28117369,
        28117384
      ],
      "score": 2,
      "time": 1628519348,
      "title": "Old Memes and China",
      "type": "story",
      "url": "https://jayriverlong.github.io/2021/08/09/old-memes.html"
    },
    {
      "by": "ctummons",
      "descendants": 1,
      "id": 28117283,
      "kids": [
        28117296
      ],
      "score": 1,
      "time": 1628519337,
      "title": "Show HN: If Wunderlist and Slack Had a Baby. Welcome to HelloList",
      "type": "story",
      "url": "https://www.hellolist.com"
    },
    {
      "by": "stonlyb",
      "descendants": 0,
      "id": 28117282,
      "score": 1,
      "time": 1628519335,
      "title": "Biden’s Climate Plans Are Stunted After Dejected Experts Fled Trump",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/01/climate/biden-scientists-shortage-climate.html"
    },
    {
      "by": "kthejoker2",
      "descendants": 0,
      "id": 28117244,
      "score": 1,
      "time": 1628519083,
      "title": "Hacker News Advice on Learning New Skills",
      "type": "story",
      "url": "https://kthejoker.github.io/hackernews-advice-on-learning-new-skills/"
    }
  ]
}