{
  "stories": [
    {
      "by": "jaredcwhite",
      "descendants": 0,
      "id": 31531888,
      "score": 1,
      "time": 1653670704,
      "title": "The Web App and the Web Site Should Be Friends",
      "type": "story",
      "url": "https://www.spicyweb.dev/web-app-and-web-site-should-be-friends/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31531876,
      "score": 1,
      "time": 1653670676,
      "title": "Chili’s restaurants using robot servers to make jobs easier for workers",
      "type": "story",
      "url": "https://www.foxbusiness.com/technology/chilis-restaurants-robots-jobs"
    },
    {
      "by": "Layke1123",
      "descendants": 0,
      "id": 31531855,
      "score": 1,
      "text": "I recently had a programming problem concerning a Rubik&#x27;s cube as a challenge problem to get a job with them.<p>The problem was given any color configuration or rotation of a cube, be able to find a canonical form to &quot;look up&quot; a solution.<p>In their minds, you should be able to rotate any cube (24 possible states), and then permute the colors (6! = 720 possible ways to rearrange WYGBRO), and yet, this is entirely wrong from my understanding.<p>In a follow up meeting, they showed me an example case where instead of using the colors WYROGB, they used the number 0-5 instead, and then claimed this was valid. But they don&#x27;t realize that they are breaking their own constraints given in the problem.<p>Is there anyway to prove them wrong? I asked to sign an NDA because I&#x27;m genuinely just curious about how to better my understanding if I am wrong, but I&#x27;m getting the feeling they are intentionally not wanting to admit they are wrong.<p>Is there any thing I can do to actually get a response that shows how I am wrong or seek remedy ?",
      "time": 1653670564,
      "title": "Startups Giving Problems to Solve That They Didn't Solve?",
      "type": "story"
    },
    {
      "by": "gurachek",
      "descendants": 1,
      "id": 31531853,
      "kids": [
        31531891
      ],
      "score": 1,
      "time": 1653670551,
      "title": "Show HN: AI-based learning roadmaps for developers",
      "type": "story",
      "url": "https://www.indiehackers.com/post/show-ih-ai-based-learning-roadmaps-for-developers-d18308803b"
    },
    {
      "by": "mjirv",
      "descendants": 0,
      "id": 31531829,
      "score": 1,
      "time": 1653670464,
      "title": "The Technical Pay Gap",
      "type": "story",
      "url": "https://benn.substack.com/p/the-technical-pay-gap"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 31531809,
      "score": 1,
      "time": 1653670398,
      "title": "Apache Camel: Create and run your own Yahoo Pipes",
      "type": "story",
      "url": "https://camel.apache.org/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31531801,
      "score": 2,
      "time": 1653670364,
      "title": "Intel AVX-512 a Big Win for JSON Parsing Performance",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=article&item=simdjson-avx-512&num=1"
    },
    {
      "by": "julianlam",
      "descendants": 0,
      "id": 31531789,
      "score": 2,
      "time": 1653670310,
      "title": "Walking through doorways causes forgetting (2011)",
      "type": "story",
      "url": "https://www.tandfonline.com/doi/full/10.1080/17470218.2011.571267"
    },
    {
      "by": "cyberlurker",
      "descendants": 2,
      "id": 31531783,
      "kids": [
        31531854
      ],
      "score": 2,
      "text": "Below is the email Amazon sent out to customers who have purchased Amazon Cloud Cams. After December they will no longer work.<p>“To our valued Cloud Cam customer,<p>With your help over the last five years, Cloud Cam has served as a reliable indoor security camera and a hub for Amazon Key-compatible smart locks that work with Alexa. As the number of Alexa smart home devices continues to grow, we are focusing efforts on Ring, Blink, and other technologies that make your home smarter and simplify your everyday routines. Therefore, we have decided to no longer continue support for Amazon Cloud Cam and its companion apps.<p>What this means for you: \nOn December 2, 2022, you will no longer be able to use your Cloud Cam device or its companion apps. Until then, you will be able to download any video recordings if available. All video history will be deleted on December 2, 2022.<p>What’s next:\nTo thank you for your continuous support and feedback, we would like to offer you a complimentary Blink Mini and one-year Blink Subscription Plus Plan. Blink Mini offers customers an easy-to-use, indoor security camera experience with 1080p HD video, 2.4 GHz Wifi connectivity, night vision, motion detection, two-way audio, and works with Alexa. The Blink Subscription Plus Plan provides extra features and benefits for Blink devices – learn more https:&#x2F;&#x2F;support.blinkforhome.com&#x2F;en_US&#x2F;subscriptions&#x2F;purchasing-a-blink-subscription-plan-through-amazon#plans.<p>Prior to December 2, 2022, you will receive detailed instructions on how to redeem your free Blink Mini and Blink Subscription Plus Plan via email.<p>Downloading and deleting your video recordings:\nTo back up your videos from Cloud Cam app, go to Recorded Clips in the top right menu. Click on each individual video and click on the Download icon on the right side to save the video or click on the Trash icon next to it to delete the video. You could also delete all videos on Amazon Manage Your Content and Devices at any time.<p>If you have any questions about this, please reach out to customer service for additional information.<p>Sincerely,\nThe Amazon Cloud Cam team”",
      "time": 1653670284,
      "title": "Amazon permanently disables Cloud Cam Devices",
      "type": "story"
    },
    {
      "by": "jdorfman",
      "descendants": 0,
      "id": 31531767,
      "score": 1,
      "time": 1653670212,
      "title": "Show HN: Quickly find sensitive files in your GitHub repo",
      "type": "story",
      "url": "https://about.sourcegraph.com/blog/no-more-secrets"
    }
  ]
}