{
  "stories": [
    {
      "by": "leohonexus",
      "descendants": 0,
      "id": 27873871,
      "score": 1,
      "time": 1626623079,
      "title": "The reality in Rio post-Olympic (2017)",
      "type": "story",
      "url": "https://www.espn.com/espn/feature/story/_/id/20292414/the-reality-post-olympic-rio"
    },
    {
      "by": "_009",
      "descendants": 0,
      "id": 27873851,
      "score": 1,
      "text": "As a developer, I would love to be able to test a component&#x27;s CSS styles to make sure other styles don&#x27;t get overwritten (eg by using &quot;!important&quot;).",
      "time": 1626622995,
      "title": "Ask HN: Any good settings for testing CSS and components in React?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27873847,
      "score": 1,
      "time": 1626622961,
      "title": "Why the digital brain will prevail over the analog brain",
      "type": "story",
      "url": "https://uxdesign.cc/why-the-digital-brain-will-prevail-over-the-analog-brain-6bc348f54e19"
    },
    {
      "by": "alan2207",
      "descendants": 0,
      "id": 27873829,
      "score": 1,
      "time": 1626622869,
      "title": "Show HN: Bulletproof React",
      "type": "story",
      "url": "https://github.com/alan2207/bulletproof-react"
    },
    {
      "by": "ta988",
      "descendants": 0,
      "id": 27873790,
      "score": 1,
      "time": 1626622632,
      "title": "Master’s Degrees Are the Second Biggest Scam in Higher Education",
      "type": "story",
      "url": "https://slate.com/business/2021/07/masters-degrees-debt-loans-worth-it"
    },
    {
      "by": "boghy8823",
      "descendants": 0,
      "id": 27873783,
      "score": 1,
      "text": "Thinking of applying myself but the requirements seem intimidating",
      "time": 1626622594,
      "title": "Ask HN: Did anybody apply for UK Global Talent VISA? How did it go?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27873735,
      "score": 1,
      "time": 1626622333,
      "title": "Stumble-proof robot adapts to challenging terrain in real time",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/09/stumble-proof-robot-adapts-to-challenging-terrain-in-real-time/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27873732,
      "score": 1,
      "time": 1626622307,
      "title": "Harvard-led physicists create 256-qubit programmable quantum simulator",
      "type": "story",
      "url": "https://news.harvard.edu/gazette/story/2021/07/harvard-led-physicists-create-256-qubit-programmable-quantum-simulator/"
    },
    {
      "by": "thg",
      "descendants": 0,
      "id": 27873718,
      "score": 2,
      "time": 1626622222,
      "title": "Flash floods cause havoc across Europe – in pictures",
      "type": "story",
      "url": "https://www.theguardian.com/environment/gallery/2021/jul/15/flash-floods-cause-havoc-across-europe-in-pictures"
    },
    {
      "by": "BoxOfRain",
      "descendants": 1,
      "id": 27873717,
      "kids": [
        27873785
      ],
      "score": 1,
      "text": "Hi all,<p>For various reasons, I&#x27;ve been considering a transition from full-time salaried employment to freelancing. My current situation is:<p>* I&#x27;m a backend web developer in the UK with three year&#x27;s experience plus university. I&#x27;ve primarily spent my time written web server software in Kotlin and Java, although I&#x27;m comfortable writing software professionally in a couple of other languages including Python and Rust. I know enough SQL to get by but I&#x27;m far from an expert in the subject and I know my way around <i>nix servers comfortably. I&#x27;ve also done a fair amount with AWS.<p></i> I have a neurological condition that flares up unpredictably with a frequency of anything from around three to six months. This condition is poorly understood and cannot be controlled or mitigated with any known medical intervention; while I can mostly tolerate the chronic symptoms these acute episodes cannot be averted. For this reason I find working in lockstep to a traditional 9-6 schedule very stressful for obvious reasons, and permanent WFH is not an option in my current role. Freelancing sounds an ideal way to work around this problem as I&#x27;d be setting my own hours rather than working to somebody else&#x27;s schedule, meaning I&#x27;d be able to fit work around my condition rather than forcing myself to work through episodes which frankly is already leading to burnout. This neurological condition also precludes me doing UI-related work for the most part as my visual perception often differs quite strongly from the norm.<p>* I have experience with the formalities of running a limited company, as I&#x27;ve had a side project going with a couple of others which for various reasons I won&#x27;t bore you with made sense to register as a limited company in the UK rather than the other possible legal configurations. While this is obviously very different from <i>living</i> off your own limited company, I&#x27;m at least aware of what&#x27;s required to keep Companies House and HMRC happy. I&#x27;d likely be running my freelance business from the UK too, I know there&#x27;s more tax-efficient jurisdictions to set up in but I&#x27;d rather stick to what I know at first!<p>* For reasons I&#x27;ve made in another post, I&#x27;m intending to move onto a liveaboard sailing boat in the future rather than renting or buying a house. While it&#x27;s orthagonal to my main issue of dealing with a neurological condition, freelancing at least on the surface appears to lend itself much better to such a lifestyle as full-time 9-6 employment is incompatible with long ocean crossings which are a long-term ambition for me. It goes without saying that such work would have to be full-time remote.<p>Given this background, I&#x27;d really appreciate advice from anyone else who&#x27;s made the transition from traditional employment to freelance work generally, or suffered with a neurological condition as a software developer and attempted to mitigate it in this way. I&#x27;d particularly appreciate recommendations for agencies which would be a good fit for the kind of work I have in mind.<p>Cheers in advance!",
      "time": 1626622218,
      "title": "Ask HN: Transitioning to Freelancing with a Neurological Condition?",
      "type": "story"
    }
  ]
}