{
  "stories": [
    {
      "by": "gwilken",
      "descendants": 0,
      "id": 32065631,
      "score": 1,
      "time": 1657599852,
      "title": "1 Dollar = 1 Euro",
      "type": "story",
      "url": "https://www.xe.com/currencyconverter/convert/?Amount=1&From=USD&To=EUR"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 32065624,
      "score": 1,
      "time": 1657599811,
      "title": "Just hired to Build or Head a Developer Relations Team? Your first 90 days",
      "type": "story",
      "url": "https://medium.com/@TessaMero/just-hired-to-build-or-head-a-developer-relations-team-75e922b617ba"
    },
    {
      "by": "scrubs",
      "descendants": 0,
      "id": 32065614,
      "score": 1,
      "text": "https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Racketeer_Influenced_and_Corrupt_Organizations_Act<p>Some of the alleged conspirators caught-up in Jan6 could be prosecuted under RICO because they engaged in:<p>- obstruction (of Justice) by attempting to stop the Senate from doing its job<p>- fraud by claiming election stolen, raising funds on same then putatively to find fraud but instead directed to other purposes<p>- possibly bribes by promising to pay legal fees or coopting behavior through Presidential pardons<p>- (domestic) terrorism by attacking the Capitol<p>all of which are included in RICO. Plus Jan6 in aggregate were multi-state including known organizations like the Proud Boys.",
      "time": 1657599753,
      "title": "Ask HN: Prosecute Jan6 defendants under RICO?",
      "type": "story"
    },
    {
      "by": "MikusR",
      "descendants": 0,
      "id": 32065566,
      "score": 1,
      "time": 1657599423,
      "title": "Windows Autopatch Has Arrived",
      "type": "story",
      "url": "https://techcommunity.microsoft.com/t5/windows-it-pro-blog/windows-autopatch-has-arrived/ba-p/3570119"
    },
    {
      "by": "keerthanpg",
      "descendants": 0,
      "id": 32065550,
      "score": 1,
      "time": 1657599259,
      "title": "Lessons from the Grassroots and Reflections on Effective Altruism",
      "type": "story",
      "url": "https://keerthanapg.com/policy/ea_disha_seema/"
    },
    {
      "by": "voisin",
      "descendants": 0,
      "id": 32065549,
      "score": 1,
      "time": 1657599251,
      "title": "Impact of height and weight on life span – PubMed",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/1600586/"
    },
    {
      "by": "quickaskq",
      "descendants": 0,
      "id": 32065541,
      "score": 1,
      "text": "Hey HN. There’s not much reliable &#x2F; unbiased analysis of SpaceX’s mission statement of making humanity multiplanetary. So, what are the chances? I’ve been following spacex for a while and, ignoring all the elon shenanigans old and new, they do incredible stuff. Docking with the space station, humans on the space station, reusable rockets launching more than weekly… it’s insane. The progress they’ve made in the last 15 years is unheard of, only rivaled by the Apollo program.<p>But a self sustaining civilization on Mars? I’m skeptical. Yes, it’s physically possible. And spacex seems to be heading in the right direction. But the sheer difficulty of the problem I think is sometimes understated.<p>Elon’s rough estimates on what it’ll take to create a self sustaining civilization vary from interview to interview. One quote:<p>“Roughly 800 to 1000 per year. That’s about what’s needed over ten years to create the fleet to build a self-sustaining city on Mars”<p>More than 3 launches per day for 10 years? That’s where the impossibility of it all starts to seep in.<p>Many seemingly unsolvable problems also arise. Where does the money come from? How will we make the Martian surface habitable? Even if getting launch costs down to 2 million as Musk stated once is possible (hard to believe, Falcon 9 is nowhere near that today), the amount of peripheral costs (maintenance, staffing, logistics, training, the list goes on) is extraordinary.<p>I’m pretty sure they’ll get to mars in the next 10 years. And they even have a good shot and doing that multiple times. But based on the sheer amount of payload that needs to get to Mars, it seems like a mission that will exceed the lifetime of SpaceX.",
      "time": 1657599177,
      "title": "Ask HN: Does SpaceX have a chance at making life multiplanetary?",
      "type": "story"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 32065523,
      "score": 2,
      "time": 1657599055,
      "title": "Stack Exchange sites are getting prettier faster: Introducing Themes",
      "type": "story",
      "url": "https://stackoverflow.blog/2022/07/11/stack-exchange-sites-are-getting-prettier-faster-introducing-themes/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32065472,
      "score": 1,
      "time": 1657598612,
      "title": "Commander Keen in Keen Dreams",
      "type": "story",
      "url": "https://github.com/keendreams/keen"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32065469,
      "score": 1,
      "time": 1657598602,
      "title": "Woo: A fast non-blocking HTTP server on top of libev",
      "type": "story",
      "url": "https://github.com/fukamachi/woo"
    }
  ]
}