{
  "stories": [
    {
      "by": "riffic",
      "descendants": 0,
      "id": 29144308,
      "score": 2,
      "time": 1636325126,
      "title": "Breaking Tech Open: Why Social Platforms Should Work More Like Email",
      "type": "story",
      "url": "https://thereboot.com/breaking-tech-open-why-social-platforms-should-work-more-like-email/"
    },
    {
      "by": "codingclaws",
      "descendants": 0,
      "id": 29144307,
      "score": 2,
      "time": 1636325120,
      "title": "Ask HN: How many laws are there in each country?",
      "type": "story"
    },
    {
      "by": "pezzana",
      "descendants": 0,
      "id": 29144303,
      "score": 2,
      "time": 1636325086,
      "title": "Are Humans to Blame for the Disappearance of Earth’s Fantastic Beasts? (2017)",
      "type": "story",
      "url": "https://www.smithsonianmag.com/science-nature/what-happened-worlds-most-enormous-animals-180964255/"
    },
    {
      "by": "Rphad",
      "descendants": 0,
      "id": 29144288,
      "score": 2,
      "time": 1636324981,
      "title": "Show HN: Send encrypted messages to Ethereum addresses",
      "type": "story",
      "url": "https://www.commeth.org/demo/"
    },
    {
      "by": "thedevelopnik",
      "descendants": 0,
      "id": 29144282,
      "score": 2,
      "time": 1636324948,
      "title": "Denuvo game DRM forgets to renew domain, breaks games",
      "type": "story",
      "url": "https://twitter.com/alexbuckland96/status/1457380056716783619"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 29144267,
      "score": 2,
      "time": 1636324797,
      "title": "Superhero cosplay makes you a better person for one science-backed reason",
      "type": "story",
      "url": "https://www.inverse.com/mind-body/superhero-cosplay-scientific-benefits"
    },
    {
      "by": "open-source-ux",
      "descendants": 1,
      "id": 29144228,
      "kids": [
        29144253
      ],
      "score": 2,
      "time": 1636324462,
      "title": "Climate change statistics UK: prototype portal for data and insights",
      "type": "story",
      "url": "https://climate-change.data.gov.uk/"
    },
    {
      "by": "sonicrocketman",
      "descendants": 1,
      "id": 29144207,
      "kids": [
        29144306
      ],
      "score": 3,
      "time": 1636324273,
      "title": "Show HN: Hewell, a travel app powered by WikiData",
      "type": "story",
      "url": "https://hewllapp.com/"
    },
    {
      "by": "retention456",
      "descendants": 0,
      "id": 29144200,
      "score": 2,
      "text": "I&#x27;m the founder of an early stage startup, located in a city where there are many job opportunities for software developers. As a developer myself, I know that it is very common for developers to switch companies every few years, in order to land significant pay increases. I know many people like to stigmatize this behavior, but I would never blame someone for wanting to grow their compensation. I&#x27;m also aware that if someone were to leave, we would incur significant costs in replacing them, ramping up their replacement, and re-learning the institutional knowledge that is lost.<p>For this reason, I would like to have a company policy that tells everyone explicitly that if they inform us of a job offer, we will never hold it against them, and we will never treat them negatively in future. And if the person is a valuable asset to the team, and genuinely interested in staying with us, we will match their job offer and do what we can to retain them.<p>I&#x27;ve had advisors tell me that saying this out loud is a bad idea, because it will encourage everyone to shop for offers. I can see their point, but I think it&#x27;s worth the downside if it can help us better retain our most talented employees. I&#x27;m also aware that people leave for many different reasons, and it won&#x27;t solve the attrition problem single-handedly (we&#x27;re early enough that no one has left us so far). But I figured this policy would be a win even if it only addresses some of the reasons for attrition.<p>Has anyone had experiences with companies where counter-offers were well-known or normalized? If so, how would you describe the impact it had on company culture and retention?",
      "time": 1636324244,
      "title": "Ask HN: Is it good to have a company policy that normalizes counter-offers?",
      "type": "story"
    },
    {
      "by": "etc-hosts",
      "descendants": 0,
      "id": 29144169,
      "score": 1,
      "time": 1636324093,
      "title": "Infrastructure Bill Includes Beacons for Bicyclists and Pedestrians",
      "type": "story",
      "url": "https://www.forbes.com/sites/carltonreid/2021/11/06/bidens-12-trillion-infrastructure-bill-hastens-beacon-wearing-for-bicyclists-and-pedestrians-to-enable-detection-by-connected-cars/"
    }
  ]
}