{
  "stories": [
    {
      "by": "xbmcuser",
      "descendants": 0,
      "id": 28329731,
      "score": 1,
      "time": 1630081547,
      "title": "The Semiconductor Heist of the Century – Arm China Has Gone Completely Rogue",
      "type": "story",
      "url": "https://semianalysis.substack.com/p/the-semiconductor-heist-of-the-century"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28329728,
      "score": 1,
      "time": 1630081544,
      "title": "Postmortem Lessons – A Survey",
      "type": "story",
      "url": "https://postmortems.info/t/postmortem-lessons-a-survey-from-dan-luu/717"
    },
    {
      "by": "yasp",
      "descendants": 0,
      "id": 28329714,
      "score": 1,
      "text": "On Tuesday I bought a book. Amazon was selling it with two-day shipping for Prime members. Cut to today, it&#x27;s not projected to arrive until Monday. More than slightly late for something that should have only taken two days. Oh well - lots of Prime members have similar experiences. But this next one takes the cake for me.<p>On Wednesday, I buy an electric toothbrush. I place the order at 11:00 am. At checkout, they tell me they can get it to me same day, between 2:00 - 6:00 pm. Err, seems slightly ambitious, but it&#x27;s free, so why not?<p>Predictably, the toothbrush doesn&#x27;t arrive same day. Nor the following day. And now when I click Track Package, they tell me that it&#x27;s likely lost, and maybe I want to request a refund. So I request a refund and they tell me that it will take 3 - 5 days to process, and also that I&#x27;m obligated to return the package if it arrives in the interim. So now I&#x27;m stuck trying to decide whether to re-order through Amazon or to go with a different website, plus I need to find time to go to the Amazon store due to their screw-up.<p>And further, there seems to be no way to complain to Amazon about this. It used to be that if they missed their delivery targets they would credit you with a free month of Prime. That no longer seems to be the case, as far as I can tell.<p>The part that is so frustrating though is that in the back of my mind I knew that there was almost zero chance that the package would be delivered same day and that I would be better off doing a different shipping method. I don&#x27;t understand why they would go out of their way to set users up for such a bad experience.",
      "time": 1630081500,
      "title": "Ask HN: Why is the Amazon purchase experience so hilariously bad sometimes?",
      "type": "story"
    },
    {
      "by": "tortilla",
      "descendants": 0,
      "id": 28329711,
      "score": 1,
      "time": 1630081474,
      "title": "Peloton drops the price of its original Bike by $400 amid poor earnings results",
      "type": "story",
      "url": "https://www.theverge.com/2021/8/27/22643715/peloton-bike-price-drop-q4-results-subscription-prices"
    },
    {
      "by": "ducktective",
      "descendants": 0,
      "id": 28329672,
      "score": 2,
      "time": 1630081228,
      "title": "nimforum: Lightweight alternative to Discourse written in Nim",
      "type": "story",
      "url": "https://github.com/nim-lang/nimforum"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 28329660,
      "score": 2,
      "time": 1630081127,
      "title": "Australia’s cane toads evolved as cannibals with frightening speed",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-021-02317-9"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 28329654,
      "score": 2,
      "time": 1630081099,
      "title": "US adults are 42.4% obese – Related conditions are leading causes of death",
      "type": "story",
      "url": "https://www.cdc.gov/obesity/data/adult.html"
    },
    {
      "by": "lsllc",
      "descendants": 0,
      "id": 28329644,
      "score": 1,
      "time": 1630081051,
      "title": "Light pollution from street lamps linked to insect loss",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-58333233"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 28329642,
      "score": 1,
      "time": 1630081035,
      "title": "Happy birthday, Linux: From a bedroom project to billions of devices in 30 years",
      "type": "story",
      "url": "https://www.theregister.com/2021/08/25/linux_kernel_30_years_old/"
    },
    {
      "by": "megaroofing",
      "descendants": 1,
      "id": 28329639,
      "kids": [
        28329640
      ],
      "score": 1,
      "time": 1630081014,
      "title": "Roof Installation in Calgary has become so much easier now",
      "type": "story",
      "url": "https://megaroofingca.quora.com/Roof-Installation-in-Calgary-has-become-so-much-easier-now?share=1"
    }
  ]
}