{
  "stories": [
    {
      "by": "bixlives",
      "descendants": 0,
      "id": 27863212,
      "score": 1,
      "text": "TEA BLENDING AT HOME\n    I am a serious &quot;Tea-Head&quot;.  In the last 20 years I have become adept at simple blending.  The first secret of tea blending is that Ceylon teas are the most powerful blending teas. 10% to 15% Ceylon can magically transform an undrinkable Puttabong 2nd flush into a palatable Darjeeling.<p>INDONESIAN TEA\n   About 20 years ago, Indonesia discovered that it could grow and ferment black tea in high quantity. —A highly inferior black tea, to be sure; but, IF expertly blended, usable as the base for grocery store teas.  Today, almost ALL grocery store teas have replaced their African tea base with cheaper Indonesian tea. \n    E.g., circa 2009, Lipton CHANGED IT&#x27;S USA BLEND. For over 100 years, the USA Lipton blend was THE superior grocery store tea. Lipton used 25 teas to make the blend. About, 40% African, 20% Indian, 20% Chinese and 10% Ceylon. This explains why the old Lipton USA blend WAS superior. —Hence, Lipton&#x27;s usage of the word &quot;BRISK&quot; in its advertising. \n    Solution; return to the old days, and buy only single estate Chinese and Indian teas. You will have better success with Chinese tea. You can NOT go wrong buying Darjeeling from The Makaibari and Castleton estates. \n    Buy some modest Ceylon.  If you get stuck with a poor Darjeeling, add 10% - 20% Ceylon tea and you will discover that you have a good Darjeeling after all. Any tea that has too much tannic acid; —just add a little Ceylon and it will usually be instantly transformed into a drinkable tea.<p>DYI BLENDING AND BUYING TEA\n    About 20 years ago, I began to experiment with some modest blending of my own.  My first success was to convert an undrinkable Puttabong Darjeeling to an enjoyable, palatable blend. All I did was blend with 10% - 20% of a modest Ceylon!  I paid way too much for the Puttabong, but this taught me that just because it is a Darjeeling does NOT mean that it is good.  The Puttabong estate is in the most northern region of Darjeeling. \n    After a few more northern single estate Darjeelings, I learned my lesson!  —Stick to the more southern Darjeelings.  If you are new to Darjeeling tea, buy only Makaibari or Castleton Darjeeling (be sure it IS from one of these estates!).  \n  I buy more Chinese tea than Darjeeling. Let&#x27;s face it, the Chinese have been at this game for far longer than anyone else. &quot;All the tea in China&quot; is not an empty expression. I have never bought bad single estate Chinese tea. In fact, I rarely find blended Chinese teas for sale.  In short, the Chinese know more about making good tea than any other people.  If you buy an inexpensive —Yunnan or Hunan, you cannot go wrong.  E.g. my favourite Keemun single estate costs me about £15 for a half kilo, and this lasts for at least 8 months (keep tea well-wrapped and in your ice box).  This Keemun has a great malty taste with overtones of chocolate, yet clearly presents itself as a Keemun Chinese tea. Tea is relatively inexpensive and life is too short to drink bad tea.  If you want to simplify everything, just buy any Chinese Yunnan you find on the web along with a small amount of an average Ceylon for blending your grocery store teas into palatability.   \n   If you crave the Indian taste, why not try ASSAM?  The Assam region of India produces a more consistent product than The Darjeeling District.  —Never had a poor Assam. Assam is full of caffeine and almost matches African tea for caffeine (50% less than strong coffee).  —Good with milk or brewed lightly without milk. You cannot go wrong.",
      "time": 1626489773,
      "title": "Tea Changes, Bending, Indonesia",
      "type": "story"
    },
    {
      "by": "jdmark",
      "descendants": 0,
      "id": 27863197,
      "score": 2,
      "time": 1626489465,
      "title": "Activity discovered on largest comet ever found",
      "type": "story",
      "url": "https://phys.org/news/2021-07-largest-comet.html"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 27863196,
      "score": 1,
      "time": 1626489461,
      "title": "I’m Worried Nobody Will Care About Rollups",
      "type": "story",
      "url": "https://medium.com/dragonfly-research/im-worried-nobody-will-care-about-rollups-554bc743d4f1"
    },
    {
      "by": "jdmark",
      "descendants": 0,
      "id": 27863194,
      "score": 3,
      "time": 1626489441,
      "title": "The Largest Comet Ever Found Is Making Its Move into a Sky Near You",
      "type": "story",
      "url": "https://www.nytimes.com/2021/06/28/science/comet-largest-ever-seen.html"
    },
    {
      "by": "sarayourfriend",
      "descendants": 0,
      "id": 27863182,
      "score": 1,
      "time": 1626489269,
      "title": "Estrella: Lightweight and versatile build tool based on the esbuild compiler",
      "type": "story",
      "url": "https://github.com/rsms/estrella"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 27863178,
      "score": 2,
      "time": 1626489204,
      "title": "Colombia’s female FARC fighters wage a new war, for gender parity",
      "type": "story",
      "url": "https://www.thenewhumanitarian.org/feature/2017/09/07/colombia-s-female-farc-fighters-wage-new-war-gender-parity"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 27863161,
      "score": 1,
      "time": 1626488954,
      "title": "A Paralyzed Man's Brain Waves Converted to Speech in a World-First Breakthrough",
      "type": "story",
      "url": "https://www.sciencealert.com/scientists-have-converted-a-paralyzed-man-s-brain-waves-to-speech"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 27863152,
      "score": 1,
      "time": 1626488824,
      "title": "World Record: 319 Tb/s Transmission over 3,001 km with 4-core optical fiber",
      "type": "story",
      "url": "https://www.nict.go.jp/en/press/2021/07/12-1.html"
    },
    {
      "by": "highfrequency",
      "descendants": 0,
      "id": 27863150,
      "score": 1,
      "time": 1626488823,
      "title": "Long Live Commodity Capital",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/13/the-techcrunch-list-is-dead-long-live-commodity-capital/"
    },
    {
      "by": "vpj",
      "descendants": 0,
      "id": 27863128,
      "score": 1,
      "time": 1626488451,
      "title": "The Benchmark Lottery [Paper]",
      "type": "story",
      "url": "https://papers.labml.ai/paper/2107.07002"
    }
  ]
}