{
  "stories": [
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 31273365,
      "score": 1,
      "time": 1651758887,
      "title": "Anticipating New Spam Domains Through Machine Learning",
      "type": "story",
      "url": "https://www.unite.ai/anticipating-new-spam-domains-through-machine-learning/"
    },
    {
      "by": "dlcmh",
      "descendants": 0,
      "id": 31273338,
      "score": 1,
      "time": 1651758740,
      "title": "Zhejiang University develops a new drone navigation system",
      "type": "story",
      "url": "https://www.newscientist.com/article/2318637-watch-a-swarm-of-drones-navigate-a-forest-without-crashing/"
    },
    {
      "by": "vijayr02",
      "descendants": 0,
      "id": 31273333,
      "score": 1,
      "time": 1651758692,
      "title": "Rivian’s CEO became the anti-Elon",
      "type": "story",
      "url": "https://www.ft.com/content/1cab9637-5135-4da8-b0af-a0b56bab84a5?shareType=nongift"
    },
    {
      "by": "camjohnson26",
      "descendants": 0,
      "id": 31273314,
      "score": 3,
      "time": 1651758613,
      "title": "Declassified memo 'confirms' direct connection between Saudi government and 9/11",
      "type": "story",
      "url": "https://www.businessinsider.com/saudi-government-911-new-documents-direct-connection-bayoumi-mihdhar-2022-5"
    },
    {
      "by": "haidrali",
      "descendants": 0,
      "id": 31273312,
      "score": 1,
      "text": "YouTube have removed my channel because of Goole Community Guidelines violations. In reality there is no violation, there is only 1 video which I have posted 2 years back. And that video was a screen recording for AWS S3 file upload from client side process that I showed in my personal blog at https:&#x2F;&#x2F;haidrali.com&#x2F;aws-s3-file-upload-from-client-side&#x2F;.<p>I have read all the community guidelines, can&#x27;t figured it out how it violet Google Community Guidelines. Anyone please help me understand the what could be the hidden issue (maybe someone reported my channel).<p>Thank You!",
      "time": 1651758609,
      "title": "Ask HN: YouTube removed my channel without any reason",
      "type": "story"
    },
    {
      "by": "agd",
      "descendants": 0,
      "id": 31273303,
      "score": 2,
      "time": 1651758563,
      "title": "Shopify to Acquire Delivrr for $2.1B",
      "type": "story",
      "url": "https://news.shopify.com/oh-ship-shopify-to-acquire-deliverr-for-21b-building-the-future-of-global-logistics-for-independent-brands"
    },
    {
      "by": "Maro",
      "descendants": 0,
      "id": 31273264,
      "score": 1,
      "time": 1651758422,
      "title": "Five ways to reduce variance in A/B testing",
      "type": "story",
      "url": "https://bytepawn.com/five-ways-to-reduce-variance-in-ab-testing.html"
    },
    {
      "by": "Victerius",
      "descendants": 0,
      "id": 31273263,
      "score": 3,
      "time": 1651758418,
      "title": "NFT sales ‘have declined 92% since their peak’",
      "type": "story",
      "url": "https://www.videogameschronicle.com/news/nft-sales-have-declined-92-since-their-peak/"
    },
    {
      "by": "svhnohio",
      "descendants": 0,
      "id": 31273256,
      "score": 1,
      "text": "For the past couple years I&#x27;ve been trying to learn Android app development. I&#x27;ve been working as a &#x27;software engineer&#x27; off and on for 10 years simply out of corporate need (didn&#x27;t go to school for). I had an idea for a personal note taking app and now I&#x27;m considering the possibility of releasing it. In my search for testers, Hacker News came up many times and I thought this may be a good place to post and request some testing and evaluation. As the site rules indicate, I&#x27;m looking for honest, respectful, helpful input.<p>ABOUT THE APP<p>The app is called ResearchDB, a &quot;documenting&quot; form of note taking app - meaning it requires you to &quot;document&quot; your source and has a 1&#x2F;2 dozen required fields. In other words, the purpose of this note taking app is not just noting something of interest, but &quot;supportively documenting&quot; the note and source. This is why I call it ResearchDB. We all have particular, beliefs, ideas, interests, and this note taking app is intended to be a way to document those beliefs, interests and ideas through the creation of multiple &quot;subject-based&quot; databases containing notes in a way that helps us remember and recall those things in a way that helps us remember them. And since it is a phone app, we can recall and pull up those supportive notes at any moment with our handy smartphone.<p>THE APK TARGET COMPATABITY<p>The Minimum SDK is 28 and the target is 30\nIt requires Internet and Storage (read&#x2F;write) permissions so that you have the ability to document sources and can export or import notes and databases on topics of interests.<p>ABOUT THE LINKS<p>I have included a link to the Android APK for downloading and a YouTube link which demonstrates the intent and how to use the app in 9-10 minutes. The APK link takes you to &quot;ufile.io&quot; - a web storage source I use, but it is free to download, there is not a requirement to sign up, create an account or purchase, simply just choose the slower - free download option. The APK should be signed and I will assume a tester may know how to sideload it through developer options to their Android phone.<p>APK\nhttps:&#x2F;&#x2F;ufile.io&#x2F;kw5gonpc<p>YouTube\nhttps:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OvpgviLECXA<p>BTW, the app also includes a PDF pictorial guide on how to do everything - besides the YouTube video.<p>I wasn&#x27;t sure whether or not I should include one of these links above and which would be a more appropriate choice if so. Since it says &quot;OR&quot; between the URL field and posting field here, I didn&#x27;t read that I couldn&#x27;t add them here, but let me know whether I posted these links incorrectly.<p>Thanks for this opportunity and being willing to test and try this if you do.<p>- Scott",
      "time": 1651758391,
      "title": "Show HN: Looking for review, input, etc. of First Android Android app",
      "type": "story"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 31273247,
      "score": 1,
      "time": 1651758365,
      "title": "What If You Didn’t Have to File a Tax Return?",
      "type": "story",
      "url": "https://economistwritingeveryday.com/2022/05/04/what-if-you-didnt-have-to-file-a-tax-return/"
    }
  ]
}