{
  "stories": [
    {
      "by": "maith1",
      "descendants": 0,
      "id": 32179530,
      "score": 2,
      "text": "Maitham here, we’re building an API for at-home health data (<a href=\"https:&#x2F;&#x2F;tryvital.io\" rel=\"nofollow\">https:&#x2F;&#x2F;tryvital.io</a>). We allow developers to easily connect to hundreds of wearable devices and deliver at-home lab tests to their users, with a few lines of code.<p>Health data from wearables and labs sit in various data sources, each requiring a different integration. Most with bad documentation and some even needing a partnership. Data collected from these sources play a crucial role in health monitoring. Our goal is to enable developers to build applications on top of it.<p>Having previously worked as an engineer at a telehealth company, I saw firsthand how hard it is to build and maintain integrations with labs, wearables and medical devices. I personally became a health enthusiast trying to fix my own problems after having over ten surgeries, suffering from IBS, and sleep apnea.<p>We’ve built an API that gives you access to over 300 devices directly through our SDKs or our API. We also expose a plaid-like widget to connect devices. For our lab test API, we have partnered with independent labs in the US and have a physician network covering all 50 states, allowing any company to order at-home functional tests. Our docs can be found here (<a href=\"https:&#x2F;&#x2F;docs.tryvital.io\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.tryvital.io</a>).<p>Our existing customers use our API to build apps to help allergy sufferers, wellness and fitness coaching, metabolic health support, and sleep optimisation. We have an API for individual developers and we charge based on the number of connected users and a platform fee for at-home lab tests. We open-source all our libraries and SDK’s, and hope by doing so we can both encourage more open data standards and alleviate privacy concerns.<p>One last thing! We know privacy is extremely important when it comes to health data, we anonymise all data by default and we use Evervault to encrypt the data, you can read more about it here <a href=\"https:&#x2F;&#x2F;docs.tryvital.io&#x2F;welcome&#x2F;privacy\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.tryvital.io&#x2F;welcome&#x2F;privacy</a>. We also have an upcoming feature to set auto-expiry on data, that allows companies to set a period that the data stays stored for.",
      "time": 1658412247,
      "title": "Launch HN: Vital (YC W20) – API for wearables and labs",
      "type": "story",
      "url": "https://tryvital.io/"
    },
    {
      "by": "mdrzn",
      "descendants": 0,
      "id": 32179528,
      "score": 1,
      "time": 1658412238,
      "title": "Re-Listen to old concerts for free",
      "type": "story",
      "url": "https://relisten.net/"
    },
    {
      "by": "kordlessagain",
      "descendants": 0,
      "id": 32179520,
      "score": 1,
      "time": 1658412173,
      "title": "Outline: A fast, collaborative, knowledge base for your team",
      "type": "story",
      "url": "https://github.com/outline/outline"
    },
    {
      "by": "richardreeze",
      "descendants": 0,
      "id": 32179490,
      "score": 1,
      "time": 1658412021,
      "title": "Top 10 Books Billionaires Recommend",
      "type": "story",
      "url": "https://www.forbes.com/sites/jodiecook/2022/07/21/the-top-10-books-billionaires-recommend/"
    },
    {
      "by": "bquaresma",
      "descendants": 0,
      "id": 32179487,
      "score": 2,
      "time": 1658412005,
      "title": "Larger Codebase Using XState",
      "type": "story",
      "url": "https://github.com/coder/coder/tree/main/site/src/xServices"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 32179463,
      "score": 1,
      "time": 1658411901,
      "title": "Stride Game Engine 4.1 release",
      "type": "story",
      "url": "https://www.stride3d.net/blog/release-stride-4-1/"
    },
    {
      "by": "jeremylevy",
      "descendants": 0,
      "id": 32179459,
      "score": 1,
      "time": 1658411877,
      "title": "Don’t Be an Evolutionary Programmer",
      "type": "story",
      "url": "https://software.rajivprab.com/2018/04/29/dont-be-an-evolutionary-programmer/"
    },
    {
      "by": "076ae80a-3c97-4",
      "descendants": 0,
      "id": 32179450,
      "score": 3,
      "time": 1658411830,
      "title": "Squarespace Fluid Engine: drag-and-drop website editor",
      "type": "story",
      "url": "https://www.squarespace.com/websites/fluid-engine"
    },
    {
      "by": "capableweb",
      "descendants": 0,
      "id": 32179442,
      "score": 1,
      "text": "The discussion of chip implants came up yesterday in a subthread in the submission about Flipper Zero (https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=32166058)<p>Led me down a bit of a rabbit hole to see what the current status is of chip implants.<p>Dangerous Things seems to have a bunch of interesting implants of various kinds: https:&#x2F;&#x2F;dangerousthings.com&#x2F;<p>There are also companies like VivoKey (https:&#x2F;&#x2F;www.vivokey.com&#x2F;) and Walletmor (https:&#x2F;&#x2F;walletmor.com&#x2F;) that does payment implants.<p>The whole area is still relatively niche though, but what is HN better at than niche interests?<p>So I&#x27;m asking you who either has or had chip implants, do&#x2F;did you regret doing it? Anything in particular that was unexpected from having the implant?",
      "time": 1658411774,
      "title": "Ask HN: Anyone regretted getting a chip implant?",
      "type": "story"
    },
    {
      "by": "amadeuspagel",
      "descendants": 0,
      "id": 32179438,
      "score": 1,
      "text": "I use tab-to-search a lot, but I recently noted that it stopped working for some websites. You can still activate tab-to-search for those websites manually in the search settings, so it&#x27;s not like there&#x27;s something wrong with their opensearch.xml.<p>Anyone has the same experience?",
      "time": 1658411768,
      "title": "Ask HN: Did Chrome nerf tab-to-search?",
      "type": "story"
    }
  ]
}