{
  "stories": [
    {
      "by": "awb",
      "descendants": 0,
      "id": 30496249,
      "score": 1,
      "time": 1646020643,
      "title": "Ups and FedEx halting shipments to Russia and Ukraine",
      "type": "story",
      "url": "https://www.reuters.com/business/autos-transportation/ups-fedex-halting-shipments-russia-ukraine-2022-02-27/"
    },
    {
      "by": "danhab99",
      "descendants": 0,
      "id": 30496238,
      "score": 1,
      "text": "The worst part of my day is when I put on my glasses. I hate wearing glasses. They&#x27;re never clean, I can always see dust and lens flares which means all my software has to be in nightmode. I can feel them on my ears all the time, it doesn&#x27;t matter how good my glasses are I&#x27;m just constantly aware of my ears. I hate breaking them in, I&#x27;ve been wearing the same glasses for 5 years. And contacts are not a good solution for me, (this is literally just me) the first time I fail to get one in my mind is filled with every frustrating event thats ever happened to me and I can&#x27;t continue.<p>The correct solution for me is to get my eyes lasered, but thats expensive, dangerous, and involves a recovery period.<p>I don&#x27;t mind wearing my glasses all day. I just wanted to ask if someone knew a better way?",
      "time": 1646020546,
      "title": "Ask HN: How can I see my screens without needing glasses",
      "type": "story"
    },
    {
      "by": "whouare",
      "descendants": 0,
      "id": 30496234,
      "kids": [
        30496235
      ],
      "score": 1,
      "time": 1646020513,
      "title": "Google Maps suspends live traffic layer in Ukraine",
      "type": "story",
      "url": "https://edition.cnn.com/europe/live-news/ukraine-russia-news-02-27-22/index.html"
    },
    {
      "by": "derekpankaew",
      "descendants": 0,
      "id": 30496229,
      "score": 1,
      "text": "I&#x27;m looking to build a raspberry pi smart mirror.<p>On Amazon and AliExpress, there are a bunch of Android-based smart mirrors with pre-built operating systems.<p>On the other hand, there are a lot of DIY guides where you build the mirror from scratch, including cutting wood and attaching the mirror.<p>What I&#x27;d like is just the smart mirror, pre-built, but as a display only. I want to attach the HDMI cable and control the display using a raspberry pi.<p>Is there anywhere I can just buy the smart mirror, without operating system, and without having to build it myself?",
      "time": 1646020454,
      "title": "Ask HN: Is there a smart mirror with HDMI input?",
      "type": "story"
    },
    {
      "by": "hboon",
      "descendants": 0,
      "id": 30496196,
      "score": 1,
      "text": "Used https:&#x2F;&#x2F;www.stathat.com&#x2F; for a few projects, and wanted to sign up an account for a new one but it looks like it might not be maintained anymore.<p>Any good alternatives that matches:<p>* Extremely easy to use &quot;analytics&quot;\n* Just want to send a label + a number (often just a +1) and for it to be charted. For example, +1 everything we call a specific API server, and we get a usage call chart \n* Throwaway or short term data; the usual analytics solutions like Mixpanel aren&#x27;t so suitable\n* SaaS",
      "time": 1646020276,
      "title": "Ask HN: Alternatives to StatHat",
      "type": "story"
    },
    {
      "by": "schappim",
      "descendants": 1,
      "id": 30496189,
      "kids": [
        30496225
      ],
      "score": 1,
      "text": "We&#x27;re seen in the past geo-fence warrants [1] used by law enforcement to find all active mobile devices within a particular geo-fence area and we&#x27;ve also seen how fitness data has revealed the location of military bases[2].<p>Could the same techniques be used by the UA government to seek data on Russian ground movements? Is it likely that Apple&#x2F;Google would comply with such a request?<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Geo-fence_warrant\n[2] https:&#x2F;&#x2F;www.bbc.com&#x2F;news&#x2F;technology-42853072",
      "time": 1646020210,
      "title": "Ask HN: Can Ukraine gov ask Google / Apple for geolocation data?",
      "type": "story"
    },
    {
      "by": "eth0up",
      "descendants": 0,
      "id": 30496188,
      "score": 1,
      "time": 1646020208,
      "title": "Pandora Papers",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Pandora_Papers"
    },
    {
      "by": "gtirloni",
      "descendants": 0,
      "id": 30496160,
      "score": 1,
      "time": 1646019936,
      "title": "Computer chip industry begins halting deliveries to Russia",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2022/02/25/ukraine-russia-chips-sanctions-tsmc/"
    },
    {
      "by": "neustradamus",
      "descendants": 0,
      "id": 30496137,
      "score": 2,
      "time": 1646019732,
      "title": "Slixmpp 1.8.0 has been released – XMPP library for Python – SleekXMPP",
      "type": "story",
      "url": "https://lab.louiz.org/poezio/slixmpp/-/releases/slix-1.8.0"
    },
    {
      "by": "alex-wallish",
      "descendants": 0,
      "id": 30496117,
      "score": 1,
      "time": 1646019589,
      "title": "The Authority to Use Nuclear Weapons in Nuclear-Armed States [pdf]",
      "type": "story",
      "url": "https://nonproliferation.org/wp-content/uploads/2019/02/Finger-on-the-Nuclear-Button.pdf"
    }
  ]
}