{
  "stories": [
    {
      "by": "alphabetting",
      "descendants": 0,
      "id": 28758448,
      "score": 1,
      "time": 1633436884,
      "title": "Google’s DeepMind turns first profit as revenues soar",
      "type": "story",
      "url": "https://www.standard.co.uk/business/google-deepmind-profit-sales-demis-hassabis-b958879.html"
    },
    {
      "by": "ChemSpider",
      "descendants": 0,
      "id": 28758431,
      "score": 1,
      "time": 1633436787,
      "title": "Ellis (EU Machine Learning) PhD Program: Call for Applications",
      "type": "story",
      "url": "https://ellis.eu/news/ellis-phd-program-call-for-applications-deadline-november-15-2021"
    },
    {
      "by": "ikegittlen",
      "descendants": 0,
      "id": 28758426,
      "score": 1,
      "text": "On Five Strategies to Get Everyone to Save the Planet:  We probably can’t even pronounce their names right and I’d venture to guess most of us never heard of them.  Syukuro Manabe, Klaus Hasselmann and Giorgio Parisi anyone?  They’re the trio that just won the Nobel Prize for a lifetime of work on climate change science.  Oh that!  Yeah that!  They have applied their exceptional brainpower to show the rest of us that we’re killing our planet.  Talk about Mission Impossible!<p>They, and many other people who pursue scientific careers have a foolish idea.  They think that if they can explain the physical and biological processes that form the basis of human life, we will pay attention.  More foolish yet, they believe if they use those findings to predict negative outcomes and offer up some ways to avert them, we will listen and act.  Fortunately, there isn’t a Nobel Prize for misunderstanding the version of human beings now populating the earth.<p>Version “human2021” is a strange biped.  We dismiss sixty years of scientific work but believe a politician who tells us to chug Clorox and horse dewormer to avoid a virus.  We’ll simply deny unpleasant truths.  We’ll find crackpots that tell us we’re right and ignore those who have proven we’re wrong.  “Don’t’ worry, be angry”, is human2021’s algorithm.<p>The scientists have a secret weapon in their efforts to get us to pay attention and do something.  Funny thing about facts.  They prove out.  Thus it is, that human2021 is increasingly being confronted with exactly what these three scientific pioneers predicted.  The storms rage, the waters rise, the warming escalates and the planet chokes and coughs.  It would go a lot easier for human2021 if they respected the scientific method instead of running head first into avoidable calamity.<p>If our brilliant minds and forward thinkers want their work to be accepted and acted on, here’s a bit of advice about human2021.  #1- you’re issue has to impact them immediately and directly.   If human2021 can push it off on their kids or neighbors, it’s not going to get their attention.  #2 – Never, Never, Never admit you’re a scientist or that your issue is founded in research or fact.  Get some right-wing media opportunist to claim that you’re a “well respected” no-nothing with fake credentials who is warning human2021 not to listen to those “elites”.  Human2021 will flock to you and shower you with more money than you’ll ever see from that Nobel prize.  #3- Make your solution sound like something a fan at a football stadium would have fun doing.  Human2021 is into entertainment to the max.  You have to have pizza and beer involved somehow.  Mostly, you’ll have to figure out how to get human2021 to act in front of their TV or computer.  #4 – Piss human2021 off!  Not just upset them.  Drive them to distraction.  Get those neck veins popping and those nonsensical slogans spewing from them.  Tell them those they hate DON’T want them to act.  That doing something is an act of resistance!  Finally, #5 – Assure them that this is the patriotic and faith-based thing to do.  Don’t vest your findings in your studies and labs.  Say they came out of the Constitution and the Bible.  Get those founders and higher powers in your corner.  Five pieces of advice to save the planet.  And you’ll get rich following them.  This will work.  I’ve researched it all online!<p>Ihg 10-5-2021<p>If you like these commentaries, join my blog for free at: https:&#x2F;&#x2F;ikegittlen.substack.com&#x2F; and share. Let’s see what we can build together",
      "time": 1633436764,
      "title": "On Five Strategies to Get Everyone to Save the Planet",
      "type": "story"
    },
    {
      "by": "bloqs",
      "descendants": 0,
      "id": 28758415,
      "score": 1,
      "text": "If someone is a less able, cognitively impaired, or perhaps very young - It would be good to see what advice HN would give them for protecting their data from ransomware, theft, or disaster.",
      "time": 1633436682,
      "title": "Ask HN: How should I back up data on devices if I'm not smart?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28758392,
      "score": 1,
      "time": 1633436498,
      "title": "Raspberry Pi gets $45M to meet demand for low-cost PCs and IoT",
      "type": "story",
      "url": "https://techcrunch.com/2021/09/21/raspberry-pi-gets-45m-to-meet-demand-for-low-cost-pcs-and-iot/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 28758376,
      "score": 1,
      "time": 1633436326,
      "title": "Udemy S-1",
      "type": "story",
      "url": "https://www.sec.gov/Archives/edgar/data/0001607939/000119312521291460/d163445ds1.htm"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 28758361,
      "score": 1,
      "time": 1633436226,
      "title": "Desire Modification: The Ultimate Technology",
      "type": "story",
      "url": "http://noahpinionblog.blogspot.com/2012/08/desire-modification-ultimate-technology.html"
    },
    {
      "by": "Chan_Yuk_Chi",
      "descendants": 0,
      "id": 28758350,
      "score": 2,
      "time": 1633436127,
      "title": "How Space Companies Lose Money",
      "type": "story",
      "url": "https://sorryspeakup.substack.com/p/how-space-companies-lose-money"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 28758341,
      "score": 1,
      "time": 1633436065,
      "title": "More details on Instagram being underrated",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2021/10/more-details-on-instagram-being-underrated.html"
    },
    {
      "by": "MihikaBasu",
      "descendants": 0,
      "id": 28758317,
      "score": 2,
      "time": 1633435944,
      "title": "The Legitimacy of Influencer Marketing and What You Should Know",
      "type": "story",
      "url": "https://startuptoenterprise.com/legitimacy-of-influencer-marketing/"
    }
  ]
}