{
  "stories": [
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 29401544,
      "score": 1,
      "time": 1638343538,
      "title": "HyperStyle: StyleGAN Inversion with HyperNetworks for Real Image Editing",
      "type": "story",
      "url": "https://yuval-alaluf.github.io/hyperstyle/"
    },
    {
      "by": "Taraforu",
      "descendants": 0,
      "id": 29401526,
      "score": 1,
      "text": "Web3 has become a buzzword in the last few years. Next to metaverse and other concepts that lie between the intersection of technology and science fiction it has found it&#x27;s way into mainstream and pop culture this year through relentless usage in the growing sphere of Crypto Twitter, Discord and other social networks frequented by the BDL community.<p>But next to blockchain technologies, cryptocurrency and some billionaire&#x27;s childhood dreams adapted from science fiction novels Web3 actually has one core idea that is thriving and very real today, it&#x27;s the idea of collective driven action and governance.<p>Communities lie at the core of Web3 wether it&#x27;s the crypto space, creators economies or mixed reality. Often times they are the only existent value proposition that seemingly drives crappy &quot;garage projects&quot; to mainstream adoption and makes them billion dollar protocols and applications.<p>Afterwards you tend hear things like: &quot;Well the team just executed brilliantly, they had a grand vision or they simply built a phenomenal product&quot;, but those statements (while partially true) usually miss  the point. It&#x27;s communities that do most of the heavy lifting, they spread the word, they give feedback everyday, at every waking hour and they tend to be a lot more candid than manually recruited testers. They will also invest tremendous amounts of both time and money into helping the team to scale once they fall in love.<p>Combine all of this and you have every startups wet dream. An army of marketers&#x2F;sales people who spread the word 24&#x2F;7 with a passion and dedication that rivals those of the best founders. And they will do it all for free, heck the might even give the project money to be a part of it.<p>This really shows a shift from the traditional closed ecosystem of Investors, accelerators (like YC) and founding teams that has dominated the startup space for many decades.<p>Building in public with the people rather than for the people is no longer the exeption it is starting to become the norm. And this model has some tremendous advantages over the way things have been done until now.<p>If you don&#x27;t see the advantages of free feedback loops, free advertisement (through word of mouth) and a community of people to leverage an onboard from Day 1 than you probably haven&#x27;t paid much attention to what experienced founders and accelerators like YC have been preaching for years.<p>And it doesn&#x27;t stop there often times selected members from these communities will go even further than just spreading the word and telling you what&#x27;s on their mind. They will actually start working on the project themselves, no matter if that&#x27;s through helping you code faster by coding new features, or products themselves, or by creating art work, promotional material or visual art for the project,  others will translate your service into their language.<p>This kind of dedication can usually only be seen by founders and early employees but now you have an army of early supporters.<p>This way startups can go from having 5 official team members to hundreds if not thousands of people working on various parts of the organization at once. You can literally leverage the unique skill sets of thousands of strangers before the first MVP is out.<p>Obviously strong communities can&#x27;t replace products that solve real problems, but they can amplify the combined output and the value delivered by a mile (or two).<p>So the next time you get caught up in the all the buzz that surrounds the lates Web3 project and wonder how they managed to scale so incredibly quickly remember: Collective action can make even the biggest behemoths of tech look small.<p>And to all the founders out there, it should be clear what you need to do going into this new era, take Web3 as an example because this is not limited to crypto or consumer software. This can be replicated across most (not all) industries and there is no excuse to not a build a community today!",
      "time": 1638343266,
      "title": "Web3 or how communities will shape our World",
      "type": "story"
    },
    {
      "by": "gk1",
      "descendants": 0,
      "id": 29401509,
      "score": 1,
      "time": 1638343087,
      "title": "Intro to Vector Search for Developers",
      "type": "story",
      "url": "https://www.pinecone.io/learn/vector-search-basics/"
    },
    {
      "by": "2bor-2n",
      "descendants": 1,
      "id": 29401501,
      "kids": [
        29401534
      ],
      "score": 1,
      "text": "Let&#x27;s say you are in the 3rd&#x2F;4th round of your interview.<p>What sort of questions do you ask other than technology to make sure you are choosing the right company?",
      "time": 1638343006,
      "title": "Ask HN: What questions do you ask from companies during interview?",
      "type": "story"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29401492,
      "score": 1,
      "time": 1638342977,
      "title": "Study: Reduced meat diet has many advantages",
      "type": "story",
      "url": "https://www.uni-bonn.de/en/news/305-2021"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29401474,
      "score": 1,
      "time": 1638342646,
      "title": "Living Record (2018)",
      "type": "story",
      "url": "https://hms.harvard.edu/news/living-record"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29401472,
      "score": 1,
      "time": 1638342636,
      "title": "Leigh Alexander on finding joy and connection online (2019)",
      "type": "story",
      "url": "https://www.theverge.com/2019/1/16/18056926/leigh-alexander-interview-games-technology-sci-fi-better-worlds"
    },
    {
      "by": "sohkamyung",
      "descendants": 2,
      "id": 29401454,
      "kids": [
        29401500
      ],
      "score": 8,
      "time": 1638342419,
      "title": "Fisher Price Chatter Telephone with Bluetooth",
      "type": "story",
      "url": "https://www.fisher-price.com/en-us/product/chatter-telephone-hgj69"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 29401450,
      "score": 1,
      "time": 1638342364,
      "title": "Simple algebraic data types for C [pdf]",
      "type": "story",
      "url": "https://ris.utwente.nl/ws/portalfiles/portal/5096394/Jelsma89instructional.pdf"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29401412,
      "score": 1,
      "time": 1638341999,
      "title": "Are tech-enabled jobs sustainable enough to become lifelong career choices?",
      "type": "story",
      "url": "https://economictimes.indiatimes.com/prime/economy-and-policy/the-gig-picture-are-these-tech-enabled-jobs-sustainable-enough-to-become-lifelong-career-choices/primearticleshow/87989193.cms?from=mdr"
    }
  ]
}