{
  "stories": [
    {
      "by": "dguo",
      "descendants": 0,
      "id": 29994389,
      "score": 1,
      "time": 1642604379,
      "title": "A lone undersea internet cable connected Tonga to the world",
      "type": "story",
      "url": "https://www.theverge.com/22891031/tonga-volcano-eruption-broke-undersea-internet-cable-repair"
    },
    {
      "by": "GordonS",
      "descendants": 0,
      "id": 29994388,
      "score": 2,
      "time": 1642604375,
      "title": "Global spread of autoimmune disease blamed on western diet",
      "type": "story",
      "url": "https://www.theguardian.com/science/2022/jan/08/global-spread-of-autoimmune-disease-blamed-on-western-diet"
    },
    {
      "by": "harambae",
      "descendants": 0,
      "id": 29994377,
      "score": 1,
      "time": 1642604325,
      "title": "mRNA Boosters Don’t Block Omicron, South African Study Shows",
      "type": "story",
      "url": "https://www.bloombergquint.com/business/mrna-boosters-don-t-block-omicron-south-african-study-shows"
    },
    {
      "by": "jedwhite",
      "descendants": 0,
      "id": 29994366,
      "score": 1,
      "time": 1642604274,
      "title": "Reddit founder predicts 90% of games will be Play-to-Earn crypto in 5 years",
      "type": "story",
      "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/reddit-games-play-to-earn-crypto-b1996132.html"
    },
    {
      "by": "ser13",
      "descendants": 0,
      "id": 29994360,
      "score": 1,
      "time": 1642604252,
      "title": "An Inconvenient Truce",
      "type": "story",
      "url": "https://www.epsilontheory.com/an-inconvenient-truce/"
    },
    {
      "by": "veler",
      "descendants": 0,
      "id": 29994342,
      "score": 1,
      "text": "With a friend from the university, we realized that many developers are pasting sensitive data on random websites in order to decode some Base64, JWT, compress some images...etc without wondering what the website does with this data. Therefore, we developed a free, open source and completely offline Windows app designed to help with these little common tasks. \nWhile we released multiple updates these past months, we finally reached v1.0 today.<p>https:&#x2F;&#x2F;devtoys.app<p>Feedback appreciated :-)\nThanks!",
      "time": 1642604170,
      "title": "Show HN: DevToys.app – A Swiss Army knife for developers",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29994336,
      "score": 1,
      "time": 1642604152,
      "title": "Help Chile write free software, privacy, and digital sovereignty in constitution",
      "type": "story",
      "url": "https://drewdevault.com/2022/01/19/Help-Chile-promote-digital-freedoms.html"
    },
    {
      "by": "jedwhite",
      "descendants": 0,
      "id": 29994324,
      "score": 1,
      "time": 1642604093,
      "title": "Meta 'most reluctant' to work with government: Home Affairs",
      "type": "story",
      "url": "https://www.innovationaus.com/meta-most-reluctant-to-work-with-government-home-affairs/"
    },
    {
      "by": "Diesel555",
      "descendants": 0,
      "id": 29994312,
      "score": 2,
      "time": 1642604036,
      "title": "Emirates president: The 5G snafu is the biggest screwup witnessed in my career",
      "type": "story",
      "url": "https://www.cnn.com/2022/01/19/business/emirates-5g-quest/index.html"
    },
    {
      "by": "bbrenner2",
      "descendants": 0,
      "id": 29994310,
      "score": 7,
      "text": "Hi HN, we’re Brad, Kevin, &amp; Isaac, the co-creators of Joon (<a href=\"https:&#x2F;&#x2F;www.joonapp.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.joonapp.io&#x2F;</a>). Joon is a mobile game that motivates kids to do tasks that they might not otherwise want to do—things like chores, homework, brushing their teeth, or making their bed—or things which they like, but not always in the moment—calling a grandparent, for example. The game does this by embedding these tasks into fun “Quests” that the kids do want to do. Along the way, they develop good habits—not because they’re supposed to, but as a side effect of playing the game. Here’s a short video to give you the idea: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OkOwk_wOBBE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OkOwk_wOBBE</a>.<p>One of the hardest parts of parenting (and of growing up!) is getting kids to do things that they don’t enjoy. Parents usually see these as important activities that will help their kids become independent, responsible, and ultimately, happy. Kids, however, often don’t feel the same way! This is an incentive alignment problem: kids want to have fun, parents want to raise a successful human. As technology advances, this is getting tougher, because kids want ever more tech while parents struggle to motivate and connect with them. Joon is our attempt at a ‘middle path’ that combines the fun tech that kids want to play with, and the good habit-building that parents want to see.<p>We started working on this idea when, shortly after college, the three of us had a conversation about our childhoods, and realized we had each played 10,000s of hours of video games when we were kids (mainly Runescape and Pokemon). While we didn’t regret the fun we had, we wondered what would have happened if we had spent that time doing something more meaningful. Looking back, we felt that there could have been something fun like those games, but that would also have helped us grow in life skills. We’re building Joon to be what we wish we’d had as kids, and because it’s something that parents are telling us they need right now.<p>Joon is a mobile game that’s like a combination of Pokemon, Club Penguin, and Tamagotchi. The twist is that in order to take care of your pet and make progress in the game, you have to do parent-assigned or self-assigned “Quests” in real life. It’s a world for kids where real-world activities and outcomes (mental health, relationship-building, cognitive development, physical health, etc) determine your outcomes in the game. Most importantly, it aligns the incentives of parents and kids by helping kids become more responsible through playing a game that they love.<p>Such a game must have very high retention (something which is difficult for mobile games) in order to keep the parent and child aligned. For this, it’s critical that the game itself be the motivating factor, not external rewards. We’ve been hearing about kids who are asking their parents for more tasks at home (whether it’s chores or family activities) every day so they can play Joon, so it feels like we are on the right track.<p>This is how the app works currently: A parent initiates account creation and adds their kids, and then can choose from a suggested list of tasks to assign their kid. The child will choose a pet and see what tasks (that we call “Quests”) they need to do. Once the Quests are completed &amp; approved, the child will receive coins in the game that they can use to buy food to feed their pet (dont worry! there is no negative reinforcement here. I.e the pet just gets sleepy if it doesn’t get fed, it won’t die). This is the core game loop mechanic. There are longer game loops for the child to explore after they have mastered the core game loop such as dressing their pet, exploring new regions, unlocking new items, meeting friends, &amp; even minigames..<p>Interesting enough, people of all ages are using the app, not just kids. For example, neurodivergent adults have been finding value from using it, which is pretty cool to see. We were both surprised that adults would use Joon, but at the same time not surprised, since we ourselves only realized as adults that we hadn’t developed many good habits as kids. In fact the earliest incarnation of the software was a prototype Kevin wrote while in college, to motivate himself to do things like get enough sleep.<p>In terms of pricing, we have just launched it as a subscription-based model with 3 plans to test. A monthly plan for $7.99, a quarterly plan for $16.99, and an annual plan for $49.99. Each plan can be used with a free trial or the user can just use a freemium version of the app for a certain amount of time without opting in to any plan.<p>Please let us know what you think and if applicable, share your experiences as a parent or gamer with us! We’d love to dive in further in the comments",
      "time": 1642604030,
      "title": "Launch HN: Joon (YC W22) – A mobile game that teaches kids to build good habits",
      "type": "story",
      "url": "https://www.joonapp.io/"
    }
  ]
}