{
  "stories": [
    {
      "by": "trungdq88",
      "descendants": 0,
      "id": 29823247,
      "score": 1,
      "time": 1641475577,
      "title": "AirBattery",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=sBF5EnK9MPs"
    },
    {
      "by": "quazar987",
      "descendants": 0,
      "id": 29823241,
      "score": 2,
      "text": "Hi<p>My English is not great, so please bare with me.<p>I have been suffering from major social anxiety and depression from my teenage years. College was difficult time but I made it through with friends who always supported me. Now I am working as tech lead at very small company (people who saw my previous work) for very little salary and general consensus from people I have worked with is that I am good developer. But the anxiety is getting better off me.<p>I am trying to land job at well established remote companies for last few months, answered few interviews but always failed to impress the interviewer. I even shortens my introduction saying &quot;I am a backend developer&quot; for reason I do not know. Truth is coding just one part of my job and I basically handle everything related to tech in the company and handle multiple projects. Codeparing becomes another nightmare where I cannot even think properly and solve simple problems.<p>2 days ago I answered technical interview from like my dream company, that would have changed my life but instead we ended up just having some discussion, didn&#x27;t even manage to fix one spec. Actually I know I can fix all of those in like 15 min.<p>Its making me question my whole career as developer now. Does anyone here been through similar situation ? Any suggestion?",
      "time": 1641475535,
      "title": "Ask HN: Answering interview with major social anxiety, how can I do better?",
      "type": "story"
    },
    {
      "by": "DrNuke",
      "descendants": 0,
      "id": 29823231,
      "score": 1,
      "time": 1641475473,
      "title": "Literary mystery solved as man arrested for allegedly stealing unpublished books",
      "type": "story",
      "url": "https://www.theguardian.com/books/2022/jan/06/literary-mystery-may-finally-be-solved-as-man-arrested-for-allegedly-stealing-unpublished-books"
    },
    {
      "by": "spape",
      "descendants": 0,
      "id": 29823200,
      "score": 1,
      "time": 1641475295,
      "title": "A Token Select Widget (React and Multichain)",
      "type": "story",
      "url": "https://twitter.com/sebpape/status/1479079220269756424"
    },
    {
      "by": "arbesman",
      "descendants": 0,
      "id": 29823196,
      "score": 1,
      "time": 1641475248,
      "title": "Constructing Signposts in the Memescape",
      "type": "story",
      "url": "https://arbesman.substack.com/p/-constructing-signposts-in-the-memescape"
    },
    {
      "by": "SirLJ",
      "descendants": 0,
      "id": 29823165,
      "score": 1,
      "time": 1641475073,
      "title": "Ninety-Nine Fascinating Finds Revealed in 2021",
      "type": "story",
      "url": "https://www.smithsonianmag.com/history/99-fascinating-finds-revealed-in-2021-180979281/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29823158,
      "score": 1,
      "time": 1641475027,
      "title": "Kazakhstan government shuts down internet following country-wide protests",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/kazakhstan-government-shuts-down-internet-following-country-wide-protests"
    },
    {
      "by": "manojvenkat92",
      "descendants": 0,
      "id": 29823143,
      "score": 1,
      "text": "To show internally and externally our service APIs status, is there any good site for that?",
      "time": 1641474930,
      "title": "Ask HN: I want to use a “Status page as a service”?",
      "type": "story"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 29823137,
      "score": 1,
      "time": 1641474904,
      "title": "DuckDuckGo just finished a banner year and looks for an even better 2022",
      "type": "story",
      "url": "https://www.techrepublic.com/article/online-privacy-duckduckgo-just-finished-a-banner-year-and-looks-for-an-even-better-2022/"
    },
    {
      "by": "JZN666",
      "descendants": 0,
      "id": 29823097,
      "score": 1,
      "text": "I encountered several types of interview through companies of different values (small startup to big tech). First kind is Leetcode-style interview where your task is to write algorithm&#x2F;data structure to solve given problems. Second kind discards algorithmic problems treating them as &quot;uneffective&quot; method to choose developers who can produce maintainable, well scalable code. They prefer problems focusing on knowing execution environment like &quot;make autocomplete work for this React template&quot;, spaghetti-mess of setTimeout&#x2F;promises in JS etc. Third kind don&#x27;t ask coding problems from mature developers at all, they only talk about architecture&#x2F;internal mechanics of programs from previous jobs or pet-projects of applicant. And asking theoretical questions for basic knowledge of developed systems like &quot;what happens if I type a link in browser&#x27;s address input and then press &quot;Enter&quot;?&quot;. They think that you can&#x27;t detect good developer by how much of execution environment internals or algorithms they know&#x2F;they can design, but by their high-level ability to build business programs and systems. It is biasly assumed that interviewee already knows some basics of execution environment and algorithms. Etc.<p>What style of technical interview do you prefer and what are objectives for that?",
      "time": 1641474676,
      "title": "Ask HN: What is your best type of technical interview?",
      "type": "story"
    }
  ]
}