{
  "stories": [
    {
      "by": "sanjayio",
      "descendants": 1,
      "id": 29257190,
      "kids": [
        29257191
      ],
      "score": 1,
      "time": 1637174991,
      "title": "Tool for Mobile Release",
      "type": "story",
      "url": "https://runway.team/"
    },
    {
      "by": "he0001",
      "descendants": 0,
      "id": 29257186,
      "score": 1,
      "time": 1637174981,
      "title": "How did we get here: what are droplets and aerosols and how far do they go?",
      "type": "story",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rsfs.2021.0049"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 29257184,
      "score": 1,
      "time": 1637174975,
      "title": "In Defense of Tiny Modules",
      "type": "story",
      "url": "https://adamtuttle.codes/blog/2021/in-defense-of-tiny-modules/"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 29257152,
      "score": 1,
      "time": 1637174854,
      "title": "A billion-dollar donation: estimating the cost of time spent on peer review",
      "type": "story",
      "url": "https://researchintegrityjournal.biomedcentral.com/articles/10.1186/s41073-021-00118-2"
    },
    {
      "by": "jdkee",
      "descendants": 0,
      "id": 29257150,
      "score": 2,
      "time": 1637174849,
      "title": "Amazon workers were left 'terrified and powerless' after concealed Covid cases",
      "type": "story",
      "url": "https://news.sky.com/story/covid-19-amazon-workers-were-left-terrified-and-powerless-after-it-concealed-coronavirus-cases-california-says-12469852"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29257130,
      "score": 1,
      "time": 1637174752,
      "title": "Meta haptic glove prototype lets you feel VR objects using air pockets",
      "type": "story",
      "url": "https://www.theverge.com/2021/11/16/22782860/meta-facebook-reality-labs-soft-robotics-haptic-glove-prototype"
    },
    {
      "by": "ishikawa",
      "descendants": 0,
      "id": 29257128,
      "score": 1,
      "time": 1637174748,
      "title": "Americans’ Appetite for Leather in Luxury SUVs Worsens Amazon Deforestation",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/17/climate/leather-seats-cars-rainforest.html"
    },
    {
      "by": "Rohan210801",
      "descendants": 0,
      "id": 29257113,
      "score": 3,
      "text": "Hey everyone,<p>Back at it again with another microsite.<p>So here is some back story:<p>I was sitting in my management class in college today and noticed that there are a lot of people out there who want to get into no-code&#x2F;freelance dealing with several hurdles in regards to the software that they should start with.<p>Here is a timeline of today:<p>1:00 PM - Thought of the idea in class and made a table in notes with my initial ideas and software that I use and how I could execute it. Along with some services that helped me along the way or that I look up to for my own business.<p>1:30 PM - Hoped on Webflow and started with CMS and putting the various companies that I thought of before into the system along with some categories that would make it easier to filter through everything.<p>2:15 PM - After dropping everything into CMS and setting it up, I started building. First was a name and I choose ResourceHub. Then, I started building the site and doing some tweaks across various breakpoints to make it look professional along with adding in CMS connections.<p>6:00 PM - Designing done and everything is simple but gives off a minimalistic attitude. Just needed to plug in a google analytics code and it was time to publish.<p>6:05 PM - Noticed an issue with one of the connections and managed to warp it up.<p>6:15 PM - Done and dusted. All through no-code using Webflow&#x27;s CMS.<p>For anyone interested here is the site https:&#x2F;&#x2F;resourcehub.webflow.io&#x2F;",
      "time": 1637174685,
      "title": "I went from idea to MVP in 5 hours",
      "type": "story"
    },
    {
      "by": "ishikawa",
      "descendants": 0,
      "id": 29257110,
      "score": 1,
      "time": 1637174658,
      "title": "Amazon will stop accepting Visa credit cards issued in Britain",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/17/business/amazon-visa-britain.html"
    },
    {
      "by": "busyuser",
      "descendants": 2,
      "id": 29257093,
      "kids": [
        29257189,
        29257181,
        29257162
      ],
      "score": 3,
      "text": "Who: Series B startup with ~$100 million in funding, me open-source developer<p>What: engineering manager writes me e-mail that goes like: “we found your open-source project and want to offer you a job”<p>In a meeting they explain how they were interested in using my open-source project and want to hire me so i could carry out a similar work for them<p>Then they go on and explain i’d have to do 4 more meetings 1-2 hours each, including a leetcode-style tech interview<p>In my head i’m thinking: “If their leetcode-engineers are <i>that</i> good why do they have rely on <i>my</i> open-source?”<p>What would you do in this situation?\nWould you jump through the hoops in hope of getting relevant work?",
      "time": 1637174577,
      "title": "Ask HN: Ridiculous job interview. What do I do?",
      "type": "story"
    }
  ]
}