{
  "stories": [
    null,
    null,
    null,
    {
      "by": "ceohockey60",
      "descendants": 0,
      "id": 30167292,
      "score": 1,
      "time": 1643741656,
      "title": "Low Code No Code: Hands-On Experience with Notion, Retool, Bubble, Yida",
      "type": "story",
      "url": "https://interconnected.blog/low-code-no-code-part-iii-hands-on-experience-with-notion-retool-bubble-yida/"
    },
    {
      "by": "rwanda",
      "descendants": 0,
      "id": 30167287,
      "score": 1,
      "text": "I&#x27;m currently a freshman at a difficult 5-year math &amp; CS program in some European country. For the past two months I&#x27;ve been contemplating switching to medicine&#x2F;medical school but have a very hard time coming to a decision.\nI applied to this math &amp; CS-program due to my interest in research in computational neuroscience&#x2F;machine learning. Unfortunately, the workload has been very high (60h&#x2F;week inc. lectures) and I feel that I&#x27;m at the brink of a burnout. Simply put, grading here is quite non-lenient and I&#x27;ve lost most of my interest in pure mathematics. Having said this, things will probably become significantly easier and more interesting during the final 2 years of the program as I can specialize in CS&#x2F;machine learning. Finally, while the program is very selective, it’s quite obscure internationally. Combine this with the non-lenient grading and I think I’d be at a major disadvantage applying to US PhD-programs. Basically, I don’t know if this path is realistic for me anymore.\nOn the other hand, my interest in medicine and neuroscience are significantly higher than pure math, but a little less than machine learning. I’m therefore considering switching to medicine as the workload is significantly lower (40h&#x2F;week inc. lectures) and international reputation being much better (top 10 worldwide). In fact, the medical school is very well known in academic circles, and I could definitely do a PhD in neuroscience here as research is very good. If everything fails, I can still work as a physician which is something I’m interested in too. I do however feel like I’d be wasting my “talents” by going into medical research instead of machine learning.\nTo conclude, would I be making a good or bad decision by switching to medicine? Although both neuroscience and machine learning are very interesting, I think I prefer the latter and see more potential in it. Having said this, my probability of success by aiming for the former is way higher.",
      "time": 1643741639,
      "title": "Ask HN: Switch to Medicine or Push Through?",
      "type": "story"
    },
    {
      "by": "JPLeRouzic",
      "descendants": 0,
      "id": 30167260,
      "score": 2,
      "time": 1643741542,
      "title": "The Drought in China’s Subtropics",
      "type": "story",
      "url": "https://www.sixthtone.com/news/1009584/the-hidden-drought-in-chinas-subtropics"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 30167256,
      "score": 2,
      "time": 1643741538,
      "title": "Tesla-Busting Battery Could Be the ‘Holy Grail’ for Electric Flight",
      "type": "story",
      "url": "https://www.forbes.com/sites/davidrvetter/2022/02/01/how-this-tesla-busting-battery-could-be-the-holy-grail-for-electric-flight/"
    },
    {
      "by": "Apocryphon",
      "descendants": 0,
      "id": 30167244,
      "score": 2,
      "time": 1643741477,
      "title": "Ten percent of SF housing is vacant, a new report shows",
      "type": "story",
      "url": "https://48hills.org/2022/01/ten-percent-of-sf-housing-is-vacant-a-new-report-shows/"
    },
    {
      "by": "NmAmDa",
      "descendants": 0,
      "id": 30167228,
      "score": 1,
      "time": 1643741423,
      "title": "Samba bug can let remote attackers execute code as root",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/samba-bug-can-let-remote-attackers-execute-code-as-root/"
    },
    {
      "by": "Anonymous4272",
      "descendants": 0,
      "id": 30167224,
      "score": 1,
      "time": 1643741411,
      "title": "Israel Rolls Out Laser Defense System",
      "type": "story",
      "url": "https://www.reuters.com/world/middle-east/israel-speeds-roll-out-laser-based-defence-systems-bennett-says-2022-02-01/"
    }
  ]
}