{
  "stories": [
    {
      "by": "AlexDragusin",
      "descendants": 0,
      "id": 30960897,
      "score": 1,
      "text": "Hi! This is Alex Dragusin and lately I&#x27;ve been working on Relevanto where I look for and save the best of the web. I literally search through search engines for the best of everything (yes, lots of site:reddit.com in there and so on), check it out if it&#x27;s legit (I search for reputational data like reviews etc) save it, categorize it and list it on Relevanto. I have a knack for curation and organization so I am putting my skills to, hopefully good use. This, at this point is intended for a global audience, stuff that make sense for most people.<p>I got fed up with Google and other search engines results being filled with too many results that are not really useful and I hope Relevanto will eventually be a gateway for most of the stuffs I do on the web, leaving the search engines for more specific stuffs - to use them as an option rather than primary way.<p>Love speed and privacy. I am big on privacy thus no tracking and the usual nonsense. The site is static and managed by a backend I created through which I manage the sites in the database. The static exporter is written in PHP. Nothing too fancy.<p>I am constantly adding, adjusting and since it&#x27;s beta, many more categories are coming up.<p>In the works:<p>*apart from the highlighter, a similar function that will filter all the sites by [keyword], that is, show only what contain [keyword], hide everything else. \n*dedicated pages, for example Music, on this page there will be all about music from links to websites for consumption to tools of creation to news and so on.<p>Monetization:<p>Will monetize in 2 ways, one by having a Marketplace page (the only place for ads, no ads on other parts of the site as long as I am at the helm), where one can advertise their service&#x2F;product&#x2F;company for a consistent fee (aka high barrier of entry) while abiding by strict guidelines (Money is good but not at the expense of my visitors!) and second by patronages taken through Patreon or other provider. That&#x27;s it, the goal is not endless growth at the expense of the users but to provide value, real value! This is the future of the web, the relevant web!<p>Thank you and hope to have you along for the ride.",
      "time": 1649443177,
      "title": "Show HN: Relevanto (beta) – I curate the relevant web",
      "type": "story",
      "url": "https://www.relevanto.com"
    },
    {
      "by": "bitcharmer",
      "descendants": 0,
      "id": 30960854,
      "score": 2,
      "time": 1649442988,
      "title": "Readahead: The documentation I wanted to read",
      "type": "story",
      "url": "https://lwn.net/SubscriberLink/888715/fc904097996efe7b/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30960797,
      "score": 2,
      "time": 1649442676,
      "title": "Color Standards for Terminal Emulators",
      "type": "story",
      "url": "https://github.com/termstandard/colors"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30960758,
      "score": 2,
      "time": 1649442432,
      "title": "Roam: Mobile",
      "type": "story",
      "url": "https://apps.apple.com/at/app/roam-mobile/id1609277273?l=en"
    },
    {
      "by": "ra0x3",
      "descendants": 1,
      "id": 30960730,
      "kids": [
        30960806
      ],
      "score": 1,
      "time": 1649442305,
      "title": "A Censorship-Resistant Inflation Index Is Being Built on Chainlink",
      "type": "story",
      "url": "https://www.coindesk.com/business/2022/04/08/a-censorship-resistant-inflation-index-is-being-built-on-chainlink/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30960720,
      "score": 2,
      "time": 1649442232,
      "title": "Fabricating Reflectors for Displaying Multiple Images",
      "type": "story",
      "url": "https://dl.acm.org/doi/pdf/10.1145/3197517.3201400"
    },
    {
      "by": "birriel",
      "descendants": 0,
      "id": 30960677,
      "score": 1,
      "time": 1649442019,
      "title": "Researchers reverse ageing in human cells by 30 years – study",
      "type": "story",
      "url": "https://www.salisburyjournal.co.uk/news/20053721.researchers-reverse-ageing-human-cells-30-years---study/"
    },
    {
      "by": "danielgh7",
      "descendants": 0,
      "id": 30960678,
      "kids": [
        30960798
      ],
      "score": 1,
      "text": "If anyone has an Oculus Quest 2 and is interested in getting interviewed in VR lmk!\nI run a youtube channel that creates coding interview related content and I&#x27;m looking for more people interested in getting interviewed on camera: https:&#x2F;&#x2F;www.youtube.com&#x2F;channel&#x2F;UCfotE5RL1pfhIZ0fv2kAN9Q<p>You can remain completely anonymous, and I promise to give you detailed feedback after the call is done. All I ask is that we are allowed to record for the youtube channel.",
      "time": 1649442019,
      "title": "Anyone interested in doing a mock coding interview in VR?",
      "type": "story"
    },
    {
      "by": "punkingdave",
      "descendants": 0,
      "id": 30960669,
      "score": 1,
      "time": 1649441971,
      "title": "In Times of Crisis, It's Better to Turn to Influencers Than Celebrities",
      "type": "story",
      "url": "https://www.ibtimes.com/times-crisis-its-time-turn-towards-influencers-rather-celebrities-3465665"
    },
    {
      "by": "wglb",
      "descendants": 0,
      "id": 30960668,
      "score": 2,
      "time": 1649441954,
      "title": "Astronomers just discovered the farthest object in the known universe",
      "type": "story",
      "url": "https://www.livescience.com/farthest-astronomical-object-ever-seen"
    }
  ]
}