{
  "stories": [
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29281509,
      "score": 1,
      "time": 1637351671,
      "title": "New Electric Propulsion Engine for Spacecraft Test-Fired in Orbit for First Time",
      "type": "story",
      "url": "https://www.sciencealert.com/iodine-spacecraft-propulsion-has-been-tested-in-orbit"
    },
    {
      "by": "wyrm",
      "descendants": 0,
      "id": 29281496,
      "score": 1,
      "time": 1637351617,
      "title": "CDC Finds No Smallpox in Frozen Vials Suspiciously Labeled ‘Smallpox’",
      "type": "story",
      "url": "https://gizmodo.com/cdc-finds-no-smallpox-in-frozen-vials-suspiciously-labe-1848089994"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 29281473,
      "score": 1,
      "time": 1637351519,
      "title": "Cecilia Payne: Discoverer of the Chemical Makeup of Stars",
      "type": "story",
      "url": "https://www.amnh.org/learn-teach/curriculum-collections/cosmic-horizons-book/cecilia-payne-profile"
    },
    {
      "by": "cdahmedeh",
      "descendants": 0,
      "id": 29281468,
      "score": 1,
      "text": "I was watching a video game documentary about the history of the RollerCoaster Tycoon franchise, a theme park management game that had both an easy learning curve but with incredibly sophisticated dynamics. What really impressed me however was the origins of the first two titles: written by one man in assembly language.<p>At that point, I realized how mediocre and untalented I was. Nothing I’m doing in my life are anything that people will remember me for. Throughout my life, I’ve seen many awe inspiring projects done by extremely talented people, way more intelligent than I am, come to fruition. Over the years, I realized how shallow and dumb I really am. I’m uninteresting.<p>Most of my career revolved around software development, something that I’ve done since I was 17 (now I&#x27;m 30) until a few years ago. I found myself writing entreprise software usually in the backend and that’s all I really knew except for some server administration and scripting sprinkled on top. Sat beside me were full-stack developers with expertise in DevOps as well. They knew how to do everything I could on top of so much else. As for me, I can barely write basic HTML pages.<p>I meet with incredibly smart people with master’s degrees and PhDs knowing so much about their field of expertise while I’m a University drop-out. People who know world history so well while being able to talk about the hard problem of consciousness at the same time. YouTubers and Twitch streamers who are so talented at playing games and entertaining us along the way.<p>There’s people who have paved the way for innovation and foresight that I don’t have at all. Those who make so much money due to their talents and bringing them to life in this world of ours. I’ve watched so many documentaries about all sorts of people from racing drivers, to game developers, comedians, data science experts, cybersecurity nuts, music producers, video editors, documentaries makers and so much more. These are all things that come to mind thinking that I’ll never be able to do any of that.<p>I’m mostly a self-taught person teaching myself skills as I go along with my life. I generally don’t pick up much except for a few facts that I can repeat to others. I can barely do derivatives anymore in math or draw like I used to. My talents are shallow and honestly quite useless.<p>Today, I don’t do much with my life other than binging on YouTube documentaries and reading Wikipedia articles not helping my case. My motivation for learning is shrinking slowly and would much rather stare out of the window while I’m not doing my obligatory 8 hours of daily work.<p>Now, I’m an unimportant technical writer composing documents for developers and users. There’s no path for career growth if I stay in this specialty. My work doesn’t feel like it takes much talent and I was hired a few times without having any credentials in business writing.<p>I’ve been told by previous managers that I’m always in “learning mode” and quite “creative” but I can’t convince myself that these traits are actually true. I feel untalented, empty and dumb.<p>My dreams do exist but they starting to seem more and more superficial. There’s a lot of subjects and activities that I’m really interested of getting into but I can’t just dive into it. I blame it on the lack of time and laziness but I have strong time management skills and can conjure up much empty slots in my schedule. I sometimes wonder if my mental condition or my medication has had an effect on this: I&#x27;m bipolar schizoaffective and borderline.",
      "time": 1637351485,
      "title": "I feel so shallow and dumb when I see what other smart people are doing",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29281449,
      "score": 2,
      "time": 1637351348,
      "title": "HTTP Message Signatures",
      "type": "story",
      "url": "https://httpwg.org/http-extensions/draft-ietf-httpbis-message-signatures.html"
    },
    {
      "by": "yagiznizipli",
      "descendants": 0,
      "id": 29281421,
      "score": 2,
      "time": 1637351214,
      "title": "Apple manipulates Podcast app ratings on AppStore",
      "type": "story",
      "url": "https://twitter.com/keleftheriou/status/1460856187595804676"
    },
    {
      "by": "say_it_as_it_is",
      "descendants": 0,
      "id": 29281409,
      "score": 1,
      "time": 1637351166,
      "title": "Postive Research Findings about Adults who microdose psychedelics",
      "type": "story",
      "url": "https://www.nature.com/articles/s41598-021-01811-4"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29281388,
      "score": 1,
      "time": 1637351023,
      "title": "Forth Haiku: An attempt to mix mathematics, art, and the Forth programming lang",
      "type": "story",
      "url": "https://forthsalon.appspot.com/haiku-about"
    },
    {
      "by": "itroot",
      "descendants": 0,
      "id": 29281360,
      "score": 4,
      "time": 1637350877,
      "title": "Zstandard RFC 8878",
      "type": "story",
      "url": "https://datatracker.ietf.org/doc/html/rfc8878"
    },
    {
      "by": "axiomdata316",
      "descendants": 0,
      "id": 29281351,
      "score": 1,
      "time": 1637350821,
      "title": "Chrome extension to return YouTube dislikes",
      "type": "story",
      "url": "https://github.com/Anarios/return-youtube-dislike"
    }
  ]
}