{
  "stories": [
    {
      "by": "belter",
      "descendants": 0,
      "id": 30332623,
      "score": 1,
      "time": 1644850182,
      "title": "Treaty of Tordesillas",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Treaty_of_Tordesillas"
    },
    {
      "by": "wdb",
      "descendants": 0,
      "id": 30332612,
      "score": 1,
      "time": 1644850106,
      "title": "Happy 27th Birthday, Delphi",
      "type": "story",
      "url": "https://blogs.remobjects.com/2022/02/14/delphi27th/"
    },
    {
      "by": "jnxx",
      "descendants": 0,
      "id": 30332607,
      "score": 1,
      "text": "Technical debt is a hard problem. But that kind of problems has sometimes surprising solutions, where one leaves a local optimum to find a better optimum point.<p>What kind of smart strategies did you find to reduce technical debt in relatively new code bases?<p>As an aside, in the last time, I have heard several times that using new programming languages &#x2F; language standards like C++20 or Python 3.10 helps against technical debt. I am not so sure about that one. Sure, code bases with new language versions or standards are overall newer, and therefore, they tend to have less technical debt. This is quite logical to me. But my impression is that good practice and experience is what makes the crucial difference seven of eight years later. In fact, I suspect that languages that are evolving rapidly might accumulate <i>more</i> technical debt, as they are less stable by concept.<p>All this is superimposed with business fields where few codebases are older than some three years (like typical start-ups) and others where a vast amount of code runs 20 years or more (like industrial automation and banking). And there are even some communities which are using rather old languages <i>because</i> of their (real or perceived) stability.",
      "time": 1644850080,
      "title": "What are intelligent strategies to keep technical debt at bay?",
      "type": "story"
    },
    {
      "by": "dustinmoris",
      "descendants": 0,
      "id": 30332599,
      "score": 1,
      "time": 1644850034,
      "title": "NFTs seized by UK tax authorities for the first time",
      "type": "story",
      "url": "https://www.theverge.com/2022/2/14/22932824/hmrc-nft-seizure-fraud-investigation"
    },
    {
      "by": "kruna",
      "descendants": 0,
      "id": 30332575,
      "score": 1,
      "time": 1644849891,
      "title": "Jackal v2",
      "type": "story",
      "url": "http://jackal.surge.sh/"
    },
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 30332556,
      "score": 2,
      "time": 1644849841,
      "title": "Article by V. Putin ”On the Historical Unity of Russians and Ukrainians“, 2021",
      "type": "story",
      "url": "http://en.kremlin.ru/events/president/news/66181"
    },
    {
      "by": "murtaza_alexa",
      "descendants": 0,
      "id": 30332535,
      "score": 3,
      "time": 1644849650,
      "title": "Show HN: Free and Open-source Illustrations for your projects",
      "type": "story",
      "url": "https://iradesign.io/"
    },
    {
      "by": "dk79XuL9",
      "descendants": 0,
      "id": 30332534,
      "score": 3,
      "text": "I was involved in a high-profile computer hacking case in 2015 which received international interest. I eventually pleaded guilty to charges of blackmail, fraud, and computer hacking. Following that, I was sentenced to four years in prison. I&#x27;m currently on probation for a year, and I&#x27;m also under the supervision of the Serious Organised Crime Unit for another four years. I&#x27;m bound by a number of technical constraints. The authorities in charge of my supervision are happy for me to find legal work in cybersecurity, but given my current circumstances, I just wanted opinions on how I should approach this.<p>I&#x27;m completely self-taught, and while on bail, I did a lot of responsible disclosure.<p>I have received letters of acknowledgment (LoA) from Duke University; MIT University; Latostadora; Luzerne Community College; Boards IE; DASH Payment System; CapMetro; Room Booking System; Ecwid CMS; ESET; Stanford University; SkoolBag LMS; AtVirtual AG; Netherlands Ice Hockey Association; Australian National University; Norwegian School of Theology; Raffine; Deutsche Bank AG; University of Cambridge; Parliament UK; Ministry of Justice; National Crime Agency and Crown Court Digital Case System (CCDCS).<p>I have received public acknowledgment from AT&amp;T; Esri; BBC; Sony; Deutsche Telekom; United Nations; Duke University; Adobe; AOL; University of Twente and Houzz.<p>I also held position 11 on a bug bounty platform in 2019 out of 25,000~ active researchers.<p>I can&#x27;t just walk into employment with my skillset because I&#x27;m not particularly talented, just proficient in web-application security and various methodology used to identify vulnerabilities. This leads me to believe that I should look for an entry-level position. Some opinions would be appreciated.",
      "time": 1644849647,
      "title": "Ask HN: Recent computer hacking convictions and employability",
      "type": "story"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 30332510,
      "score": 1,
      "time": 1644849570,
      "title": "Everything You Need to Know About NFTs",
      "type": "story",
      "url": "https://www.nansen.ai//research/everything-you-need-to-know-about-nfts"
    },
    {
      "by": "boringg",
      "descendants": 0,
      "id": 30332506,
      "score": 1,
      "time": 1644849548,
      "title": "Leak site says it has list of Canada truck convoy donors after reported hack",
      "type": "story",
      "url": "https://www.theglobeandmail.com/world/article-leak-site-says-it-has-list-of-canada-truck-convoy-donors-after/"
    }
  ]
}