{
  "stories": [
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30801848,
      "score": 1,
      "time": 1648214686,
      "title": "Digital Markets Act (DMA): Agreement Between the Council and European Parliament",
      "type": "story",
      "url": "https://www.consilium.europa.eu/en/press/press-releases/2022/03/25/council-and-european-parliament-reach-agreement-on-the-digital-markets-act/"
    },
    {
      "by": "luisamodio",
      "descendants": 0,
      "id": 30801845,
      "score": 1,
      "text": "Hello HN community,<p>For the past year we’ve been working on this disruptive new thing. It’s about people, community, communication and truth.<p>Throw is the new space for asking and answering questions anonymously. We believe that in today’s world (both online and offline) content in communication exchanges is strongly influenced by the personas, profiles and façades people maintain&#x2F;upkeep&#x2F;safeguard socially, ideologically and on relationships.<p>From the way people post on Instagram the life they want others to believe they have, or the way people behave on thanksgiving with family, or at work, or with friends; on every social setting and interaction to some degree acting and behaving according to that setting and the people they interact with. These dynamics influence the content itself, as people don’t just respond to a question like computers do. What ends up happening is that the responder comes up with the answer by blending the possibly objective answer with feelings, setting, desires, commitments, ideologies, fears, insecurities, etc (social pressure or social agenda).<p>Something is missing between social media and the traditional Q&amp;A…<p>Throw addresses this by creating a space free from this social agenda. Thus focusing strictly on the content exchanged and providing a safe, comfortable and unbiased space where people can ask and answer anything freely with no bias, fears or strings attached.<p>Not only may Throw be used for personal and private questions and answers. But the power of crowdsourcing allows for a great variety of use cases like market research, validation of content and ideas, trivia, and much more. Serious matters and also just for fun…<p>It’s a query marketplace which means that “throwers” (people who ask questions) pay a fee proportional to the answers they need and in turn “catchers” (who catch them and respond) get compensated. This way we guarantee every user gets as many responses as he&#x2F;she needs.<p>As for dealing with anonymity, we have built a sophisticated moderation protocol to neutralize and quickly ban people that contribute negatively as it is a priority people feel safe and comfortable in this community.<p>We have worked very hard to create a delightful product and are currently very close to rolling out our app to the market.<p>If this is something that may be of your interest or you’d like to be one of the first to test it out, you may keep an eye for our launch and other news by subscribing to our waitlist. <a href=\"https:&#x2F;&#x2F;www.throwapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.throwapp.com</a><p>Also, if you have questions there is additional information in the FAQs section on our web page that could be of help.<p>If you still haven&#x27;t looked at our explainer video I encourage you to see it as it&#x27;s quite fun and describes pretty well what we are doing. <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;3f9RcVVpkNA\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;3f9RcVVpkNA</a><p>Finally, we really appreciate any feedback we can get (of any kind). So if there&#x27;s anything you like, don&#x27;t like, or any other thought about Throw, we&#x27;d love to hear about it! You may post a comment below or through the contact section on the web page.<p><i>Be curious and dare to know!</i><p>Thank you!",
      "time": 1648214674,
      "title": "Show HN: Throw – The new space for asking and answering questions anonymously",
      "type": "story",
      "url": "https://www.throwapp.com/"
    },
    {
      "by": "modinfo",
      "descendants": 0,
      "id": 30801838,
      "score": 1,
      "time": 1648214637,
      "title": "Afterimage",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Afterimage"
    },
    {
      "by": "LiminalRealm",
      "descendants": 0,
      "id": 30801834,
      "score": 1,
      "time": 1648214612,
      "title": "Lawsuit against Surgeon General over request for info on “Covid misinformation”",
      "type": "story",
      "url": "https://nclalegal.org/mark-changizi-et-al-v-department-of-health-and-human-services-et-al/"
    },
    {
      "by": "diegomacario",
      "descendants": 0,
      "id": 30801825,
      "score": 1,
      "text": "Hi everyone!<p>I&#x27;m one of the developers behind this project. I wrote it with my two brothers, Daniel and Ricardo.<p>For years the three of us have been curious about how multiplayer games work, which is why we decided to work on this project.<p>Our goal was to gain a deep understanding of how different players can share the same 3D space, which is why we wrote our own tiny game engine instead of using something like Unity.<p>We wrote the engine using C++ and OpenGL, and we then compiled it to WebAssembly using Emscripten so that it would run effortlessly on web browsers. We are really excited about the possibilities that are opening up thanks to WebAssembly.<p>Throughout this project we faced some massive technical challenges, like for example:<p>- We had to implement a collision detection and response algorithm so that players could collide with objects in the world.<p>- We had to implement an animation system that&#x27;s capable of loading animated characters from glTF files, and that can play animations and fade between them.<p>- We had to implement a system that downloads images in worker threads, and that uploads them to the GPU in small chunks so that the game runs smoothly while paintings are being loaded.<p>- We had to implement techniques like client side prediction, server reconciliation and entity interpolation so that players look smooth when they are moving in the 3D space.<p>It was a great learning experience. If you have any technical questions, the three of us would be happy to answer them.<p>On the product side, our hope is that this project can make the experience of discovering NFT artists more fun and social. We think that scrolling through endless pages of NFTs is mindless and boring. We hope that in the museum people will look at digital art for more than a glance, and that they will discuss it with others.<p>We are constantly improving the museum to make it more fun, and we are also building some awesome tools for artists and collectors to showcase their work in new ways. If you would like to keep up with our progress, you can leave your email here: <a href=\"https:&#x2F;&#x2F;www.getrevue.co&#x2F;profile&#x2F;moonlightmuseum\" rel=\"nofollow\">https:&#x2F;&#x2F;www.getrevue.co&#x2F;profile&#x2F;moonlightmuseum</a><p>Thanks for your time!",
      "time": 1648214574,
      "title": "Show HN: A multiplayer game to discover NFT artists, built with WebAssembly",
      "type": "story",
      "url": "https://play.moonlightmuseum.io"
    },
    {
      "by": "jckahn",
      "descendants": 0,
      "id": 30801785,
      "score": 1,
      "time": 1648214336,
      "title": "KiwiX: Store any website on your mobile phone or computer, easily",
      "type": "story",
      "url": "https://www.kiwix.org/en/"
    },
    {
      "by": "thallium205",
      "descendants": 1,
      "id": 30801783,
      "kids": [
        30801791
      ],
      "score": 1,
      "time": 1648214333,
      "title": "RapidAPI nabs $150M at a $1B valuation",
      "type": "story",
      "url": "https://techcrunch.com/2022/03/23/rapidapi-nabs-150m-at-a-1b-valuation-with-its-api-marketplace-now-used-by-4m-developers/"
    },
    {
      "by": "t0bia_s",
      "descendants": 1,
      "id": 30801739,
      "kids": [
        30801762
      ],
      "score": 2,
      "time": 1648214088,
      "title": "The Commission would like to hear your views – EU Digital Covid Cert. Regulation",
      "type": "story",
      "url": "https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/13375-Extension-of-EU-Digital-COVID-Certificate-Regulation_en"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 30801737,
      "score": 2,
      "time": 1648214080,
      "title": "Semantle: Wordle, but with Semantics, Not Spelling",
      "type": "story",
      "url": "https://semantle.novalis.org/"
    },
    {
      "by": "yawz",
      "descendants": 0,
      "id": 30801727,
      "score": 1,
      "time": 1648214045,
      "title": "Comet is 16 miles wide and it could be heading towards Earth",
      "type": "story",
      "url": "https://nypost.com/2022/03/16/comet-is-16-miles-wide-and-it-could-be-heading-towards-earth/"
    }
  ]
}