{
  "stories": [
    {
      "by": "BrianGards1040",
      "descendants": 0,
      "id": 29362501,
      "score": 1,
      "time": 1638039902,
      "title": "New Covid Variant Discovered in South Africa",
      "type": "story",
      "url": "https://themountain.news/news/new-covid-variant-discovered-in-south-africa"
    },
    {
      "by": "ScottMann",
      "descendants": 0,
      "id": 29362490,
      "score": 1,
      "time": 1638039827,
      "title": "The current inflation run is similar to other episodes in history",
      "type": "story",
      "url": "https://www.cnbc.com/2021/11/27/the-current-inflation-run-is-similar-to-other-episodes-in-us-history-but-with-important-differences.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29362487,
      "score": 1,
      "time": 1638039813,
      "title": "The TCP/IP Checksum (2012)",
      "type": "story",
      "url": "https://locklessinc.com/articles/tcp_checksum/"
    },
    {
      "by": "okareaman",
      "descendants": 0,
      "id": 29362469,
      "score": 1,
      "text": "I tried to explain NFTs and crypto to family on Thanksgiving, but I don&#x27;t think I was able to get it across across. I should have mentioned that many years before NFTs you could buy land on the Moon and get a certificate of ownership. There is no legal framework for owning land on the Moon, but that doesn&#x27;t have to stop you from setting up a market for Moon land with your friends and trading your Moon acres for goods and services. As long as a group of people decided to use Moon land as money, they can use it as a way of enabling transactions. Like Monopoly money, it&#x27;s essentially a way of keeping score of who owns what. Like casino chips, you might even be able to exchange them for dollars if the market owner (the casino) finds it profitable to maintain the illusion that they are real money. Just don&#x27;t try to buy groceries with casino chips.<p>The operative phrase is &quot;There is no legal framework,&quot; so if the Chinese decide to build a moon base on your land you&#x27;re out of luck because you never really owned any land on the Moon.<p>Any day now someone will try to sell an NFT of the Brooklyn Bridge. In other words, NFTs are just another vehicle to extract money from suckers.",
      "time": 1638039596,
      "title": "Ask HN: Trying to explain NFTs to family on Thanksgiving. Am I wrong?",
      "type": "story"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 29362428,
      "score": 2,
      "time": 1638039275,
      "title": "The metaverse is just the latest incarnation of Las Vegas",
      "type": "story",
      "url": "https://www.ft.com/content/739235bc-c418-4895-a426-3bd245ec6a00"
    },
    {
      "by": "vanusa",
      "descendants": 0,
      "id": 29362399,
      "score": 1,
      "time": 1638039049,
      "title": "Study shows believers in astrology are less intelligent and more narcissistic",
      "type": "story",
      "url": "https://phys.org/news/2021-11-people-astrology-tend-intelligent-narcissistic.html"
    },
    {
      "by": "pkrecker",
      "descendants": 0,
      "id": 29362391,
      "score": 1,
      "time": 1638038966,
      "title": "The Cagots of France",
      "type": "story",
      "url": "https://www.picciolettabarca.com/posts/beyond-thought-the-cagots-of-france"
    },
    {
      "by": "jackocoins",
      "descendants": 0,
      "id": 29362374,
      "score": 1,
      "text": "Does your team share Excel or Google sheets, where multiple people are entering information into the same document? Am I the only one losing control over input?",
      "time": 1638038861,
      "title": "Control over Input in Spreadsheets",
      "type": "story"
    },
    {
      "by": "roberto-digital",
      "descendants": 0,
      "id": 29362365,
      "score": 1,
      "time": 1638038774,
      "title": "Show HN: Over 180 SEO tips to help you rank higher on Google",
      "type": "story",
      "url": "https://superseo.tips/"
    },
    {
      "by": "GDC7",
      "descendants": 0,
      "id": 29362355,
      "score": 1,
      "text": "I know, I know, people are going to point that the best way is to go long the stock market (S&amp;P500 or Wilshire5000)<p>The point is that with the stock market you need other people to also agree with your stance in order to profit, whereas when you book a vacation your only need is flights to keep departing and hotels&#x2F;resturants to stay open and accepting guests, plus the avoidance of lockdowns at destination.<p>Plus the first rule of every game is to optimize for playing against weak players.<p>On the stock market and prediction markets one is playing against very strong players, information asymmetry plays a huge role and perhaps insider trading (especially in this case where technically any information on the pandemic outlook is not considered insider trading )<p>On TrivaGo, Expedia, Booking.com... instead the opposition is basically other would be vacationers , and that <i>has</i> to yield larger return",
      "time": 1638038719,
      "title": "Ask HN: Is Booking a Xmas vacation now the best way to profit off Omicron news?",
      "type": "story"
    }
  ]
}