{
  "stories": [
    {
      "by": "prasenjit_pro",
      "descendants": 0,
      "id": 32012004,
      "score": 1,
      "text": "The very best startups build network effects along with utility value.<p>My startup, on the face of it, is just a utility tool. It’s a Rotating Proxy Service. Programmers call the API with a URL and based on that, I fetch the contents of the URL using proxies and give it back to their crawlers — end of the story.<p>But as a company, that’s not the only value I accumulate or provide. We talk to every customer about their exact needs and see all the problems they face in the whole process of web crawling and web scraping. We are very, very interested in knowing all their issues, knowledge, and lack of it, questions, doubts, options, ideas, failures, and successes. We ask them directly, we infer them by looking at our data, and we look for them actively on the internet. People have many questions on sites like Quora, Reddit, Hacker News, and other forums about Web scraping.<p>Getting into scenes rather than working in isolation builds another subtle value, the value that emerges as a part of a network. It&#x27;s not just utility value. Like Facebook, as more and more people join the system, the cost of Facebook increases for every single user. That’s a network effect.<p>That’s why even when marketing, we want to end up creating network effects in the long run. An ad, for example, works to get you a visit and even a customer, but it doesn’t accumulate any value. A blog post, for example, is slower to produce amount, but it will live forever and produces data network effects.<p>Quora is an example of data network effects gone wild. As more people ask, view, rate, and answer questions, the value of Quora increases for everyone. We want to be tied into that value growth.<p>The more we participate in communities like this, post our ideas and thoughts liberally and generously on our blog, on medium, Linkedin, Facebook, etc., the more people find value in interacting with us. It is not just signing up to our service and uses it. It is this collective value of the content we have produced, The understanding of the space and its problems that we have painstakingly accumulated by poking our nose into peripheral issues that we didn’t have to get in. Talking and participating in efforts and discussions that are pushing the boundaries of web scraping is felt and is a benefit to a lot of our existing and new customers. I imagine this whole thing that we do, as an organism, slowly but surely moving, having a life of its own and getting more valuable as it grows in size, in connections, in knowledge, in empathy to the problems and goodwill. All this adds up to the product experience. It is tough work — especially in the beginning when you see no results, but it is now working for us.<p>This overall network effect also produces a highly defensible company as a side effect. It is complicated to compete with a company like this because of this level of moat. The value doesn’t just rest in the features but also leans heavily in the network, both of data, search engine rankings, and even human connection and goodwill.<p>The author is the founder of Proxies API (https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;) the rotating proxies service.\nThis article originally appeared here: https:&#x2F;&#x2F;www.proxiesapi.com&#x2F;blog&#x2F;new-article-199765.html.php",
      "time": 1657188560,
      "title": "Build Network Effects for Your SaaS Startup",
      "type": "story"
    },
    {
      "by": "steve_g",
      "descendants": 0,
      "id": 32011996,
      "score": 1,
      "time": 1657188521,
      "title": "Republican Party claims Gmail blocks their fundraising",
      "type": "story",
      "url": "https://twitter.com/GOPChairwoman/status/1542261091241279488"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 32011979,
      "kids": [
        32011980
      ],
      "score": 1,
      "time": 1657188415,
      "title": "Will Asteroid 2022 NF Impact Earth?",
      "type": "story",
      "url": "https://theskylive.com/will-asteroid-2022nf-impact-earth"
    },
    {
      "by": "janandonly",
      "descendants": 0,
      "id": 32011962,
      "score": 1,
      "time": 1657188239,
      "title": "The perfect playlist with music for programming or thinking, NO VOCALS",
      "type": "story",
      "url": "https://open.spotify.com/playlist/75DHV3ljSZdGdxzDbbYjmY"
    },
    {
      "by": "clove",
      "descendants": 0,
      "id": 32011926,
      "score": 2,
      "time": 1657187965,
      "title": "Boris Johnson to resign as UK prime minister",
      "type": "story",
      "url": "https://seekingalpha.com/news/3854862-boris-johnson-to-resign-as-uk-prime-minister"
    },
    {
      "by": "snird",
      "descendants": 0,
      "id": 32011919,
      "score": 2,
      "time": 1657187940,
      "title": "Crystal Lang 1.5.0 Released",
      "type": "story",
      "url": "https://github.com/crystal-lang/crystal/releases/tag/1.5.0"
    },
    {
      "by": "repox",
      "descendants": 0,
      "id": 32011905,
      "score": 1,
      "text": "Are anyone else experiencing issues with Apple Developer Enterprise Program renewals not being processed in time?<p>This morning we opened up roughly ~400 stores with iPad POS apps that couldn&#x27;t be started nor updated due to a delay in the processing of renewals for Apple Developer Enterprise Program. We have a external partner who is caught in the same sitation.<p>We&#x27;ve been in contact with Apple who tells us that they will give us an update latest next week.<p>Are we just unlucky or is this a bigger issue than I think?",
      "time": 1657187866,
      "title": "Ask HN: Apple Developer Enterprise Program renewals not being processed in time?",
      "type": "story"
    },
    {
      "by": "the-mitr",
      "descendants": 0,
      "id": 32011904,
      "score": 2,
      "time": 1657187858,
      "title": "First commercial sand battery begins energy storage in Finland",
      "type": "story",
      "url": "https://newatlas.com/energy/sand-battery-polar-night/"
    },
    {
      "by": "dragonsh",
      "descendants": 0,
      "id": 32011866,
      "score": 1,
      "time": 1657187567,
      "title": "Sonic-Pi release 4.0 – Get ready to Jam with v4 of Sonic Pi",
      "type": "story",
      "url": "https://github.com/sonic-pi-net/sonic-pi/releases/tag/v4.0.0"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32011853,
      "score": 1,
      "time": 1657187458,
      "title": "The deep, long-lasting, and sometimes bizarre symbolism of the Eye of Horus",
      "type": "story",
      "url": "https://www.zmescience.com/science/the-deep-long-lasting-and-sometimes-bizarre-symbolism-of-the-eye-of-horus/"
    }
  ]
}