{
  "stories": [
    {
      "by": "wholeness",
      "descendants": 0,
      "id": 30504474,
      "score": 2,
      "time": 1646078952,
      "title": "The legend of the horned rabbit of the West",
      "type": "story",
      "url": "https://www.hcn.org/articles/books-the-legend-of-the-horned-rabbit-of-the-west"
    },
    {
      "by": "areoform",
      "descendants": 0,
      "id": 30504462,
      "score": 2,
      "time": 1646078904,
      "title": "Lockheed, Northrop, York Space to build DoD’s internet-in-space constellation",
      "type": "story",
      "url": "https://spacenews.com/lockheed-martin-northrop-grumman-york-space-selected-to-build-dods-internet-in-space-constellation/"
    },
    {
      "by": "aspenmayer",
      "descendants": 0,
      "id": 30504455,
      "score": 1,
      "time": 1646078874,
      "title": "Dutch watchdog fines Apple again; company argues it has complied",
      "type": "story",
      "url": "https://www.reuters.com/technology/apple-says-it-has-complied-with-dutch-watchdog-letter-2022-02-28/"
    },
    {
      "by": "rocketdey",
      "descendants": 1,
      "id": 30504444,
      "kids": [
        30504445
      ],
      "score": 2,
      "time": 1646078827,
      "title": "Scraping Verified Contracts on BscScan",
      "type": "story",
      "url": "https://serpapi.com/blog/bsc-scan/"
    },
    {
      "by": "iafrikan",
      "descendants": 0,
      "id": 30504413,
      "score": 1,
      "time": 1646078701,
      "title": "Diversity in the Creative Industries",
      "type": "story",
      "url": "https://www.iafrikan.com/veli-ngubane-on-how-diversity-can-grow-the-creative-industries/"
    },
    {
      "by": "ayaanmomin",
      "descendants": 0,
      "id": 30504390,
      "score": 1,
      "text": "Hey guys! I’ve been working on Neutrino JS ([neutrinoJS.dev](http:&#x2F;&#x2F;neutrinoJS.dev)), a powerful engine that allows you to build complex MERN stack applications, both frontend and backend, lightning fast!<p>I know how hard it can be when building a technical startup, coding hours on end just to launch an initial MVP. In order to solve this problem, I decided to build Neutrino, so that people can speed up their development process and focus on gathering customers and feedback instead of spending all of their time building a prototype of MVP.<p>I have been working on this for a few weeks now and finally have decided to launch it for initial testing. I think the startup industry is a target segment for Neutrino, and would love it if you guys could test out the application and provide any feedback.<p>If you do have the time to test out the app and want to leave feedback, there is a link to a Google Form when you export a project.<p>*I truly appreciate your time, and hope that this small project has helped you in your own coding adventures!*",
      "time": 1646078609,
      "title": "Building Web Apps (MERN stack) in a matter of minutes for your Startup",
      "type": "story"
    },
    {
      "by": "jbredeche",
      "descendants": 0,
      "id": 30504388,
      "score": 2,
      "time": 1646078604,
      "title": "Pfizer Shot Is Far Less Effective in 5-11 Year-Olds Than in Older Kids",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/28/health/pfizer-vaccine-kids.html"
    },
    {
      "by": "drocer88",
      "descendants": 3,
      "id": 30504313,
      "kids": [
        30504450,
        30504409,
        30504340
      ],
      "score": 5,
      "time": 1646078129,
      "title": "Democratic Socialists blame US imperialism for Russian invasion of Ukraine",
      "type": "story",
      "url": "https://nypost.com/2022/02/28/democratic-socialists-blame-us-imperialism-for-russian-invasion-of-ukraine/"
    },
    {
      "by": "cosmorocket",
      "descendants": 0,
      "id": 30504303,
      "score": 2,
      "text": "I was thinking about building an app for adult p2p video calls with random people similar to chatroulette but with its own unique (as I hope) features.<p>I was absolutely sure the app I&#x27;d have built could never be approved in App Store because they don&#x27;t allow adult-content oriented apps to be published.<p>So, that&#x27;s fine, I knew it from the start so I started building a webapp optimized for mobile devices as the primary goal. But, when I had a look at the potential competitors, I found out some of them have their apps in App Store looking absolutely fine, searchable and installed by hundreds of users. Though, the apps have these words or similar in the descriptions: &quot;Dating app&quot;, &quot;Meet new people&quot;, &quot;Video chat with girls&quot; and so on. They don&#x27;t have any clear signs they expose any adult content, but in practice obviously it&#x27;s their purpose.<p>Well, that&#x27;s fine as well, I am not here to blame anyone doing their business their way. But my concern is also practical - seeing these apps to be sound and safe in the AppStore, what if I consider to build an iOS version of my webapp and publish it?<p>What would be the symptoms I am getting into the yellow or red zone for the AppStore reviewers? I know I can pretend the video app I am building is just for nice innocent flirt and smiles.<p>But how the AppStore reviewers see it? I am sure they saw millions of shady apps they precisely know the purpose of.<p>Are there any guidelines for such apps to not fall into the blacklist?",
      "time": 1646078076,
      "title": "Ask HN: Where is the border between allowed and disallowed in Apple appstore?",
      "type": "story"
    },
    {
      "by": "adenner",
      "descendants": 0,
      "id": 30504301,
      "score": 2,
      "time": 1646078070,
      "title": "Kosovo asks U.S. for permanent military base, speedier NATO membership",
      "type": "story",
      "url": "https://www.ctvnews.ca/world/kosovo-asks-u-s-for-permanent-military-base-speedier-nato-membership-1.5798740"
    }
  ]
}