{
  "stories": [
    {
      "by": "ahiknsr",
      "descendants": 0,
      "id": 32015145,
      "score": 1,
      "time": 1657206918,
      "title": "A Biased Article About Finding and Maintaining Love",
      "type": "story",
      "url": "https://www.residentcontrarian.com/p/a-biased-article-about-finding-and"
    },
    {
      "by": "Peach_blue",
      "descendants": 0,
      "id": 32015129,
      "score": 1,
      "text": "By abusive I mean somebody who intentionally sets impossible deadlines, denigrates you or possibly insults you personally. Also choleric temperament types count and when a lot of employee behavior is fear driven.<p>Regardless of the answer, I&#x27;d also be interested in how prevalent you think the issue is in tech compared to other industries.<p>I know its hard to gauge and unscientific, but I think you can make tentative statements sometimes. For example, I would say head chefs are generally more abusive than head engineers.<p>I&#x27;d be interested in your experiences.",
      "time": 1657206849,
      "title": "Ask HN: Have you ever worked under an abusive boss?",
      "type": "story"
    },
    {
      "by": "adoga",
      "descendants": 0,
      "id": 32015124,
      "score": 1,
      "text": "I&#x27;m a first time tech lead (CTO, but functionally more of a tech lead) at a start up and I&#x27;ve been struggling with the advice of &quot;holding someone accountable&quot;.<p>My vision for culture was to use a KanBan process so that we could quickly iterate, be agile, and set up a sustainable workload. Mostly using Eric Brechner&#x27;s &quot;is this task less than 5 days?&quot; to break work down and put it on the board.<p>So far this has worked out well for 3 developers on the team -- they work hard, communicate often, and really try to push the ball down the field every day. Code is checked in on a daily &#x2F; every other day basis and overall have a high degree of &quot;accountability&quot; to work hard every day.<p>We brought on a senior backend developer in May who had previously worked at a bank for 10 years. He was meant to be a key hire to take over on some of my involvement with the backend codebase (note that I am not the original author, it was originally written by a previous contracting house). Overall I would describe him as &quot;okay&quot; -- has been slow on his tasks (&quot;is this less than 5 days&quot; = 5 days), overshooting timelines that he gives (everything is always &quot;1 or 2 days away&quot;) , and &quot;okay&quot; quality.<p>- I&#x27;m a developer and understand that there is an element of &quot;it takes as long as it takes&quot;, but I want to start thinking in days instead of weeks for tasks<p>- I had a 1-on-1 with him today and he describe it as &quot;relaxed&quot; which is definitely not how I&#x27;ve been feeling<p>I&#x27;m not quite sure what to do in this situation -- clearly there is an element of mismanagement on my end, but there is also an element of &quot;this person is not driven like the rest of the team&quot; that I don&#x27;t quite know how to handle. How do you determine how much is your own failure as a manager, versus how much is someone just &quot;not working out&quot;?<p>- Do I just need to get really specific about asking &quot;how long will this take&quot; for every task and then trying to hold his feet to the fire when we get there? What does this look like?<p><pre><code>    - &quot;You said 2 days ago that it would be done in 1-2 days, what&#x27;s going on?&quot; What if they come up with excuses?\n\n    - I have an agreeable personality which I am trying to overcome, and so am trying to figure out how to navigate conflict in a healthy way\n</code></pre>\nAny help &#x2F; resource recommendations would be greatly appreciated!",
      "time": 1657206817,
      "title": "Ask HN: How to Hold Someone Accountable?",
      "type": "story"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 32015087,
      "score": 1,
      "time": 1657206606,
      "title": "Boris Johnson resignation: What happens now?",
      "type": "story",
      "url": "https://www.bbc.com/news/uk-politics-62068930"
    },
    {
      "by": "wyldfire",
      "descendants": 1,
      "id": 32015073,
      "kids": [
        32015138
      ],
      "score": 2,
      "time": 1657206551,
      "title": "Playstation Store will remove customers' purchased movies",
      "type": "story",
      "url": "https://www.flatpanelshd.com/news.php?subaction=showfull&id=1657022591"
    },
    {
      "by": "martialg",
      "descendants": 0,
      "id": 32015030,
      "score": 1,
      "time": 1657206355,
      "title": "I only understand Train Station",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Bahnhof_verstehen"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 32014988,
      "score": 1,
      "time": 1657206165,
      "title": "The Wheels Have Come Off Toyota's Electric Vehicles",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-06-29/the-wheels-come-off-toyota-s-electric-vehicles"
    },
    {
      "by": "rsync",
      "descendants": 1,
      "id": 32014969,
      "kids": [
        32015088
      ],
      "score": 2,
      "time": 1657206094,
      "title": "Zrepl on Rsync.net",
      "type": "story",
      "url": "https://blog.lenny.ninja/zrepl-on-rsync-net.html"
    },
    {
      "by": "mtolga",
      "descendants": 0,
      "id": 32014950,
      "score": 2,
      "time": 1657206006,
      "title": "What's make authorization hard, and how to get it right",
      "type": "story",
      "url": "https://www.permify.co/post/why-decouple-authorizations"
    },
    {
      "by": "josephhu",
      "descendants": 1,
      "id": 32014946,
      "kids": [
        32014947
      ],
      "score": 1,
      "time": 1657205996,
      "title": "Easy Learning Python 3",
      "type": "story",
      "url": "https://www.amazon.com/Easy-Learning-Python-Beginners-Guide-ebook/dp/B07Q4PYMCX"
    }
  ]
}