{
  "stories": [
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 28175187,
      "score": 1,
      "time": 1628892288,
      "title": "How to Explain the Rise and Fall of WeWork?",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/18/books/review/the-cult-of-we-eliot-brown-maureen-farrell.html"
    },
    {
      "by": "8iterations",
      "descendants": 0,
      "id": 28175185,
      "score": 1,
      "time": 1628892282,
      "title": "Guide to RNA-Seq Analysis",
      "type": "story",
      "url": "https://petridishtalk.com/2021/08/11/rnaseq/"
    },
    {
      "by": "Nrbelex",
      "descendants": 0,
      "id": 28175177,
      "score": 1,
      "time": 1628892254,
      "title": "Google Infringed on Sonos Patents, Judge Says",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/13/technology/google-sonos-patents.html"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 28175170,
      "score": 1,
      "time": 1628892227,
      "title": "Gary Tan: Robots Can See – They Can Even Paint My Nails (7 M Video)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Q9HY5Fu-Wps"
    },
    {
      "by": "felex",
      "descendants": 0,
      "id": 28175167,
      "score": 1,
      "text": "Hi everyone, seeking some advice - newbie here so if this doesn&#x27;t belong here please tell me to delete.\n29 yo. College background: Quantitative Econ and Finance. Work background: Was a finance bro for a few years (wall street) then joined the startup world as an employee (operator) and really learned the business &#x2F; commercial skills (think biz-dev&#x2F;marketing&#x2F;ops.. did almost every division that is non-technical).<p>Looking to build something of my own in the future, but I&#x27;m in no rush and I have a very long-term view of things in that I want to achieve true mastery in this field. I have been thinking to supplement my business skills with engineering skills - to do a bootcamp and work as a SWE for 2-5 years. Rationale: this will make me a good engineer and will allow me to learn and earn at the same time, while being able to build my own projects in evenings&#x2F;weekends and upskilling, and adding the technical skills to my skill-stack which already consists of the business side of things.<p>I may be wrong but I have this vision for being a &#x27;full stack operator&#x27; - not that I&#x27;ll ever be as good of a coder as the person doing it since their teenage years, but just to be able to build mvp &#x2F; communicate with engineers &#x2F; have technical awareness etc, I think it will go a long way if I&#x27;m planning to be in this industry for several decades to come (hopefully). I have the business skills but I&#x27;m thinking of getting the technical skills too. Of course I know many people who only have business skills and build successful companies, and I know it&#x27;s not a requirement. However, I have an admiration for the very few who can build and can sell and have a long-termist view on things (think Bezos).<p>There is the classic debate of specialisation vs generalisation, however I wouldn&#x27;t call this generalisation given that it&#x27;s in the same field of building technology companies and will solidify my overall skillset. However, turning 30 soon and as Bill Gates once said: I&#x27;d rather teach an engineer marketing than teach a marketer engineering. As age goes up, some say focus and energy goes down, but I&#x27;m not sure this applies to someone in early 30s of their career.<p>Any thoughts &#x2F; advice would be sincerely appreciated. Stick to doubling down on my business skills, or supplement the business skills with technical skills? Thanks so much to all.",
      "time": 1628892215,
      "title": "Ask HN: Double down on business skills, or supplement biz skills w technical?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28175146,
      "score": 1,
      "time": 1628892125,
      "title": "Exploring Clang/LLVM optimization on programming horror",
      "type": "story",
      "url": "https://blog.matthieud.me/2020/exploring-clang-llvm-optimization-on-programming-horror/"
    },
    {
      "by": "ldayley",
      "descendants": 1,
      "id": 28174992,
      "kids": [
        28175128,
        28175157
      ],
      "score": 12,
      "time": 1628891377,
      "title": "After criticism, Apple to only seek abuse images flagged in multiple nations",
      "type": "story",
      "url": "https://mobile.reuters.com/article/idUSKBN2FE21K"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 28174989,
      "score": 1,
      "time": 1628891350,
      "title": "Startups Are Not Great for Marriages",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/02/books/review/startup-wife-tahmima-anam-edge-case-yz-chin.html"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 28174944,
      "kids": [
        28174949
      ],
      "score": 2,
      "time": 1628891105,
      "title": "Walgreens Brings 122 Apps to the Cloud",
      "type": "story",
      "url": "https://www.wsj.com/articles/walgreens-brings-122-apps-to-the-cloud-11628710941"
    },
    {
      "by": "Overton-Window",
      "descendants": 0,
      "id": 28174929,
      "score": 1,
      "time": 1628891010,
      "title": "What’s wrong with the cultural elite? (2017)",
      "type": "story",
      "url": "https://www.ft.com/content/8fe23470-4010-11e7-82b6-896b95f30f58"
    }
  ]
}