{
  "stories": [
    {
      "by": "willswire",
      "descendants": 0,
      "id": 27961660,
      "score": 1,
      "time": 1627317826,
      "title": "Read the Bible in a Year – The M'Cheyne Plan API",
      "type": "story",
      "url": "https://api.mcheyne.org"
    },
    {
      "by": "mdsami",
      "descendants": 0,
      "id": 27961652,
      "score": 1,
      "time": 1627317803,
      "title": "Show HN: 2500 Illustrations Design for Startups",
      "type": "story",
      "url": "https://www.uihut.com/illustration/illustration"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 27961646,
      "score": 1,
      "time": 1627317781,
      "title": "Artificial Intelligence and Magical Thinking",
      "type": "story",
      "url": "https://edwardfeser.blogspot.com/2019/03/artificial-intelligence-and-magical.html"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27961636,
      "score": 1,
      "time": 1627317737,
      "title": "Google Releases Privacy Sandbox Timeline",
      "type": "story",
      "url": "https://www.mediapost.com/publications/article/365377/google-releases-privacy-sandbox-timeline.html"
    },
    {
      "by": "Cullinet",
      "descendants": 0,
      "id": 27961630,
      "score": 1,
      "text": "Hi HN!<p>this was originally a specific question, but because I am totally naïve to the entire subject personally, what do you consider as being the boundaries of engagement with open source development as a corporate sponsor of GPL licensed features and even discreet tools and applications?<p>The original question is from a attorney who is fed up with the difficulties with printing from iPhone and so thoroughly annoyed I&#x27;ve been told to come back with a price on this problems head. Well, the request was unusually emotionally made, by a client unknown for emotion and definitely known for following through, plus the business logic exists for this for sure.<p>So can a real small, but dedicated and I&#x27;ll wager socially beneficial attorneys firm of 5 lawyers, succeed in financing successful pieces of open source software?<p>I&#x27;ve so much to add about this client I&#x27;ve known for 30 years, which I think will help understand the particular motivations, sincerity and needs of this client, however the general case is interesting to me increasingly, after a morning thinking about it. Are there any good case studies available? Could it be helped by a kind of agency assistance, such as the framework for rewards and delivery that a really good attorney can provide? I was daydreaming I&#x27;d find a clearing house where talented programmers are offering the prices for professional completion of their existing interests which are only not justified by reason of inability to support or release to quality that reflects their true abilities, and so on. My client is of a generation to automatically have been skeptical, assuming that the burden of compliance with regulations and standards and statutory testing is a burden on software developers. I didn&#x27;t play that down too much, thinking how good a test budget would be to have - I mention this because couldn&#x27;t a more organised exchange for bounties and code be at a advantage to automatically allocate budgets for such sensible purposes? I expect I am simply naïve and don&#x27;t see why this shouldn&#x27;t work in the event the right initiative is started. I can&#x27;t stop thinking that eg a talented games developer could offer to write a popularly desired code on the condition of meeting the bounty necessary for fulfilment of a serious concern or any unresolved ancient Mozilla bug...",
      "time": 1627317700,
      "title": "Ask HN: How far can OSS development bounties go?",
      "type": "story"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 27961627,
      "score": 1,
      "time": 1627317697,
      "title": "Learn How to Remove Fake Google Reviews",
      "type": "story",
      "url": "https://www.minclaw.com/how-to-remove-and-report-fake-google-reviews/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27961610,
      "score": 1,
      "time": 1627317622,
      "title": "Russian internet censor blocks Team Navalny websites",
      "type": "story",
      "url": "https://globalvoices.org/2021/07/26/russian-internet-censor-blocks-team-navalny-websites/"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 27961606,
      "score": 12,
      "time": 1627317598,
      "title": "Toyota is quietly pushing Congress to slow the shift to electric vehicles",
      "type": "story",
      "url": "https://www.theverge.com/2021/7/26/22594235/toyota-lobbying-dc-ev-congress-biden-donation"
    },
    {
      "by": "senor_lecce",
      "descendants": 0,
      "id": 27961603,
      "score": 1,
      "time": 1627317596,
      "title": "Binance, FTX slash crypto leverage after NYT report on margin trading",
      "type": "story",
      "url": "https://protos.com/crypto-leverage-binance-ftx-margin-trading-nyt-report/"
    },
    {
      "by": "thomasfromcdnjs",
      "descendants": 0,
      "id": 27961590,
      "score": 1,
      "time": 1627317549,
      "title": "Connecting GPT-3 to Clubhouse social app to have conversations with Node.js",
      "type": "story",
      "url": "https://lordajax.com/post/Omega-Clubhouse-GPT-3-bot/?a"
    }
  ]
}