{
  "stories": [
    {
      "by": "sirius93",
      "descendants": 0,
      "id": 31736582,
      "score": 1,
      "time": 1655199520,
      "title": "Understanding version control and mastering Git – The Basics",
      "type": "story",
      "url": "https://blog.nandankumar.info/understanding-version-control-and-mastering-git-the-basics"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31736578,
      "score": 1,
      "time": 1655199482,
      "title": "Jamie Dimon Says JPMorgan Is Bracing for Economic ‘Hurricane’",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-06-01/jamie-dimon-says-bank-is-bracing-itself-for-economic-hurricane"
    },
    {
      "by": "jjcm",
      "descendants": 0,
      "id": 31736563,
      "score": 1,
      "time": 1655199342,
      "title": "Meta’s Prototype Photoreal Avatars Can Now Be Generated with an iPhone",
      "type": "story",
      "url": "https://uploadvr.com/meta-codec-avatars-iphone-scan/"
    },
    {
      "by": "jakobgreenfeld",
      "descendants": 0,
      "id": 31736540,
      "score": 1,
      "time": 1655199085,
      "title": "I discovered a cure for writer’s block",
      "type": "story",
      "url": "https://jakobgreenfeld.com/content-ideas"
    },
    {
      "by": "ncmncm",
      "descendants": 0,
      "id": 31736539,
      "score": 1,
      "text": "Seemingly everyone who talks about storage for intermittent renewable energy goes straight for batteries. But today most utility storage uses gravity, because gravity storage is <i>cheaper</i>. That is unlikely to change. (There will be reasons to use  a mix of other storage in many places, too, even when it costs more.)<p>There are many different kinds of gravity storage, most dead simple [*]. Transmission lines mean it doesn&#x27;t all need to be right nearby. Most scale up or down as needed.<p>Pumped hydro, unlike hydro power generation, doesn&#x27;t need a watershed. Any hilltop depression will do, or a box canyon with a dam, or even a flat hilltop with a dike. Sea water is fine, if your turbine and pump are OK with it. E = mgh.<p>The world is absolutely perforated with disused vertical mine shafts. Hang a 10,000t weight from a motor &#x2F; generator winch; raise to store energy, lower to extract it. It starts up instantly on demand. E = mgh.<p>Anchor a bag to the sea floor, with a hose down to it. Pump air in, inflating it, and let it out through a turbine. The deeper it is, the more energy it stores per unit of air pumped in. Valves switch your pump and turbine among as many hoses as you have. Startup takes only as long as to spin up your turbine.<p>Run a cable from a float down through a sea-floor pulley and up to a motor &#x2F; generator winch on shore. Store energy by cranking the float down toward the pulley. The winch can be shared among as many cable reels as you have, with a simple clutch&#x2F;brake. Startup is instant. A 10m diameter float exerts &gt;500t; 20m &gt;4000t, 30m &gt;14000t. E = Bh.<p>If it&#x27;s so easy, why don&#x27;t we have a lot of this already? Building much storage without enough non-fossil generating capacity to charge it from would be stupid; the money is better spent building out generating capacity. So, after we have lots, <i>then</i> build storage. But storage can usefully be charged from existing nukes or geo, for load-following; we mostly use pumped hydro for that now.<p>[*] except Energy Vault (NRGV), a $2B market-cap investment scam. Lately they are promoting a condominium for concrete blocks, with elevators. I am not joking!*",
      "time": 1655199063,
      "title": "Gravity Energy Storage",
      "type": "story"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 31736522,
      "score": 1,
      "text": "Anyone undergo hack raising efficiency online streaming in Linux, preferably CPU AMD specific ?<p>Arch default setting on AMD laptop seems very inefficient often lags and gets overheat fast.<p>Maybe one kind enough to share his golden solution key so that more else can benefit out of it",
      "time": 1655198882,
      "title": "Ask HN: How to raise efficient online streaming on Linux",
      "type": "story"
    },
    {
      "by": "anupj",
      "descendants": 0,
      "id": 31736520,
      "score": 1,
      "time": 1655198851,
      "title": "You Can Code",
      "type": "story",
      "url": "https://www.anup.io/p/you-can-code"
    },
    {
      "by": "indoorskier",
      "descendants": 0,
      "id": 31736502,
      "score": 1,
      "time": 1655198753,
      "title": "Property-Based Testing: Shrinking test failures automatically for easy debugging",
      "type": "story",
      "url": "https://getcode.substack.com/p/property-based-testing-3-shrinking"
    },
    {
      "by": "KingOfCoders",
      "descendants": 0,
      "id": 31736498,
      "score": 2,
      "time": 1655198736,
      "title": "Declassified files reveal British interest in Falkland Islands oil",
      "type": "story",
      "url": "https://www.theguardian.com/uk-news/2022/jun/14/declassified-files-reveal-british-interest-in-falkland-islands-oil"
    },
    {
      "by": "nkjoep",
      "descendants": 0,
      "id": 31736492,
      "score": 3,
      "time": 1655198705,
      "title": "Million",
      "type": "story",
      "url": "https://millionjs.org/"
    }
  ]
}