{
  "stories": [
    {
      "by": "scailer",
      "descendants": 0,
      "id": 29510163,
      "score": 1,
      "text": "We are the developers of Scailer, a new desktop email client for Windows and Mac. Scailer is entering the final beta test and we would love to get feedback on it before the final release. As a thank you, the first 300 users to give us feedback will get an unlimited version for free.<p>Scailer is the first email client that sorts messages by contacts like WhatsApp, giving a different and (we think) better way of working with email - there’s no folders, rules or categories because, in earlier testing, we found it just wasn’t needed. Anyone who sends emails to several different people in a day should find Scailer is a good fit for them. All of our previous test users have found that they worked faster and found dealing with their email easier than before once they’d gotten used to the Scailer way of using their email. Scailer provides the highest level of email security and protection of your data, with strong encryption of your local email database as standard.<p>If you’d like to get involved, you can download Scailer here https:&#x2F;&#x2F;scailer.com&#x2F;download. Since the Scailer way of working with mail can take a little getting used to, we would be grateful if you tried the program for a week first before giving us feedback (either through the Google form that will be sent to you within the program or below in the comments).<p>We&#x27;d love to hear feedback from the HN community prior to the release of the product to see if you liked the software, and what you think we can improve. We will try to answer any questions as soon as we get them. If you’d like, you can read more here https:&#x2F;&#x2F;scailer.com&#x2F;news&#x2F;join-final-beta-testing \nThank you all, we can’t wait to hear from you!<p>Sincerely,\nThe Scailer Team.",
      "time": 1639146259,
      "title": "Call for testers of a new email client that sorts messages by contacts",
      "type": "story"
    },
    {
      "by": "ekovarski",
      "descendants": 0,
      "id": 29510154,
      "score": 1,
      "time": 1639146210,
      "title": "Better CEO 'Taking Time Off Effective Immediately': Email",
      "type": "story",
      "url": "https://www.vice.com/en/article/jgmpab/better-ceo-taking-time-off-effective-immediately-email"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29510140,
      "score": 1,
      "time": 1639146120,
      "title": "The end of Victorian culture, part I: structural forces",
      "type": "story",
      "url": "https://www.lesswrong.com/posts/xkShF3BQBnhpDMgGS/the-end-of-victorian-culture-part-i-structural-forces"
    },
    {
      "by": "d--b",
      "descendants": 0,
      "id": 29510134,
      "score": 1,
      "text": "Hi,<p>I need to make a product demo video for a tool I am building, but I have a pretty bad French accent coupled with a fairly uninspiring way of speaking, which I know would be detrimental to the demo I want to make.<p>So I am thinking of hiring someone to voice the demo, or even do the whole thing with a video insert. The product is quite technical, so there is that too...<p>Does anyone know about a service that does this? And how much should I expect to pay for this (roughly)?",
      "time": 1639146085,
      "title": "Ask HN: Voice over for Product Demo?",
      "type": "story"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 29510122,
      "kids": [
        29510124
      ],
      "score": 1,
      "time": 1639146001,
      "title": "When Purchasing a Real Estate NFT, What Are You Buying?",
      "type": "story",
      "url": "https://www.mansionglobal.com/articles/when-purchasing-a-real-estate-nft-what-are-you-really-buying-01639137564"
    },
    {
      "by": "hidden-spyder",
      "descendants": 0,
      "id": 29510107,
      "score": 1,
      "time": 1639145918,
      "title": "Sidebery – Tabs tree and bookmarks in sidebar",
      "type": "story",
      "url": "https://addons.mozilla.org/en-US/firefox/addon/sidebery/"
    },
    {
      "by": "jondishotsky",
      "descendants": 0,
      "id": 29510020,
      "score": 1,
      "time": 1639145460,
      "title": "Founders Fireside: Top10 *Cringe* Hiring Mistakes Founders Make at Pre-Seed/Seed",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=KmnFD0u6M7Q"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 29510009,
      "score": 1,
      "time": 1639145432,
      "title": "New White House Redline policy gives agencies 24hrs to assess major cyberattacks",
      "type": "story",
      "url": "https://www.cnn.com/2021/12/10/politics/white-house-red-line-policy-cyberattacks/index.html"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 29510003,
      "score": 1,
      "time": 1639145409,
      "title": "Narrowing the Educational Divide",
      "type": "story",
      "url": "https://connectinglearners.economist.com/connecting-learners/"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 29510000,
      "score": 1,
      "time": 1639145392,
      "title": "Rebuilding Redis in Ruby",
      "type": "story",
      "url": "https://redis.pjam.me/"
    }
  ]
}