{
  "stories": [
    {
      "by": "gadnuk",
      "descendants": 0,
      "id": 31743558,
      "score": 1,
      "time": 1655230476,
      "title": "US likely to cite Tesla crashes with automated systems",
      "type": "story",
      "url": "https://apnews.com/article/technology-business-5e6c354622582f9d4607cc5554847558"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31743545,
      "score": 1,
      "time": 1655230448,
      "title": "New entry-level iPad to pack A14 chip, 5G, and USB-C connectivity",
      "type": "story",
      "url": "https://9to5mac.com/2022/06/14/new-ipad-a14-chip-5g-and-usb-c/"
    },
    {
      "by": "boringg",
      "descendants": 0,
      "id": 31743534,
      "score": 1,
      "text": "What is everyone else thinking out there?  I know where I stand but am curious for other peoples intuition.  Interested in global perspectives as well.",
      "time": 1655230424,
      "title": "Ask HN: Gut feeling on North American economy for next 2 years?",
      "type": "story"
    },
    {
      "by": "munchor",
      "descendants": 0,
      "id": 31743527,
      "score": 1,
      "time": 1655230397,
      "title": "Unistore, Snowflake’s Workload for Transactional and Analytical Data",
      "type": "story",
      "url": "https://www.snowflake.com/blog/introducing-unistore/"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31743523,
      "score": 1,
      "time": 1655230379,
      "title": "Microsoft patches actively exploited Follina Windows zero-day",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/microsoft-patches-actively-exploited-follina-windows-zero-day/"
    },
    {
      "by": "jmeister",
      "descendants": 0,
      "id": 31743497,
      "score": 1,
      "time": 1655230221,
      "title": "Caterpillar to move corporate headquarters from Illinois to Texas",
      "type": "story",
      "url": "https://www.axios.com/2022/06/14/caterpillar-headquarters-move-illinois-texas"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31743479,
      "score": 1,
      "time": 1655230150,
      "title": "How to set Firefox as your default browser on Windows",
      "type": "story",
      "url": "https://blog.mozilla.org/en/products/firefox/how-to-set-firefox-as-your-default-browser-on-windows/"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 31743478,
      "score": 2,
      "text": "they shipped a redesign to move comments to the RHS on desktop, but in the process seem to have broken them completely https:&#x2F;&#x2F;twitter.com&#x2F;search?q=youtube%20comments&amp;src=typed_query<p>see also https:&#x2F;&#x2F;www.express.co.uk&#x2F;life-style&#x2F;science-technology&#x2F;1625472&#x2F;YouTube-comments-not-showing-bug-hits-Google-owned-site",
      "time": 1655230142,
      "title": "Tell HN: YouTube shipped a major redesign, broke its comments system",
      "type": "story"
    },
    {
      "by": "overclk64",
      "descendants": 0,
      "id": 31743452,
      "score": 1,
      "text": "I&#x27;ve been indeterministically bouncing from one state to another (and back again) for longer than I would like to admit. Frankly, I&#x27;m in a while(1) loop, and I desperately need someone to hand me a &#x27;break.&#x27; I would love to settle on the decision and act upon it. For context, I&#x27;m 28, a non-EU resident, and have been programming for five years.<p>I have always wanted to get a degree in software engineering. However, when I first considered going to university, my math skills were far below the level required for passing the entrance exam. Despite not knowing how to add two fractions, I was determined to get into the study program I wanted in the future. Fast-forward a few years: I invested about 2K hours, scattered across three years, in mathematics only. Besides math, I read and programmed a lot. I was very disciplined and covered about 70% of the university curriculum I was aiming for, including areas like computer architecture, computer networks, computer security, databases, operating systems, compilers, etc.<p>Considering that I have very high aspirations (migrating to EU&#x2F;US, six-figure income, etc.), what should I do? There are some compelling things about enrolling in a university: I&#x27;m sure having a diploma is very valuable for the immigration process, and good networking can never hurt. But I keep seeing people who succeeded even without a degree. I don&#x27;t know their path in detail, but I know they have done it, although they are usually EU residents. Anyway, an inevitable question arises: why haven&#x27;t I enrolled earlier? It almost feels unfair now. I&#x27;ve put so much work into everything, and for what, only to start from the beginning again? Time is precious. Besides that, I&#x27;m a bit skeptical about how the networking part would turn out since I&#x27;d be 10+ years older than most students. On the other hand, I&#x27;m positive I would regret it for the rest of my life if I hadn&#x27;t at least tried. I know that I would be miserable if I stayed here forever.<p>I just need someone to nudge me in the right direction with a convincing argument.<p>Thanks for reading.",
      "time": 1655229985,
      "title": "Ask HN: How do I stop flip-flopping an important decision?",
      "type": "story"
    },
    {
      "by": "ellen364",
      "descendants": 0,
      "id": 31743426,
      "score": 1,
      "time": 1655229910,
      "title": "UK health privacy watchdog still in talks over who is accessing Covid data store",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/14/ndg_covid_data_store/"
    }
  ]
}