{
  "stories": [
    {
      "by": "Marcusluddden",
      "descendants": 1,
      "id": 30973856,
      "kids": [
        30973857
      ],
      "score": 1,
      "time": 1649556213,
      "title": "Choices Wethepeople",
      "type": "story",
      "url": "https://github.noirsunsetmll.com"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 30973850,
      "score": 1,
      "text": "There are many different CI platforms; SourceHut CI, GitLab CI, GitHub Actions, Travis CI, CircleCI etc.<p>Each one of them has their own configuration setup with different ways to enable the CI, run commands and choose build environments.<p>Is there any way to have one git repository that does the same CI when it is pushed to all of the platforms?",
      "time": 1649556108,
      "title": "Ask HN: Cross-Platform CI?",
      "type": "story"
    },
    {
      "by": "jdkee",
      "descendants": 0,
      "id": 30973848,
      "score": 1,
      "time": 1649556089,
      "title": "As Climate Fears Mount, Some Are Relocating Within the US",
      "type": "story",
      "url": "https://www.wired.com/story/as-climate-fears-mount-some-are-relocating-within-the-us/"
    },
    {
      "by": "JonathanBuchh",
      "descendants": 0,
      "id": 30973822,
      "score": 1,
      "time": 1649555752,
      "title": "Getting Started with Security Keys",
      "type": "story",
      "url": "https://paulstamatiou.com/getting-started-with-security-keys/"
    },
    {
      "by": "badcarbine",
      "descendants": 1,
      "id": 30973819,
      "kids": [
        30973838
      ],
      "score": 1,
      "time": 1649555739,
      "title": "Magnetoplasmadynamics",
      "type": "story",
      "url": "https://fedbook.net/"
    },
    {
      "by": "goingindi",
      "descendants": 0,
      "id": 30973816,
      "score": 1,
      "text": "What are you using for appointment booking and payments?<p>As a service provider, one to one or one to many virtual meetings and hopefully ability to just get paid easily integrated or easily added on? Paypal least preferred. Looking for credit and bank options APAC location.",
      "time": 1649555721,
      "title": "Ask HN: Appointment Booking and Payments",
      "type": "story"
    },
    {
      "by": "lakeeffect",
      "descendants": 0,
      "id": 30973815,
      "score": 1,
      "text": "Best is pretty general but essentially maximum utility, least amount of cost&#x2F;complexity.  I want to securely track transactions and I&#x27;m wondering if something like what Git uses for versions is a logical option?  Using an nft seems like an expensive solution but are there unseen benefits of using a coin?  Does anyone know how Visa handles so many secure highly valuable transactions?",
      "time": 1649555678,
      "title": "Ask HN: What is the best way to track digital transactions?",
      "type": "story"
    },
    {
      "by": "Corrado",
      "descendants": 0,
      "id": 30973808,
      "score": 2,
      "time": 1649555651,
      "title": "Atlassian products have been down for 4 days",
      "type": "story",
      "url": "https://status.atlassian.com"
    },
    {
      "by": "FrenchAmerican",
      "descendants": 0,
      "id": 30973771,
      "score": 2,
      "text": "Our future on Earth is rather gloomy. We are causing a massive climate dereliction and an even larger loss of biodiversity - and we do very little about it.<p>The space programs to send humans in space are at the same time granted hundreds of billions. Many point that maybe this money should be invested in ... discovering our oceans rather than setting up a base on the Moon.<p>I was until recently convinced that it would be much more relevant. Now I wonder: Could it be better to keep the oceans away from our knowledge?<p>I know how absurd it sounds. My opinion varies accordingly to my mood, I reckon. One day, I have faith that knowledge and Science is The Way. The other day, I can&#x27;t help thinking that the current unchecked capitalism will ruthlessly exploit whatever Science discovers at whatever cost for the climate and biodiversity.<p>Could it be more ethical to keep our oceans and seas out of reach of capitalism?<p>Of course, it&#x27;s easy to argue that a better knowledge will empower the protectors of the oceans, since unchecked capitalism is already depleting the seas.<p>Scientific arguments would be therefore the only way to convince the governments to preserve the oceans.<p>But would they really? In the last 30 years, the IPCC reports have proved reliable. Its climate model has been being tuned continuously and their last report is now very reliable.<p>And yet we do nothing at the scale of the issue.<p>So what is the point, really, to know more about our oceans except opening new ways to make profits while destroying Life?<p>Hoping for the best as a principle is nice. And easy. But doing again and again the same error is stupid, isn&#x27;t it?<p>If we believed in Science and Technology as much as we pretend, why aren&#x27;t the 300 billions needed for a base on the Moon directed to find a technical solution to grab CO2 and methane from the atmosphere - at a scale large enough to stop global warming?<p>It seems that we trust Science and Technology in very different ways. A colony on Mars? Yeah, genius! Stop global warming? Rather than founding EarthX, Elon Musk himself prefers to grant 100 million to whoever finds the way to massively recapture CO2.<p>So, what do you think? Is Science the Way or are we helplessly the baddies, since we can&#x27;t help going to the Dark Side when money is to be made?",
      "time": 1649555047,
      "title": "Ask HN: Should we survey all the oceans?",
      "type": "story"
    },
    {
      "by": "2143",
      "descendants": 0,
      "id": 30973758,
      "kids": [
        30973761
      ],
      "score": 1,
      "time": 1649554824,
      "title": "The Submarine (2005)",
      "type": "story",
      "url": "http://www.paulgraham.com/submarine.html"
    }
  ]
}