{
  "stories": [
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28615399,
      "score": 1,
      "time": 1632312335,
      "title": "Public Attitudes Towards Offensive Language on TV and Radio",
      "type": "story",
      "url": "https://www.ofcom.org.uk/research-and-data/tv-radio-and-on-demand/tv-research/offensive-language"
    },
    {
      "by": "macphailmagwira",
      "descendants": 0,
      "id": 28615392,
      "score": 1,
      "text": "Website: www.denanse.com<p>Login with demo details, email:demo@denanse.com and Pass: 1234\nEmail at homepage to request for in live demo session<p>Startup Description:\nWe provide a cheaper, faster, and easier way for data-driven businesses in Africa to utilize their data to accelerate growth, profitability and solve business problems in minutes instead of months. It usually takes a lot of time and money to integrate data science tools into businesses, especially for SMEs, from hardware investment and management to hiring and training costs as well as developing machine learning models. We take care of all of that with our zero-code Cloud Data-Science Web Application at a fraction of the original cost. We have first launched our prototype within the financial services industry (e.g Banks, Fintechs, Mobile money), with the aim of aiding financial services with the detection of fraudulent transactions using machine learning and Biometrics Facial recognition for remote customer digital unboarding. Our goal is to provide a library of prebuilt tools to address different problem areas of the financial service business, from fraud to customer care, marketing, and risk management. In the future, we plan to provide other solutions for E-Commerce, Logistics, Government offices, and other data-driven businesses in Africa. We are currently in the beta testing phase with a major local bank. We basically hope to do for data science what Weebly did for websites, making it easier and more accessible to anyone.",
      "time": 1632312283,
      "title": "Show HN:Integrate Data Science tools in minutes instead of months for SMEs",
      "type": "story"
    },
    {
      "by": "johanam",
      "descendants": 0,
      "id": 28615386,
      "score": 1,
      "time": 1632312258,
      "title": "The Subreddit That Catalogs Anti-Vaxxer Covid Deaths",
      "type": "story",
      "url": "https://slate.com/technology/2021/09/hermancainaward-subreddit-antivaxxer-deaths-cataloged.html"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 28615374,
      "score": 1,
      "time": 1632312172,
      "title": "New iCloud Private Relay service leaks users’ true IP addresses",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/new-icloud-private-relay-service-leaks-users-true-ip-addresses-researcher-claims"
    },
    {
      "by": "pytlicek",
      "descendants": 0,
      "id": 28615338,
      "score": 1,
      "time": 1632311836,
      "title": "Tachyum Launches Customer Portal Giving Access to Prodigy Emulation System",
      "type": "story",
      "url": "https://www.tachyum.com/en-eu/media/press-releases/2021/09/21/tachyum-launches-customer-and-partner-portal-giving-access-to-prodigy-emulation-system/"
    },
    {
      "by": "treeboy0384",
      "descendants": 0,
      "id": 28615329,
      "score": 2,
      "text": "How do you handle CI pipeline in monorepo that contains frontend &amp; backend service? I usually use Github Actions for CI&#x2F;CD pipeline. I&#x27;m looking for how to build backend and frontend in same container and test frontend code with API calls. I thought it was possible but I can&#x27;t find anywhere to use them. There are some posts using multiple github actions file for microservice in monorepo. FYI) I use React&#x2F;Django",
      "time": 1632311737,
      "title": "Ask HN: How do you handle CI pipeline in front end-back end monorepo",
      "type": "story"
    },
    {
      "by": "nrsapt",
      "descendants": 0,
      "id": 28615321,
      "score": 2,
      "time": 1632311681,
      "title": "Principles of Green Software Engineering",
      "type": "story",
      "url": "https://principles.green/"
    },
    {
      "by": "Chan_Yuk_Chi",
      "descendants": 0,
      "id": 28615316,
      "score": 1,
      "time": 1632311598,
      "title": "Cooperation is a Learned Behaviour",
      "type": "story",
      "url": "https://sorryspeakup.substack.com/p/cooperation-is-a-learned-behaviour"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28615313,
      "score": 1,
      "time": 1632311546,
      "title": "Who Develops AI-Related Innovations, Goods and Services?",
      "type": "story",
      "url": "https://www.oecd.org/sti/who-develops-ai-related-innovations-goods-and-services-3e4aedd4-en.htm"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28615300,
      "score": 1,
      "time": 1632311377,
      "title": "Puppetromium – KISS browser from puppeteer and MJPEG with 0 client-side scripts",
      "type": "story",
      "url": "https://github.com/i5ik/puppetromium"
    }
  ]
}