{
  "stories": [
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31477125,
      "score": 1,
      "time": 1653300899,
      "title": "Immich: Self-hosted photo, video backup solution directly from your mobile phone",
      "type": "story",
      "url": "https://github.com/alextran1502/immich"
    },
    {
      "by": "pyb",
      "descendants": 0,
      "id": 31477113,
      "score": 1,
      "time": 1653300834,
      "title": "Deep Tech Deficit: Why more aren't starting technically ambitious companies",
      "type": "story",
      "url": "https://notes.michaeldempsey.me/post/636878548075937792/the-deep-tech-deficit-why-more-people-arent"
    },
    {
      "by": "jhylands",
      "descendants": 1,
      "id": 31477104,
      "kids": [
        31477117
      ],
      "score": 2,
      "text": "Does anyone have any tips for handling the fact that there is an ever growing number of apps to check messages on. I have to check linked in, email, texts, messenger, whatsapp, signal, telegram, slack etc\nEveryone seems to have their preference I have loads of friends who only use messenger, some who only use signal.\nAs a dyslexic I find it super hard to keep up and end up missing and forgetting loads of things as a result.\nDoes everyone just deal with it? Or is there a way to centralise my communication without hiring a pa?",
      "time": 1653300722,
      "title": "Ask HN: Tips for Reducing the Number of Inboxes",
      "type": "story"
    },
    {
      "by": "thebiblelover7",
      "descendants": 0,
      "id": 31477098,
      "score": 1,
      "time": 1653300669,
      "title": "Mdshow: Turn Markdown into beautiful presentations with reveal.js",
      "type": "story",
      "url": "https://github.com/jceb/mdshow"
    },
    {
      "by": "unknownsky",
      "descendants": 0,
      "id": 31477095,
      "score": 1,
      "text": "For example, to understand<p>if (obj.index == 0 &amp;&amp; (f_mode &gt; 3  || state[1] != null))<p>you need to know\n* What does obj represent\n* Under what circumstance does obj have an index of 0\n* Why we are interested in that circumstance for what we are trying to achieve\n* What does f_mode represent\n* Under what circumstances is f_mode greater than 3\n* etc etc etc<p>You need to know at least 10 things to understand it. However, if we break it up and replace it with<p>if (Membership.IsExpired)<p>then we need to know 0 things to understand it.<p>Is there some sort of principle that represents the number of things you need to know? A sort of Things You Need To Know To Understand This Index? Something that is a countable unit, so that you could say that one block of code has an index of 17 (i.e. you need to know 17 things to understand it) while another block of code has an index of 2?<p>We could start from a baseline assumption that the reader knows the coding principles themselves. The reader needs to know how an if-statement works, for example, but that would not be included in the index. One might argue about whether more obscure coding tricks should be included in the index or not.",
      "time": 1653300597,
      "title": "A word for “the number of things you need to know to understand the code”?",
      "type": "story"
    },
    {
      "by": "OnionRouted",
      "descendants": 0,
      "id": 31477093,
      "score": 1,
      "text": "Sorry if the title isn&#x27;t properly formulated. Due to the recent abuse of the current monetary policy from the governments, and especially from the US, this question came up to my head.<p>When I refer to &quot;real money&quot; I mean money, the asset, that can be redeemed by itself, without any trust. For example, gold is real money. Cash is real money; even if there&#x27;s a trust from the government since they&#x27;re printing it, there&#x27;s no trust when I hand out a dollar bill. Bitcoin is real money et cetera.<p>With this definition credit isn&#x27;t real money. You can create credit out of thin air. Credit requires trust to work; the existence of the previous assets.<p>My first question is: When a central bank wants to create money, does it have to print it? Since they are the only mint, what prevents them from pretending they have enough reserves (in cash) and increase their credit balance with zero risk? Why do they have to print notes and then burn them?<p>My second question is: Can a government create &quot;real money&quot; in an electronic form? I had watched once a Zeitgeist documentary regarding this matter, and said that the exchange of $10 billion in bonds between the US treasury and the FED happens electronically.<p>---<p>Just a folk who tries to figure out what&#x27;s happening in the world. Thanks!",
      "time": 1653300558,
      "title": "Questions regarding the current monetary system",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31477092,
      "score": 2,
      "time": 1653300544,
      "title": "HSBC exec suspended: ‘Who cares if Miami is six metres underwater in 100 years?’",
      "type": "story",
      "url": "https://www.fnlondon.com/articles/hsbc-exec-said-who-cares-if-miami-is-six-metres-underwater-in-100-years-now-hes-suspended-20220523"
    },
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 31477084,
      "score": 1,
      "time": 1653300425,
      "title": "Pollution was responsible for 9M premature deaths in 2019",
      "type": "story",
      "url": "https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196(22)00090-0/fulltext"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31477081,
      "score": 1,
      "time": 1653300400,
      "title": "Monkeypox Virus (MPXV)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Monkeypox"
    },
    {
      "by": "HieronymusBosch",
      "descendants": 0,
      "id": 31477071,
      "score": 2,
      "time": 1653300290,
      "title": "Rust for the Linux Kernel Updated, Uutils as Rust Version of Coreutils Updated",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Linux-v7-Plus-New-Uutils"
    }
  ]
}