{
  "stories": [
    {
      "by": "ilrwbwrkhv",
      "descendants": 0,
      "id": 31854902,
      "score": 1,
      "text": "In windows for example https:&#x2F;&#x2F;i.stack.imgur.com&#x2F;zxmjR.png the buttons take up full space which is a much larger target than the tiny ones on a mac.",
      "time": 1656017010,
      "title": "Ask HN: Any way to make Mac close, minimize buttons take full menu bar space?",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 31854885,
      "score": 1,
      "time": 1656016953,
      "title": "NASA Software Catalog",
      "type": "story",
      "url": "https://software.nasa.gov/"
    },
    {
      "by": "charlieirish",
      "descendants": 0,
      "id": 31854875,
      "score": 1,
      "time": 1656016898,
      "title": "Tailwind UI Templates",
      "type": "story",
      "url": "https://twitter.com/adamwathan/status/1540067077905682432"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 31854873,
      "score": 2,
      "time": 1656016884,
      "title": "App Rules Are Twisted to Absurdity",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/23/technology/app-rules-google-apple.html"
    },
    {
      "by": "arrjayh",
      "descendants": 0,
      "id": 31854837,
      "score": 1,
      "text": "Bit of background: Went to an okay uni, got decent grades, and have about 3 1&#x2F;2 years of industry experience. 2 1&#x2F;2 of those years were spent working on low level C stuff (a few device drivers) and a bit of C++&#x2F;Python application work (largely for system level tools - think PCIe device access and NIC configuration). After producing a few solid deliverables I figured it&#x27;d be good to make a horizontal move towards C++ application development and get broader experience. That ended up moving me to a FAANG subsidiary where I was bait and switched. A bit more on the bait and switch- the conversation (before I was hired) started as:<p>- We need a C++ person to develop applications<p>to (after I was hired)<p>- We need a C++ person to maintain our soon to be depreciated C++ apps<p>to (after I was being underutilized due to no real need for maintenance)<p>- We expect you to adapt and take on JavaScript&#x2F;React&#x2F;Next.JS work to help depreciate the C++ apps<p>This all happened in ~2 months.<p>Given that this company made a sizeable investment in me I agreed to take on some of the work (I was thinking maybe 6-8 months to try it out) and then wanted to transition to some back end service work using Go. They outlined a need for this and agreed to make some kind of transition, eventually.<p>Flash forward 6-8 months later:<p>- I&#x27;m producing half of what the junior front end engineers are producing<p>- After getting my head wrapped around the front end space and their tech stack I&#x27;m realizing it&#x27;s not for me<p>- I&#x27;m not generating any notable projects that could help me adopt more responsibility in the space (likely due to my first point)<p>So I gave them a hardball and threatened to quit. I outlined my major concern: I wasn&#x27;t hired to do front end work. They suggested I try to transfer teams internally- gave that a whirl and got absolutely jebaited with another team (ended up having to do a full 8 hour panel just to be rejected on something that wasn&#x27;t outlined in their job description). Asked more about the back end work they initially offered to which they responded by sending some crude unfinished docs... This really highlighted that the work, more or less, wasn&#x27;t really scoped or understood. To me, all this seemed like a losing situation. So... I quit and not in such a graceful fashion.<p>As a side note: while I was quitting I found out ~85% of the previous C++ team quit due to a similar bait and switch. Smells like ugly politics to me which really pushed me to leave sooner than my two weeks.<p>So now I&#x27;m in this weird position of having some interest in the front end space but not enough decent experience to actually do anything with it. I have enough low level experience to attract decent work but would have to likely relocate (which I&#x27;d like to not do unless I have to). And, sadly, I don&#x27;t have any bridge to connect these two skill sets.<p>I tried getting back into the interview loop and flopped pretty badly- mainly for back end work.<p>So what are the next steps? I&#x27;m definitely planning on taking some time off. I figured getting some opensource work knocked out in a more upcoming language could be good. Doing some leet code practicing, maybe? In either case I would love to get some input to help navigate this mess.<p>Also, I&#x27;ve started using some platforms to look for more work (namely LinkedIn) and I&#x27;m discovering how awful the recruiter spam is- any suggestions on better job boards would also be greatly appreciated.",
      "time": 1656016732,
      "title": "Seeking advice from a senior engineer type",
      "type": "story"
    },
    {
      "by": "kaycebasques",
      "descendants": 0,
      "id": 31854809,
      "score": 2,
      "time": 1656016576,
      "title": "Supply chain Levels for Software Artifacts (SLSA)",
      "type": "story",
      "url": "http://slsa.dev/"
    },
    {
      "by": "shry4ns",
      "descendants": 1,
      "id": 31854808,
      "kids": [
        31854868
      ],
      "score": 2,
      "text": "My non-US citizen friend who works for big tech in SF is contemplating joining a late stage startup in the next month or so (in SF). Given the current macro-economic climate, he&#x27;s a little hesitant on whether this is a good time to join a startup (Especially with the news of all the layoffs). Would appreciate any advice for him regarding whether it&#x27;s a good time to join a late stage startup and what signals to look for!",
      "time": 1656016575,
      "title": "Ask HN: Is this a good time to work at a startup?",
      "type": "story"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 31854780,
      "score": 2,
      "time": 1656016407,
      "title": "‘The impossible’: Ukraine’s secret, deadly rescue missions",
      "type": "story",
      "url": "https://apnews.com/article/ukraine-rescue-missions-daa28fd48e3e03c181c404b944d391e9"
    },
    {
      "by": "danso",
      "descendants": 0,
      "id": 31854749,
      "score": 1,
      "time": 1656016206,
      "title": "Lummis-Gillibrand Responsible Financial Innovation Act (S. 4356)",
      "type": "story",
      "url": "https://github.com/responsible-financial-innovation-act22/RFIA-bill"
    },
    {
      "by": "barry-cotter",
      "descendants": 1,
      "id": 31854738,
      "kids": [
        31854747
      ],
      "score": 4,
      "time": 1656016136,
      "title": "Advice for Academic Refugees",
      "type": "story",
      "url": "https://eigenrobot.substack.com/p/advice-for-academic-refugees"
    }
  ]
}