{
  "stories": [
    {
      "by": "steppi",
      "descendants": 0,
      "id": 28853717,
      "score": 1,
      "time": 1634140177,
      "title": "Erdős’s proof of Bertrand’s postulate (2015) [pdf]",
      "type": "story",
      "url": "https://www3.nd.edu/~dgalvin1/pdf/bertrand.pdf"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 28853713,
      "score": 1,
      "time": 1634140163,
      "title": "U.S. beats China as the number one destination for Bitcoin miners",
      "type": "story",
      "url": "https://www.cnbc.com/2021/10/13/us-beats-china-as-the-number-one-destination-for-bitcoin-miners.html"
    },
    {
      "by": "staccatomeasure",
      "descendants": 0,
      "id": 28853708,
      "score": 1,
      "time": 1634140146,
      "title": "Much ‘Artificial Intelligence’ Is Still People Behind a Screen",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2021-10-13/how-good-is-ai-much-artificial-intelligence-is-still-people-behind-a-screen"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28853692,
      "score": 1,
      "time": 1634140058,
      "title": "Socom Spy Plane Has a New (Possibly) Russian-Inspired Name: Foxhound",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/42708/one-of-u-s-special-operation-commands-shyest-spy-planes-has-a-new-name"
    },
    {
      "by": "py_or_dy",
      "descendants": 0,
      "id": 28853675,
      "score": 2,
      "text": "I&#x27;m curious how many people are having trouble getting hired lately?<p>I mostly voluntarily quit my full time dev job (web based ERP software powered by Perl) last June 2020 after covid cut hours. I figured it would be an easy step to jump from Perl web developer to Django. So I re-wrote my linkedin and resumes to mostly brand me as a &#x27;Django Expert&#x27;. I&#x27;ll admit my experience with it is more limited (compared to Perl offerings), but I have used it off and on for the last 6 years or so and can easily deploy apps using traditional HTML templating or rest based apps on modern javascript via Django rest framework.<p>Yet after sending out over 80 applications and doing about 60 interviews, I have not gotten any offers. I&#x27;m starting to get a bit nervous as savings are getting thin. I don&#x27;t think anything is wrong with my resume since I normally hear back from 80% of what I apply to. I&#x27;m starting to feel that perhaps the python&#x2F;django market is overly flooded at the moment? Should I perhaps try jumping to a different language like Go where the market isn&#x27;t so flooded (if that is the case)? I&#x27;m honestly shocked I have not had any offers. For the first 6 months, I&#x27;ll admit I didn&#x27;t try very hard to be friendly or personable. I felt like just showing I was a good &quot;worker bee&quot; would be good enough during interviews.<p>Since then I&#x27;ve taken a more scientific approach to interviewing and have tried many different tactics, from being overly friendly or talkative, to talking about a desire to move into management or a desire to not move into management. Emphasized different skills (or lack thereof), etc. And although in some cases I feel like I get along great with the team and my skill set is a direct match, I still end up not getting selected. Only about half the time is salary even discussed, so I&#x27;m not being limited by what I am asking for pay. Even worse, if I get feedback, it is always maligned. Just recently one small company said they didn&#x27;t choose me because they felt I was weak with databases. We had talked in detail about my experience with using postgresql as a data warehouse with 15 billion rows and 5tb of data and having migrated it through various OLAP schemas and dimensional models. To me, it just really feels like no one is actually hiring?! And sadly, job posting in September and October have really fallen flat compared to the last 6 months.<p>For the most part, I have been using boards like python.org&#x2F;jobs and the HN hired monthly post. I normally try to stick to small companies since they seem to value actual work skills instead of interview and leet code etiquette. So perhaps I should branch out to bigger companies? I tried for a few weeks to put my resume on dice.com but got slammed by recruiting firms sending me job apps that had nothing to do with my background and I was stupid enough to list my phone number so then I had recruiters calling me trying to sweet talk me into applying anyway because &quot;maybe they&#x27;ll hire you even though your skills aren&#x27;t a match&quot;. But that just lead to many interviews where I could tell the interviewer was annoyed with me since the req stated python + C# or Java experience and I had neither. I really can&#x27;t think of a better way to improve myself. I&#x27;ve got about 10 years experience and am getting close to the dreaded 40 year mark.  I have noticed a high percentage of jobs seem to want you to have a bunch of AWS experience. I&#x27;ve messed around with EC2 instances but that is about it. Not sure if it is worth it to try to get some AWS certs (I really hate certs) or what?",
      "time": 1634139973,
      "title": "Ask HN: Who has been unemployed for more than 6 months?",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28853662,
      "score": 1,
      "time": 1634139899,
      "title": "Tour of a B-52 Stratofortress",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/42703/this-is-the-most-incredible-tour-of-a-b-52-stratofortress-we-have-ever-seen"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28853653,
      "score": 1,
      "time": 1634139862,
      "title": "NYSE’s new investment vehicle –‘natural asset companies’– tap into ESG fever",
      "type": "story",
      "url": "https://fortune.com/2021/09/14/nyse-natural-asset-company-ieg-esg-investment-vehicle/"
    },
    {
      "by": "recov",
      "descendants": 0,
      "id": 28853650,
      "score": 1,
      "time": 1634139846,
      "title": "Lakes of Wada",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Lakes_of_Wada"
    },
    {
      "by": "danielam",
      "descendants": 0,
      "id": 28853637,
      "score": 1,
      "time": 1634139799,
      "title": "Intellectualization",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Intellectualization"
    },
    {
      "by": "kelseyfrog",
      "descendants": 0,
      "id": 28853636,
      "score": 1,
      "time": 1634139797,
      "title": "Circular Harmonics",
      "type": "story",
      "url": "https://valdes.cc/articles/ch.html"
    }
  ]
}