{
  "stories": [
    {
      "by": "jack-bodine",
      "descendants": 0,
      "id": 31270550,
      "score": 1,
      "time": 1651735193,
      "title": "It’s time to move away from Gmail",
      "type": "story",
      "url": "https://medium.com/@jimtdev/its-time-to-move-away-from-gmail-989bd859a81c"
    },
    {
      "by": "tomduncalf",
      "descendants": 0,
      "id": 31270543,
      "score": 1,
      "time": 1651735134,
      "title": "V86: x86 virtualization in the browser, recompiling x86 to WASM on the fly",
      "type": "story",
      "url": "https://github.com/copy/v86"
    },
    {
      "by": "hucste",
      "descendants": 0,
      "id": 31270541,
      "score": 1,
      "time": 1651735127,
      "title": "How to Contribute to the OpenBSD Project",
      "type": "story",
      "url": "https://dataswamp.org/~solene/2022-05-03-contributing-to-openbsd.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31270536,
      "score": 1,
      "time": 1651735085,
      "title": "Merlin: Context sensitive completion for OCaml in Vim and Emacs",
      "type": "story",
      "url": "https://github.com/ocaml/merlin"
    },
    {
      "by": "mr_joergensen",
      "descendants": 0,
      "id": 31270535,
      "score": 1,
      "text": "Hi everybody,<p>Today it is my pleasure to introduce this tech oriented cohort to Goaddon (<a href=\"https:&#x2F;&#x2F;goaddon.com\" rel=\"nofollow\">https:&#x2F;&#x2F;goaddon.com</a>), a platform that I truly believe can change the landscape of ecommerce and raise the ceiling of possibilities for ecommerce businesses.<p>Let me briefly describe what Goaddon is.<p>Goaddon enables you to build ecommerce apps much faster than previously. Orders of magnitude faster. By ecommerce apps I mean apps that are able to integrate and exchange data with online shops. Goaddon provides you with the infrastructure to host the app and the tools to build it. Goaddon-enabled apps are instantly compatible with many different e-commerce platforms, such as Magento, Prestashop, WooCommerce and Shopify.<p>Goaddon removes the barrier of entry to such a degree that even individual merchants can spin up apps for internal use.<p>For example, if you regularly need to update your prices you could extract your own product data (using Goaddon), apply your custom algorithm and update your shop (using Goaddon) with the re-calculated prices.<p>Or if you are sick of spending all day processing orders you can extract your order data (using Goaddon), apply your own order processing logic end close the orders in your shop (using Goaddon).<p>Goaddon can also be used by systems and services that are already in business. For example chat-software and chatbots, customer service platforms, payment processors and ERP solutions. You only need to embed our interface into your website and start collecting data from clients shops.<p>Those are just a few use cases. If you have one in mind you should visit <a href=\"https:&#x2F;&#x2F;goaddon.com&#x2F;competition\" rel=\"nofollow\">https:&#x2F;&#x2F;goaddon.com&#x2F;competition</a> and enroll yourself into our case competition, where we are offering to spend 1 week of free coding on your idea.<p>Let me know what you think. In fact, I have been coding non-stop for the last 5 years in order to get to this point of asking what you think. So give me your worst and best :-)<p>Btw, also just launched on <a href=\"https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;goaddon\" rel=\"nofollow\">https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;goaddon</a>.<p>Regards, Christoffer Dahl-Jørgensen\nCEO of Goaddon",
      "time": 1651735081,
      "title": "Show HN: A system that helps you build ecommerce apps for online shops",
      "type": "story",
      "url": "https://goaddon.com"
    },
    {
      "by": "WolfOliver",
      "descendants": 0,
      "id": 31270507,
      "score": 2,
      "time": 1651734685,
      "title": "Server-Side Events as Simple Alternative to WebSockets",
      "type": "story",
      "url": "https://linkedrecords.com/server-side-events-as-simple-alternative-to-websockets-807ddcc0bbe7?gi=b02b93bbd02c"
    },
    {
      "by": "javierportet",
      "descendants": 0,
      "id": 31270483,
      "score": 1,
      "text": "Is there a slideshow platform that allows me to build reusable slides in my workplace environment? Suppose I build a reusable slide once, then I would be able to reuse it in any slideshow. If I update it once, it updates everywhere.",
      "time": 1651734468,
      "title": "Ask HN: Slideshow Platform with Reusable Slides",
      "type": "story"
    },
    {
      "by": "metaph6",
      "descendants": 0,
      "id": 31270445,
      "score": 1,
      "time": 1651734198,
      "title": "An International Tech-Support Scam",
      "type": "story",
      "url": "https://www.aarp.org/money/scams-fraud/info-2021/international-tech-support-scam-exposed.html"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31270440,
      "score": 1,
      "time": 1651734166,
      "title": "Tails News 5.0 is out 2022-05-03",
      "type": "story",
      "url": "https://tails.boum.org/news/index.en.html"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 31270414,
      "score": 1,
      "time": 1651733832,
      "title": "Software Crafters Meetup Starts Again in Sydney After 3 Years Covid Hiatus",
      "type": "story",
      "url": "https://www.meetup.com/Software-Crafters-Sydney/events/285711572/"
    }
  ]
}