{
  "stories": [
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29407594,
      "score": 1,
      "time": 1638384800,
      "title": "The bizarre history of medical transplants from Indian kings to stem cells",
      "type": "story",
      "url": "https://www.abc.net.au/news/2021-12-02/the-jaw-dropping-history-of-medical-transplants/100653440"
    },
    {
      "by": "jrheard",
      "descendants": 0,
      "id": 29407592,
      "score": 1,
      "time": 1638384799,
      "title": "Python's None problem, and how Mypy helps you deal with it",
      "type": "story",
      "url": "https://engineeringblog.ridereport.com/pythons-none-problem"
    },
    {
      "by": "devwastaken",
      "descendants": 0,
      "id": 29407589,
      "score": 1,
      "time": 1638384768,
      "title": "The Harsh Reality of Being a Software Engineer [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Ws6zCMdp9Es"
    },
    {
      "by": "jondishotsky",
      "descendants": 0,
      "id": 29407586,
      "score": 1,
      "time": 1638384761,
      "title": "Seed Stories: Waterplan",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=WZ_JeyJBY14"
    },
    {
      "by": "nepalvibes",
      "descendants": 0,
      "id": 29407583,
      "score": 1,
      "text": "I was in Vegas last week and decided to go on a timeshare presentation (obviously for free tickets to a show and free hotel). Here is what I observed and now I&#x27;m trying to understand how this kind of business practice is still operating and if there are any other business that operate in similar manner?<p>1. They lure you into 2 hr sales presentation by offering free tickets and hotels (Which later I realized are not very good)\n2. They make you go through a presentation highlighting how their service is much better than traditional hotels. They talk about inflation and how your money is being wasted using hotels for vacation. (May be using some fancy terms and numbers to influence people)\n3. They pair you with an individual sales rep, who tries to sell you. They highlight benefits, hiding all recurring cost associated with it. Emotionally pressure you into accepting the fact that you are not taking enough vacation and how you are not caring about you and your family&#x27;s need.\n4. They focus on the fact that you &quot;Own&quot; it without explaining how you own anything. \n5. They force you to make decision right then and there. Because the sales agent know that if a customer is interested in buying it there are much better pricing available in secondary market if they do some research.",
      "time": 1638384751,
      "title": "Ask HN: Is Timeshare a Scam?",
      "type": "story"
    },
    {
      "by": "koolba",
      "descendants": 0,
      "id": 29407577,
      "score": 1,
      "time": 1638384692,
      "title": "Nation’s First Supervised Drug-Injection Sites Open in New York",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/30/nyregion/supervised-injection-sites-nyc.html"
    },
    {
      "by": "selenasecor",
      "descendants": 0,
      "id": 29407573,
      "score": 1,
      "text": "I&#x27;m a neophyte founder (FT founder since July 2021) working on an HR product that helps employers detect and address burnout in the workplace (https:&#x2F;&#x2F;www.mychangelab.com&#x2F;).  As you all know, knowing something only partially protects you from those pitfalls.  Startup life has been lonely, full of uncertainty, exhilarating, full of hope, and everything in between (and this all happens in the course of one day)!  I find that I need to be extra vigilant and diligent to be active on a daily basis, take frequent breaks, and eat healthy foods (meaning eating something other than my son&#x27;s Halloween candy stash and takeout).<p>In an effort to combine work and exercise, I&#x27;ve been organizing founder hiking meetups.<p>How are you all managing work and healthy routines to maintain physical and mental health?  I&#x27;d love to hear your personal stories whether you are trying something new, looking for new routines, or have great routines to share!",
      "time": 1638384681,
      "title": "Ask HN: Founders, how are you managing your mental and physical health?",
      "type": "story"
    },
    {
      "by": "Gadiguibou",
      "descendants": 0,
      "id": 29407567,
      "score": 1,
      "time": 1638384664,
      "title": "An obsession with home ownership can ruin the economy (2020)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=kkVEt5tC2xU"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 29407564,
      "score": 1,
      "time": 1638384641,
      "title": "Floating UI",
      "type": "story",
      "url": "https://www.floating-ui.com/"
    },
    {
      "by": "gaogaotiantian",
      "descendants": 0,
      "id": 29407555,
      "score": 1,
      "time": 1638384603,
      "title": "Show HN: Objprint – Print Python Objects in Human Readable Format",
      "type": "story",
      "url": "https://github.com/gaogaotiantian/objprint"
    }
  ]
}