{
  "stories": [
    {
      "by": "tiktaktow",
      "descendants": 0,
      "id": 31378089,
      "score": 1,
      "text": "I have used React extensively for frontend in combination with Node&#x2F;Express and Python backends. I want to explore a fullstack JS framework for my next project but having a hard time deciding on which to bet on. The project is a webapp that also serves API endpoints for a separate mobile app. No need for best SEO and excpetional performance and speed. If all goes according to the plan, the web app may have around 500 and mobile app may have 50,000 users at max.<p>I have looked at Next, Blitz and Remix, and all of them look very promising. Next has a simple routing and options for SSR, SSG and CSR, which is a big advantage for serving different kind of contents for the users. But I&#x27;m not sure if it can match Express&#x27; performance in backend tasks. Blitz has scaffolding, simple routing and simplified data fetching. But its community and documentation is still small. Remix is exciting because of its use of web native features and nested routing. But its still new and I&#x27;m not so confident about its backend performance.<p>I am looking for advice from experienced devs who have used these frameworks for fullstack in production. Is any one of them a good bet as a fullstack solution? Or should I stick with separate React&#x2F;Next for frontend and Express for backend?",
      "time": 1652537553,
      "title": "Ask HN: Next vs. Blitz vs. Remix,which fullstack JavaScript framework to select?",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 31378011,
      "score": 1,
      "time": 1652536935,
      "title": "\"At\" Issue: Long (Morse) Code for a Small Symbol (2004)",
      "type": "story",
      "url": "https://www.nytimes.com/2004/04/15/technology/issue-long-code-for-a-small-symbol.html"
    },
    {
      "by": "droopyEyelids",
      "descendants": 0,
      "id": 31377991,
      "score": 2,
      "time": 1652536846,
      "title": "Whistleblower on baby formula production plant tied to outbreak",
      "type": "story",
      "url": "https://www.foodsafetynews.com/2022/04/former-employee-blows-whistle-on-baby-formula-production-plant-tied-to-outbreak/"
    },
    {
      "by": "maxmunzel",
      "descendants": 1,
      "id": 31377985,
      "kids": [
        31378020
      ],
      "score": 1,
      "time": 1652536810,
      "title": "The overengineered Solution to my Pigeon Problem",
      "type": "story",
      "url": "https://maxnagy.com/posts/pigeons/"
    },
    {
      "by": "als0",
      "descendants": 0,
      "id": 31377980,
      "score": 1,
      "time": 1652536764,
      "title": "A Hare code generator for finding ioctl numbers",
      "type": "story",
      "url": "https://drewdevault.com/2022/05/14/generating-ioctls.html"
    },
    {
      "by": "iamwil",
      "descendants": 0,
      "id": 31377976,
      "score": 1,
      "time": 1652536732,
      "title": "Building a Cayley Diagram at Dynamicland",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=HPvRPOeKUx0"
    },
    {
      "by": "Kaibeezy",
      "descendants": 0,
      "id": 31377940,
      "score": 1,
      "time": 1652536533,
      "title": "Monkeypox",
      "type": "story",
      "url": "https://www.who.int/news-room/fact-sheets/detail/monkeypox"
    },
    {
      "by": "psikomanjak",
      "descendants": 0,
      "id": 31377938,
      "score": 1,
      "text": "Hi everyone, all of my lifetime I have been a Windows and android user, tried Linux and didn&#x27;t like.<p>A few months back I tried a Macbook of a friend and got hooked on it so I am thinking on switching to an all Apple ecosystem mainly because of the Macbooks batery, I work remote and would like to work wherever I am.<p>I work as a front-end dev mainly with sometimes full-stack and buying a fully speced MacBook would be an overkill.<p>What would you suggest me to switch to if my main concern is the battery life, lightweight and smoothnes of work?",
      "time": 1652536518,
      "title": "Ask HN: Apple or other longer battery life laptop",
      "type": "story"
    },
    {
      "by": "nyc111",
      "descendants": 0,
      "id": 31377912,
      "score": 1,
      "time": 1652536296,
      "title": "Stephen J. Crothers on Non-Existence of Black Holes",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=jINHHXaPrWA"
    },
    {
      "by": "penguin_booze",
      "descendants": 0,
      "id": 31377904,
      "score": 1,
      "time": 1652536230,
      "title": "Linux Insides Book",
      "type": "story",
      "url": "https://0xax.gitbooks.io/linux-insides/content/"
    }
  ]
}