{
  "stories": [
    {
      "by": "Prdikt",
      "descendants": 0,
      "id": 29871976,
      "score": 1,
      "text": "We all love to drink coffee, right? Of course, but you want to delay your first caffeine intake to 90 to 120 minutes after you wake up. This is because adenosine, one of the factors that induce a sense of sleepiness in your system, is likely to be very low in the morning. If you do drink caffeine earlier, you will block adenosine from acting on the aficionados receptor. This will help you feel very alerted first, but it will also cause an afternoon crash from caffeine.<p>One of the best ways to ensure a caffeine crash is to drink a bunch of caffeine early. It blocks all those adenosine receptors. Then, by early or late afternoon, when that caffeine starts to wear off and gets dislodged from the receptors, previously stopped adenosine creates a greater level of sleepiness. Then you will need another cup of caffeine which will cause problems with the sleep quality later today.<p>What you want to do is to let your cortisol naturally come up in the morning and avoid drinking caffeine until about 90 minutes or two hours after waking. Delaying caffeine intake optimises the relationship between adenosine and wakefulness and sleepiness in a positive way that provides a friendly, consistent arc of energy throughout the day and brings the energy down as you are headed toward sleep and falling asleep.<p>Sign up for the closed beta launch. https:&#x2F;&#x2F;prdikt.co",
      "time": 1641803900,
      "title": "Biohacker: How to avoid afternoon crash from caffeine",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 29871951,
      "score": 1,
      "time": 1641803624,
      "title": "The Witcher 3-Inspired Scene Made in Unreal Engine",
      "type": "story",
      "url": "https://80.lv/articles/the-witcher-3-inspired-scene-made-in-unreal-engine/"
    },
    {
      "by": "professor_x",
      "descendants": 0,
      "id": 29871934,
      "score": 1,
      "text": "Been sick and watching this show. It&#x27;s fun. Just curious, they talk about valuation, sales the various aspects of ramping up manufacturing, distribution marketing.<p>First question: Is there a name for academic discipline containing the various topics above?<p>Second: Any good books in that space?",
      "time": 1641803446,
      "title": "Ask HN: Best books about the stuff they talk about on Shark Tank?",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 29871930,
      "score": 1,
      "time": 1641803371,
      "title": "Fossilised ‘sea dragon’ found in Rutland reservoir",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-59915689"
    },
    {
      "by": "zmodem",
      "descendants": 0,
      "id": 29871911,
      "score": 2,
      "time": 1641803046,
      "title": "LLVM mailing lists switching to Discourse",
      "type": "story",
      "url": "https://blog.llvm.org/posts/2022-01-07-moving-to-discourse/"
    },
    {
      "by": "cercatrova",
      "descendants": 0,
      "id": 29871867,
      "kids": [
        29871968,
        29871963,
        29871895
      ],
      "score": 23,
      "time": 1641802519,
      "title": "Anime4K: Real time high quality video upscaling",
      "type": "story",
      "url": "https://github.com/bloc97/Anime4K"
    },
    {
      "by": "raffraffraff",
      "descendants": 2,
      "id": 29871825,
      "kids": [
        29871845,
        29871915
      ],
      "score": 6,
      "text": "I&#x27;ve had a phone for a few years, and it hasn&#x27;t been mistreated. Almost every morning I go to unplug my charger cable and it either fell out during the night or is so low that it falls it when I pick up the phone. There is no debris in the port. I&#x27;ve never had this problem with any older USB port (although I have had to clear debris once or twice).<p>It really sucks that this phone is perfect apart from the charger port",
      "time": 1641802026,
      "title": "Ask HN: Are USB-C ports less durable than micro USB?",
      "type": "story"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 29871813,
      "score": 5,
      "time": 1641801862,
      "title": "UK supermarket scraps 'use by' date for fresh milk, replaced with 'best before'",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-59928650"
    },
    {
      "by": "thegototechguy",
      "descendants": 0,
      "id": 29871811,
      "score": 6,
      "text": "Most of the 3rd party antivirus software tend to slow down computer systems. Is windows defender alone enough to keep the windows systems protected or do the antivirus software actually have a bold stand?",
      "time": 1641801859,
      "title": "Antivirus or Windows Defender?",
      "type": "story"
    },
    {
      "by": "paraschopra",
      "descendants": 0,
      "id": 29871784,
      "score": 4,
      "time": 1641801593,
      "title": "Why brain-machine interfaces progress so slowly",
      "type": "story",
      "url": "https://notes.invertedpassion.com/Consciousness/Why+brain-machine+interfaces+progress+so+slowly"
    }
  ]
}