{
  "stories": [
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 30636095,
      "score": 1,
      "time": 1646972070,
      "title": "US officials believe Ukraine can maintain control of Kyiv for several more weeks",
      "type": "story",
      "url": "https://www.nbcnews.com/news/world/live-blog/ukraine-russia-war-live-updates-top-diplomats-meet-talks-kyiv-n1291419"
    },
    {
      "by": "SquibblesRedux",
      "descendants": 0,
      "id": 30636090,
      "score": 1,
      "time": 1646972012,
      "title": "What to Do with a Multimillion-Dollar Megamansion? They Have Some Ideas. (2021)",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/11/style/what-to-do-with-a-multimillion-dollar-megamansion-they-have-some-ideas.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30636085,
      "score": 1,
      "time": 1646971949,
      "title": "2022 National and Regional Awards Winners",
      "type": "story",
      "url": "https://www.worldphoto.org/sony-world-photography-awards/winners-galleries/2022/national-awards/winners/2022-national-regional"
    },
    {
      "by": "SquibblesRedux",
      "descendants": 0,
      "id": 30636072,
      "score": 1,
      "time": 1646971853,
      "title": "The $200M House: What It Costs",
      "type": "story",
      "url": "https://www.investopedia.com/financial-edge/0411/the-100-million-house-what-it-really-costs.aspx"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30636071,
      "score": 1,
      "time": 1646971849,
      "title": "Grimes Reveals Y, Her New Baby Daughter with Elon Musk, in Cover Interview",
      "type": "story",
      "url": "https://www.vanityfair.com/style/2022/03/grimes-cover-story-on-music-and-mars"
    },
    {
      "by": "Mason_Fuerst",
      "descendants": 0,
      "id": 30636035,
      "score": 1,
      "text": "Hey HN! I’m Mason, the co-founder of Motiv.<p>Motiv is a career platform that matches candidates with jobs and lets them apply in a click.<p>Think of it like a ‘dating app’ for jobs. You can match with desirable roles and apply with one step. It’s much better than submitting a resume, because you avoid the frustration of long applications, hiring software, and being ghosted. Motiv makes the hiring process convenient and transparent. Displaying jobs that match your qualities, providing updates on your applications status, while creating an experience that helps you get hired for a role you love.<p>If you’d like to use Motiv when we launch, we’d love to have you join our waitlist: www.joinmotiv.com<p>For the remainder of this post, I&#x27;ll explain why the hiring process sucks and how it&#x27;s broken.<p>There’s an old quote that reads; “if it ain’t broke, don’t fix it”. The difference is, hiring has been broken for quite some time. It’s just that no one has fixed it. At least ‘yet’ for that manner.<p>The problem is a discrepancy between employers and candidates. Most employers think their hiring practices are great, yet are struggling to attract &#x2F; hire desirable candidates. On the flip side, candidates believe they have great talent. But are not being considered &#x2F; hired for positions they’re qualified for. While it’s frustrating, common hiring methods are a leading cause.<p>So what are they?<p>Hiring Software: Almost every organization uses some form of applicant tracking software (ATS), artificial intelligence, or machine learning to hire talent. While they differ in capabilities, each scans &#x2F; filters through candidates to select which move forward and which don&#x27;t.<p>The software takes 6 seconds to scan keywords in your resume. Based on the job\ndescription, employers will select specific words they want their ATS to find. Examples could be; &#x27;lifecycle&#x27;, &#x27;KPI&#x27;s&#x27;, or &#x27;quality assurance&#x27;. If your resume contains almost every keyword they&#x27;re looking for, great! You might move forward. If not, sorry about your luck.<p>Your resume almost needs to replicate the job description. Even if you don&#x27;t have every qualification, ATS systems could care less. They&#x27;re not evaluating your potential, they&#x27;re evaluating data. And if your resume doesn&#x27;t contain the data they&#x27;re looking for, they&#x27;ll move on.<p>Resume Formatting: So what if you have the necessary data? Are you a sure bet? Not exactly. If you&#x27;ve ever designed your resume, general knowledge is that it should &#x27;stand out&#x27;. That it needs to be eye catching, attention grabbing, and a show stopper. Something that will separate you from other candidates vying for the job. Truth is, a well designed resume won&#x27;t solve that issue.<p>Any resume not designed with a Microsoft Word format is going to get rejected as fast as it&#x27;s scanned. ATS systems don&#x27;t prioritize formatting. You could have the right keywords, great experience, and awesome skills - but if your resume looks like a work of art; the software won&#x27;t consider you. Sorry to burst your hopes if you love fancy resumes.<p>Traditional Job Boards: Traditional job boards are an easy way to find positions.\nOutside of that, that&#x27;s pretty much all they&#x27;re good for. While some believe they avoid ATS systems, formatting, and long applications - they generally do two things really well;<p>1. Make it frustrating to apply\n2. Make it harder to stand out<p>Think about it. If you&#x27;ve ever used a traditional job board they make you sign up, fill your information, and just as you&#x27;re ready to apply - they direct you to a company&#x27;s website. Looks familiar right? Now comes the part where you submit a resume, get scanned, and hope you make it through the software.<p>This is what we&#x27;re aiming to solve at Motiv.<p>Feel free to reach out to me anytime at; mason@joinmotiv.com and let us know your comments below. Would love to hear feedback on how we can make your hiring experience truly amazing!",
      "time": 1646971576,
      "title": "Motiv – Stop using resumes Hiring is broken",
      "type": "story"
    },
    {
      "by": "ofou",
      "descendants": 0,
      "id": 30636025,
      "score": 1,
      "time": 1646971460,
      "title": "AI Conversation in 2011 vs. 2021",
      "type": "story",
      "url": "https://old.reddit.com/r/singularity/comments/tb3c1e/ai_conversation_in_2011_vs_2021/"
    },
    {
      "by": "gmacpherson",
      "descendants": 0,
      "id": 30636014,
      "score": 1,
      "time": 1646971328,
      "title": "How to Ruin Any Hacker's Fun",
      "type": "story",
      "url": "https://appsecstudio.com/blog/how-to-ruin-any-hackers-fun-1"
    },
    {
      "by": "Foe",
      "descendants": 1,
      "id": 30636011,
      "kids": [
        30636033
      ],
      "score": 3,
      "time": 1646971300,
      "title": "Russia threatens to abandon American astronaut in space",
      "type": "story",
      "url": "https://abc7ny.com/russia-international-space-station-mark-vande-hei-iss-american-astronaut/11639556/"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 30635994,
      "score": 1,
      "time": 1646971159,
      "title": "Electron Apps don't drain power as much as Messages and Safari",
      "type": "story",
      "url": "https://annoying.technology/posts/3c02fd6b764cc50e/"
    }
  ]
}