{
  "stories": [
    {
      "by": "noch",
      "descendants": 0,
      "id": 30332510,
      "score": 1,
      "time": 1644849570,
      "title": "Everything You Need to Know About NFTs",
      "type": "story",
      "url": "https://www.nansen.ai//research/everything-you-need-to-know-about-nfts"
    },
    {
      "by": "boringg",
      "descendants": 0,
      "id": 30332506,
      "score": 1,
      "time": 1644849548,
      "title": "Leak site says it has list of Canada truck convoy donors after reported hack",
      "type": "story",
      "url": "https://www.theglobeandmail.com/world/article-leak-site-says-it-has-list-of-canada-truck-convoy-donors-after/"
    },
    {
      "by": "AlishaOwen",
      "descendants": 0,
      "id": 30332490,
      "score": 1,
      "time": 1644849458,
      "title": "'Catastrophic' surgical backlog in Ontario will take years to clear, doctors say",
      "type": "story",
      "url": "https://www.thestar.com/news/gta/2022/02/14/catastrophic-surgical-backlog-in-ontario-will-take-years-to-clear-doctors-say.html"
    },
    {
      "by": "retep_kram",
      "descendants": 0,
      "id": 30332487,
      "score": 1,
      "text": "Currently we use Zoom + Logitech cam 960-001034 (as cam + microphone on site). About 6 people on site + 4 remote.<p>The experience is far from good. Remote people complain about being able to understand what people on site say. Ideally, everyone would use their own headset, but then we would have an audio feedback problem. What would be an appropriate set-up for this kind of mixed meeting?<p>Thank you!",
      "time": 1644849439,
      "title": "Ask HN: Best sep-up for mixed meetings (remote and on site)?",
      "type": "story"
    },
    {
      "by": "warrenm",
      "descendants": 0,
      "id": 30332471,
      "score": 1,
      "time": 1644849353,
      "title": "How to Teach Yourself Almost Anything",
      "type": "story",
      "url": "https://www.electronicdesign.com/technologies/dsps/article/21771563/continuing-education-how-to-teach-yourself-almost-anything"
    },
    {
      "by": "rekoros",
      "descendants": 0,
      "id": 30332448,
      "score": 1,
      "text": "Hi HN, my name is Andrei - I’m the founder of Fogbender (<a href=\"https:&#x2F;&#x2F;fogbender.com\" rel=\"nofollow\">https:&#x2F;&#x2F;fogbender.com</a>) and I’m very happy to be here. We make customer support software for B2B vendors that makes it easy for you to work with customer teams, rather than just supporting each user independently. B2B companies with team dashboards can embed our messaging widget to offer off-the-shelf shared support channels to their users.<p>The problem that we solve is a painful one for both B2B customers and vendors, so I’ll describe it from each point of view.<p>A B2B customer buys a product and has an ever-changing group of people using it over time. Those users receive customer support as individuals, not as a team. This gets painful when the vendor can’t answer a question because part of the answer is only known by somebody else at the customer. This delays the solution, creates confusion, and hinders the spread of information.<p>A B2B vendor sells to teams and wants to support them effectively. But existing customer support products don’t do that—they only work with users one-by-one. To get around this, many vendors open a shared Slack channel with each customer team. Now they have two problems, because not only is Slack too unstructured for processing complex support requests, inevitably not everyone on the customer’s end knows about the Slack channel. The vendor ends up running two separate support systems, neither of which fully works, and now has the painful task of trying to synchronize the two.<p>To sum that up: support products don’t work with teams, and team products don’t work for support.<p>My first startup was a team messaging service (launched on HN as LeChat in early 2013 [1]), where we created a shared support channel for every customer—this is how we found out about the power of doing support this way. When competing against Slack got too difficult in 2015, we pivoted to sameroom.io, which bridges rooms&#x2F;channels between different messaging systems. We got acquired by 8x8 in 2017, then built their messaging infrastructure.<p>While at 8x8, my team began using Segment Analytics, and usage soon spread to other departments. I struggled to keep the deployment sane because I had no way of knowing which of our developers needed help. Segment supported us with Zendesk, which was aggressively unhelpful. I knew the problem was important when I started getting emails from Segment Analytics with PDF attachments outlining how much money we owed them in overage fees—that was literally my only exposure to the work other developers were doing with our Segment setup. A lot of money and people&#x27;s time was getting flushed down the drain, all thanks to improper tooling.<p>I decided to start a startup to address this because (a) I thought we had the technical expertise to do it; (b) it feels like the market is enormous; (c) it&#x27;s clear who the buyer is, and the price point can be relatively high, and (d) I really want to use it myself.<p>Our product is similar to Intercom or Drift in that our customer (the B2B vendor) installs a messaging widget on <i>their</i> customer dashboard. However, if the dashboard is accessible to a team of end users, all users see the same data in the widget. They can use it to talk to each other and with the vendor, just like with shared channels. We also make it easy to link these conversations to support tickets in vendor’s issue tracker.<p>Fogbender uses a pubsub-inspired messaging protocol (currently the only transport is websocket, but we may add others), powered by Elixir and Postgres. The frontend is TypeScript, React, SolidJS, and Tailwind. We&#x27;re fans of monorepos and prefer to add supervisors to our BEAM supervision tree instead of spinning up microservices.<p>Our philosophy regarding the messaging product itself is closer to Telegram than Slack. We like to have the ability to view multiple rooms at the same time, to be able to forward contiguous blocks of messages between rooms, to have replies instead of anonymous threads, and to be able to follow #tags.<p>We’re still working out pricing, so you’ll notice “TBD” on our pricing page, but our basic strategy is clear: a free tier, after which vendors pay only per user with write access to customer-facing rooms. Everyone at the vendor gets free read access to all messages, and everyone at the customer gets free read and write access. This way we charge only when real value (actual support) is being delivered, and we facilitate the spread of information between vendor and customer and within the customer team itself.<p>You can try us out now at <a href=\"https:&#x2F;&#x2F;fogbender.com\" rel=\"nofollow\">https:&#x2F;&#x2F;fogbender.com</a>. After creating an account, you’ll be asked for a code, but just enter “HN” and it should work! To see what it’s like to receive help as a team, invite a friend&#x2F;colleague and ping us in support :)<p>I’d love to hear your thoughts on the subject of offering and receiving team-level customer support (or team messaging products in general). If you have any questions about Fogbender, I’ll do my best to answer in the comments!<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=5202381\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=5202381</a>",
      "time": 1644849196,
      "title": "Launch HN: Fogbender (YC W22) – B2B support software designed for customer teams",
      "type": "story",
      "url": "https://fogbender.com"
    },
    {
      "by": "zarakshR",
      "descendants": 0,
      "id": 30332436,
      "score": 1,
      "time": 1644849138,
      "title": "The Nexus Ecosystem: Better (Research) Data Management",
      "type": "story",
      "url": "https://bluebrainnexus.io/"
    },
    {
      "by": "simonpure",
      "descendants": 0,
      "id": 30332426,
      "score": 1,
      "time": 1644849087,
      "title": "Crash-Only Software (2003)",
      "type": "story",
      "url": "https://www.usenix.org/legacy/events/hotos03/tech/full_papers/candea/candea_html/index.html"
    },
    {
      "by": "oumua_don17",
      "descendants": 0,
      "id": 30332401,
      "score": 2,
      "time": 1644848919,
      "title": "SoftBank’s plans for Arm IPO hit by legal battle over renegade China unit",
      "type": "story",
      "url": "https://www.ft.com/content/8494d5f3-4f3e-4a1d-878d-cabb82e37778"
    },
    {
      "by": "daxaxelrod",
      "descendants": 0,
      "id": 30332372,
      "score": 1,
      "text": "Hi everyone! I built https:&#x2F;&#x2F;theprospect.club because I&#x27;ve seen one too many people manage their job hunt using google sheets&#x2F;notion. You can use it to keep track of where you are with multiple companies, when and where interview rounds are taking place and role specific details.<p>Let me know what you think!",
      "time": 1644848799,
      "title": "Show HN: TheProspects.club - A tool to manage your job search",
      "type": "story"
    }
  ]
}