{
  "stories": [
    {
      "by": "kosasbest",
      "descendants": 0,
      "id": 32133729,
      "score": 1,
      "time": 1658109828,
      "title": "The Hitchhiker’s Guide to Online Anonymity",
      "type": "story",
      "url": "https://archive.org/details/the-hitchhikers-guide-to-online-anonymity_202201"
    },
    {
      "by": "internxt",
      "descendants": 1,
      "id": 32133709,
      "kids": [
        32133713
      ],
      "score": 2,
      "text": "There is no bulletproof way to be anonymous online. Though we’re here to help protect you from the malicious websites, data collection and exploitation that exist in our online world, the fact that you’re using the internet means that you can’t be safe from everything.<p>How can you become anonymous in the Internet?<p>1. Use an encrypted messaging app<p>Instead of sending a text message to a friend on your Android, use an encrypted messaging app like Signal.<p>2. Use an encrypted browser<p>Instead of using Chrome or another browser from a large tech, use safe google alternatives and protect your data.<p>3. Use a VPN<p>VPNs hide your browsing history so your internet service provider (ISP) can’t see any of your online activity.<p>4. Use secure email services<p>Since we’re so used at Google ecosystem, that we use Gmail as our personal email provider. Google keeps all of our private emails on its servers. Better watch out for better alternatives.<p>5. Use a temporary email<p>Use a temporary email address or use a safe email services like Fastmail, Zoho mail, and Tutanota.<p>6. Use encrypted storage<p>We store all of our documents, photos, and files in Google Drive, which certainly isn’t a good choice in terms of privacy. There are definitely plenty of trustworthy cloud storage services like Internxt, Box, and SyncThing.<p>7. Check app permissions<p>We’re all guilty of mindlessly accepting an app’s terms and conditions, but before you do, see what permissions the app has.<p>8. Read privacy policies<p>Check what data a website or app collects, shares, and&#x2F;or sells before you use it. Many companies sell users’ personal information to third parties for marketing and advertising purposes, which is not conducive to privacy, let alone anonymity.<p>9. Use ad blockers<p>Adware is the software that places ads across your computer, phone, or tablet, but even if you don’t have adware, most websites and apps have some form of advertising, which can get annoying.<p>10. Don’t use voice assistants<p>Amazon employees have admitted to listening to Alexa recordings, and there was a hidden, undisclosed microphone in the Google Assistant-compatible Nest Secure security system4. Your best action is to manage devices and its feature manually.<p>11. Stay off social media<p>Although this is essential to socialize and connect with our friends. Social media is a platform that can collect your information and may use it against you.<p>12. Use a proxy<p>Unlike VPNs, proxy servers encrypt only your device’s IP address, not your web traffic, making them less secure.<p>13. Check for HTTPS<p>Only go on websites whose URLs start with “HTTPS” rather than “HTTP.” HTTPS, which stands for “hypertext transfer protocol secure,” uses a secure sockets layer (SSL) to encrypt all of the communication between your browser and the websites you visit, while HTTP does not.<p>14. Disable cookies<p>Cookies are the data about your online activities that shape targeted ads; sometimes they’re anonymized and aggregated, but sometimes they’re not. It is important to disable it to avoid these data farmers.<p>15. Don’t use Google<p>Google tracks everything you search online, which can be very personal information. Use search engine like DuckDuckGo, Startpage, and Neeva which doesn’t harvest your personal information to create targeted ads.<p>16. Use a password manager<p>Create a unique and secure password for all of your online accounts. You may also use Roboform to safely encrypt your password.<p>17. Avoid spam<p>Avoid clicking on any unfamiliar messages, emails, or websites.<p>18. Use private instances<p>Private instances can be used by a select group of people that you are close with.<p>The internet was created to be a place where people could search for information freely, without fear of repercussions. However, with the monetization of our attention comes a total lack of privacy, as we’re surveilled online constantly.",
      "time": 1658109696,
      "title": "Ask HN: Is Anonymity Possible in 2022?",
      "type": "story"
    },
    {
      "by": "kosasbest",
      "descendants": 0,
      "id": 32133698,
      "score": 1,
      "time": 1658109577,
      "title": "OpenSea layoffs: NFT platform to cut workforce by 20% over 'crypto winter'",
      "type": "story",
      "url": "https://www.marketwatch.com/story/opensea-layoffs-nft-marketplace-to-cut-workforce-by-20-ceo-says-11657829081"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 32133688,
      "score": 1,
      "time": 1658109485,
      "title": "What Can Happen When Someone Wants Your Twitter or Instagram Handle?",
      "type": "story",
      "url": "https://darknetdiaries.com/transcript/106/"
    },
    {
      "by": "8bitsrule",
      "descendants": 0,
      "id": 32133677,
      "score": 1,
      "time": 1658109423,
      "title": "Noam Chomsky and Andrea Moro on the Limits of Our Comprehension",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/noam-chomsky-and-andrea-moro-on-the-limits-of-our-comprehension/"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 32133650,
      "score": 1,
      "time": 1658109268,
      "title": "websocat: Command-line client for WebSocket like netcat or curl",
      "type": "story",
      "url": "https://github.com/vi/websocat"
    },
    {
      "by": "anishdhar",
      "descendants": 0,
      "id": 32133602,
      "score": 1,
      "time": 1658108757,
      "title": "We cut our Postgres RPS by 50%",
      "type": "story",
      "url": "https://www.cortex.io/post/how-we-cut-our-postgres-rps-by-50"
    },
    {
      "by": "avowud",
      "descendants": 0,
      "id": 32133592,
      "score": 1,
      "time": 1658108696,
      "title": "On Building a Cloud, and Choosing Lisp: Because Nobody Told Me I Couldn't (2017)",
      "type": "story",
      "url": "https://www.linkedin.com/pulse/building-cloud-choosing-lisp-because-nobody-told-me-i-mason-browne"
    },
    {
      "by": "kjaleshire",
      "descendants": 1,
      "id": 32133590,
      "kids": [
        32133630
      ],
      "score": 1,
      "time": 1658108680,
      "title": "Wikipedia Is Down",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Main_Page"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32133589,
      "score": 2,
      "time": 1658108646,
      "title": "Comfy Software",
      "type": "story",
      "url": "https://catgirl.ai/log/comfy-software/"
    }
  ]
}