{
  "stories": [
    null,
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30793336,
      "score": 1,
      "time": 1648144712,
      "title": "How to build a cycling environment (2020)",
      "type": "story",
      "url": "https://blog.koehntopp.info"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 30793318,
      "kids": [
        30793322
      ],
      "score": 1,
      "time": 1648144641,
      "title": "Israel, Fearing Russian Reaction, Blocked Spyware for Ukraine and Estonia",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/23/us/politics/pegasus-israel-ukraine-russia.html"
    },
    {
      "by": "waterchiller",
      "descendants": 0,
      "id": 30793308,
      "score": 1,
      "time": 1648144574,
      "title": "PR Tips for Startups: Where to Start with PR",
      "type": "story",
      "url": "https://old.reddit.com/r/startups/comments/sho7ub/pr_tips_for_startups_where_to_start_with_pr/"
    },
    {
      "by": "serverlessmom",
      "descendants": 0,
      "id": 30793304,
      "score": 1,
      "time": 1648144564,
      "title": "AWS Proton Support for Terraform",
      "type": "story",
      "url": "https://aws.amazon.com/about-aws/whats-new/2022/03/aws-proton-terraform-open-source/"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 30793265,
      "score": 2,
      "time": 1648144399,
      "title": "Acoustic Fiber Can Turn Fabrics into Mics and Speakers",
      "type": "story",
      "url": "https://spectrum.ieee.org/e-textiles-acoustic-fiber"
    },
    {
      "by": "xaxaxb",
      "descendants": 1,
      "id": 30793212,
      "kids": [
        30793305
      ],
      "score": 1,
      "time": 1648144166,
      "title": "Ask HN: What is Linus Torvalds's view on crypto, if any?",
      "type": "story"
    },
    {
      "by": "servytor",
      "descendants": 2,
      "id": 30793197,
      "kids": [
        30793343,
        30793270
      ],
      "score": 3,
      "text": "TLDR: I am stateless in the sense that indirect and direct feedback of any kind is not incorporated into my behavior tomorrow. I feel like I am constantly being reset. I do not learn from what happened yesterday. I can learn a little bit over time, and change my opinion, but tomorrow I will most likely forget. I seem to be entirely dependent on my &#x27;active memory&#x27; and situational cues as to what is going on. I define &#x27;active memory&#x27; as being what has happened since I have woken up. It seems that &#x27;recent memory&#x27; is defined officially as having a 30-second cutoff, and that is is not an issue with me, so be aware I am using a new term.<p>---<p>For a long time I have thought I suffered solely from the Dunning-Kruger effect. I would think I know how to do something, and then find out it took a lot more effort than usual, and thus I proved to myself that I was not that competent. Thus, I diagnosed myself as feeling superficially competent in areas where I have no expertise. Dunning-Kruger, right? I assumed a lot of people suffer from it, and I must be another moron. But despite this awareness of this self-diagnosis, and thinking about how I might be acting on it, I still feel competent in new areas when I should not. I wake the next day, and behold, I still see myself as competent.<p>But what I am suffering from is not limited to my beliefs about myself, which is unlike Dunning-Kruger. I have trouble changing any belief. For example, let&#x27;s say that I ask a group of people about who knows git well - and someone starts to talk who I had previously never thought of as being competent in that area. The next day I will see that person the same way as I did before they helped me with the git issue. It is easy for me to think &quot;Wow, she really knows git well!&quot; and to change my opinion in that moment, but it is almost impossible for me to remember that the next day. On the next day I can partially remember that person being an expert in git, but somehow my opinion is separate and unchanging and I will still see them as not knowing git well. So lo and behold, in the same way, on waking the next way I see that person the same way as before.<p>I believe I have trouble learning from direct or indirect feedback (I am ignoring &#x27;feedback&#x27; as business jargon for when a person talks to you about your performance, and that most google searches result for me). I keep &#x27;touching the hot stove&#x27; and making the same judgement, having the same behavior, etc. The number one sign of stupidity is making the same mistake again and again, and I definitely fall into that category.<p>I also feel like I have to recreate my knowledge-base in my active memory each day. It is normal for me to be very confused, and to make inferences based on what I can deduce based on first-principles and almost no knowledge. I will take every situational cue I can to my advantage, as I cannot trust my memory. When it comes to learning something, I am heavily dependent on notes I have taken to teach myself how something works the next day. I am awful in the sense that I constantly try to appear smart to others, as I want to blend in as another competent individual.<p>Some questions:<p>Do you know what the technical term is of what I am going through, so I could learn more about it?<p>What does it mean when my mind seems to reset its opinions to the previous 24 hours?<p>What does it mean when your beliefs do not change, and despite being aware of it, you do not know how to stop it?<p>Do you have trouble remembering feedback? What is your hypothesis as to why?<p>How do you incorporate feedback into changing your opinion about yourself or someone or something into your long-term memory?<p>Are others stuck acting off of active memory only? Do people on HN suffer from memory deficits?<p>What happens when you get feedback from a mistake or learn something? What efforts do you take, either in your head or with tools to stay aware of it tomorrow?",
      "time": 1648144107,
      "title": "Ask HN: I am stateless – trouble learning from feedback",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30793188,
      "score": 1,
      "time": 1648144078,
      "title": "Yellowstone Park study shines new light on once hidden details",
      "type": "story",
      "url": "https://vtx.vt.edu/articles/2022/03/science-yellowstone_hydrothermal_study_holbrook.html"
    },
    {
      "by": "ak391",
      "descendants": 0,
      "id": 30793175,
      "score": 2,
      "time": 1648144017,
      "title": "CVPR2022 Pastiche Master: Exemplar-Based High-Resolution Portrait Style Transfer",
      "type": "story",
      "url": "https://huggingface.co/spaces/hysts/DualStyleGAN"
    }
  ]
}