{
  "stories": [
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29140893,
      "score": 1,
      "time": 1636302973,
      "title": "Sama: AI-assisted creative tools are going to be surprisingly great",
      "type": "story",
      "url": "https://twitter.com/sama/status/1457384796376629258"
    },
    {
      "by": "takhchi",
      "descendants": 0,
      "id": 29140856,
      "score": 1,
      "time": 1636302787,
      "title": "Diving Inside AirPods 3",
      "type": "story",
      "url": "https://free-ecom.com/airpods-3/"
    },
    {
      "by": "zifeo",
      "descendants": 0,
      "id": 29140813,
      "score": 2,
      "time": 1636302504,
      "title": "Show HN: Dataconf, Python dataclasses config (hocon/JSON/YAML/env-vars/dict)",
      "type": "story",
      "url": "https://github.com/zifeo/dataconf"
    },
    {
      "by": "susam",
      "descendants": 1,
      "id": 29140793,
      "kids": [
        29140807
      ],
      "score": 2,
      "time": 1636302387,
      "title": "Of Course “changeme” Is Valid Base64 (2020)",
      "type": "story",
      "url": "https://susam.in/maze/of-course-changeme-is-valid-base64.html"
    },
    {
      "by": "praveent",
      "descendants": 0,
      "id": 29140781,
      "score": 2,
      "time": 1636302297,
      "title": "Surprising Power of Questions",
      "type": "story",
      "url": "https://hbr.org/2018/05/the-surprising-power-of-questions"
    },
    {
      "by": "dmelechow",
      "descendants": 0,
      "id": 29140711,
      "score": 2,
      "time": 1636301945,
      "title": "Ytalki – find books according your language level",
      "type": "story",
      "url": "https://ytalki.com/"
    },
    {
      "by": "cybernautique",
      "descendants": 2,
      "id": 29140706,
      "kids": [
        29140881,
        29140817
      ],
      "score": 2,
      "text": "I&#x27;ve been getting imto LISP recently. I like Racket, but there doesn&#x27;t seem to be many (any?) TUI libraries. I much prefer TUIs to GUIs, so I can write applications that target both my phone (via termux) and all my other various devices.",
      "time": 1636301896,
      "title": "Ask HN: Which Lisp has the best TUI libraries?",
      "type": "story"
    },
    {
      "by": "puttycat",
      "descendants": 0,
      "id": 29140695,
      "score": 2,
      "time": 1636301826,
      "title": "My Dev Management Principles",
      "type": "story",
      "url": "https://uriv.medium.com/my-dev-management-principles-7325ae94e7d8"
    },
    {
      "by": "Ajay-p",
      "descendants": 3,
      "id": 29140675,
      "kids": [
        29140705,
        29140679
      ],
      "score": 2,
      "time": 1636301746,
      "title": "Musk polls Twitter followers if he should sell 10% of his Tesla stock",
      "type": "story",
      "url": "https://www.theverge.com/2021/11/7/22768364/elon-musk-poll-twitter-tesla-10-percent-billionaires-capital-gains-tax"
    },
    {
      "by": "vladsouth",
      "descendants": 0,
      "id": 29140667,
      "score": 3,
      "text": "Hello to everyone on HN who might be interested!<p>First thing I would ask you to excuse my English.<p>My name is Vlad. I live in Russia and just registered my first company. \nFour years of my whole career i’ve been working as a sales manager in 3 different tech-related companies. Last year I’ve worked for a huge distributor of IT equipment, software, office supplies, MRO and industrial tools. In Russia the market built the way that distributors sell to dealers, dealers sell to the end customer (business or individuals). As I know, that kind of supply chain is the same for most of the other countries.<p>At every stage of purchasing, the process includes tons of emails, calls and corrections. As for businesses contacting their dealers, so and for dealers contacting distributors. The main problem for the end business customer is not having clear access to the quantity, availability, and prices of goods from the distributor’s storage.\nSo, in the time of successful private spaceflights, it seems like we can try to handle that kind of task.<p>I got to know that our distributor has an API provided for dealers with the whole base of products, prices, leftovers. Coworkers who work in the department of integrations told me that it’s mostly used by dealers that set up an online store and sell electronics to individuals. Distributor also uses its API for integration and getting orders from B2C marketplaces. Russia has some pretty strong players for B2C side (Ozon.ru, Wildberries.ru, Market.yandex.ru ). GMV’s of those marketplaces are billions of dollars for each. And all of them are strongly focused on sales to individuals. But we don’t really have some well-known online players focusing to improve a buying experience of business customers.<p>To make a long story short, I talked with my friend Alex who is a software developer if he would join me in a journey of disrupting traditional processes of B2B trade in Russia. Alex did not find my offer attractive, but he offered his free time to work on my project while he’s not busy with his main job. \nI agreed with my colleague an access to a test API integration and left a company to come back as a partner(dealer) in the future. It was the end of spring 2021. Things went pretty slow all summer. Alex worked on integration, I’ve done researches, cust dev, and almost finished a landing page of our service.<p>Basically, our MVP will be a catalog of one huge distributor (similar to Ingram Micro in the USA) presented in a format of an online store with access for only registered businesses. We will have clear prices (with a piece of our margin), quantities of leftovers, and a discount system for bulk orders. The goal is to combine the simplicity of online store and needs of purchasing processes.<p>Right now, I rented a little office in Moscow, incorporated a company, found an accountant, and about to sign a partnership with a distributor next week to get full access to API, so Alex can finish the integration between their storage and our platform to launch our MVP.<p>This is my first experience in launching a company from scratch.\nProbably, it’s not a very rational decision to do it without a team, budget, and access to the world of venture capital. But it should be fun!<p>Would you want to read continuation?<p>Feel free to comment, share your relative experience, thoughts and ask questions.<p>Vlad",
      "time": 1636301706,
      "title": "My story of launching an MVP for B2B marketplace in Russia",
      "type": "story"
    }
  ]
}