{
  "stories": [
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 31039176,
      "score": 1,
      "time": 1650023981,
      "title": "Continuous Looper",
      "type": "story",
      "url": "https://beijaflor.io/blog/04-2022/rust-audio-experiments-5/"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 31039157,
      "score": 1,
      "time": 1650023789,
      "title": "Drone-Fleet-Enabled Logistics:Joint Design of Flight Trajectory AndPackage Deliv",
      "type": "story",
      "url": "https://www.mdpi.com/1424-8220/22/8/3056"
    },
    {
      "by": "mittermayr",
      "descendants": 0,
      "id": 31039123,
      "score": 2,
      "text": "As a self-employed senior software developer, I mostly live off selected freelance work, aside from varying income through SaaS products and apps.<p>I get 100% of inbound work through recommendations in my personal network. Because of that, I have never had a rate negotiation, had to pitch my skills or expertise, or bid against others.<p>But, there&#x27;s a huge problem in managing work load:<p>Sometimes, I go WEEKS without a single hour billed. Other times, I need to decline two projects at once because I am still knuckle-deep in another one.<p>Which reminded me of &quot;agents&quot;:<p>I would actually be happy to pay someone a fee for managing this. I published a book a few years ago, and my book agent essentially took care of the pitching, the leads, getting it sold. I &#x27;just&#x27; did the writing.<p>The TV agent model seems to be even more applicable. You have &quot;preference on work, clients, scale and scope&quot;, and they try to fill up your unbooked time with projects that match. For each booked gig, they charge a fee.<p>Does that exist? Would that be possible? The main argument against it seems to be developer hesitance against out-of-network clients (and risk), and the agent over-promising on both ends to make the deal happen.<p>Sites like UpWork don&#x27;t really solve this (for me), because I don&#x27;t want to compete just on price and star ratings. Every client is happy with the work, attitude, communication and my price, but if I had to compete with a 100,000 developers out there who charge 1&#x2F;10th of my price, it&#x27;ll be tough (clearly a first world problem, I know, I know).<p>Just curious how you do this. I am trying to cap freelance work at 50% of my week, with most projects being &lt; 6 months.<p>I partially worry what would happen if my network stops delivering work, and I already worry about managing the inconsistent volume coming in.<p>Like, a load balancer for project work. Thoughts?",
      "time": 1650023534,
      "title": "Ask HN: The case for middle men in freelancing, do agents exist?",
      "type": "story"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 31039112,
      "kids": [
        31039122
      ],
      "score": 1,
      "time": 1650023432,
      "title": "Garry Kasparov at TED: “Stand with Ukraine in the Fight Against Evil” [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=wDmEPFO_hd0"
    },
    {
      "by": "mektrik",
      "descendants": 0,
      "id": 31039095,
      "score": 1,
      "time": 1650023296,
      "title": "Using GPT-3 to generate 1.8k article pages by scraping a competitor's sitemap",
      "type": "story",
      "url": "https://twitter.com/MackGrenfell/status/1514557363902205952"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 31039067,
      "score": 1,
      "time": 1650023128,
      "title": "List of national emergencies in the United States",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/List_of_national_emergencies_in_the_United_States"
    },
    {
      "by": "data_dan_",
      "descendants": 0,
      "id": 31039061,
      "score": 2,
      "time": 1650023087,
      "title": "Bayesian Data Analysis with Jags: A Dirichlet-Multinomial Model of Wordle Scores",
      "type": "story",
      "url": "https://innerjoin.bit.io/ask-a-bayesian-who-is-better-at-wordle-76a0e5199ed"
    },
    {
      "by": "nkmnz",
      "descendants": 0,
      "id": 31039002,
      "score": 2,
      "text": "Hi everyone, our early stage startup just raised a first round, currently for 12-18 months of runway. Like the US, inflation is hitting Europe with ~7.5% p.a., salary expectations in job interviews with newly grads are already up 15-20% compared to last year.<p>After a long time of bootstrapping, &quot;just spend faster&quot; is not a viable option to prevent inflation from shrinking that pile of cash we&#x27;re sitting on – we&#x27;re both culturally and operationally not yet ready to open the floodgates: hiring the right people and building the team takes time, and we also haven&#x27;t figured out which sales channels are the right ones to scale. Our business is highly cyclical, so we need certain periods of the year to figure stuff out while improving product and ramping up capacity in the mean time.<p>How do you fellow founders manage this situation? Do your companies hold assets to hedge inflation risks? Do you think about putting clauses into contracts with investors to adjust future payments to inflation? Are there any good reads on cash management for startups in general?",
      "time": 1650022602,
      "title": "Ask HN: Our startup raised – would you care about inflation?",
      "type": "story"
    },
    {
      "by": "eagledotRL",
      "descendants": 0,
      "id": 31038996,
      "score": 2,
      "time": 1650022523,
      "title": "Generate Python extensions using Nim language",
      "type": "story",
      "url": "https://ramanlabs.in/static/blog/Generate_Python_extensions_using_Nim_language.html"
    },
    {
      "by": "mdp2021",
      "descendants": 1,
      "id": 31038990,
      "kids": [
        31039038
      ],
      "score": 1,
      "time": 1650022443,
      "title": "FDA Authorizes First Covid-19 Diagnostic Test Using Breath Samples",
      "type": "story",
      "url": "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-first-covid-19-diagnostic-test-using-breath-samples"
    }
  ]
}