{
  "stories": [
    {
      "by": "panabee",
      "descendants": 0,
      "id": 31270036,
      "score": 1,
      "time": 1651730267,
      "title": "Epstein-Barr virus vaccine blocks infection and confers immunity in mice",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/scitranslmed.abf3685"
    },
    {
      "by": "haakon",
      "descendants": 0,
      "id": 31269993,
      "score": 2,
      "time": 1651729777,
      "title": "Congestion Control Arrives in Tor 0.4.7-stable",
      "type": "story",
      "url": "https://blog.torproject.org/congestion-contrl-047/"
    },
    {
      "by": "dilipa",
      "descendants": 0,
      "id": 31269986,
      "score": 1,
      "text": "YOUR MISSION\nAs a CoFounder Applied Engineer, you will be applying cutting-edge ML techniques to real-world problems. You will acquire deep insights into creating communication messages with NLP, Summarization, etc. You will use an ideal customer profile to transform customer profile and product news and satisfy our clients sales outreach needs. You will directly deliver value to customers and interact with our engineering and product team to find the best solutions.<p>*This role will be mix equity and salary\n*Office or remote ok. K2 is in Palo Alto<p>Exemplary task: You will work together with our client from a leading marketing growth consultant to enhance their prospecting functionality for outreaches. For this you will understand their data, test different methods to search through this data, and design a workflow for expert annotators to further improve the models. You will continuously analyze the incoming labels, train models, and improve performance step by step to reach production targets.<p>OUR MISSION\nWe are a pre-seed stage startup that empowers sales teams to build flexible and powerful outreach systems to prospect all types of targets using our innovative framework.<p>K2 Corp. is at the forefront of  AI in Sales and we are on our way to becoming a standard for sales communications. Come join our team and  work with tech experts on real-world cases, in a fast-paced and high-impact environment, and shape the Sales outreach AI space together with us.<p>LIFE AT K2 Corp.\nAt K2 Corp. you will find an environment  with equal opportunities to grow, share ideas, build relationships, and succeed. We believe every employee is important and generates a direct impact on our team’s success.<p>We are certified flexible employers, and our remote first culture is designed to provide work-life balance, autonomy, and flexibility.<p>Our daily meetings, the quarterly in person &quot;Re.Base&quot;, and the social events allow us to work with great synergy.<p>YOUR IMPACT\nUnderstand the customer&#x27;s domain data, their use-case, needs, and processes to optimally solve their problem\nBeing the outward face to the customer and communicating with them to define goals, timelines, and report results\nDefine and learn the skills to grow to an expert role or into a Teamlead\nYOUR PROFILE\nIntense desire to learn new skills \n2+ years of industry experience in applying data science methods to real-world data\nUniversity degree in Computer Science or comparable qualification\nProficient in some of the following: AWS, Python, data science methods and recent model architectures.\nExcellent communication skills with customers and inward-facing stakeholders\nExperience in managing customer projects\nBig plus: Having data science consulting experience \nPERKS\nRemote-first: You can choose to work from home or any other workspace that suits you. We offer a home office budget for equipment and furniture, and we would be happy to sponsor a co-working spot.\nGrow: Personal and professional growth is important to us. We have a budget to learn and develop new skills, the chance to speak at conferences, and our team-favorite is the monthly “Hacky Friday”.\nYou are an owner: We offer every employee the opportunity to be enrolled in the employee stock option plan and own a part of the company.\nChoose your tech: Linux, Windows, or macOS?",
      "time": 1651729732,
      "title": "CoFounder Software Engineer Remote OK",
      "type": "story"
    },
    {
      "by": "shiryel",
      "descendants": 0,
      "id": 31269972,
      "score": 1,
      "time": 1651729601,
      "title": "NixOS on Btrfs+tmpfs",
      "type": "story",
      "url": "https://cnx.srht.site/blog/butter/index.html"
    },
    {
      "by": "ngaut",
      "descendants": 1,
      "id": 31269969,
      "kids": [
        31269988
      ],
      "score": 1,
      "time": 1651729586,
      "title": "Balsa: Learning a Query Optimizer Without Expert Demonstrations",
      "type": "story",
      "url": "https://arxiv.org/abs/2201.01441"
    },
    {
      "by": "mickeypi",
      "descendants": 0,
      "id": 31269967,
      "score": 1,
      "time": 1651729537,
      "title": "Intuit will pay $141M for misleading ads for free tax filing",
      "type": "story",
      "url": "https://text.npr.org/1096612276"
    },
    {
      "by": "danaos",
      "descendants": 0,
      "id": 31269962,
      "score": 1,
      "time": 1651729487,
      "title": "Bitcoin Adoption by Central African Republic a Concern, IMF Says",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-05-04/bitcoin-adoption-by-central-african-republic-a-concern-imf-says"
    },
    {
      "by": "stalluri",
      "descendants": 0,
      "id": 31269933,
      "score": 1,
      "time": 1651729233,
      "title": "Ask HN: Did anyone use tailscale to do hotspot on mobile via USB?",
      "type": "story"
    },
    {
      "by": "KingOfCoders",
      "descendants": 0,
      "id": 31269922,
      "score": 1,
      "text": "I wanted to start a Hackernews on a niche, is there a hosted version of something like Hackernews?",
      "time": 1651729110,
      "title": "Ask HN: Hosted Hacker News?",
      "type": "story"
    },
    {
      "by": "glenngillen",
      "descendants": 0,
      "id": 31269912,
      "score": 1,
      "time": 1651728991,
      "title": "Safely Migrating a Ruby App from Heroku to AWS Serverless",
      "type": "story",
      "url": "https://glenngillen.com/safely_migrating_from_heroku_aws_serverless/"
    }
  ]
}