{
  "stories": [
    {
      "by": "dezork",
      "descendants": 0,
      "id": 27832072,
      "score": 1,
      "time": 1626263638,
      "title": "Machining Steel with (Electroplated) Plastic",
      "type": "story",
      "url": "https://amosdudley.com/weblog/Experiments-with-Desktop-ECM"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 27832070,
      "score": 1,
      "time": 1626263593,
      "title": "Alternate History: Imagine a world where Apple shacked up with Xerox in the '80s",
      "type": "story",
      "url": "https://www.theregister.com/2021/07/14/alternative_history_computer_revolution/"
    },
    {
      "by": "Melissa_bime",
      "descendants": 0,
      "id": 27832067,
      "score": 1,
      "text": "Hi HN! We’re Melissa and Charles, the founders of Infiuss Health.(https:&#x2F;&#x2F;infiuss.com)<p>Infiuss Health enables US and EU based life science companies run clinical trials and clinical research studies in Africa.<p>1.4 Billion Africans (most diverse population on the planet) are excluded from clinical research studies today because it takes averagely 6-12 months only to reach ~40% patient enrolment target, with researchers missing out on huge data that could be generated from studying this populations and exposing us to drugs, vaccines and medical devices tested on non-African participants.<p>Remotely run your clinical research study or clinical trial in Africa from anywhere in the world.<p>We are building an end-to-end platform to power remote research&#x2F;clinical trials in Africa, connecting researchers (in industry and academia) directly to patients and participants for their clinical research studies in under 3 days. Our all-in-one software helps researchers to remotely recruit participants, collect remote consent, collect analyse data and provide virtual support. 20X faster and cheaper than traditional methods(CRO&#x27;s).<p>Who are we:<p>During my Masters fellowship at Stanford, we developed a low-cost pregnancy monitoring device to be deployed in low-income settings. When we took this device into phase 1 clinical trials in Nigeria, it took us 9 months to reach 40% of our enrolment target. This made me realised the need for a solution that could speed up the enrolment process.<p>My co-founder Charles spent the last 5 years working at Microsoft and Huawei Technologies as a software engineer.<p>In 2018 we built software to connect blood donors with patients and hospitals in need of blood. Reached 5K+ users and delivered over 3K pints of blood.<p>How you can help<p>Our customers are US and EU based life science companies, Medical device companies, Pharma, CRO’s and sponsors looking to carry out preliminary research for FDA Approval. We can help with running surveys, recruiting participants and helping with ensuring that the research process is conducted as smoothly as possible. \nIf you’re interested in testing out our product https:&#x2F;&#x2F;dashboard.infiuss.com&#x2F;login<p>If you have had any experience building databases for clinical recruitment or EHR purposes, we would love any helpful feedback.<p>Cheers,<p>Melissa",
      "time": 1626263579,
      "title": "Show HN: Infiuss Health; Platform for remote clinical trials in Africa",
      "type": "story"
    },
    {
      "by": "yunusabd",
      "descendants": 0,
      "id": 27832056,
      "score": 1,
      "time": 1626263522,
      "title": "Show HN: Faux-VR immersive photo viewer for mobile devices",
      "type": "story",
      "url": "https://awesomealbum.com/vr"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 27832055,
      "score": 1,
      "time": 1626263498,
      "title": "The five-day workweek is dead",
      "type": "story",
      "url": "https://www.vox.com/22568452/work-workweek-five-day-four-jobs-pandemic"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 27832053,
      "score": 1,
      "time": 1626263475,
      "title": "People usually get the stock market wrong",
      "type": "story",
      "url": "https://www.axios.com/stock-market-prices-belief-federal-reserve-5ded8f24-08a0-4e0d-972b-26a82e826104.html"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 27832045,
      "score": 1,
      "time": 1626263431,
      "title": "AT&T will let unlimited-data customers pay more to avoid the slow lane",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2021/07/att-stops-slowing-down-unlimited-data-if-you-buy-the-most-expensive-plan/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27832043,
      "score": 1,
      "time": 1626263405,
      "title": "Ascenium Wants to Reinvent the CPU – and Kill Instruction Sets Altogether",
      "type": "story",
      "url": "https://www.tomshardware.com/news/ascenium-reinvent-the-cpu"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 27832038,
      "score": 1,
      "time": 1626263370,
      "title": "EPA considers placing limits on ‘forever chemicals’ in drinking water",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2021/jul/14/epa-pfas-compounds-drinking-water"
    },
    {
      "by": "AlexeyBrin",
      "descendants": 0,
      "id": 27832032,
      "score": 1,
      "time": 1626263318,
      "title": "Let's Write a Toy Emulator in Python",
      "type": "story",
      "url": "https://threadexception.github.io/posts/let%27s-write-a-toy-emulator-in-python.html"
    }
  ]
}