{
  "stories": [
    {
      "by": "steelstraw",
      "descendants": 0,
      "id": 30408960,
      "score": 1,
      "time": 1645388498,
      "title": "We Are Experiencing Definitional Collapse",
      "type": "story",
      "url": "https://freddiedeboer.substack.com/p/we-are-experiencing-definitional"
    },
    {
      "by": "beefman",
      "descendants": 0,
      "id": 30408935,
      "score": 2,
      "time": 1645388285,
      "title": "Trump's Truth Social app set for release Monday",
      "type": "story",
      "url": "https://www.reuters.com/world/us/exclusive-trumps-truth-social-app-set-release-monday-apple-app-store-per-2022-02-20/"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 30408924,
      "score": 2,
      "time": 1645388188,
      "title": "Neural nets are not “slightly conscious,” and AI PR can do with less hype",
      "type": "story",
      "url": "https://lastweekin.ai/p/conscious-ai"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 30408898,
      "score": 2,
      "time": 1645387966,
      "title": "Nvidia’s New AI: Instant Neural Graphics",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=j8tMk-GE8hY"
    },
    {
      "by": "salgernon",
      "descendants": 0,
      "id": 30408891,
      "score": 1,
      "time": 1645387901,
      "title": "WKRP Song List",
      "type": "story",
      "url": "https://docs.google.com/spreadsheets/d/14x1AnN8KV1MH3RYlnKR6FgOFuZ_-Qm-OUvuZo8G38kE/htmlview?usp=sharing#"
    },
    {
      "by": "websap",
      "descendants": 0,
      "id": 30408889,
      "score": 1,
      "text": "I&#x27;m currently a staff&#x2F;senior level engineer for a FAANG in America. I have expertise in cloud infrastructure and building backend services - apis, workflows, stream&#x2F;message consumers, etc.<p>I&#x27;ve been doing the same job since 9 years, since I graduated and it&#x27;s been a lot of fun.<p>I&#x27;ve been thinking of moving to a smaller company, because I&#x27;m hoping it will give me more experience with more opensource tools, and I&#x27;m hoping it will accelerate my carer.<p>Compensation numbers are all over the place in our industry right now, and I&#x27;m trying to maximize this for the 3 - 4 year range.<p>How do you decide it&#x27;s a good time to move to a smaller company?",
      "time": 1645387891,
      "title": "Ask HN: When is a good time to move to a smaller company?",
      "type": "story"
    },
    {
      "by": "intermerda",
      "descendants": 0,
      "id": 30408884,
      "score": 1,
      "text": "Let&#x27;s say you inherit a codebase. It could be a new team, company, or a new language that you haven&#x27;t worked with. What general tips can you give a person to approach this codebase and so they can get familiar with it and start adding features incrementally?",
      "time": 1645387845,
      "title": "How do you approach a new sizeable codebase?",
      "type": "story"
    },
    {
      "by": "41209",
      "descendants": 0,
      "id": 30408868,
      "score": 1,
      "text": "I love Unity , but they’ve been working on UI frameworks for almost a decade , all fall short.<p>Still I need a 3rd party asset to make a decent UI",
      "time": 1645387728,
      "title": "Ask HN: Why is UI design in Unity so hard?",
      "type": "story"
    },
    {
      "by": "Gedxx",
      "descendants": 0,
      "id": 30408840,
      "score": 1,
      "time": 1645387501,
      "title": "The Broken Tech/Content Culture Cycle",
      "type": "story",
      "url": "https://kottke.org/22/02/the-broken-techcontent-culture-cycle"
    },
    {
      "by": "FollowingTheDao",
      "descendants": 2,
      "id": 30408819,
      "kids": [
        30408888
      ],
      "score": 2,
      "text": "So, an introduction of sorts because I thin it matters. From 1985 to 1987 I was a computer science major and was doing really well. It was Fortran back then. I also grew up using a Sinclar ZX81 so programming is not really new to me. But the programming languages sure are as well as the things you can do with it. I make bash scripts al the time for my genetic research so, well, you get it.<p>Also, I was a Network Engineer for Cisco Systems before my Bipolar Disorder made it impossible for me to work. That was in 1999 and I have been living on disability since 2003.<p>I would like to try my hand at programming for Linux applications, possibly MacOS as well. I have a 5th get Thinkpad X1 Carbon running Ubuntu and an M1 MacBook Air.<p>I am also homeless and live in a minivan. I am doing fine with this life but if I could get back into programming and make some extra money it might be something I can use to get myself back into housing after a while and still be able to deal with the Bipolar Disorder.<p>I have been looking at where to start but it is overwhelming. Mostly I am looking for a programming language with some longevity.<p>Thanks for any help!",
      "time": 1645387378,
      "title": "Ask HN: How should I get started learning modern programming?",
      "type": "story"
    }
  ]
}