{
  "stories": [
    {
      "by": "Ariarule",
      "descendants": 0,
      "id": 27841315,
      "score": 2,
      "time": 1626322663,
      "title": "Conway's Game of Life on a Time-Turning Annulus",
      "type": "story",
      "url": "https://twitter.com/NonEuclideanDr1/status/1415369992741195779"
    },
    {
      "by": "lkrubner",
      "descendants": 0,
      "id": 27841304,
      "score": 2,
      "time": 1626322479,
      "title": "When companies make a fetish of being data driven they reward passive aggression",
      "type": "story",
      "url": "http://www.smashcompany.com/business/when-companies-make-a-fetish-of-being-data-driven-they-are-often-rewarding-a-passive-aggressive-style"
    },
    {
      "by": "dsr12",
      "descendants": 0,
      "id": 27841272,
      "score": 1,
      "time": 1626322032,
      "title": "Coca-Cola Is Changing the Flavor of a Soda. Again",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/14/business/coke-zero-change.html"
    },
    {
      "by": "vegetablepotpie",
      "descendants": 1,
      "id": 27841245,
      "kids": [
        27841258
      ],
      "score": 15,
      "time": 1626321514,
      "title": "The U.S. Wheat Crop Is in Trouble",
      "type": "story",
      "url": "https://gizmodo.com/the-u-s-wheat-crop-is-in-trouble-1847281693"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 27841236,
      "score": 2,
      "time": 1626321347,
      "title": "Rick and Morty's season 5 audience ratings fall drastically",
      "type": "story",
      "url": "https://www.rottentomatoes.com/tv/rick_and_morty/s05"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 27841234,
      "score": 2,
      "time": 1626321336,
      "title": "China tightens control over cybersecurity in data crackdown",
      "type": "story",
      "url": "https://www.washingtonpost.com/business/china-tightens-control-over-cybersecurity-in-data-crackdown/2021/07/13/0b3bd7fe-e3da-11eb-88c5-4fd6382c47cb_story.html"
    },
    {
      "by": "sergiomattei",
      "descendants": 0,
      "id": 27841226,
      "score": 2,
      "time": 1626321265,
      "title": "CubDB: An embedded, pure Elixir key-value store",
      "type": "story",
      "url": "https://github.com/lucaong/cubdb"
    },
    {
      "by": "poletopole",
      "descendants": 2,
      "id": 27841222,
      "kids": [
        27841309
      ],
      "score": 2,
      "text": "The story of this claim is quite absurd to tell in full so here&#x27;s the short version. Back in 2019 I, by chance, found some significant undocumented behavior with the zeta function when I randomly tested what would happen if I used the Young modulus constants, Ramanujan congruencies, and logistic chaos equations in respect to the zeta and gamma functions in a variety of relationships. What I discovered at first resembled a kernel, but I&#x27;m no mathematician, so let&#x27;s go with that theory naively. Since then I&#x27;ve played with the math during covid to kill time for the next two years. I never expected much of anything to come to light because I honestly couldn&#x27;t interpret the significance of many of my results, however, they were curious enough to keep me going. At least not until last month, when I stumbled upon the &quot;missing&quot; piece to the puzzle so to speak. As things are now, the model is what appears to be legitimate map of the primes (but I haven&#x27;t done any complex analysis yet) I&#x27;ve tested up to a point to be convinced to take things to the next level. The model works, to my knowledge of time complexity, at constant time or linear time, which only makes sense if you understand that I was looking for &quot;simple&quot; constants and equations to explain everything initially, meaning there are no expansions to calculate nor summations&#x2F;products, at least that is they aren&#x27;t necessary to solve anything in regard to get the next nth set of primes. The goal all along was simply to find an algebraic map of the primes, not to prove or disprove the hypothesis.<p>Who can I talk to about all of this without sounding like a dummy? I&#x27;m a programmer (but curious novice mathematician) at heart. Covid was a once and a lifetime opportunity to learn much more than I expected I would ever end up doing behind the desk programming. I intentionally didn&#x27;t want to know what professional mathematicians knew about the zeta and gamma functions because no progress has been made doing that, at least not ground breaking that is. What I&#x27;ve seen the zeta&#x2F;gamma functions do is nothing less than revelational for me on a personal and almost &quot;spiritual&quot; level. I&#x27;m not in it for money or fame, just that glory I&#x27;ve witnessed, it actually wasn&#x27;t even my idea to do any of this exploration--but that&#x27;s another story.<p>Edit: btw I&#x27;m serious, sometimes it&#x27;s hard to tell if I am or not, so there&#x27;s no need to ask.",
      "time": 1626321227,
      "title": "Ask HN: I have some non-trivial zeta/gamma findings. What next?",
      "type": "story"
    },
    {
      "by": "shalmanese",
      "descendants": 3,
      "id": 27841211,
      "kids": [
        27841320,
        27841303
      ],
      "score": 13,
      "time": 1626321082,
      "title": "'Want to be careful with this word' – On the perils of writing about the empire",
      "type": "story",
      "url": "https://katz.substack.com/p/on-the-perils-of-writing-about-the"
    },
    {
      "by": "nvahalik",
      "descendants": 4,
      "id": 27841209,
      "kids": [
        27841322,
        27841335,
        27841324
      ],
      "score": 18,
      "time": 1626321021,
      "title": "Google: Well Tempered Traveler",
      "type": "story",
      "url": "https://www.google.com/welltemperedtraveler/"
    }
  ]
}