{
  "stories": [
    {
      "by": "m0nhawk",
      "descendants": 0,
      "id": 30122731,
      "score": 1,
      "text": "I can&#x27;t remember (and find) a no code platform that I saw on HN around 3-6 months ago (tried searching Algolia already).<p>It&#x27;s a user-centric platform that allows building models from basic blocks (like inputs, relations etc) and I remember few examples: Drake Equation, some typical queue usage and a huge model for startup profitability.",
      "time": 1643418808,
      "title": "Ask HN: No code platform for building models",
      "type": "story"
    },
    {
      "by": "matthberg",
      "descendants": 0,
      "id": 30122721,
      "score": 1,
      "time": 1643418724,
      "title": "The Hitchhiker's Guide to Digital Colour",
      "type": "story",
      "url": "https://hg2dc.com/"
    },
    {
      "by": "accrual",
      "descendants": 0,
      "id": 30122688,
      "score": 2,
      "time": 1643418374,
      "title": "Windows 95 3D Maze Screensaver [WebGL/JS]",
      "type": "story",
      "url": "https://ibid-11962.github.io/Windows-95-3D-Maze-Screensaver/"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 30122657,
      "score": 1,
      "time": 1643418130,
      "title": "AIX Archive Files Are bigaf",
      "type": "story",
      "url": "https://twitter.com/hasheddan/status/1487219340881575939"
    },
    {
      "by": "pornel",
      "descendants": 0,
      "id": 30122614,
      "score": 1,
      "time": 1643417773,
      "title": "Who Wrote the Alphv/BlackCat Ransomware Strain?",
      "type": "story",
      "url": "https://krebsonsecurity.com/2022/01/who-wrote-the-alphv-blackcat-ransomware-strain/"
    },
    {
      "by": "lehi",
      "descendants": 0,
      "id": 30122599,
      "score": 1,
      "time": 1643417666,
      "title": "Reactance (Psychology)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Reactance_(psychology)"
    },
    {
      "by": "jeffreaky",
      "descendants": 1,
      "id": 30122572,
      "kids": [
        30122687
      ],
      "score": 11,
      "text": "On or about December 26th, a Facebook page that I run for our band called Wonder Bread 5, was unpublished without any warning. The only notification I received, was in the drop-down menu for notifications in Facebook.<p>We have been a band for over 25 years now, and have used our Facebook page to promote our band, spending thousands on paid adds regularly to direct fans to our concerts, and to engage with our audience since 2009 or longer. Our Facebook page is https:&#x2F;&#x2F;www.facebook.com&#x2F;WeAreWB5&#x2F; although I can still login and see the page, no one on the other side of Facebook can see it. Thus being unpublished. After about a week there was a notice on the front page that read, &quot;Wonder Bread 5 goes against Facebook&#x27;s community standards&quot;. Under this was a question asking if I agreed or disagreed with this decision. I disagreed with this decision as I don&#x27;t understand why the Facebook page was unpublished or what we have done to go against Facebook&#x27;s community standards.<p>After a few weeks of logging in, a new message popped up. I still get &quot;Wonder Bread 5 goes against our community standards&quot;. When I try to post, it says  &quot;Your account is restricted right now. You have been temporarily blocked from performing this action.&quot; So I wonder if this is a short temporary thing, or a long temporary thing that will be drawn out over months? My thought maybe, was to go in and try to delete most everything in hopes whatever I delete is what is being flagged. Does anyone have any insight into that, or thoughts as to what may be being flagged?<p>To my knowledge, we have been in compliance with the rules and regulations of Facebook. The page has never been banned or put in &quot;Facebook jail&quot;. When I go into the violations section of our page, Facebook says &quot;you have no violations, thank you for keeping Facebook a safe place&quot;. If it is a copyright problem, we have been in touch with The Wonder Bread company lawyers and have been given permission to use the name &quot;Wonder Bread 5&quot; as long as we don&#x27;t use the logo<p>Our business is really hurting because of this. We can&#x27;t pay for ads to promote our concerts. We have 13k followers, losing them would be horrible<p>Any help would be very appreciated.",
      "time": 1643417414,
      "title": "Facebook page unpublished with no warning",
      "type": "story"
    },
    {
      "by": "mrintellectual",
      "descendants": 0,
      "id": 30122565,
      "score": 2,
      "time": 1643417376,
      "title": "Turn a Photo into an Animation",
      "type": "story",
      "url": "https://huggingface.co/spaces/filio/animate"
    },
    {
      "by": "clouddrover",
      "descendants": 1,
      "id": 30122562,
      "kids": [
        30122708
      ],
      "score": 5,
      "time": 1643417367,
      "title": "Elon Musk Promises Full Self-Driving “Next Year” for the Ninth Year in a Row",
      "type": "story",
      "url": "https://jalopnik.com/elon-musk-promises-full-self-driving-next-year-for-th-1848432496"
    },
    {
      "by": "NinjaDev",
      "descendants": 0,
      "id": 30122537,
      "score": 1,
      "time": 1643417167,
      "title": "Ninja Developer Hacking Squad: Get an NFT Representing a Programming Language",
      "type": "story",
      "url": "https://ninjadeveloper.xyz"
    }
  ]
}