{
  "stories": [
    {
      "by": "abigpotatoe",
      "descendants": 0,
      "id": 28638182,
      "score": 1,
      "time": 1632452782,
      "title": "Super Long Piano vs. Normal Upright Piano (Sound Comparison)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=PcP8UMgsmFo"
    },
    {
      "by": "DoreenMichele",
      "descendants": 0,
      "id": 28638172,
      "score": 1,
      "time": 1632452652,
      "title": "The teens who run covidbaseau, thrilled to finally be included in their own data",
      "type": "story",
      "url": "https://twitter.com/covidbaseau/status/1440916985471062016"
    },
    {
      "by": "isabellavieira",
      "descendants": 0,
      "id": 28638142,
      "score": 2,
      "time": 1632452147,
      "title": "DevOps: Principles, Practices, and Tools",
      "type": "story",
      "url": "https://tarscloud.org/feeds/2451698757298397"
    },
    {
      "by": "isabellavieira",
      "descendants": 0,
      "id": 28638141,
      "score": 1,
      "time": 1632452129,
      "title": "Measuring the Health of Open Source Communities",
      "type": "story",
      "url": "https://tarscloud.org/feeds/3470542108685935"
    },
    {
      "by": "isabellavieira",
      "descendants": 0,
      "id": 28638140,
      "score": 1,
      "time": 1632452115,
      "title": "How Open Source Is Pushing the Future of Data Science",
      "type": "story",
      "url": "https://tarscloud.org/feeds/3800819773274530"
    },
    {
      "by": "isabellavieira",
      "descendants": 0,
      "id": 28638136,
      "score": 2,
      "time": 1632452090,
      "title": "Container Orchestration: The Solution to Managing Containers at Scale",
      "type": "story",
      "url": "https://tarscloud.org/feeds/6300665183476313"
    },
    {
      "by": "saddington",
      "descendants": 1,
      "id": 28638134,
      "kids": [
        28638137
      ],
      "score": 1,
      "text": "orignally shared this on startup school... i thought id&#x27; share it here.<p>i&#x27;m using a `nocode communication tool` (a web-based interface... a single browser tab!) for all of these things:<p>1. landing page — the landing page is the product and i wanted for folks to feel &quot;transported&quot; right into the app without having to walk through a shitty b2b marketing-style content. this is akin to my experience back in the `BBS` days of the mid-90&#x27;s where you were immediately into the app, community, and tool. no terms of service, no privacy policy. just pure, immediate value.<p>2. building community — we talk about life and startups and the metaverse and bitcoin and writing and all of the things that i love to think about and talk about! since this is my workspace (they are called &quot;yeniverses&quot;) i want to love it more than anyone else. and as an artist, i want to love it even more. so, the community that&#x27;s there every single day is there because they like these topics and want to talk and discuss them with me. this is nice because no one is really there that doesn&#x27;t want to be there... instead, these are highly-qualified community members (and customers). it naturally weeds out folks who aren&#x27;t interested in those things.<p>3. a feedback system on the product — using a simple `public` room (which you can see at the very [bottom](https:&#x2F;&#x2F;john.do&#x2F;wp-content&#x2F;uploads&#x2F;2021&#x2F;09&#x2F;Screen-Shot-2021-09-23-at-7.35.25-PM.png)) i can get direct feedback on the product itself which is the most important part in the very early-stage... i just want to know what works and what doesn&#x27;t and then i can make those changes and fixes immediately. this is also super-useful because my entire team also can engage with the community and see, for themselves, the needs &#x2F; wants &#x2F; wishes &#x2F; desires of the community at-large. this fixes a lot of the problems where team members are too distant or removed from their customers, which is a common problem as teams scale and grow. keeping this in the same interface as #4 is a total win.<p>4. internal communication with my team &#x2F; contractors (slack replacement) — this is probably one of the best parts is that i can use as many `private rooms` as i need to communicate with my fully-distributed team in both real-time and async. i use it for my development team that&#x27;s helping to build the product as well as unique private rooms for contract teams and special projects. i can create them quickly, invite via email (any email works so you don&#x27;t have to lock-in any specific domain) and then just get to work. delete them when you&#x27;re done.<p>(cont&#x27;d in the first comment...)",
      "time": 1632452085,
      "title": "Show HN: I'm using a nocode comm tool",
      "type": "story"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 28638073,
      "score": 1,
      "time": 1632451391,
      "title": "Jasper Mall",
      "type": "story",
      "url": "https://vimeo.com/408623802"
    },
    {
      "by": "gigatexal",
      "descendants": 0,
      "id": 28638062,
      "score": 1,
      "time": 1632451300,
      "title": "Google Managed Deployments to GKE",
      "type": "story",
      "url": "https://cloud.google.com/blog/products/devops-sre/google-cloud-deploy-automates-deploys-to-gke"
    },
    {
      "by": "freediver",
      "descendants": 0,
      "id": 28638028,
      "score": 1,
      "time": 1632450909,
      "title": "Summarizing Books with Human Feedback",
      "type": "story",
      "url": "https://openai.com/blog/summarizing-books/"
    }
  ]
}