{
  "stories": [
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 28966667,
      "score": 1,
      "time": 1634977663,
      "title": "DDR5 RAM prices could be bad news for your wallet",
      "type": "story",
      "url": "https://www.techradar.com/au/news/ddr5-ram-prices-could-be-bad-news-for-your-wallet"
    },
    {
      "by": "ghuntley",
      "descendants": 0,
      "id": 28966647,
      "score": 1,
      "time": 1634977286,
      "title": "A meeting with .NET teams to talk about Unity's future with .NET",
      "type": "story",
      "url": "https://twitter.com/xoofx/status/1451780088815669249"
    },
    {
      "by": "jbverschoor",
      "descendants": 0,
      "id": 28966619,
      "score": 1,
      "text": "Biggest change is the removal of 3.1.3 for marketing other purchase methods.<p>&gt; Added 2.3.13. “In-app events are timely events that happen within your app. To feature your event on the App Store, it must fall within an event type provided in App Store Connect. All event metadata must be accurate and pertain to the event itself, rather than the app more generally. Events must happen at the times and dates you select in App Store Connect, including across multiple storefronts. You may monetize your event so long as you follow the rules set forth in Section 3 on Business. And your event deep link must direct users to the proper destination within your app. Read In‑App Events for detailed guidance on acceptable event metadata and event deep links.”<p>&gt; Deleted from 3.1.3. “Developers cannot use information obtained within the app to target individual users outside of the app to use purchasing methods other than in-app purchase (such as sending an individual user an email about other purchasing methods after that individual signs up for an account within the app).”<p>&gt; Added 5.1.1 (x). “Apps may request basic contact information (such as name and email address) so long as the request is optional for the user, features and services are not conditional on providing the information, and it complies with all other provisions of these guidelines, including limitations on collecting information from kids.”",
      "time": 1634976890,
      "title": "Apple updates App Store (in-app purchases) review guidelines",
      "type": "story"
    },
    {
      "by": "pqvst",
      "descendants": 0,
      "id": 28966613,
      "score": 1,
      "time": 1634976747,
      "title": "RollerCoaster Tycoon (original) is still one of my all-time favorite games",
      "type": "story",
      "url": "https://pqvst.com/2021/10/23/playing-rct-on-my-mac/"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 28966591,
      "score": 1,
      "time": 1634976337,
      "title": "Athira chief executive resigns as company confirms she altered research",
      "type": "story",
      "url": "https://www.statnews.com/2021/10/21/athira-chief-executive-resigns-as-company-confirms-she-altered-research/"
    },
    null,
    {
      "by": "ashellunts",
      "descendants": 0,
      "id": 28966542,
      "score": 1,
      "time": 1634975687,
      "title": "Is manual testing still popular?",
      "type": "story",
      "url": "https://twitter.com/bakdasar/status/1451557433432805376"
    },
    {
      "by": "GaryTang",
      "descendants": 0,
      "id": 28966536,
      "score": 4,
      "time": 1634975587,
      "title": "Many Russians won’t get vaccinated against Covid-19. A dog catcher explains why",
      "type": "story",
      "url": "https://thebulletin.org/2021/10/many-russians-wont-get-vaccinated-against-covid-19-a-dog-catcher-explains-why/"
    },
    {
      "by": "bluewalt",
      "descendants": 0,
      "id": 28966535,
      "score": 2,
      "text": "So, you love coding, but for some reasons, you finally got bored with web development.\nDid you manage to find another field where you can still use your coding skills? Are you happier now? Can you describe what are the main differences with your former web dev job, technically speaking? (eg. &quot;I do less technology watch because evolution pace is slower&quot;)",
      "time": 1634975585,
      "title": "Ask HN: Did you move from web dev to another dev land?",
      "type": "story"
    },
    {
      "by": "adamzerner",
      "descendants": 0,
      "id": 28966533,
      "score": 2,
      "time": 1634975577,
      "title": "Why Racket? Why Lisp?",
      "type": "story",
      "url": "https://practicaltypography.com/why-racket-why-lisp.html"
    }
  ]
}