{
  "stories": [
    {
      "by": "jtr1",
      "descendants": 0,
      "id": 29518577,
      "score": 1,
      "time": 1639198948,
      "title": "Tree of 40 Fruit",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Tree_of_40_Fruit"
    },
    {
      "by": "hncurious",
      "descendants": 0,
      "id": 29518570,
      "score": 1,
      "time": 1639198862,
      "title": "New York City Gives 800k Noncitizens Right to Vote in Local Elections",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/09/nyregion/noncitizens-voting-rights-nyc.html"
    },
    {
      "by": "SEJeff",
      "descendants": 0,
      "id": 29518561,
      "score": 1,
      "time": 1639198819,
      "title": "The Tesla Cybertruck Will Be Wide Judging by These Amber Lights",
      "type": "story",
      "url": "https://www.thedrive.com/news/43473/the-tesla-cybertruck-will-be-really-wide-judging-by-these-amber-lights"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 29518557,
      "score": 2,
      "time": 1639198728,
      "title": "Don’t Overdose on VC: Lessons from 166 Startup IPOs",
      "type": "story",
      "url": "https://foundercollective.medium.com/dont-overdose-on-vc-lessons-from-166-startup-ipos-c94f3c178dfe"
    },
    {
      "by": "ShobhitJ",
      "descendants": 0,
      "id": 29518549,
      "score": 1,
      "time": 1639198636,
      "title": "Strategy newsletter analysing technology companies and ideas",
      "type": "story",
      "url": "https://techbreakdowns.substack.com/"
    },
    {
      "by": "wahajdarr",
      "descendants": 1,
      "id": 29518543,
      "kids": [
        29518547
      ],
      "score": 1,
      "text": "Livepush offers an end-to-end live streaming platform that supports multiple platforms at the same time.",
      "time": 1639198515,
      "title": "Professional live video streaming and scheduling platform",
      "type": "story"
    },
    {
      "by": "charlieyu1",
      "descendants": 0,
      "id": 29518541,
      "score": 2,
      "text": "I’ve never worked as a dev for my life, but I spent quite some of my spare time to do programming. I’m also going to write a math textbook, but the task is repetitive and I don’t know how to automate it.<p>There is one thing that I tried to build for years, and failed a few times: a system that generate math problems and their corresponding solutions for different problem types. I know a bit of Python and sympy, I may need to twerk sympy a bit to get the results I want, but probably manageable. The ability to export to MSWord&#x2F;Latex is a plus, but I’d say forgetting about it now because you need to write a lot of raw OOXML even if using python-docx and documentation is basically non-existent.<p>I start with writing small scripts a few times to try and make it happen. Every time after lots of hours spent, I know my code is a mess and I throw it away.<p>The ideal project would be to write code for about 20-50 math topics, each with 20-50 problem types. Writing a base class for each topic and inherit from it, may or may not work. There is a lot of repetition. Writing the case to create a problem and solution of quadratic equation of the form “ax^2+bx+c=0” is easy. 50 problem types later where you run out of class names that you could imagine where you are trying to do “(ax+b)(cx+d)=e(fx+g)” and at most two parameters can be a fraction and the equation must have rational solutions and the solution differs whether cx+d and fx+g have a common factor, I don’t know what could I do about it. Maybe there is some pattern in software architecture I don’t know?",
      "time": 1639198484,
      "title": "Ask HN: Advise for an amateur programmer who is also a high school math teacher",
      "type": "story"
    },
    {
      "by": "wyrm",
      "descendants": 0,
      "id": 29518526,
      "score": 1,
      "time": 1639198296,
      "title": "Study: Investing in Legos Will Earn You More Money Than Gold",
      "type": "story",
      "url": "https://gizmodo.com/forget-about-gold-study-says-investing-in-lego-sets-wi-1848198385"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 29518514,
      "score": 1,
      "time": 1639198097,
      "title": "Ventoy turns any disk into a multi-boot OS installer",
      "type": "story",
      "url": "https://www.theregister.com/2021/12/10/friday_foss_fest/"
    },
    {
      "by": "lightlyused",
      "descendants": 0,
      "id": 29518504,
      "score": 3,
      "time": 1639197971,
      "title": "Debris from the Mayfield tornado has also lofted over 30k feet into the air",
      "type": "story",
      "url": "https://twitter.com/CC_StormWatch/status/1469513507037233152"
    }
  ]
}