{
  "stories": [
    {
      "by": "blunte",
      "descendants": 0,
      "id": 29988814,
      "score": 1,
      "text": "The number of programming languages continues to proliferate, as do the frameworks and libraries for each.<p>In many ways this leads to great advancements, but it also has some negative impacts: distraction, reinvention, technical debt, and many more issues.<p>Proprietary zones have few or no options (C# Windows, Swift macOS); but those are the smaller cases.  Internet and web services run Python, Ruby, Elixir, C#, Java, Kotlin, PHP, JavaScript, Perl, and probably half a dozen other languages.<p>If you look at any one language, you&#x27;ll usually find one or more heavy frameworks (Rails, Django, Phoenix, Laravel, etc.), and even more lightweight frameworks and libraries tailored to more specific needs (APIs, services, etc.).<p>Should we not stop for a bit and evaluate what exists, then make an effort to consolidate?  Are we not exhausted with job specs that list 5-10 very specific requirements which fit an increasingly narrow target group of devs?<p>Or the counter question: are we really benefitting from further diversification?  Is there an overall return on investment in our proliferation of frameworks and libraries (and languages?).",
      "time": 1642556789,
      "title": "Ask HN: Should we narrow our language focus?",
      "type": "story"
    },
    {
      "by": "jah",
      "descendants": 0,
      "id": 29988800,
      "score": 1,
      "time": 1642556625,
      "title": "In place of a legal notice, here is a blessing",
      "type": "story",
      "url": "https://github.com/sqlite/sqlite/blob/master/src/main.c"
    },
    {
      "by": "the_black_hand",
      "descendants": 0,
      "id": 29988799,
      "score": 1,
      "text": "GM to all,<p>We&#x27;ve been working on an opensource NPM package and tool https:&#x2F;&#x2F;nftoptions.app for creating options contracts on the Solana blockchain. The client is in nodejs https:&#x2F;&#x2F;www.npmjs.com&#x2F;package&#x2F;solana-options , with an onchain server written in Rust https:&#x2F;&#x2F;github.com&#x2F;dbanda&#x2F;solana-nft-options<p>This package allows you to easily create options contracts for tokens on Solana, with specific expiry times and strike values on the blockchain in one line of code. Similarly, you can use it to mint tokens and create contracts on those tokens. This allows you to do things like mint an NFT for a piece of art and then sell a call contract to buy that NFT at a predefined price. Each contract is tied to an NFT too, so you can easily trade them as well.<p>The onchain program is currently available on Solana devnet and testnet. We hope to launch on mainnet soon and possibly drop the NFTs on platforms such as Solsea for easy exchange. Currently, the web app https:&#x2F;&#x2F;nftoptions.app only supports the Phantom wallet but we are looking to add more soon.<p>We are looking for feedback, contributors and testers. Issues can be filed on the GitHub. As always, any feedback is greatly appreciated.<p>Thanks y’all.",
      "time": 1642556617,
      "title": "Show HN: NFT Options Trading on Solana",
      "type": "story"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 29988783,
      "score": 4,
      "time": 1642556485,
      "title": "WhatsApp Ordered to Help US Agents Spy on Chinese Phones–No Explanation Required",
      "type": "story",
      "url": "https://www.forbes.com/sites/thomasbrewster/2022/01/17/whatsapp-ordered-to-spy-on-chinese-phones-by-america-no-explanation-given/"
    },
    {
      "by": "Jugurtha",
      "descendants": 0,
      "id": 29988770,
      "score": 1,
      "time": 1642556376,
      "title": "Could 2 People Repopulate Earth[video][13:58]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Z83I2tz5UzM"
    },
    {
      "by": "timmers",
      "descendants": 0,
      "id": 29988768,
      "score": 1,
      "time": 1642556344,
      "title": "Xanadu",
      "type": "story",
      "url": "https://xanadu.com/"
    },
    {
      "by": "moonsafari508",
      "descendants": 0,
      "id": 29988754,
      "score": 2,
      "time": 1642556271,
      "title": "A Digital Tape Measure, Finally",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=M8GHwxkKnOU"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 29988717,
      "kids": [
        29988725
      ],
      "score": 3,
      "time": 1642555897,
      "title": "Timothy Snyder: “How to think about war in Ukraine”",
      "type": "story",
      "url": "https://snyder.substack.com/p/how-to-think-about-war-in-ukraine"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 29988694,
      "score": 2,
      "time": 1642555682,
      "title": "Does Not Compute",
      "type": "story",
      "url": "https://www.collaborativefund.com/blog/does-not-compute/"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 29988691,
      "score": 1,
      "time": 1642555675,
      "title": "The inside story of Facebook Marketplace",
      "type": "story",
      "url": "https://www.lennysnewsletter.com/p/the-inside-story-of-facebook-marketplace"
    }
  ]
}