{
  "stories": [
    {
      "by": "gmays",
      "descendants": 0,
      "id": 30685949,
      "score": 1,
      "time": 1647355446,
      "title": "New hope for treatment of infant cancer that has puzzled researchers for decades",
      "type": "story",
      "url": "https://www.sanger.ac.uk/news_item/new-hope-for-treatment-of-infant-cancer-that-has-puzzled-researchers-for-decades/"
    },
    {
      "by": "Gaelan",
      "descendants": 0,
      "id": 30685943,
      "score": 1,
      "time": 1647355430,
      "title": "No Ghosts",
      "type": "story",
      "url": "https://blog.sunfishcode.online/no-ghosts/"
    },
    {
      "by": "ZYinMD",
      "descendants": 0,
      "id": 30685938,
      "score": 1,
      "text": "How it works: This is a chrome extension. You visit tiktok.com and sign in, the extension retrieves MP4s and puts them in a folder.<p>If you don&#x27;t have time to try, here&#x27;s a video walking through all the features: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;BoHOdRxHgP0\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;BoHOdRxHgP0</a><p>Goal: the TikTok algorithm has helped me find wonderful things. I consider the list of my [Likes] to be a treasure collection, and want to make sure I don&#x27;t lose them.<p>Is it free: Yes. (I did test a payment modal once, but users gave me 1-star ratings for it, so I removed it)",
      "time": 1647355372,
      "title": "Show HN: myfaveTT – download all your [Liked] videos from TikTok for safekeeping",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/myfavett-download-all-you/gmajiifkcmjkehmngbopoobeplhoegad"
    },
    {
      "by": "sparkling",
      "descendants": 1,
      "id": 30685927,
      "kids": [
        30685948
      ],
      "score": 1,
      "time": 1647355291,
      "title": "Roskomnadzor blocking VPN services in Russia after ban on Facebook and Instagram",
      "type": "story",
      "url": "https://twitter.com/nexta_tv/status/1503713557996879872"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30685926,
      "score": 1,
      "time": 1647355275,
      "title": "Microsoft Makes the DirectStorage API Officially Available",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-DirectStorage-API"
    },
    {
      "by": "beringela",
      "descendants": 0,
      "id": 30685922,
      "score": 1,
      "time": 1647355271,
      "title": "PeerTangle: A cryptocurrency-themed comic strip – why crypto has no upper limit",
      "type": "story",
      "url": "https://peertangle.com/portfolio/001-the-beauty-of-cryptocurrency/"
    },
    {
      "by": "joseb",
      "descendants": 0,
      "id": 30685921,
      "score": 3,
      "text": "Hi HN, we’re Jose and Marco from Method (<a href=\"https:&#x2F;&#x2F;methodfi.com\" rel=\"nofollow\">https:&#x2F;&#x2F;methodfi.com</a>). We are building a developer-first API that makes it easy for developers to embed debt repayment into their applications. We enable your business to push money to any type of consumer debt, like student loans, credit cards, and mortgages, on behalf of your users.<p>Making payments to consumer debt on behalf of individuals is an archaic process. In most instances it involves mailing physical checks. If APIs exist at all, they are brittle. Figuring out how to do this with reasonable UX is costly, time-consuming, and involves lengthy compliance processes.<p>Fintechs have innovated to help users manage savings and investments, but so far have done little with debt, which is actually many people’s biggest anxiety. Ballooning American consumer debt means there’s a great need in this space, but fintechs attempting to enter it run into this issue of how hard it is to offer payments. That’s the problem we solve. By using our API, any company can embed debt repayment into their platform with instant access across 10,000+ financial institutions, covering 95% of all consumer debt.<p>We ran into this while building our previous startup called GradJoy. It started as a side project to manage our student loans, then turned into a PFM (personal finance manager) that\nconnected all your student loans to one app and calculated the optimal way to get you out of debt. We got into YC S19 with this. Our next step was to connect with APIs and make payments on behalf of users. As Demo Day was nearing, integrating payments was taking longer than expected. We had assumed there would be an API solution, but we were unable to find one. We asked fellow founders in the lending space and told us we had to send physical checks to student loan servicers! Given our deadline we spun that up, but ran into constant issues with checks taking forever and getting lost in the mail. Managing payments was becoming our full-time job.<p>After Demo Day we worked to get integrated directly with the financial institutions to be able to make payments online. It took forever to jump through all the costly compliance hoops and work with slow-moving organizations. Once we finally rolled out electronic payments, we got a lot of interest from other YC founders who wanted to know how we did it. A lot of them asked if they could just use our internal payment APIs. Eventually we decided to pivot to Method Financial and focus on making it easy for developers to add debt repayment to their own apps and services.<p>Our solution is a developer-first API that handles account verification, money movement and transaction confirmation via direct integration into the banking network. To initiate a payment, developers just have to send a source account (where the money is coming from), a destination account (where the money is going), a transaction amount, and in some cases additional user verification (for compliance). That’s it!<p>On the back end we are connected to 10,000+ financial institutions because of our direct relationships with the banking core providers. This gives us access to networks of intra-bank payment rails. As soon as a payment is initiated from the customer side, we verify the end-user (KYC&#x2F;AML), initiate money transfer and return confirmation in real time. Settlement usually completes on the same day. No more paper checks, no multiple integrations or screen-scraping, no transaction limits, far fewer returned payments, and best of all, we deal with the compliance headaches, including all the ongoing compliance maintenance that needs taking care of.<p>So far, companies are using us to do things like provide matching student loan payments as an employee benefit, do one-click balance transfers when switching credit cards, and allow cryptocurrency users to pay down debt or pay bills. We charge per API call, and there are monthly minimums similar to Plaid.<p>Our API is live and we have a self-serve dashboard with two environments: development mode (cannot move real money) and sandbox mode (move real money—up to 20 live payments for free). After a simple KYC verification, you can enable sandbox mode and move real money at <a href=\"https:&#x2F;&#x2F;dashboard.methodfi.com\" rel=\"nofollow\">https:&#x2F;&#x2F;dashboard.methodfi.com</a>.<p>We’d love for you to try out Method. You can get development and sandbox API keys in our dashboard – no credit card required.<p>Have you built a similar payment infrastructure before? Have ideas for other potential use cases? We’d love to hear your questions, experiences, ideas and feedback! We’ll be online today to answer any questions - we’re always excited to talk about fintech, payments, APIs, etc.",
      "time": 1647355263,
      "title": "Launch HN: Method Financial (YC S19) – API to embed debt repayment into your app",
      "type": "story"
    },
    {
      "by": "rolisz",
      "descendants": 0,
      "id": 30685904,
      "score": 1,
      "time": 1647355208,
      "title": "On the usefulness of a little bit of programming",
      "type": "story",
      "url": "https://rolisz.ro/2022/03/15/on-the-usefulness-of-a-little-bit-of-programming/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30685896,
      "score": 1,
      "time": 1647355147,
      "title": "SQLite is now available in Arctype",
      "type": "story",
      "url": "https://arctype.com/blog/changelog/db-browser-for-sqlite/"
    },
    {
      "by": "mrleiter",
      "descendants": 0,
      "id": 30685883,
      "score": 1,
      "time": 1647355086,
      "title": "Saudi Arabia Considers Accepting Yuan Instead of Dollars for Chinese Oil Sales",
      "type": "story",
      "url": "https://www.wsj.com/articles/saudi-arabia-considers-accepting-yuan-instead-of-dollars-for-chinese-oil-sales-11647351541"
    }
  ]
}