{
  "stories": [
    {
      "by": "ukd1",
      "descendants": 0,
      "id": 28947689,
      "score": 5,
      "text": "Russ, here, CTO and cofounder of Rainforest QA (<a href=\"https:&#x2F;&#x2F;www.rainforestqa.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rainforestqa.com</a>). Way back in 2012, my cofounder Fred (@ fredsters_s) and I got into YC with one idea in mind, but soon pivoted once we saw a pattern among most of the other companies in our cohort.<p>These startups were trying to push code through CI&#x2F;CD pipelines as frequently as possible, but were stymied by quality assurance. Labor-intensive QA (specifically, smoke, regression, and other UI tests) tended to be the bottleneck preventing CI&#x2F;CD from delivering on its promise of speed and efficiency. That left a frustrating dilemma for these teams: slow down or pause the release process to do QA, or move faster at the expense of product quality. Given that we were sure CI&#x2F;CD would be the future of software development, we decided to dedicate our startup to solving this challenge.<p>For us, inspired at the time by Amazon Mechanical Turk, the question was: could we organize and train crowdsourced testers to do manual UI testing quickly, affordably, and accurately enough for CI&#x2F;CD?<p>In the following years, we optimized crowd testing to be as fast as it could possibly be, including parallelization of work and 24&#x2F;7, on-demand availability. (Our human-powered test suites complete in under 17 minutes, on average!) But, the fact is, for many rote tasks (like regression tests), humans will never be as fast or as affordable as the processing power of computers.<p>The logical conclusion is that teams should simply automate as much UI testing as possible. But we found that UI test automation is out of reach for many startups—it’s expensive to hire an engineer who has the skills to create and maintain such automated tests in one of the popular frameworks like Selenium. Plus, those tests tend to be quite brittle, further inflating maintenance costs.<p>With the rise of no-code, we saw an opportunity to make automated UI testing truly accessible to all companies and product contributors. So two years ago, we made a big decision to pivot the company and got to work building a no-code test automation framework from scratch. We’re excited to have launched our new platform this summer.<p>On our platform, anyone on your team can write, maintain, and run automated UI tests using a WYSIWYG test editor. Unlike other “no-code” test solutions which still require coding for test maintenance, our proprietary automation framework isn’t a front-end for Selenium. Unlike most test automation frameworks that test the DOM, our automation service interacts with and evaluates the UI of your app or website via machine-vision, to give you the confidence you’re testing exactly what your users and customers will experience. Minor, behind-the-scenes code changes that don’t affect the UI often break Selenium tests (i.e., create false positives), but not Rainforest tests.<p>Our automated tests return detailed results in under four minutes on average, providing regression steps, video recordings, and HTTP logs of every test. You don’t have to set up or pay extra for testing infrastructure, because it’s all included in the plans on our platform. Tests run on virtual machines in our cloud, including 40+ combinations of platforms and browsers. We build everything with CI&#x2F;CD pipelines in mind, so most of our customers kick off tests using our API, CLI, or CircleCI Orb.<p>Of course, not all tests can or should be automated; e.g. when a feature UI is changing frequently or when you need subjective feedback like, “Is this image clear?”. Today, computers are nowhere near able to replace the ingenuity and judgement of people; that’s why our crowd testing community isn’t going anywhere. We can now say that Rainforest is the only QA platform that provides on-demand access to both no-code automated testing and manual testing by QA specialists.<p>We’ve also created a free plan that provides five free hours of test automation every month, because we don’t think cost should make test automation inaccessible, either. (If you&#x27;re in YC, we have a new deal - check bookface.)<p>I’m looking forward to your questions and feedback!",
      "time": 1634836464,
      "title": "Launch HN: Rainforest QA (YC S21) – No-Code UI Test Automation",
      "type": "story"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 28947673,
      "score": 1,
      "time": 1634836394,
      "title": "100M-year old crab trapped in amber rewrites ancient crustacean history",
      "type": "story",
      "url": "https://www.cnet.com/news/100-million-year-old-crab-trapped-in-amber-rewrites-ancient-crustacean-history/"
    },
    {
      "by": "xojoc",
      "descendants": 0,
      "id": 28947655,
      "score": 1,
      "time": 1634836321,
      "title": "Amazon accused of lying about its business practices to Congress",
      "type": "story",
      "url": "https://www.engadget.com/amazon-antitrust-seller-data-house-judiciary-committee-142110829.html"
    },
    {
      "by": "mariojv",
      "descendants": 0,
      "id": 28947654,
      "score": 1,
      "time": 1634836321,
      "title": "NSA is surging its collaboration with the private sector",
      "type": "story",
      "url": "https://www.washingtonpost.com/politics/2021/10/21/nsa-is-surging-its-collaboration-with-private-sector/"
    },
    {
      "by": "r0m4n0",
      "descendants": 0,
      "id": 28947630,
      "score": 1,
      "time": 1634836217,
      "title": "Google dropping Play Store subscription fee from 30% to 15%",
      "type": "story",
      "url": "https://9to5google.com/2021/10/21/google-play-subscription-fee/"
    },
    {
      "by": "jessehorne",
      "descendants": 0,
      "id": 28947601,
      "score": 1,
      "text": "Hey HN!<p>If you haven&#x27;t heard, Rhythm was given a cease and desist order. This made me think it would be really fun to learn how it worked, so I made an extremely minimal but viable solution in JS.<p>It&#x27;s small, it works and it doesn&#x27;t use your filesystem. Also note, I&#x27;m not encouraging that anyone use this.<p>All feedback and criticisms are welcome!<p>https:&#x2F;&#x2F;github.com&#x2F;jessehorne&#x2F;bop<p>p.s If you were YouTube or Rhythm, how would you have handled this situation differently? Could there be a way to keep bots like these without having them shut down and also without going bankrupt while running them?",
      "time": 1634836092,
      "title": "Show HN: A Discord Bot That Plays Music from YouTube (RIP Rhythm)",
      "type": "story"
    },
    {
      "by": "owjuhl",
      "descendants": 0,
      "id": 28947585,
      "score": 1,
      "time": 1634836021,
      "title": "Open-source implementation of idempotency keys in Node.js",
      "type": "story",
      "url": "https://www.medusa-commerce.com/post/open-source-implementation-of-idempotency-keys"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28947584,
      "score": 1,
      "time": 1634836013,
      "title": "Jetbrain's Qodana – More Than Just a Linter",
      "type": "story",
      "url": "https://www.i-programmer.info/news/90-tools/14958-jetbrains-qodana-more-than-just-a-linter.html"
    },
    {
      "by": "ferat",
      "descendants": 0,
      "id": 28947570,
      "score": 1,
      "time": 1634835961,
      "title": "Show HN: I built a Code Generator for Laravel/PHP",
      "type": "story",
      "url": "https://vemto.app"
    },
    {
      "by": "razin",
      "descendants": 0,
      "id": 28947558,
      "score": 9,
      "time": 1634835892,
      "title": "Beyond Smart",
      "type": "story",
      "url": "http://paulgraham.com/smart.html"
    }
  ]
}