{
  "stories": [
    {
      "by": "tropt2021",
      "descendants": 0,
      "id": 30758438,
      "score": 1,
      "time": 1647890048,
      "title": "New Tiers for Tropt Innovators Members",
      "type": "story",
      "url": "https://www.riseofprivacytech.com/troptinnovatorsmembershipprogram/"
    },
    {
      "by": "smotched",
      "descendants": 0,
      "id": 30758437,
      "score": 1,
      "time": 1647890048,
      "title": "An open source webflow alternative",
      "type": "story",
      "url": "https://github.com/webstudio-is/webstudio"
    },
    {
      "by": "logicallee",
      "descendants": 0,
      "id": 30758436,
      "score": 1,
      "text": "In these trying times where everyone reads the tea leaves for the next big thing, it is tempting to leak sources of value wherever they may be, the more valuable, the better: this is a mistake.<p>There are many reasons why people are excited to leak as much value as they can get their hands on, but I want to concentrate on just one: the tax implications.<p>At the London School of Economics, I learned to analyze annual financial reports, as well as balance sheets.  Balance sheets by companies include assets both tangible and intangible.  A company&#x27;s IP portfolio, for example, is considered an intangible asset.<p>When someone books value, they owe taxes on it.  This can be deferred for some time, there are actually historical examples of valuable insights that did not receive any market valuation until hundreds of years after their authors&#x27; deaths.<p>Da Vinci&#x27;s helicopter is such an example:<p>https:&#x2F;&#x2F;commons.wikimedia.org&#x2F;wiki&#x2F;File:Leonardo_da_Vinci_helicopter.jpg<p>Imagine if he had been forced to pay taxes on it as soon as he committed the idea to paper!  A single helicopter costs an average of about a million dollars today, and in 2019, the global helicopter market size was over 48 billion U.S. dollars. Da Vinci&#x27;s lifetime earnings were 3.75m or so.  If he had been forced to pay a reasonable tax on his invention (for example if it had been leaked), such as 30% or 40% he would have been in debtor&#x27;s prison for his entire life.<p>There would be no Mona Lisa.<p>There would be no Sistine Chapel.<p>There would be no Last Supper.<p>He probably wouldn&#x27;t have even gotten a last supper.<p>These days helicopters are on my mind because helicopter motors are one of Ukraine&#x27;s largest exports, and a key reason for Russia to want to conquer them.<p>As I think of all that value, the one thing that is on my mind is:<p>-&gt; Don&#x27;t leak value.<p>It can mean life or death for someone the world can look back on 400 years later.  Not everyone has to be Da Vinci.  You can also be famous as a sponsor, like the Medici.",
      "time": 1647890046,
      "title": "Tell HN: Don't Leak Infinite Value",
      "type": "story"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30758431,
      "score": 1,
      "time": 1647890016,
      "title": "Policy",
      "type": "story",
      "url": "http://modernescpp.com/index.php/policy-and-traits"
    },
    {
      "by": "throw2003",
      "descendants": 0,
      "id": 30758417,
      "score": 1,
      "text": "I placed an Uber Eats order that had a missing item. The item on the receipt shows up as costing 0.00, but the claimed total on the receipt is incorrect. In other words, total &gt; sum(item costs) + fees. Repeated requests for support to look at this issue have been met with generic responses of &quot;you were not charged for this item&quot;, even when sending a screenshot of a calculator showing that the total on the receipt is incorrect.<p>Does anyone have any suggestions as to how to get someone to look at this issue? This seems like a serious bug, that has potentially affected other customers as well.",
      "time": 1647889977,
      "title": "Tell/Ask HN: Uber Eats Cannot Do Math Correctly and Support Won't Acknowledge It",
      "type": "story"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30758408,
      "score": 1,
      "time": 1647889956,
      "title": "Sfinae, Immediate Context, Operator",
      "type": "story",
      "url": "https://www.cppstories.com/2022/sfinea-immediate-context/"
    },
    {
      "by": "Thomasmack",
      "descendants": 0,
      "id": 30758393,
      "score": 1,
      "text": "Hi guys,<p>i am currently trying to generate ideas for a side business. However, I am having a hard time doing so. Since they say &#x27;ideas are cheap, execution is everything&#x27; I would like to try my luck here for myself and other people who feel the same way.<p>Maybe you have some ideas&#x2F;problems you don&#x27;t want to tackle but want to see a solution for?\nGreat! Maybe you&#x27;d like to share it with us :)<p>Thanks :)",
      "time": 1647889868,
      "title": "Ask HN: What are some promising side/solo business ideas?",
      "type": "story"
    },
    {
      "by": "bmlw",
      "descendants": 0,
      "id": 30758386,
      "score": 1,
      "time": 1647889845,
      "title": "Results of 500 MicroSD Benchmarks on SBCs",
      "type": "story",
      "url": "https://bret.dk/best-raspberry-pi-micro-sd-cards/"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 30758360,
      "score": 1,
      "time": 1647889721,
      "title": "Boxed: Utility Types for Functional TypeScript",
      "type": "story",
      "url": "https://github.com/swan-io/boxed"
    },
    {
      "by": "ahmedzaidi",
      "descendants": 0,
      "id": 30758351,
      "score": 1,
      "time": 1647889689,
      "title": "I Acted Unfairly to Build a $1M Side Business (and How You Can Too)",
      "type": "story",
      "url": "https://weekdays.substack.com/p/work-smarter-not-harder"
    }
  ]
}