{
  "stories": [
    {
      "by": "trane_project",
      "descendants": 0,
      "id": 31980069,
      "score": 1,
      "text": "Hi HN,<p>I released Trane over the weekend: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane</a>. Trane is an automated\nsystem for learning complex skills. Think of it like defining a skills tree (technically a graph) of\nall the smaller skills you need to master a complex skill and having an automated system to\nautomatically traverse the graph as you master them.<p>The seed for Trane was planted after my frustration trying to learn music, and jazz in particular.\nThere are simply too many things you need to master first (e.g. knowing the names of a note, knowing\nwhere the notes are in your instrument, timing, etc) and it becomes difficult to track what it is\nthat you should focus on, and there is a process of constant atrophy, even if you practice\nconsistently.<p>Trane is an early state, but is already usable. I have released a command line interface at\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane-cli\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane-cli</a> and some music courses at\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane-music\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;trane-project&#x2F;trane-music</a>.<p>I would like to get some ideas in regard to what other skills could be a good fit for Trane. I am\nthinking chess, programming, or languages could be a fit. I am wondering if Trane could be applied\nto something like learning pure mathematics. I would love to hear any suggestions. Perhaps there&#x27;s\nsome of you who have found a similar issue while practicing your own hobbies.",
      "time": 1656957866,
      "title": "Show HN: Trane, an automated system for learning complex skills",
      "type": "story",
      "url": "https://github.com/trane-project/trane"
    },
    {
      "by": "infinitydeltax",
      "descendants": 0,
      "id": 31980068,
      "score": 1,
      "time": 1656957859,
      "title": "The Materials Project",
      "type": "story",
      "url": "https://materialsproject.org/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31980022,
      "score": 1,
      "time": 1656957611,
      "title": "Adele wants you to listen to her album in order, and Spotify agrees (2021)",
      "type": "story",
      "url": "https://www.cnn.com/2021/11/21/entertainment/adele-spotify-music-streaming-album-shuffle-scli-intl/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31980018,
      "score": 2,
      "time": 1656957603,
      "title": "Three Kids Beat Square and Translated Final Fantasy V into English (2017)",
      "type": "story",
      "url": "https://kotaku.com/how-three-kids-beat-the-odds-and-translated-final-fanta-1794628286"
    },
    {
      "by": "jmsflknr",
      "descendants": 0,
      "id": 31980001,
      "score": 1,
      "time": 1656957524,
      "title": "Crypto lender Vauld suspends withdrawals, trading and deposits",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/04/crypto-lending-platform-vauld-suspends-withdrawals-trading-and-deposits-amid-financial-challenges/"
    },
    {
      "by": "quinto_quarto",
      "descendants": 0,
      "id": 31979984,
      "score": 1,
      "text": "I made a newsletter discovery website called Inbox World. On Twitter, we share the top trending post each day on social media from across newsletters - Substack, Revue (Twitter) and Bulletin (Facebook).",
      "time": 1656957456,
      "title": "Show HN: Top trending newsletter each day from Substack",
      "type": "story",
      "url": "https://twitter.com/inboxworld"
    },
    {
      "by": "nlnn",
      "descendants": 0,
      "id": 31979983,
      "score": 2,
      "text": "I was very much into black and white SLR photography many years back, shooting manual with b&amp;w film (sometimes developing film myself, but never really enjoyed that side of it so much).<p>I&#x27;m looking to get back into it, and was looking advice on modern digital cameras and software&#x2F;workflows for b&amp;w only photography.<p>I&#x27;ve seen there are now some dedicated monochrome cameras, but they seem hideously expensive for the features, and quite a few years old now (so not sure whether they never caught on, were overpriced, or are so great they didn&#x27;t need improving).<p>Some posts I&#x27;ve read suggest using Fujifilm cameras due to some different sensor filter pattern. Others suggest shooting in color then converting to b&amp;w in software to make working with color channels easier.<p>SLRs seem to be declining a bit in favour of mirrorless cameras, but I don&#x27;t really have any experience with these to know whether they&#x27;re now good enough to fully replace SLRs.<p>It&#x27;s proving a bit tough to search for, so many search results just get me blogs&#x2F;sites filled with ads or affiliate links, so hard to know who&#x2F;what to trust. A lot of focus also seems to be on color performance, video, and autofocus, none of which I care about much (interchangeable lenses are a must though).<p>Any advice or pointers to trusted blogs&#x2F;videos&#x2F;sites etc. would be welcome - I&#x27;ve barely used any digital cameras other than my phone for quite some time.<p>FWIW part of the appeal of b&amp;w to me is its limitations, rather than just an effect to be applied to color photos I&#x27;d taken.",
      "time": 1656957454,
      "title": "Ask HN: Advice on camera for black and white only photography?",
      "type": "story"
    },
    {
      "by": "belkinsismyname",
      "descendants": 0,
      "id": 31979969,
      "score": 1,
      "text": "I will be hosting Nikola Velkovski, Co-founder &amp; CEO of Howtizer.co for an AMA session over Blkns.co<p>Nikola is a reddit platform expert. So, If you have any questions, comment below and I will make sure to ask him.",
      "time": 1656957398,
      "title": "What questions you have about Reddit?",
      "type": "story"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 31979921,
      "score": 1,
      "time": 1656957183,
      "title": "Man with rare cancer given 6 months to live save by first-of-its-kind transplant",
      "type": "story",
      "url": "https://news.yahoo.com/man-rare-cancer-given-6-121608674.html"
    },
    {
      "by": "Gabriel_h",
      "descendants": 0,
      "id": 31979911,
      "score": 1,
      "time": 1656957127,
      "title": "How to Prevent JavaScript TypeErrors",
      "type": "story",
      "url": "https://meticulous.ai/blog/javascript-typeerrors-and-techniques-to-prevent-them/"
    }
  ]
}