{
  "stories": [
    {
      "by": "kerblang",
      "descendants": 0,
      "id": 31756035,
      "score": 1,
      "time": 1655313000,
      "title": "The housing market ‘correction’ intensifies as layoffs hit Redfin and Compass",
      "type": "story",
      "url": "https://fortune.com/2022/06/14/housing-market-correction-prices-mortgage-rates-interactive-map/"
    },
    {
      "by": "vfclists",
      "descendants": 0,
      "id": 31756033,
      "score": 1,
      "text": "The energy policy of the day is to rely on &quot;clean, sustainable&quot; which means solar, wind and wave power all of which depend on weather conditions.<p>On the other hand we are being warned about possible freak weather conditions in the future, such as severe storms which could seriously damage solar, wind and wave installations. If climate change entails such severe occurrences in the future, how sensible is then to put most of our eggs in the clean energy basket?<p>A major volcanic eruption or explosion might spread so much dust in the sky as to reduce solar energy output, such as the 1815 explosion of Mount Tambora, which also resulted in freak weather conditions and famines.<p>On a smaller scale for instance, in the UK for instance wind turbines have had to shut down in strong winds.<p>Hydro-electric power stations have proved in adequate in long periods of drought.<p>My view is that extreme weather conditions require even greater energy consumption to defend and maintain living conditions, such as air conditioning in long periods of extreme heat, heating in long periods of extreme cold, or rebuilding city environments to cope with these extremes, and thus depending on the uncertain atmospheric conditions to provide the energy to cope with the very same uncertain atmospheric conditions just isn&#x27;t wise.<p>Are policy makers truly exercising wisdom with this outlook?",
      "time": 1655312996,
      "title": "Ask HN: Is reliance on “clean energy” wise in uncertain enviromental conditions?",
      "type": "story"
    },
    {
      "by": "mmazzarolo",
      "descendants": 0,
      "id": 31756031,
      "score": 1,
      "time": 1655312991,
      "title": "How Layoffs Work: Behind the Scenes/AMA",
      "type": "story",
      "url": "https://www.teamblind.com/post/How-Layoffs-Work-Behind-the-scenesAMA-6CfRQ7RA"
    },
    {
      "by": "O__________O",
      "descendants": 0,
      "id": 31756024,
      "score": 1,
      "time": 1655312949,
      "title": "Smart Contracts (1994)",
      "type": "story",
      "url": "https://www.fon.hum.uva.nl/rob/Courses/InformationInSpeech/CDROM/Literature/LOTwinterschool2006/szabo.best.vwh.net/smart.contracts.html"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 31756005,
      "score": 1,
      "time": 1655312879,
      "title": "CogView2: A 24 billion parameter text-to-image generation model",
      "type": "story",
      "url": "https://github.com/THUDM/CogView2"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31755999,
      "score": 1,
      "time": 1655312856,
      "title": "Senator Warren proposes sweeping ban on location and health data sales",
      "type": "story",
      "url": "https://www.theverge.com/2022/6/15/23169718/roe-wade-elizabeth-warren-location-data-tracking-ban-sale-brokers"
    },
    {
      "by": "arjunpatel1026",
      "descendants": 0,
      "id": 31755997,
      "score": 1,
      "text": "I wanted to share a side project I&#x27;ve been working on for the past few months, Wood Elf Wine. It&#x27;s a 4-month wine subscription that takes you on a digital quest. If you like wine, Dungeons &amp; Dragons, or just a fun mystery game, check out the pre-sale at woodelfwine.com<p>Here&#x27;s a secret hackernews discount if you wanted to try: FRIENDOFVIRTUE<p>Whether you want to subscribe or not, would love any feedback on the project!",
      "time": 1655312846,
      "title": "Side project that combines wine, Dungeons and Dragons, fun mystery game",
      "type": "story"
    },
    {
      "by": "hastes",
      "descendants": 0,
      "id": 31755987,
      "score": 1,
      "time": 1655312809,
      "title": "Ask HN: What are you using for browser/Electron databases?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 31755967,
      "score": 1,
      "time": 1655312733,
      "title": "In Western Australia, your mountain bike is breaking the law",
      "type": "story",
      "url": "https://cyclingtips.com/2022/06/in-western-australia-your-mountain-bike-is-breaking-the-law/"
    },
    {
      "by": "ciconia",
      "descendants": 1,
      "id": 31755960,
      "kids": [
        31755974
      ],
      "score": 2,
      "time": 1655312724,
      "title": "Memo: Release of CO2 and the Possibility of a Catastrophic Climate Change (1977) [pdf]",
      "type": "story",
      "url": "https://uploads.guim.co.uk/2022/06/02/SSO_148878_031_07.pdf"
    }
  ]
}