{
  "stories": [
    null,
    {
      "by": "susiecambria",
      "descendants": 0,
      "id": 29565145,
      "score": 1,
      "time": 1639571918,
      "title": "AmazonSmile donated more than $40k to anti-vaccine groups in 2020",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/dec/15/amazonsmile-donations-anti-vaccine-groups"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 29565140,
      "score": 1,
      "time": 1639571889,
      "title": "US Navy fires laser weapon in Mideast amid drone boat threat",
      "type": "story",
      "url": "https://apnews.com/article/middle-east-iran-dubai-united-arab-emirates-yemen-15630a25f448cb6100818286bc9c9de5"
    },
    {
      "by": "iamjbn",
      "descendants": 0,
      "id": 29565102,
      "score": 1,
      "time": 1639571621,
      "title": "The brand-new struggles of a millennial who grew up with the Open Web",
      "type": "story",
      "url": "https://medium.com/@josejubin/the-brand-new-struggles-of-a-millennial-who-grew-up-with-the-open-web-the-story-of-aquila-network-4f85dbb8b332"
    },
    {
      "by": "throwawaybbqed",
      "descendants": 0,
      "id": 29565038,
      "score": 1,
      "text": "I&#x27;m looking for a tool that surely exists but I can&#x27;t seem to find it. I have thousands of small video files, and I&#x27;d like to process each one independently across a cluster. The processing can defn benefit from GPU for some parts of the workload (e.g. object detection); it is all pytorch code. Ideally, would like to use cloud computing for this (so EKS would be preferable but can also spin up machines and setup slurm, etc. if need be). I&#x27;ve looked into GNU Parallel, Dask and PySpark. I&#x27;m a bit frustrated that most examples assume you have numpy arrays&#x2F;csvs at the start .. surely there exists a tool that deals with this at the &quot;files&quot; and &quot;scripts&quot; level? I feel the closest match I have seen is Hadoop but again, one where I can chain scripts together.",
      "time": 1639571205,
      "title": "Ask HN: Tool for doing embarrassingly parallel processing on cluster",
      "type": "story"
    },
    {
      "by": "patrickyammouni",
      "descendants": 1,
      "id": 29565027,
      "kids": [
        29565028
      ],
      "score": 1,
      "time": 1639571162,
      "title": "Clanica",
      "type": "story",
      "url": "https://clanica.com/"
    },
    {
      "by": "b-man",
      "descendants": 0,
      "id": 29565008,
      "score": 5,
      "time": 1639571083,
      "title": "Functional Programming as a Competitive Advantage – A Real-World Use-Case",
      "type": "story",
      "url": "https://medium.com/datarisk-io/why-we-choose-functional-programming-59bdb95ed78b"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 29564990,
      "score": 1,
      "time": 1639571009,
      "title": "NYC’s Gas Ban Takes Fight Against Climate Change to the Kitchen",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/15/nyregion/nyc-gas-stove-heat-ban.html"
    },
    {
      "by": "Liriel",
      "descendants": 0,
      "id": 29564979,
      "score": 1,
      "time": 1639570968,
      "title": "What's New in Rails 7",
      "type": "story",
      "url": "https://blog.appsignal.com/2021/12/15/whats-new-in-rails7.html"
    },
    {
      "by": "markozivanovic",
      "descendants": 0,
      "id": 29564976,
      "score": 1,
      "text": "There are many reasons why people downvote comments&#x2F;posts in any community - be it HN, Reddit, Facebook, etc. I would be thankful if you could explain your reasoning for downvoting the comments when you choose to do so.<p>For example, I&#x27;ll sometimes see a massively downvoted comment that&#x27;s constructive and beautifully written, but it carries an opinion that is not currently popular for whatever reason.<p>I believe that downvoting someone just because you disagree with them is terrible for a discussion network like HN. Moreover, I would say that I learned the most from the comments that I disagreed with - on all levels, politically, technologically, personally.<p>I will downvote a comment if it&#x27;s not constructive, only written to be provocative, etc. It doesn&#x27;t matter if I agree with the author&#x27;s opinion or not. If someone puts in the effort to explain their opinion politely and constructively, my thinking is that it&#x27;s positive for all the people in the community.<p>So, what kind of a downvoter are you? What are some of your reasons for downvoting a comment?",
      "time": 1639570954,
      "title": "Ask HN: What kind of a downvoter are you?",
      "type": "story"
    }
  ]
}