{
  "stories": [
    {
      "by": "SQL2219",
      "descendants": 0,
      "id": 28373454,
      "score": 1,
      "time": 1630442905,
      "title": "Chicago Schools talking to Lyft/Uber after bus drivers quit over vaccine mandate",
      "type": "story",
      "url": "https://chicago.suntimes.com/education/2021/8/30/22648862/cps-school-bus-driver-vaccine-mandate-uber-lyft-lightfoot-public-schools"
    },
    {
      "by": "MBCook",
      "descendants": 0,
      "id": 28373432,
      "score": 1,
      "time": 1630442822,
      "title": "Google Messages and RCS weren’t ready for the complications of Hurricane Ida",
      "type": "story",
      "url": "https://9to5google.com/2021/08/31/opinion-google-messages-rcs-hurricane-ida-complications/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 28373429,
      "score": 2,
      "time": 1630442815,
      "title": "Vim with Me: Nick Nisi",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=W9Bd0FmKgMI"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 28373412,
      "score": 1,
      "time": 1630442757,
      "title": "A Single Alcoholic Drink Immediately Increases Risk of Heart Dysfunction",
      "type": "story",
      "url": "https://futurism.com/alcoholic-drink-increases-risk-heart-dysfunction"
    },
    {
      "by": "fspacef",
      "descendants": 0,
      "id": 28373411,
      "score": 2,
      "time": 1630442752,
      "title": "Aaron Swartz",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Aaron_Swartz"
    },
    {
      "by": "jsgc",
      "descendants": 0,
      "id": 28373409,
      "score": 1,
      "text": "I&#x27;ve been thinking about this for a long time, and it may be time to post about it.  \nYou enter your house, and since you insert the key, turn on the light, turn on the radio, activate the induction or the microwave, play some instrument or just open the refrigerator or use the hot water or turn on the computer, there are endless technologies that you are using without knowing in many cases not even the minimum basis of its operation.  \nI have a real belief that most of the society understands that the functionality is not magical, but resigns itself to it by being unable or lazy to investigate about. It is the paradox of today.  \nI open a mobile application, and it asks me if I like its design, if I think it is useful. It asks me almost ironically to improve it. How would ever I be able to inherit something that I totally ignore. Just asking for more tricks.   \nAnd I can imagine endless humans living in a magical world and easily or randomly giving the worst of opinions, shacking and blaming the most advanced technologies when they ignore to the bone the amount of work that every minimal development involved. The same thing happens to everything, it is the society of the ignorant-with-opinion, a society of don&#x27;t care about how it works, just use it and waste it, of the one who does not care to know how but wants it done. \nI would like to propose a game to these people.  \nI would like you to imagine that you travel to the past, with what invention would you get rich? Do you know how to make a simple lighter or a pen? Try to design the wiring so that a light bulb has two interrupters in the same room. How would you make the paint for your walls? Do you know how a cistern works or where this water goes? The society of the future is to a great extent the same that lived in caves, believing in magic and praying to fire.   \nWe are simply close to give a hummer to a monkey and watch it knocks with.   \nTechnological philosophy is the philosophy that fits today, we kill gods and morality, we leave society on the sidelines, endless theories of politics and psychology. But the basis of human development continues to be wondering how what surrounds you works.",
      "time": 1630442738,
      "title": "The Magic Resigned Society",
      "type": "story"
    },
    {
      "by": "yasp",
      "descendants": 0,
      "id": 28373395,
      "score": 1,
      "time": 1630442669,
      "title": "Encyclosphere: Universal Network of Encyclopedias",
      "type": "story",
      "url": "https://encyclosphere.org/"
    },
    {
      "by": "elliekelly",
      "descendants": 0,
      "id": 28373375,
      "score": 1,
      "time": 1630442566,
      "title": "Fake Banksy NFT sold through Banksy's website for £244k",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-58399338"
    },
    {
      "by": "gpvos",
      "descendants": 0,
      "id": 28373372,
      "score": 1,
      "time": 1630442556,
      "title": "Mary's Room: is a physical world all there is?",
      "type": "story",
      "url": "https://bigthink.com/mind-brain/inside-marys-room-physical-world"
    },
    {
      "by": "st_goliath",
      "descendants": 0,
      "id": 28373358,
      "score": 2,
      "time": 1630442496,
      "title": "FSF copyright handling: A basis for distribution, licensing and enforcement",
      "type": "story",
      "url": "https://www.fsf.org/blogs/licensing/FSF-copyright-handling"
    }
  ]
}