{
  "stories": [
    {
      "by": "turtlegrids",
      "descendants": 0,
      "id": 31708195,
      "score": 1,
      "time": 1654980257,
      "title": "Why Most LED Headlight Upgrades Don't Work: An Expert Explains (2020)",
      "type": "story",
      "url": "https://jalopnik.com/why-most-led-headlight-upgrades-dont-really-work-an-ex-1843070472"
    },
    {
      "by": "net_",
      "descendants": 1,
      "id": 31708169,
      "kids": [
        31708171
      ],
      "score": 1,
      "time": 1654980094,
      "title": "Show HN: The Amalgam Engine – Easily create isometric virtual worlds",
      "type": "story",
      "url": "https://github.com/Net5F/AmalgamEngine"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31708157,
      "score": 1,
      "time": 1654980022,
      "title": "Samsung owns up to mistake after using iPhone photos in promotion",
      "type": "story",
      "url": "https://www.androidauthority.com/samsung-iphone-promotion-mistake-3174990/"
    },
    {
      "by": "wearetableduck",
      "descendants": 0,
      "id": 31708153,
      "score": 1,
      "text": "As a small business owner, you&#x27;re working hard to grow your business. Good customer service is key to the success of your company. You&#x27;re providing help and support to your beloved customers by e.g. phone or email, but it&#x27;s time consuming and repetitive work.\nCustomer service software can make your life easier and helps you grow your business. Here are 3 tips to select the best customer service software for your business.\nTip 1: One inbox for all your channels\nCustomers want to connect with you via their preferred communication channel. One wants to send you an email, another wants to connect with you via live chat and another one wants to do that via Facebook Messenger.\nIf you want to provide really good customer service, you go for a multi channel approach and offer as many customer service channels as possible. However, managing 5 or more different communication channels can be very challenging. Good customer service software helps you manage multiple customer service channels and works with one inbox for all your channels.\nTip 2: Automation is key to handle customer service, but don&#x27;t forget the human touch\nSometimes replying to customers can be overwhelming. When getting hundreds of requests per day, it feels like you&#x27;re only answering customer questions and you don&#x27;t have time for other parts of your business.\nAutomation is key here. Chatbots can answer most common questions for you. But chatbots can also feel very robotic and not very friendly. Therefore there are also chatbots that use Artificial Intelligence (AI) and Natural Language Processing (NLP) to understand natural, human written text and be more human-like.\nDespite their advanced technology, a chatbot can not understand everything. Chatbots should be able to hand over the conversation to a human being when necessary.\nGood customer service software allows you to automate conversations but also is able to hand over conversations to a human being.\nTip 3: Go for easy, non time consuming customer service software\nSetting up customer service software, especially with automation can be time consuming. Building a chatbot from scratch is costly and requires coding skills.\nThere are DIY chatbot builder solutions but with these solutions you often can only create simple, very robotics flows. That&#x27;s exactly what you don&#x27;t want to offer to your beloved customers.\nAs mentioned before, NLP is the way to make chatbots more intuitive and human-like. However, a NLP engine needs to be trained continuously to improve and understand language better. Good customer service software does the NLP training for you and allows you to easily set up a human-like chatbot without coding skills or without having to train the NLP.",
      "time": 1654980008,
      "title": "Tips to select the best customer service software for your business",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31708152,
      "score": 1,
      "time": 1654980005,
      "title": "Gone in 130 seconds: New Tesla hack gives thieves their own personal key",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/06/hackers-out-to-steal-a-tesla-can-create-their-very-own-personal-key/"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 31708141,
      "score": 1,
      "time": 1654979957,
      "title": "Did Google App Store replace permissions list with meaningless data safety page?",
      "type": "story",
      "url": "https://slashdot.org/submission/16113842/google-app-store-replaces-permissions-list-with-meaningless-data-safety-page"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 31708131,
      "score": 1,
      "time": 1654979893,
      "title": "Architecture of Consoles",
      "type": "story",
      "url": "https://www.copetti.org/writings/consoles/"
    },
    {
      "by": "hintymad",
      "descendants": 1,
      "id": 31708107,
      "kids": [
        31708109
      ],
      "score": 1,
      "time": 1654979749,
      "title": "Coding Challenge",
      "type": "story",
      "url": "https://www.beust.com/weblog/coding-challenge/"
    },
    {
      "by": "mplanchard",
      "descendants": 0,
      "id": 31708090,
      "score": 1,
      "time": 1654979645,
      "title": "The Smile: A History",
      "type": "story",
      "url": "https://aeon.co/essays/a-history-of-the-smile-through-art-culture-and-etiquette"
    },
    {
      "by": "enricotal",
      "descendants": 0,
      "id": 31708077,
      "score": 2,
      "time": 1654979588,
      "title": "Cloned crayfish accidentally created in an aquarium are conquering the world",
      "type": "story",
      "url": "https://www.syfy.com/syfy-wire/marbled-crayfish-born-in-aquarium-is-spreading-over-earth"
    }
  ]
}