{
  "stories": [
    {
      "by": "apollinaire",
      "descendants": 0,
      "id": 31274376,
      "score": 1,
      "time": 1651763538,
      "title": "Petrified Waters: The Artificial Grottoes of the Renaissance and Beyond",
      "type": "story",
      "url": "https://publicdomainreview.org/essay/petrified-waters/"
    },
    {
      "by": "domador",
      "descendants": 0,
      "id": 31274369,
      "score": 1,
      "text": "Google Workspace will soon replace duplicate files in Drive with &quot;shortcuts&quot;, which to me sound like hard links. \n (I just received a specific announcement with a date in the near future for a Google-Workspace-linked domain I manage.)  While this could be a helpful, space-saving move for Google, I wonder if it could facilitate accidental, undesired editing of original files in Drive, in instances when one wants to edit a copy of a file but not the original.  Personally, I often duplicate files in order to start a new project, or to create a new document inspired on an original.  The new project or documented should be handled separately from the original, and edits to the new documents should not affect the originals at all.  Yet this is what I fear might happen with Google Workspace&#x27;s upcoming migration to shortcuts.  Maybe this won&#x27;t be a risk to new projects created after Google first deduplicates one&#x27;s files but it sounds like it could be a risk for active, existing projects after deduplication.<p>I don&#x27;t know whether I&#x27;m correctly understanding what Google will do with shortcuts but I&#x27;d appreciate clarification from anyone who has deeper understanding of this upcoming change.  My own understanding is based on the following Google documents:<p>https:&#x2F;&#x2F;workspaceupdates.googleblog.com&#x2F;2021&#x2F;12&#x2F;timeline-update-for-migration-of-multi-location-drive-files.html<p>https:&#x2F;&#x2F;workspaceupdates.googleblog.com&#x2F;2020&#x2F;08&#x2F;expanding-shortcuts-google-drive.html<p>https:&#x2F;&#x2F;support.google.com&#x2F;a&#x2F;answer&#x2F;10686746<p>https:&#x2F;&#x2F;support.google.com&#x2F;drive&#x2F;answer&#x2F;10864219",
      "time": 1651763478,
      "title": "Ask HN: Will Google Workspace move to shortcuts lead to unwanted file edits?",
      "type": "story"
    },
    {
      "by": "Ymoreno",
      "descendants": 0,
      "id": 31274362,
      "score": 1,
      "time": 1651763452,
      "title": "Take your EDA to the next level with PPs quick data analysis",
      "type": "story",
      "url": "https://github.com/ydataai/pandas-profiling"
    },
    {
      "by": "sitehunter",
      "descendants": 0,
      "id": 31274358,
      "score": 1,
      "text": "[img]https:&#x2F;&#x2F;i.imgur.com&#x2F;IrRuYZR.png[&#x2F;img]<p>+ Multithreading\n+ Parsis from all pages<p>+ friends with Russian<p>- Proxy only Socks4 (mb finished then)<p>Extracted links are stored in the program DuckDuckGourls<p>VirusTotal:\nhttps:&#x2F;&#x2F;www.virustotal.com&#x2F;gui&#x2F;file&#x2F;fec5435d84f71af219bf5d9e47ad6411474e1ad455dde0b86b48ab597e7a8a38&#x2F;detection<p>Link download:\nhttps:&#x2F;&#x2F;bit.ly&#x2F;3FexCn3<p>Password WinRAR = 1",
      "time": 1651763429,
      "title": "DuckDuckGo URL Parser by triblekill 2.0",
      "type": "story"
    },
    {
      "by": "efficientsticks",
      "descendants": 0,
      "id": 31274344,
      "score": 1,
      "text": "Hi HN,<p>I’ve been developing my own take on a web search engine for about six months.<p>I’ve crawled just a few pages each from about 10 million websites each at the moment, but only the most lightweight websites are included as of this moment.<p>I’m keen to hear what you make of this, and what you want to see next.<p>Cheers,\nAli",
      "time": 1651763353,
      "title": "Show HN: High Browse, esoteric web search (alpha quality)",
      "type": "story",
      "url": "https://highbrow.se/"
    },
    {
      "by": "galoisscobi",
      "descendants": 0,
      "id": 31274330,
      "score": 2,
      "time": 1651763278,
      "title": "Signals That Drive Us",
      "type": "story",
      "url": "https://37signals.com/00"
    },
    {
      "by": "_bramses",
      "descendants": 0,
      "id": 31274331,
      "score": 1,
      "time": 1651763278,
      "title": "Hey DALL-E, Finish the Cat Drawing",
      "type": "story",
      "url": "https://www.bramadams.dev/projects/finish-the-cat-picture"
    },
    {
      "by": "sph",
      "descendants": 0,
      "id": 31274315,
      "score": 1,
      "time": 1651763183,
      "title": "We're breaking up with JavaScript front ends (2016)",
      "type": "story",
      "url": "http://triskweline.de/unpoly-rugb/#/"
    },
    {
      "by": "hWZhfIxSiA",
      "descendants": 0,
      "id": 31274308,
      "score": 1,
      "time": 1651763142,
      "title": "My brother is learning JavaScript and made this game (desktop only)",
      "type": "story",
      "url": "http://digitle.io/"
    },
    {
      "by": "blockwriter",
      "descendants": 0,
      "id": 31274299,
      "score": 1,
      "text": "I started coding about two years ago because I planned to open a coffeeshop and bookstore and wanted to think about management from first principles by coding a management system. I then started coding a web application to augment the process of reading, writing, publishing and distributing literature, which is my primary occupation. Both projects have come together nicely. I find that they are both truly useful, and I am starting to consider them largely complete. I am endeavoring to hire my first full stack developer to take over and improve upon these two projects, but I feel at a loss in the meantime about what to code next.<p>Does anyone have a suggestion? I want to code for roughly one hour a day going forward. I enjoy having projects feed into one another meaningfully. For example: I have set up a system to automatically get the metadata of a comic book, automatically price it, image the book, and list the book, so that all that is required of me is to scan the barcode. With this, and offering comics for sale at the coffeeshop, I should be able to acquire collections fairly readily from patrons. The finances of the various operations are all logged in a manner that allows for comprehensive reports to be made of them individually and in concert. My initial thought is to make work on robust graphing functionality so that I am presented with an overview of various metrics related to these project when I wake up in the morning. I can use pyplot, but not expertly. My other thought is to develop some kind of game that is part and parcel with being a regular at a coffeeshop. Below is a brief, non-exhaustive overview of the languages, the services, and the like that I have used so far.<p>-Python\n-Flask\n-Javascript\n-HTML\n-AWS EC2\n-AWS RDS\n-AWS S3\n-MySQL\n-Stripe\n-Web-scraping\n-Raspberry Pi<p>P.S. Are there any full-stack developers in Chicago, Illinois, or nearby states looking for a job?",
      "time": 1651763110,
      "title": "Ask HN: What do I code next?",
      "type": "story"
    }
  ]
}