{
  "stories": [
    {
      "by": "steveneo",
      "descendants": 1,
      "id": 31774259,
      "kids": [
        31774268
      ],
      "score": 1,
      "text": "We launched https:&#x2F;&#x2F;formcan.com, a web form builder. Many people&#x27;s first reaction is, oh, another form builder, reinventing the wheel. The truth is, we&#x27;ve been running https:&#x2F;&#x2F;platoforms.com, a SaaS product that converts PDFs to online forms, for 5 years, so rather than build FormCan from scratch, we got a lot of ideas while running PlatoForms and reused a lot of code when building FormCan. This is how we created FormCan.<p>One of the highlights is the pricing model, most form builder SaaS use a fixed pricing plan. We thought a &#x27;pay as you go&#x27; model would make more sense for our customers, so FormCan will pay as you use it and the bill is based on usage. Prices range from $6 to $36, depending on the number of forms a user uses.  However, I’ve received some feedback that this payment method is too complicated and that they prefer a fixed pricing plan. So my question is, what is the best pricing model for SaaS, PAGY or a fixed pricing plan? Would you accept PAGY for a form builder product?",
      "time": 1655441602,
      "title": "Ash HN: SaaS Pricing mode, PAYG or Fixed pricing plan",
      "type": "story"
    },
    {
      "by": "salford",
      "descendants": 0,
      "id": 31774219,
      "score": 1,
      "time": 1655441092,
      "title": "The 1950s Medicine and Health: Topics in the News",
      "type": "story",
      "url": "https://www.encyclopedia.com/social-sciences/culture-magazines/1950s-medicine-and-health-topics-news"
    },
    {
      "by": "llampx",
      "descendants": 0,
      "id": 31774218,
      "score": 1,
      "text": "The S&amp;P 500 went below 2021 lows yesterday. Do you think we&#x27;re in for a time of falling stock prices or will we get back to all-time highs soon like it has been happening for the last ~12 years?",
      "time": 1655441091,
      "title": "Ask HN: Is this a bear market for stocks or a correction?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 31774215,
      "score": 2,
      "time": 1655441077,
      "title": "On Lake Superior, a $1B eco-disaster is swallowing the coast",
      "type": "story",
      "url": "https://www.mlive.com/public-interest/2022/06/on-lake-superior-a-1-billion-eco-disaster-is-swallowing-the-coast.html"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 31774211,
      "score": 1,
      "time": 1655441035,
      "title": "More Oxide at Home: My Pi Is a Wireless Crucible",
      "type": "story",
      "url": "https://artemis.sh/2022/06/14/oxide-crucible.html"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31774190,
      "score": 1,
      "time": 1655440807,
      "title": "A Persistent Rope in Go",
      "type": "story",
      "url": "https://github.com/deadpixi/rope"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 31774170,
      "score": 2,
      "time": 1655440618,
      "title": "Why Is AVX 512 Useful for RPCS3?",
      "type": "story",
      "url": "https://whatcookie.github.io/posts/why-is-avx-512-useful-for-rpcs3/"
    },
    {
      "by": "saikatsg",
      "descendants": 0,
      "id": 31774109,
      "score": 1,
      "time": 1655439971,
      "title": "RBI lifts restrictions on MasterCard over onboarding new customers",
      "type": "story",
      "url": "https://www.business-standard.com/article/finance/rbi-lifts-restrictions-related-to-on-boarding-new-customers-on-mastercard-122061600884_1.html"
    },
    {
      "by": "tannershmoog",
      "descendants": 5,
      "id": 31774094,
      "kids": [
        31774169,
        31774121,
        31774202
      ],
      "score": 3,
      "text": "Hi, I&#x27;m a fresh graduate with a BSc in Comp sci, and I am wondering how reasonable the project I&#x27;m considering taking on as a commission is. I&#x27;m a relatively experienced programmer, but newish to web development.<p>The project is a simple ecommerce site:<p>-A couple of static pages<p>-A product listing, and the ability to add to a cart with various custom options&#x2F;dropdowns<p>-Ability to edit cart<p>-Ability to place order for delivery or pickup<p>-Process payment using stripe.<p>No shipping, no need to worry about stock, as it is a food establishment. It seems pretty doable to me but Im worried about wasting the client&#x27;s time, so I would like some input on how reasonable this would be for me to build in Django and React.<p>I don&#x27;t need perfection, both I and the client will be satisfied with something that loads fast, looks nice, and doesn&#x27;t lose orders. Though I have also found it difficult to research common pitfalls building such a site, as all I get are results related to the marketing side of ecommerce. Thoughts?",
      "time": 1655439710,
      "title": "Ask HN: Reasonable scope for a beginner web dev?",
      "type": "story"
    },
    {
      "by": "ecliptik",
      "descendants": 0,
      "id": 31774063,
      "score": 1,
      "time": 1655439357,
      "title": "Quantifying the Effects of Working in VR for One Week",
      "type": "story",
      "url": "https://arxiv.org/abs/2206.03189"
    }
  ]
}