{
  "stories": [
    {
      "by": "mbastos",
      "descendants": 0,
      "id": 31681268,
      "score": 1,
      "time": 1654783491,
      "title": "A Big Look at Security in OpenAPI",
      "type": "story",
      "url": "https://liblab.com/blog/a-big-look-at-security-in-openapi"
    },
    {
      "by": "mbastos",
      "descendants": 0,
      "id": 31681256,
      "score": 1,
      "time": 1654783447,
      "title": "Accruing Technical Assets vs. Paying Off Technical Debt",
      "type": "story",
      "url": "https://liblab.com/blog/accruing-technical-assets-vs-paying-off-technical-debt"
    },
    {
      "by": "cosmic_quanta",
      "descendants": 0,
      "id": 31681251,
      "score": 1,
      "time": 1654783401,
      "title": "The appeal of bidirectional type-checking",
      "type": "story",
      "url": "https://www.haskellforall.com/2022/06/the-appeal-of-bidirectional-type.html"
    },
    {
      "by": "ssivark",
      "descendants": 0,
      "id": 31681237,
      "score": 1,
      "time": 1654783341,
      "title": "YouTube deleted channel and erased whole lecture series",
      "type": "story",
      "url": "https://twitter.com/bryanvannorden/status/1534520346560323585"
    },
    {
      "by": "mr_gibbins",
      "descendants": 0,
      "id": 31681234,
      "score": 1,
      "text": "Much as the title says, I really miss the Usenet days where I could contribute to a bulletin board-style forum on hyper-specific subjects.<p>If I remember my computing history correctly, Google ended up acquiring and eating Usenet, becoming Google Groups.  I&#x27;m not sure if this is dead yet.<p>Arguably, Reddit fills some of this niche, but Usenet was tech-focused, generally quite professional and frankly didn&#x27;t have the same clientele as Reddit does.<p>HN is topic-focused, rather than subject-focused.<p>Would be very interested to see if there&#x27;s any Usenet-style project that&#x27;s still alive.",
      "time": 1654783329,
      "title": "Ask HN: I miss Usenet. Are there any modern equivalents?",
      "type": "story"
    },
    {
      "by": "survirtual",
      "descendants": 0,
      "id": 31681221,
      "score": 1,
      "text": "I am bringing this to your attention because, if nothing else, I find it to be an interesting and thought provoking situation, and if any group could realistically do something about these kinds of problems (my case not withstanding), it’s you all.<p>I am trying to access an email from my early twenties for nostalgia and archival purposes, and I know my username and password but the old email I used for recovery is with a now defunct provider.  I attempted to purchase the domain of that provider, but it’s registered to a domain reseller and I offered up to $200 with no response, and even that amount seemed absurd to me.<p>Following all of Google’s docs, I saw there was no avenue via Google to access the account without that recovery email.  There more I thought on it, the more it seems like a policy that fails a smell test of human decency. Here is an exchange I am having on the Google community page:<p>https:&#x2F;&#x2F;support.google.com&#x2F;accounts&#x2F;thread&#x2F;166498610?hl=en<p>Interestingly enough, a prime reason I am trying to access this email is to complete my process of “De-Googling” (if you are interested, I can tell you about this experience; I am near completely degoogled now and have a nice, secure alternative in place)  I want to archive all my Google data to my own servers, then remove the data from Google.   Getting access to these loose ends gives me closure and peace of mind.  I find it scary that a third party can have access to information about me, in this case thousands upon thousands of lines of my writing and exchanges, then simultaneously deny my access — even when I have all the authentication methods required when the initial “contract” of use was established.<p>I think all of us need to take a bit more care when it comes to user data.  These are more than just products and services; these are people’s memories.  People with wants, needs, joys, fears, and a whole range of experiences.  Technology and processes should do their best to offer value while minimizing suffering invoked.  They should augment the human condition, not diminish in.  In a case like mine — which is uncommon but not unprecedented — I entrusted a service believing I would have access to it with a username and password.  I had an understanding ofthe risk profile with that and was okay without 2fa.  The provider changed the contract without my consent and in doing so, has cut away my memories offloaded from my brain to their service.  There is something here that feels really wrong.<p>Sidenote:<p>If this seems complainy or ranty, I apologize to your senses.  I don&#x27;t  see it that way; if I did, I would not be posting.  If you do feel that way, I&#x27;d like to know and have a conversation about it, and I would like to know your opinion on methods to properly talk about these kinds of issues in tech.",
      "time": 1654783277,
      "title": "Ask HN: Google claims impossible to access my email I have password to. Is it?",
      "type": "story"
    },
    {
      "by": "MrsPeaches",
      "descendants": 0,
      "id": 31681215,
      "score": 2,
      "text": "Hi HN!<p>I have a friend who went to a university in a developing country and is now struggling to get a place on a masters programme in western universities.<p>They completed a bachelors in physics at their country&#x27;s top university, got pretty much straight A&#x27;s and is generally very bright but is now being rejected by masters programmes in western universities, because the universities deem my friends qualifications to be below the required standard.<p>Is there any way in which they can help make clear that they are smart enough to get in?!<p>The other option they have is to study for a masters at the same university where they did their bachelors and then it might be enough to get into a master programme at a western university (but even then students have been rejected as their qualifications are deemed second rate).<p>It just seems really unfair when they are so obviously bright!",
      "time": 1654783230,
      "title": "Ask HN: Rejected from masters programmes because of university reputation",
      "type": "story"
    },
    {
      "by": "iply",
      "descendants": 0,
      "id": 31681208,
      "score": 1,
      "text": "I am currently falling out of love with university. I managed to get into the best university in my region with the hope of learning, meeting interesting people, and working on things that matter.<p>I am frustrated with the way things have turned out. The things I do in college don&#x27;t excite me and people are extremely close minded. University currently feels like a waste of time. I enjoy my time working on side coding projects a lot more. University just seems to get in the way of the learning I truly care about and the tasks that I consider important.<p>I&#x27;m curious to hear about dropout stories here, since there seems to be a lot of survivorship bias from people online.<p>I want to hear all about it. Good and bad.",
      "time": 1654783183,
      "title": "Ask HN: What is your college dropout story / roadmap?",
      "type": "story"
    },
    {
      "by": "rvcdbn",
      "descendants": 0,
      "id": 31681195,
      "score": 1,
      "text": "Is there a public Slack or Discord for asking questions about common developer tools e.g. programming language, build tools, troubleshooting etc. ?<p>We have a few of these at work but almost none of the discussion is specific to our company and could easily be happening in public.<p>Seems a shame to be having all these conversations in private unnecessarily, when we could all be benefiting from shared knowledge.",
      "time": 1654783111,
      "title": "Ask HN: public Slack/Discord for developer tooling?",
      "type": "story"
    },
    {
      "by": "trymas",
      "descendants": 0,
      "id": 31681169,
      "score": 1,
      "time": 1654782943,
      "title": "Screeps – MMO strategy sandbox game for programmers",
      "type": "story",
      "url": "https://screeps.com/"
    }
  ]
}