{
  "stories": [
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31643486,
      "score": 1,
      "time": 1654537755,
      "title": "Microsoft Follina Vulnerability in Windows Can Be Exploited Through Office 365",
      "type": "story",
      "url": "https://www.wired.com/story/microsoft-follina-vulnerability-windows-office-365/"
    },
    {
      "by": "metadat",
      "descendants": 1,
      "id": 31643465,
      "kids": [
        31643474
      ],
      "score": 2,
      "time": 1654537667,
      "title": "Google Is Liable for Defamatory Videos Targeting Lawmaker, Court Rules",
      "type": "story",
      "url": "https://www.wsj.com/articles/google-is-liable-for-defamatory-videos-targeting-lawmaker-court-rules-11654504866"
    },
    {
      "by": "runesoerensen",
      "descendants": 0,
      "id": 31643447,
      "score": 1,
      "time": 1654537592,
      "title": "New ways to share and communicate in iOS 16",
      "type": "story",
      "url": "https://www.apple.com/newsroom/2022/06/apple-unveils-new-ways-to-share-and-communicate-in-ios-16/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31643438,
      "score": 2,
      "time": 1654537560,
      "title": "Arm A-Profile Architecture Developments 2021",
      "type": "story",
      "url": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/posts/arm-a-profile-architecture-developments-2021"
    },
    {
      "by": "chiscript",
      "descendants": 0,
      "id": 31643434,
      "score": 1,
      "text": "A Case Report on Fuzzy Name Matching<p>In 1992, George Labovitz and Yu Sang Chang proposed the 1–10–100 principle, which suggests that the longer one takes to correct bad data, the more expensive it will be to fix it eventually.\nA data-centred way of putting it is this:<p>&quot;It will cost $1 to verify the quality of your database, $10 to clean each item in it and $100 to store each item that is not cleaned.&quot;<p>100 Dollars<p>I worked for a small organisation which I will call ACME from here onward. It is social security organisation that manages funds for the Government.\nThe law of the land is such that every employee was required to save a certain portion of their salary with ACME on a monthly basis. This money can then be accessed upon reaching the retirement age or under special circumstances which are beyond the scope of this post.\nAt that time, ACME had the list of expected monthly contributions from almost everyone in the labour sector, but their list was compromised due to several factors surrounding how they managed data (let’s call this List_A). Concurrently, ACME would receive multiple salary schedules from hundreds of organisations around the country (we’ll call this List_B) and their task was to compare both lists to come up with a clean, properly formatted and reliable master copy. It is also important to note that List_A and List_B usually had cases of the same individuals appearing on both lists, but with their names spelled differently.<p>Initially, matching each name in List_A to the names in List_B was done manually. This usually took many days and resulted in plenty of mismatched names because of human error, to the point that our error rate was hovering around 30%. In other words, our team was mismatching hundreds of thousands of dollars each day.\nFurther on, project costs were also running high. Each person working on the project was earning about $15 an hour and for a team comprising about 70 people (not counting top management), it is easy see how overall project costs could easily have got out of hand if the project had dragged on for too long.<p>[CONTINUE READING] &quot;The 1–10–100 Principle or How We Stopped Neglecting Data and Started Investing in Data Cleaning&quot; &gt; https:&#x2F;&#x2F;getflookup.medium.com&#x2F;the-1-10-100-principle-or-how-we-stopped-neglecting-data-and-started-investing-in-data-cleaning-b07a7dbf92d6",
      "time": 1654537535,
      "title": "The 1–10–100 Principle or How We Stopped Neglecting Data",
      "type": "story"
    },
    {
      "by": "gabceboli",
      "descendants": 0,
      "id": 31643432,
      "score": 1,
      "text": "Launch day is here! \nThis has been my passion project, to recreate Duolingo for chess!<p>I always thought Duolingo had amazing &quot;hooks&quot; to help people learn new languages, so I implemented its spaced-repetition, reports and daily and weekly training reminders in a Chess learning platform for chess improvers!<p>I built it in Meteor.js and React.js. I chose Meteor to be able to add Cordova in the future.<p>The Caro-Kann course (for white) is completely free, if you guys want to try it.<p>What do you folks think?",
      "time": 1654537518,
      "title": "Show HN: Chesskool – Platform for Chess Improvement",
      "type": "story",
      "url": "https://www.chesskool.com"
    },
    {
      "by": "emdashcomma",
      "descendants": 0,
      "id": 31643420,
      "kids": [
        31643449
      ],
      "score": 4,
      "time": 1654537459,
      "title": "Apple Pay Later is the company’s take on a buy now, pay later service",
      "type": "story",
      "url": "https://www.theverge.com/2022/6/6/23156672/apple-pay-later-installments-wwdc-ios-16-buy-now-bnpl"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 31643412,
      "score": 3,
      "time": 1654537372,
      "title": "Ilya Shapiro resigns from Georgetown following reinstatement after tweet inquiry",
      "type": "story",
      "url": "https://www.thefire.org/ilya-shapiro-resigns-from-georgetown-following-reinstatement-after-122-day-investigation-of-tweets/"
    },
    {
      "by": "acqbu",
      "descendants": 0,
      "id": 31643404,
      "score": 1,
      "time": 1654537336,
      "title": "Criticism of Muhammad",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Criticism_of_Muhammad"
    },
    {
      "by": "dreadlordbone",
      "descendants": 0,
      "id": 31643372,
      "score": 2,
      "time": 1654537193,
      "title": "Apple will let you unsend and edit messages in iMessage",
      "type": "story",
      "url": "https://mashable.com/article/apple-wwdc-2022-unsend-edit-imessage"
    }
  ]
}