{
  "stories": [
    {
      "by": "dtagames",
      "descendants": 0,
      "id": 31530498,
      "score": 1,
      "time": 1653664181,
      "title": "Video Argues That Elon Musk's Mars Plan Is Untenable",
      "type": "story",
      "url": "https://digg.com/video/guy-makes-persuasive-argument-about-why-elon-musks-plan-to-establish-a-colony-on-mars-is-the-dumbest-idea-ever"
    },
    {
      "by": "encephalos",
      "descendants": 0,
      "id": 31530485,
      "score": 1,
      "text": "Hey HN, I recently realized I was in need of a hard reset. I completed my mandates, and quit my jobs - a three month OOO to take the time to introspectively audit and assess many aspects of my life. The one thing I realized was actually taking a burden on me psychologically was this looming and never ending <i>mental</i> to-do list weighing down on me, especially in terms of data and information overload.<p>Something I&#x27;ve been meaning to do for YEARS, is finally build and implement an optimized system for handling many different usernames, accounts, and passwords. Ideally, I want a system that might take me time to implement, but that will almost run autonomously and require minimum steps once set up.<p>I fell on a few other threads that portrayed a version of this ideal system I&#x27;ve longed for: create custom domain emails for each service requiring a username and use one of the password managers (yes I&#x27;m still not using one and my mental hard drive is on the brink of croaking from the dozens upon dozens of various handle names and passwords I&#x27;ve stored mentally. This is what I&#x27;d like to know <i>assuming this is the best system - open to other solutions of course</i>.<p>(1) best way to register and host new domain for this purpose, and then use a mailserver such as protonmail? I like this strategy because it will force me to be more selective of where and what services I register for since it would require a few steps and also I can easily control and audit the culprit if&#x2F;when I run into a spam issue.<p>(2) best paid for password manager?<p><i>part of my initial process was unsubscribing my various emails from different services as well as making a spreadsheet of all my usernames, passwords and sites they&#x27;re used on. I&#x27;m ready to finally lift this burden off my back. I appreciate any advice given to me, you don&#x27;t know how much you are helping me in bypassing any OCD, perfectionism, and need-to-know tendencies I may possess</i>.<p>- neighbourhood friendly brain",
      "time": 1653664074,
      "title": "Ask HN: Best system for emails and passwords *SOS*",
      "type": "story"
    },
    {
      "by": "boeingUH60",
      "descendants": 0,
      "id": 31530483,
      "score": 1,
      "time": 1653664070,
      "title": "A New Prediction Market Lets Investors Bet Big on Almost Anything",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2022-05-26/kalshi-s-stock-market-of-the-world-let-s-you-bet-on-anything"
    },
    {
      "by": "torvald",
      "descendants": 0,
      "id": 31530448,
      "score": 2,
      "time": 1653663847,
      "title": "Cities with the Best Work-Life Balance 2022",
      "type": "story",
      "url": "https://www.getkisi.com/work-life-balance-2022"
    },
    {
      "by": "arvidkahl",
      "descendants": 0,
      "id": 31530447,
      "score": 1,
      "time": 1653663832,
      "title": "Parasocial Relationships: Imaginary Friends of the Social Network Age",
      "type": "story",
      "url": "https://thebootstrappedfounder.com/parasocial-relationships-imaginary-friends-of-the-social-network-age/"
    },
    {
      "by": "metadat",
      "descendants": 0,
      "id": 31530441,
      "score": 2,
      "time": 1653663793,
      "title": "CDC: 1 in 5 Adult Covid-19 Survivors Has Long Haul Covid",
      "type": "story",
      "url": "https://www.prevention.com/health/health-conditions/a40117340/cdc-long-covid-affects-older-adults-more/"
    },
    {
      "by": "ColinWright",
      "descendants": 1,
      "id": 31530439,
      "kids": [
        31530446
      ],
      "score": 1,
      "time": 1653663788,
      "title": "Security advice is just wrong, based on bad assumptions about corporate behavior",
      "type": "story",
      "url": "https://www.solipsys.co.uk/Chartter/1530004690313699330.svg"
    },
    {
      "by": "_448",
      "descendants": 0,
      "id": 31530423,
      "score": 1,
      "text": "I am learning CouchDB. As I understand it, documents in the database cannot be grouped into categories, such as, for example, all receipt documents can be put into a receipt bucket, invoices can be put into invoice bucket etc.<p>Are there any free and opensource NoSQL databases that provide this feature of grouping documents according to category?",
      "time": 1653663722,
      "title": "Ask HN: Any free and open source NoSQL DB has a way to create document groups?",
      "type": "story"
    },
    {
      "by": "Whitespace",
      "descendants": 0,
      "id": 31530420,
      "score": 1,
      "time": 1653663709,
      "title": "TIL 1582-10 had only 21 days. The last day was 1582-10-31",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Inter_gravissimas"
    },
    {
      "by": "me2too",
      "descendants": 0,
      "id": 31530417,
      "score": 1,
      "time": 1653663686,
      "title": "Tird-party libraries as UE plugins: ABI compatibility and Linux toolchain",
      "type": "story",
      "url": "https://pgaleone.eu/2022/05/27/unreal-engine-third-party-linux-abi-compatibility/"
    }
  ]
}