{
  "stories": [
    {
      "by": "GBond",
      "descendants": 0,
      "id": 31404927,
      "score": 1,
      "time": 1652750347,
      "title": "Congress to Hold Its First Hearing on UFOs in More Than 50 Years",
      "type": "story",
      "url": "https://www.wsj.com/articles/congress-to-hold-its-first-hearing-on-ufos-in-more-than-50-years-11652724338"
    },
    {
      "by": "gz5",
      "descendants": 0,
      "id": 31404915,
      "score": 1,
      "time": 1652750233,
      "title": "CRISPR Now Possible in Cockroaches",
      "type": "story",
      "url": "https://phys.org/news/2022-05-crispr-cockroaches.html"
    },
    {
      "by": "MightLoseMyJob",
      "descendants": 1,
      "id": 31404914,
      "kids": [
        31404930
      ],
      "score": 1,
      "text": "Apologies for the ambiguous title, I wasn&#x27;t sure how to condense it properly. I&#x27;m being blackmailed by a girl I met online a few weeks ago. We exchanged photos and she initially blackmailed me for a little over $2k. I thought that was it, but she just reached out again and I tried ignoring her but it made her upset and she demanded more money. I sent her my remaining ~$200 and told her that&#x27;s all I had, but she&#x27;s still threatening to send compromising photos to my employer.<p>I very recently moved to a new state, by myself, for this job. No safety net, no network, no ability to move back. I&#x27;m relatively Jr. so getting a new job quickly is still challenging. Assuming she did send those photos and I got fired tomorrow, my next paycheck may cover the rest of this month - but not next month at all. I just recently had an emergency expense that drained my savings and I&#x27;m in a bad situation financially.<p>I&#x27;m unsure if I should file a police report or tell my employer. I don&#x27;t know for certain if she will or will not actually expose those photos, but if I file a report then once she found out her last act certainly would be to send them out. I also fear that being a new employee, the company may not want me due to the PR risks associated with even the possibility of this happening, so telling them before the events unfold could be self-sabotaging should they not unfold at all.<p>What should I do? I&#x27;m an anxious mess right now. If I do need a new job, are there any ways in which I can accelerate the job search process? I&#x27;ve worked fast food and retail before, and will again as a stop gap measure if necessary, but I&#x27;d prefer to hop straight into another dev job if possible. I know the common sentiment is that the market is hot right now, and perhaps it is but I still found that before this current job I got many denied applications and the few companies that did respond typically took weeks to do so. I can&#x27;t afford to wait that long this time.<p>Any advice is welcome. Apologies for the lack of details, I&#x27;m trying to limit anything that IRL acquaintances could use to identify me.",
      "time": 1652750228,
      "title": "Ask HN: I'm in a bad situation and desperately need advice",
      "type": "story"
    },
    {
      "by": "d4mi3n",
      "descendants": 1,
      "id": 31404911,
      "kids": [
        31404922
      ],
      "score": 2,
      "time": 1652750221,
      "title": "NSA Says ‘No Backdoor’ for Spies in New US Encryption Scheme",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-05-13/nsa-says-no-backdoor-in-new-encryption-scheme-for-us-tech"
    },
    {
      "by": "ani_obsessive",
      "descendants": 0,
      "id": 31404890,
      "score": 1,
      "time": 1652750049,
      "title": "When Is a Storyboard Good Enough?",
      "type": "story",
      "url": "https://animationobsessive.substack.com/p/when-is-a-storyboard-good-enough"
    },
    {
      "by": "DevopsQuestions",
      "descendants": 0,
      "id": 31404881,
      "score": 1,
      "time": 1652749971,
      "title": "Ask HN: What languages are you using for systems and infra scripting?",
      "type": "story"
    },
    {
      "by": "aard",
      "descendants": 0,
      "id": 31404864,
      "score": 2,
      "time": 1652749755,
      "title": "The biggest problem with capitalism? Not enough capitalists",
      "type": "story",
      "url": "https://fortune.com/2020/11/21/capitalism-entrepreneurship-economic-inequality-us-bureaucracy/"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 31404858,
      "score": 1,
      "time": 1652749662,
      "title": "OpenSSF, Linux Foundation Want to Replace C, C++",
      "type": "story",
      "url": "https://www.sdxcentral.com/articles/news/openssf-linux-foundation-want-to-replace-c-c/2022/05/"
    },
    {
      "by": "reluctantly",
      "descendants": 1,
      "id": 31404845,
      "kids": [
        31404913
      ],
      "score": 4,
      "text": "I&#x27;ve always worked at growth stage startups since transitioning to tech about 10 years ago. I started as an IC and built the technical foundations and when a team was needed, I declined the offer to manage. Well, eventually they didn&#x27;t succeed at hiring a manager and designated me. I grew to own a large team of teams and function. I decided I was right the first time and really dislike most aspects of being a manager, and I left that company&#x2F;role with the goal to become an IC again. When I was hired at latest company, I was extremely clear that I was not interested in anything on the management track and was hired as a senior IC. A few months ago, the functional lead ( my manager) was fired and I was forced to take over despite my being abundantly clear I did not want to and it would make me unhappy. It was promised to be interim until they could hire. After 2 months, there isn&#x27;t even an open rec.<p>This has happened more than once now. I&#x27;ve been very clear about the type of growth I want, and don&#x27;t want to manage peoples work and growth and be the shit umbrella of organizational politics. It drains me, I like solving technical problems and systems. I enjoy that and I&#x27;m good at it. Just because I&#x27;m a decent manager too doesn&#x27;t mean I want to do it.<p>Do I just threaten to quit if I&#x27;m continued to be forced to manage a team instead of the IC role I was hired for? How can I avoid being put in this situation again? I made it very clear I was not interested and wasn&#x27;t really given any choice not to.",
      "time": 1652749571,
      "title": "Ask HN: Bullied into managing (again), how to stay on the IC technical track?",
      "type": "story"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 31404838,
      "score": 1,
      "time": 1652749490,
      "title": "Contents Twenty Years Later: The Surprising Greater Implications of a New Kind",
      "type": "story",
      "url": "https://writings.stephenwolfram.com/2022/05/twenty-years-later-the-surprising-greater-implications-of-a-new-kind-of-science/"
    }
  ]
}