{
  "stories": [
    {
      "by": "nomilk",
      "descendants": 1,
      "id": 28893852,
      "kids": [
        28893853
      ],
      "score": 1,
      "time": 1634443459,
      "title": "Why spend $50k on a pool when you can use a livestock water tank instead?",
      "type": "story",
      "url": "https://www.abc.net.au/news/rural/2021-10-14/stock-tanks-used-as-pools-a-new-trend-taking-over/100532132"
    },
    {
      "by": "babelfish",
      "descendants": 0,
      "id": 28893831,
      "score": 1,
      "time": 1634443153,
      "title": "If time had no beginning",
      "type": "story",
      "url": "https://arxiv.org/abs/2109.11953"
    },
    {
      "by": "susam",
      "descendants": 0,
      "id": 28893827,
      "score": 1,
      "text": "Hello! I am the organizer of Offbeat Computation Club. Visit https:&#x2F;&#x2F;offbeat.cc&#x2F; for more details about our club.<p>We are now gearing up for the second edition of our club meetings. The first series of meetings was about analytic number theory. After 120 meetings across 7 months, it was finally concluded in the beginning of this month. You can read more about the meetings at https:&#x2F;&#x2F;offbeat.cc&#x2F;blog&#x2F;our-100th-meeting.html where I wrote about our experience running this book club on the occasion of its 100th meeting.<p>The next series of meetings is going to be about solving the CSES Problem Set. The book club meetings will focus on going through a few pages of the CSES handbook together in each meeting as well as on discussing techniques to solve each problem in the problem set. This topic was chosen by popular demand from the current members of the club. Most existing members of this club come from ##math and #algorithms channel of Libera IRC. Some members are also from Hacker News!<p>We are going to spend roughly 20% time reading the book and 80% time on discussing concepts and techniques for solving problems. A lot of emphasis will be laid on seeing the same problem from different perspectives in order to gain a deeper appreciation of the underlying patterns that lead to interesting mathematical properties related to each problem.<p>The schedule and notes for this activity is getting ready now. Our first reading session is going to be on Tue, 19 Oct 2021 at 17:00 UTC. If solving programming puzzles sounds like fun to you, visit https:&#x2F;&#x2F;offbeat.cc&#x2F;cses&#x2F; for more details and join us!<p>You can also join our chat channel via https:&#x2F;&#x2F;web.libera.chat&#x2F;#offbeat or https:&#x2F;&#x2F;app.element.io&#x2F;#&#x2F;room&#x2F;#offbeat:libera.chat (prefer the latter link if you are not used to IRC).",
      "time": 1634443073,
      "title": "Tell HN: I am doing online reading sessions on programming puzzles",
      "type": "story"
    },
    {
      "by": "tambourine_man",
      "descendants": 0,
      "id": 28893799,
      "score": 1,
      "time": 1634442780,
      "title": "Sinofsky: History of Apple Portables",
      "type": "story",
      "url": "https://twitter.com/stevesi/status/1449443506783543297"
    },
    {
      "by": "turtlegrids",
      "descendants": 0,
      "id": 28893794,
      "score": 1,
      "time": 1634442702,
      "title": "Microsoft is launching a new Teams feature that may drive some people mad",
      "type": "story",
      "url": "https://www.zdnet.com/article/microsoft-is-launching-a-new-teams-feature-that-may-drive-some-people-mad/"
    },
    {
      "by": "camjohnson26",
      "descendants": 0,
      "id": 28893788,
      "score": 3,
      "time": 1634442623,
      "title": "Tesla FSD Beta Barely Avoids Crashing into Pole",
      "type": "story",
      "url": "https://twitter.com/BS__Exposed/status/1449158254081290242"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 28893773,
      "score": 2,
      "time": 1634442413,
      "title": "Weird Soviet devices cure diseases",
      "type": "story",
      "url": "https://www.rbth.com/lifestyle/334310-soviet-devices-physiotherapy"
    },
    {
      "by": "harambae",
      "descendants": 0,
      "id": 28893726,
      "score": 3,
      "time": 1634441805,
      "title": "78% of community bank executives expect the housing market to crash by 2026",
      "type": "story",
      "url": "https://www.businessinsider.com/housing-market-bubble-crash-prices-bank-executives-fear-meltdown-survey-2021-10"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28893711,
      "score": 1,
      "time": 1634441656,
      "title": "How to Write Better Technical Content",
      "type": "story",
      "url": "https://draft.dev/learn/technical-content"
    },
    {
      "by": "throwaway99012",
      "descendants": 0,
      "id": 28893686,
      "score": 1,
      "text": "I was notified of a breach and got the following email. Is it good enough to say I didn&#x27;t have the money for security?<p>&gt;&gt;MESSAGE<p>LOST PET FINDERS DATA BREACH NOTICE\nDear Customer,<p>I am writing to you because of an incident involving access to information associated with online purchases made on my website lostpetfinders.co.nz. I am providing notice to you and other potentially affected customers about the incident, and about tools you can use to protect yourself against possible identity theft or fraud.<p>What Happened?<p>I was recently informed that my website lostpetfinders.co.nz was a Common Point of Purchase (this meant that my site was compromised) by my merchant provider.<p>The period of possible compromise started on November 2019 through April 2021.<p>I do not store any card numbers including the CCV and expiry date. This is not how the attacker got to the information. Instead, the attacker put keyword logging code onto the site to capture and send data as it was submitted.<p>My site is self-administered, and it was my system that experienced the intrusion. The intruder or intruders placed malware on the server, and by doing so may have gained access to your payment card data including payment card numbers as customers made transactions on the system. Because you have provided your payment card information to me in the past, I am notifying you about this data breach.<p>What Information Was Involved?<p>The information that the attacker had access to includes your first and last name, your address, your phone number and any debit or credit card numbers with expiration dates you may have used on my website.<p>What Are We Doing?<p>We have engaged the service of a leading cybersecurity firm to assist with security improvements to ensure we are compliant with Payment Card Industry (PCI) Data Security Standards and we have reported the breach to privacy.org.nz.<p>What You Can Do?<p>To protect yourself from the possibility of identity theft, I recommend you immediately contact your credit or debit card company and inform them that your card information may have been compromised, so that they can issue you a replacement card. Review your banking and card statements and report any suspicious activity to the relevant financial institutions.<p>For more information on identify theft, I suggest that you visit the Office of the Australian Information Commissioner&#x27;s website office at privacy.org.nz.<p>On a personal level<p>I deeply apologise for the breach. I was left to self-manage the website after the developers who built the site closed down approximately 7 years ago. Financial restraints prevented me from finding a new development company so I developed the site over that time but without proper maintenance of the website security it was ultimately breached. You trusted me with your information and I have let you down. Again, for this I deeply and most sincerely apologise.<p>I take full responsibility in ensuring the ongoing security of the sites are maintained to industry recommended standards so hopefully I can continue to provide people in the community who have lost or found a pet a recourse for repatriation.<p>&gt;&gt;EOM",
      "time": 1634441347,
      "title": "Ask HN: Data breach disclosure for one man SaaS",
      "type": "story"
    }
  ]
}