{
  "stories": [
    {
      "by": "cyrus20",
      "descendants": 0,
      "id": 28163558,
      "score": 1,
      "time": 1628813615,
      "title": "Afghans Tell of Executions, Forced ‘Marriages’ in Taliban-Held Areas",
      "type": "story",
      "url": "https://www.wsj.com/articles/afghans-tell-of-executions-forced-marriages-in-taliban-held-areas-11628780820"
    },
    {
      "by": "kaczordon",
      "descendants": 0,
      "id": 28163550,
      "score": 1,
      "time": 1628813555,
      "title": "Covid Delta variant viral load similar in vaccinated and unvaccinated",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-021-02187-1"
    },
    {
      "by": "mmastrac",
      "descendants": 0,
      "id": 28163546,
      "score": 1,
      "time": 1628813519,
      "title": "Unfuck: A utility for deobfuscating Python 2.7 bytecode",
      "type": "story",
      "url": "https://github.com/landaire/unfuck"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 28163542,
      "score": 1,
      "time": 1628813496,
      "title": "First major US city mandates proof of vaccinations for certain indoor activities",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/12/us/san-francisco-vaccine-requirement/index.html"
    },
    {
      "by": "skissane",
      "descendants": 1,
      "id": 28163527,
      "kids": [
        28163529
      ],
      "score": 2,
      "time": 1628813363,
      "title": "Boeing’s Starliner Launch Could Face Delay of Several Months",
      "type": "story",
      "url": "https://www.wsj.com/articles/boeing-s-starliner-launch-could-face-delay-of-several-months-11628808399"
    },
    {
      "by": "Overton-Window",
      "descendants": 0,
      "id": 28163449,
      "score": 1,
      "time": 1628812902,
      "title": "House of Representatives raises max salary for staff to nearly $200k",
      "type": "story",
      "url": "https://www.axios.com/house-max-salary-e64b6328-1f14-4fc3-a541-04dddec74db7.html"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 28163376,
      "score": 2,
      "time": 1628812485,
      "title": "Infection-enhancing antibodies recognize both the original and Delta",
      "type": "story",
      "url": "https://doi.org/10.1016/j.jinf.2021.08.010"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 28163293,
      "score": 1,
      "time": 1628812083,
      "title": "The Most Complex Pop Song of All Time",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ZnRxTW8GxT8"
    },
    {
      "by": "DLay",
      "descendants": 0,
      "id": 28163266,
      "score": 2,
      "time": 1628811916,
      "title": "Rumble will pay creators who ‘challenge the status quo’",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2021/08/12/rumble-video-gabbard-greenwald/"
    },
    {
      "by": "the_only_law",
      "descendants": 0,
      "id": 28163223,
      "score": 4,
      "text": "I need to get out of development, I fucked my career over and it seems that digging myself out of the hole is going to be nearly as difficult as just doing something else.<p>Unfortunately most other things I find myself interested in are blocked by expensive credentials, however I’m curious about security.<p>I know “security” is a ridiculously generic description, that can range from guys making high level decisions, to people managing security infrastructure, or testers, security researchers, etc. I’m mostly interested in knowing what the easiest transition from being a developer is.<p>For a little context on my particular situation, I’ve mostly worked in non-tech, enterprise type environments. For at least part of my career, I’ve worked adjacent to security, mostly assisting with implementing security features for various compliance frameworks (think HIPAA, PCI, SOX, etc.) but am not intimately familiar with the frameworks myself. I have a rough idea of simple vulnerabilities, though the only ones I’ve ever exploited&#x2F;patched in the wild we’re boring XSS+session hijacking vulnerabilities. I also have a <i>very</i> (emphasis on that) surface level understanding of reverse engineering along with familiarity with some tools.<p>What sort of roles do you think I could transition too in the security field, quickly and how bad would the pay cut be? I’m not actually compensated that great at the moment, but I was hoping to get my comp closer in line to the development industry prior to my realization.I figure boring is fine if I can make a decent salary and have chance of breaking in.<p>Additionally, what does one actually need to do to switch fields. I’ve consistently had issues getting past the screening stage for development roles given my past experience is mostly irrelevant to what I was applying to, I imagine it’s worse when going to a whole new field.<p><i>As a random side note, I’m unlikely to be eligible for a TS clearance, so that may limit my options.</i>",
      "time": 1628811708,
      "title": "Ask HN: What security roles are easiest for a developer to transition to",
      "type": "story"
    }
  ]
}