{
  "stories": [
    {
      "by": "GWBullshit",
      "descendants": 0,
      "id": 31261639,
      "score": 1,
      "text": "I was experiencing strange bot-&quot;Banned for spam&quot; events over the last for days on a subreddit with small (18) but very particular membership and viewers in the 100-several hundred range, despite the posts only being submitted on the subreddit itself (the promotion to the subreddit was done mostly off Reddit itself).<p>I tried explaining the the situation to r&#x2F;Reddit and they agreed I got caught up in the spam filter incorrectly, but so far I did not get a response about the subreddit itself that was banned as a result of the spam filters.<p>The content was &quot;let&#x27;s just say important&quot; for the viewership, which I would consider members of an important community in the real world, and the amount of work that went into it ... let&#x27;s just say A LOT of work went into it.<p>Does anybody know anything about or have any experience with restoring both a subreddit AND its contents?<p>Again, the amount of work that went into it, over a LONG period of time, is incomprehensible and duplicating it from scratch would not be possible.<p>Any help would be appreciated, please and thank you.",
      "time": 1651677250,
      "title": "Reddit's spam filters incorrectly shadow/subreddit banned me; how to restore sub",
      "type": "story"
    },
    {
      "by": "heuroci",
      "descendants": 0,
      "id": 31261619,
      "score": 1,
      "time": 1651677170,
      "title": "Typelevel: The Present, the Past and the Future",
      "type": "story",
      "url": "https://speakerdeck.com/larsrh/typelevel-the-past-the-present-the-future"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 31261611,
      "score": 1,
      "time": 1651677138,
      "title": "The need to reform the National Institutes of Health (NIH) funding process",
      "type": "story",
      "url": "https://newscience.org/nih/"
    },
    {
      "by": "gremlinsinc",
      "descendants": 0,
      "id": 31261605,
      "score": 2,
      "text": "I&#x27;m getting extremely frustrated with the hiring&#x2F;recruiting process.<p>I&#x27;ve been using laravel since 2013. I know livewire, react, alpine.js, and vue. I&#x27;m not perfect, and sometimes I&#x27;m a perfectionist or want to go the extra mile and make sure there are tests written at least for mission-critical bits.<p>I&#x27;ve also played with Remix.run, Nuxt3, Next.js, go, every python framework, Rails, hasura+vue&#x2F;react frontends.<p>My problem is the majority of my work has been freelance, and non-verifiable. I have people I&#x27;ve worked for who can vouch for me, but nobody in a FAANG company. I live in rural Utah and work remotely.<p>I&#x27;m 42, and eventually, I&#x27;d like to maybe try DevOps or project (or product) management. I&#x27;m just struggling to pay the bills because I&#x27;m not the best at finding new clients, and I&#x27;d like something with benefits that&#x27;s sustainable.<p>I also miss working with a team, so it&#x27;d be nice to do that again as I learned a lot more working on a team running scrum, etc...<p>So should I continue looking for a mid+ level position or just eat my pride and go for a Jr level position -- maybe with a different tech stack even so at least I broaden my skill-set?",
      "time": 1651677116,
      "title": "Ask HN: Is it okay to apply for Jr Level jobs if you strike out at Sr/Mid-level?",
      "type": "story"
    },
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 31261591,
      "score": 3,
      "time": 1651677060,
      "title": "Founder's Choice of VCs",
      "type": "story",
      "url": "https://founderschoicevc.com/"
    },
    {
      "by": "herodotus",
      "descendants": 0,
      "id": 31261581,
      "score": 3,
      "time": 1651677015,
      "title": "Mechanical Watch (Bartosz Ciechanowski)",
      "type": "story",
      "url": "https://ciechanow.ski"
    },
    {
      "by": "tpinto",
      "descendants": 0,
      "id": 31261534,
      "score": 1,
      "time": 1651676803,
      "title": "Raiz Vertical Farms, the Farms of the Future",
      "type": "story",
      "url": "https://medium.com/nearweek/an-introduction-to-raiz-vertical-farms-the-farms-of-the-future-e62094b782c3"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31261533,
      "score": 2,
      "time": 1651676801,
      "title": "Mechanical Watch",
      "type": "story",
      "url": "https://ciechanow.ski/mechanical-watch/"
    },
    {
      "by": "raybb",
      "descendants": 0,
      "id": 31261525,
      "score": 2,
      "time": 1651676770,
      "title": "Android 13 blocks use of accessibility services by restricting sideloaded apps",
      "type": "story",
      "url": "https://www.androidpolice.com/android-13-blocks-accessibility-services-sideloaded-apps/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31261501,
      "score": 1,
      "time": 1651676701,
      "title": "Software security starts with the developer: Securing developer accounts with 2",
      "type": "story",
      "url": "https://github.blog/2022-05-04-software-security-starts-with-the-developer-securing-developer-accounts-with-2fa/"
    }
  ]
}