{
  "stories": [
    {
      "by": "wooque",
      "descendants": 0,
      "id": 30752509,
      "score": 1,
      "time": 1647860032,
      "title": "Veganism Is the Pinnacle of Bugmanism",
      "type": "story",
      "url": "https://lukesmith.xyz/c/veganism-is-the-pinnacle-of-bugmanism"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30752498,
      "score": 1,
      "time": 1647859919,
      "title": "StopHatingRussians",
      "type": "story",
      "url": "https://twitter.com/AmbRusFrance/status/1505824398275756035"
    },
    {
      "by": "staccatomeasure",
      "descendants": 0,
      "id": 30752493,
      "score": 1,
      "time": 1647859872,
      "title": "Working Across Departments",
      "type": "story",
      "url": "https://staysaasy.com/startups/2022/02/20/departments.html"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30752455,
      "score": 1,
      "time": 1647859475,
      "title": "Bolt II hypersonic flight test could bring superfast global travel a step closer",
      "type": "story",
      "url": "https://theconversation.com/the-bolt-ii-hypersonic-flight-test-could-bring-superfast-global-travel-a-step-closer-179556"
    },
    {
      "by": "Mike_Andreuzza",
      "descendants": 1,
      "id": 30752440,
      "kids": [
        30752479
      ],
      "score": 1,
      "time": 1647859378,
      "title": "Show HN: A collection of multi-color vectors for web dev and digital designers",
      "type": "story",
      "url": "https://meshedup.dev/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30752420,
      "score": 1,
      "time": 1647859130,
      "title": "10 Tiny PCs of the 1980s",
      "type": "story",
      "url": "https://www.pcmag.com/news/10-tiny-pcs-of-the-1980s"
    },
    {
      "by": "throwaway7819",
      "descendants": 1,
      "id": 30752396,
      "kids": [
        30752478
      ],
      "score": 3,
      "text": "This is a really big decision that has been weighing a lot on my mind recently, and I would appreciate any candid advice that you may have.<p>Here’s the skinny:<p>I applied to two schools: MIT, and a bigger-but-less-prestigious school we&#x27;ll call Z. Growing up, I always wanted to go to Z: my parents met there, my extended family lives in the area, and I have friends and cousins there. But MIT has also always been a dream (and I have friends there too). My original plan was to go to Z for my undergrad, then go to another school like MIT for grad school. I applied to MIT for the sake of completeness, and honestly didn&#x27;t expect to get in. For that reason, it’s pretty easy to see how getting into MIT has thrown a big wrench in my plans.<p>To make matters worse, MIT hasn’t offered me any financial aid. My parents have saved enough money to help me pay for some of the tuition costs of Z (which I’m immensely grateful for). But other than that, it is clear that I’m fully responsible for paying for the rest of college on my own. (To contextualize how expensive MIT is: the college savings I have now are barely enough to cover one semester at MIT.)<p>On top of that, Z has offered me what essentially amounts to a full-ride scholarship. If I went to Z, I could realistically finish my undergrad in two to three years (from the college credit I’ve accumulated in high school) without going into debt. If I went to MIT, I’d be paying sticker price for a full 4-year degree: even with well-paying internships&#x2F;work-study, I’d still be close to $180k in debt. (I realize that to some in the tech industry $180k may seem like nothing, but for an 18-year-old right out of high school, it may as well be like asking a dolphin to swim to the moon.)<p>After my undergrad, I want to pursue a Master’s&#x2F;PhD in Machine Learning or Symbolic Reasoning. The problem with getting into MIT <i>now</i> is that I feel like I have a proverbial ‘foot in the door’: MIT has a lot of undergrad programs that feed directly into their graduate programs, which are top-notch for these areas of research. If I decided to go to Z, I’d have no guarantee that I’d be accepted to MIT’s (or a similar school’s) graduate program, even though I was accepted to their undergraduate program previously. (Of course, I have no guarantee that I’d get into grad school at MIT even coming out of MIT’s undergraduate program, but the chances are <i>significantly</i> higher.)<p>Additionally, just because I have no financial aid from MIT <i>now</i> doesn’t mean that I won’t have financial aid in the future. My siblings will be starting college in a couple of years; there are a lot of changing factors to consider.<p>Regardless of whichever path I take, I want to work for a larger tech company to gain experience before I bootstrap a sustainable startup (I mean, that&#x27;s the dream, isn&#x27;t it?). I would like to weave together some of the disparate threads I’ve started with my open source work to pursue an idea I think could have a really long-term impact on the way we communicate and collaborate.<p>So here’s my question: Although I know they’re both really good paths, how would you weigh this choice? I’d love to hear about your experience with college (especially if you went to MIT), your career path, and any advice you’d have for someone in my situation. Thank you!",
      "time": 1647858866,
      "title": "Ask HN: I got into MIT. Should I go?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30752377,
      "score": 1,
      "time": 1647858692,
      "title": "Open Source Blueprints for Civilization. Build Yourself",
      "type": "story",
      "url": "https://www.opensourceecology.org/"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 30752369,
      "score": 1,
      "time": 1647858620,
      "title": "Qualys platform study: Log4Shell, the menace continues",
      "type": "story",
      "url": "https://www.helpnetsecurity.com/2022/03/21/qualys-platform-study-log4shell/"
    },
    {
      "by": "destructuredObj",
      "descendants": 1,
      "id": 30752366,
      "kids": [
        30752425
      ],
      "score": 2,
      "time": 1647858587,
      "title": "Final Seconds of Flight MU5735",
      "type": "story",
      "url": "https://twitter.com/ChinaAvReview/status/1505834279275999236"
    }
  ]
}