{
  "stories": [
    {
      "by": "emestifs",
      "descendants": 0,
      "id": 28253655,
      "score": 1,
      "text": "Some of my detail are intentionally fuzzy below, but I hope you&#x27;ll understand the nature of my question.<p>I was recently given the title of &quot;Senior Engineer&quot; at my company. But I&#x27;ve only been at the company about 2-3 years, plus about a year of internship prior.<p>The company is a medium sized company, but software is just one branch of the company. The software department, while a profit center is very small, ~50 devs, 100+ other folk in customer-facing or non-dev roles. The company isn&#x27;t a flashy company, mainly producing niche enterprise products. Pay is market average, at least based on what I&#x27;ve seen and my own salary, but hiring new developers is challenging for the department. Except for junior, recent grads, very few non-junior developers join the company.<p>when I started at this company, a few coworkers spent over 4+ years before they got the title and I don&#x27;t mean to make them appear like poor performers or make myself appear superior -- they both worked on significant pieces of the product. And in other teams, people who&#x27;ve been here longer than me still haven&#x27;t officially been given a senior title.<p>While I do feel I&#x27;m able to contribute at a reasonable level at my company, able to take on larger responsibilities compared to some of my coworkers; I feel this is somewhat title inflation due to just being at the same company and having steady above-average performance for my time here, having steadily grown into my role on the team and steadily improving my skills, experiences and ability to do what they expect of me. And most importantly, just because of the loss of more experienced engineers and having trouble attracting more seasoned engineers.<p>To me, I don&#x27;t feel like a Senior Engineer. Most jobs I seen posted ask for 3-4-5 years of experience (I&#x27;m closer to 2 than even 3) to be considered a senior. Do I feel like a &#x27;senior&#x27; at this company based on the current environment, needs to the department and team -- yes, simply because of accumulated domain knowledge, experience on the job and ability to do things other coworkers would have a more difficult time with.<p>But I can&#x27;t just put &quot;Senior Engineer&quot; on my resume can I? It may be apples to oranges, but I would probably not even make it past the recruiter if I considered applying to a Netflix Senior Engineer position. Even if I did somehow manage, no way I can remotely compare my 2-3 years here to what Netflix would consider the lowest tier of a Senior Engineer.<p>Any thoughts? So far, I&#x27;ve omitted the word &quot;Senior&quot; on the resume whenever I shoot out a resume, just keeping it as a generic &quot;Software Engineer&quot;.",
      "time": 1629513846,
      "title": "Ask HN: Senior title on resume with just 2-3yr experience",
      "type": "story"
    },
    {
      "by": "momentum_j",
      "descendants": 1,
      "id": 28253653,
      "kids": [
        28253654
      ],
      "score": 1,
      "time": 1629513842,
      "title": "Toolbox for Decision-Making",
      "type": "story",
      "url": "https://www.theschoolofmomentum.com/toolbox"
    },
    {
      "by": "JDDunn9",
      "descendants": 0,
      "id": 28253627,
      "score": 1,
      "time": 1629513520,
      "title": "Moderna’s mRNA Vaccine for HIV Is Starting Human Trials",
      "type": "story",
      "url": "https://singularityhub.com/2021/08/20/modernas-mrna-vaccine-for-hiv-is-starting-human-trials-this-week/"
    },
    {
      "by": "evo_9",
      "descendants": 1,
      "id": 28253602,
      "kids": [
        28253645
      ],
      "score": 1,
      "time": 1629513237,
      "title": "Scientists discover Stonehenge constructed from nearly indestructible material",
      "type": "story",
      "url": "https://thehill.com/changing-america/enrichment/568093-scientists-discover-stonehenge-is-constructed-from-a-nearly"
    },
    {
      "by": "awnird",
      "descendants": 0,
      "id": 28253588,
      "score": 2,
      "time": 1629513097,
      "title": "Orlando residents asked to limit water usage to help Covid-19 patients",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/20/us/orlando-residents-reduce-water-liquid-oxygen-covid-patients/index.html"
    },
    {
      "by": "donsupreme",
      "descendants": 0,
      "id": 28253582,
      "score": 2,
      "time": 1629513041,
      "title": "California superior court judge rules that Prop 22 is unconstitutional",
      "type": "story",
      "url": "https://techcrunch.com/2021/08/20/californias-gig-worker-prop-22-ruled-unconstitutional-by-superior-court/"
    },
    {
      "by": "lightlyused",
      "descendants": 0,
      "id": 28253566,
      "score": 1,
      "time": 1629512916,
      "title": "Carlos Latuff’s shortwave radio logs are a work of art – The SWLing Post",
      "type": "story",
      "url": "https://swling.com/blog/2021/08/carlos-latuffs-shortwave-radio-logs-are-a-work-of-art/"
    },
    {
      "by": "birriel",
      "descendants": 0,
      "id": 28253556,
      "score": 1,
      "time": 1629512852,
      "title": "Immortality Roadmap",
      "type": "story",
      "url": "http://immortality-roadmap.com/"
    },
    {
      "by": "absolute100",
      "descendants": 1,
      "id": 28253517,
      "kids": [
        28253518
      ],
      "score": 2,
      "time": 1629512487,
      "title": "The Power of Product Thinking – Future",
      "type": "story",
      "url": "https://future.a16z.com/product-thinking/"
    },
    {
      "by": "pabs3",
      "descendants": 1,
      "id": 28253514,
      "kids": [
        28253519
      ],
      "score": 3,
      "time": 1629512468,
      "title": "Setting new expectations for open source maintainers",
      "type": "story",
      "url": "https://opensource.com/article/21/8/open-source-maintainers"
    }
  ]
}