{
  "stories": [
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30058522,
      "score": 1,
      "time": 1643036975,
      "title": "Will the En Banc 9th Circuit Extend the 2nd Amendment’s Losing Streak to 51?",
      "type": "story",
      "url": "https://reason.com/volokh/2022/01/21/will-the-en-banc-9th-circuit-extend-the-second-amendments-losing-streak-to-51-cases/"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 30058505,
      "score": 1,
      "time": 1643036881,
      "title": "Why users are being kicked off Tinder and Fortnite without explanation",
      "type": "story",
      "url": "https://english.elpais.com/usa/2022-01-24/banned-for-life-why-users-are-being-kicked-off-tinder-and-fortnite-without-explanation.html"
    },
    {
      "by": "do_anh_tu",
      "descendants": 0,
      "id": 30058501,
      "score": 1,
      "time": 1643036864,
      "title": "How to Make a Great Documentation",
      "type": "story",
      "url": "https://jacobian.org/series/great-documentation/"
    },
    {
      "by": "nfreising",
      "descendants": 0,
      "id": 30058500,
      "score": 1,
      "time": 1643036860,
      "title": "Bundesservice Telekommunikation – unmasked: The secret service behind [German]",
      "type": "story",
      "url": "https://lilithwittmann.medium.com/bundesservice-telekommunikation-enttarnt-dieser-geheimdienst-steckt-dahinter-cd2e2753d7ca"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30058493,
      "score": 1,
      "time": 1643036837,
      "title": "Interview with Dan Ragland, Intel's Head of Overclocking",
      "type": "story",
      "url": "https://www.anandtech.com/show/17220/interview-with-intels-dan-ragland-head-of-overclocking"
    },
    {
      "by": "TREKlof",
      "descendants": 0,
      "id": 30058487,
      "score": 1,
      "text": "For a number of years, I have been running my own company to help a small selection of good business IT partners with lead generation up to deal closing.  The number of partners and leads grows nicely so now I have a need for a good administration to manage it all.<p>After a few trials with spreadsheets I recently I came across the data-driven,  SAAS Work Management &amp; Collaboration platform https:&#x2F;&#x2F;www.lumeer.io&#x2F;  from the Czech company Lumeer.<p>Lumeer.io offers an ideal mix of  functionalities as we know from MS Excel, Ms Access, Word, MS project, Google Calendar, Google Maps, Kanban&#x2F;Trello and Visual Basic scrips in one platform!.<p>All my data should be securely encrypted sent back and forth via the internet to a GDPR compliant data centre in Germany, And if I want to, I can download all my data, the data definitions and scripts to a JSON file and thus switch to another package one day. So no vendor lock-in.  The basic version of Lumeer is free to use forever. Lumeer has been around for 5 years and already has customers on all continents.<p>So I gave it a try and so far so good. But Lumeer is pretty unknown and a small company. Am i doing the right thing to invest time and effort in configuring Lumeer the way it fit&#x27;s my needs? What&#x27;s your opinion?<p>My experiences with Lumeer so far:<p>When you start Lumeer.io you come to a home-screen where you can first create a Table for each business entity (a customer, an invoice, an article) and in a spreadsheet-like way (called Table-view) add new columns&#x2F;fields to your table, set attributes  and then fill them with data directly. Tables can easily be linked together (linking an invoice with one customer and with several invoice lines) and filled with data in a combined Tables-view. Besides the Table view, there is also a Maps view, Calendar view, Detail view, Form view, Chart view, Pivot view, Workflow view, Timeline view and Kanban view.<p>All views allow you to directly view, filter, sort, modify and add data. Lumeer includes a visual scripting feature (based on Google&#x27;s Blockly) that allows you to easily create scripts to manipulate data, create&#x2F;print&#x2F;PDF&#x2F;email documents and to create all kinds of formulas and validations. Execution of these scripts can be triggered by a button at record or table level, or it can be triggered automatically when a table is changed or  it executes periodically at a preset time.<p>Lumeer is also a collaborative platform where I can grant rights to all your collaborators  (internal colleagues or external partners&#x2F;customers based on their email address) to collectively view, modify and&#x2F;or comment on a selection of columns&#x2F;fields in certain tables and views and in real time. Users receive alerts via Lumeer and email when there is a relevant data change that requires them to take action.<p>So far I have tweaked Lumeer very easily to manage my leads pipeline my to-do&#x27;s.",
      "time": 1643036798,
      "title": "Is Lumeer.io a Good Choice as a Work Management and Collaboration Platform?",
      "type": "story"
    },
    {
      "by": "NicoJuicy",
      "descendants": 0,
      "id": 30058483,
      "score": 1,
      "time": 1643036782,
      "title": "FluidML is a lightweight framework for developing machine learning pipeline",
      "type": "story",
      "url": "https://github.com/fluidml/fluidml"
    },
    {
      "by": "jdvh",
      "descendants": 0,
      "id": 30058443,
      "score": 2,
      "time": 1643036649,
      "title": "You Don't Need the Cloud",
      "type": "story",
      "url": "https://80daystartup.com/day-10/you-dont-need-the-cloud/"
    },
    {
      "by": "judohacker",
      "descendants": 0,
      "id": 30058437,
      "score": 1,
      "time": 1643036619,
      "title": "Google rewrites history when you search for the 1984 film cast",
      "type": "story",
      "url": "https://twitter.com/JudoHacker/status/1485628544323665920"
    },
    {
      "by": "amadeuspagel",
      "descendants": 0,
      "id": 30058425,
      "score": 1,
      "time": 1643036584,
      "title": "What’s the Connection Between News–Fake and Real–and Opinion?",
      "type": "story",
      "url": "https://www.discoursemagazine.com/culture-and-society/2022/01/24/whats-the-connection-between-news-fake-and-real-and-opinion/"
    }
  ]
}