{
  "stories": [
    {
      "by": "nishantmodak",
      "descendants": 0,
      "id": 30297342,
      "score": 1,
      "time": 1644556852,
      "title": "Running SLOs",
      "type": "story",
      "url": "https://blog.last9.io/slos-eased/"
    },
    {
      "by": "limboy",
      "descendants": 0,
      "id": 30297305,
      "score": 1,
      "time": 1644556522,
      "title": "Show HN: 50x50.space a public board to doodle together",
      "type": "story",
      "url": "https://50x50.space"
    },
    {
      "by": "geocrasher",
      "descendants": 0,
      "id": 30297296,
      "score": 2,
      "text": "Windows 10, Ryzen 5 1400 PC. I had shut down Slack to avoid distractions, and then got a notification that it was time for a reboot for Windows updates. After I was done with the task at hand, I rebooted the PC. During bootup I tapped DEL to get into the UEFI settings. While I was browsing the UEFI settings, a Slack notification played through my computer speakers. I was perplexed but thought it must have been my phone. A second later, I got a notification on my phone, and that&#x27;s when I remembered that my PC and Phone Slack apps have different sounds.<p>&quot;OK, maybe somehow W10 has booted while I&#x27;m sitting here in UEFI&quot; so I exited UEFI settings, booted into W10, and... Slack isn&#x27;t running.<p>I have to admit that if it didn&#x27;t happen to me, I&#x27;d never believe a person who told me this story. But I can assure you it&#x27;s true and I&#x27;m sure of the circumstances I&#x27;ve described.<p>So how on earth did I get a slack notification from my computer <i>after</i> I had shut Slack down and was in the middle of a reboot?",
      "time": 1644556470,
      "title": "Ask HN: How did I get a Slack notification while in UEFI Settings?",
      "type": "story"
    },
    {
      "by": "cosheaf",
      "descendants": 0,
      "id": 30297293,
      "score": 1,
      "time": 1644556459,
      "title": "PyTorch Lightening",
      "type": "story",
      "url": "https://pytorchlightning.ai/"
    },
    {
      "by": "berkut",
      "descendants": 1,
      "id": 30297188,
      "kids": [
        30297244
      ],
      "score": 4,
      "text": "Ask HN: &quot;Best&quot; cross-platform disk encryption software to use?<p>What software that&#x27;s cross-platform (Linux + MacOS at least) and allows encrypting mount-able volumes&#x2F;images (not necessarily full-disk encryption, more for very important documents like keys, etc), and possibly putting them in the cloud (for backup, and maybe on Dropbox) would people recommend these days?<p>VeraCrypt seems popular on the web, but searching HN for past threads about it shows (even despite previous audits) people aren&#x27;t completely convinced by it.<p>If I was Linux-only, I could likely use dm-crypt, but I would like multi-platform support for long-term confidence and convenience, and it&#x27;s not really clear what other choices I have.",
      "time": 1644555522,
      "title": "Ask HN: \"Best” cross-platform disk encryption software to use?",
      "type": "story"
    },
    {
      "by": "loocsinus",
      "descendants": 2,
      "id": 30297171,
      "kids": [
        30297182
      ],
      "score": 1,
      "text": "Hello. I am new to IT. Need your help find a solution: My company has multiple workers scanning documents into their own PCs (not on LAN). After they go home for the night, We want to store all files in a central server and make available for next day. Kind of like a source control system but simpler. Any software solution suggestion is appreciated. Thank you.",
      "time": 1644555377,
      "title": "Looking for an IT solution suggestion: multiple users documents management",
      "type": "story"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 30297169,
      "score": 2,
      "time": 1644555344,
      "title": "New plant-derived composite is tough as bone and hard as aluminum",
      "type": "story",
      "url": "https://news.mit.edu/2022/plant-derived-composite-0210"
    },
    {
      "by": "derefnull",
      "descendants": 0,
      "id": 30297115,
      "score": 2,
      "time": 1644554956,
      "title": "Scientists have built a school of robotic fish powered by human heart cells",
      "type": "story",
      "url": "https://www.npr.org/sections/health-shots/2022/02/10/1079859144/watch-these-robotic-fish-swim-to-the-beat-of-human-heart-cells"
    },
    {
      "by": "todsacerdoti",
      "descendants": 1,
      "id": 30297067,
      "kids": [
        30297165
      ],
      "score": 2,
      "time": 1644554478,
      "title": "Solving Advent of Code 2021 with Rust before Python can start",
      "type": "story",
      "url": "https://programsareproofs.com/articles/aoc_2021.html"
    },
    {
      "by": "keshavmr",
      "descendants": 0,
      "id": 30297046,
      "score": 1,
      "time": 1644554309,
      "title": "Introduction to Couchbase for Oracle Developers and Experts: Part 7: Optimizer",
      "type": "story",
      "url": "http://blog.planetnosql.com/2022/02/introduction-to-couchbase-for-oracle_34.html"
    }
  ]
}