{
  "stories": [
    {
      "by": "nemo1618",
      "descendants": 0,
      "id": 30349073,
      "score": 1,
      "time": 1644944039,
      "title": "Lineiform, a meta-JIT library for Rust interpreters",
      "type": "story",
      "url": "https://redvice.org/2022/lineiform-rust-meta-jit/"
    },
    {
      "by": "cjgustafson22",
      "descendants": 0,
      "id": 30349041,
      "score": 1,
      "time": 1644943944,
      "title": "Steal My Idea?",
      "type": "story",
      "url": "https://www.stealmyidea.io/"
    },
    {
      "by": "ElectronShak",
      "descendants": 0,
      "id": 30349025,
      "score": 1,
      "time": 1644943896,
      "title": "Real Tone on Google Pixel",
      "type": "story",
      "url": "https://store.google.com/intl/en/discover/realtone/"
    },
    {
      "by": "cillian64",
      "descendants": 1,
      "id": 30348980,
      "kids": [
        30349063
      ],
      "score": 2,
      "text": "I just received the following email from GitHub:<p><pre><code>  Hi &lt;username&gt;,\n  \n  We&#x27;re writing to let you know that between January 2021 and September 2021, the following information about your repository was inadvertently made publicly viewable after being sent to a third-party vendor as part of metadata analysis of GitHub Pages sites; the name of the private repository and the GitHub username with ownership of the repository. No repository content or other private data was exposed as part of this incident.\n  \n  User privacy and security are essential for maintaining trust, and we want to remain as transparent as possible about events like these. GitHub itself did not experience a compromise or data breach as a result of this event, nor did unauthorized users gain access to repositories. Read on for more information.\n  \n  * What happened? *\n  \n  GitHub learned from an internal discovery by a GitHub employee, that GitHub Pages sites published from private repositories on GitHub were being sent to urlscan.io for metadata analysis as part of an automated process. This internal process was implemented before the private GitHub Pages feature was released and provides metadata that is used during human review of potentially malicious or abusive GitHub Pages sites.\n\n  To view the name of the private repository on urlscan.io, you would need to have been looking at the front page of urlscan.io within approximately 30 seconds of the analysis being performed or have specifically searched using a query that would return the analysis in the search results. \n  \n  * What information was involved? *\n  \n  The following URLs, but no content, were made publicly viewable:\n  \n  GitHub Pages URLs\n  &lt;redacted - URL to private github page&gt;\n  \n  * What GitHub is doing *\n  \n  GitHub immediately began work on fixing the automated process that sends GitHub Pages sites for metadata analysis so that only public GitHub Pages sites are sent for analysis. Future analysis of public GitHub Pages sites will be unlisted from public view as an additional protection.\n  \n  We also worked with the third-party vendor, urlscan.io, to delete all existing public records of private GitHub Pages sites generated from this situation.\n  \n  * What you can do *\n  \n  No action is required on your end; we have updated our systems and worked with our third-party vendor to ensure this data is no longer publicly viewable. \n  \n  Please feel free to reach out to us with any additional questions or concerns through the following contact form: \n  \n  &lt;redacted&gt;\n  \n  Thanks, \n  GitHub Support</code></pre>",
      "time": 1644943713,
      "title": "GitHub leaked names of private repos with pages",
      "type": "story"
    },
    {
      "by": "ExtraE",
      "descendants": 0,
      "id": 30348967,
      "score": 1,
      "time": 1644943650,
      "title": "Don’t Forget the Human",
      "type": "story",
      "url": "https://ellie.wtf/dont-forget-the-human/"
    },
    {
      "by": "srigi",
      "descendants": 0,
      "id": 30348933,
      "kids": [
        30348946
      ],
      "score": 1,
      "time": 1644943525,
      "title": "Some EU contries require companies to register product that features encryption",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=7D89J6PO1yA"
    },
    {
      "by": "markgavalda",
      "descendants": 0,
      "id": 30348931,
      "score": 2,
      "time": 1644943520,
      "title": "PHP 8.1 (and Older) Benchmarks Across 14 Popular PHP Software",
      "type": "story",
      "url": "https://kinsta.com/blog/php-benchmarks/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30348921,
      "kids": [
        30348952
      ],
      "score": 2,
      "time": 1644943469,
      "title": "The Crisis in Ukraine is not about Ukraine. It's about Germany",
      "type": "story",
      "url": "https://www.unz.com/mwhitney/the-crisis-in-ukraine-is-not-about-ukraine-its-about-germany/"
    },
    {
      "by": "Katydid",
      "descendants": 0,
      "id": 30348905,
      "score": 1,
      "time": 1644943417,
      "title": "(Boo-hoo) UK regulator 'broke international law', says Facebook",
      "type": "story",
      "url": "https://www.theregister.com/2022/02/15/cma_facebook_giphy/"
    },
    {
      "by": "rogmate",
      "descendants": 1,
      "id": 30348885,
      "kids": [
        30348887
      ],
      "score": 1,
      "time": 1644943336,
      "title": "iPhone maker Foxconn to make chips in India with Vedanta",
      "type": "story",
      "url": "https://www.reuters.com/technology/iphone-maker-foxconn-make-chips-india-with-vedanta-2022-02-14/"
    }
  ]
}