{
  "stories": [
    {
      "by": "dwynings",
      "descendants": 0,
      "id": 30049163,
      "score": 1,
      "time": 1642964303,
      "title": "SkyBot",
      "type": "story",
      "url": "http://skybot.cam/"
    },
    {
      "by": "melissalobos",
      "descendants": 0,
      "id": 30049099,
      "score": 1,
      "time": 1642963960,
      "title": "Nimporter – Compile Nim Extensions for Python on Import",
      "type": "story",
      "url": "https://github.com/Pebaz/nimporter"
    },
    {
      "by": "steelstraw",
      "descendants": 0,
      "id": 30049093,
      "score": 2,
      "time": 1642963936,
      "title": "The Underside of the ‘Great Resignation’",
      "type": "story",
      "url": "https://www.wsj.com/articles/the-underside-of-the-great-resignation-labor-participation-rate-workforce-men-employment-pay-jobs-welfare-ubi-11642777828"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 30049076,
      "score": 1,
      "time": 1642963862,
      "title": "French Surgeon Tries to Sell Bataclan Victim X-Ray as Digital Artwork",
      "type": "story",
      "url": "https://www.barrons.com/news/french-surgeon-attempts-to-sell-bataclan-victim-x-ray-as-nft-01642947606"
    },
    {
      "by": "omaras",
      "descendants": 0,
      "id": 30049058,
      "score": 2,
      "time": 1642963776,
      "title": "Avoiding Fallback in Distributed Systems (2020)",
      "type": "story",
      "url": "https://aws.amazon.com/builders-library/avoiding-fallback-in-distributed-systems/"
    },
    {
      "by": "tempsy",
      "descendants": 0,
      "id": 30048925,
      "score": 3,
      "text": "I’m looking in awe of the total carnage in a lot of tech stocks over the past year or so, and accelerating in the last few weeks&#x2F;months.<p>While the FAANGs have so far held up ok (ex-Netflix), there’s a lot of small or mid cap tech stocks that are down 50% or more in just a few weeks. ARKK and related ETFs are down more than 50% since Feb 2021 highs.<p>I understand a lot of this is due to the Fed’s new hawkish stance which disproportionately impacts high p&#x2F;e stocks like many public tech companies due to rising rates and asset purchase tapering.<p>But how long is this trend away from tech going to last?",
      "time": 1642963068,
      "title": "Ask HN: Is the Tech Bubble Crashing?",
      "type": "story"
    },
    {
      "by": "goopthink",
      "descendants": 0,
      "id": 30048918,
      "score": 2,
      "text": "When Netflix first started out, it was an aggregator of movies and shows not unlike Spotify today. Originally, the biggest challenge was the technology parts of the business. But today, most of Netflix’s (and all of the competitors) challenges are not technology problems, but media creation problems - creating hit content to keep people engaged. Meanwhile, all of the other production companies (HBO, Peacock, Disney) have caught up technology-wise, while other technology entrants (Hulu, Apple TV) are likewise focusing on production of original content to stay competitive.<p>This is also starting to happen with Podcasts (Spotify as the leading example).<p>But why hasn’t it happened for music, proper? I think Jay-Z’s Tidal tried this but they weren’t successful. But Sony Music Group, Universal Music Group, etc all have huge catalogs of music, and there is a trend of artists selling their catalogs to these companies. What’s to stop them from pulling back their licensing and launching their own app competing with Spotify? And conversely, why hasn’t Spotify moved into music production in the same way that it has moved into Podcasts? (Caveat being that they tried at some point with generic beats and piano and atmospheric music production, but those knockoffs felt flat and hidden - it wasn&#x27;t promoted as Spotify original music in the same way Netflix or HBO content is).<p>Is it because licensing is much more distributed? (ownership primarily in artists&#x27; hands?)",
      "time": 1642963038,
      "title": "Ask HN: Why hasn't music been disrupted yet in the same way movies have been?",
      "type": "story"
    },
    {
      "by": "salomon812",
      "descendants": 0,
      "id": 30048904,
      "score": 1,
      "time": 1642962965,
      "title": "Give yourself full permission to interview your future managers back",
      "type": "story",
      "url": "https://twitter.com/lilykonings/status/1484598087494496258"
    },
    {
      "by": "pjfin123",
      "descendants": 0,
      "id": 30048897,
      "score": 1,
      "time": 1642962925,
      "title": "Train an open source language model with Argos Train (tutorial)",
      "type": "story",
      "url": "https://odysee.com/@argosopentech:7/training-an-Argos-Translate-model-tutorial-2022:2?r=DMnK7NqdPNHRCfwhmKY9LPow3PqVUUgw"
    },
    {
      "by": "salomon812",
      "descendants": 0,
      "id": 30048890,
      "score": 1,
      "time": 1642962885,
      "title": "World First Analog NFT",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=dgBBQQQKp-Y"
    }
  ]
}