{
  "stories": [
    {
      "by": "lermontov",
      "descendants": 0,
      "id": 30838888,
      "score": 1,
      "time": 1648529373,
      "title": "Plath Traps",
      "type": "story",
      "url": "https://sydneyreviewofbooks.com/review/clark-red-comet-sylvia-plath/"
    },
    {
      "by": "ciconia",
      "descendants": 0,
      "id": 30838863,
      "score": 2,
      "time": 1648529082,
      "title": "Cleanup Botcoin",
      "type": "story",
      "url": "https://www.cleanupbitcoin.com/"
    },
    {
      "by": "BlaisePascal",
      "descendants": 0,
      "id": 30838859,
      "score": 1,
      "text": "Let&#x27;s face it: consuming news is enjoyable. If it wasn&#x27;t, you wouldn&#x27;t be reading this. It&#x27;s fun to find the latest stories, hot takes, and all that interesting stuff people throw around on the internet. You feel less alone when you&#x27;re a part of what&#x27;s going on in the world<p>But not all of it is good. News is clearly divisive, and if you&#x27;ve ever talked with someone who didn&#x27;t agree with you (especially online) you know that for yourself. It can also be draining. I would regularly scroll through headlines whenever a major event happened to keep up with it. It often left me feeling anxious and angry. I hate that.<p>What can be done differently? How do we consume news in a way that brings us together, keeps us accurately informed, and doesn&#x27;t become addicting?<p>Honestly the answer is probably partly to just spend less time on the internet, but I don&#x27;t want to do that, so I tried subscribing to a morning newsletter (for those of you interested it&#x27;s called Roca News https:&#x2F;&#x2F;sparklp.co&#x2F;prtn&#x2F;8419be). For me, it changed more than I thought it would. I still know what&#x27;s happening in the world, but I don&#x27;t have to spend time seeking it out (and wasting time) since the headlines are delivered to me. Plus they throw in random fun stories like people walking again because of AI implants and other cool things that make you annoying at parties.<p>When I wasn&#x27;t getting anxious over the news anymore, it made me think about consuming media in general. Why is it so divisive in the first place? Would being disconnected from the news be as bad as it feels like it would be? What is it that causes me to want to know about people and places I don&#x27;t know?<p>Anyways feel free to give some of your own thoughts on this",
      "time": 1648529053,
      "title": "Rethinking how you consume daily news",
      "type": "story"
    },
    {
      "by": "drdee",
      "descendants": 0,
      "id": 30838855,
      "score": 1,
      "time": 1648529001,
      "title": "A Silver Clasp",
      "type": "story",
      "url": "https://blogs.bl.uk/digitisedmanuscripts/2022/03/the-secret-of-a-silver-clasp.html"
    },
    {
      "by": "amirGi",
      "descendants": 0,
      "id": 30838846,
      "score": 1,
      "time": 1648528913,
      "title": "Rabbit-Hole-Athon",
      "type": "story",
      "url": "https://twitter.com/amirbolous/status/1508521724526174208"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 30838828,
      "score": 1,
      "time": 1648528768,
      "title": "When helping your kid with math, train them to work 1 concept ahead",
      "type": "story",
      "url": "https://twitter.com/seb_g/status/1508663435449487361"
    },
    {
      "by": "Mandatum",
      "descendants": 6,
      "id": 30838788,
      "kids": [
        30838885,
        30838826,
        30838861,
        30838829
      ],
      "score": 2,
      "text": "Over the years I&#x27;ve found writing on HackerNews, Reddit and other online sites has given me an outlet to get creative and engage with folks in a way that will shift discourse towards something I&#x27;m more interested in.<p>I regularly lie and pretend I know about topics and areas I have zero experience in. I began noticing I received more upvotes and engagement when I pandered to views or opinions that are either the direct opposite of what the original content suggests (through cherry-picked exceptions), or I&#x27;ll find a tangentially related view that&#x27;s either current and popular, or supports a topic or viewpoint I&#x27;d like to know more about - often pandered with some popular topic.<p>Often this results in a thread about stuff that I actually want to read about, or someone <i>actually</i> knowledgeable on the subject will correct me - and call me out, but will receive far less approval (and often be flamed for criticizing me). On the plus side, I get to learn from someone really knowledgeable about how something works!<p>Here&#x27;s one of the worst examples (which I regret) because it perpetuates a view about a place I&#x27;ve never been, I&#x27;ve never stepped foot in the continent of Africa - it&#x27;s one of the few times I wish I could go back and &quot;correct the record&quot;: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9309170<p>I know nothing about IP law - &gt;200+ upvotes: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27035901<p>I know nothing about, and have never been through Australia&#x27;s ACCC courts - almost 200 upvotes: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=26787289<p>I&#x27;ve never hosted any copyrighted media, ever: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;context?id=16955522<p>I know nothing about tax havens, I&#x27;ve never even submitted my own taxes: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;context?id=16809428<p>Does anyone else do this?",
      "time": 1648528400,
      "title": "Ask HN: Does anyone else lie on the internet?",
      "type": "story"
    },
    {
      "by": "leephillips",
      "descendants": 0,
      "id": 30838768,
      "score": 1,
      "time": 1648528162,
      "title": "The Censored: Chris Hedges",
      "type": "story",
      "url": "https://taibbi.substack.com/p/meet-the-censored-chris-hedges"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 30838765,
      "score": 1,
      "time": 1648528105,
      "title": "What TPMs Do and What Software Engineers Can Learn from Them",
      "type": "story",
      "url": "https://newsletter.pragmaticengineer.com/p/what-tpms-do"
    },
    {
      "by": "uluyol",
      "descendants": 0,
      "id": 30838756,
      "score": 1,
      "time": 1648527971,
      "title": "DaisyNFS is a formally verified NFS server",
      "type": "story",
      "url": "https://github.com/mit-pdos/daisy-nfsd"
    }
  ]
}