{
  "stories": [
    {
      "by": "manofbytes",
      "descendants": 0,
      "id": 27983636,
      "score": 1,
      "time": 1627479833,
      "title": "Show HN: Find and add your favorite design resources and templates",
      "type": "story",
      "url": "https://designcrops.com/"
    },
    {
      "by": "malshe",
      "descendants": 1,
      "id": 27983617,
      "kids": [
        27983623
      ],
      "score": 1,
      "time": 1627479737,
      "title": "We reviewed 36 NDAs from major tech companies",
      "type": "story",
      "url": "https://www.businessinsider.com/silicon-valley-tech-workers-nda-culture-silence-2021-7"
    },
    {
      "by": "mariuz",
      "descendants": 0,
      "id": 27983611,
      "score": 1,
      "time": 1627479718,
      "title": "The Android Game Development Kit",
      "type": "story",
      "url": "https://android-developers.googleblog.com/2021/07/introducing-android-game-development-kit.html"
    },
    {
      "by": "kamilgrudzien",
      "descendants": 0,
      "id": 27983596,
      "score": 1,
      "time": 1627479646,
      "title": "Referential transparency fits in your head",
      "type": "story",
      "url": "https://blog.ploeh.dk/2021/07/28/referential-transparency-fits-in-your-head/"
    },
    {
      "by": "chrismore",
      "descendants": 1,
      "id": 27983588,
      "kids": [
        27983589
      ],
      "score": 1,
      "time": 1627479616,
      "title": "Get current cryptocurrency price with Slack or Discord command",
      "type": "story",
      "url": "https://github.com/fusebit/fusebot"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 27983577,
      "score": 1,
      "time": 1627479547,
      "title": "The Dangers of Dimethylmercury",
      "type": "story",
      "url": "https://www.chemistryworld.com/opinion/the-dangers-of-dimethylmercury-/3010064.article"
    },
    {
      "by": "Hedgemaster",
      "descendants": 2,
      "id": 27983568,
      "kids": [
        27983632,
        27983592
      ],
      "score": 3,
      "text": "Hi HN community,<p>Would be glad to hear your thoughts on pros and cons of buying Robinhood&#x27;s shares.<p>Many thanks.",
      "time": 1627479509,
      "title": "Robinhood expected to go public tomorrow.. Would you buy?",
      "type": "story"
    },
    {
      "by": "davidpolberger",
      "descendants": 1,
      "id": 27983549,
      "kids": [
        27983598
      ],
      "score": 1,
      "text": "My girlfriend and I would like to spend one or two years living abroad with our eight-year-old in an English-speaking country (we live in Sweden). I attended third grade in California when my father did his post-doc, and I was fluent in English when I came back. I would like to do the same for my kid.<p>I work remotely for my own SaaS business and my girlfriend is planning on studying remotely when we&#x27;re away. As neither one of us will technically work in the country we move to, very few countries appear to offer visas suitable for us. The United Kingdom, for instance, offers both Start-up and Innovator visas (https:&#x2F;&#x2F;www.gov.uk&#x2F;browse&#x2F;visas-immigration&#x2F;work-visas), but neither is suitable, as you need to establish a business in the UK.<p>Most digital nomads appear to travel on tourist visas, and move before they expire. That isn&#x27;t an option for us, as we plan for our child to attend public school for one or two complete school years.<p>(My son&#x27;s English skills are not strong, but I didn&#x27;t speak a word of English when I started third grade in the US. I was thrown in the deep end, but adapted quickly -- I started speaking imperfect English after four or five months in the US. My son is already bilingual and if anything, I would expect him to do better than I did.)<p>There appear to be countries that welcome digital nomads, with dedicated visas for remote workers available. However, most of these countries outside the European Union appear to be small island nations -- many in the Caribbean -- which don&#x27;t appeal to us.<p>Thankfully, the EU allows for free movement of people, meaning that we can move to another EU country with no legal issues whatsoever (and no red tape to wade through). Now that the UK is no longer part of the EU, that only leaves Ireland, given that we&#x27;re only interested in English-speaking countries. (There&#x27;s also Malta, but English appears to be playing second fiddle to Maltese.)<p>My conclusion is thus that our only option, really, is to move to Ireland. Is this a correct assessment?",
      "time": 1627479385,
      "title": "Ask HN: Overcoming visa issues when moving the family abroad, working remotely",
      "type": "story"
    },
    {
      "by": "tomhuntio",
      "descendants": 0,
      "id": 27983545,
      "score": 1,
      "time": 1627479349,
      "title": "How to Literally Reinvent Yourself with Adah Parris",
      "type": "story",
      "url": "https://www.honeyiblewupthebusiness.com/e/1n2wq3j8"
    },
    {
      "by": "barbacoa",
      "descendants": 10,
      "id": 27983544,
      "kids": [
        27983652,
        27983631,
        27983603,
        27983608,
        27983599,
        27983615,
        27983581
      ],
      "score": 16,
      "time": 1627479340,
      "title": "California bans the sale of high end desktop computers over power consumption",
      "type": "story",
      "url": "https://www.dell.com/en-us/shop/gaming-and-games/alienware-aurora-ryzen-edition-r10-gaming-desktop/spd/alienware-aurora-r10-desktop/wdryzr10v11h"
    }
  ]
}