{
  "stories": [
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 30734137,
      "score": 1,
      "time": 1647701082,
      "title": "Cool-Retro-Term",
      "type": "story",
      "url": "https://github.com/Swordfish90/cool-retro-term"
    },
    {
      "by": "elamje",
      "descendants": 0,
      "id": 30734129,
      "score": 1,
      "text": "I&#x27;ve had noticeable slowdowns yesterday since the afternoon using Search, Maps, Calendar, Mail. It seems like the services are still working, but have much more latency compared to other services I&#x27;ve used the last 24 hours.<p>Several times requests have taken 15+ seconds, so it&#x27;s making me suspect they are deprioritizing requests to handle some sort of outage behind the scenes. Alternatively, my account might just be part of tests to see what happens when user requests are slow.",
      "time": 1647701042,
      "title": "Ask HN: Is Google having infrastructure issues?",
      "type": "story"
    },
    {
      "by": "mezod",
      "descendants": 0,
      "id": 30734127,
      "score": 2,
      "time": 1647701028,
      "title": "Ask HN: What would be the single most important book of your field?",
      "type": "story"
    },
    {
      "by": "ftyers",
      "descendants": 0,
      "id": 30734094,
      "score": 1,
      "time": 1647700835,
      "title": "An app for reporting corruption by civil servants",
      "type": "story",
      "url": "https://consulmex.sre.gob.mx/milan/index.php/avisos/82-app-denuncia-paisano"
    },
    {
      "by": "secure",
      "descendants": 0,
      "id": 30734086,
      "score": 2,
      "time": 1647700758,
      "title": "Smart Home Components",
      "type": "story",
      "url": "https://michael.stapelberg.ch/posts/2022-03-19-smart-home-components/"
    },
    {
      "by": "denisw",
      "descendants": 0,
      "id": 30734072,
      "score": 2,
      "time": 1647700669,
      "title": "Fish 3.4.0",
      "type": "story",
      "url": "https://fishshell.com/docs/current/relnotes.html"
    },
    {
      "by": "burlesona",
      "descendants": 0,
      "id": 30734062,
      "score": 3,
      "time": 1647700596,
      "title": "Why can’t America build quickly anymore?",
      "type": "story",
      "url": "https://fullstackeconomics.com/why-america-cant-build-big-things-any-more/"
    },
    {
      "by": "jamghee",
      "descendants": 0,
      "id": 30734057,
      "score": 2,
      "time": 1647700570,
      "title": "Ask HN: What does it mean to be a senior software engineering vs. lower levels?",
      "type": "story"
    },
    {
      "by": "jackfruit2",
      "descendants": 0,
      "id": 30734052,
      "score": 2,
      "text": "Hi,<p>I&#x27;m thinking of starting a few side projects but very worried about the Intellectual Property clause within my employement contract I signed years ago.<p>I&#x27;m looking for a lawyer who could help me parse the following clauses, or am I snookered and should just quit.<p>I&#x27;m wordering how an overlap is determined. Would that be for a judge to decide?<p>From my contract:<p>We understand that lots of our employees have tech related ideas that they work on outside of working hours. In a case where your idea overlaps or conflicts with the work of said company, you agree to the following:<p>1. You will promptly provide to said company, and otherwise keep confidential, full written details of all inventions, copyright works or designs originated, conceived, written or made by you, alone or with others (“Intellectual Property”), and work relating to Intellectual Property that you have worked on at any time during the course of your employment with said company which relate to, or are reasonably capable of being used in, the business of said company (&quot;Employment IP&quot;). Unless otherwise agreed in writing by the CEO, you are assigning said company absolutely all rights, title, benefits and interests in the Employment IP. The reason for this clause is to protect the Intellectual Property of the Company from infringement or misuse that may damage the position of said company in the market or our ability to serve our clients.<p>2. You hereby assign to said company with full title guarantee by way of assignment all present and future copyright, database and design rights and other proprietary rights (if any) for the full term of such rights throughout the world in respect of all Intellectual Property and you waive in favour of said company all moral rights conferred by Chapter 4 Part 1 of the Copyright Designs and Patents Act 1988 and all similar rights in other jurisdictions.<p>3. You irrevocably appoint said company as your attorney to execute any instrument and do any such thing for the purpose of giving to the Company the full benefit of clause 1.",
      "time": 1647700548,
      "title": "Ask HN: Any Recommendations for Employment IP Lawyer in the UK",
      "type": "story"
    },
    {
      "by": "skilled",
      "descendants": 0,
      "id": 30734028,
      "score": 1,
      "text": "Just wondering what could be the issue here:<p>https:&#x2F;&#x2F;developer.mozilla.org&#x2F;en-US&#x2F;docs&#x2F;Web&#x2F;CSS&#x2F;min()<p>Actually, I get the same error when trying to access max() also. I tried it in 4 different browser variations and all return the same error: &quot;developer.mozilla.org redirected you too many times.&quot;",
      "time": 1647700403,
      "title": "Ask HN: Is the min() CSS reference on MDN broken?",
      "type": "story"
    }
  ]
}