{
  "stories": [
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30912795,
      "score": 1,
      "time": 1649111205,
      "title": "How two brothers turned seven lines of code into a $9.2B startup (2017)",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2017-08-01/how-two-brothers-turned-seven-lines-of-code-into-a-9-2-billion-startup"
    },
    {
      "by": "ishiz",
      "descendants": 0,
      "id": 30912794,
      "score": 1,
      "text": "I think the conventional wisdom is to stay at a company for at least 2 years, but I&#x27;m not sure if that is still agreed upon in this market.<p>My job history is as follows:<p>7 months - quit because they needed me to relocate a long distance<p>13 months - quit because we were acquired by another company and the new leadership was toxic in my opinion<p>5 months - contract, decided to not renew<p>7 months - current<p>I am considering leaving my current job, and I&#x27;m wondering if hiring managers would see it as a red flag. I don&#x27;t want to dox myself but the reasons are:<p>1. Low pay. I was actually happy with the pay when I started but rent and everything has increased tremendously since COVID started. My company&#x27;s health insurance plan was also changed at the beginning of this year and my cost went from 0% to 10% of my after-tax take home pay. I&#x27;ve talked to my boss about both these things and she said it sucked. So I didn&#x27;t formally ask for a raise and I don&#x27;t think I&#x27;d be eligible for one anyway, my other coworkers have not yet received one I don&#x27;t think.<p>2. I&#x27;m not happy about the culture. The only people who get any recognition for their work is the sales team &quot;because they pay the bills.&quot; Even my boss (CTO) agrees. My attempts to fix tech debt is shot down because engineering is seen as a cost center to begin with. My team is fantastic to work with but I don&#x27;t like leadership&#x27;s position.<p>3. Related to my second reason, as someone who is junior I want to sink my teeth into a tough and long term project, but management won&#x27;t allow it and they only want us working on short (and buggy) MVPs and shipped to customers. Our time to ship averages less than a day. I don&#x27;t think I&#x27;m learning many &quot;proper&quot; engineering skills doing this.<p>4. Similar to my last reason, I want to work in a team with other people in my discipline (QA) to learn from them. Right now my company has 5 engineers but I&#x27;m the only one who works in QA. When I ask for feedback on my code the other engineers say they don&#x27;t know how it works so they can&#x27;t help. But the frontend and backend engineers get plenty of feedback from the other engineers because they&#x27;re more knowledgeable. They&#x27;re trying their best but I feel I&#x27;d learn more working in a team of others rather than by myself.<p>Other than _maybe_ the first reason, I don&#x27;t think I have many strong reasons for leaving and that&#x27;s why I think another employer would see this as a red flag. But I also know there are a lot of job openings these days so I&#x27;m wondering if I should give it a shot.",
      "time": 1649111196,
      "title": "Ask HN: How much job hopping is too much?",
      "type": "story"
    },
    {
      "by": "rkwasny",
      "descendants": 1,
      "id": 30912787,
      "kids": [
        30912811
      ],
      "score": 1,
      "time": 1649111150,
      "title": "Vivid – Double Your Brightness (1000 nits on M1 MBP)",
      "type": "story",
      "url": "https://goodsnooze.gumroad.com/l/vivid"
    },
    {
      "by": "Paulescu",
      "descendants": 1,
      "id": 30912780,
      "kids": [
        30912781
      ],
      "score": 1,
      "time": 1649111123,
      "title": "Hands-On RL Course",
      "type": "story",
      "url": "http://datamachines.xyz/the-hands-on-reinforcement-learning-course-page/"
    },
    {
      "by": "davidgerard",
      "descendants": 0,
      "id": 30912775,
      "score": 1,
      "time": 1649111093,
      "title": "If you want a scalable Ethereum blockchain, then P=NP",
      "type": "story",
      "url": "https://davidgerard.co.uk/blockchain/2022/04/04/if-you-want-a-scalable-ethereum-blockchain-then-pnp/"
    },
    {
      "by": "mceoin",
      "descendants": 0,
      "id": 30912768,
      "score": 1,
      "time": 1649111028,
      "title": "Elon Musk Becomes Twitter's Largest Shareholder",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/04/technology/elon-musk-twitter.html"
    },
    {
      "by": "kaptain",
      "descendants": 0,
      "id": 30912736,
      "score": 1,
      "time": 1649110895,
      "title": "The Gods of ‘Techtopia’ Giveth, and They Taketh Away",
      "type": "story",
      "url": "https://www.christianitytoday.com/ct/2022/march-web-only/work-pray-code-carolyn-chen-silicon-valley.html"
    },
    {
      "by": "taxonomyman",
      "descendants": 0,
      "id": 30912733,
      "score": 2,
      "time": 1649110884,
      "title": "Show HN: Imagine a search engine where you can sanction results by country",
      "type": "story",
      "url": "https://sanction.millionshort.com/?hn0"
    },
    {
      "by": "ashitlerferad",
      "descendants": 0,
      "id": 30912678,
      "score": 2,
      "time": 1649110535,
      "title": "Free vs. Avail Mem (Linux)",
      "type": "story",
      "url": "https://haydenjames.io/free-vs-available-memory-in-linux/"
    },
    {
      "by": "pier25",
      "descendants": 0,
      "id": 30912669,
      "score": 1,
      "time": 1649110492,
      "title": "IPCC \"now or never\" if world is to stave off climate disaster",
      "type": "story",
      "url": "https://www.theguardian.com/environment/2022/apr/04/ipcc-report-now-or-never-if-world-stave-off-climate-disaster"
    }
  ]
}