{
  "stories": [
    {
      "by": "neilv",
      "descendants": 0,
      "id": 28111995,
      "score": 1,
      "text": "Constitutional questions of Apple&#x27;s move aside... I don&#x27;t know whether we&#x27;re going to see Swatting-like attacks using this mechanism, nor an activist&#x2F;troll mass attack with it, and I don&#x27;t want to find out firsthand.<p>Looking into US privacy-respecting alternatives to iPhone this weekend, both T-Mobile and Apple are imminently forcing VoLTE.  I&#x27;ve not yet found reputable Android AOSP-derived ROMs or other open source firmware supporting that.  (Also, carriers reportedly will allow&#x2F;deny devices by IMEI model.)  Looks like regulatory authorities are OK with all this.<p>Stock Android installs on devices carriers will permit are more respectful than iPhone in some regards, but are still very heavy on commercial privacy invasion and security vulnerabilities.  They&#x27;ll also probably get abandoned for security updates, etc., and alternative ROMs no longer mitigating that.<p>Librem 5 looks good in principle, but the only Librem 5 on eBay just now was a preproduction one for $700+, and dunno how long Purism will be wrangling carriers.<p>The few featurephones seem to be crap and&#x2F;or include integrations with the most infamous social media services, which is a really bad sign.<p>None of the various Linux phone efforts seem ready even today, and carriers are a moving target.<p>I just spent the weekend trying to move from my iPhone.  (And, when I tried a SIM in a stock Android phone, the carrier suspended my service, taking many hours of misery to get it restored in the iPhone it had been in.)<p><i>How do we keep even a minimal phone number (voice &amp; SMS), without all these privacy&amp;security regressions?</i>  (Practically, and solid, and through at least the 2021-2022 VoLTE switchover, and hopefully years after.  A phone number is still required by some gov&#x27;t and critical services.  Wireless data would be nice, but we currently could survive with WiFi, etc.)",
      "time": 1628474556,
      "title": "Ask HN: Privacy&security-respecting alternatives to iPhone, with VoLTE in mind?",
      "type": "story"
    },
    {
      "by": "8bitsrule",
      "descendants": 0,
      "id": 28111976,
      "score": 1,
      "time": 1628474375,
      "title": "Kevin Kelly: The Case for Optimism",
      "type": "story",
      "url": "https://www.warpnews.org/premium-content/kevin-kelly-the-case-for-optimism/"
    },
    {
      "by": "throwawaysea",
      "descendants": 0,
      "id": 28111971,
      "score": 2,
      "time": 1628474322,
      "title": "SpaceX launching satellite to display billboard ads in space",
      "type": "story",
      "url": "https://futurism.com/the-byte/spacex-billboard-ads-space"
    },
    {
      "by": "webmaven",
      "descendants": 1,
      "id": 28111962,
      "kids": [
        28111989
      ],
      "score": 1,
      "time": 1628474239,
      "title": "MIT Researchers Devise a Way to Program Memories into Bacteria by Rewriting DNA",
      "type": "story",
      "url": "https://scitechdaily.com/mit-researchers-devised-a-way-to-program-memories-into-bacterial-cells-by-rewriting-their-dna/"
    },
    {
      "by": "rexreed",
      "descendants": 0,
      "id": 28111957,
      "score": 1,
      "time": 1628474197,
      "title": "Amazon Third-Party Sellers Reportedly Hound Customers Who Leave Bad Reviews",
      "type": "story",
      "url": "https://gizmodo.com/heres-how-amazon-third-party-sellers-reportedly-hound-c-1847446648"
    },
    {
      "by": "DrNuke",
      "descendants": 0,
      "id": 28111950,
      "score": 1,
      "time": 1628474129,
      "title": "Climate change: UN to reveal landmark IPCC report findings",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-58141129"
    },
    {
      "by": "m2com",
      "descendants": 0,
      "id": 28111915,
      "score": 1,
      "time": 1628473681,
      "title": "Relating Natural Language Aptitude to Learning Programming Languages",
      "type": "story",
      "url": "https://www.nature.com/articles/s41598-020-60661-8"
    },
    {
      "by": "narush",
      "descendants": 3,
      "id": 28111885,
      "kids": [
        28111996,
        28111929
      ],
      "score": 3,
      "text": "Hey HN. I&#x27;m a (somewhat) competent programmer looking to put my free time to better use then watching whatever the YouTube algorithm decides to feed me. Specifically, I&#x27;d like to do my part in taking active steps to help fight climate change.<p>I do stuff outside of programming for the environment (not as much as I&#x27;d like, but that&#x27;s a bit of a separate issue), but I&#x27;m wondering if anyone here has thoughts on ways I can use my skills to contribute a cause that is matters a bit more.<p>I&#x27;ve considered contributing to OS projects - but I have no idea what might be impactful and useful to the world generally. Anyone have thoughts on projects &#x2F; specific ways I can put my free time to use programming in this direction?<p>Thanks for any thoughts :)",
      "time": 1628473294,
      "title": "How can I, a programmer, help with the fight against climate change?",
      "type": "story"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 28111883,
      "score": 1,
      "time": 1628473274,
      "title": "The Maya's ingenious secret to survival",
      "type": "story",
      "url": "https://www.bbc.com/travel/article/20210808-the-mayas-ingenious-secret-to-survival"
    },
    {
      "by": "djrogers",
      "descendants": 0,
      "id": 28111872,
      "score": 1,
      "time": 1628473139,
      "title": "FAQ about Apple's Expanded Protections for Children – TidBITS",
      "type": "story",
      "url": "https://tidbits.com/2021/08/07/faq-about-apples-expanded-protections-for-children/"
    }
  ]
}