{
  "stories": [
    {
      "by": "koolba",
      "descendants": 0,
      "id": 29731815,
      "score": 2,
      "time": 1640822959,
      "title": "Ghislaine Maxwell convicted in Epstein sex abuse case",
      "type": "story",
      "url": "https://www.politico.com/news/2021/12/29/ghislaine-maxwell-convicted-in-epstein-sex-abuse-case-526252"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29731797,
      "score": 1,
      "time": 1640822796,
      "title": "2021 Climate Year in Review",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/29/climate/2021-climate-year-in-review.html"
    },
    {
      "by": "bmc7505",
      "descendants": 0,
      "id": 29731774,
      "score": 1,
      "time": 1640822593,
      "title": "To H.B. Curry: Essays on Combinatory Logic, Lambda Calculus and Formalism",
      "type": "story",
      "url": "https://archive.org/details/tohbcurryessayso00edit"
    },
    {
      "by": "ajs256",
      "descendants": 0,
      "id": 29731739,
      "score": 1,
      "time": 1640822416,
      "title": "Button of the month: the Motorola Razr internet button",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/29/22857413/motorola-razr-internet-button-flip-phone-data-cellular-charges"
    },
    {
      "by": "inrustwetrust",
      "descendants": 3,
      "id": 29731718,
      "kids": [
        29731786,
        29731728,
        29731742,
        29731804
      ],
      "score": 1,
      "text": "I feel like I screwed up in life it took me multiple attempts to finally complete the college bachelor degree and I have second thoughts about progressing into uni masters. I want to get into big corp. I did an internship as a full stack dev and I also do full stack as a hobby. I got two team projects both 1 semester.\nNot sure if that matters much.\nAny advice?",
      "time": 1640822306,
      "title": "Ask HN: Is it too late to start CS masters with 27?",
      "type": "story"
    },
    {
      "by": "NoCymer",
      "descendants": 0,
      "id": 29731713,
      "score": 1,
      "time": 1640822268,
      "title": "Anime themed Chrome landing page",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/nexxt-tabs/dbocanalfbkfdbpjpnbjmipaidlogbmi"
    },
    {
      "by": "fb_sucks",
      "descendants": 1,
      "id": 29731667,
      "kids": [
        29731721
      ],
      "score": 1,
      "text": "I recently experienced an interesting situation.  The administrator and a moderator of a FB group posted defamatory information about me.  Not opinion.  Categorical statements that are demonstrably false...and they know it.<p>What&#x27;s interesting is that they simultaneously shut down comments and banned me from the group.  I learned of this through friends who are still in the group.<p>For the curious, the root of the issue was a discussion I initiated about a new tax measure that would cost homeowners in the town this group serves thousands of dollars per year.  The administrator removed the post and banned me from the group.  Why?  Because the taxes collected by that measure benefit the union they belong to.  In other words, the intent was to silence discussion that could reveal this to people who don&#x27;t normally read the fine print.<p>This led to a private discussion where I explained that this was relevant content and that instantly banning me from the group was an overreaction.  I did not know, until muy later, that they stood to personally benefit if people voted for this measure.  The conversation contained no threats or nasty language.  If you read it, it looks and sounds exactly as this post.<p>This event made me realize that Facebook provides no recourse whatsoever to deal with something like this.  Group administrators and moderators can do and say anything they want without repercussions.  The only way to even attempt something would require hiring an attorney to go after them for defamation.  Facebook remains immune due to current legislation.  The group administrators and moderators, not so.<p>Imagine someone creating a group on FB to serve as the source of news and information for a town.  Imagine these people then engaging in blocking any information that does not align with their political stance or might not benefit them financially.  We are not talking about pro-democrats vs. pro-republicans here.  That&#x27;s not the story.  It&#x27;s about filtering discussions of measures people will have to vote on to disallow conversations about those they do not agree with.<p>It seems truly twisted that Facebook can be used this way.  A person or people take ownership of a community group, twist it to distort reality and, beyond that, ban and defame anyone who they disagree with.<p>Does anyone on HN have a contact in Facebook who might be interested in looking into this matter to right a very real wrong and, perhaps, learn from it to improve similar community groups?<p>I&#x27;ve spoken to attorneys.  A defamation lawsuit is a really nasty thing.  People can lose their home and more over these things.  I have no interest in doing that to someone else (two attorneys have told me this is a solid case of defamation).  The correct outcome in this case should be that the group needs to be taken away from them and they should be permanently banned from re-entering it in any way, perhaps even from starting any other group or page on FB.<p>Thanks.",
      "time": 1640821926,
      "title": "Ask HN: Facebook has no mechanism to fight defamation",
      "type": "story"
    },
    {
      "by": "grawprog",
      "descendants": 0,
      "id": 29731661,
      "score": 2,
      "time": 1640821878,
      "title": "‘Psycho’ squirrel’s 48-hour Christmas rampage terrorizes town, injures 18",
      "type": "story",
      "url": "https://nypost.com/2021/12/29/squirrel-from-hell-injures-18-during-48-hour-biting-spree/"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 29731660,
      "score": 2,
      "time": 1640821859,
      "title": "Why Learn Compilers",
      "type": "story",
      "url": "https://amasad.me/compilers"
    },
    {
      "by": "monkeydj",
      "descendants": 2,
      "id": 29731649,
      "kids": [
        29731734,
        29731708
      ],
      "score": 1,
      "text": "Get funded?<p>I created a few scripts to automate my personal take on music marketing and to market my musical releases. Observing my results, a few musicians asked me to do the same for them and I charge them for it. I am actually making money running their marketing campaigns and I am starting to think of creating a platform out this. I talked with a few music labels too and I got some excited people waiting for the platform to be ready.<p>The problem: I got a 9-5 programming job that pays the bills and I got a recently born baby, no free time (and no mental capacity) anymore to work on my platform, despite having people asking about the progress of almost daily. Also I have not enough savings to quit my job.<p>Dream Scenario: I would love to get some funding so I can pay my bills and dedicate 40H weekly on developing my platform.<p>Is it dreaming too much? Do you guys think it would be possible? How so? I’m open to suggestions.<p>Cheers",
      "time": 1640821720,
      "title": "How to get funded in this case?",
      "type": "story"
    }
  ]
}