{
  "stories": [
    {
      "by": "ksec",
      "descendants": 0,
      "id": 32166316,
      "score": 1,
      "time": 1658327677,
      "title": "Ruby Evolution: List of new significant features that emerged in Ruby since 2.0",
      "type": "story",
      "url": "https://rubyreferences.github.io/rubychanges/evolution.html"
    },
    {
      "by": "chiefgui",
      "descendants": 0,
      "id": 32166304,
      "score": 1,
      "time": 1658327628,
      "title": "Show HN: Superstate, a state management library for JavaScript apps",
      "type": "story",
      "url": "https://superstate.dev/"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 32166200,
      "score": 1,
      "time": 1658327079,
      "title": "A unique stone-skipping-like trajectory of asteroid Aletai",
      "type": "story",
      "url": "https://phys.org/news/2022-07-unique-stone-skipping-like-trajectory-asteroid-aletai.html"
    },
    {
      "by": "AnhTho_FR",
      "descendants": 1,
      "id": 32166185,
      "kids": [
        32166186
      ],
      "score": 3,
      "time": 1658327031,
      "title": "Request for actual startup downturn *tactics* founders need",
      "type": "story",
      "url": "https://sifted.eu/articles/startup-downturn-advice/"
    },
    {
      "by": "mmastrac",
      "descendants": 0,
      "id": 32166175,
      "score": 1,
      "time": 1658327001,
      "title": "General Motors Streetcar Conspiracy",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/General_Motors_streetcar_conspiracy"
    },
    {
      "by": "clessg",
      "descendants": 0,
      "id": 32166171,
      "score": 1,
      "time": 1658326992,
      "title": "Ambitious Applications with LiveView – Building a Flight Simulator [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=1vvvJkwzf5I"
    },
    {
      "by": "04rob",
      "descendants": 0,
      "id": 32166149,
      "score": 2,
      "time": 1658326876,
      "title": "Alaska Airlines’ new electronic bag tag will let you speed through the airport",
      "type": "story",
      "url": "https://techcrunch.com/2022/07/19/alaska-airlines-new-electronic-bag-tag-will-let-you-speed-through-the-airport-lobby/"
    },
    {
      "by": "blueberrychpstx",
      "descendants": 0,
      "id": 32166146,
      "score": 2,
      "text": "And if not, how do you avoid not having it irk the hell out of you?<p>I don&#x27;t mean for this to come off as overly negative. I don&#x27;t think anything bad about my teammates. It&#x27;s just kind of frustrating to try and instill values that are more or less dismissed or ignored :&#x2F;<p>Wondering if others feel the same, if it&#x27;s like this everywhere, or if there is a place where you can learn from developers who are passionate about high quality code and improving their craft or if it is just more or less &quot;ship it and move on&quot;",
      "time": 1658326853,
      "title": "Ask HN: Do your colleagues care about code quality?",
      "type": "story"
    },
    {
      "by": "iusonmez",
      "descendants": 1,
      "id": 32166144,
      "kids": [
        32166145
      ],
      "score": 2,
      "time": 1658326844,
      "title": "0% transaction fee eCommerce platform for small businesses",
      "type": "story",
      "url": "https://vetrinalive.com/"
    },
    {
      "by": "tedpower",
      "descendants": 2,
      "id": 32166140,
      "kids": [
        32166195
      ],
      "score": 7,
      "text": "Hi HN! We’re Ted and Thomas from Bend (<a href=\"https:&#x2F;&#x2F;bend.green&#x2F;product\" rel=\"nofollow\">https:&#x2F;&#x2F;bend.green&#x2F;product</a>). We help companies measure their carbon emissions by connecting to your corporate bank account (Brex, Mercury, or any other financial institution on Plaid) and then estimating the impact of each purchase.<p>Thomas and I found our way to this project via our background in fintech. Prior to Bend, I was a co-founder of Abacus (YC W14), a spend management company. At Abacus, we noticed that finance teams are increasingly paying attention to the climate impact of their purchase decisions, from travel policies, to cloud hosting, and beyond.<p>We believe this &#x27;spend based&#x27; approach is the key to unlocking scalable carbon accounting. Today, most carbon accounting is manual, conducted once a year, and takes weeks or months to complete. It&#x27;s like doing your taxes.<p>Fortunately, in the last couple years, we’ve started to reach a critical mass of good merchant data. It used to be that only a handful of companies tracked and disclosed their emissions. Today, 70%+ of Fortune 500 companies disclose their emissions in annual sustainability reports, and 1&#x2F;3 of the entire global economy is now covered by a Science Based Target (and this coverage and quality is accelerating). The spend-based approach is fully automated and starts working the moment you connect your bank account.<p>That’s the good news. The bad news is that this emissions data is trapped in PDFs and blog posts, scattered across the internet. We aggregate and normalize this data by hand today, and plan to automate the process in the future.<p>Here’s how we measure the tCO2e (metric tons of carbon dioxide equivalents) of your transactions: imagine that you get a $1,000 bill from Atlassian and want to know the carbon impact of that purchase. We know that for every $1,000 spent with Atlassian, there’s a 30.2 kg footprint — we multiply your bill total * (Atlassian’s annual emissions &#x2F; Atlassian’s annual revenue) and return the tCO2e of that transaction.<p>Now imagine a similar calculation for each of the thousands of purchases your company makes every month &#x2F; quarter &#x2F; year. For merchants that don’t yet publish their emissions data, we fall back to category averages (e.g. for a Starbucks, we use the specific Starbucks carbon intensity factor, but for a mom-and-pop coffee shop that doesn’t disclose their greenhouse gas info, we use a generic benchmark ‘coffee shop’ factor).<p>To get a feel for the data we track, click on some of the corporate logos on <a href=\"https:&#x2F;&#x2F;bend.green&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;bend.green&#x2F;</a> — these aren’t customers; they’re examples of Bend’s merchant data. We have a climate scientist PhD on the team named Marion — we’d be happy to answer questions about our methodology!<p>Measuring and reducing your company’s emissions is of course good for the planet, but it also prepares your company for upcoming regulations and investor requirements. We help you create a &#x27;climate profile&#x27; that you can use to close sales as the sustainable alternative to your competitors (you can share your info with prospects, customers, employees, investors, etc. — think of it like the climate equivalent of becoming SOC 2 compliant). And we just rolled out the ability to purchase carbon removal credits, powered by Patch, to offset some or all of your remaining emissions (optionally opt-in to automatic monthly purchasing).<p>Our pricing is $100 &#x2F; month per company, and your company can try Bend for free for 14 days: <a href=\"https:&#x2F;&#x2F;app.bend.green&#x2F;sign-up\" rel=\"nofollow\">https:&#x2F;&#x2F;app.bend.green&#x2F;sign-up</a><p>Bonus points: if you’re building a fintech app, Bend data is also available via API (email us for API keys and docs). And if you work at a large &#x2F; public company that already measures emissions, we encourage you to claim your company profile on Bend (for free!), and ask your vendors to track their emissions (after all, your vendors’ emissions become your emissions).<p>We’d love to hear your feedback and we’re excited to answer any questions!",
      "time": 1658326837,
      "title": "Launch HN: Bend (YC S22) – Automatically measure your company's carbon footprint",
      "type": "story"
    }
  ]
}