{
  "stories": [
    {
      "by": "cion",
      "descendants": 0,
      "id": 28199114,
      "score": 1,
      "time": 1629127220,
      "title": "Tesla’s Autopilot faces US investigation after crashes with emergency vehicles",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/aug/16/teslas-autopilot-us-investigation-crashes-emergency-vehicles"
    },
    {
      "by": "rainhacker",
      "descendants": 0,
      "id": 28199102,
      "score": 1,
      "time": 1629127141,
      "title": "Who Americans spend their time with, by age",
      "type": "story",
      "url": "https://www.factoftheday1.com/p/august-16-who-americans-spend-their"
    },
    {
      "by": "Pavlyshyna",
      "descendants": 0,
      "id": 28199089,
      "score": 4,
      "text": "Hi HN, I&#x27;m Stacy from Awesomic (<a href=\"https:&#x2F;&#x2F;www.awesomic.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.awesomic.io&#x2F;</a>). Awesomic is a website where you create a design task and receive a draft from a professional designer in 24 hours.<p>On freelance platforms, it takes up to 7-14 days to find the right designer. You negotiate, then manage, and you need to look for a new person every time a new task is needed, like branding first and then a website design for web and mobile. With Awesomic, our algorithm connects you based on availability and expertise required. Then, you never manage this person or worry about deadlines—we do it automatically and guarantee a 24h turnaround. You have all skills covered under one fixed price subscription.<p>While running a local online business (coding school, the first Github partner in the CIS region), we had the hard time hiring the right designer part-time. We experienced a lack of quality, style consistency and speed as freelancers changed. Roman, my co-founder, thought that being matched with the right person on subscription would be the perfect solution. We got traction in 10 days just from the idea, with no product. Our first client was YC alumni Outtalent, and the next 20 clients came from word of mouth. Our best-selling ad was a napkin left in a co-working space—it brought us People.ai as a client.<p>For the first 2 months, we emulated the app processes manually and turned the tasks around in 24 hours via email. Since then we’ve been gradually building software for everything that can be automated, including matching tasks, managing daily updates, files and communication. \nOur matching algorithm defines the criteria of each task (like timezone, type of task, software) and finds the best-fit designer due to them. When you create a logo task, you work with the best logo&#x2F;branding designer. When you do an app or landing page that requires different skills, an algorithm will match you with a great UI&#x2F;UX designer. If you like the result, you will continue to work with the same person based on matching.<p>When you log into our app (<a href=\"https:&#x2F;&#x2F;app.awesomic.io&#x2F;login\" rel=\"nofollow\">https:&#x2F;&#x2F;app.awesomic.io&#x2F;login</a>), you can choose any popular design task brief or add a custom one. Then you describe the task, and it gets matched with the best-fit designer. In 24 hours you see the first results, and every business day a new update is guaranteed for you. So you can iterate fast on any visuals and stick to your deadlines. The expertises covered are branding, graphics, product UI&#x2F;UX design and animations. You communicate with the designers directly in the app, via comments or screenshare calls. All files are stored on private DigitalOcean Spaces and are accessible over the platform, so you don’t need to go back and forth between various tools, email, etc. We operate on a subscription model, but it is flexible: startups can upgrade&#x2F;downgrade or cancel their plans anytime. This helps to stay cost-effective and scale easily.<p>Here’s a case study on how we made a redesign for the most funded app on Kickstarter: <a href=\"http:&#x2F;&#x2F;awesomic.io&#x2F;case-study&#x2F;memory-os\" rel=\"nofollow\">http:&#x2F;&#x2F;awesomic.io&#x2F;case-study&#x2F;memory-os</a>. Here’s one on a Norwegian fitness startup using us for 18+ months already—their app is in the top 10 most popular apps in the country: <a href=\"https:&#x2F;&#x2F;www.awesomic.io&#x2F;case-study&#x2F;entirebody\" rel=\"nofollow\">https:&#x2F;&#x2F;www.awesomic.io&#x2F;case-study&#x2F;entirebody</a>.<p>As specialists, we’ve been reading HN for quite some time and we are really excited to share our story with you. We would love to hear back from the community! How do you manage your design tasks? What is the most painful?",
      "time": 1629127088,
      "title": "Launch HN: Awesomic (YC S21) – Get design tasks done with 24h turnaround",
      "type": "story"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 28199077,
      "score": 1,
      "time": 1629127006,
      "title": "Remember When Multiplayer Gaming Needed Envelopes and Stamps?",
      "type": "story",
      "url": "https://www.wired.com/story/multiplayer-gaming-envelopes-stamps-play-by-mail-history/"
    },
    {
      "by": "TangerineDream",
      "descendants": 0,
      "id": 28199067,
      "score": 1,
      "time": 1629126962,
      "title": "Intel’s Arc GPUs will compete with GeForce and Radeon in early 2022",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/08/intels-arc-gpus-will-compete-with-geforce-and-radeon-in-early-2022/"
    },
    {
      "by": "durmonski",
      "descendants": 0,
      "id": 28199054,
      "score": 1,
      "time": 1629126878,
      "title": "7 Ways to Use Systems Thinking in Your Daily Life",
      "type": "story",
      "url": "https://durmonski.com/life-advice/use-systems-thinking-in-daily-life/"
    },
    {
      "by": "jaredwiener",
      "descendants": 0,
      "id": 28199051,
      "score": 1,
      "time": 1629126870,
      "title": "Tesla's Autopilot systems the subject of new NHTSA investigation",
      "type": "story",
      "url": "https://abcnews.go.com/Business/teslas-autopilot-systems-subject-nhtsa-investigation/story?id=79478673"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 28199014,
      "score": 1,
      "time": 1629126672,
      "title": "Index Sets and Parallelism-Preserving Autodiff for Pointful Array Programming",
      "type": "story",
      "url": "https://arxiv.org/abs/2104.05372"
    },
    {
      "by": "malshe",
      "descendants": 0,
      "id": 28199003,
      "score": 1,
      "time": 1629126629,
      "title": "Integrating Hands-On Research Projects into a Machine Learning Course",
      "type": "story",
      "url": "https://arxiv.org/abs/2107.13671"
    },
    {
      "by": "sarreph",
      "descendants": 0,
      "id": 28198997,
      "score": 1,
      "time": 1629126590,
      "title": "Twitter's new design to get fix after headache complaints",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-58232131"
    }
  ]
}