{
  "stories": [
    {
      "by": "Beatnick",
      "descendants": 0,
      "id": 27853080,
      "score": 2,
      "time": 1626410170,
      "title": "Des signaux liés aux premières étoiles de l'Univers auraient été détectés",
      "type": "story",
      "url": "https://www.agences-spatiales.fr/premieres-etoiles-de-lunivers/"
    },
    {
      "by": "panic",
      "descendants": 0,
      "id": 27853079,
      "score": 2,
      "time": 1626410169,
      "title": "You’re Doing It Wrong: Notes on Criticism and Technology Hype",
      "type": "story",
      "url": "https://sts-news.medium.com/youre-doing-it-wrong-notes-on-criticism-and-technology-hype-18b08b4307e5"
    },
    {
      "by": "jucasoliveira",
      "descendants": 0,
      "id": 27853068,
      "score": 1,
      "text": "Hi all, I&#x27;m a Brazilian which has moved to Ireland in 2015 to study English. Back then I knew little about the country, only things I saw on the TV\\Youtube\\Wikipedia, and I didn&#x27;t know the IT market was booming here and, surprise, that&#x27;s my expertise. When I&#x27;ve discovered that, I&#x27;ve joined a community called IT in Dublin, which is an &quot;open source&quot; Brazilian group dedicated to helping each other to understand visas, regulations, how to improve your CVs, etc. This group helped me a lot and, after 8 months, I got a job and then I could give back to the group, helping others to follow the same path.<p>From 2015 till now a lot of information was improved, but we still receive a lot of requests&#x2F;questions from the group about the information we already have explained and provided links for anyone to have access to any information we gathered. Still, many newcomers complain that information was misleading or not useful anymore, which makes me start to think of a way to help more.<p>In 2019, I was studying and developing Machine Learning, and in one of my studies I could create a model which could give back to a potential immigrant their chances to move to another country, from that moment I thought this could be useful as a piece of information, so I decided to gather everything I knew about immigration in Ireland and Europe and create an App<p>Introducing ClusterStack<p>The goal of ClusterStack is to be a one-stop shop for immigrants, to help anyone who wants to move to a country, to do it safely . And, after a lot of research and studies , I&#x27;ve identified and simplified the steps needed for wannabe immigrants to fully reposition themselves elsewhere. To do so, they need to have access to :<p>- Information about the country visa process, cost of living, avg. salary of their specialisation, and their chances to move to a country .<p>- Ability to apply for job positions of companies that accept international candidates  .<p>- A tool that automatically handles the candidate visa application .<p>- A social networking helps the migrant to be embedded in their new community .<p>As I was developing this App, I saw I needed to do this project in parts, first focusing on certain types of foreigners, information, and jobs.So for now, as ICT workers are more likely to get visa approvals, I’ve finished the first part of the app for those in that area, so if you’re a tech employee, you can go onto the App and you can check all sorts of information... and jobs to apply, FOR FREE.<p>For recruiters who might see this post, I’m open for partner with you, more jobs that provide help for those who seek to move abroad the better.<p>You can download it here: https:&#x2F;&#x2F;lnkd.in&#x2F;dfYJhPB<p>So, if you find it could be interesting, give it a try.<p>Just a quick reminder: As a solo programmer of this App, there&#x27;s a lot of bugs and problems, mainly on Android, if you spot something, please let me know.",
      "time": 1626409867,
      "title": "Show HN: I've been working on an app to help immigrants",
      "type": "story"
    },
    {
      "by": "vpj",
      "descendants": 0,
      "id": 27853060,
      "score": 2,
      "time": 1626409760,
      "title": "Real-Time Super-Resolution System of 4K-Video Based on Deep Learning",
      "type": "story",
      "url": "https://papers.labml.ai/paper/2107.05307"
    },
    {
      "by": "hackwith",
      "descendants": 1,
      "id": 27853055,
      "kids": [
        27853085
      ],
      "score": 1,
      "time": 1626409678,
      "title": "Californian nuclear energy provider partners with Bitcoin mining firm Compass",
      "type": "story",
      "url": "https://www.theblockcrypto.com/linked/111584/nuclear-power-partnership-bitcoin-mining-firm-compass"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 27853041,
      "score": 1,
      "time": 1626409505,
      "title": "Study reveals new aspects related to plant processing in Neolithic Çatalhöyük",
      "type": "story",
      "url": "https://www.heritagedaily.com/2021/07/study-reveals-new-aspects-related-to-plant-processing-in-neolithic-catalhoyuk/139681"
    },
    {
      "by": "rajeevk",
      "descendants": 0,
      "id": 27853040,
      "score": 3,
      "time": 1626409474,
      "title": "Don't Solve Problems, Eliminate Them",
      "type": "story",
      "url": "https://kentcdodds.com/blog/don-t-solve-problems-eliminate-them"
    },
    {
      "by": "rhardih",
      "descendants": 0,
      "id": 27853033,
      "score": 1,
      "time": 1626409307,
      "title": "Show HN: A CLI tool to generate Cistercian numerals",
      "type": "story",
      "url": "https://github.com/rhardih/cistercian"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27853029,
      "score": 2,
      "time": 1626409291,
      "title": "Bezos's space-flight winner won’t go due to ‘scheduling conflicts’",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2021/jul/15/jeff-bezos-space-flight-guest-new-shepard"
    },
    {
      "by": "Black101",
      "descendants": 0,
      "id": 27853004,
      "score": 5,
      "time": 1626408919,
      "title": "Japan Shattered Internet Speed Record at 319 Terabits per Second",
      "type": "story",
      "url": "https://interestingengineering.com/japan-shattered-internet-speed-record-319-terabits"
    }
  ]
}