{
  "stories": [
    {
      "by": "JasonFruit",
      "descendants": 0,
      "id": 31562641,
      "score": 1,
      "time": 1653938605,
      "title": "Bluebird Ultralight Motorfloater",
      "type": "story",
      "url": "http://m-sandlin.info/Bluebird/Bluebird%20Page.html"
    },
    {
      "by": "LionTamer",
      "descendants": 0,
      "id": 31562606,
      "score": 1,
      "time": 1653938391,
      "title": "Duke Medical prof. calls mandatory equity training “Maoist political propaganda”",
      "type": "story",
      "url": "https://www.dukechronicle.com/article/2022/05/duke-university-school-of-medicine-professor-describes-mandatory-equity-training-as-maoist-political-propaganda-refuses-to-attend"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 31562589,
      "score": 1,
      "time": 1653938302,
      "title": "The Radiating Circles of DX Architecture",
      "type": "story",
      "url": "https://dx.tips/circles"
    },
    {
      "by": "tectonic",
      "descendants": 0,
      "id": 31562578,
      "score": 1,
      "time": 1653938246,
      "title": "A philosophers case against death",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/a-philosophers-case-against-death/"
    },
    {
      "by": "ruckfool",
      "descendants": 0,
      "id": 31562563,
      "score": 1,
      "time": 1653938144,
      "title": "Sidhu Moosewala Shot Dead",
      "type": "story",
      "url": "https://www.bbc.com/news/world-asia-india-61629133"
    },
    {
      "by": "aumakua",
      "descendants": 0,
      "id": 31562561,
      "score": 2,
      "text": "I know this is an oft-raised subject on HN but I find that none of the tools I&#x27;ve come across thus far have solved any of my problems. As someone with poor impulse control and decent digital literacy, I find that I ignore any tracker app that tells me I&#x27;m on my computer too often, and I will circumvent any blocker I set up to disallow me from accessing media that I had earlier decided I should consume less of.<p>I&#x27;m wondering if anyone knows of a tool that exists that will force my devices to shut off at a certain time and cannot be disabled with a few shell commands. I know this is a bit absurd but this is the reality of my situation (working from home, sleeping at 3-4AM for no particular reason) and I can&#x27;t think of any effective solution that doesn&#x27;t gimp my actual work routine in the day.<p>I also have an issue with constant alt-tabbing and ctrl-tabbing when I&#x27;m on the internet, even when I&#x27;m literally in the process of reading an article or watching a video (both in recreational and educational scenarios). Curious as to how many others do this as well, and if there&#x27;s some sort of tool that someone has written to disallow this kind of behavior (perhaps adding some sort of &quot;cooldown&quot; to an alt-tab or shift-tab).<p>Sorry for raising this topic once again but any suggestions would be greatly appreciated!",
      "time": 1653938121,
      "title": "Ask HN: Tools for mitigating digital addiction, any suggestions?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31562558,
      "score": 2,
      "time": 1653938113,
      "title": "We All Need Almalinux",
      "type": "story",
      "url": "https://meshedinsights.com/2022/05/30/why-we-all-need-almalinux/"
    },
    {
      "by": "mfsch",
      "descendants": 1,
      "id": 31562529,
      "kids": [
        31562640
      ],
      "score": 2,
      "time": 1653937982,
      "title": "NixOS 22.05 Released",
      "type": "story",
      "url": "https://nixos.org/blog/announcements"
    },
    {
      "by": "Kortaggio",
      "descendants": 0,
      "id": 31562478,
      "score": 1,
      "time": 1653937715,
      "title": "Friendships form via shared context, not shared activities",
      "type": "story",
      "url": "https://billmei.net/blog/friendship"
    },
    {
      "by": "pipeline_peak",
      "descendants": 0,
      "id": 31562460,
      "score": 2,
      "text": "I don’t have a lot of experience in Node development. From a glance, my idea of a bundler is a utility that takes code from software packages and assembles it with autogenerated boilerplates to produce front end applications that can run without any backend dependence.<p>From looking at a few, my concern is they are inherently bloated and fill a gap that really shouldn’t exist.<p>Shouldn’t JS client code be assembled with packages as a standard, something that compiles together without all this filler nonsense?<p>These things typically produce tens of thousands of lines just to add simple libraries.",
      "time": 1653937621,
      "title": "Ask HN: Are JS bundlers filling a design flaw?",
      "type": "story"
    }
  ]
}