{
  "stories": [
    {
      "by": "maddiehalla",
      "descendants": 0,
      "id": 30672841,
      "score": 2,
      "text": "Hi HN! Maddie and Patrick here. We founded Living Carbon (<a href=\"https:&#x2F;&#x2F;www.livingcarbon.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.livingcarbon.com</a>), a biotech company developing trees that grow faster, capture more carbon, and produce more durable wood.<p>We aim to harness the power of synthetic biology to enhance plants’ natural ability to draw down and sequester carbon. By increasing the efficiency of photosynthesis, we can help trees grow faster and capture more carbon from the atmosphere.<p>We released research results indicating that photosynthesis enhanced trees grow faster and capture more carbon [1, 2]. After multiple generations of vegetatively propagated tree seedlings studied in a controlled environment, our lead photosynthesis-enhanced poplar tree seedling showed a 53% increase in above ground biomass. Data from our molecular, morphology, and physiology analyses indicate that our photosynthesis-enhancement design works as intended. We’re continuing to study these seedlings in field trials and pilot projects across the US.<p>Forest carbon drawdown is one of our greatest allies in the climate crisis, but the impact of forest carbon solutions has been constrained by land-use efficiency, suitability of land to support forest stands, the growth rate of trees, and the duration of carbon storage before it is released back into the atmosphere. There are many strategies to enhance carbon capture in plants, including nitrogen fixating microbes, resistance to disease and drought, salt tolerance, decomposition resistance, and photosynthesis enhancement. Our initial focus has been two-fold: (1) improve carbon capture in trees via more efficient photosynthesis, and (2) improve carbon storage through decay-resistant wood, which slows the release of carbon through decomposition resistance.<p>Our approach to photosynthesis enhancement is actually pretty basic. It’s an alternative metabolic bypass pathway that allows our seedlings to break down toxic byproducts of photosynthesis using less energy. Usually, waste products of photorespiration are exported from the chloroplast to multiple organelles for metabolic cycling. Our biotechnology enables the chloroplast to break down these waste products internally and turn them into energy-rich glucose and cellulose, thereby growing faster and capturing more CO₂ over time. This method can operate across many different species and doesn&#x27;t require an intensive human re-engineering process.<p>This process is similar to the natural process that already exists in 15% of plants, called C4 carbon fixation, which have separately evolved special features to combat photorespiration and are more photosynthetically efficient and productive. Examples of C4 plants include corn, sorghum, and sugarcane. Most other plants are C3 plants which experience photorespiration. Our strategy achieves similar results to C4 carbon fixation in C3 plants, starting with trees.<p>C4 carbon fixation evolved when CO₂ partial pressure was low and there was a higher partial pressure of oxygen in the air, which is the opposite of the trajectory we see today. The anthropogenic increase in atmospheric CO₂ has reduced the selection pressure on C4 plants. Rather than try to go against this evolutionary process, we incorporated natural processes from other plants and algae to achieve the same effect of avoiding photorespiration. The result is the creation of C3 plants that convert CO₂ to sugar more efficiently.<p>To ensure this carbon is stored for longer, we are also developing a trait to naturally slow decay by increasing metal accumulation in plants. Our trees accumulate metals from the soil, making their wood less digestible to fungi and slowing the return of CO2 to the atmosphere. As a bonus, this makes our trees uniquely well suited to land with high heavy metal concentration. We’re targeting underutilized, abandoned mine land across the U.S.—areas where trees would otherwise not grow.<p>If we can increase the efficiency of photosynthesis by 30-40% and if we can also reduce the decomposition rate of wood, then we will have a biological method of active drawdown that avoids the conflicting incentives, high starting costs, and requirement for ongoing and intensive management seen in methods such as direct air capture.<p>Living Carbon got started when Maddie read a paper on improving photosynthesis in tobacco and thought that someone should try this in trees. After talking to the author of that paper and other experts in forest biotechnology, turns out it wasn&#x27;t only possible but a very good idea.<p>We want to help ignite hope, in our current era of climate instability, that we can use the tools of biotechnology to empower our ecosystems and help plants do what they do best. We welcome your thoughts and discussion!<p>[1] <a href=\"https:&#x2F;&#x2F;www.biorxiv.org&#x2F;content&#x2F;10.1101&#x2F;2022.02.16.480797v1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.biorxiv.org&#x2F;content&#x2F;10.1101&#x2F;2022.02.16.480797v1</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.livingcarbon.com&#x2F;post&#x2F;photosynthesis-enhanced-trees-grow-faster-and-capture-more-carbon\" rel=\"nofollow\">https:&#x2F;&#x2F;www.livingcarbon.com&#x2F;post&#x2F;photosynthesis-enhanced-tr...</a>",
      "time": 1647268138,
      "title": "Launch HN: Living Carbon (YC W20) – Trees that capture and store more CO2",
      "type": "story"
    },
    {
      "by": "HieronymusBosch",
      "descendants": 0,
      "id": 30672819,
      "score": 1,
      "time": 1647268020,
      "title": "How sharding a database can make it faster",
      "type": "story",
      "url": "https://stackoverflow.blog/2022/03/14/how-sharding-a-database-can-make-it-faster/"
    },
    {
      "by": "peter_retief",
      "descendants": 0,
      "id": 30672807,
      "score": 1,
      "time": 1647267975,
      "title": "Lee Cronin: Origin of Life, Aliens, Complexity, and Consciousness",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ZecQ64l-gKM"
    },
    {
      "by": "eth0up",
      "descendants": 0,
      "id": 30672805,
      "score": 1,
      "time": 1647267955,
      "title": "Stephen W Hawking (1.8.1942 – 3.14.2018)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Stephen_Hawking"
    },
    {
      "by": "999900000999",
      "descendants": 0,
      "id": 30672804,
      "score": 1,
      "time": 1647267955,
      "title": "‘I can’t move my car’: Americans struggle as vehicle expenses rise",
      "type": "story",
      "url": "https://www.theguardian.com/us-news/2022/mar/13/us-car-vehicle-expenses-rise"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30672802,
      "score": 1,
      "time": 1647267948,
      "title": "DevRel Community Africa",
      "type": "story",
      "url": "https://devrelcomafrica.notion.site/devrelcomafrica/DevRel-Community-Africa-7da776c74077430896a6d37b85fd1f32"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30672795,
      "score": 1,
      "time": 1647267875,
      "title": "Why U.S. Frontline Workers Are Quitting",
      "type": "story",
      "url": "https://hbr.org/2022/03/why-u-s-frontline-workers-are-quitting"
    },
    {
      "by": "allanmacgregor",
      "descendants": 0,
      "id": 30672782,
      "score": 2,
      "text": "Hey HN! I&#x27;m looking to compile a list of interesting and useful protocols that would be good to be aware of as software developer.<p>Secondary goal is to find ideas for clients, and proofs of concepts to implement on niche languages. For example some that I have added to the list already<p>- DNS \n- SMTP\n- Scalar \n- Redis Protocol \n- gRPC<p>What else is out there that is interesting or could be fun to implement from scratch?",
      "time": 1647267806,
      "title": "Ask HN: Which protocols should every developer know?",
      "type": "story"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 30672767,
      "score": 1,
      "time": 1647267694,
      "title": "Give me a browser, I’ll give you a Shell",
      "type": "story",
      "url": "https://systemweakness.com/give-me-a-browser-ill-give-you-a-shell-de19811defa0?gi=10556a69cebd"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30672761,
      "score": 2,
      "time": 1647267653,
      "title": "Three CISOs Walk into a Startup",
      "type": "story",
      "url": "https://www.lastweekasavciso.com/p/three-cisos-walk-into-a-startup"
    }
  ]
}