{
  "stories": [
    {
      "by": "throwaway743",
      "descendants": 0,
      "id": 31808977,
      "score": 1,
      "time": 1655724272,
      "title": "DIY PS5 Slim",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=he6xyl_MHXY"
    },
    {
      "by": "jakobgreenfeld",
      "descendants": 0,
      "id": 31808959,
      "score": 2,
      "time": 1655724170,
      "title": "Cheat, Pray, Work: How to win the attention game",
      "type": "story",
      "url": "https://jakobgreenfeld.com/cheat-pray-work"
    },
    {
      "by": "mrtedbear",
      "descendants": 0,
      "id": 31808903,
      "score": 1,
      "time": 1655723632,
      "title": "Longitude found: the story of Harrison's clocks",
      "type": "story",
      "url": "https://www.rmg.co.uk/stories/topics/harrisons-clocks-longitude-problem"
    },
    {
      "by": "chewz",
      "descendants": 0,
      "id": 31808902,
      "score": 2,
      "time": 1655723630,
      "title": "Germany Plans Coal U-Turn, Gas Funding to Offset Russian Cut",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-06-19/germany-taking-steps-on-serious-gas-situation-habeck-says"
    },
    {
      "by": "CarCooler",
      "descendants": 0,
      "id": 31808869,
      "score": 2,
      "time": 1655723344,
      "title": "The James Bond Car That Was Elon Musk's Inspiration for the Tesla Cybertruck",
      "type": "story",
      "url": "https://www.slashgear.com/898878/the-james-bond-car-that-was-elon-musks-inspiration-for-the-tesla-cybertruck/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31808866,
      "score": 2,
      "time": 1655723327,
      "title": "Sega Megadriver Synthesizer in Depth Look (2020)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=eAgwVvJwdnc"
    },
    {
      "by": "Blubal3d",
      "descendants": 0,
      "id": 31808855,
      "score": 1,
      "text": "If you put your poop into an airtight container, it decomposes using a process called anaerobic digestion. This creates biogas, which can be used as an energy source. It is a big business, countries like Germany have around 10000 commercial biogas plants in operation. But also smaller tanks, sometimes smaller than an oil barrel, are often used to power off the grid and rural communities.<p>The composition of the organic waste along with a whole other slew of environmental factors has a massive impact on the energy generated. But because few bother to experiment, on an industrial scale current feedstock is often limited to well understood &quot;safe&quot; substrate such as maize or corn.<p>This is something a Reddit community now aims to tackle.<p>Anaerobic digestion of organic matter is well enough understood, that key components of the process can be described by more or less complex mathematical models. This opens up the possibility to find suitable candidates for new substrate purely through mathematical modeling. This is comparable to the automated drugs discovery process nowadays explored in the pharmaceutical community.<p>Using BioNet, a software modeling the anaerobic digestion process through simplified but established algorithms, a lot of the preliminary investigation is conducted. If suitable revelations about the anaerobic digestion process are found digitally, the hope is to be able to replicate this in a real biogas tank as well. \nCritics are doubtful of the validity of any revelations gained through this endeavor. According to the community, skepticism is warranted. But the successful applicability of anaerobic digestion models in the past raises at least the prospect that digital models are a worthwhile addition for any researcher in the field. It&#x27;s similar to how computational fluid dynamics have augmented real wind tunnels in the design of a vehicle, they say.<p>BioNet and related software do not offer any fundamental new capabilities. But they simplify access to complicated mathematical models, that previously were only reserved to researchers in the field. Making science more open and accessible, is one of the fundamental pillars of biohacking. Because even though vague guesses exist, much of the work is still trial and error. And trial and error benefits from great participation.<p>Links:\nhttps:&#x2F;&#x2F;apps.microsoft.com&#x2F;store&#x2F;detail&#x2F;bionet&#x2F;9NMNRN406NL4?hl=en-en&amp;gl=en<p>https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;Biohackers&#x2F;comments&#x2F;vgicfa&#x2F;powering_your_phone_through_your_poop_biogas&#x2F;",
      "time": 1655723237,
      "title": "A Reddit Community poops for purpose",
      "type": "story"
    },
    {
      "by": "hericium",
      "descendants": 0,
      "id": 31808844,
      "score": 4,
      "time": 1655723147,
      "title": "Former AWS engineer convicted over $270m Capital One hack",
      "type": "story",
      "url": "https://techmonitor.ai/technology/cybersecurity/capital-one-hack-aws-paige-thompson"
    },
    {
      "by": "kmt-lnh",
      "descendants": 0,
      "id": 31808820,
      "score": 2,
      "time": 1655723020,
      "title": "The Return of Industrial Warfare – Royal United Services Institute",
      "type": "story",
      "url": "https://rusi.org/explore-our-research/publications/commentary/return-industrial-warfare/"
    },
    {
      "by": "transpute",
      "descendants": 0,
      "id": 31808813,
      "score": 3,
      "time": 1655722967,
      "title": "Dasharo 1.0 Open-Source Firmware Released for MSI Alder Lake Motherboard",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Dasharo-1.0-Z690-A-Port"
    }
  ]
}