{
  "stories": [
    {
      "by": "thereare5lights",
      "descendants": 0,
      "id": 31244479,
      "score": 1,
      "time": 1651550748,
      "title": "How to protect sources: Politico linked draft copy contains no hints in metadata",
      "type": "story",
      "url": "https://twitter.com/razhael/status/1521310384262635520"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 31244478,
      "score": 1,
      "time": 1651550735,
      "title": "Environmental impact statement released for Sun Cable's $30bn AUD solar project",
      "type": "story",
      "url": "https://www.abc.net.au/news/2022-04-20/environmental-impact-sun-cable-northern-territory/101001042"
    },
    {
      "by": "kaashmonee",
      "descendants": 0,
      "id": 31244475,
      "score": 1,
      "time": 1651550718,
      "title": "Clear illustration of resource allocation in Spark",
      "type": "story",
      "url": "https://spoddutur.github.io/spark-notes/distribution_of_executors_cores_and_memory_for_spark_application.html"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31244457,
      "score": 1,
      "time": 1651550581,
      "title": "Developers Can Dedicate Their Copyrights to Charity to Assure Software Rights",
      "type": "story",
      "url": "https://sfconservancy.org/news/2022/may/02/conservancy-launches-copyright-assignment-system/"
    },
    {
      "by": "sukiyuki",
      "descendants": 1,
      "id": 31244455,
      "kids": [
        31244500
      ],
      "score": 3,
      "text": "There are a few legit companies making decent progress this direction. As an immigrant from an undeveloped country, I love this idea. However, I would like to discuss the legality of their frameworks in the destination countries.<p>There are a few YC companies doing crypto remittances, notably<p>CocoMercado\nAfriex\nLemonade Finance\nPalla<p>Conceptuallly, what they are doing makes sense to me - sending BTC across the border instead of SWIFT. Great. The big promise is explained at length in Techcrunch’s article titled “bootstrapers guide to bitcoin remittances”<p>The Offramp is the problem:<p>But when it comes to crypto -&gt; fiat on recipient’s bank account, here is where it gets problematic for me (i.e. the Offramp).<p>1. They are using a sketchy local broker. Illegal, unlicensed, BUT this works great, since you can focus on the remittance part of the business while someone else solves the crypto liquidity part of the business.<p>2. They themselves provide the offramp and get a license for crypto in the destination country. Legally, thesis great, but I don’t see how this is feasible from the business &#x2F; growth perspective. Basically, your remittance business can grow only as fast as you can grow your bitcoin selling business in that destination country. I don’t see how these sorts of businesses succeed<p>3. They work with an official crypto exchange in that country. This makes sense, but then you can only operate a business like this in a few countries where you actually do have a licensed crypto exchange AND whether or not that exchange will work with you is a big question<p>4. They work with Binance for liquidity. But this doesn’t make any sense, since Binance will settle by sending you fiat via wire anyways, so then you’re just using SWIFT under the hood, so why not just do crypto from the very beginning?<p>Ultimately, if there is a legal way to do this that doesn’t get rid of the benefits, these companies can become big. But it seems like all options either require them to 1) be illegal or “grey” legally 2) give up any benefits brought by crypto. Thoughts?<p>Interesting in hearing about how it could be both legal AND better than SWIFT - what would the required set up look like here?",
      "time": 1651550577,
      "title": "Is Crypto Remittances a Scam or Revolutionary?",
      "type": "story"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31244448,
      "score": 1,
      "time": 1651550529,
      "title": "Pitivi is a Free video editor with a beautiful and intuitive user interface",
      "type": "story",
      "url": "https://pitivi.org/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31244425,
      "score": 1,
      "time": 1651550336,
      "title": "Bear: Markdown Notes for iPhone, iPad, and Mac",
      "type": "story",
      "url": "https://bear.app/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31244421,
      "score": 1,
      "time": 1651550306,
      "title": "Apostrophe: A GTK+ based distraction free Markdown editor",
      "type": "story",
      "url": "https://gitlab.gnome.org/World/apostrophe"
    },
    {
      "by": "KennyFromIT",
      "descendants": 0,
      "id": 31244414,
      "score": 1,
      "text": "Motivation is not usually a problem for founders, per se. But perhaps staying motivated on the &quot;right&quot; thing is (i.e. writing on the truly highest priority task).<p>How do you stay focused and on track through the many ups and downs of creating a new company&#x2F;product while being as a solo founder? Is self motivation enough? Peer groups? Do you hire a project manager to help keep you organized? If the latter, tell me more.",
      "time": 1651550238,
      "title": "Ask HN: Staying motivated and organized as a single founder",
      "type": "story"
    },
    {
      "by": "grunthos",
      "descendants": 0,
      "id": 31244403,
      "score": 1,
      "time": 1651550170,
      "title": "The Most Deadly Project on the Internet?",
      "type": "story",
      "url": "https://hackaday.com/2022/05/02/the-most-deadly-project-on-the-internet/"
    }
  ]
}