{
  "stories": [
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 29679414,
      "score": 1,
      "time": 1640395247,
      "title": "The Shepherd, by Frederick Forsyth, Read by Alan Maitland",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=j2_bLEqmBi0"
    },
    {
      "by": "gfiorav",
      "descendants": 0,
      "id": 29679411,
      "score": 1,
      "time": 1640395225,
      "title": "Covid vs. Christmas: Tracking all top trending emojis with TinyBird",
      "type": "story",
      "url": "https://twitter.com/alrocar/status/1474370571936972806"
    },
    {
      "by": "abroad",
      "descendants": 0,
      "id": 29679372,
      "score": 1,
      "time": 1640394761,
      "title": "Electronics Design Specializations",
      "type": "story",
      "url": "https://electroagenda.com/en/electronics-design-specializations/"
    },
    {
      "by": "maybecrypto",
      "descendants": 0,
      "id": 29679370,
      "score": 2,
      "text": "I&#x27;m an engineer living in SF. I was in college when FB started to become popular (2007), and I remember my more fortunate friends getting the first iteration of the iPhone. Somehow I completely missed these waves - both social and mobile.<p>I studied economics and CS in college, and initially went to McKinsey before getting into enterprise software. I&#x27;ve basically just been sitting in the lineup as others have surfed the massive social&#x2F;mobile waves over the past 10 years. Now I&#x27;m in my early 30s. I&#x27;m a pretty solid developer, and I know how to sell to customers (I&#x27;ve been in enterprise Sales Engineering for the past few years).<p>I&#x27;ve always known that I don&#x27;t want to be an employee of a big tech company for the rest of my working life. I love the Bay Area, and I&#x27;ve been drunk on the startup koolaid since I&#x27;ve been here (I&#x27;ve dabbled in startups but never started my own), and I&#x27;ve always felt like I just needed the right opportunity or idea to fully jump in and become a founder.<p>I got curious about cryptocurrencies in 2017, but didn&#x27;t buy in to the technical feasibility or the ethos. I felt vindicated during the 2018-2019 crypto winter. Now it seems like this is something that just won&#x27;t go away. So many billions of dollars have been raised by VC firms to put into crypto companies and from my perspective it seems like there is a dearth of legitimate, technical entrepreneurs in the space.<p>I still don&#x27;t fully buy into the ethos of it, but it seems like now might be the right time to paddle in and try to ride this thing. I can&#x27;t imagine that every person who got into the .com craze in the 90s was doing it out of genuine passion and interest for the technology - they saw an opportunity and they took it, and maybe they made a decent chunk of money, or at least built an entrepreneurial foundation - that&#x27;s the thing about living in the Bay Area.. even if you fail as an entrepreneur, you still get respect for doing it.<p>So even though I don&#x27;t particularly care about crypto, I have to recognize that I don&#x27;t particularly care about enterprise software either... so why not crypto? Maybe this is my last chance at catching a really good wave.",
      "time": 1640394759,
      "title": "Why Not Crypto?",
      "type": "story"
    },
    {
      "by": "hamiltonians",
      "descendants": 0,
      "id": 29679364,
      "score": 1,
      "text": "Everyday wihtout fail it is the same crypto livestream scam videos. The michael saylor ones alone make at least $1 million a day..that is an insane amount of money, and they do it everyday weeks and months without fail. All while youtube does nothing.<p>I was watching some of the youtube pattrick bet david videos in which he interviews former mobsters, and this youtube crypto scam makes those guys look like amateurs.the youtube scammers make way more money and no risk. No law enforcement , no worries about being murdered. It&#x27;s like the perfect crime, and youtube allows it.<p>One of the addresses for michael saylor video:<p>2.6 btc in hours..crazy<p>1BsmqZcTbr7KiaE6BYYWSVkXWsc4qjn1uu",
      "time": 1640394693,
      "title": "Livestream YouTube crypto scammers making so much..insane",
      "type": "story"
    },
    {
      "by": "privacyisntdead",
      "descendants": 0,
      "id": 29679353,
      "score": 1,
      "text": "Looking for a logical way to make better decisions. I am imagining something algorithmic or an equation.",
      "time": 1640394580,
      "title": "Ask HN: How do you make difficult decisions?",
      "type": "story"
    },
    {
      "by": "DLay",
      "descendants": 0,
      "id": 29679343,
      "score": 1,
      "time": 1640394425,
      "title": "Amazon’s Alexa Stalled with Users as Interest Faded, Documents Show",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-12-22/amazon-s-voice-controlled-smart-speaker-alexa-can-t-hold-customer-interest-docs"
    },
    {
      "by": "puttycat",
      "descendants": 0,
      "id": 29679333,
      "score": 1,
      "time": 1640394345,
      "title": "Hats off to the first deep network that can recognize this",
      "type": "story",
      "url": "https://twitter.com/pmddomingos/status/1473491967061291011"
    },
    {
      "by": "mardiyah",
      "descendants": 3,
      "id": 29679146,
      "kids": [
        29679395,
        29679291
      ],
      "score": 11,
      "time": 1640392283,
      "title": "Thanks to the Chip Shortage, Texas Instruments Is Worth $170 B",
      "type": "story",
      "url": "https://www.wsj.com/articles/thanks-to-the-chip-shortage-texas-instruments-is-worth-170-billion-11640341805"
    },
    {
      "by": "perihelions",
      "descendants": 1,
      "id": 29679142,
      "kids": [
        29679410
      ],
      "score": 21,
      "time": 1640392232,
      "title": "Locked-out New Zealanders outraged as visa scheme for rich foreigners resumes",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/dec/24/locked-out-new-zealanders-outraged-as-visa-scheme-for-rich-foreigners-resumes"
    }
  ]
}