{
  "stories": [
    {
      "by": "sixhobbits",
      "descendants": 0,
      "id": 31284884,
      "score": 1,
      "time": 1651844044,
      "title": "How to build a smart contract oracle with Solidity and Replit",
      "type": "story",
      "url": "https://docs.replit.com/tutorials/44-build-smart-contract-oracle"
    },
    {
      "by": "mavsman",
      "descendants": 0,
      "id": 31284880,
      "score": 1,
      "text": "This whole process is sucky for seemingly no reason. We found our own home we want and put a single offer and it got accepted and yet our realtor is taking a 2.5% cut.<p>Our mortgage officer only seems knowledgeable because they uses terms I can&#x27;t understand but it seems like most of their work is just plugging my numbers into a calculator to tell me my options (and not really giving me much advice). Seems like I could do this myself but I&#x27;m scared my info will get sold to a million more people.<p>Speaking of which, as soon as I submitted information to a loan officer they pulled my credit which then led to dozens of spam calls from mortgage companies. Finally I found out that when my credit was pulled, Equifax gave my info out to a bunch of people telling them I was looking for a mortgage. I don&#x27;t even know where to start with this.<p>These things are just the beginning and I&#x27;d imagine there are some tools or approaches that could reduce the pain, even just a little bit.",
      "time": 1651844026,
      "title": "Ask HN: How to make the home buying/selling process suck less?",
      "type": "story"
    },
    {
      "by": "danyork",
      "descendants": 0,
      "id": 31284877,
      "score": 1,
      "time": 1651843998,
      "title": "IPv6 Deployment Passes Another Milestone",
      "type": "story",
      "url": "https://pulse.internetsociety.org/blog/ipv6-deployment-passes-another-milestone"
    },
    {
      "by": "nsemikey",
      "descendants": 1,
      "id": 31284873,
      "kids": [
        31284874
      ],
      "score": 1,
      "time": 1651843985,
      "title": "Recipe Search Engine (Built in Vanilla PHP)",
      "type": "story",
      "url": "https://recipehunt.app/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31284853,
      "score": 1,
      "time": 1651843859,
      "title": "Umami: Own Your Website Analytics",
      "type": "story",
      "url": "https://umami.is/"
    },
    {
      "by": "paulcarroty",
      "descendants": 0,
      "id": 31284848,
      "score": 1,
      "time": 1651843815,
      "title": "China Orders Government, State Firms to Dump Foreign PCs",
      "type": "story",
      "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=ab85f803-cd40-11ec-a8a5-6e7567416376&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNS0wNi9jaGluYS1vcmRlcnMtZ292ZXJubWVudC1zdGF0ZS1maXJtcy10by1kdW1wLWZvcmVpZ24tcGNz"
    },
    {
      "by": "mgiroux",
      "descendants": 0,
      "id": 31284846,
      "score": 1,
      "time": 1651843794,
      "title": "GraphQL Is a Trap?",
      "type": "story",
      "url": "https://xuorig.medium.com/graphql-is-a-trap-e83ca380aa8f"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31284832,
      "score": 1,
      "time": 1651843694,
      "title": "Celebrating the End of the Good Times",
      "type": "story",
      "url": "https://world.hey.com/dhh/celebrating-the-end-of-the-good-times-12a715f2"
    },
    {
      "by": "Zaplanincan",
      "descendants": 0,
      "id": 31284823,
      "score": 1,
      "time": 1651843638,
      "title": "The Stanley Parable Ultra Deluxe Is the Smartest, Silliest Game of the Year",
      "type": "story",
      "url": "https://kotaku.com/the-stanley-parable-ultra-deluxe-sequel-crows-new-endin-1848878469"
    },
    {
      "by": "jdthedisciple",
      "descendants": 2,
      "id": 31284802,
      "kids": [
        31284843
      ],
      "score": 2,
      "text": "I have a Bachelor&#x27;s Degree in Electrical Engineering and Information Technology from a top #3 University in Germany. After my Bachelors I switched to a Masters of Science program in Informatics &#x2F; Computer Science at that same University. I am still in my 1st year of the masters (about 25% of the way through). Concretely, this means I need at least about 1.5 more years to finish it.<p>I dread the world of academia, I don&#x27;t wanna become a researcher and really just wanna go full time into software enginnering at some reputable company and contribute to some interesting project(s).<p>A bit more about myself: I have gathered 2-3 years of Software Enginnering experience on the side and consider myself a junior software engineer. I think I am a decent developer, always eager to learn, and I feel I am very good at selling my skills to companies as I have a rather high application-to-job-offer-ratio so to say. I guess part of it is that I display a lot of confidence in my abilities outwardly.<p>Here is the problem though: I am and want to be a software engineer, but if I drop out now my only degree will be in electrical engineering and NOT computer science. So I fear that I will never be considered a real software engineer based on my academic title.<p>I have swayed back and forth multiple times and am currently kind of half-heartedly still doing my courses and everything.<p>Would it be a good idea to drop out? Again, I frankly hate academic life and love creating stuff NOT for university credits but for an actual purpose. What would people experienced in the field advise me to do?<p>Thanks a lot",
      "time": 1651843445,
      "title": "Ask HN: Should I quit my CS Masters Program?",
      "type": "story"
    }
  ]
}