{
  "stories": [
    {
      "by": "beermonster",
      "descendants": 0,
      "id": 30146042,
      "score": 1,
      "time": 1643620174,
      "title": "Finnish diplomats’ phones infected with NSO Group Pegasus spyware",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/finnish-diplomats-phones-infected-with-nso-group-pegasus-spyware/"
    },
    {
      "by": "rgun",
      "descendants": 0,
      "id": 30146019,
      "score": 1,
      "time": 1643619852,
      "title": "Boyfriend Alert",
      "type": "story",
      "url": "https://github.com/jscd/Boyfriend-Alert"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30145988,
      "score": 1,
      "time": 1643619624,
      "title": "NextUI – Beautiful, fast and modern React UI library",
      "type": "story",
      "url": "https://github.com/nextui-org/nextui"
    },
    {
      "by": "mettamage",
      "descendants": 0,
      "id": 30145905,
      "score": 1,
      "text": "When I woke up I said: &quot;today I am NOT watching YouTube, Netflix or read HN.&quot; I said this yesterday, it seemed to have worked in helping me to go from not doing much to being quite productive because of the boredom that surrounded me.<p>Did you do something similar? How did having a not-to-do list work for you in the long term?",
      "time": 1643618828,
      "title": "Ask HN: Have you ever written a not-to-do list? How did it work out?",
      "type": "story"
    },
    {
      "by": "cuu508",
      "descendants": 0,
      "id": 30145900,
      "score": 1,
      "time": 1643618782,
      "title": "Intro to self-hosting. How to get started hosting your applications",
      "type": "story",
      "url": "https://georgev.design/blog/intro-to-self-hosting-how-to-get-started-hosting-your-applications"
    },
    {
      "by": "razze",
      "descendants": 0,
      "id": 30145897,
      "score": 1,
      "time": 1643618754,
      "title": "Zuse Z3 is running for one last time",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=TbW-qNxD1lE"
    },
    {
      "by": "trehans",
      "descendants": 0,
      "id": 30145878,
      "score": 1,
      "time": 1643618648,
      "title": "The Hardest Computer Game of All Time (2014)",
      "type": "story",
      "url": "https://slate.com/technology/2014/01/robot-odyssey-the-hardest-computer-game-of-all-time.html"
    },
    {
      "by": "nachomascort",
      "descendants": 0,
      "id": 30145876,
      "score": 1,
      "text": "Hey Hacker news! This is my first launch here and I’m glad to present you: Unlimited Sheets.<p>Let me show you why Unlimited Sheets was created ^^<p><pre><code>  Problem</code></pre>\nGoogle Sheets is a great tool. Actually, if you work from the Internet, it is one of the most used ones or at least in my field: SEO.<p>The problem with Google Sheets is that it is very limited when we are talking about functionalities related to the web (or even SEO).<p>There are a lot of good templates trying to solve specific problems. Do you need to scrape something? Here’s one template. Do you need to extract the search volume data from a set of keywords? Another template… and the list goes and goes.<p>I’ve started creating some custom functions that helped me in my day to day needs in order to avoid the template madness but when I’ve built more than 15 new custom functions it was not optimal to copy&#x2F;paste every single one that I needed in a specific spreadsheet in order to use it. Imagine if someone on my team needed a function too in another spreadsheet, yeah, it was a mess.<p>What I wanted was to have all of these new features in different spreadsheets for all the users of that spreadsheet without the hassle of creating different templates or doing copy&#x2F;paste of every function I needed.<p><pre><code>  Solution</code></pre>\nI’ve discovered that Google Sheets allows you to improve its functionality with add-ons. The good thing about the add-ons is that they can work in several spreadsheets with just one click.<p>So I’ve created Unlimited Sheets, an add-on that adds advanced custom functions for your day to day needs.<p>It has some free functions and other paid ones:<p>Free SEO functions\ngetStatusCode\ngetSearchVolume\ngetUrlsFromSitemap\nremoveHtml\nscrapeByRegex\nslugify\nsuggestQueries\ngetAvgDailyTrafficFromWeek\ngetLocaleBySubdomain\ngetRunRateCurrentMonth\ngetRunRateNextMonth<p>Free utilities\nexistsInColumn\ngroupByCell\nmyReplace\nreturnCellInversed\nreturnLastCell\nunlimitedVlookup (beta)\nv2lookup\ncombineAll (columns)<p>Premium functions\nThe premium functions are a bit different from the rest. Every premium function consumes API credits as they are connected to 3rd party paid services. Depending on the functions that you want to use you&#x27;ll need more or less API credits.<p>No API credits required\nAll free functions\nselectRandomCell<p>1 API credit per execution\nindexNow\nscrapeByXPath\nscrapeByCssPath<p>10 API credits per execution\ngetAllPagesFromSERP\ngetPaidPagesFromSERP\ngetOrganicPagesFromSERP\ngetKeywordPosition<p>200 API Credits per execution\ngetSearchVolumeFromGoogle (up to 1000 keywords per execution)<p>I hope it helps you in your day to day needs ^^<p>Thanks,",
      "time": 1643618641,
      "title": "Show HN: I made a Google Sheets add-on that adds 28 new SEO custom functions",
      "type": "story",
      "url": "https://unlimitedsheets.com/"
    },
    {
      "by": "emschlr",
      "descendants": 1,
      "id": 30145872,
      "kids": [
        30145974
      ],
      "score": 2,
      "text": "Story of GDPR penalty for loading external fonts from Google - https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30135264<p>I was thinking of starting my own blog recently. I like the idea of having comments section in blog powered by Disqus or another service that can be embedded in website with javascript. But this will be violating GDPR? Is it risky move?<p>From now on we should load all page resources from the same domain? No more using of external javascript to power syntax highlighting for code blocks, commenting section? What do website owners think about this penalty decision? What changes will you do to your websites to protect yourself?",
      "time": 1643618616,
      "title": "Ask HN: What does the GDPR penalty for loading fonts mean for website owners?",
      "type": "story"
    },
    {
      "by": "keleftheriou",
      "descendants": 1,
      "id": 30145862,
      "kids": [
        30145865
      ],
      "score": 1,
      "time": 1643618525,
      "title": "Gay Dating App Grindr Vanishes from China App Store",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-01-31/gay-dating-app-grindr-vanishes-from-china-app-store-before-2022-winter-olympics"
    }
  ]
}