{
  "stories": [
    {
      "by": "bovermyer",
      "descendants": 0,
      "id": 28278712,
      "score": 1,
      "time": 1629737615,
      "title": "Saving Hideaki Anno’s legendary DAICON III has been a journey",
      "type": "story",
      "url": "https://www.polygon.com/features/22613071/daicon-3-hideaki-anno-watch-remaster"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 28278682,
      "score": 1,
      "time": 1629737457,
      "title": "Facebook’s Stealth M&a [Giphy] Puts Focus on Deals Under Antitrust Radar",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-08-23/facebook-s-stealth-m-a-puts-focus-on-deals-under-antitrust-radar"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 28278674,
      "score": 1,
      "time": 1629737413,
      "title": "Hackers seize severe Microsoft Exchange vulnerabilities in echo of March attacks",
      "type": "story",
      "url": "https://www.cyberscoop.com/microsoft-exchange-server-vulnerabilities-proxyshell/"
    },
    {
      "by": "CTOSian",
      "descendants": 0,
      "id": 28278664,
      "score": 3,
      "time": 1629737392,
      "title": "Firefox follows Chrome and prepares to block insecure downloads",
      "type": "story",
      "url": "https://therecord.media/firefox-follows-chrome-and-prepares-to-block-insecure-downloads/"
    },
    {
      "by": "MihikaBasu",
      "descendants": 0,
      "id": 28278655,
      "score": 1,
      "time": 1629737367,
      "title": "A Major Shift in OnlyFans Terms of Service Rattles Sex Workers",
      "type": "story",
      "url": "https://startuptoenterprise.com/onlyfans-terms-of-service-rattles-sex-workers/"
    },
    {
      "by": "nradov",
      "descendants": 0,
      "id": 28278646,
      "score": 3,
      "time": 1629737342,
      "title": "Metabolism in adulthood does not slow as commonly believed, study finds",
      "type": "story",
      "url": "https://www.nbcnews.com/health/health-news/metabolism-adulthood-does-not-slow-commonly-believed-study-finds-n1276650"
    },
    {
      "by": "nwatson",
      "descendants": 1,
      "id": 28278641,
      "kids": [
        28278725
      ],
      "score": 3,
      "time": 1629737327,
      "title": "The U.S. ignored corruption within the Afghan government. Did that lead to fall?",
      "type": "story",
      "url": "https://www.pbs.org/newshour/show/the-u-s-ignored-corruption-within-the-afghan-government-did-that-lead-to-its-fall"
    },
    {
      "by": "WillDaSilva",
      "descendants": 0,
      "id": 28278634,
      "score": 3,
      "time": 1629737294,
      "title": "A Case Against Dynamic Linking",
      "type": "story",
      "url": "https://drewdevault.com/dynlib"
    },
    {
      "by": "handheldmouse",
      "descendants": 4,
      "id": 28278618,
      "kids": [
        28278724,
        28278667,
        28278732
      ],
      "score": 7,
      "text": "We are Alex and Daniel, the founders of Zen (<a href=\"https:&#x2F;&#x2F;www.yayzen.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yayzen.com</a>). We make a desktop app that mirrors your posture and gently alerts you when you slouch. It uses your webcam to monitor your posture, without recording or storing any visuals.<p>Alex started coding when he was 11 years old and eventually developed a severe case of &quot;forward head posture&quot; (a.k.a. nerd&#x2F;text neck), a postural deformity that&#x27;s often caused by unhealthy habits like slouching while coding. He created prototypes of Zen in his college dorm room at the University of St. Andrews to help with his posture. A couple of Alex&#x27;s classmates saw him using the app throughout lectures and asked if they could test it out. After more feedback from his classmates he took advantage of an opportunity to move to San Francisco, California to work more on the project. We met at our co-living space and are still roommates today.<p>I (Daniel) went from playing football and doing splits at Yale University (<a href=\"https:&#x2F;&#x2F;storage.thephapp.com&#x2F;split%281%29.gif\" rel=\"nofollow\">https:&#x2F;&#x2F;storage.thephapp.com&#x2F;split%281%29.gif</a>) to terrible low back pain and carpal tunnel for over 8 hours a day from working hunched over my computer at Adobe. Eventually I met with an ergonomist at Adobe to get support. Ironically, Alex told me about the project when I got home that day. I tried out his prototype, loved it, and we came together to build Zen.<p>Here&#x27;s how it works: The app takes video stream as input via your webcam (without recording or storing anything) and utilizes a locally stored computer vision model that analyzes the video to find and output key posture points&#x2F;indicators (joints, nose, ears, etc.). These posture points are fed to a mathematical model that constantly compares your current posture position to the original baseline posture position that you set as your &quot;healthy posture&quot; position when starting the app. In addition, the app applies geometrical formulas to vectors formed by your current posture position and your original baseline healthy posture position to determine if you&#x27;re slouching.<p>Your current posture position is displayed to you through a blue avatar named Zen that mirrors your posture in real-time. Zen sits in your menu bar (tray menu) and turns red when you slouch. Whenever you slouch for an extended period of time, you get alerted through a visual notification and&#x2F;or an audio alert. The alert will go away when you move back to your original baseline &quot;healthy&quot; position.<p>The majority of our users leave Zen on throughout their workday, but our initial studies show that users see significant health benefits from using the app for just 10 minutes a day during short &quot;posture sessions&quot;.  Posture session reminders, slouch alerts, and other important settings can be customized to ensure that they align with your work style. The app is currently available for Mac and Windows.<p>We&#x27;re offering an incredible deal to the HN community (<a href=\"https:&#x2F;&#x2F;www.yayzen.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yayzen.com</a>): \nAnnual - $23.99&#x2F;year with 7-day FREE trial (normally $69.99&#x2F;year)\nMonthly - $3.99&#x2F;month with 7-day FREE trial (normally $12.99&#x2F;month)<p>Our core business model is focused on selling to companies that offer Zen to employees as a benefit&#x2F;perk (similar to Calm&#x2F;Headspace).<p>We would love your feedback on the user experience and to hear more about any workday health pain points you have! Happy to offer any guidance on choosing the right chair, mouse, keyboard, and other equipment. I&#x27;ll be here all day, cheers!",
      "time": 1629737207,
      "title": "Launch HN: Zen (YC S21) – Posture-correcting software via webcam",
      "type": "story"
    },
    {
      "by": "yawaramin",
      "descendants": 0,
      "id": 28278553,
      "score": 2,
      "time": 1629736984,
      "title": "OCaml at Bloomberg 'we use OCaml to write DSLs and production services –'",
      "type": "story",
      "url": "https://twitter.com/adolfont/status/1429759258942377999"
    }
  ]
}