{
  "stories": [
    {
      "by": "voisin",
      "descendants": 0,
      "id": 30729721,
      "score": 1,
      "time": 1647651365,
      "title": "Ethereum's Vitalik Buterin Is Worried About Crypto's Future",
      "type": "story",
      "url": "https://time.com/6158182/vitalik-buterin-ethereum-profile/"
    },
    {
      "by": "unobatbayar",
      "descendants": 0,
      "id": 30729701,
      "score": 1,
      "time": 1647651187,
      "title": "Employment at DARPA",
      "type": "story",
      "url": "https://www.darpa.mil/work-with-us/recruitment-information"
    },
    {
      "by": "georgecmu",
      "descendants": 1,
      "id": 30729678,
      "kids": [
        30729732
      ],
      "score": 1,
      "time": 1647650992,
      "title": "Russia Is a Rogue, Not a Peer; China Is a Peer, Not a Rogue",
      "type": "story",
      "url": "https://www.rand.org/pubs/perspectives/PE310.html"
    },
    {
      "by": "dusklight",
      "descendants": 0,
      "id": 30729671,
      "score": 1,
      "text": "I find myself in a situation where I need to recommend some good books on software engineering to some developers who are just entering the workforce after finishing their education. When I was young, there were some books that generally everybody agreed were &quot;must reads&quot;. They included:<p>Refactoring by Martin Fowler,\nDesign Patterns by the Gang of Four,\nTest Driven Development by Example by Kent Beck,\nClean Code by Uncle Bob.<p>There&#x27;s others like Pragmatic Programmer but I want to keep this list short to simplify the discussion.<p>My question is, are these books still relevant? Should any of them be replaced by more relevant books for 2022?<p>Refactoring is still one of my favorite tech books of all time, and I see it has recently been revised in 2018 to include javascript examples. I think this remains a solid recommendation.<p>Test Driven Development by Example is probably timeless as a historical record, but I&#x27;m wondering if there&#x27;s a more recent work that covers the same content but also goes into Behavior Driven Development and Acceptance Test Driven Development.<p>Clean Code I would say is certainly still relevant, but I am wondering if there is any book that covers the same content with more recent code examples.<p>Design Patterns is the one I&#x27;m struggling with the most. Back when I first read it, it changed my life. But in 2022, with OOP looking increasingly dated and more and more people realizing they shouldn&#x27;t make everything a noun, I wondering if there isn&#x27;t a better choice out there? In many ways Design Patterns were created as a way for Java programmers to emulate useful tools from functional programming by nounifying them. I&#x27;m wondering if there isn&#x27;t any good book to cover instead basic patterns from functional programming, stuff you see regularly in languages like javascript and python. Stuff like function composition, applying a closure to a container, that kind of thing. Any good options?",
      "time": 1647650960,
      "title": "What are the books all junior devs should read in 2022?",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30729657,
      "score": 1,
      "time": 1647650848,
      "title": "The Current Thing",
      "type": "story",
      "url": "https://stratechery.com/2022/the-current-thing/"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 30729643,
      "score": 1,
      "time": 1647650771,
      "title": "Deep Curiosity Inspires the Joy of Why Podcast",
      "type": "story",
      "url": "https://www.quantamagazine.org/deep-curiosity-inspires-the-joy-of-why-podcast-20220317/"
    },
    {
      "by": "fillskills",
      "descendants": 0,
      "id": 30729598,
      "score": 1,
      "time": 1647650523,
      "title": "DigiLocker India's app for issuance and verification of documents gets 100M usrs",
      "type": "story",
      "url": "https://techcrunch.com/2022/03/18/digilocker/"
    },
    {
      "by": "ali92hm",
      "descendants": 0,
      "id": 30729575,
      "score": 3,
      "time": 1647650275,
      "title": "Open Source Maintainer Sabotages Code to Wipe Russian, Belarusian Computers",
      "type": "story",
      "url": "https://www.vice.com/en/article/dypeek/open-source-sabotage-node-ipc-wipe-russia-belraus-computers"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 30729532,
      "score": 1,
      "time": 1647649888,
      "title": "Feedback: Information as a Basis for Improvement [pdf]",
      "type": "story",
      "url": "https://www.morganstanley.com/im/publication/insights/articles/article_feedback_us.pdf?1647446179979"
    },
    {
      "by": "btzo",
      "descendants": 0,
      "id": 30729525,
      "score": 1,
      "time": 1647649854,
      "title": "1Password 6 for Mac won’t fill or save in Chrome 99 or later",
      "type": "story",
      "url": "https://support.1password.com/kb/202203/"
    }
  ]
}