{
  "stories": [
    {
      "by": "andsoitis",
      "descendants": 0,
      "id": 31487721,
      "score": 1,
      "time": 1653363464,
      "title": "The Symbolic and the Real",
      "type": "story",
      "url": "https://www.organism.earth/library/document/symbolic-and-real"
    },
    {
      "by": "captainchris",
      "descendants": 0,
      "id": 31487712,
      "score": 2,
      "text": "Hi HN:<p>Just reaching out to the community to ask if anyone might be able to throw me a few bucks for food, and possibly other needed basics? At the least I am trying to at least secure food to get me through next week.<p>I&#x27;d like to eventually get off of the streets and back on my feet. I have the ability to get rental assistance but need a lease first.<p>Yesterday, a few nice people on hn sent me some food money to cover food expenditures for early this week. However, it will run out and I need to start making a genuine effort to get back on my feet.<p>I stopped programming years ago after trying to jump start a failing SaaS startup. But, programming is the only realistic path for me to earn a living wage. I&#x27;ve been &quot;off the saddle&quot; long enough such that I will get my &quot;third wind in my 40&#x27;s&quot; energy, which I believe that I can sustain longer term.<p>My possessions right now are my iPhone and personal docs. I shower in public, as staying clean is a requirement to maintain sanity. I don&#x27;t have a laptop, address, nor a bank account. I have lived off EBT since December, which has run out for the month until early June.<p>I am in a nice climate so I am able to sleep unsheltered or inadequately sheltered, but I lack basic possessions needed to regain a footing. I have one set of clothes and some warm clothes stashed away in order to sleep warm at night.<p>I&#x27;ve exhausted help from family and friends, who all helped me to survive until now. At this point, I am ready to make an earnest attempt to begin programming professionally again, if the circumstances allow.<p>I do not use drugs, do not drink, and do not use tobacco. I don&#x27;t spend money on frivolous purchases, and have learned frugality through this humbling period in my life. Without a vehicle, I&#x27;ve learned to appreciate daily movement and the contribution it makes to physical health. The timing of losing my vehicle last year (which had served as my shelter for longer than I&#x27;d like to admit) was auspicious in terms of fuel prices, anyway.<p>My &quot;nice to have&quot; list of items to get from here to a path to self sufficiency includes:<p>Slippers ($13), toiletries ($15), laundry money ($15), eventually an external battery pack for my dying iPhone battery ($80), a decent mountain bike to get around ($50-150 used), a highly portable one man tent ($80 off Amazon), a PO Box to establish a mailing address (approx. $80), a coworking membership to have the necessary 60+ hours of screen time to re-hone my coding skills and bill some hours ($200 for the first month), a laptop (I could conceivably use a donor, or $300-$900 for a Windows&#x2F;Mac laptop). Much more optional is an electric razor as my beard has grown long ($50).<p>These are &quot;nice to have&quot; in the sense that I will keep seeking part time labor work, but that has been difficult to maintain, given the amount of walking I do daily to sleep safely in my locale. Trying to envision a routine for summer that puts me on a new path without making a drastic change. Such enhancements will facilitate hopping onto a new path with hope for growing back to normal.<p>I apologize for the disorganized note. If you can help, even if it&#x27;s just a few bucks for food, it will make a big difference. The stress of running out of food money for yet another time is no longer desired, so I am reaching out tonight in hopes of getting on a pathway to stability.<p>This is very humbling for me but I&#x27;ve decided to attempt to rebuild my life from zero instead of hanging around the bottom aimlessly, at any cost to my ego. If you can help, please contact me at the email in my profile for info on apple cash, cashapp, paypal, or venmo. I can use any of those four for food, and shuffle them around through friends as needed to use apple cash for general purchases at Walmart.",
      "time": 1653363355,
      "title": "Ask HN: Can you help with food money and possibly more?",
      "type": "story"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 31487697,
      "score": 2,
      "time": 1653363166,
      "title": "BPFDoor – an active Chinese global surveillance tool",
      "type": "story",
      "url": "https://doublepulsar.com/bpfdoor-an-active-chinese-global-surveillance-tool-54b078f1a896?gi=82b009d3a9dd"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31487692,
      "score": 1,
      "time": 1653363109,
      "title": "GitHub Sponsors Launches in India",
      "type": "story",
      "url": "https://github.blog/2022-05-23-github-sponsors-launches-in-india/"
    },
    {
      "by": "akbarnama",
      "descendants": 0,
      "id": 31487687,
      "score": 1,
      "time": 1653363036,
      "title": "I gave the LIC IPO a miss",
      "type": "story",
      "url": "https://www.moneycontrol.com/news/business/personal-finance/why-i-gave-the-lic-ipo-a-miss-8561511.html"
    },
    {
      "by": "benbreen",
      "descendants": 0,
      "id": 31487679,
      "score": 1,
      "time": 1653362959,
      "title": "Errol Morris interview with the Believer (2004)",
      "type": "story",
      "url": "https://www.errolmorris.com/content/interview/believer0404.html"
    },
    {
      "by": "theshapguy",
      "descendants": 1,
      "id": 31487667,
      "kids": [
        31487684
      ],
      "score": 1,
      "time": 1653362801,
      "title": "Show HN: An Accountability/Productivity Coach",
      "type": "story",
      "url": "https://taskritual.com"
    },
    {
      "by": "alwillis",
      "descendants": 0,
      "id": 31487653,
      "score": 3,
      "time": 1653362519,
      "title": "Xkcd on Apple Maps",
      "type": "story",
      "url": "https://daringfireball.net/linked/2022/05/23/xkcd-apple-maps"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31487650,
      "score": 2,
      "time": 1653362489,
      "title": "Many graduate programs are “scams,” according to higher education policy analyst",
      "type": "story",
      "url": "https://www.cbsnews.com/news/graduate-programs-masters-degree-scams-negative-return-on-investment/"
    },
    {
      "by": "camjohnson26",
      "descendants": 0,
      "id": 31487646,
      "score": 5,
      "time": 1653362466,
      "title": "Seven Teslas have caught fire in the last four days",
      "type": "story",
      "url": "https://www.plainsite.org/evfires/index.html"
    }
  ]
}