{
  "stories": [
    {
      "by": "projectsforlife",
      "descendants": 0,
      "id": 31804519,
      "score": 1,
      "text": "Bitcoin aims to give people self sovereignty and financial freedom (who otherwise couldn&#x27;t attain it). That&#x27;s a noble goal, but the project has always had a fundamental problem:<p>Bitcoin only survives if enough miners continue to participate, who spend on electricity to keep the network&#x27;s total hash rate high (enough to fend off a determined foe). Miners do this in exchange for new bitcoin. Though bitcoin&#x27;s profitability has recently been challenged by the latest downturn, it can adjust and is not in immediate jeopardy. But it will be.<p>The total supply of bitcoin is 21M. Less than 2M remain to be mined in the project&#x27;s lifetime.<p>Eventually the # of bitcoins produced per year will be too low to maintain miner incentives. [Every four years moving forward half as many bitcoins will be produced. The so-called &quot;halvening&quot; has generally been seen by investors as a positive thing, b&#x2F;c it implies continued scarcity of the asset, but they miss the forest for the trees.]<p>Transaction fees would have to pick up the slack in lower block mining profits. Ever-higher transaction fees will kill the cryptocurrency&#x27;s potential for mass appeal (which companies like Square&#x2F;Block have bet big on).<p>The only way that none of this is an issue is if bitcoin continues increasing in value inexorably. To be fair, I&#x27;d say that&#x27;s Bitcoin&#x27;s #1 use case so far has been: a speculative vehicle that consistently rises in value. That will inevitably come to an end, if for no other reason than there isn&#x27;t enough money in the world to sustain its historic rate of climb. It&#x27;s also dubious for something to be branded as digital gold if it requires more new money coming into the system to be viable, in that respect it&#x27;s closer to a Ponzi scheme.<p>Another &quot;out&quot; is if all of the miners can agree to increase the project&#x27;s total supply, something I imagine will be attempted. That will be a huge shit show though, as the brand of bitcoin revolves entirely around scarcity.<p>That&#x27;s the project&#x27;s basic flaw. I set aside bitcoin&#x27;s less-existential problems: extreme energy demands, failure to act as an inflationary hedge, disproportionate use by ransomware gangs, potential vulnerability to quantum crypto-breaking computing, and existence in a space rife with scams (from USDT to UST and all the under-regulated web3 banks and securities-sellers in between, like Celsius).",
      "time": 1655681103,
      "title": "Bitcoin's core problem is its max supply of 21M, 19M+ mined, and poor incentives",
      "type": "story"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 31804499,
      "score": 1,
      "time": 1655680944,
      "title": "Tankers Charging Drones with Lasers the Focus of New DARPA Program",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/tankers-charging-drones-with-lasers-the-focus-of-new-darpa-program"
    },
    {
      "by": "contingencies",
      "descendants": 1,
      "id": 31804466,
      "kids": [
        31804480
      ],
      "score": 1,
      "time": 1655680663,
      "title": "Australia ranked 61/63 countries for entrepreneurship",
      "type": "story",
      "url": "https://www.ceda.com.au/ResearchAndPolicies/Research/Economy/World-Competitiveness-Yearbook-2022"
    },
    {
      "by": "paulpauper",
      "descendants": 1,
      "id": 31804432,
      "kids": [
        31804514
      ],
      "score": 2,
      "time": 1655680433,
      "title": "Why did inflation spiral out of control: a retrospective",
      "type": "story",
      "url": "https://greyenlightenment.com/2022/06/19/why-did-inflation-spiral-out-of-control-a-retrospective/"
    },
    {
      "by": "escot",
      "descendants": 0,
      "id": 31804429,
      "score": 1,
      "time": 1655680404,
      "title": "We need a flowchart editor that doesn't give you carpal tunnel",
      "type": "story",
      "url": "https://www.scottantipa.com/why-knotend"
    },
    {
      "by": "doodles33",
      "descendants": 0,
      "id": 31804393,
      "score": 1,
      "time": 1655680030,
      "title": "GraphPrime – Graphing prime number calculator made with Tauri, Svelte, and Rust",
      "type": "story",
      "url": "https://github.com/DoodlesEpic/GraphPrime"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 31804375,
      "score": 2,
      "time": 1655679808,
      "title": "Effective Software Testing – A Developer’s Guide",
      "type": "story",
      "url": "https://henrikwarne.com/2022/06/19/effective-software-testing-a-developers-guide/"
    },
    {
      "by": "nradov",
      "descendants": 0,
      "id": 31804343,
      "score": 2,
      "time": 1655679574,
      "title": "Suzanna, the Iraqi Falcon 50 Business Jet That Almost Sank US Navy’s Frigate",
      "type": "story",
      "url": "https://theaviationgeekclub.com/the-story-of-suzanna-the-modified-iraqi-falcon-50-business-jet-that-almost-sank-us-navys-guided-missile-frigate-uss-stark/"
    },
    {
      "by": "visox",
      "descendants": 2,
      "id": 31804323,
      "kids": [
        31804405,
        31804365
      ],
      "score": 1,
      "text": "Hi,<p>cant use paypal and some good solutions only work in EU. is there any other solution to charge users monthly on my page (so not leaving my page) ?",
      "time": 1655679376,
      "title": "Ask HN: Solution to charge users monthly in Israel",
      "type": "story"
    },
    {
      "by": "Shank",
      "descendants": 0,
      "id": 31804307,
      "score": 3,
      "time": 1655679161,
      "title": "SLND1: Mitigate Risk from Whale",
      "type": "story",
      "url": "https://realms.today/dao/7sf3tcWm58vhtkJMwuw2P3T6UBX7UE5VKxPMnXJUZ1Hn/proposal/HuaL6cDtuNtfnJgvwMnYiZDHVCoLAuDtVFgJD8kYChJ4"
    }
  ]
}