{
  "stories": [
    {
      "by": "zdw",
      "descendants": 0,
      "id": 31535139,
      "score": 1,
      "time": 1653686857,
      "title": "Sage and a glimpse of group computing from before the PC",
      "type": "story",
      "url": "https://interconnected.org/home/2021/12/21/sage"
    },
    {
      "by": "GBiT",
      "descendants": 0,
      "id": 31535131,
      "score": 2,
      "time": 1653686813,
      "title": "Run Ethereum Smart Contracts on Bitcoin Protocol",
      "type": "story",
      "url": "https://xiaohuiliu.medium.com/introducing-solidity-to-scrypt-transpiler-a0a6907bb3ef"
    },
    {
      "by": "testingathing",
      "descendants": 0,
      "id": 31535053,
      "score": 2,
      "time": 1653686384,
      "title": "Wikipedia Haiku",
      "type": "story",
      "url": "https://botsin.space/@wikipediahaiku"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 31535041,
      "score": 2,
      "time": 1653686318,
      "title": "Fixing Memory Leaks in Rust",
      "type": "story",
      "url": "https://onesignal.com/blog/solving-memory-leaks-in-rust/"
    },
    {
      "by": "PaybackTony",
      "descendants": 1,
      "id": 31535036,
      "kids": [
        31535047
      ],
      "score": 1,
      "time": 1653686285,
      "title": "Cybersecurity breach at City of Portland led to $1.4m fraudulent transaction",
      "type": "story",
      "url": "https://katu.com/news/local/cybersecurity-breach-at-the-city-of-portland-led-to-fraudulent-14m-transaction"
    },
    {
      "by": "vanburen",
      "descendants": 0,
      "id": 31535034,
      "score": 2,
      "time": 1653686258,
      "title": "Rocket.Chat Leverages the Matrix Protocol for Interoperable Communications",
      "type": "story",
      "url": "https://rocket.chat/press-releases/rocket-chat-leverages-matrix-protocol-for-decentralized-and-interoperable-communications"
    },
    {
      "by": "midislack",
      "descendants": 0,
      "id": 31535015,
      "score": 1,
      "time": 1653686157,
      "title": "OpenGL hardware acceleration through remote X11 SSH connection",
      "type": "story",
      "url": "https://evpo.wordpress.com/2017/03/04/opengl-hardware-acceleration-through-remote-x11-ssh-connection/"
    },
    {
      "by": "rvz",
      "descendants": 0,
      "id": 31535010,
      "score": 2,
      "time": 1653686139,
      "title": "The Belgian government wants to ban Signal",
      "type": "story",
      "url": "https://edri.org/our-work/belgium-wants-to-ban-signal-a-harbinger-of-european-policy-to-come/"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31535004,
      "score": 1,
      "time": 1653686104,
      "title": "Talos names eight deadly sins in widely used industrial software",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/27/talos-aos-vulnerabilities/"
    },
    {
      "by": "jordanmorgan10",
      "descendants": 0,
      "id": 31534988,
      "score": 4,
      "text": "Hey HN -<p>I mostly stay in the shadows here, but for the one year anniversary of my first (ebook project)[1] I figured I&#x27;d write a blurb in case it&#x27;s interesting to anyone.<p>I&#x27;m terrible at launching things, and take years to ship my own apps. After my last app was acquired, I wanted to fulfill a &quot;moon shot&quot; goal of mine - write a book in any form. I settled on adapting one of my more popular [blog posts][2] that I keep updated through each version of iOS into a five book series (one for each topic of accessibility, design, UX, APIs and a catch all bonus one). So far it has sold 1,534 copies and has made over $124,000. Now that things have settled, it makes about $2k a month on average.<p>I learned from my own launch history and decide to launch it in &quot;early access&quot;, otherwise I&#x27;d never finish it. Launching it went great and was a day I&#x27;ll never forget, as to that point - I had never made close to that much money in one day.<p>CONS:\nIt&#x27;s not all rainbows and sunshine though. I used to read posts like this and my heart rate would shoot up, thinking &quot;What the heck - I could do that too!&quot; and make some good money. While it is true that the project has been great for me financially (I have a stay at home wife and three kids), honestly life is not any different. I just save most of it, spend it on the 1,000 school activities my kids have or whatever life throws at me. I didn&#x27;t make any splurge purchase.<p>I&#x27;ve also realized the real, grating reality of opportunity cost. At the one year mark, this book series is only half way done. I can&#x27;t put into words how much I miss making software, because now - all I do is write. That has been my main takeaway through all of this - your time is valuable, and I cosigned a ton of mine away the moment I decided to embark on this.<p>PROS:\nOn the positive side, I get messages from people starting out on iOS and veterans alike who are really enjoying the books. It&#x27;s hard to put into words how motivating that is, to fell like you are doing a tiny little thing that somewhat matters to some people. I also love teaching and writing, so the project does appeal to me - but I&#x27;ve learned I need a better balance. When I shipped apps, all I wanted to do was write. Now, the opposite is true.<p>Anyways, if you are considering launching a digital downloads type of product, I&#x27;d say go for it. Tech-wise, it was trivial to get started:<p>Gumroad for sales\nNetlify for deploys\nMade the site from scratch using Tailwind\nUlysses to write<p>I think in a world where there is a lot of &quot;grifting&quot; going on with courses, ebooks, etc - you can actually stand out if you stick to your word and show authenticity. For example, I promised updates every two weeks - and I&#x27;ve stuck to that, a year in.<p>TL&#x27;DR:\nLaunching your own thing and making money is neat, but at the end of the day life doesn&#x27;t really change at all. Consider your time investments. Try to truly help people.<p>Happy to answer any questions if you have any.<p>[1]: https:&#x2F;&#x2F;www.bestinclassiosapp.com\n[2]: https:&#x2F;&#x2F;www.swiftjectivec.com&#x2F;a-best-in-class-app&#x2F;",
      "time": 1653686032,
      "title": "Tell HN: My early access eBook over iOS made $120k in 1 year",
      "type": "story"
    }
  ]
}