{
  "stories": [
    {
      "by": "riffic",
      "descendants": 0,
      "id": 29897311,
      "score": 1,
      "time": 1641932680,
      "title": "We Fight for the Users: An Appreciation of IETF's RFC 8890",
      "type": "story",
      "url": "https://www.eff.org/deeplinks/2020/10/we-fight-users"
    },
    {
      "by": "adatta02",
      "descendants": 0,
      "id": 29897299,
      "score": 1,
      "time": 1641932619,
      "title": "NFL Engineering on GitHub",
      "type": "story",
      "url": "https://github.com/nfl"
    },
    {
      "by": "mzs",
      "descendants": 0,
      "id": 29897289,
      "score": 1,
      "time": 1641932577,
      "title": "CVE-2021-45608 – NetUSB RCE Flaw in Millions of End User Routers",
      "type": "story",
      "url": "https://www.sentinelone.com/labs/cve-2021-45608-netusb-rce-flaw-in-millions-of-end-user-routers/"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 29897280,
      "score": 1,
      "time": 1641932537,
      "title": "PCI-Sig Releases 256GBps PCIe 6.0 X16 Spec",
      "type": "story",
      "url": "https://www.servethehome.com/pci-sig-releases-256gbps-pcie-6-0-x16-spec/"
    },
    {
      "by": "mathieutd",
      "descendants": 0,
      "id": 29897253,
      "score": 1,
      "time": 1641932426,
      "title": "T-Mobile says it has ‘not broadly blocked’ iCloud Private Relay, blames iOS bug",
      "type": "story",
      "url": "https://9to5mac.com/2022/01/11/mobile-says-it-has-not-broadly-blocked-icloud-private-relay/"
    },
    {
      "by": "ramimac",
      "descendants": 0,
      "id": 29897211,
      "score": 1,
      "time": 1641932236,
      "title": "URL confusion vulnerabilities in the wild: Exploring parser inconsistencies",
      "type": "story",
      "url": "https://snyk.io/blog/url-confusion-vulnerabilities/"
    },
    {
      "by": "jamespwilliams",
      "descendants": 0,
      "id": 29897206,
      "score": 1,
      "time": 1641932218,
      "title": "Writing a Game Boy Emulator in OCaml",
      "type": "story",
      "url": "https://linoscope.github.io/writing-a-game-boy-emulator-in-ocaml/"
    },
    {
      "by": "JordanTen",
      "descendants": 0,
      "id": 29897197,
      "score": 2,
      "time": 1641932189,
      "title": "CNCF 2021 Annual Report",
      "type": "story",
      "url": "https://www.cncf.io/cncf-annual-report-2021/"
    },
    {
      "by": "CryptoGods",
      "descendants": 0,
      "id": 29897191,
      "score": 2,
      "text": "I have a vision to disrupt the oldest industry in the world. It is the Religion&#x2F;Gods&#x2F;Donations vertical.<p>I have already built the crude form of the app and its available on AppStore and PlayStore ( GodsDecentralized)<p>Now about the idea:<p>To bring the Popular and Mythological Gods to the Metaverse. Gods&#x2F;Religions are the second most important virtual construct (first one being money). They serve a purpose especially in mental or spiritual well being.<p>The market is a huge one (6 billion people out of the 7 billion are religious&#x2F;ritualistic folks). Donations to Gods&#x2F;Religions are also HUUUUUUGE. (400 billion dollars )<p>There is a B2C and B2B part of my vision. The B2C part is a gamified prayer app for the users. The B2B version includes onboarding churches and temples and being the platform they use to advertise their services and collect donations across the globe.<p>Despite Gods being a virtual construct like money formed in the human mind, they live as statues in temples and churches centralized by the powers that collect money in their name. This is the only vertical not disrupted by technology and the pandemic has created the ripe environment for this.<p>End goal is to bring the Gods as NFTs on the platform, making a decentralized worship protocol, onboard all churches and temples and make it easy for people to worship their Gods and send money to good causes in a transparent manner.<p>About me: I am technical and understand technology and the religion&#x2F;worship&#x2F;crypto markets fairly well.<p>What I need is a cofounder who  will compliment me on the marketing&#x2F;growth&#x2F;user acquisition&#x2F; community building side. Preferably you should have experience on that side, to grow the team, nurture talent. Location wise you should could be in USA or India as these are the markets which makes sense to start with.<p>I have a deep knowledge of technology and I can understand fluff from stuff and I am hands on. I can find the right people as we scale in each part of technology that is required. You should be the same on the user acquisition &#x2F; growth side.<p>If you are passionate about a decentralized world&#x2F; religion&#x2F;money and have a anarcho-capitalistic libertarian view of the future it will be great. Will be easier to gel from a thought perspective but that is not a must.<p>Building the app&#x2F; Raising money is not an issue. But changing human behaviour is hard.<p>So this is not at all going to be easy but I do have my sights set for first B2B church set with a 500,000 laity.<p>We can even decide if we want to apply for the summer YC batch. Maybe we might need to or can take this forward without YC.<p>If you are truly interested and think you are the right fit, shoot me an email to info@GodsDecentralized.com<p>If you are not the right person please upvote so that person can see this post.",
      "time": 1641932148,
      "title": "Looking for a Non-Tech CoFounder for an Already Built App",
      "type": "story"
    },
    {
      "by": "minimaxir",
      "descendants": 0,
      "id": 29897184,
      "score": 3,
      "time": 1641932122,
      "title": "“This guy shamelessly cloned Wordle as an F2P iOS game with IAP and is bragging”",
      "type": "story",
      "url": "https://twitter.com/waxpancake/status/1480990948972658689"
    }
  ]
}