{
  "stories": [
    {
      "by": "jessehorne",
      "descendants": 0,
      "id": 28947601,
      "score": 1,
      "text": "Hey HN!<p>If you haven&#x27;t heard, Rhythm was given a cease and desist order. This made me think it would be really fun to learn how it worked, so I made an extremely minimal but viable solution in JS.<p>It&#x27;s small, it works and it doesn&#x27;t use your filesystem. Also note, I&#x27;m not encouraging that anyone use this.<p>All feedback and criticisms are welcome!<p>https:&#x2F;&#x2F;github.com&#x2F;jessehorne&#x2F;bop<p>p.s If you were YouTube or Rhythm, how would you have handled this situation differently? Could there be a way to keep bots like these without having them shut down and also without going bankrupt while running them?",
      "time": 1634836092,
      "title": "Show HN: A Discord Bot That Plays Music from YouTube (RIP Rhythm)",
      "type": "story"
    },
    {
      "by": "owjuhl",
      "descendants": 0,
      "id": 28947585,
      "score": 1,
      "time": 1634836021,
      "title": "Open-source implementation of idempotency keys in Node.js",
      "type": "story",
      "url": "https://www.medusa-commerce.com/post/open-source-implementation-of-idempotency-keys"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28947584,
      "score": 1,
      "time": 1634836013,
      "title": "Jetbrain's Qodana – More Than Just a Linter",
      "type": "story",
      "url": "https://www.i-programmer.info/news/90-tools/14958-jetbrains-qodana-more-than-just-a-linter.html"
    },
    {
      "by": "ferat",
      "descendants": 0,
      "id": 28947570,
      "score": 1,
      "time": 1634835961,
      "title": "Show HN: I Built a Code Generator for Laravel/PHP",
      "type": "story",
      "url": "https://vemto.app"
    },
    {
      "by": "razin",
      "descendants": 0,
      "id": 28947558,
      "score": 5,
      "time": 1634835892,
      "title": "Beyond Smart",
      "type": "story",
      "url": "http://paulgraham.com/smart.html"
    },
    {
      "by": "sergei_ws",
      "descendants": 1,
      "id": 28947544,
      "kids": [
        28947590
      ],
      "score": 1,
      "time": 1634835834,
      "title": "Open-source keyboard interface for your website",
      "type": "story",
      "url": "https://github.com/ssleptsov/ninja-keys"
    },
    {
      "by": "greenail",
      "descendants": 0,
      "id": 28947540,
      "score": 1,
      "text": "I just noticed linkedin is collecting demographic data. The copy says &quot;Help promote fairness and diversity on LinkedIn by answering a few demographic questions.&quot;  I&#x27;m not sure how they define fairness here or what their intent is.<p>Then it says &quot;We’ll keep your responses confidential and secure.&quot;  So what do they do with this data?<p>Digging into the learn more link shows<p>&quot;We’ll use Self-ID data to:<p>Measure outcomes for different demographic groups on LinkedIn<p>Ensure our search results are fair and representative<p>Publish reports on workplace diversity trends<p>Help companies analyze their workforce composition, without revealing your name or personal information&quot;",
      "time": 1634835826,
      "title": "Ask HN: Should Linkein be collecting demographic data?",
      "type": "story"
    },
    {
      "by": "prirun",
      "descendants": 0,
      "id": 28947533,
      "score": 1,
      "text": "I see all these posts about how much more privacy-focused the EU is vs the US, the GDPR, blah, blah, blah.<p>Yesterday I was going to check out the free 75GB trial of Scaleway&#x27;s S3 service to see how it compared to others.  However, it wouldn&#x27;t let me create a bucket until I gave my credit card info, whereas Backblaze lets a free account use 10GB without giving any credit card.  So I decided to pass on Scaleway.<p>I couldn&#x27;t find the link to delete my account and had to use their online chat service.  The link wasn&#x27;t where they said it was, but I did poke around and find it.  It was very clear that it was going to erase all data about me, referenced &quot;data processors&quot; and &quot;data controllers&quot;, blah, blah, blah.<p>And since then I have received two emails from them encouraging me to try out their service, how to get started, etc.<p>So much for everyone in the EU having control of their data.  Maybe it&#x27;s because I&#x27;m in the US and their fancy, convoluted rules don&#x27;t apply.  Seems like any other company I&#x27;ve dealt with.",
      "time": 1634835814,
      "title": "Scaleway and Europe's big privacy focus",
      "type": "story"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 28947518,
      "score": 1,
      "time": 1634835749,
      "title": "Vikings beat Columbus to North America by 471 years",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-58996186"
    },
    {
      "by": "gene-h",
      "descendants": 0,
      "id": 28947507,
      "score": 2,
      "time": 1634835706,
      "title": "Constructing covalent organic nanoarchitectures molecule by molecule via SPM",
      "type": "story",
      "url": "https://www.nature.com/articles/s41557-021-00773-4"
    }
  ]
}