{
  "stories": [
    {
      "by": "amolgupta",
      "descendants": 0,
      "id": 30107321,
      "score": 1,
      "time": 1643320508,
      "title": "All Olympian audio is being collected, analyzed and saved on Chinese servers",
      "type": "story",
      "url": "https://twitter.com/jonathandata1/status/1486458526767661060"
    },
    {
      "by": "ceejayoz",
      "descendants": 0,
      "id": 30107288,
      "score": 1,
      "time": 1643320345,
      "title": "Crypto Secrecy Makes DeFi a Wonderland to Felon Tied to Quadriga",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-01-27/crypto-s-cloak-of-anonymity-makes-defi-a-wonderland-for-felon"
    },
    {
      "by": "rococode",
      "descendants": 0,
      "id": 30107285,
      "score": 1,
      "text": "I&#x27;ve been working on a SaaS tool for a while, selling it B2C. People come across the product, sign up with their emails, and pay for a subscription if they like it. It&#x27;s useful on an individual level, not inherently team-oriented.<p>In the past few months, I&#x27;ve gotten a couple inquiries from fairly big companies asking about a self-hosted&#x2F;on-prem version. The usual reason is that they need the user data that my tool helps with to not be sent to any third party.<p>I&#x27;ve never done any sort of enterprise sales so I have only a vague idea of how much extra effort would be required and whether the reward would be worth it.<p>I&#x27;ve done some research but couldn&#x27;t find much info out there - it doesn&#x27;t help that most enterprise offerings are just &quot;Contact us for more info&quot;. Would really appreciate any insights on any of my questions!<p>== Effort ==<p>1. How is self-hosted software typically deployed? Would I just be handing them some docker containers and instructions, or would I be the one setting it up on their machines in a kind of support capacity? Or is there a standardized way of doing it? Right now my infrastructure is reasonably portable, it&#x27;s all on AWS but it&#x27;s basically just a couple different containers that I manually setup (no Kubernetes) and a database or two.<p>2. How &quot;safe&quot; is it for my own business? Do I need to have a lawyer draw up some service contract? Do I need to obfuscate my code in case they &quot;borrow&quot; it or should that not be a concern? (these are fairly well known companies in completely different industries from what my tool does)<p>3. How many decision steps are there typically between &quot;Do you have a self-hosted version?&quot; and &quot;Ok, let&#x27;s do it.&quot;? I have a couple inbound leads but if I spend X amount of time building out a self-hosted version and none of them end up actually paying for it, that seems like a bad use of my time since I don&#x27;t know how to find more leads.<p>== Pricing ==<p>1. What kind of pricing model is common in a self-hosted scenario? Is it still a license per user, say $X&#x2F;year? A one-time payment with ongoing support&#x2F;maintenance costs?<p>2. My SaaS costs about $10 a month for regular people. How much does that scale up for a self-hosted version being sold to a company? Now it&#x27;s $20 &#x2F; user? $50? $100?",
      "time": 1643320321,
      "title": "Ask HN: How do I turn a B2C SaaS product into a self-hosted enterprise product?",
      "type": "story"
    },
    {
      "by": "francescoxx",
      "descendants": 0,
      "id": 30107284,
      "score": 1,
      "time": 1643320321,
      "title": "What Does a DevOps Engineer Do?",
      "type": "story",
      "url": "https://blog.tinystacks.com/devops-engineer-roles-responsibilities"
    },
    {
      "by": "Jimmc414",
      "descendants": 1,
      "id": 30107275,
      "kids": [
        30107297
      ],
      "score": 1,
      "time": 1643320286,
      "title": "Supply chain attack bypassed MFA through theft of Chrome browser cookies",
      "type": "story",
      "url": "https://www.crowdstrike.com/blog/observations-from-the-stellarparticle-campaign/"
    },
    {
      "by": "Thorentis",
      "descendants": 0,
      "id": 30107270,
      "score": 1,
      "time": 1643320265,
      "title": "SARS-CoV-2 origins leaked in DARPA report",
      "type": "story",
      "url": "https://www.theamericanconservative.com/dreher/darpa-covid-whistleblower-blockbuster-covid-fauci/"
    },
    {
      "by": "skellertor",
      "descendants": 0,
      "id": 30107263,
      "score": 1,
      "time": 1643320243,
      "title": "A Pipe Operator for JavaScript",
      "type": "story",
      "url": "https://2ality.com/2022/01/pipe-operator.html"
    },
    {
      "by": "frogperson",
      "descendants": 0,
      "id": 30107257,
      "score": 1,
      "text": "I was reading a thread today about yet another Javascript framework. The general consensus seemed to be that a new framework isn&#x27;t going to make a meaningful impact on productivity.  It made me wonder, if there is no more juice to squeeze in the JS Framework world, then why don&#x27;t we see more innovation in browers? Instead of marginal improvements, what if replace Javascript or html or even http?<p>I understand today&#x27;s browsers are hugely complicated, but they didn&#x27;t start out that way. Why don&#x27;t we see micro-browsers that fetch some document and render something useful in some innovative way?",
      "time": 1643320218,
      "title": "Ask HN: Why do we never see inovation in web browsers?",
      "type": "story"
    },
    {
      "by": "hnburnsy",
      "descendants": 0,
      "id": 30107253,
      "score": 1,
      "time": 1643320203,
      "title": "What UX people took from you",
      "type": "story",
      "url": "https://twitter.com/Nexuist/status/1486466541491261443"
    },
    {
      "by": "mensetmanusman",
      "descendants": 0,
      "id": 30107233,
      "score": 2,
      "time": 1643320151,
      "title": "US Population Growth Has Nearly Flatlined",
      "type": "story",
      "url": "https://www.brookings.edu/research/u-s-population-growth-has-nearly-flatlined-new-census-data-shows/"
    }
  ]
}