{
  "stories": [
    {
      "by": "smcleod",
      "descendants": 0,
      "id": 28508802,
      "score": 1,
      "time": 1631518532,
      "title": "The Bawdy Graffiti of Pompeii and Herculaneum",
      "type": "story",
      "url": "https://kashgar.com.au/blogs/history/the-bawdy-graffiti-of-pompeii-and-herculaneu"
    },
    {
      "by": "mariuz",
      "descendants": 0,
      "id": 28508777,
      "score": 1,
      "time": 1631518312,
      "title": "Pq – parse and query log files as time series",
      "type": "story",
      "url": "https://iximiuz.com/en/posts/pq/"
    },
    {
      "by": "Kohzam",
      "descendants": 0,
      "id": 28508767,
      "score": 1,
      "text": "BIGO LIVE",
      "time": 1631518221,
      "title": "BIGO Live",
      "type": "story"
    },
    {
      "by": "anigbrowl",
      "descendants": 0,
      "id": 28508765,
      "score": 1,
      "time": 1631518215,
      "title": "How social media intensifies US political polarization [pdf]",
      "type": "story",
      "url": "https://static1.squarespace.com/static/5b6df958f8370af3217d4178/t/613a4d4cc86b9d3810eb35aa/1631210832122/NYU+CBHR+Fueling+The+Fire_FINAL+ONLINE+REVISED+Sep7.pdf"
    },
    {
      "by": "rishikeshs",
      "descendants": 0,
      "id": 28508750,
      "score": 1,
      "text": "I&#x27;ve tried to learn programming through many MOOCs but failed multiple times.<p>Are there any good resources that are interesting to learn? \nThe problem I face is most of these MOOCs are too boring in the beginning and I usually end up abandoning them.<p>Lately, I came across Project Euler and I&#x27;m having fun solving the challenges on the platform. I&#x27;m planning to learn Python as I like to pivot my career towards the data side and may create some generative art in the future!<p>Some help would be appreciated!<p>To give some context, I work as a Product Engineer developing digital solutions for an energy company. I don&#x27;t code, but I understand the whole software development process at a high level. I currently act as a bridge between the development team and the management.<p>My expertise in programming is limited to the following:\n- I&#x27;ve fairly a good grasp of HTML, something I learned by editing websites.\n- I know a bit of SQL to query data\n- I have some experience in Arduino programming and know how to code basic stuff\n- I learnt C while in college and understand the basics of loops, conditional statements, etc.",
      "time": 1631518054,
      "title": "Ask HN: How to learn Programming in an interesting way?",
      "type": "story"
    },
    {
      "by": "agarttha",
      "descendants": 0,
      "id": 28508737,
      "score": 1,
      "time": 1631517907,
      "title": "I am a tea pot!",
      "type": "story",
      "url": "https://ec.europa.eu/research/participants/submission/manage/"
    },
    {
      "by": "BrentOzar",
      "descendants": 0,
      "id": 28508733,
      "score": 1,
      "time": 1631517885,
      "title": "Ambigram",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ambigram"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 28508704,
      "score": 1,
      "text": "I have remained loyal to Firefox since the earliest time (think eff-ing <i>Phoenix</i>) but lately, changes are really going on my nerves (latest: replacing the reload button on Firefox for iOS with a button for the &quot;Home&quot; screen for whatever reason). I am certainly not averse to change but I don&#x27;t like change as a purpose in itself instead of for the better. Unfortunately, a lot of changes nowadays feel like they are solely to keep the UX team employed. Losing Firefox just for that would be a bad bargain. Gecko is the only decent non-chrome&#x2F;ium browser engine that is left and Firefox is the only browser that is using it. We sorely need this remaining bit of diversity! It <i>needs</i> to survive. Despite that, the current leadership of Mozilla is either hell-bent on actively running it into a brick wall or outright ignorant of the fact that this is actually happening for a while already.<p>Do you think they will somehow turn the corner or is Firefox inevitably going to die? I cannot see how they could possibly avoid it if they keep on doing what they currently are doing.<p>(As sad as it is but I wouldn&#x27;t even put it past them to read one day that &quot;sustaining a browser with a low digit marketshare is not a reasonable use of our resources anymore&quot; and that &quot;Mozilla is glad to announce that from now on, we rather focus on the broader mission instead&quot;).",
      "time": 1631517613,
      "title": "Ask HN: Where do you see Firefox going?",
      "type": "story"
    },
    {
      "by": "foothebar",
      "descendants": 1,
      "id": 28508699,
      "kids": [
        28508700
      ],
      "score": 1,
      "time": 1631517558,
      "title": "Covid-19 Graphs Germany",
      "type": "story",
      "url": "https://jalsti.github.io/cov19de/pages/Deutschland.html"
    },
    {
      "by": "Kohzam",
      "descendants": 0,
      "id": 28508697,
      "score": 1,
      "text": "moh covid - 19 vaccination",
      "time": 1631517530,
      "title": "Libtransmission/Watchdir-Win32.cc",
      "type": "story"
    }
  ]
}