{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29050055,
      "score": 1,
      "time": 1635611497,
      "title": "Body Ritual among the Nacirema (1956)",
      "type": "story",
      "url": "https://en.wikisource.org/wiki/Body_Ritual_among_the_Nacirema"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 29050054,
      "score": 2,
      "time": 1635611495,
      "title": "Administration to pay $450K per person to immigrants separated at border",
      "type": "story",
      "url": "https://ktla.com/news/nationworld/biden-administration-in-talks-to-pay-450000-per-person-to-immigrants-separated-at-border/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29050053,
      "score": 1,
      "time": 1635611491,
      "title": "Metadata is the biggest little problem plaguing the music industry (2019)",
      "type": "story",
      "url": "https://www.theverge.com/2019/5/29/18531476/music-industry-song-royalties-metadata-credit-problems"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 29050052,
      "score": 1,
      "time": 1635611487,
      "title": "Why ChipDrop Probably Is Not for You [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ilAv8SzB_Aw"
    },
    {
      "by": "annowiki",
      "descendants": 0,
      "id": 29050040,
      "score": 1,
      "text": "I recently got a job working in the semiconductor industry doing QA automation but I&#x27;ll be transitioning into a developer role over the coming year. Among the long list of topics that I&#x27;ve been having to acquaint myself with are neural networks and machine learning, ellipsometry, linear algebra, and high performance computing. Coming from a Python web-dev background this is a little intimidating. Especially because I have no formal education in CS&#x2F;EE&#x2F;DS&#x2F;math. As a consequence, I&#x27;ve been trying to get better at C&#x2F;C++ (our code base is millions of lines of legacy C++) but I feel like I need a project-based tutorial or tutorials to advance. I&#x27;ve dabbled in C and C++ but my full experience consists of:<p>C: Schildt&#x27;s book years ago (I know its reputation), some chapters in K&amp;R, and the kilo.c tutorial ( https:&#x2F;&#x2F;viewsourcecode.org&#x2F;snaptoken&#x2F;kilo&#x2F; ).<p>C++: Some minimal C-like Arduino coding, a small porting project for a subset of my company&#x27;s code (from Windows MFC style C++ to portable), and an OpenGL tutorial on Youtube because I like generative art and I thought I might be able to make some cool stuff with it and my company&#x27;s software uses OpenGL ( https:&#x2F;&#x2F;www.youtube.com&#x2F;playlist?list=PLlrATfBNZ98foTJPJ_Ev03o2oq3-GGOS2 ).<p>My manager (who got me the job) has been working in the industry for over twenty years and is so familiar with the way processors and memory work that he often opts for writing AVX intrinsics. I want to understand this wizardry, I&#x27;d love to work on developing ML algorithms and performant code, but I&#x27;m a little unsure where to go from here. In the past 3 months I&#x27;ve worked on Neural Networks from Scratch ( https:&#x2F;&#x2F;nnfs.io ), Coding the Matrix, some Keras tutorials for GANs, I did that OpenGL tutorial I mentioned before, and have been reading the HPC book posted here a few days ago ( https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28849854 ). But my mathematics background is scattershot (I majored in Philosophy and Classics; most of my math beyond Trig is self-taught; I studied Calculus 5 years ago and Linear Algebra this year) and I seem to learn a lot faster when I have a project to work on that touches a lot of topics. I learned to program by coding a literature annotation web application after reading Miguel Grinberg&#x27;s Flask Megatutorial, and feel like it was the biggest learning experience of my life. But I&#x27;m having trouble thinking of something to work on, or what I should work on. I don&#x27;t feel that I&#x27;m in Tutorial Hell yet, but rather a different kind of hell: Tutorial Purgatory. I don&#x27;t know which tutorials I should start with, or what I should try experimenting with first.<p>Hence my question: what kind of project should I be working on to get familiar with this sort of stuff? I&#x27;ve been looking for some more projects like the OpenGL video above (I enjoyed writing that project, it just ended too soon; I feel like I learned a lot about dealing with GPU&#x27;s, basic C++ OOP, and CMake). I&#x27;ve been scrolling through Build Your Own X (https:&#x2F;&#x2F;build-your-own-x.vercel.app&#x2F;) filtered for C&#x2F;C++. I&#x27;ve been thinking maybe of following one of the compiler tutorials, or the ray tracing tutorials, or even the Build Your Own Lisp tutorial. I was also thinking about reading the rustlang book, not because I would really ever use Rust, but sometimes learning something like that transfers (3 chapters of SICP elevated my python considerably a couple years ago).<p>A huge part of the university education is getting some guidance on &quot;Where to go next.&quot; But I don&#x27;t have that luxury, so I&#x27;m asking HN. Any guidance would be incredibly appreciated.<p>Thank you.",
      "time": 1635611439,
      "title": "Ask HN: Projects to Self-Learn Scientific/High Performance Computing",
      "type": "story"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 29050012,
      "score": 1,
      "time": 1635611232,
      "title": "Remote Work Is a Bad Fit for Private Equity",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-10-29/buyout-boss-says-remote-work-is-a-bad-fit-for-private-equity"
    },
    {
      "by": "bschne",
      "descendants": 0,
      "id": 29049994,
      "score": 1,
      "time": 1635611124,
      "title": "Mid-Scale Manufacturing",
      "type": "story",
      "url": "http://stephenhawes.com/level-2-manufacturing/"
    },
    {
      "by": "dev_tty01",
      "descendants": 0,
      "id": 29049975,
      "score": 1,
      "time": 1635611002,
      "title": "CDC: Prior Infection Won't Protect You from Covid Hospitalization",
      "type": "story",
      "url": "https://www.medpagetoday.com/infectiousdisease/covid19vaccine/95344"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 29049945,
      "kids": [
        29049968
      ],
      "score": 1,
      "time": 1635610776,
      "title": "Russia imposes nationwide paid holiday to curb Covid",
      "type": "story",
      "url": "https://www.france24.com/en/live-news/20211030-russia-imposes-nationwide-paid-holiday-to-curb-covid"
    },
    {
      "by": "kordlessagain",
      "descendants": 0,
      "id": 29049906,
      "score": 1,
      "time": 1635610526,
      "title": "Disambiguation of mental rotation by spatial frames of reference",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3485783/"
    }
  ]
}