{
  "stories": [
    {
      "by": "jedberg",
      "descendants": 0,
      "id": 30421598,
      "score": 1,
      "time": 1645482798,
      "title": "White Castle to hire 100 robots to flip burgers",
      "type": "story",
      "url": "https://www.today.com/food/restaurants/white-castle-hire-100-robots-flip-burgers-rcna16770"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 30421578,
      "score": 1,
      "time": 1645482683,
      "title": "A Short Treatise on Bugs",
      "type": "story",
      "url": "https://buttondown.email/hillelwayne/archive/a-short-treatise-on-bugs/"
    },
    {
      "by": "ithkuil",
      "descendants": 0,
      "id": 30421550,
      "score": 1,
      "time": 1645482524,
      "title": "Zoned Namespaces (ZNS) SSDs: Disrupting the Storage Industry",
      "type": "story",
      "url": "https://www.snia.org/educational-library/zoned-namespaces-zns-ssds-disrupting-storage-industry-2020"
    },
    {
      "by": "hosa",
      "descendants": 0,
      "id": 30421548,
      "score": 1,
      "text": "I want to know two things\n-how the twitter app discovers my time is incorrect \n-Why it needs me to have the correct time..\nUsually I rant but im sure u all hate Twitter just as much as i do..",
      "time": 1645482521,
      "title": "Ask HN: Why the Twitter app needs the time set correctly to work?",
      "type": "story"
    },
    {
      "by": "EtteillaVII",
      "descendants": 0,
      "id": 30421481,
      "score": 1,
      "time": 1645482209,
      "title": "Show HN: Antique Playing Cards Collection",
      "type": "story",
      "url": "https://ancient.cards"
    },
    {
      "by": "belltaco",
      "descendants": 0,
      "id": 30421421,
      "score": 1,
      "time": 1645481942,
      "title": "Trump’s Truth Social App Launches Without a Social Network",
      "type": "story",
      "url": "https://nymag.com/intelligencer/2022/02/trumps-truth-social-app-launches-without-a-social-network.html"
    },
    {
      "by": "sbmthakur",
      "descendants": 0,
      "id": 30421401,
      "score": 1,
      "time": 1645481840,
      "title": "Examine why HashMap is slow (2015)",
      "type": "story",
      "url": "https://github.com/vavr-io/vavr/issues/571"
    },
    {
      "by": "mrzool",
      "descendants": 0,
      "id": 30421399,
      "score": 3,
      "time": 1645481833,
      "title": "I have no capslock and I must scream",
      "type": "story",
      "url": "https://memex.marginalia.nu/log/48-i-have-no-capslock.gmi"
    },
    {
      "by": "EGreg",
      "descendants": 1,
      "id": 30421370,
      "kids": [
        30421434
      ],
      "score": 1,
      "text": "Everywhere I travel, people everywhere have the same concerns: earn enough money, raise a family, enjoy life. They don’t want these conflicts. So why does it happen?<p>The Russian security council has just unanimously voted to recognize the Russian-speaking breakaway regions of Ukraine as independent. While it’s tempting for many to explain it all as “Putin is behind every decision in Russia and eveyone is a puppet”, this is a more serious situation. What was Putin suppossed to do, ignore them? When the US congress pushed Obama to intervene in Syria, or pushed Trump slap sanctions on Russia, they resisted for a while. But the problem is actually far deeper and more systemic. Almost always, it is the combination of two things that lead to escalating conflicts in the world:<p>1) A discrete (usually binary) choice between status A and B for people on the ground<p>2) An absurd concentration of power in a state, federation, corporate industry, etc.<p>Together, they use mass media to pit regular people against each other on one or another side of an issue, keeping them divided rather than working together to fix the system upstream.<p>I have written about it in many areas of life, and once you see it, you can’t unsee it (links in the comments below)<p><pre><code>  Factory Farming [1]\n  Plastic [1]\n  Fossil Fuels [1]\n  Vaccines [1]\n  Party Poliics [2]\n  Presidential Elections [2]\n  Net Neutrality [3]\n  Women in Tech [4]\n  Israeli-Palestinian Conflict [5]\n</code></pre>\nI could go on… but let me just suggest an obvious solution. Make a UN treaty (like nuclear non-proliferation) committing to gradual transitioning to a system where each region could vote for its membership in neighboring states, and the results would be continuous, eg 30% membership in A, 60% in B, and 10% in a nascent independent state C. This would be reflected in regional arrangements. Separatists among Tamil Tigers, PKK, PLO, Hamas, Catalonians, Kurds, would have had less to fight about.<p>As it is, systems resist change and people are pushed by mass media and culture to ostracize those who push for the system to change, as “traitors” who ”side with the enemy”. Meanwhile, by insisting on 1) consensus on discrete outcomes and 2) concentrations of power on both sides, they just paint themselves into a corner, and could lead to nuclear armaggedon. All for what? The inability to improve the current international system.<p>(1 and 2 is also, incidentally, why blockchains don’t scale as well as almost all other Internet protocols).",
      "time": 1645481731,
      "title": "Show HN: How to avoid World Wars!",
      "type": "story"
    },
    {
      "by": "VHRanger",
      "descendants": 0,
      "id": 30421346,
      "score": 1,
      "time": 1645481627,
      "title": "John Conway: The Free Will Lectures",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=tmx2tpcdKZY"
    }
  ]
}