{
  "stories": [
    {
      "by": "AlexanderTheGr8",
      "descendants": 0,
      "id": 29718459,
      "score": 1,
      "text": "Lossy image compression basically means compressing limited information for human eye to perceive the essentials of the image.<p>So we skip information which human eye cannot perceive and which is redundant (i.e. which is not necessary to understand the essentials of the image).<p>Neural Nets are amazing at figuring out what human eyes can understand. Can&#x27;t they be used for some amazing lossy image compression?<p>IMO, No hard-coded algorithm can work as well as a neural net to figure out how much information is needed for the human eye to understand an image.<p>What do you think? Also are there any discord&#x2F;other channels to discuss data compression?",
      "time": 1640726957,
      "title": "Ask HN: Neural Nets for lossy image compression?",
      "type": "story"
    },
    {
      "by": "jonluca",
      "descendants": 0,
      "id": 29718451,
      "score": 1,
      "time": 1640726919,
      "title": "Ryanair, Hamiltonian Cycles, and using graph theory to find cheap flights (2018)",
      "type": "story",
      "url": "https://blog.jonlu.ca/posts/ryan-air?ref=hn21"
    },
    {
      "by": "sWninja",
      "descendants": 0,
      "id": 29718440,
      "score": 1,
      "time": 1640726852,
      "title": "Google workspaces took over my personal Gmail account notifications",
      "type": "story",
      "url": "https://support.google.com/maps/thread/142841769/personal-contributions-from-gmail-account-correspondence-winding-up-in-corporate-workspace-account?hl=en"
    },
    {
      "by": "toomanyrichies",
      "descendants": 0,
      "id": 29718439,
      "score": 1,
      "time": 1640726851,
      "title": "Lazarus phenomenon: spontaneous return of circulation after ceasing CPR (2007)",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2121643/"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 29718431,
      "score": 1,
      "time": 1640726823,
      "title": "SpaceX forced China's space station to manoeuvre out of way to avoid collisions",
      "type": "story",
      "url": "https://twitter.com/lukOlejnik/status/1475745247363801089"
    },
    {
      "by": "changeofscenery",
      "descendants": 0,
      "id": 29718424,
      "score": 1,
      "text": "To start let me provide some background... I&#x27;m in my early 40&#x27;s and currently work at a major financial institution. After almost 13 years as a web developer, I also am about to graduate with my BSCS. I chose to go back and get the degree more as a personal accomplishment since I know a lot of places will look past it due to my experience in the industry. It&#x27;s been a great experience and has filled in a lot of the theoretical knowledge I missed being a self taught developer.<p>Now, the issue:<p>I live in a mediocre at best tech city. When I started in the field professionally, I somehow ended up in the rut of landing roles as a developer attached to marketing teams. Essentially, I am a full-stack web developer on a specific CMS platform where I make what I call &quot;brochure sites&quot;. Nothing I create solves real problems, nothing is innovative, etc. Any time I suggest new tech, I&#x27;m told no because it would take time for the team to learn it.<p>The team environment is a hot mess... I spend most of my days hand-holding inexperienced co-workers who refuse to learn anything new, often getting stuck just doing their work for them because many of them were designers&#x2F;marketing people who just accidentally ended up in development roles. When I&#x27;m not dealing with them, it&#x27;s a lot of time managing offshore developers who are forced on us by management who have low skill levels, many hired purely to save money and &quot;throw bodies at the problem.&quot; There are some sprints where I am lucky to get 1 or 2 days to actually work on my tickets due to the amount of hand holding I have to do with the rest of the team. And don&#x27;t even dare get caught using jargon of any kind (ex. I used the word polymorphism one day and my co-worker asked me to stop using &#x27;fancy words&#x27;), discussing efficiency of code, etc. Often this leads to members of my team just shutting down and ignoring me. Management doesn&#x27;t care about code quality or anything as long as it looks like we are making things happen. I had one other developer on my team who was awesome to work with, but management let him walk because to them returning to the office was more important than the quality of the work he did (he was a lone member of our team in different city and didn&#x27;t feel going into the office mattered since he was always on zoom anyway).<p>A few months back I started to realize that I was starting to ask myself &quot;Is this really as good as it&#x27;s going to be?&quot; I have been wanting to make the transition into being a part of a team or organization that actually creates products and software, not just &quot;brochure&quot; websites. Now that I have the CS degree, I&#x27;ve even considered looking into attempting to make a move into FAANG. I&#x27;m not looking to change the world or have the illusions that the things I&#x27;m creating are changing humanity, but simply want to be a part of a team that ships something useful.<p>I love being a developer and even spend a lot of my free time learning new things and building small projects... I&#x27;m just over being told to &quot;change the color of this button&quot; and not having real problems to solve.<p>Currently I&#x27;m in the process of doing the following:<p>1. Reading &#x27;Designing Data-Intensive Applications&#x27; to get up to speed on system design and architecture.\n2. Practicing leetcode to prepare for any interviews I land\n3. Learning some new tech (iOS development, Java Spring, keeping my JS chops up, etc)<p>Where my concern is, will this actually lead me anywhere? What more can I be doing to prep for this change? I am worried that with my background, I&#x27;ve been essentially &quot;type cast&quot; as a brochure web dev. At my age is it possible to get out of this rut?",
      "time": 1640726779,
      "title": "Looking for suggestions out of a career rut",
      "type": "story"
    },
    {
      "by": "zarfzarf",
      "descendants": 0,
      "id": 29718412,
      "score": 1,
      "time": 1640726688,
      "title": "Chrome Audio Worklet Examples",
      "type": "story",
      "url": "https://googlechromelabs.github.io/web-audio-samples/audio-worklet/"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 29718372,
      "score": 2,
      "time": 1640726457,
      "title": "Revealed: Palantir’s Top-Secret User Manual for Cops",
      "type": "story",
      "url": "https://www.vice.com/en/article/9kx4z8/revealed-this-is-palantirs-top-secret-user-manual-for-cops"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 29718368,
      "score": 1,
      "time": 1640726451,
      "title": "Lunar architecture: small step for 3D printers, giant leap for humankind",
      "type": "story",
      "url": "https://newsroom.unsw.edu.au/news/art-architecture-design/lunar-architecture-small-step-3d-printers-giant-leap-humankind"
    },
    {
      "by": "algo_trader",
      "descendants": 0,
      "id": 29718357,
      "score": 2,
      "time": 1640726383,
      "title": "DoE Spent $1.1B to Build Just 3 Carbon Capture Demos",
      "type": "story",
      "url": "https://www.enr.com/articles/53336-report-doe-spent-11b-to-build-just-3-carbon-capture-demos"
    }
  ]
}