{
  "stories": [
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 30633038,
      "score": 1,
      "time": 1646949571,
      "title": "A transistor made using two atomically thin materials sets size record",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/03/a-transistor-made-using-two-atomically-thin-materials-sets-size-record/"
    },
    {
      "by": "aaavl2821",
      "descendants": 0,
      "id": 30633037,
      "score": 1,
      "time": 1646949567,
      "title": "Big investors slashing exposure to early-stage biotech stocks",
      "type": "story",
      "url": "https://www.baybridgebio.com/blog/ipo-investor-allocations.html"
    },
    {
      "by": "RansomStark",
      "descendants": 0,
      "id": 30633017,
      "score": 1,
      "time": 1646949446,
      "title": "1980s news report on early internet virus",
      "type": "story",
      "url": "https://hackaday.com/2022/03/08/retrotechtacular-cheesy-1980s-news-report-on-early-internet-virus/"
    },
    {
      "by": "sfjailbird",
      "descendants": 0,
      "id": 30633006,
      "score": 1,
      "time": 1646949399,
      "title": "YouTube censors Ukraine documentary featuring Oliver Stone",
      "type": "story",
      "url": "https://www.rt.com/pop-culture/551652-youtube-removes-ukraine-documentary/"
    },
    {
      "by": "astlouis44",
      "descendants": 0,
      "id": 30632992,
      "score": 1,
      "time": 1646949315,
      "title": "Niantic acquires web-based augmented reality platform 8th Wall",
      "type": "story",
      "url": "https://siliconangle.com/2022/03/10/niantic-acquires-web-based-augmented-reality-platform-8th-wall/"
    },
    {
      "by": "vpatton",
      "descendants": 1,
      "id": 30632990,
      "kids": [
        30632991
      ],
      "score": 1,
      "time": 1646949314,
      "title": "a",
      "type": "story",
      "url": "https://apply.workable.com/illumis/j/21B06D85F2/"
    },
    {
      "by": "dfsegoat",
      "descendants": 0,
      "id": 30632979,
      "score": 1,
      "time": 1646949242,
      "title": "Ukraine offers Taiwan a wake-up call, and lessons in resistance",
      "type": "story",
      "url": "https://breakingdefense.com/2022/03/ukraine-offers-taiwan-a-wake-up-call-and-lessons-in-resistance/"
    },
    {
      "by": "rmason",
      "descendants": 1,
      "id": 30632975,
      "kids": [
        30633042
      ],
      "score": 1,
      "time": 1646949228,
      "title": "Om Malik: Peek into the Future",
      "type": "story",
      "url": "https://om.co/2022/03/09/apple-studio-display-amazing/"
    },
    {
      "by": "washedDeveloper",
      "descendants": 0,
      "id": 30632966,
      "score": 1,
      "text": "We have been using Gantt charts in my engineering class for the last 2 semesters and honestly I find it pointless. I’m really curious if they are used in industry. I find a lot of project management tools we have learned in this class to simply beat around the bush of actually getting things done.",
      "time": 1646949162,
      "title": "Ask HN: Are Gantt Charts Used in Industry",
      "type": "story"
    },
    {
      "by": "internet_jockey",
      "descendants": 0,
      "id": 30632952,
      "score": 5,
      "text": "Hi! This is Chris Best, Hamish McKenzie, and Jairaj Sethi, the founders of Substack, with Sachin Monga, the head of product. Yesterday, we launched an iOS app for Substack, so you can read all your Substack subscriptions in one place, with no distractions.<p>Readers have been tweeting at us for years now to ask when we’d have an app. We’ve long wanted one too, and we suddenly got the manpower to be able to build a good one when we acquired Sachin’s company Cocoon (W19) last year.<p>Soon after starting Substack, we found it easiest to explain what we do as “We make it simple to start a paid newsletter.” Even then, a Substack was more than just an email newsletter: it was also a blog, and it could host embedded video and audio, and people could leave comments and participate in discussion threads. But the term “newsletter” was useful shorthand because everyone kind of got what that meant. All along, though, we’ve been quietly building the tools for what we call “personal media empires,” encompassing different media formats (natively) and community discussion (which we intend to make better and better).<p>By a similar token, right from the start we’ve been intending for the company to do more than just provide subscription publishing tools. We’re excited by the vision of Substack becoming a network, where writers and readers benefit from being part of a larger ecosystem. For writers, it means they can be discovered by readers who might not otherwise have found them. For readers, it means being able to connect directly with writers and other readers and to explore a universe of great work.<p>The app is a key part of the network vision. Nothing changes in terms of writers and readers being in control. The writers still own their mailing lists, content, and IP and can take it all with them anytime they want. Anyone who signs up to a Substack through the app still goes on to that mailing list. And readers still get to choose what appears in their “inbox,” with the power to subscribe and unsubscribe from whatever they want (you can also add any RSS feed into the app via reader.substack.com). But now we’ll have more and better ways to surface recommendations from writers and readers, to show people’s profiles, and to deliver notifications inside and outside of the app.<p>This is just a start for the Substack app. We want to keep improving it, so please give us feedback and ask us the hard questions. What do you think we’re doing wrong? What could be better? What could be great? What might we not have thought of?<p>We’re here for the next couple hours. Ask us anything.<p>[https:&#x2F;&#x2F;on.substack.com&#x2F;p&#x2F;substackapp]",
      "time": 1646949083,
      "title": "Show HN: We’re the founders of Substack, we just launched an iOS app. AMA",
      "type": "story"
    }
  ]
}