{
  "stories": [
    {
      "by": "ExogenyKarl",
      "descendants": 0,
      "id": 30959784,
      "score": 1,
      "time": 1649437780,
      "title": "Scandals in Academic Economics That You've Never Heard Of",
      "type": "story",
      "url": "https://karlstack.substack.com/p/the-top-10-scandals-in-academic-economics"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 30959783,
      "score": 1,
      "time": 1649437780,
      "title": "Boquila trifoliolata mimics leaves of an artificial plastic host plant",
      "type": "story",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8903786/"
    },
    {
      "by": "3a2d29",
      "descendants": 0,
      "id": 30959782,
      "score": 1,
      "text": "Hello all,<p>I got my first swe job this past August and it honestly has not gone well.  I&#x27;ve enjoyed it, but it is clear that I am not seen as reliable and definitely not known for completing things fast and correctly.<p>I know this sounds like a normal junior dev, but I mean more than a normal beginner.  Example:  I have now been on this team for 8 months, and I made 2 costly mistake back-to-back that is pushing back the release of a production feature by a while month at this point.<p>Long story short, screwed up a step I had done before in the fall without realizing, then immediately after an unrelated issue came up and I spent a week and half trying to fix it instead of telling team members.  Then when it was fixed I submitted a ticket for a prod systems account rather than a QA one not realizing there would be a difference. (Just so many mistakes all in a row).<p>The struggles came way before this though.  Almost every new story I am assigned, I have no idea where to begin.  I end up asking tons of questions and running blindly in circles.  I was sometimes assigned stories no one else on the team had done anything remotely like before, so at times I couldn&#x27;t even ask the senior devs for help.<p>This gets down to the issue.  I don&#x27;t think my team is necessarily the most ideal to learn on (my manager has been gone since December and when he was around was busy managing 2 other teams so we didn&#x27;t talk much).  The senior engineers also seem to assume I have basic knowledge of things (like the credentials above, it seems obvious there would be an account for QA and one for Prod, but I didn&#x27;t know to assume that). But, the thing is though, this team isn&#x27;t a bad one. I can make excuses all I want, but a barely more experienced engineer joined the same time I did and he knew more by week 3 than I know now.<p>I have identified some issues. I certainly didn&#x27;t ask enough questions when I started and I definitely will wait around for people to get back to me sometimes rather then be proactive.  I also tend to spend hours tackling an issue or trying to fix something I think I messed up rather than raise it to the team that I am having an issue. The problem is at this point I have been on the team too long to ask any basic questions, one of the senior engineers even pointed out they shouldn&#x27;t be helping me with certain processes at this point.<p>I&#x27;ve been trying to identify other problems and possibly my memory is terrible?  I sometimes can&#x27;t remember the things we went over or every step of things we did in the fall.<p>Honestly, I am also super deflated.  I know imposter syndrome is a thing, but that doesn&#x27;t count when I am actively slowing the team down and causing problems.  Imposter syndrome is worrying everyone will find out you are a fake even though you are doing your work well enough.  I am not doing it well and I am not worried about people finding out because people already know I am bad. The amount of time I delayed our release (3 weeks) probably equals the amount of time it would take the senior engineers to do all the work I have done in these 8 months.  I did well in school in my CS classes and worked hard, and so its a huge kick in the gut to just feel like my team actively is disappointed in me and that if any issue came up, I am probably the last engineer anyone would want to help (and probably the first they would assume caused it).",
      "time": 1649437780,
      "title": "Ask HN: What to do when struggling as junior swe?",
      "type": "story"
    },
    {
      "by": "kqr",
      "descendants": 0,
      "id": 30959772,
      "score": 1,
      "time": 1649437739,
      "title": "Effective Strikes and Economic Actions",
      "type": "story",
      "url": "https://archive.iww.org/about/solidarityunionism/directaction/"
    },
    {
      "by": "DemiGuru",
      "descendants": 0,
      "id": 30959746,
      "score": 1,
      "time": 1649437652,
      "title": "US eases sanctions that may lead to Russia's Internet isolation",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/technology/us-eases-sanctions-that-may-lead-to-russias-internet-isolation/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30959735,
      "score": 1,
      "time": 1649437606,
      "title": "Russian influencers scramble to maintain their followers – and livelihoods",
      "type": "story",
      "url": "https://www.niemanlab.org/2022/04/russian-influencers-scramble-to-maintain-their-followers-and-livelihoods/"
    },
    {
      "by": "chrisshroba",
      "descendants": 0,
      "id": 30959723,
      "score": 3,
      "text": "I frequently struggle with going down a lot of unimportant rabbit holes when I&#x27;m working on a project, especially in the early stages when there are lots of decisions to be made and things to set up. Have you found any practices that help you work and prioritize more effectively?",
      "time": 1649437566,
      "title": "Ask HN: How do you avoid bikeshedding?",
      "type": "story"
    },
    {
      "by": "jlaurito",
      "descendants": 0,
      "id": 30959706,
      "score": 2,
      "time": 1649437473,
      "title": "WebGL Usage Patterns at Squarespace",
      "type": "story",
      "url": "https://engineering.squarespace.com/blog/2022/how-we-use-webgl-at-squarespace-877l9-8lyaw"
    },
    {
      "by": "afridi",
      "descendants": 0,
      "id": 30959674,
      "score": 1,
      "text": "Hi there – I&#x27;ve heard about many overseas engineering firms that are great at building MVPs for startups.<p>What are the best ways to go about finding and evaluating one for a new startup? Resources I find online (like Clutch) have so many names but so little actionable information.",
      "time": 1649437315,
      "title": "Ask HN: Recommended engineering firms / dev shops for MVPs?",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30959673,
      "score": 1,
      "time": 1649437313,
      "title": "Plastic (and payments) in the fantasy supply chain",
      "type": "story",
      "url": "https://bam.kalzumeus.com/archive/payments-and-plastic-in-the-fantasy-supply-chain/"
    }
  ]
}