{
  "stories": [
    {
      "by": "kotekote",
      "descendants": 0,
      "id": 29989520,
      "score": 1,
      "time": 1642562309,
      "title": "DeSo is introducing DAO coins to help support founders",
      "type": "story",
      "url": "https://blogiestools.com/deso-is-introducing-dao-coins-to-help-support-founders/"
    },
    {
      "by": "xk3",
      "descendants": 0,
      "id": 29989499,
      "score": 1,
      "time": 1642562192,
      "title": "Amazon Theatre",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Amazon_Theatre"
    },
    {
      "by": "cardamomo",
      "descendants": 0,
      "id": 29989478,
      "score": 1,
      "time": 1642561983,
      "title": "Some Contemporary Heresies",
      "type": "story",
      "url": "https://kk.org/thetechnium/some-contemporary-heresies/"
    },
    {
      "by": "idealvin",
      "descendants": 0,
      "id": 29989444,
      "score": 1,
      "time": 1642561666,
      "title": "A go-style coroutine library in C++11 from the Namake Planet",
      "type": "story",
      "url": "https://github.com/idealvin/cocoyaxi"
    },
    {
      "by": "thread_id",
      "descendants": 0,
      "id": 29989419,
      "score": 2,
      "time": 1642561466,
      "title": "What Is Pegasus? How Surveillance Spyware Invades Phones",
      "type": "story",
      "url": "https://theconversation.com/what-is-pegasus-a-cybersecurity-expert-explains-how-the-spyware-invades-phones-and-what-it-does-when-it-gets-in-165382"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 29989372,
      "score": 2,
      "time": 1642561056,
      "title": "My adventures in writing an OTA bootloader for the ATmega128RFA1",
      "type": "story",
      "url": "https://bitbanksoftware.blogspot.com/2018/09/my-adventures-in-writing-ota-bootloader.html"
    },
    {
      "by": "justinlloyd",
      "descendants": 0,
      "id": 29989333,
      "score": 1,
      "text": "Looking for feedback not on our interview loop, or our work environment, but how we communicate that to prospective candidates in our job ads about what to expect.<p>Yes? No? Too cringey? Not professional enough? We aren&#x27;t adjusting how we perform the following interview loop or our workday, but I&#x27;ll take criticism on how we communicate it to candidates.<p>* The Interview Loop *<p>Assuming you pass each stage, our interview loop consists of a brief screening chat with a principal engineer. A follow-up chat with the CEO. Then a day of one-on-one interviews with each principal engineer. We will grill you on your core competencies, we’ll look at your github if you have one, and we will crawl all through those github repos that belong to you, we’ll look at projects you’ve created and worked on, both personal and professional, and we’ll ask penetrating questions about your past work, but what we won’t do is “leetcode” you or give you an interminable take home project.<p>* How We Work *<p>We’re an international team. We work out of California, New Mexico, Oregon, Paris, Canada, Italy, China and often anywhere our feet take us. We gather in San Francisco and Paris every few months for several days where we can work on problems together, cook together (one of our engineers is a professionally trained chef), make music (some of our engineers are professional musicians), and figure out what our next steps will be. Our in-person gatherings are similar to “makerspace meetups” than professional office environments - we write code, wire up circuit boards, 3D print new components, trade stories, cook food, make decisions, make noise and make a mess. Our in-person gatherings are intense and a different type of work than what you do at your keyboard every day and they are never the same twice.<p>* Our Work Day *<p><pre><code>  Starting around 10AM PST or 10AM GMT depending on your local time zone.\n\n    We look for core overlap in our work days.\n\n  Being connected via Discord and email during our workday and being responsive when needed.\n\n    But also putting out the “do not disturb” sign when we need an extended period of focus.\n\n  Keeping up to date on the development of each other’s work.\n\n    Working remotely can be an isolating lifestyle, following each other’s work let’s us stay connected.\n\n  Keeping abreast of the latest developments in the high-end, cutting edge VR space.\n\n  Pushing and pulling to and from our code repo regularly.\n\n    We’d rather you push something that doesn’t work yet, twice a day, than push perfect once a month.\n\n  Showing our work, even when it is broken and not ready to be shown.\n\n    We’d rather see the engine disassembled in pieces, scattered across your living room floor, and you excitedly talking about what problems you are having and the solution you think will work than hiding everything away until it is ready.\n\n  Updating our tasks on Trello\n\n    And sometimes we do this diligently\n\n    And sometimes we forget\n\n    But the important thing is to communicate\n\n  Taking a once a week all hands meeting to discuss important issues.\n\n  Take a once a week one-on-one with your team lead&#x2F;CEO.\n\n  Update everyone at end of day via Discord on what you worked on, what you’re going to work on tomorrow, and just keeping everyone in the loop in how your workday is going.\n\n  Saying “I don’t know how to do that... yet” an awful lot because we’re breaking new ground here, every day.</code></pre>",
      "time": 1642560673,
      "title": "Ask HN: Feedback on how we communicate our interview loop and work environment",
      "type": "story"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 29989294,
      "score": 1,
      "time": 1642560396,
      "title": "High Cost of an Easy Job",
      "type": "story",
      "url": "https://ofdollarsanddata.com/the-high-cost-of-an-easy-job/"
    },
    {
      "by": "bb88",
      "descendants": 0,
      "id": 29989269,
      "score": 1,
      "time": 1642560233,
      "title": "Crytoland AMA",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=aAYSUpCmVd8"
    },
    {
      "by": "picture",
      "descendants": 0,
      "id": 29989224,
      "score": 1,
      "time": 1642559915,
      "title": "Monday Microcontroller: Adafruit Clue",
      "type": "story",
      "url": "https://bigl.es/monday-microcontroller-adafruit-clue/"
    }
  ]
}