{
  "stories": [
    {
      "by": "unlimiter",
      "descendants": 0,
      "id": 31812276,
      "score": 1,
      "time": 1655742510,
      "title": "Playtest-Less Balancing",
      "type": "story",
      "url": "https://medium.com/@unlimiter/playtest-less-balancing-296bdd95fb0f"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31812270,
      "score": 1,
      "time": 1655742484,
      "title": "Self-Driving Big Rigs Are Coming. Is America Ready?",
      "type": "story",
      "url": "https://www.wsj.com/articles/self-driving-big-rigs-are-coming-is-america-ready-11655524823"
    },
    {
      "by": "boeingUH60",
      "descendants": 0,
      "id": 31812261,
      "score": 1,
      "time": 1655742451,
      "title": "Crypto Broker Voyager Gets $500M Loan from Sam Bankman-Fried's Alameda Research",
      "type": "story",
      "url": "https://blockworks.co/voyager-to-borrow-500m-from-alameda-amid-insolvency-rumors/"
    },
    {
      "by": "Ariarule",
      "descendants": 0,
      "id": 31812259,
      "score": 1,
      "time": 1655742446,
      "title": "Contra Wirecutter on the IKEA air purifier",
      "type": "story",
      "url": "https://dynomight.net/ikea-purifier/"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 31812255,
      "score": 1,
      "time": 1655742433,
      "title": "The franchise frenzy leaves nothing to the imagination",
      "type": "story",
      "url": "https://www.wired.com/story/streaming-lose-headcanon/"
    },
    {
      "by": "car",
      "descendants": 0,
      "id": 31812247,
      "score": 1,
      "time": 1655742405,
      "title": "The Long, Troubled History of the Supreme Court–and How We Can Change It",
      "type": "story",
      "url": "https://www.thenation.com/article/society/supreme-court-dangerous/"
    },
    {
      "by": "GWBullshit",
      "descendants": 0,
      "id": 31812238,
      "score": 1,
      "text": "My Google Chrome crashed recently.<p>Among the tabs open was a &quot;Restore pages?&quot; tab from the session where it previously crashed.<p>Realizing that that tab was gone, I concluded that the only thing to do was to manually go through Google Chrome History to manually search for tabs from the previous session that I wanted to open up.<p>And then I discovered something I never realized before about Google Chrome History.<p>Not only are the days not collapsable like in other browsers to make for a more practical UI experience ... not only is the search function broken (for example, searching by month gives very few day results, and searching by exact day sometimes gives zero results even though I&#x27;m 100% sure I used Chrome to surf the web on those days) ... BUT the &quot;scroll down&quot; function has this unbelievably annoying habit of redirecting me to the top of the history when loading up dates before what is immediately viewable on the first instance of the History page.<p>For example, let&#x27;s say the last 5 days are viewable and as I approach &quot;5 days ago&quot; the scroll button is towards the bottom of the page.<p>As the &quot;6th day ago&quot; loads up, Google automatically redirects me towards the top of the History page and I have to scroll all the way back down to see the 6th day; this process seems to repeat indefinitely so for example as I re-scroll down to see &quot;7 days ago&quot;, as the 7th day ago history loads up, Google History again sends me back to the beginning of the process so I have to scroll all the way back down to see the 7th day ago, etc.<p>I CANNOT believe that in 2022 this is &quot;by design&quot; and&#x2F;or &quot;a flaw that still hasn&#x27;t been addressed&quot;.<p>Am I missing something?<p>I know, &quot;Use another browser&quot;.<p>But honestly at this point I just need to retrieve some URLs from a while ago and don&#x27;t care how potentially embarrassing the answer may be.<p>Is there a simple &quot;toggle this on&#x2F;off&quot; or something that I&#x27;m missing?<p>Because I can&#x27;t believe people at a company like Google would design something this horrible by default.",
      "time": 1655742384,
      "title": "How to Deal with Google Chrome's Atrocious History Design",
      "type": "story"
    },
    {
      "by": "p5v",
      "descendants": 0,
      "id": 31812229,
      "score": 1,
      "time": 1655742331,
      "title": "Show HN: A daily email digest of the best links from one's Twitter friends",
      "type": "story",
      "url": "https://murmel.social"
    },
    {
      "by": "JonathanBeuys",
      "descendants": 0,
      "id": 31812219,
      "score": 2,
      "text": "Hello HN!<p>I mainly write text and code. I have a few photos.<p>Any opinions on what I should use for daily incremental backups?<p>The simplest approach seems to be a thumbdrive. These can store giant amounts of data these days.<p>I am not sure how reliable they are though.<p>Is an external SSD better?<p>Or even a good old spinning disk?",
      "time": 1655742294,
      "title": "Ask HN: What is a good medium for daily incremental backups?",
      "type": "story"
    },
    {
      "by": "csnover",
      "descendants": 0,
      "id": 31812198,
      "score": 1,
      "time": 1655742234,
      "title": "America’s first CRISPR trial is still nearly 100% effective 3 years on",
      "type": "story",
      "url": "https://newatlas.com/health-wellbeing/crispr-vertex-long-term-follow-up-gene-editing-sickle-cell/"
    }
  ]
}