{
  "stories": [
    {
      "by": "Pigalowda",
      "descendants": 0,
      "id": 29496346,
      "score": 1,
      "time": 1639050574,
      "title": "Evergrande has defaulted on its debt",
      "type": "story",
      "url": "https://www.cnn.com/2021/12/09/investing/evergrande-default-fitch-intl-hnk/index.html"
    },
    {
      "by": "weinzierl",
      "descendants": 0,
      "id": 29496320,
      "score": 1,
      "time": 1639050327,
      "title": "CVE-2021-1048: refcount increment on mid-destruction file",
      "type": "story",
      "url": "https://googleprojectzero.github.io/0days-in-the-wild/0days-in-the-wild/0day-RCAs/2021/CVE-2021-1048.html"
    },
    {
      "by": "AryanBeezadhur",
      "descendants": 0,
      "id": 29496298,
      "score": 2,
      "time": 1639050157,
      "title": "Cloudflare acquires Zaraz to speed up websites and solve third-party bloat",
      "type": "story",
      "url": "https://venturebeat.com/2021/12/08/cloudflare-acquires-zaraz-to-speed-up-websites-and-solve-third-party-bloat/"
    },
    {
      "by": "wjSgoWPm5bWAhXB",
      "descendants": 0,
      "id": 29496257,
      "score": 1,
      "time": 1639049587,
      "title": "Research brings analog computers just one step from digital",
      "type": "story",
      "url": "https://techxplore.com/news/2021-12-analog-digital.html"
    },
    {
      "by": "rosege",
      "descendants": 0,
      "id": 29496225,
      "score": 1,
      "time": 1639049211,
      "title": "DoorDash won't reimburse customer after driver caught stealing food",
      "type": "story",
      "url": "https://www.facebook.com/login/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 29496184,
      "score": 1,
      "time": 1639048804,
      "title": "Project 100k (IQ)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Project_100,000"
    },
    {
      "by": "pietromenna",
      "descendants": 1,
      "id": 29496171,
      "kids": [
        29496287
      ],
      "score": 1,
      "time": 1639048680,
      "title": "Visual Studio Code November 2021 Updates",
      "type": "story",
      "url": "https://code.visualstudio.com/updates/v1_63https://code.visualstudio.com/updates/v1_63"
    },
    {
      "by": "miki123211",
      "descendants": 0,
      "id": 29496170,
      "score": 1,
      "time": 1639048669,
      "title": "Microsoft introduces voice that can speak 14 languages fluently",
      "type": "story",
      "url": "https://techcommunity.microsoft.com/t5/azure-ai-blog/azure-text-to-speech-updates-at-build-2021/ba-p/2382981"
    },
    {
      "by": "nordicengineer",
      "descendants": 2,
      "id": 29496160,
      "kids": [
        29496283,
        29496313
      ],
      "score": 4,
      "text": "I&#x27;m a pretty senior IT individual in Scandinavia with a fairly broad experience in web&#x2F;cloud&#x2F;platform, vetted by a number of high-profile companies.<p>I&#x27;ve been looking for a job that suits me, a meaningful and&#x2F;or interesting job, for the better part of 2021, in what many call a &quot;hot&quot; market, and I&#x27;m at a stage where I wonder if it&#x27;s raining only on me. Many would say I have unmatchable standards. When in fact, I believe my ask is fairly basic.<p>For starters, many recruiters&#x2F;employers seem to get stuck on a keyword in my profile, or lack of a keyword, and want someone to help out with said keyword. It&#x27;s enough to ask a simple question as &quot;why &lt;keyword&gt;?&quot; that they freeze. &quot;What do you mean why should we X? Because that&#x27;s what everyone does, because otherwise our employers will not find it cool here and leave, etc&quot;<p>I get that teams want to redo their tech stack at times, but if they don&#x27;t specifically ask for it, nor does the product&#x2F;company have plans to expand&#x2F;grow, then why create unnecessary work? Hire for boring maintenance. Many are happy to do just that. But more work will not make your people happier. It&#x27;s just maniac managers creating work for them to manage with tech they don&#x27;t understand.<p>Sometimes you like the hiring manager (which is important!) and go to the next interview only to find out that the hiring manager is actually about to leave soon, or that the manager is 100% misaligned with the team&#x2F;product.<p>Sometimes you go through the entire process, get a really good offer, ask to have a last call with the hiring manager (who only talked with you for 15 minutes, out of a 6-hour-long process) and they ghost you.<p>Sometimes they throw at you some shitty challenge, exactly like a school exam where they test your memory and obedience, but not your abilities, while you have tons of open-source code and contributions to sift throw.<p>Sometimes they talk so much about fit fit fit, but they don&#x27;t even bother with a personality or IQ test (which as a former hiring manager, I find very valuable because it allows you to balance the team, not because you see how high&#x2F;low people score).<p>Sometimes you rephrase your entire pitch to highlight what you want to do next, but nobody reads that, their eyes still fall on stupid keywords.<p>Sometimes they think you&#x27;re a good match, but they dig and dig only to find something that doesn&#x27;t fit, and then you catch them red-handed: actually a former employer left and now they hire for a replacement, and they are looking for the exact set of skills. A clone. Because a clone will be so happy to replace the quitter... That&#x27;s some fine logic right there! Not.<p>Sometimes you get the job and when you start rolling questions and ideas, you get a &quot;talk to the hand&quot; followed by &quot;that&#x27;s now what you&#x27;re here for&quot;. Why hire a senior person as a poster, if you&#x27;re not willing to be challenged and listen to different ideas? Nobody is asking you to agree, just play ball with convincing arguments. Too much of an ask, I guess.<p>I have worked and hired at times some of the nicest, most loyal, most engaged people I&#x27;ll ever know - almost none of them checked all the boxes. I hired for potential. One of them even confessed years later &quot;I&#x27;m baffled why did you take me in without a test, knowing that I don&#x27;t know the tech stack, etc&quot;. Because you had mega potential, and you exceeded everyone&#x27;s expectations in the end!<p>Almost nobody seems to hire for potential these days! Everyone wants to be different, by doing the exact same thing as everyone else: use teamtailor, use external headhunters, have video chats, &quot;fullstack&quot; everywhere, find out what candidates lack, and then complain that they can&#x27;t find good people.<p>Am I the only one in this dark movie? Am I the only &quot;unlucky&quot; software engineer? I somehow didn&#x27;t see this happening in Scandinavia. Joke&#x27;s on me I guess.<p>PS: using a burnout account because I don&#x27;t want to diminish my chances of finding a gig even further.",
      "time": 1639048606,
      "title": "Ask HN: Am I the only “unlucky” software engineer?",
      "type": "story"
    },
    {
      "by": "1cvmask",
      "descendants": 1,
      "id": 29496156,
      "kids": [
        29496174
      ],
      "score": 1,
      "time": 1639048567,
      "title": "Europe needs to wake up to the costs of hosting data centres",
      "type": "story",
      "url": "https://www.ft.com/content/fe968bbb-c15d-455f-964c-9aeeef9db5f1"
    }
  ]
}