{
  "stories": [
    {
      "by": "0x64",
      "descendants": 0,
      "id": 31563435,
      "score": 1,
      "time": 1653943458,
      "title": "Ethereum's “Ropsten” testnet to be upgraded to Proof-of-Stake in early June",
      "type": "story",
      "url": "https://blog.ethereum.org/2022/05/30/ropsten-merge-announcement/"
    },
    {
      "by": "captainchris",
      "descendants": 0,
      "id": 31563431,
      "score": 1,
      "text": "Hi HN:<p>Just reaching out to the hn community to see if anyone might be able to point me to a paying coding gig, and also provide a small advance in order to obtain a reasonable laptop to perform the work.<p>I asked for help here last week, and a number of people sent me emergency food money. I have been rationing this money and should be okay for food until my SNAP food benefits renew this coming weekend. I am living unsheltered, and am seeking to reach a point where I can code full time and build a financial base. I live in the countryside where it&#x27;s warm but there are limited resources here.<p>I do need basic items like a bicycle, a tent, and a membership at the local coworking space. But, most important perhaps is to obtain a laptop, and a paying project to earn the laptop. Does anyone in the community have a spare laptop (min. 8GB&#x2F;SSD) or can anyone possibly hire me for coding to pay off a new laptop? I am proficient in most phases of web development and am a seasoned software developer who burned out a few years ago. Seeking to start coding professionally again and establish a low-stress coding routine. I am in my 40&#x27;s in the USA.<p>Once I am up and running with needed basics, I can then seek work online, then eventually seek an interview for a ft&#x2F;permanent position. Just problem solving one problem at a time. If you can help, can you email me at hackernewscontactmail at gmail? Thank you.",
      "time": 1653943423,
      "title": "Ask HN: Work project for laptop and other basics",
      "type": "story"
    },
    {
      "by": "tsaprailis",
      "descendants": 0,
      "id": 31563413,
      "score": 3,
      "time": 1653943272,
      "title": "Image of a genome autosuspends you from Twitter",
      "type": "story",
      "url": "https://twitter.com/Kupeplex/status/1531254734711046144"
    },
    {
      "by": "vwoolf",
      "descendants": 0,
      "id": 31563409,
      "score": 1,
      "time": 1653943237,
      "title": "US urban planners cannot wholly undo sprawl",
      "type": "story",
      "url": "https://medium.com/the-future-is-electric/us-urban-planners-cannot-undo-sprawl-72f42e0144a6"
    },
    {
      "by": "NickRandom",
      "descendants": 0,
      "id": 31563407,
      "score": 1,
      "time": 1653943210,
      "title": "Remembering Apple’s Newton, 30 years on",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/05/remembering-apples-newton-30-years-on/"
    },
    {
      "by": "apsec112",
      "descendants": 0,
      "id": 31563384,
      "score": 1,
      "time": 1653943044,
      "title": "An Introduction to Logical Decision Theory",
      "type": "story",
      "url": "https://arbital.com/p/logical_dt/?l=5kv"
    },
    {
      "by": "fabianholzer",
      "descendants": 0,
      "id": 31563345,
      "score": 1,
      "time": 1653942767,
      "title": "Twelve quick tips for software design",
      "type": "story",
      "url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1009809"
    },
    {
      "by": "pinacolada123",
      "descendants": 2,
      "id": 31563325,
      "kids": [
        31563350,
        31563398
      ],
      "score": 1,
      "text": "Sometimes I just don&#x27;t feel like working. Other times I am in flow at 100% and feel like if I didn&#x27;t have to sleep or have meetings I could get everything on my plate finished.<p>How do others feel? Are you mostly working at your optimal productivity &#x2F; motivation level? Has it changed as you got older?<p>Maybe it&#x27;s just me but there are days I get nothing done, and when you have daily stand-ups you simply cannot say that so you just make shit up or say you were swamped in busy work.<p>I&#x27;m wondering if there is a better philosophy to managing people with this in mind, although I am finding that humans need deadlines and external pressure in some form or nothing gets done.",
      "time": 1653942572,
      "title": "Ask HN: How often are you operating at 100% productivity/motivation?",
      "type": "story"
    },
    {
      "by": "chazeon",
      "descendants": 0,
      "id": 31563324,
      "score": 1,
      "time": 1653942564,
      "title": "Outbreak Investigation of Hepatitis a Virus: Strawberries (May 2022) – FDA",
      "type": "story",
      "url": "https://www.fda.gov/food/outbreaks-foodborne-illness/outbreak-investigation-hepatitis-virus-strawberries-may-2022"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31563323,
      "score": 1,
      "time": 1653942544,
      "title": "The American who honors the memory of 200k fallen war heroes",
      "type": "story",
      "url": "https://www.foxnews.com/lifestyle/meet-american-who-200000-war-heroes"
    }
  ]
}