{
  "stories": [
    {
      "by": "mindcrime",
      "descendants": 0,
      "id": 29765925,
      "score": 1,
      "time": 1641098912,
      "title": "Trivrost – A repurposable application downloader and launcher",
      "type": "story",
      "url": "https://github.com/setlog/trivrost"
    },
    {
      "by": "Bud",
      "descendants": 0,
      "id": 29765923,
      "score": 1,
      "time": 1641098870,
      "title": "It rained fish over a Texas town this week in a bizarre weather event",
      "type": "story",
      "url": "https://www.cnn.com/2022/01/01/us/texas-raining-fish-scn-cec/index.html"
    },
    {
      "by": "rahulpadalkar",
      "descendants": 0,
      "id": 29765911,
      "score": 1,
      "time": 1641098784,
      "title": "Writing UseState Hook from Scratch",
      "type": "story",
      "url": "https://longing-food-e38.notion.site/Writing-useState-hook-from-scratch-4a633e81e7634b0ea351256f03340581"
    },
    {
      "by": "aww_dang",
      "descendants": 0,
      "id": 29765884,
      "score": 1,
      "time": 1641098447,
      "title": "Why Every Entrepreneur Should Study the Austrian School of Economics",
      "type": "story",
      "url": "https://www.entrepreneur.com/article/395462"
    },
    {
      "by": "iccowan",
      "descendants": 0,
      "id": 29765867,
      "score": 1,
      "time": 1641098200,
      "title": "Indie hackers – Save hacking time and get ready to Rapid Auth",
      "type": "story",
      "url": "https://www.rapidauth.me/"
    },
    {
      "by": "ralmidani",
      "descendants": 2,
      "id": 29765861,
      "kids": [
        29765919,
        29765872
      ],
      "score": 1,
      "text": "I currently subscribe to Apple News+ (Time, Newsweek, WSJ, etc.) and The Economist. I don’t feel that NYT&#x2F;WaPo provide enough quality content to warrant separate subscriptions. Even with The Economist I hesitated, but the content and analysis are really top-notch and, even if I don’t read everything, it’s at least worth supporting and helping sustain the publication.",
      "time": 1641098120,
      "title": "Ask HN: Which News Sources Do You Pay For?",
      "type": "story"
    },
    {
      "by": "Retr0id",
      "descendants": 0,
      "id": 29765853,
      "score": 1,
      "time": 1641098031,
      "title": "Genuary 2022",
      "type": "story",
      "url": "https://genuary.art/"
    },
    {
      "by": "user239",
      "descendants": 0,
      "id": 29765828,
      "score": 1,
      "text": "&lt;TL-DR&gt;\nI&#x27;ve created a prototype of a system serving the same purpose as email discussions, but working in a more structured and (hopefully) intuitive way.<p>A quick video demonstrating how it works: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=5JgeAjwyJok<p>Do you think something like this can be useful? It does solve a problem for me (more details about my motivation below). But I&#x27;m curious if anyone else finds it helpful, so I don&#x27;t end up trying to solve a problem that only exists for me.\n&lt;&#x2F;TL-DR&gt;<p>At company where I work we use a chat-based tool for quick real-time discussions, but use email threads for more complex discussions on a specific topic involving multiple people. For example, coming up with a release plan, figuring out how to handle an issue etc.<p>Although in general our email communication does the job pretty well, there are a few issues with it that I find annoying:<p>- 2 people do &quot;reply all&quot; at the same time, &quot;crossing&quot; messages - last one wins and the other person&#x27;s reply is not included on future replies unless someone manually &quot;merges&quot; the 2 replies later.<p>- Some people intentionally &quot;reply all&quot;, but not to the latest message in the thread.<p>- &quot;Inline replies&quot; are done as a hack by manually adding replies to original message text in message history.<p>- Fixing typos and making other corrections requires a new message to be sent to everyone.<p>Sometimes, the result of these issues is a thread with multiple &quot;forks&quot; that are hard to follow and understand. In some cases, important information can even get missed, leading to other issues.<p>So I wanted to come up with a tool that would natively support things like inline&#x2F;non-latest message replies and editing existing messages. I have a working prototype as shown in the video, but wanted to get a feel of what others think about its value before committing to doing more work on this.",
      "time": 1641097715,
      "title": "Structured email-like discussions – need feedback",
      "type": "story"
    },
    {
      "by": "schappim",
      "descendants": 0,
      "id": 29765826,
      "score": 1,
      "time": 1641097681,
      "title": "Scan objects",
      "type": "story",
      "url": "https://metascan.ai/"
    },
    {
      "by": "rawgabbit",
      "descendants": 6,
      "id": 29765779,
      "kids": [
        29765927,
        29765918,
        29765879,
        29765885,
        29765827
      ],
      "score": 29,
      "time": 1641097085,
      "title": "Many surprise medical bills are now illegal",
      "type": "story",
      "url": "https://www.axios.com/surprise-medical-bills-illegal-doctors-insurers-faac35a7-a2db-4555-a172-7de5f4c3cc54.html"
    }
  ]
}