{
  "stories": [
    {
      "by": "thesuperbigfrog",
      "descendants": 0,
      "id": 29493948,
      "score": 1,
      "time": 1639025558,
      "title": "CentOS changes the cloud Linux game",
      "type": "story",
      "url": "https://www.infoworld.com/article/3643708/how-centos-changes-the-cloud-linux-game.html"
    },
    {
      "by": "dsizzle",
      "descendants": 1,
      "id": 29493936,
      "kids": [
        29493949
      ],
      "score": 1,
      "time": 1639025432,
      "title": "Vaccine neutralises Omicron with three shots",
      "type": "story",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/biontech-pfizer-say-test-shows-3-doses-vaccine-neutralise-omicron-2021-12-08/"
    },
    {
      "by": "okprod",
      "descendants": 0,
      "id": 29493931,
      "score": 2,
      "text": "I got an email from my building that they&#x27;re installing Latch (&lt;https:&#x2F;&#x2F;www.latch.com&#x2F;&gt;) on all the doors. Has anyone had success in fighting this? I don&#x27;t want to install an app on my phone to go around unlocking building, gym, apartment, etc. doors. I read a few years ago a tenant was able to sue for a hard key but Latch was still installed.<p>We already use key fobs, not sure what benefits the building is getting from Latch &#x2F; or what Latch&#x27;s business model is.",
      "time": 1639025304,
      "title": "My apartment building announced it's installing Latch",
      "type": "story"
    },
    {
      "by": "grogu88",
      "descendants": 0,
      "id": 29493916,
      "score": 1,
      "time": 1639025198,
      "title": "How advanced geospatial technology is changing life on Earth",
      "type": "story",
      "url": "https://www.geospatialworld.net/blogs/how-advanced-geospatial-technology-is-changing-life-on-earth/"
    },
    {
      "by": "gy21",
      "descendants": 0,
      "id": 29493908,
      "score": 3,
      "text": "I want to reach out to see if anyone else is thinking about similar problems. We are a remote team and we are recently thinking about how we can brainstorm better to encourage really creative, innovative ideas.<p>Before COVID-19, we used the old way to run brainstorming sessions. Usually get everyone in front of a whiteboard and talk and draw. Or sometimes a question is raised, and everyone goes on to think about it by themselves. When they think of something, they can just turn around and talk to their teams.<p>A lot of that doesn’t apply anymore when we are now working remotely almost 100% of the time. We are able to coordinate really well when it comes to organized, structured work like writing reports, delivering features. But creative thinking usually comes out best for us in an unstructured setting. When being remote, sometimes unstructured talking sessions lead to no results, or no action forward. Now this might start to sound contradicting, but we are experimenting with different ways to actually come up with a structured process to brainstorm.<p>What we want is a process that gives us the space and time to have deep and meaningful thinking but also gives us a good way to communicate the ideas to our teams and in the end a way to reflect on the ideas so they actually move us forward.<p>I want to ask if anyone has similar experiences, what are your thoughts on this issue? Why do you bother? How are you dealing with it now? What else have you tried?<p>Any thoughts or comments are greatly appreciated! Thanks! ;)",
      "time": 1639025144,
      "title": "How do you brainstorm ideas with your team remotely？",
      "type": "story"
    },
    {
      "by": "synergy20",
      "descendants": 0,
      "id": 29493894,
      "score": 2,
      "time": 1639024896,
      "title": "Jam – Self-Hosted Clubhouse",
      "type": "story",
      "url": "https://github.com/jam-systems/jam"
    },
    {
      "by": "fnord77",
      "descendants": 0,
      "id": 29493855,
      "score": 1,
      "time": 1639024369,
      "title": "Pearl Harbor Forced a Plane to Fly Around the World to Get Home",
      "type": "story",
      "url": "https://jalopnik.com/pearl-harbor-forced-a-plane-to-fly-around-the-world-to-1848174258"
    },
    {
      "by": "lord_sudo",
      "descendants": 0,
      "id": 29493841,
      "score": 1,
      "text": "A domain I really want is in the &quot;pending delete&quot; state. It looks like there are some services that can help you get a domain as soon as it expires (GoDaddy Backorder, Snapnames, etc.). These are the same names mentioned in a similar thread on HN from 2010.<p>What is the current state-of-the-art for backordering? Is there a service that&#x27;s particularly good for .xyz and other &quot;alternative&quot; TLDs?",
      "time": 1639024169,
      "title": "Ask HN: Best way to backorder a domain in 2021?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29493834,
      "score": 3,
      "time": 1639024066,
      "title": "A Startup CTO’s Guide to the Modern Data Stack",
      "type": "story",
      "url": "https://briceluu.medium.com/a-startup-ctos-guide-to-the-modern-data-stack-99552102a5f9"
    },
    {
      "by": "dipen_dedania_",
      "descendants": 0,
      "id": 29493826,
      "score": 2,
      "time": 1639023963,
      "title": "Show HN: Zero to MVP with No-Code eBook",
      "type": "story",
      "url": "https://www.zero-to-mvp.com/"
    }
  ]
}