{
  "stories": [
    {
      "by": "nafnlj",
      "descendants": 0,
      "id": 31413040,
      "score": 1,
      "time": 1652804964,
      "title": "EnBizCard – Open-Source HTML-Based Digital Business Card Generator",
      "type": "story",
      "url": "https://enbizcard.vishnuraghav.com/hosting-guide"
    },
    {
      "by": "brunovcosta",
      "descendants": 0,
      "id": 31413035,
      "score": 1,
      "time": 1652804953,
      "title": "Hackerforms now allows you to ship forms with any lib",
      "type": "story",
      "url": "https://hackerforms.com/"
    },
    {
      "by": "obi1kenobi",
      "descendants": 0,
      "id": 31412996,
      "score": 1,
      "time": 1652804819,
      "title": "Compiler Adventures, part 3: Value Numbering",
      "type": "story",
      "url": "https://medium.com/@predrag.gruevski/compiler-adventures-part-3-value-numbering-12d087b891bd"
    },
    {
      "by": "sph",
      "descendants": 0,
      "id": 31412989,
      "kids": [
        31413034
      ],
      "score": 1,
      "time": 1652804797,
      "title": "Pixel Art to CSS",
      "type": "story",
      "url": "https://www.pixelartcss.com/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31412983,
      "score": 1,
      "time": 1652804788,
      "title": "U.S. Air Force conducted successful hypersonic weapon test",
      "type": "story",
      "url": "https://www.reuters.com/business/aerospace-defense/us-air-force-says-it-conducted-successful-hypersonic-weapon-test-2022-05-17/"
    },
    {
      "by": "anon115",
      "descendants": 0,
      "id": 31412979,
      "score": 1,
      "time": 1652804766,
      "title": "Ask HN: Would an open source video game be the staple of a video game union?",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31412957,
      "score": 1,
      "time": 1652804659,
      "title": "First tests under way at new US liquid metal facility",
      "type": "story",
      "url": "https://www.world-nuclear-news.org/Articles/First-tests-under-way-at-new-US-liquid-metal-facil"
    },
    {
      "by": "snowmaker",
      "descendants": 0,
      "id": 31412956,
      "score": 8,
      "text": "Hi HN!  Today we’re launching Startup School 2022.  Startup School is YC’s free online course to learn how to start a startup.  The 2022 course will be 7 weeks, starting June 27, 2022.  More info and the signup page is at <a href=\"https:&#x2F;&#x2F;www.startupschool.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.startupschool.org&#x2F;</a><p>This is our first live startup school course in 3 years and we’ve made a lot of upgrades.  To explain the changes, let me give a brief history of how Startup School has evolved over the years.<p>We launched Startup School in its current form in 2017 (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13801376\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13801376</a>).  We ran three live courses, in the summers of 2017, 2018, and 2019.  For all these courses, we ran Startup School by hosting lectures with an in-person audience, recording them, and posting the videos online for the rest of the participants.<p>We had planned to repeat that course the following year, but when the pandemic hit, it forced us to rethink our plans.  Unable to host anything in-person for a while, we relaunched the course as a continuous program in June 2020 (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23552928\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23552928</a>).   In the continuous format, you can sign up anytime and watch pre-recorded lecture videos at your own pace.  This is the format we’ve used since then.<p>The continuous format has a lot of advantages and we’re definitely going to keep it as an option.  But there is a different level of excitement and energy with a live course, which is why we are excited to bring it back this summer.  Here’s what’s different from the 2019 course.<p>1)  Here’s what I’m personally most excited about.  For the first time, we’re going to facilitate hundreds of in-person meetups for founders in dozens of cities around the world.<p>There will be two forms of these meetups.<p>First, some of our most successful YC alumni will host large-scale, 100+ person meetups at their offices.  Each meetup will include a talk by the founders on how they built the company, followed by a networking session where people can meet the company founders and each other.  We have these lined up for about 30 cities.<p>Second, we’ll connect founders in the same city with each other and encourage them to organize smaller local meetups at bars, restaurants, parks, etc.  Based on past participation rates, we’re expecting founders to organize meetups in 100+ cities.<p>2)  In the past live course only a tiny studio audience experienced the lectures live; the rest just watched the videos posted online.  For 2022 we’ve gone remote native: we’re hosting all the talks on Zoom so everyone can be part of the live talk.<p>3)  We’ve tightly integrated our co-founder matching site into the course.  We launched our cofounder-matching site on HN 9 months ago (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27750298\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27750298</a>) and since then it’s gone extremely well, with over 70,000 matches made.<p>During the course, we’ll also host many meetups and speed-dating events for people looking to meet potential cofounders.<p>4)  We have a new track for founders who don’t have an idea yet and are just exploring doing a startup.  Our last course was designed for founders who already had an idea and were actively working on a startup.  But in October 2020 we added a new Aspiring Founders track for founders who are just thinking about starting up (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24944460\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24944460</a>).  We’re keeping that two track structure for this course.<p>I know many people on HN have participated in one of the earlier versions of Startup School.  We’d love your thoughts on the changes we’ve made!",
      "time": 1652804654,
      "title": "Tell HN: Startup School 2022 – returning to live event",
      "type": "story"
    },
    {
      "by": "aerophilic",
      "descendants": 0,
      "id": 31412949,
      "score": 8,
      "time": 1652804616,
      "title": "Show HN: Building robots that can understand and act on the world around them",
      "type": "story",
      "url": "https://www.l5automation.com"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 31412923,
      "score": 3,
      "time": 1652804473,
      "title": "Let's build a distributed Postgres proof of concept",
      "type": "story",
      "url": "https://notes.eatonphil.com/distributed-postgres.html"
    }
  ]
}