{
  "stories": [
    {
      "by": "rmason",
      "descendants": 0,
      "id": 30076833,
      "score": 2,
      "time": 1643139280,
      "title": "GM to invest $7B in 4 (BEV) facilities across Michigan, creating 4k jobs",
      "type": "story",
      "url": "https://www.freep.com/story/money/cars/general-motors/2022/01/25/gm-investment-michigan-lansing-orion-electric-vehicles/6619862001/"
    },
    {
      "by": "supermatou",
      "descendants": 0,
      "id": 30076816,
      "score": 1,
      "text": "Anyone notice lately an increase of spam mails breaking through Gmail&#x27;s (usually excellent) spam filters?<p>I&#x27;ve had a Gmail account since its early beta and I&#x27;ve never seen so many spams worming their way into my inbox as I can see these days. Granted, I&#x27;m not <i>submerged</i> by spam, but after many years of having simply forgotten about the spam scourge (I would get maybe one or two per YEAR!), seeing three or four per week is quite irritating.<p>Another thing I had noticed last year was the sheer number of messages accumulated in Spam; for decades there were just 150 or 200 at any given moment; starting last year, their number jumped considerably, and for a couple of months, Gmail&#x27;s Spam folder had more than 1,000! Still, only very rarely I would see one in my inbox (I use IMAP and I exclude Spam from my subscribed folders; I only noticed their huge number when I had to use the web interface.)",
      "time": 1643139180,
      "title": "Ask HN: Spam Breaking Through (Gmail)",
      "type": "story"
    },
    {
      "by": "kkielhofner",
      "descendants": 0,
      "id": 30076801,
      "score": 1,
      "time": 1643139145,
      "title": "Blockchain – the most poorly adopted platform in recent history?",
      "type": "story",
      "url": "https://kkrants.com/blockchain-the-most-poorly-adopted-platform-in-recent-history-6f5d97f7d51f?gi=ed4848ff99ef"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 30076800,
      "score": 1,
      "time": 1643139145,
      "title": "Hundreds of Y Combinator alumni join crypto collective to back Web3 startups",
      "type": "story",
      "url": "https://techcrunch.com/2022/01/24/hundreds-of-y-combinator-alumni-join-crypto-collective-to-back-web3-startups/"
    },
    {
      "by": "JumpCrisscross",
      "descendants": 0,
      "id": 30076768,
      "score": 1,
      "time": 1643139007,
      "title": "U.S. Companies Down to Five-Day Supply of Key Chips, Report Says",
      "type": "story",
      "url": "https://www.wsj.com/articles/u-s-companies-down-to-five-day-supply-of-key-chips-report-says-11643126434"
    },
    {
      "by": "kashgoudarzi",
      "descendants": 0,
      "id": 30076767,
      "score": 1,
      "time": 1643139001,
      "title": "Magnus Inc.: The Business of Being World Chess Champion",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/22/sports/magnus-carlsen-chess.html"
    },
    {
      "by": "yboris",
      "descendants": 1,
      "id": 30076760,
      "kids": [
        30076803
      ],
      "score": 1,
      "time": 1643138982,
      "title": "The Quite OK Image Format for Fast, Lossless Compression",
      "type": "story",
      "url": "https://qoiformat.org/"
    },
    {
      "by": "trzy",
      "descendants": 0,
      "id": 30076740,
      "score": 2,
      "text": "I built a complete game using Snap&#x27;s AR platform in about 6 weeks. I&#x27;d been intrigued by Snap&#x27;s AR ambitions and wanted to kick the tires on their platform.<p>The YouTube video description contains a link to the Lens: <a href=\"https:&#x2F;&#x2F;lens.snapchat.com&#x2F;d04efc6953fd498c87e25c92fef727e7?sender_web_id=6dfa4f56-8eca-4af1-97b3-03057da8df21&amp;device_type=desktop&amp;is_copy_url=true\" rel=\"nofollow\">https:&#x2F;&#x2F;lens.snapchat.com&#x2F;d04efc6953fd498c87e25c92fef727e7?s...</a><p>How to play:<p>- Joypad y axis moves the helicopter along the ray pointing from the camera. You can therefore tilt the phone up to fly &quot;up&quot;.<p>- Altitude is also controlled by aiming the phone. The helicopter tries to match the altitude of a point that is fixed in front of the camera. So you can move up by aiming up or by actually lifting the phone higher.<p>- Joypad x axis strafes.<p>- If you lose track of the helicopter, a blue arrow will appear after about 5 seconds.<p>- Blow up enemies and try to stay alive :)<p>How it works under the hood:<p>- Loads of JavaScript. Lenses are surprisingly programmer-friendly. As a non-artist, this is great. Almost everything can be driven completely by code, although most creators opt to use pre-made components with minimal scripting.<p>- The game uses a custom physics engine with OBB-based collision detections that I wrote from scratch. Snap now has integrated physics that seem to be based on PhysX (i.e., the same as Unity&#x27;s) but this was released well into my development process after I had already rolled my own.<p>- I opted not to use environmental mesh reconstruction because it is performance intensive and gives dubious results on lower-end phones. When I started development, it was only enabled for Lidar-based phones but is since available everywhere.<p>- I instead detect horizontal planes using an API that Snap hasn&#x27;t really documented. I found a snippet of code in their API docs and opened up the Lens Studio .exe to find the names of the other plane events I needed.<p>- Planes are used to create collision boxes that extend to the floor so the helicopter can bump into furniture.<p>- AI-controlled enemy helicopters plot routes using a heightmap generated from the plane data to avoid colliding with obstacles when possible.<p>Takeaways:<p>- This has arguably become my favorite AR prototyping platform. Much faster idea-to-PoC iteration time than anything else out there.<p>- The platform is surprisingly full-featured.<p>- The Lens Studio Editor is remarkably polished and, despite some bugs here and there, is very stable.<p>- The deployment story is second to none. Deploying to the phone involves a single click and is done over the Internet (no need for any tethering or wireless pairing).<p>- Debugging on-device is still challenging (all you can do is log a few lines) but I was assured that an actual debugger is coming soon.<p>- Economic viability: unfortunately, it is not really possible to directly monetize lenses. Most creators contract with brands to create branded lenses.<p>Future plans:<p>- I&#x27;ll definitely be keeping an eye on Snap&#x27;s ecosystem.<p>- No plans for any more full-fledged lenses but I do have some ideas for prototypes I&#x27;d like to try in anticipation of commercially viable mixed reality HMDs hitting the market soon (e.g., Meta&#x27;s Project Cambria).<p>- I may update the game with a tutorial mode and a co-located multiplayer mode (co-op play or PvP) provided I get the necessary support from the Snap dev team.<p>Hope you enjoy and are inspired to dive into AR if you haven&#x27;t already :D",
      "time": 1643138876,
      "title": "Show HN: A full AR helicopter action game built as a Snap lens",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=O_1dJ_x7vXw"
    },
    {
      "by": "henry_o",
      "descendants": 0,
      "id": 30076728,
      "score": 1,
      "time": 1643138838,
      "title": "The future of work is the undoing of all previous modes of work",
      "type": "story",
      "url": "https://buildremote.co/future-of-work/future-of-work-is-the-past/"
    },
    {
      "by": "antman",
      "descendants": 0,
      "id": 30076690,
      "score": 1,
      "time": 1643138621,
      "title": "Airflow Alternatives: Dagster and Prefect",
      "type": "story",
      "url": "https://hightouch.io/blog/airflow-alternatives-a-look-at-prefect-and-dagster/"
    }
  ]
}