{
  "stories": [
    {
      "by": "JoachimS",
      "descendants": 0,
      "id": 28299477,
      "score": 1,
      "time": 1629883324,
      "title": "Accelerating ML Recommendation with over 1000 RISC-V/Tensor cores on chip [pdf]",
      "type": "story",
      "url": "https://www.esperanto.ai/wp-content/uploads/2021/08/HC2021.Esperanto.Ditzel.Final_.pdf"
    },
    {
      "by": "p4bl0",
      "descendants": 0,
      "id": 28299475,
      "score": 1,
      "time": 1629883307,
      "title": "Pinterest's Purchase Commitment to AWS",
      "type": "story",
      "url": "https://twitter.com/Bensign/status/1429942858669244422"
    },
    {
      "by": "notRobot",
      "descendants": 0,
      "id": 28299470,
      "score": 1,
      "time": 1629883256,
      "title": "“In order to beat YouTube, Facebook faked incredible viewership numbers ”",
      "type": "story",
      "url": "https://twitter.com/adamconover/status/1183209875859333120"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 28299452,
      "score": 1,
      "time": 1629883016,
      "title": "New Tilting Stops $100M Fix of San Francisco's Millennium Tower",
      "type": "story",
      "url": "https://www.nbcbayarea.com/investigations/new-tilting-stops-100-million-fix-of-san-franciscos-millennium-tower/"
    },
    {
      "by": "polygonwindow-",
      "descendants": 0,
      "id": 28299441,
      "score": 1,
      "text": "Dear HN Community, I would like to ask you opinion or advice on following situation:<p>The parties:<p>Tech company: We are a development company with two offices, one in central europe and one in eastern europe<p>Startup: A startup founded by two non-tech founders from the finance industry<p>Initial Agreement:<p>Roughly 5-6 years ago we (tech company) agreed to build and launch a first version of the product (a trading platform) for the startup and maintain it for 4 years. Tech company would put together a dedicated team needed to build and maintain this platform. Startup would cover the basic cost of the development team (salaries, insurance, office, ...) without any markup. For that, the we (tech company) received 10% in equity pre-funding.<p>Situation now:<p>The platform has been successfully launched and maintained for 4 years. The platform went through several iterations of improvements and new features.<p>There has been a seed funding round at a ~15 Mio evaluation leaving the two founders of startup at ~51% of shares and us with around 7.5% after dilution.<p>The dedicated tech team (hired by tech company) consists now of a CTO (which is &quot;our CTO&quot;, e.g. the CTO of tech company) and 4 fulltime Software Engineers.<p>Startup is ramen profitable now with a revenue of 0.5 Mio USD in the first half of 2021. Expected growth of revenue +50% in 2nd half to 0.75 Mio USD in H2.<p>The problem:<p>The initial contract is expiring basically now. For several reasons it makes sense to transition the tech team (CTO and 4 SW Engineers) from tech company to startup, main reasons being that startup should not be &quot;depending&quot; on tech company, the startup should have its own CTO and tech team (important to future investors) and the startup does not further need to proxy &quot;access permission&quot; to sensitive data from customers to tech company.<p>We all agree its the best way forward to make this transition of the tech team and that tech company offers managerial support for this transition for the next ~2 years by founding a legal entity in eastern europe (as subsidiary of startup), finding an office space, transition the team, possibly hire new team members and see that things go &quot;smooth&quot;.<p>What we cannot agree on is what a &quot;new deal&quot; could look like or what principles to apply here.<p>Any inputs, opinion or advice are very welcome. Thank you.",
      "time": 1629882857,
      "title": "Ask HN: Opinions on finding a deal for transitioning a tech team",
      "type": "story"
    },
    {
      "by": "hosolmaz",
      "descendants": 0,
      "id": 28299435,
      "score": 1,
      "time": 1629882757,
      "title": "Doxastic Logic",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Doxastic_logic"
    },
    {
      "by": "calltrak",
      "descendants": 0,
      "id": 28299429,
      "score": 1,
      "text": "What do you hate about current web form builders, like google forms etc?<p>Whats the main pain points you have with them?<p>Whats your biggest time waster with them?",
      "time": 1629882687,
      "title": "Ask HN: What do you hate about current form builders, whats your pain points?",
      "type": "story"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 28299414,
      "score": 1,
      "time": 1629882477,
      "title": "Staying Visual in a Clip World",
      "type": "story",
      "url": "http://liipetti.net/visual/staying-visual-in-a-clip-world/"
    },
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 28299407,
      "score": 1,
      "time": 1629882404,
      "title": "The New Northern Alliance?",
      "type": "story",
      "url": "https://www.wsj.com/articles/a-new-generation-fights-for-afghanistan-11602265383"
    },
    {
      "by": "zigrazor",
      "descendants": 0,
      "id": 28299345,
      "score": 2,
      "time": 1629881693,
      "title": "Graph Theory in C++",
      "type": "story",
      "url": "https://bestofcpp.com/repo/ZigRazor-CXXGraph-cpp-algorithms#"
    }
  ]
}