{
  "stories": [
    {
      "by": "scifibestfi",
      "descendants": 0,
      "id": 32152678,
      "score": 1,
      "time": 1658243646,
      "title": "Astounding Numbers from the San Francisco Board of Education",
      "type": "story",
      "url": "https://twitter.com/michelletandler/status/1549256988122652673"
    },
    {
      "by": "deanmoriarty",
      "descendants": 1,
      "id": 32152652,
      "kids": [
        32152656
      ],
      "score": 2,
      "text": "I am a FAANG tech worker bee (experience as software engineer, tech lead and engineering manager) who is growing significantly tired of the corporate rat race, and the fact that I have really no control over pretty much anything I do all day at work, I am at the whims of corporate politics that make every effort I spend objectively pointless, if it wasn&#x27;t for the fact that it pays my salary. As such, I am looking to start some sort of pet project to satisfy my craving for ownership.\nI think over the years I gained a unique perspective when it comes to personal finance, financial independence and passive investments, working in tech, tech compensations, startups and equity, and similar topics (a few snippets of this &quot;wisdom&quot; are available in my other comment down below). I routinely get calls from friends&#x2F;acquaintances&#x2F;ex coworkers asking for advice regarding one of these topics.<p>I am trying to understand if it would be worth starting a blog that covers these subjects. The goal would be to eventually monetize this in some way (ads, affiliate, consultations, …) just so that I could consider it worth my time.<p>Do you think this could be a viable strategy, or am I embarking on a sad journey that after thousands of hours spent creating content would leave me with nothing valuable to show for? A brutally honest answer would be highly appreciated, since I haven&#x27;t started yet.<p>Thanks",
      "time": 1658243565,
      "title": "Ask HN: Personal finance blog as monetizable pet project?",
      "type": "story"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 32152650,
      "score": 1,
      "time": 1658243554,
      "title": "Internet Explorer for Unix? Yes. It's Real",
      "type": "story",
      "url": "https://lunduke.substack.com/p/internet-explorer-for-unix-yes-its"
    },
    {
      "by": "jawerty",
      "descendants": 1,
      "id": 32152600,
      "kids": [
        32152666
      ],
      "score": 2,
      "time": 1658243409,
      "title": "Show HN: I built a self hosted recommendation feed to escape Google's algorithm",
      "type": "story",
      "url": "https://github.com/jawerty/myAlgorithm"
    },
    {
      "by": "nordita",
      "descendants": 0,
      "id": 32152572,
      "score": 1,
      "text": "I work as a Paramedic for a large regional ambulance service in the UK. Too many of the calls we attend to with blue lights are not emergencies. This is a problem because it puts genuine emergencies at risk due to long waits and degrades staff morale. The long waits are a national crisis. Yesterday I attended to someone on the floor for 5+hrs before we picked her up.<p>There are many factors to this but I would like to identify the issue of defensive medicine. Defensive medicine refers to the practice of recommending a diagnostic test or medical treatment that is not necessarily the best option for the patient, but mainly serves to protect the clinicians.<p>I believe this is happening with out national medical advice line &#x27;111&#x27;. It is a common held belief amongst my colleagues that &#x27;111&#x27; is too risk adverse.<p>It&#x27;s a long shot asking HN but can one implement a smarter triage system? One that filters out the junk so ambulances are kept for real emergencies.",
      "time": 1658243294,
      "title": "How can my ambulance service triage patients better?",
      "type": "story"
    },
    {
      "by": "eatonphil",
      "descendants": 0,
      "id": 32152569,
      "score": 2,
      "time": 1658243290,
      "title": "Amazon DynamoDB: A Scalable, Predictably Performant, Managed NoSQL Database",
      "type": "story",
      "url": "http://muratbuffalo.blogspot.com/2022/07/amazon-dynamodb-scalable-predictably.html"
    },
    {
      "by": "corradio",
      "descendants": 0,
      "id": 32152565,
      "score": 1,
      "time": 1658243283,
      "title": "Electricity Maps Launches a Historical View",
      "type": "story",
      "url": "https://app.electricitymaps.com/"
    },
    {
      "by": "adrien248",
      "descendants": 0,
      "id": 32152552,
      "score": 1,
      "text": "My Gay Flatmate helps the LGBT community to find a safe place to live.\nIt is a 2-sided platform. People can advirtise their spare room, and they can also create a profile to say they are looking for a room.<p>Happy to receive some feedback!\nI am a solo founder (not by option)",
      "time": 1658243242,
      "title": "Show HN: I help LGBT people to find LGBT homes",
      "type": "story",
      "url": "https://mygayflatmate.com/"
    },
    {
      "by": "Malazath",
      "descendants": 0,
      "id": 32152550,
      "score": 1,
      "time": 1658243236,
      "title": "Show HN: 6 + Year Old Library Rewrite – JavaScript/TS Validation Library (WIP)",
      "type": "story",
      "url": "https://github.com/JenkinsDev/Validatinator"
    },
    {
      "by": "samemail88",
      "descendants": 0,
      "id": 32152549,
      "score": 2,
      "time": 1658243225,
      "title": "Why can't the government put a limit on car sizes?",
      "type": "story",
      "url": "https://ashlan.com/blog/why-can-t-the-government-put-a-limit-on-car-sizes/"
    }
  ]
}