{
  "stories": [
    {
      "by": "2-718-281-828",
      "descendants": 0,
      "id": 29334410,
      "score": 1,
      "time": 1637783969,
      "title": "Germany's incoming government unveils plans to legalize cannabis",
      "type": "story",
      "url": "https://www.cnn.com/2021/11/24/europe/germany-coaltion-deal-intl/index.html"
    },
    {
      "by": "jrepinc",
      "descendants": 0,
      "id": 29334409,
      "score": 1,
      "time": 1637783958,
      "title": "The Revolution Will Be Open Source",
      "type": "story",
      "url": "https://effs-how-to-fix-the-internet.simplecast.com/episodes/the-revolution-will-be-open-source"
    },
    {
      "by": "CNNXtra",
      "descendants": 0,
      "id": 29334408,
      "score": 1,
      "time": 1637783955,
      "title": "Check Out: Donald Trump Truth Social App (VS) Mastodon Open Source Software",
      "type": "story",
      "url": "https://larrybohboh.com/truth-social-vs-mastodon-how-trump-social-media-plagiarized-an-open-source-platform/"
    },
    {
      "by": "cameron_b",
      "descendants": 0,
      "id": 29334399,
      "score": 1,
      "time": 1637783926,
      "title": "Zoom Security Bulletin",
      "type": "story",
      "url": "https://explore.zoom.us/en/trust/security/security-bulletin/"
    },
    {
      "by": "andrewseanryan",
      "descendants": 0,
      "id": 29334394,
      "score": 1,
      "time": 1637783897,
      "title": "Show HN: Why Detailed Planning Isn't Always the Best Plan",
      "type": "story",
      "url": "https://andrewseanryan.com/plans-and-other-lies-people-tell/"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 29334393,
      "score": 1,
      "time": 1637783896,
      "title": "Covid spilling into animals andback again to humans in new variants–story of ‘22",
      "type": "story",
      "url": "https://twitter.com/gzuckerman/status/1463592638326652944"
    },
    {
      "by": "Mortric",
      "descendants": 0,
      "id": 29334377,
      "score": 1,
      "text": "1. The thumb: Wearing rings on the thumb is a reflection of men’s confidence, also a symbol of their social status. This way of ring-wearing is not very common. Mostly, some middle-aged and older men will take this method of wearing.<p>2. The index finger: Wearing a ring on the index finger, mostly seen in some young men. It represents that the person is single, not married. At the same time, the design of some personality rings worn on the index finger also represents a unique temperament and open personality of that person.<p>3. The middle finger: Men who are in the middle of a passionate love affair, or men who are already engaged, will wear the ring on the middle finger. On the other hand, it is to convey their personal emotional state to the outside world, but also a sincere commitment to their lovers.<p>4. The ring finger: Wearing a ring on the ring finger means that he is married, and is a way to reject other people. At the same time, the ring finger is the closest finger to the heart. Wearing a ring on this finger means that he loves his significant other very much and also respects his marriage.<p>5. The little finger: Celibate or divorced men may often wear the ring on this finger. It means that the man has no intention of getting married at this stage, and does not want to enter into married life.<p>To view more designs for all fingers, please visit: www.Mortric.com",
      "time": 1637783835,
      "title": "Finger Symbolism of Men's Ring",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29334362,
      "score": 1,
      "time": 1637783741,
      "title": "People Want to Do Good Things (2016)",
      "type": "story",
      "url": "https://maneydigital.com/2016/08/16/people-want-good-things/"
    },
    {
      "by": "Simicure",
      "descendants": 0,
      "id": 29334354,
      "score": 1,
      "text": "1. Trim the length of your nails regularly: Cut them short with a nail clipper or trim the length with a special sanding strip for manicure.<p>2. Clean the dead skin flakes: First you should let your fingers soak in warm water (you can place a few fresh lemon slices in the water to soak out the dirt from the nail crevices to soften the nail skin). Dry your hands and then use the stick to gently push the soft skin, then use dead skin scissors or a dead skin fork to remove the excess soft skin flakes around the nail, and finally use a nail brush to clean around the nail. Then dip your fingers into a basin of water and rinse them off as you brush.<p>3. Apply emollient cream: After drying your hands, apply emollient cream and massage it repeatedly with your fingers for 2 minutes until it is absorbed. Last but not least, wipe the nail surface and nail crevices with cotton dipped in alcohol.<p>To view more different designs for Simicure, please visit: www.Simicure.com",
      "time": 1637783706,
      "title": "Tips on how to take care of your nails in your daily routine?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29334311,
      "score": 1,
      "time": 1637783436,
      "title": "Innovation Requires Decentralization and a Frontier",
      "type": "story",
      "url": "https://nav.al/decentralization"
    }
  ]
}