{
  "stories": [
    {
      "by": "i386",
      "descendants": 0,
      "id": 30460072,
      "score": 1,
      "time": 1645735678,
      "title": "Apple rejected expedited app review over previously reviewed marketing materials",
      "type": "story",
      "url": "https://twitter.com/i386/status/1496949841590878211"
    },
    {
      "by": "iedufy",
      "descendants": 0,
      "id": 30460049,
      "score": 1,
      "text": "Hi Everyone,<p>I wanted to talk to this community about a particular story from my experience to see how the community feels. I have noticed that I have a lot of educated friends from top universities in my country who are having problems finding work due to a lack of experience, which has brought me to a conclusion that diplomas and CVs are not really good at conveying the knowledge someone has.<p>A friend of mine who is already working on his own company told me that he had trouble finding people to work for him, so I thought about an idea that I am currently incorporating into my app. Perhaps we could make it much easier for you to show your knowledge to companies, as easy as show and tell. A network of live knowledge feeds that constantly keep updating over time showing how someone has evolved.<p>If you know something, put it on full display for everyone to see, show something you have made and explain how you made something so that everyone can understand. If you are good at something, you probably won’t have a hard time explaining it to others, and other people could perhaps learn something by simply following your feed.<p>Educational Institutions have curriculums that aren’t really adaptable, but if we rely on people expressing their unique knowledge to the world, we can create countless combinations of curriculums that will be much more adaptable for the problems we have to face today.<p>I will be trying this approach with some friends over the coming days. My friends are looking for graphic designers, software engineers and music producers. They have established brands and are going to ask people who want to work with them to submit something they made and explain how they did it for everyone to see.<p>You are welcome to join us at EWS (<a href=\"https:&#x2F;&#x2F;edify.ws&#x2F;club&#x2F;10\" rel=\"nofollow\">https:&#x2F;&#x2F;edify.ws&#x2F;club&#x2F;10</a>). If this sounds like a good idea, maybe we can kick off a challenge that you can share with your friends to #ShowWhatYouKnow. If you have a company, are looking for employees, maybe you can ask people to show something they made and explain how they made it to see whether someone has the knowledge required to work for you.",
      "time": 1645735563,
      "title": "Show HN: A Network of Knowledge Feeds",
      "type": "story",
      "url": "https://edify.ws/club/10"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30460045,
      "score": 1,
      "time": 1645735542,
      "title": "Bilbr – Movie Recomendation Service",
      "type": "story",
      "url": "https://bilbr.com/#explore"
    },
    {
      "by": "oalders",
      "descendants": 0,
      "id": 30460003,
      "score": 1,
      "time": 1645735305,
      "title": "Finding Unused Perl Variables",
      "type": "story",
      "url": "https://www.olafalders.com/2022/02/22/finding-unused-perl-variables/"
    },
    {
      "by": "DougMellon",
      "descendants": 0,
      "id": 30460002,
      "score": 1,
      "time": 1645735296,
      "title": "How can I strengthen my resume to get a job in back end development? [pdf]",
      "type": "story",
      "url": "https://github.com/dougmellon/resume/blob/main/DougMellon_resume.pdf"
    },
    {
      "by": "alphabettsy",
      "descendants": 0,
      "id": 30460000,
      "score": 1,
      "time": 1645735288,
      "title": "Samsung Screwed Up Encryption on 100M Phones",
      "type": "story",
      "url": "https://threatpost.com/samsung-shattered-encryption-on-100m-phones/178606/"
    },
    {
      "by": "labrador",
      "descendants": 1,
      "id": 30459985,
      "kids": [
        30459998
      ],
      "score": 3,
      "time": 1645735218,
      "title": "As JetBrains we condemn the attacks taking place",
      "type": "story",
      "url": "https://twitter.com/jetbrains/status/1496786254494670851"
    },
    {
      "by": "throwawaytuary",
      "descendants": 0,
      "id": 30459958,
      "score": 1,
      "text": "While my job title is “Actuary”, software development and management have been my bread and butter for a number of years now. I had a hand in creating most of the systems and tools that my team uses today, but lately there have been some obstacles to building cool new things or making quality of life improvements in our existing tools. I also see some career limitations if I keep going down this hybrid path.<p>I’m considering a career change to focus on being a developer or an engineering manager. I think I can find positives to focus on and be happy in either role. I’m not sure which level of jobs I should be applying for though. Telling people that I have 5+ years of professional development experience feels iffy with a resume that isn’t very clean cut. I also assume that I might have some knowledge gaps, but I don’t think I’m a junior either.<p>In 2022, how would you level set for someone with experience but without the title to back it up? Would hobby projects or something like TripleByte help? It’s a much easier change for me to make if I don’t have to start at square one. Most of the advice out there seems tailored to new grads, so I really appreciate any thoughts you can share.",
      "time": 1645735091,
      "title": "Ask HN: As a long-time unofficial developer, how do I level set for SWE jobs?",
      "type": "story"
    },
    {
      "by": "knodi",
      "descendants": 0,
      "id": 30459941,
      "score": 1,
      "time": 1645735005,
      "title": "Why IT Projects Fail; How Can We Do Better? – Part 1",
      "type": "story",
      "url": "https://medium.com/@yong.hu/why-it-projects-fail-how-can-we-do-better-c32190ca8bc5"
    },
    {
      "by": "dS0rrow",
      "descendants": 0,
      "id": 30459939,
      "score": 1,
      "time": 1645735003,
      "title": "Intelligence alone doesn't cut it",
      "type": "story",
      "url": "https://mental-reverb.com/blog.php?id=32"
    }
  ]
}