{
  "stories": [
    {
      "by": "G3rn0ti",
      "descendants": 0,
      "id": 27938725,
      "score": 1,
      "time": 1627105037,
      "title": "The original Lemmings level editor",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=MlFnMt3o1as"
    },
    {
      "by": "akbarnama",
      "descendants": 0,
      "id": 27938693,
      "score": 1,
      "time": 1627104681,
      "title": "Elixir: Practical Concurrency Cookbook",
      "type": "story",
      "url": "https://functional.works-hub.com/learn/elixir-practical-concurrency-3794f"
    },
    {
      "by": "justicezyx",
      "descendants": 0,
      "id": 27938687,
      "score": 1,
      "time": 1627104544,
      "title": "White House host 'independence from the virus' party",
      "type": "story",
      "url": "https://www.cnn.com/2021/06/15/politics/white-house-july-4-celebrations/index.html"
    },
    {
      "by": "justicezyx",
      "descendants": 0,
      "id": 27938677,
      "score": 1,
      "time": 1627104442,
      "title": "China orders Tencent to give up exclusive licensing rights",
      "type": "story",
      "url": "https://www.cnbc.com/2021/07/24/china-crackdown-antitrust-regulator-orders-tencent-music-to-give-up-music-label-rights.html"
    },
    {
      "by": "Winnal",
      "descendants": 1,
      "id": 27938643,
      "kids": [
        27938645
      ],
      "score": 1,
      "text": "Hi everyone,<p>I&#x27;ve been working on a project called Corehash for a while. I&#x27;m a solo founder with no team, but I&#x27;ve been envisioning a new protocol that can change the way we look at finance and hashpower from the bottom up - by using smart contracts to create a vault similar to Aave or Yearn, but with a simple hashrate product constant formula, similar to Uniswap, to enable liquidity provision of hashrate demand, through an internalized hashrate token AMM model.<p>I&#x27;ve published a white paper that goes into the full details, you can read it here: www.corehash.org&#x2F;whitepaper.pdf, or you can read it on Medium: https:&#x2F;&#x2F;medium.com&#x2F;corehash&#x2F;corehash-hashpower-liquidity-provision-vault-staking-protocol-c12d5dfd2fc2<p>It also has some interesting use cases with MEV extraction and frontrunning as well, like with Flashbots, creating a MEV premium hashrate market protocol, as well as a MEV protection market like sequencers, but fully on the base-layer blockchain, at the miner level, interfacing directly with miners and searchers.<p>This is all the research I&#x27;ve been making on my own, and I finally released it to the public, and I wanted to see if there was anyone interested in collaborating, or just community building something like this for the masses, fully open-sourced, grassroots, decentralized, through a DAO governance + community from the ground up.\nI&#x27;ve laid out the groundwork from my past development with some others on the previous iteration of this project, while you can check out on Github, https:&#x2F;&#x2F;github.com&#x2F;corehash, it&#x27;s all very preliminary, but I&#x27;ve setup the organization to try to form a hub for contributors to work on it together, sort of like the cutting edge MEV research and with Flashbots&#x27; approach (although they have backing from Paradigm, and super talented devs).<p>The goal here is to solve problems and provide a solution as well as a whole new way to enable decentralized finance bridged with PoW mining income. You can kind of think of it as taking some of the best projects in the DeFi space and adding a token economic system for liquidity mining hashrate demand liquidity directly from miners through the pool mining protocol level, integrated on-chain with smart contracts and oracles. In theory, you could achieve some pretty cool applications, like Alchemix, with self-paying loans, but instead with mining income, and undercollateralized loans like a line of credit with hashpower, income-generating, reserve assets. OlympusDAO, but with hashrate reserve assets, stablecoins like USDC but backed by hashpower vault assets.<p>You can read more in detail in the white paper, and I hope to hear anyone thoughts and discussion of this, providing constructive feedback.",
      "time": 1627104152,
      "title": "Corehash Protocol – Decentralized hashrate liquidity provision with HashFi",
      "type": "story"
    },
    {
      "by": "striking",
      "descendants": 0,
      "id": 27938623,
      "score": 1,
      "time": 1627103945,
      "title": "Floating Point Expression Inspector",
      "type": "story",
      "url": "https://github.com/graphitemaster/fpinspect"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 27938585,
      "score": 1,
      "time": 1627103512,
      "title": "The Chatbot Problem",
      "type": "story",
      "url": "https://www.newyorker.com/culture/cultural-comment/the-chatbot-problem"
    },
    {
      "by": "anushreegoenka",
      "descendants": 1,
      "id": 27938576,
      "kids": [
        27938712
      ],
      "score": 9,
      "text": "Hi HN, we’re Spark Studio (<a href=\"https:&#x2F;&#x2F;www.sparkstudio.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sparkstudio.co&#x2F;</a>) and we provide live, online extracurricular classes for children across the world, starting in India and the Middle East. Children can learn music, visual arts and communication skills through our live online classes in small groups with expert teachers.<p>We’re based in India. All the attention here tends to go to academic learning and grades, but a large part of development (brain and personality) actually happens outside it.  Parents have started to desire extracurricular and holistic learning for their children, but access, quality, and convenience remain big unsolved problems. Most people end up having to choose among neighbourhood options. There is no standard curriculum, and definitely none designed for kids, so these classes tend to end up just being a pastime and&#x2F;or kids become disinterested.<p>Kaustubh, Namita and Jyothika have built Product and Curriculum at India’s leading ed-tech companies (BYJU’S and Lead School) and have over 20 years of experience in education. Anushree has a consumer tech background and is an artist. We all felt the itch to work on extracurricular learning because it’s so poorly served.<p>We’re building a full-stack model. We design the learning experience end-to-end—the curriculum, lesson plans for each class, video content and tech. We train teachers (who are gig workers) to deliver this in small-group live classes. We ensure classes are interactive and each child gets personal attention. This sets it apart from the available online options such as YouTube for kids. We are also able to drive learning outcomes such as improved confidence, or understanding of the technical aspects of photography for example, beyond just engaging kids with something fun. Parents are happy when their child is having a good time, doesn’t need active involvement from parents (at least for a little while), and is learning at the same time!<p>One interesting challenge here is that the customer (parent) is different from the user (child), and managing the experience across both needs careful thinking. Nudges and engagement points have to be built differently for each. For example, parent communication is largely outside the live class, and we’re building “showcase” properties for them to see and feel pride in their child’s achievement. But for children, we need to build most things in the class experience itself, even taking their feedback. Another very interesting insight has been that Children do not want to be treated like children!  We&#x27;ve had children tell us that the teacher spoke to them as if they were children, and they didn&#x27;t like it. So our teachers are trained not to oversimplify or spoon feed the kids; something that is appreciated by both the children and their parents, and we’ve seen children grasp more complex concepts when they’re given a chance to.<p>We sell courses that are typically 12-15 sessions in duration. We are currently using Zoom to deliver these. We will soon have our own live class environment built on top of a third party video calling solution. And we&#x27;re building our own Learning Management System.<p>We’d love for you to give us your thoughts and feedback on teaching extracurriculars or insights into our TG. We’re live in India and the Middle East right now, so if you’re a parent to a child between the ages of 5 and 15, do come by <a href=\"https:&#x2F;&#x2F;www.sparkstudio.co\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sparkstudio.co</a> and check out our 15 courses! We also do a free trial class.",
      "time": 1627103387,
      "title": "Launch HN: Spark Studio (YC S21) – Live online extracurricular courses for kids",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 1,
      "id": 27938575,
      "kids": [
        27938737
      ],
      "score": 2,
      "time": 1627103384,
      "title": "In 2040, You May Drive a Car That Looks Like This",
      "type": "story",
      "url": "https://www.architecturaldigest.com/story/2040-drive-car-that-looks-like-this"
    },
    {
      "by": "d_utkarsh",
      "descendants": 0,
      "id": 27938569,
      "score": 1,
      "time": 1627103342,
      "title": "Computer Vision Project: Image Dehazing/ Defogging",
      "type": "story",
      "url": "https://github.com/Utkarsh-Deshmukh/Single-Image-Dehazing-Python"
    }
  ]
}