{
  "stories": [
    null,
    null,
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29784232,
      "score": 1,
      "time": 1641234283,
      "title": "Ish",
      "type": "story",
      "url": "https://github.com/ish-app/ish"
    },
    {
      "by": "RestlessMind",
      "descendants": 0,
      "id": 29784222,
      "score": 1,
      "text": "I wanted to follow up on my previous post - https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27696235<p>My latest observation at my current company which is &quot;fully-remote&quot;: 75% of the new headcount is out of US. Total compensation offered in foreign countries is much cheaper (35-60% lower depending on Canada vs EU vs LatAm vs Asia) than even the lowest pay-tier US regions. Bulk of the gains are flowing to the company&#x27;s revenue bottomline, and thus to the biggest shareholders (Capital class). A small fraction of those gains is coming to the rank-and-file&#x27;s pocket via the increased value of their meagre RSUs.<p>To address another big point raised in the previous thread about outsourcing, when we have been trying that since 2000&#x27;s and why is it a big deal now - with previous rounds of outsourcing, entire project was shipped to a different country. There were neither any &quot;remote-first&quot; culture nor any tooling to support collaboration. Integrating an entire team from an entirely different culture was very hard. Compared to that, today we are onboarding one foreign employee at a time and onboarding someone from Mexico City is as easy as onboarding someone from Miami. Because it happens one team-member at a time with an enhanced level of support, current WFH trend is very different from the 2000&#x27;s outsourcing one. Btw, I have firs-hand experience with both of those trends.<p>Finally, another recurring theme in the previous thread was spreading out the privilege from SV to other corners of the world. My fear, backed by hard data I am observing, is that this will greatly benefit the Capital class in the US along with the middle class in the developing world. But it will be devastating to the middle class in the US.",
      "time": 1641234254,
      "title": "Tell HN: Current WFH trend (part 2)",
      "type": "story"
    },
    {
      "by": "throwaway1927z",
      "descendants": 0,
      "id": 29784213,
      "score": 1,
      "text": "Imagine you haven&#x27;t worked at all since the pandemic started.  How would you deal with that in your resume and in interviews?",
      "time": 1641234229,
      "title": "Ask HN: How do you get a job after a 2-year gap in your work history?",
      "type": "story"
    },
    {
      "by": "edmcnulty101",
      "descendants": 0,
      "id": 29784180,
      "score": 2,
      "text": "From what I&#x27;ve read, lithium batteries have a limited life span and eventually need replacing.<p>I&#x27;m noticing Tesla&#x27;s and other EVs are selling out as fast as they can make them.<p>I&#x27;ve been wondering: are we trading out oil as a finite resource for lithium?",
      "time": 1641234112,
      "title": "Ask HN: Is Lithium a Limited Resource?",
      "type": "story"
    },
    {
      "by": "hba2021",
      "descendants": 0,
      "id": 29784179,
      "score": 1,
      "time": 1641234109,
      "title": "Unlocking India's Treasures Through Contemporary Art",
      "type": "story",
      "url": "https://zarastro.art/indian-contemporary-art/"
    },
    {
      "by": "schleck8",
      "descendants": 0,
      "id": 29784174,
      "score": 1,
      "time": 1641234079,
      "title": "Tesla is opening a store in Xinjiang, where China is accused of a genocide",
      "type": "story",
      "url": "https://www.businessinsider.com/tesla-china-xinjiang-region-new-store-uyghur-2022-1"
    },
    {
      "by": "gereshes",
      "descendants": 0,
      "id": 29784169,
      "score": 2,
      "time": 1641234047,
      "title": "How many Starships does SpaceX need for HLS refueling?",
      "type": "story",
      "url": "https://gereshes.com/2022/01/03/how-many-starships-does-spacex-need-for-hls-refueling/"
    },
    {
      "by": "jchook",
      "descendants": 0,
      "id": 29784148,
      "score": 1,
      "time": 1641233972,
      "title": "Hpack – Swiss army knife of web page archiving",
      "type": "story",
      "url": "https://github.com/h-sec/h-pack"
    }
  ]
}