{
  "stories": [
    {
      "by": "iamricks",
      "descendants": 0,
      "id": 29702191,
      "score": 1,
      "text": "What are some good nonprofits to donate to that teach people to code?",
      "time": 1640610589,
      "title": "Ask HN: Best nonprofit that teaches people to code?",
      "type": "story"
    },
    {
      "by": "EvgenyAr",
      "descendants": 0,
      "id": 29702190,
      "score": 1,
      "text": "I know there are several options to serve your ML models in production? Now I&#x27;m going through MLOps course from Andrew Ng (https:&#x2F;&#x2F;www.coursera.org&#x2F;specializations&#x2F;machine-learning-engineering-for-production-mlops) Theoretical part is wonderful, however part about Tensoflow (TFX, Transform) is really a pain.<p>So question:\n- Which stack do you use to serve ML in prod properly - with CI&#x2F;CD, Monitoring scaling\n- If you use TF stack, what do you think about it?<p>Thanks!",
      "time": 1640610576,
      "title": "Ask HN: What do you use to run ML/DL in prod?",
      "type": "story"
    },
    {
      "by": "Iayb",
      "descendants": 0,
      "id": 29702167,
      "score": 1,
      "time": 1640610323,
      "title": "Update state of component from other components using React hooks",
      "type": "story",
      "url": "https://www.amitmerchant.com/update-state-of-hook-from-other-components-in-react/"
    },
    {
      "by": "Tomte",
      "descendants": 1,
      "id": 29702128,
      "kids": [
        29702149
      ],
      "score": 2,
      "time": 1640609866,
      "title": "Chrome 100 could break your website – but Google is on it",
      "type": "story",
      "url": "https://www.techradar.com/news/chrome-100-could-break-your-website-but-google-is-on-it"
    },
    {
      "by": "bertman",
      "descendants": 1,
      "id": 29702110,
      "kids": [
        29702169
      ],
      "score": 1,
      "time": 1640609752,
      "title": "‘Widevine Dump”:Leaked Code Downloads HD Video from Disney+, Amazon, and Netflix",
      "type": "story",
      "url": "https://torrentfreak.com/widevine-dump-leaked-code-downloads-hd-video-from-disney-amazon-and-netflix-211227/"
    },
    {
      "by": "delhanty",
      "descendants": 0,
      "id": 29702092,
      "score": 3,
      "text": "Today I was told by Hetzner support that they do not allow any crypto applications.<p>This was in the context of my dedicated server - not cloud.<p>First, I asked whether I could run a non-mining Ethereum node. The answer was no.<p>Then I asked:<p>&gt;How about if I sync one copy of the Ethereum block chain (about 350 GB of data) to\nmy server without allowing it to be publicly accessible - is that allowed?<p>and also whether they allow crypto applications at all.  Hetzner support answered<p>&gt; Dear ladies and gentlemen<p>&gt; We do not allow any crypto related applications.<p>Hetzner&#x27;s public documentation only seems to forbid mining applications, which they started doing in May on all servers including mining.<p>There is also this Reddit post from about 1 month back that indicated they forbid crypto applications on cloud servers<p>https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;ethstaker&#x2F;comments&#x2F;qwteod&#x2F;be_careful_with_hetzner_any_crypto_activity_is&#x2F;<p>but it appeared that did not apply to dedicated servers.<p>Has any one else on HN received a recent response from Hetzner regarding what is permitted on dedicated servers with respect to crypto applications?",
      "time": 1640609597,
      "title": "Ask HN: Hetzner dedicated and crypto – what have you been told is allowed?",
      "type": "story"
    },
    {
      "by": "mkl95",
      "descendants": 0,
      "id": 29702087,
      "score": 1,
      "time": 1640609505,
      "title": "Find maintainers for FastAPI",
      "type": "story",
      "url": "https://github.com/tiangolo/fastapi/issues/4263"
    },
    {
      "by": "lnyan",
      "descendants": 1,
      "id": 29702081,
      "kids": [
        29702137
      ],
      "score": 3,
      "time": 1640609456,
      "title": "A super-spreading event of Omicron amongst triple-vaccinated healthcare workers",
      "type": "story",
      "url": "https://www.medrxiv.org/content/10.1101/2021.12.22.21268021v1"
    },
    {
      "by": "noduerme",
      "descendants": 0,
      "id": 29702073,
      "score": 5,
      "text": "At what point or for what amount of money would you throw away all your ethics, all your independence, to take a paycheck for putting your hands on the wheel of putting something viciously evil into the world?<p>I came across this tonight:<p>https:&#x2F;&#x2F;www.bermanco.com&#x2F;careers&#x2F;<p>Like a lot of my generation I&#x27;m a Silver Jews fan and I&#x27;ve read a lot into David Berman&#x27;s music and his thoughts about his father. I&#x27;m glad to see that the father can&#x27;t find a web developer to do his &quot;controversial&quot; dirty work. I&#x27;d assume the money is right. You just have to &quot;believe in free markets and limited government&quot; and &quot;have a sense of humor&quot;.<p>I have a sense of humor, and believe in free markets, which is why I&#x27;m posting this. I find it funny that this schmuck can&#x27;t find a fucking web designer in America willing to touch his toxic shit.<p>So what would it take for you?",
      "time": 1640609332,
      "title": "Ask HN: The devil's hiring. Would you work for him?",
      "type": "story"
    },
    {
      "by": "hu3",
      "descendants": 0,
      "id": 29702072,
      "score": 1,
      "time": 1640609320,
      "title": "How does Treblle scale on AWS without breaking the bank?",
      "type": "story",
      "url": "https://treblle.com/blog/how-does-treblle-scale-on-aws-without-breaking-the-bank"
    }
  ]
}