{
  "stories": [
    {
      "by": "reeeeee",
      "descendants": 1,
      "id": 28652506,
      "kids": [
        28652527
      ],
      "score": 1,
      "text": "I just started on a project that will probably have no more than 100 customers, keeping track of basic accounting tasks. I&#x27;m now thinking about which database service I will use. Looking at the prices of AWS databases, it will cost me $30 per month just to host the smallest RDS instance in the region of my choice.<p>When starting out on smaller projects that are hosted in the cloud, which database and database hosting&#x2F;provider do you use? What service do you think offers the best price to quality ratio?",
      "time": 1632571868,
      "title": "Ask HN: What database (and database hosting) to use for small projects?",
      "type": "story"
    },
    {
      "by": "scns",
      "descendants": 1,
      "id": 28652500,
      "kids": [
        28652501
      ],
      "score": 1,
      "time": 1632571806,
      "title": "New Features in Linux Mint 20.2",
      "type": "story",
      "url": "https://www.linuxmint.com/rel_uma_cinnamon_whatsnew.php"
    },
    {
      "by": "julianivaldy",
      "descendants": 1,
      "id": 28652491,
      "kids": [
        28652543,
        28652541
      ],
      "score": 2,
      "text": "I’m not an avid reader, but we all try to read a book or two during summer, don’t we? It was a selection of pirate books and novels for me, from “Treasure Island” to “Pirate Nation”. They inspired me far beyond what I imagined.<p>I was struck by the similarities between the pirate life and the way we do marketing with our companies at The Secret Company. I truly understood the meaning of Steve Jobs’ quote “It’s more fun to be a pirate than to join the Navy”. Large companies with closed processes and rules, metaphorically the Navy, are much slower to react to change than small startups (pirate ships). What I call pirate marketing is a dynamic way of marketing that responds to ever-changing markets and consumer expectations.<p>My name is Julian Ivaldy, Co-Founder &amp; Head of Growth at TheSecretCompany.co  We are a crew of serial entrepreneurs, with a pirate mindset, secret co-founders of 10+ startups. Let me introduce you to PIRATE MARKETING.<p>It took me a while to really understand marketing and the scope of its practice. I used to confuse marketing with a lot of other things, like sales or advertising, which are in fact only small parts of this vast discipline.\nMarketing is more about understanding the society and environment we live in in order to address an offer. It all starts with the pursuit of your product-market fit, investing in a graphic identity that makes sense to your market and your persona. Imagine strategies that will make your offer known, that will turn your customers into ambassadors, that will increase the value of your offer etc.<p>There are many different types of marketing like Traditional Marketing, Outbound Marketing, Digital Marketing, Content Marketing. These same types of marketing are often classified into marketing families like direct marketing, growth marketing, guerrilla marketing etc. In the end, a good marketing pirate is someone who is able to adapt to all these forms of marketing and make choices that make sense for the offering they are making and the market &amp; people they are addressing.\nMarketing is segmented into many components such as research, target market identification, communication, public relations, advertising, etc. \nAll of this must be done within the budget and resources provided by the company. This means that marketers must be very strategic, as they must decide what tactic and plan they will perform each year to achieve their goals, whether it is to increase awareness or sales.\nWhat I love about marketing is that it involves cross-functional teams from different areas of expertise working toward a common goal.\nLike pirates, governed by treasure as a common goal, at The Secret Company we define a North Star metric for each of our businesses, and all of our team members strive to evolve that metric exponentially in different ways.<p>JOINING FORCES TO ACHIEVE A COMMON GOAL<p>I have to admit something to you… I am hyper active.\nSo when I started marketing, I must admit that I was doing completely different actions every week and that my Focus Metric &amp; KPI were quite general parameters like the number of views, signups, customers thanks to my actions. I quickly understood that this certainly led to a growth, but not an exponential and long term growth. So I took a lot of distance on my marketing &amp; growth actions and I discovered the north star metric.<p>Full article: https:&#x2F;&#x2F;julianivaldy.medium.com&#x2F;introducing-pirate-marketing-why-marketing-in-2021-has-a-lot-to-do-with-piracy-ec841ce736d8<p>Pirate Marketing: \nhttps:&#x2F;&#x2F;www.youtube.com&#x2F;c&#x2F;PirateMarketing",
      "time": 1632571752,
      "title": "Pirate MARKETING: Why marketing in 2021 has a lot to do with Piracy",
      "type": "story"
    },
    {
      "by": "ngaut",
      "descendants": 0,
      "id": 28652490,
      "score": 1,
      "time": 1632571748,
      "title": "Researchers attempt an open source alternative to GitHub’s Copilot",
      "type": "story",
      "url": "https://venturebeat.com/2021/09/24/ai-weekly-researchers-attempt-an-open-source-alternative-to-githubs-copilot/"
    },
    {
      "by": "drp_distruptor",
      "descendants": 0,
      "id": 28652488,
      "score": 1,
      "time": 1632571744,
      "title": "Codsletter: Turn any blog into a periodical newsletter automatically",
      "type": "story",
      "url": "https://codingadventures.netlify.app/finally-i-launched-codsletter-turn-any-blog-into-a-periodically-newsletter-without-automatically/"
    },
    {
      "by": "john-doe",
      "descendants": 0,
      "id": 28652466,
      "score": 1,
      "time": 1632571502,
      "title": "Riding the Bike Line",
      "type": "story",
      "url": "https://portable.fyi/#2020-11-29-riding-the-bike-line"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28652446,
      "score": 1,
      "time": 1632571335,
      "title": "Portugal will move into the final phase of the lifting of restrictions",
      "type": "story",
      "url": "https://www.theportugalnews.com/news/2021-09-24/new-rules-for-portugal-from-1-october/62585"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28652443,
      "score": 2,
      "time": 1632571282,
      "title": "Cases Are Down 60% in Denmark Since the Government Lifted All Covid Restrictions",
      "type": "story",
      "url": "https://fee.org/articles/cases-are-down-60-in-denmark-since-the-government-lifted-all-covid-restrictions/"
    },
    {
      "by": "akudha",
      "descendants": 0,
      "id": 28652432,
      "score": 1,
      "time": 1632571221,
      "title": "Book.ai (art book generated by AI)",
      "type": "story",
      "url": "https://www.barneymccann.com/shop1/p/bookai"
    },
    {
      "by": "jbreckmckye",
      "descendants": 0,
      "id": 28652424,
      "score": 1,
      "time": 1632571113,
      "title": "Wild boar rescue demonstrates signs of empathy, prosocial behaviour",
      "type": "story",
      "url": "https://bigthink.com/surprising-science/wild-boar-rescue/"
    }
  ]
}