{
  "stories": [
    {
      "by": "bwidlar",
      "descendants": 0,
      "id": 31769647,
      "score": 1,
      "time": 1655406004,
      "title": "Understand the Output of the FFT",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=rUtz-471LkQ"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31769640,
      "score": 1,
      "time": 1655405945,
      "title": "Glacial ice supports a distinct and undocumented polar bear subpopulation",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/science.abk2793"
    },
    {
      "by": "andronasef",
      "descendants": 0,
      "id": 31769624,
      "score": 1,
      "time": 1655405858,
      "title": "Get the best products from ProductHunt in your Twitter every hour",
      "type": "story",
      "url": "https://twitter.com/newsproducthunt"
    },
    {
      "by": "thcipriani",
      "descendants": 1,
      "id": 31769604,
      "kids": [
        31769630
      ],
      "score": 2,
      "time": 1655405739,
      "title": "Cool Desktops Don’t Change",
      "type": "story",
      "url": "https://tylercipriani.com/blog/2022/06/15/choose-boring-desktop-technology/"
    },
    {
      "by": "teraflop",
      "descendants": 0,
      "id": 31769601,
      "score": 1,
      "text": "Triplebyte (YC S15) is a tech recruiting company that operates by getting developers to take skill tests, and then using the results to match them with employers. Back in 2020, they got in a lot of hot water by suddenly announcing that user profiles -- which had been collected with assurances that the data wouldn&#x27;t be shared without consent -- would be made public, unless you opted out within a week[1]. This provoked a lot of backlash, especially since the CEO seemed totally oblivious to the privacy concerns[2]. After a lot of angry comments, he publicly apologized and reversed course[3].<p>Then in 2021, some users started once again being notified that their profiles were automatically being made public[4]. This time, it was explained away as an &quot;oversight&quot; related to the fact that previously, opt-outs weren&#x27;t permanent but had a hidden expiration time. Triplebyte once again apologized and promised that it wouldn&#x27;t happen again, and many people seemed satisfied with the &quot;transparency and candidness&quot; of their response.<p>Now it&#x27;s 2022, and yesterday I got a recruiting email from a company that found me via the Triplebyte account I created back in 2019. When I logged in to check, sure enough, my profile was set to &quot;publicly visible&quot; and &quot;open to new opportunities&quot;. I was pretty sure I had never made those changes, but just in case I was misremembering, I contacted Triplebyte support to find out what was going on. Today I got this response:<p>&quot;I was able to do some digging on to why this must have happened, It looks like before we did our last update to the platform you did not have the profile visibility set to indefinitely so the profile was turned on. Since then we have made a privacy chance once you set the profile to off there is not reset time frame it will remain off until you turn it on.&quot;<p>(Unlike the user in [4], I never got any kind of notification that this automatic change was being made.)<p>So despite their explicit promises, Triplebyte did not actually go back and fix the privacy settings for users who had them silently changed by the previous &quot;dark pattern&quot;. This is a heads-up to anyone else who has a Triplebyte account and might be affected by the same issue.<p>[1]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23279837<p>[2]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23280120<p>[3]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=23303037<p>[4]: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=27255742",
      "time": 1655405729,
      "title": "Tell HN: Triplebyte is, yet again, making user profiles public without consent",
      "type": "story"
    },
    {
      "by": "aiwryter",
      "descendants": 0,
      "id": 31769592,
      "score": 1,
      "text": "Looking for a content writer to help create quality, engaging and informative posts? Look no further than us! Our AI System can help you write quality content that will help your website or business grow.\nhttps:&#x2F;&#x2F;www.aiwryter.com",
      "time": 1655405636,
      "title": "AIwryter- Smart AI Content Writing Assistant and Marketing App",
      "type": "story"
    },
    {
      "by": "mortenjorck",
      "descendants": 0,
      "id": 31769581,
      "score": 1,
      "time": 1655405576,
      "title": "13-Inch MacBook Pro with M2 Chip Outperforms Base Model Mac Pro",
      "type": "story",
      "url": "https://www.macrumors.com/2022/06/16/m2-chip-outperforms-base-mac-pro/"
    },
    {
      "by": "Syonyk",
      "descendants": 0,
      "id": 31769572,
      "score": 1,
      "time": 1655405513,
      "title": "Boinc in Retrospect",
      "type": "story",
      "url": "https://continuum-hypothesis.com/boinc_history.php"
    },
    {
      "by": "nwsm",
      "descendants": 0,
      "id": 31769561,
      "score": 1,
      "time": 1655405455,
      "title": "Protecting Renters from Flood Loss [pdf]",
      "type": "story",
      "url": "https://www.pennlawreview.com/wp-content/uploads/2022/06/Heiman_Final.pdf"
    },
    {
      "by": "crowdhailer",
      "descendants": 0,
      "id": 31769538,
      "score": 3,
      "time": 1655405318,
      "title": "The future of friendly functional programming, Talking about Gleam language",
      "type": "story",
      "url": "https://open.spotify.com/episode/5kQbDiLY65Ujn1ymnugsX4"
    }
  ]
}