{
  "stories": [
    {
      "by": "linkdd",
      "descendants": 0,
      "id": 31373741,
      "score": 1,
      "text": "Hey HN, author here.<p>My side project ( <a href=\"https:&#x2F;&#x2F;letlang.dev\" rel=\"nofollow\">https:&#x2F;&#x2F;letlang.dev</a> - a programming language targeting Rust) is making progress.<p>I&#x27;m proud to show you the first compiled Letlang module :)<p>It&#x27;s not much, it&#x27;s not even useful yet, but it proves that the runtime works as intended, and that the compiler is able to generate valid Rust code.<p>Now that the hardest part is done, all that remains is implementing all the features of the language, finish redacting the specification, and make some programs!<p>Still a huge amount of work yes, but baby steps! I&#x27;ll probably open-source the code next week or so.",
      "time": 1652485785,
      "title": "Show HN: First Letlang Module Compiled",
      "type": "story",
      "url": "https://gist.github.com/linkdd/2c69f4e4e1dad752a1704ed2ac0dd678"
    },
    {
      "by": "haddadda",
      "descendants": 0,
      "id": 31373738,
      "score": 1,
      "time": 1652485757,
      "title": "The Fall of Terra with On-Chain Data",
      "type": "story",
      "url": "https://blog.sidelight.xyz/terra-fall-timeline/"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 31373726,
      "score": 1,
      "time": 1652485659,
      "title": "What's New in C# 11",
      "type": "story",
      "url": "https://docs.microsoft.com/en-us/dotnet/csharp/whats-new/csharp-11"
    },
    {
      "by": "dbader",
      "descendants": 0,
      "id": 31373719,
      "score": 1,
      "time": 1652485614,
      "title": "Display and share text in a large font (utility site)",
      "type": "story",
      "url": "https://large-type.com/"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31373696,
      "score": 1,
      "time": 1652485344,
      "title": "How My Fitness Tracker Turned Me Against Myself",
      "type": "story",
      "url": "https://fivethirtyeight.com/features/how-my-fitness-tracker-turned-me-against-myself/"
    },
    {
      "by": "ncakes",
      "descendants": 0,
      "id": 31373677,
      "score": 1,
      "time": 1652485113,
      "title": "Counter Clicks",
      "type": "story",
      "url": "https://web-click-fps.vercel.app/"
    },
    {
      "by": "daneelsan",
      "descendants": 0,
      "id": 31373666,
      "score": 1,
      "time": 1652484968,
      "title": "The Making of a New Kind of Science",
      "type": "story",
      "url": "https://writings.stephenwolfram.com/2022/05/the-making-of-a-new-kind-of-science/"
    },
    {
      "by": "anyonecancode",
      "descendants": 0,
      "id": 31373664,
      "score": 2,
      "time": 1652484964,
      "title": "The Personal Computer Book (1982)",
      "type": "story",
      "url": "https://archive.org/details/thepersonalcomputerbook2ndedition"
    },
    {
      "by": "djellybeans",
      "descendants": 1,
      "id": 31373653,
      "kids": [
        31373695
      ],
      "score": 1,
      "text": "Currently I&#x27;m unemployed and I also have the curiosity of a student- trying to build a network with professionals and to get a smorgasbord of tech company offers while remaining very open.<p>My network isn&#x27;t very strong, technical skills are lacking, and I am having trouble planning my time to work on all these things.<p>I don&#x27;t want to limit myself to just FAANG. I am mostly interested in offers for high pay and the opportunity to learn a lot more from engineers in my next 2 years of work than I did in my past 5. Having a company that can provide health insurance and being able to contribute to 401k would be nice too, I never had that before. Wanna make my immigrant parents proud and I feel I&#x27;ve let them down with as someone who hasn&#x27;t held a steady job in more than 10 years.<p>For my experience, I have spent the last 2 years unemployed and the last 12 before that going on and off temp work for various startups and other small companies. Nothing that involved more than 5 people in a project. Sometimes it&#x27;s web boutique work other times it&#x27;s a SaaS web project. JavaScript and PHP have been my main tools but I am fine with trying out others.<p>Counterintuitively, from the perspective of getting an interview at high-paying companies, my 12 years of doing work as a freelancer is seen as inferior to a handful of internships. I especially know from speaking to someone else that&#x27;s much newer to the industry, that he got the attention from companies such as Github and Intel with research projects and academic publications. He took internships from both.<p>As someone who&#x27;s graduated long ago, I clearly don&#x27;t have those extracurricular options. So I&#x27;m interested in some career &quot;side quests&quot; for the under-skilled and out of school, that aren&#x27;t just personal side projects, and trying to go above and beyond. My unemployment just means I should have more spare time to get involved in them.<p>Are there hackathons open for any programmer no matter their experience level that are worth attending? Interesting coding challenges sponsored by big companies? I need to add things on my resume that I can start doing right now to make a lot of tech companies say &quot;let&#x27;s interview him&quot;. In the geographic area where I live, there are rarely any opportunities to network with people in big tech.",
      "time": 1652484888,
      "title": "Ask HN: Extracurriculars” for experienced programmers to find better work?",
      "type": "story"
    },
    {
      "by": "dannyow",
      "descendants": 0,
      "id": 31373643,
      "score": 2,
      "time": 1652484754,
      "title": "The web is in need of some reinvention",
      "type": "story",
      "url": "https://macwright.com/2020/08/22/clean-starts-for-the-web.html"
    }
  ]
}