{
  "stories": [
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 29150045,
      "score": 1,
      "time": 1636384277,
      "title": "REvil ransomware affiliates arrested in Romania and Kuwait",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/revil-ransomware-affiliates-arrested-in-romania-and-kuwait/"
    },
    {
      "by": "jonaylor89",
      "descendants": 0,
      "id": 29150043,
      "score": 1,
      "time": 1636384266,
      "title": "Discover Hidden Secrets in Git Repos with Rust",
      "type": "story",
      "url": "https://blog.jonaylor.xyz/discover-hidden-secrets-in-git-repos-with-rust"
    },
    {
      "by": "Aspose_app",
      "descendants": 0,
      "id": 29150024,
      "score": 1,
      "text": "Aspose.Total Merger is a very easy to use free online app that can be used to combine multiple files and save them in the desired format. The web app has included support for several popular formats such as DOC, DOCX, EMF, EPUB, GIF, HTML, JPEG, JPG, MHTML, OBJ, ODP, ODS, PCL, PDF, PLY, PNG, PPS, PPSM, PPSX, PPT, PPTM, PPTX, PS, PSD, RTF, SVG, SWF, TEXT, TIFF, TXT, XLS, XLSB, XLSM, XLSX, XLT, XML, XPS and many other documents formats. The apps are very easy to use and allow users to select files of their choice and merge them with a single click. Once done you can immediately download the merged document as well as view it or email to someone in your office with ease.",
      "time": 1636384166,
      "title": "Combine Multiple Files Online and Save to Desired Format for Free",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29150023,
      "score": 1,
      "time": 1636384157,
      "title": "The Biology Revolution: a computational perspective (2017)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=HwtOZ_WfMw0"
    },
    {
      "by": "jason_s",
      "descendants": 0,
      "id": 29150015,
      "score": 1,
      "text": "I&#x27;m writing an article on the semiconductor shortage and would like to understand some of the factors used to choose process node when it is close to, but not the leading edge node.<p>If you have been involved in an IC design that started in 2020 or 2021, and is in the 10nm - 40nm range:<p>- Which market is your project in? (automotive, communications, IoT, etc.)<p>- Which node did you use?<p>- Why did your project choose that node?<p>Direct messages preferred (my twitter account handle is in my HN profile), but if you want to post publicly, that&#x27;s fine, too.",
      "time": 1636384127,
      "title": "Ask HN: IC Designers/Architects: Why did you choose your process node?",
      "type": "story"
    },
    {
      "by": "kutsyk",
      "descendants": 0,
      "id": 29150012,
      "score": 1,
      "time": 1636384112,
      "title": "Know your Azure environment better with Grafana",
      "type": "story",
      "url": "https://kutsyk.medium.com/know-your-azure-environment-better-with-grafana-9dad281ff649"
    },
    {
      "by": "polycaster",
      "descendants": 0,
      "id": 29150011,
      "score": 2,
      "text": "A client of mine is just about to launch a startup. There&#x27;s nothing public on the web yet. Today, while hacking a very minimal prototype of a HTML page into VSCode, I got a strange suggestion from GH Copilote. When I entered the client&#x27;s name Copilot prompted me with a ready-made &lt;article&gt; block containing a marketing claim of their company. So far so nice.<p>Strange thing is the claim is not public and not contained in the codebase I&#x27;m currently working on, in no codebase I know of and to my knowledge, I&#x27;m the only related dev using Copilot. It&#x27;s also not listed on Google, thus I assume it&#x27;s not leaked somewhere else that could be indexed by GH (which is an assumption of course, but appears likely). But it can be found in a completely separate local folder with project assets that is not published on GH.<p>The marketing claim is about the length of a tweet and is not exactly generic. It requires understanding of my client&#x27;s business (which again, cannot be derived from my codebase). So it&#x27;s just not GPT3 output that matches coincidentially.<p>The GH „About GitHub Copilot Telemetry” page [1] does not indicate that your locale file system is scanned though.<p>Can anyone explain that or observed a similar phenomenon?<p>[1] https:&#x2F;&#x2F;docs.github.com&#x2F;en&#x2F;github&#x2F;copilot&#x2F;about-github-copilot-telemetry",
      "time": 1636384102,
      "title": "Ask HN: Any indications Copilot scans your local files?",
      "type": "story"
    },
    {
      "by": "jmarchello",
      "descendants": 0,
      "id": 29149993,
      "score": 1,
      "time": 1636383960,
      "title": "Ultra",
      "type": "story",
      "url": "https://twitter.com/raunofreiberg/status/1457710330495356929"
    },
    {
      "by": "ggoo",
      "descendants": 0,
      "id": 29149961,
      "score": 2,
      "time": 1636383803,
      "title": "The benefits of staying off social media",
      "type": "story",
      "url": "https://durmonski.com/life-advice/benefits-of-staying-off-social-media/"
    },
    {
      "by": "dlor",
      "descendants": 0,
      "id": 29149956,
      "score": 3,
      "time": 1636383789,
      "title": "Notary v2 and Cosign",
      "type": "story",
      "url": "https://dlorenc.medium.com/notary-v2-and-cosign-b816658f044d"
    }
  ]
}