{
  "stories": [
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29796935,
      "score": 1,
      "time": 1641315405,
      "title": "Intel: Sapphire Rapids with 64 GB of HBM2e, Ponte Vecchio with 408 MB L2 Cache",
      "type": "story",
      "url": "https://www.anandtech.com/show/17067/intel-sapphire-rapids-with-64-gb-of-hbm2e-ponte-vecchio-with-408-mb-l2-cache"
    },
    {
      "by": "pbronez",
      "descendants": 0,
      "id": 29796933,
      "score": 1,
      "text": "Firefox multi-account containers [0] are great, especially when combined with Temporary Containers[1]. Firefox add-ons (extensions) are also great, but often extensions ask for an uncomfortable amount of permissions. For example, price comparison extensions want to run on all websites.<p>I want to use multi-account containers to be more selective about which extensions are active. For example, I would like to restrict my price comparison extensions to a &quot;Shopping&quot; container.<p>Is this possible? If not, is there some other mechanism to accomplish this?<p>I already use multiple browsers for another layer of isolation, so I&#x27;m most interested in solutions that work within Firefox.<p>[0] https:&#x2F;&#x2F;support.mozilla.org&#x2F;en-US&#x2F;kb&#x2F;containers<p>[1] https:&#x2F;&#x2F;addons.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;addon&#x2F;temporary-containers&#x2F;",
      "time": 1641315400,
      "title": "Ask HN: Restrict Firefox Extention to a Container?",
      "type": "story"
    },
    {
      "by": "rylandking",
      "descendants": 0,
      "id": 29796927,
      "score": 1,
      "time": 1641315386,
      "title": "Apple's Early Success Stemmed from a Tiny 20kb Computer Program They Didn't Make",
      "type": "story",
      "url": "https://www.stackbit.com/blog/apples-early-success-visicalc/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29796921,
      "score": 1,
      "time": 1641315363,
      "title": "Intel Teases Alder Lake CPU with 5.5 GHz Boost Clock",
      "type": "story",
      "url": "https://www.tomshardware.com/news/intel-teases-alder-lake-cpu-5-5-ghz-boost-clock"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29796918,
      "score": 1,
      "time": 1641315334,
      "title": "Intel Arc A380 GPU Goes Neck-and-Neck with GTX 1650 Super in New Benchmarks",
      "type": "story",
      "url": "https://www.tomshardware.com/news/intel-arc-a380-gpu-gtx-1650-super-benchmarks"
    },
    {
      "by": "lalaland1125",
      "descendants": 0,
      "id": 29796895,
      "score": 1,
      "time": 1641315234,
      "title": "The World’s Lowest Fertility Rate Is About to Get Even Lower",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-12-09/world-s-lowest-fertility-rate-to-get-even-lower-korea-reports"
    },
    {
      "by": "throwawaymycode",
      "descendants": 0,
      "id": 29796864,
      "score": 2,
      "text": "So this has been going on for quite some time.<p>First, I am still struggling through my studies. I started working on the side (freelance fullstack and WP dev) while still studying and my progress took a big hit. I am left with a single exam which I failed multiple times (mostly because of not preparing enough beforehand because of other worries that needed to be taken care of as well).<p>At work it&#x27;s not better, the WordPress stuff is quite easy to manage (but I feel that is only because every question on earth regarding WordPress and its ecosystem has already been asked), but there is one longer term freelance commitment where I feel like I am not adding any value and am just burning money. I think my contractor (a dev themself) only keeps working with me because they either can&#x27;t find or afford (or both) a better developer.<p>In most situations they need to either help me out working on features or they rewrite big portions of my code afterwards when I delivered something. At first I thought it was probably just a learning experience and it will get better over time, but it didn&#x27;t. Everything is happening nearly as often as i.e. two years ago.\nI read docs, Github issues, StackOverflow, other peoples&#x27; code etc. daily but I don&#x27;t seem to really learn anything useful.\nAlso the code base looks nothing like what I was taught at uni. No tests, no style guides, no processes, no documented architecture, no docs generally. Just code and requirements.\nYes, I expected work to be different and &quot;real-world&quot; code to be not as beautiful and well-thought out as in my Software Engineering classes, but is this really it?<p>So looking at my still unfinished studies, the feeling that I am not able to contribute in a meaningful way to the code base of one of my clients and having quite a low income I can&#x27;t help but feel like I am just incompetent.<p>I get it, impostor syndrome and all of that, but I really get the feeling it is not just impostor syndrome but fact.<p>Random strangers on the internet, what would you do in my situation? I don&#x27;t know how to overcome this.",
      "time": 1641315052,
      "title": "Ask HN: How can I overcome feeling incompetent?",
      "type": "story"
    },
    {
      "by": "Jarlakxen",
      "descendants": 0,
      "id": 29796863,
      "score": 1,
      "time": 1641315049,
      "title": "AMD 2022 Product Premiere",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_jX-hKvUQDU"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29796810,
      "score": 1,
      "time": 1641314772,
      "title": "Two Deterministic Build Bugs",
      "type": "story",
      "url": "https://randomascii.wordpress.com/2022/01/04/two-deterministic-build-bugs/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29796804,
      "score": 1,
      "time": 1641314735,
      "title": "New way to scrub carbon dioxide from factory emissions, make useful products",
      "type": "story",
      "url": "https://today.oregonstate.edu/news/osu-research-finds-way-scrub-carbon-dioxide-factory-emissions-make-useful-products"
    }
  ]
}