{
  "stories": [
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28642801,
      "score": 1,
      "time": 1632493293,
      "title": "Programmable Digital Currencies Are Coming – Here's What That Means (2020)",
      "type": "story",
      "url": "https://www.nasdaq.com/articles/programmable-digital-currencies-are-coming-heres-what-that-means-2020-08-18"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 28642784,
      "score": 2,
      "time": 1632493245,
      "title": "ExpressVPN employees complain about ex-spy's top role at company",
      "type": "story",
      "url": "https://www.reuters.com/technology/expressvpn-employees-complain-about-ex-spys-top-role-company-2021-09-23/"
    },
    {
      "by": "durmonski",
      "descendants": 0,
      "id": 28642775,
      "score": 1,
      "time": 1632493217,
      "title": "Writers Who Draw",
      "type": "story",
      "url": "https://creativemornings.com/talks/edward-carey/"
    },
    {
      "by": "pressurewave",
      "descendants": 0,
      "id": 28642741,
      "score": 1,
      "time": 1632493112,
      "title": "Internationalized Domain Names (Punycode Domains) – Latent Threats?",
      "type": "story",
      "url": "https://sirendns.com/blog/2021092101.html"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28642740,
      "score": 1,
      "time": 1632493108,
      "title": "iPhone 13 Pro camera review: Tanzania",
      "type": "story",
      "url": "https://austinmann.com/trek/iphone-13-pro-camera-review-tanzania"
    },
    {
      "by": "herodotus",
      "descendants": 0,
      "id": 28642718,
      "score": 1,
      "time": 1632493042,
      "title": "No, Vaccinated People Are Not ‘Just as Likely’ to Spread the Coronavirus",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/09/the-vaccinated-arent-just-as-likely-to-spread-covid/620161/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28642714,
      "score": 1,
      "time": 1632493021,
      "title": "Paving the Way to Electrically Pumped Lasers from Colloidal-Quantum-Dots",
      "type": "story",
      "url": "https://www.techbriefs.com/component/content/article/tb/insiders/pit/stories/39941"
    },
    {
      "by": "anonymous567",
      "descendants": 0,
      "id": 28642640,
      "score": 1,
      "text": "My background:<p>I&#x27;m a 25 year old Indian software developer working in India.<p>As for my education, I actually studied in the United States for my MS in Computer Science (from a large public university; not ivy league), and is one of the rare Indian students who actually returned to India immediately after I got my degree. I cannot pinpoint exactly why I returned; it was a combination of me being an introvert + I really felt like I didn&#x27;t belong there. (Don&#x27;t get me wrong here — all Americans (and non Americans, for that matter) I met in USA were wonderful nice kind people; it&#x27;s just, I didn&#x27;t belong there).<p>After returning back to India, I got a software engineering job which I would&#x27;ve gotten anyway even if I never went to America (I try not to think too much about this).<p>I have 2.5 years of work experience, and at work I do Laravel for the most part, with occasional Python and Go. If I may say so myself, I&#x27;m an expert in Laravel, great with python, and just a beginner in Go. I&#x27;m constantly learning and improving myself.<p>I work on a specific product (that our company sells to many other companies; basically what I&#x27;m saying is, this product is not something a specific client asked us to build — it is a web application we built and sell and make money from), ie., I&#x27;m NOT a consultant programmer or anything like that.<p>I&#x27;ve become good enough at my current job that it&#x27;s no longer stressful.<p>I&#x27;m making decent money (decent enough for a single guy living in a tier-2 city in India), and I don&#x27;t have much expenses. No loans or mortgages or crap like that.<p>My problem is that I don&#x27;t know where to go to from here. Like, I&#x27;m in a good, comfortable place. I want to get to a better, even more comfortable place, and I don&#x27;t know what to do.<p>I&#x27;ve considered applying to other jobs, but the work environment in most other places around here is hectic and is not worth with going to. And most other jobs here are those consultancy&#x2F;outsourcing type jobs which I&#x27;m not keen on doing. Also, I doubt if any of those would be intellectually stimulating.<p>I tried my luck applying to FAANG companies, and well, I didn&#x27;t get them. Unlike previous years, this year I didn&#x27;t even get a callback after I applied (I used to get to the interview stages). Maybe they decided I might never improve lmao.<p>Perhaps I should move abroad? But where to? Going to USA is out of the question with the H1B lottery and associated crapshoot that I don&#x27;t want to subject myself to. Plus, that&#x27;s a country I choose to return from.<p>Or perhaps I should try to get away from my web developer job and get into something else?<p>Let&#x27;s see. Consider machine learning. I&#x27;m good at math, yet I had an extremely difficult time in my artificial intelligence class; therefore I might end up being bad at ML, but who knows. Although there&#x27;s plenty of ML jobs here, it&#x27;s difficult to get those jobs if you&#x27;re not already in ML. Hard to get my foot in the door.<p>I have more interest in type systems and programming language theory and things like that. While I&#x27;m not an expert, I know little of Haskell and Racket, and I think I&#x27;d enjoy doing more of those in a professional capacity. But then again, the job market for those kinds of things is next to nil here. A career at Jane Street interests me more than a career at Google, but I don&#x27;t think I&#x27;m great enough for them to move me to one of their offices abroad (they don&#x27;t have offices in India).<p>Should I learn ML&#x2F;Data Science and get into that? Should I move abroad? Should I do anything else?<p>So, I&#x27;m asking for general career and life advise here. I don&#x27;t have any active pressing problems, but my life is just meh. Borderline depressing.<p>Thanks for reading thus far, and sorry if I wasted your time.",
      "time": 1632492793,
      "title": "Ask HN: How do I move up my career/life?",
      "type": "story"
    },
    {
      "by": "hntddt1",
      "descendants": 0,
      "id": 28642579,
      "score": 1,
      "time": 1632492581,
      "title": "Manikin",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Transparent_Anatomical_Manikin"
    },
    {
      "by": "radmuzom",
      "descendants": 0,
      "id": 28642565,
      "score": 1,
      "time": 1632492536,
      "title": "The Right's Snowflakes Are Banning Books",
      "type": "story",
      "url": "https://morningshots.thebulwark.com/p/the-rights-snowflakes-are-banning"
    }
  ]
}