{
  "stories": [
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29156281,
      "score": 1,
      "time": 1636418465,
      "title": "Visualizing the microscopic world of fast ions in fusion devices",
      "type": "story",
      "url": "https://phys.org/news/2021-11-visualizing-microscopic-world-fast-ions.html"
    },
    {
      "by": "stilisstuk",
      "descendants": 0,
      "id": 29156253,
      "score": 1,
      "time": 1636418214,
      "title": "Do you know about NATOs chat app?",
      "type": "story",
      "url": "https://www.dencrypt.dk/"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29156224,
      "score": 1,
      "time": 1636417958,
      "title": "Scientists pour cold water on Bill Gates' nuclear plans",
      "type": "story",
      "url": "https://www.dw.com/en/scientists-pour-cold-water-on-bill-gates-nuclear-plans/a-59751405"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29156219,
      "score": 1,
      "time": 1636417925,
      "title": "NASA and USGS Release First Images from New Landsat 9 Spacecraft",
      "type": "story",
      "url": "https://scitechdaily.com/nasa-and-usgs-release-stunning-first-images-from-new-landsat-9-spacecraft/"
    },
    {
      "by": "layoric",
      "descendants": 0,
      "id": 29156203,
      "score": 3,
      "time": 1636417793,
      "title": "Real-Time Search with Typesense",
      "type": "story",
      "url": "https://servicestack.net/blog/typesense-realtime-search"
    },
    {
      "by": "pipeline_peak",
      "descendants": 0,
      "id": 29156179,
      "kids": [
        29156246
      ],
      "score": 1,
      "text": "The Portable Document Format has lost it&#x27;s relevance in IT. There are many newer, open technologies like HTML that surpass the formats functionality.<p>The specification is ever-growing and out of sight. Adobe&#x27;s proprietorship of PDF almost comes off as lure for needing to purchase Acrobat for simple editing. They really do not want other vendors or software firms having the leverage they do for a product so basic it shouldn&#x27;t really exist.<p>The industry dominance Adobe has on document formats is a burden to users that deserve something open.",
      "time": 1636417564,
      "title": "Ask HN: Should PDF Be Replaced?",
      "type": "story"
    },
    {
      "by": "flerovium",
      "descendants": 3,
      "id": 29156174,
      "kids": [
        29156183
      ],
      "score": 1,
      "text": "Does hn silently remove vaccine misinformation? I&#x27;m used to seeing &quot;flagged&quot; or downvoted to hell.<p>NOTE: I believe vaccines work. I&#x27;m not a nutter. I&#x27;m curious only because I didn&#x27;t know hn silently removed things.<p>I clicked the following link and the post was gone. It turns out it was by a vaccine VC nutter Steve Kirsch.<p>The page is blank: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29156049<p>I don&#x27;t believe it&#x27;s deleted because it doesn&#x27;t say [deleted].",
      "time": 1636417514,
      "title": "Ask HN: Does HN Remove Posts?",
      "type": "story"
    },
    {
      "by": "rxsel",
      "descendants": 1,
      "id": 29156154,
      "kids": [
        29156265
      ],
      "score": 2,
      "text": "As an engineer diagnosed with ADHD, I have my own ways of managing but I&#x27;m curious how others manage conditions affecting cognition and the executive functions of the brain in cognitive intensive fields.",
      "time": 1636417367,
      "title": "Ask HN: Do you have any condition like ADHD, and if so how do you manage them?",
      "type": "story"
    },
    {
      "by": "falsenine",
      "descendants": 0,
      "id": 29156143,
      "score": 1,
      "text": "Currently a masters student in physiology, in a non-technical lab. But would like to learn the technical skills required for understanding and applying deep learning (etc). I often see DL&#x2F;ML&#x2F;AI applied to fields such as radiology, dermatology, cardiology, and it would be great to not only understand this kind of research, but also be an active participant in the future.<p>As someone with a limited technical&#x2F;quantitative background (currently learning R for a biostatistics course), what would be the ideal approach I should take to learn DL&#x2F;ML&#x2F;AI?<p>From my search it seems that there are two ways of approaching the learning roadmap&#x2F;pathway:<p>(1) Practical approach: learn the right tools and apply them to the problem at hand. \n(2) Comprehensive approach: understand the mathematics behind DL&#x2F;ML&#x2F;AI so that you have a greater understanding of the tools.<p>I think many researchers in medicine, especially if they&#x27;re coming from clinical backgrounds as opposed to Comp Sci backgrounds, use this practical approach. This approach would be more feasible for someone like me, whereas learning all the required mathematics would probably take several years of study (on top of my other responsibilities).<p>Ultimately, what steps should I take? I think Step 1 would be to learn Python. I am already learning R, but I see Python used more frequently.",
      "time": 1636417307,
      "title": "Ask HN: Learning pathway for deep learning/machine learning/AI in medicine?",
      "type": "story"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29156132,
      "score": 1,
      "time": 1636417223,
      "title": "He always wanted a PhD in physics. He finally earned it at 89",
      "type": "story",
      "url": "https://www.npr.org/2021/11/07/1052005447/brown-university-89-phd-physics-dream"
    }
  ]
}