{
  "stories": [
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 29844821,
      "score": 1,
      "time": 1641589598,
      "title": "Fiber Builds Reverse Frontier Communication's Broadband Decline",
      "type": "story",
      "url": "https://www.fiercetelecom.com/telecom/frontier-adds-45k-fiber-lines-posts-first-broadband-growth-5-years-q4"
    },
    {
      "by": "ciwchris",
      "descendants": 0,
      "id": 29844809,
      "score": 1,
      "text": "Three years ago I started waking up in the middle of the night and struggled to go back to sleep. Thus began my journey to improve my sleep. Unfortunately it was a downward spiral for the first year and a half. It was around that time I went through cognitive behavioral therapy. I believe it has helped me the most. But whenever I suffer a poor night of sleep it is still difficult to fend off the negative thoughts. Because of my sleep troubles I believe I&#x27;ve lost touch with what normal sleep is. That I continue to have unreasonable expectations of sleep.<p>Therefore I thought it beneficial for me, and others, to hear what sleep is like from those who do not consider themselves to have sleep issues. How many hours a night do you sleep? How often do you wake up? How consistent is your sleep? How often do you have a poor night of sleep? What do you consider a poor night of sleep? How has sleep changed as you have aged? How has it changed during seasons in your life?",
      "time": 1641589519,
      "title": "Ask HN: For normal sleepers, what is your sleep experience?",
      "type": "story"
    },
    {
      "by": "cookiengineer",
      "descendants": 0,
      "id": 29844807,
      "score": 1,
      "text": "Dear fellow HN citizens,<p>A friend of mine and me were taking part in a Hackathon that was lasting 48 hours. The theme was &quot;open source&quot; and we had to implement all products from scratch, as instructed by the organizers.<p>Later, we found out that multiple companies have hijacked this Hackathon and were selling their established products and even legal company entities as an idea that was supposedly created during that time frame. They even had company websites where the exact same product was marketed years before the Hackathon.<p>None of those &quot;commercial&quot; participants interacted with anyone on the Hackathon, and were just there with single members to pitch their established products and businesses.<p>We won the 3rd place, but said companies got the 1st and 2nd place. So, our question is now an ethical one:<p>Would you accept the prize money?<p>If yes, do you have suggestions what kind of Open Source project to sponsor with it? (We don&#x27;t want to keep the money)<p>From our perspective we feel like an obligatory winner, and we think that this was very unfair to all other (non-commercial) participants of the Hackathon that were putting much work and faith into the spirit of the competition.",
      "time": 1641589508,
      "title": "Would you refuse a hackathon prize where companies hijacked it?",
      "type": "story"
    },
    {
      "by": "kscottz",
      "descendants": 0,
      "id": 29844771,
      "score": 1,
      "time": 1641589369,
      "title": "Indy Autonomous Challenge Live Stream (Autonomous Racing)",
      "type": "story",
      "url": "https://www.twitch.tv/indyachallenge"
    },
    {
      "by": "Animats",
      "descendants": 0,
      "id": 29844702,
      "score": 1,
      "time": 1641589025,
      "title": "Razer Misleading Mask Marketing",
      "type": "story",
      "url": "https://www.pcmag.com/opinions/razer-plays-a-dangerous-game-with-its-misleading-mask-marketing"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29844682,
      "score": 1,
      "time": 1641588892,
      "title": "Digital Twins Arrived in 2021–and Will Shape the Future",
      "type": "story",
      "url": "https://time.com/6131320/digital-twins-uses/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29844678,
      "score": 1,
      "time": 1641588882,
      "title": "New Standards Rolling Out for Clocking Quantum-Computer Performance",
      "type": "story",
      "url": "https://spectrum.ieee.org/quantum-computer-benchmarks"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 29844671,
      "score": 1,
      "time": 1641588857,
      "title": "Model moves computers closer to understanding human conversation – Hub",
      "type": "story",
      "url": "https://hub.jhu.edu/2021/12/20/model-improves-how-computers-process-speech/"
    },
    {
      "by": "tandav",
      "descendants": 0,
      "id": 29844658,
      "score": 2,
      "time": 1641588826,
      "title": "Auto HD/4k/8k for YouTube – Chrome extension",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/auto-hd4k8k-for-youtube-y/fjdmkanbdloodhegphphhklnjfngoffa"
    },
    {
      "by": "mkmk",
      "descendants": 0,
      "id": 29844651,
      "score": 5,
      "time": 1641588761,
      "title": "How to acquire 1,024 public IPv4 addresses which are worth $60K for $500",
      "type": "story",
      "url": "https://twitter.com/_rchase_/status/1479512245247881222"
    }
  ]
}