{
  "stories": [
    null,
    null,
    {
      "by": "RikNieu",
      "descendants": 0,
      "id": 30496563,
      "score": 2,
      "time": 1646024068,
      "title": "Belarus to Host Russian Nukes in Major Reversal of Post-Soviet Order",
      "type": "story",
      "url": "https://www.newsweek.com/belarus-host-russian-nukes-major-reversal-post-soviet-order-1683072"
    },
    {
      "by": "ak391",
      "descendants": 0,
      "id": 30496561,
      "score": 1,
      "time": 1646024056,
      "title": "Build a ML web app in pure Python",
      "type": "story",
      "url": "https://www.gradio.app/"
    },
    {
      "by": "throwawaydroid",
      "descendants": 0,
      "id": 30496557,
      "score": 1,
      "text": "Hi all im writing this because im fed up with all the trash and bullies on reddit. I recently found myself wanting to write on reddit for the first time in awhile. Btw, i use reddit exclusively in the browser and refuse to download the app. To be fair ive been lurking for a few months on accounts i never posted with before. Sadly, at this point it looks like both my accounts on reddit got nuked. Both my iphone and android both seem to refuse to message or comment now; i made a new account and was able to make 2 posts, but they were removed by automoderator, and trying to message any mod seems to give me an error every time.<p>Timeline: I&#x27;ve experienced hankypanky on reddit before, and had devised a strategy to keep from being censored, but i guess i was lazy and didnt feel like being paranoid this time, and so i did not manage to archive the original post that got me banned the 1st time. All that can be found of this post now is on camas[1]. I was actually surprised by the ban since it was a sub about trashing crypto, and i was there to trash crypto, so it came as a surprise when i went to check on the thread and found i was banned. Now i check this thread habitually every day, and have been doing so for months so i hope you can understand i was upset. Here&#x27;s a link to an archive of my response[2]. I didnt feel like being online anymore so a few hours went by without me checking reddit, but when i did i found that a kind mod had told me to dm them personally to work things out. I thanked them and apologized for before, and went about writing a kindly worded note. But when i tried to click send i got an error. And when i tried to send the same note from my other account i also got an error. I tried to post the note in a comment but that no longer worked. I checked my ban notice again, and saw that it said circumvention could trigger sitewide ban, so I decided to tether to my droid to my iphone and create a whole new account. Dm still wouldnt send so i tried copying the note into a comment; it worked! Shortly thereafter my comment was removed by automoderator. By this point i was mad that both my accounts seemed messed up as well as this new account i just made. I assumed the trouble was due to a site-wide ban, though now i am starting to suspect maybe it is a bug in the mobile browser interface(i have never sent a dm on reddit in mobile before). I was pretty sure some sort of ban was involved and i wanted to air my grievance somewhere so i went over to &#x2F;r&#x2F;watchredditdie only to find out that you cant post links to reddit itself over there, it is actually against the rules(i found that out after automoderator took down the post). I tried to write a message to watchredditdie mods in the link contained in the automod response, but i got another error. I tried the link in the automod response on buttcoin, and miraculously it worked this time, however im still awaiting a response. The whole thing is very frustrating since i&#x27;d rather just keep scrolling reddit as its kind of a habit i have formed. Sadly it&#x27;s just so toxic. Im not actually sure anything has even changed at reddit over the years, other than getting more locked down in what is possible on the site given a certain level of karma - maybe that is the problem. Anyway im coming to realize how much of a garbage dump it is.<p>[1] https:&#x2F;&#x2F;camas.github.io&#x2F;reddit-search&#x2F;#{%22author%22:%22iosunverified%22,%22resultSize%22:100}<p>[2] https:&#x2F;&#x2F;archive.is&#x2F;rMH0N<p>p.s. ill post my apology to buttcoin mods and my attempted message to watchredditdie mods in the comments.",
      "time": 1646024035,
      "title": "Reddit is a trashy place(crypto comedy)",
      "type": "story"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 30496556,
      "score": 1,
      "time": 1646024033,
      "title": "Ukraine invasion: Russia restricts social media access",
      "type": "story",
      "url": "https://www.bbc.com/news/technology-60533083"
    },
    {
      "by": "schappim",
      "descendants": 0,
      "id": 30496531,
      "score": 1,
      "time": 1646023776,
      "title": "Google Maps temporarily disables live traffic data in Ukraine",
      "type": "story",
      "url": "https://www.axios.com/google-maps-live-traffic-data-disabled-ukraine-f4c0bf7a-249a-4fcc-8e65-49642f728d26.html"
    },
    {
      "by": "branko_d",
      "descendants": 0,
      "id": 30496524,
      "score": 2,
      "time": 1646023693,
      "title": "Should we kill every mosquito on Earth?",
      "type": "story",
      "url": "https://www.livescience.com/what-if-all-mosquitoes-died"
    },
    {
      "by": "chaostheory",
      "descendants": 0,
      "id": 30496509,
      "score": 1,
      "time": 1646023506,
      "title": "I worry not just about Ukraine but about Russia too. [video]",
      "type": "story",
      "url": "https://twitter.com/paulg/status/1497580951173570571"
    },
    {
      "by": "jparise",
      "descendants": 0,
      "id": 30496428,
      "score": 2,
      "time": 1646022600,
      "title": "Compilers and 3 orders of magnitude in 60 minutes [pdf]",
      "type": "story",
      "url": "http://venge.net/graydon/talks/CompilerTalk-2019.pdf"
    }
  ]
}