{
  "stories": [
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 30189143,
      "score": 1,
      "text": "Right now, there&#x27;s a shortage of truck drivers in the US and worldwide, exacerbated by the e-commerce boom brought on by the pandemic.<p>One solution to the problem is autonomous trucks, and several companies are in a race to be the first to launch one. Among them is San Diego-based TuSimple.\nFounded in 2015, TuSimple has completed about 2 million miles of road tests with its 70 prototype trucks across the US, China and Europe. Although these are simply commercially available trucks retrofitted with its technology, TuSimple has deals in place with two of the world&#x27;s largest truck manufacturers -- Navistar in the US and Traton, Volkswagen&#x27;s trucking business, in Europe -- to design and build fully autonomous models, which it hopes to launch by 2024.",
      "time": 1643867387,
      "title": "There's a shortage of truckers, but TuSimple thinks it has a solution",
      "type": "story"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 30189133,
      "score": 1,
      "time": 1643867258,
      "title": "Serenity OS with Andreas Kling – CoRecursive Podcast",
      "type": "story",
      "url": "https://corecursive.com/serenity-os-with-andreas-kling/"
    },
    {
      "by": "noduerme",
      "descendants": 0,
      "id": 30189132,
      "score": 2,
      "time": 1643867216,
      "title": "Did China benefit from Covid-19?",
      "type": "story",
      "url": "https://www.taipeitimes.com/News/editorials/archives/2021/06/15/2003759179"
    },
    {
      "by": "ravipatel1",
      "descendants": 0,
      "id": 30189082,
      "score": 1,
      "text": "A special task force in Brazil is conducting raids deep in the Amazon, in a new crack-down against what they call ‘blood gold’ mining.<p>Mining in territories that are supposed to be protected by law is destroying the lives of indigenous people, and wreaking havoc on the environment.<p>The UK is the third biggest buyer of Brazilian gold, and public prosecutors have alleged that 30% of Brazil’s exports may be illegally mined.<p>The BBC was given exclusive access to film a rare special forces operation. The identities of some of the operatives have been protected.",
      "time": 1643866717,
      "title": "The illegal Brazilian gold you may be wearing",
      "type": "story"
    },
    {
      "by": "ravipatel1",
      "descendants": 0,
      "id": 30189081,
      "score": 1,
      "text": "Russia has condemned a US decision to send extra troops to Europe to support its Nato allies amid continuing fears of a Russian invasion of Ukraine.<p>Moscow said it was a &quot;destructive&quot; step which heightened tension and reduced the scope for a political solution.<p>The Pentagon said 2,000 US troops would be sent from North Carolina to Poland and Germany, and a further 1,000 already in Germany would go to Romania.<p>Russia has some 100,000 troops near Ukraine. It denies planning to invade.<p>The tensions come eight years after Russia annexed Ukraine&#x27;s southern Crimea peninsula and backed a bloody rebellion in the eastern Donbas region.<p>Moscow accuses the Ukrainian government of failing to implement the Minsk agreement - an international deal to restore peace to the east, where Russian-backed rebels control swathes of territory and at least 14,000 people have been killed since 2014.",
      "time": 1643866668,
      "title": "Ukraine tensions: Russia condemns 'destructive' US troops boost in Europe",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30189080,
      "score": 1,
      "time": 1643866658,
      "title": "Americans Can’t Quit SMS",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/02/technology/sms-whatsapp.html"
    },
    {
      "by": "sreekars",
      "descendants": 0,
      "id": 30189060,
      "score": 1,
      "time": 1643866418,
      "title": "How to find a planet you can’t see",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=STsI6IbPbGQ"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 30189056,
      "score": 1,
      "time": 1643866378,
      "title": "I Swapped My Reading Glasses for Magical Eyedrops",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/02/well/live/vuity-eyedrops-reading-glasses.html"
    },
    {
      "by": "sam345",
      "descendants": 0,
      "id": 30189051,
      "score": 1,
      "time": 1643866329,
      "title": "2U, Inc. and EdX Combine",
      "type": "story",
      "url": "https://press.edx.org/2u-inc.-and-edx-complete-industry-redefining-combination"
    },
    {
      "by": "ido",
      "descendants": 0,
      "id": 30189036,
      "score": 1,
      "text": "Until windows XP and Mac OS X mainstream OSs (windows 3.x&#x2F;9x, classic Mac, maybe you can even consider amiga at a stretch) didn’t have memory protection, were (even more) insecure, unstable, crashes and freezes happened multiple times per day, multitasking was flaky (I remember playing an mp3 would make my computer stutter in other tasks in win98 even on a then-new Pentium 4).<p>Why did it take so long to get the mass market&#x2F;mainstream systems “modern” when BSD&#x2F;Linux managed to do it in the mid 90s and commercial Unix did it in the 70s? Microsoft did release NT in the 90s but didn’t market it to the consumer market until XP in 2001.",
      "time": 1643866148,
      "title": "Ask HN: Why did it take until 2001 for mainstream OSs to get secure/stable?",
      "type": "story"
    }
  ]
}