{
  "stories": [
    {
      "by": "datancoffee",
      "descendants": 0,
      "id": 28735343,
      "score": 1,
      "time": 1633247365,
      "title": "Top Ukrainian Growth Stage Startups",
      "type": "story",
      "url": "https://ucluster.org/en/school-of-startups/top-ukrainian-startups-growth-stages/"
    },
    {
      "by": "sofixa",
      "descendants": 0,
      "id": 28735338,
      "score": 1,
      "time": 1633247238,
      "title": "The CIA’s Kabul base, burned out and abandoned in haste",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/oct/03/inside-the-cias-secret-kabul-base-burned-out-and-abandoned-in-haste"
    },
    {
      "by": "viebel",
      "descendants": 0,
      "id": 28735326,
      "score": 1,
      "time": 1633247117,
      "title": "Polymorphism Without Objects via Multimethods",
      "type": "story",
      "url": "https://blog.klipse.tech/javascript/2021/10/02/multimethod.html"
    },
    {
      "by": "phreeza",
      "descendants": 0,
      "id": 28735314,
      "score": 2,
      "time": 1633246986,
      "title": "Acetaminophen use during pregnancy and offspring ADHD",
      "type": "story",
      "url": "https://acamh.onlinelibrary.wiley.com/doi/10.1002/jcv2.12020"
    },
    {
      "by": "dsr12",
      "descendants": 0,
      "id": 28735293,
      "score": 1,
      "time": 1633246685,
      "title": "The 2k-year-old airborne disease theory that blinded Covid experts",
      "type": "story",
      "url": "https://www.telegraph.co.uk/global-health/science-and-disease/every-medical-authority-failed-realise-covid-airborne-late/"
    },
    {
      "by": "misterdata",
      "descendants": 0,
      "id": 28735285,
      "score": 1,
      "time": 1633246615,
      "title": "Automerge: A JSON-like CRDT that can be modified concurrently and merged again",
      "type": "story",
      "url": "https://github.com/automerge/automerge"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28735254,
      "score": 1,
      "time": 1633246370,
      "title": "Ghost Driver – JavaScript Implementation of WebDriver Protocol for PhantomJS",
      "type": "story",
      "url": "https://github.com/detro/ghostdriver"
    },
    {
      "by": "catsarebetter",
      "descendants": 0,
      "id": 28735253,
      "score": 3,
      "time": 1633246351,
      "title": "Show HN: I'm Working on an API for Interactive Coding Interviews",
      "type": "story",
      "url": "https://codeinterviewapi.notion.site/codeinterviewapi/CodeInterviewAPI-a2598bb2c0f941158260e38ccce27000"
    },
    {
      "by": "skwee357",
      "descendants": 0,
      "id": 28735226,
      "score": 2,
      "text": "I&#x27;ve read every possible thread here and in Reddit regarding Electron. I&#x27;m perfectly aware of the drawbacks and reasons people hate Electron. But nevertheless lets bring this topic one more time and this time try to focus on a real example (mine) rather than hypothetical discussion.<p>I have an idea for an application. It a desktop application. So I&#x27;m not porting it from web app nor I plan to make it a web app any time in the future. It being a desktop app is my first selling point.<p>My second selling point is it being as snappy and as productive as possible. Therefore I try to focus much on keyboard shortcuts, intuitive UI&#x2F;UX (even though its incredibly hard for me since I&#x27;m a developer and not UI&#x2F;UX engineer).<p>I&#x27;m perfectly aware of proper separation between business logic and presentation layer, know how to use FFI, IPC and other methods to call from UI to a shared BL.<p>And last but not least - I&#x27;m a solo developer. With 0$ funding. Doing this in my free time and eager to make money from it and reach as bigger audience as possible.<p>Now, given all that, lets try to evaluate my options.<p>1) Non native cross platform frameworks. This includes QT, JavaFX&#x2F;Swing, Flutter and others. While they are probably more snappier than Electron apps, you can&#x27;t really call them native. A lot of the criticism of Electron in terms of UI&#x2F;UX, can be directed at those as well.<p>2) Native. This means I need to develop at least 2 different UIs to capture 98% of the market, and being a former Linux user and understanding the struggle of lack of good apps in Linux, I can&#x27;t ignore that platform. So 3 times the development time, 3 times the bug fixes, 3 times the support.<p>3) Electron. We all know this one.<p>While I agree that big companies like Slack, Microsoft or Spotify can (and should) invest money in proper app development for each platform; solo developers like me, rarely have the luxury to do so. So I&#x27;m left with either choosing one platform to focus on (in my case its Mac since I&#x27;m a Mac user) and ignoring all others (at least for now) or settle on semi-native solutions.<p>I&#x27;m a perfectionist and I have a vision. But because I&#x27;m a power user, doesn&#x27;t mean everybody else is like me. So to all the people who say that Electron is not native and breaks their UI&#x2F;UX - is this really an issue among non power users, or is it just us, developers, being frustrated (and I share this frustration) over minor issues like keyboard shortcuts or lack of native Mac text fields?",
      "time": 1633245947,
      "title": "Is Electron That Bad?",
      "type": "story"
    },
    {
      "by": "bpsagar",
      "descendants": 0,
      "id": 28735225,
      "score": 1,
      "time": 1633245940,
      "title": "Getting started with writing a simple recursive program",
      "type": "story",
      "url": "https://bpsagar.substack.com/p/getting-started-with-writing-a-simple"
    }
  ]
}