{
  "stories": [
    {
      "by": "thejokersthief",
      "descendants": 0,
      "id": 27880890,
      "score": 1,
      "time": 1626689999,
      "title": "A quick guide to Stripe’s culture",
      "type": "story",
      "url": "https://stripe.com/en-ie/jobs/culture"
    },
    {
      "by": "sibilsalim",
      "descendants": 0,
      "id": 27880866,
      "score": 1,
      "time": 1626689746,
      "title": "TechCrunch - The end of open source?",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/18/the-end-of-open-source/"
    },
    {
      "by": "vitabenes",
      "descendants": 0,
      "id": 27880862,
      "score": 1,
      "time": 1626689719,
      "title": "Watch 1k illegal Bitcoin PCs get literally steamrolled, experience justice",
      "type": "story",
      "url": "https://www.pcgamer.com/au/watch-1000-illegal-bitcoin-pcs-get-literally-steamrolled-experience-justice/"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 27880856,
      "score": 1,
      "time": 1626689639,
      "title": "Biden Administration Transfers Its First Detainee from Guantánamo Bay",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/19/us/politics/guantanamo-bay-detainee-released.html"
    },
    {
      "by": "fernand0moreira",
      "descendants": 0,
      "id": 27880846,
      "score": 1,
      "text": "So, how did we at Angry Ventures create ANDY, a technological product in 8 hours?\nThe context is nice, we created this technological product on a Friday, on the day of a retreat. There was in 2020 a retreat that we did in October, of 5 or 6 days, and there was a day we took just to make a technological product, and we realized that there was an opportunity that gave birth to ANDY.\nHow did we do this?\nSo basically, in 8 hours we defined a map, an agenda, with a set of dynamics that helped us reach a certain intention, and the final intention would be to reach a kind of MVO, a kind of Minimum Viable Offer, that helped us solve a problem or helped us solve something.\nWe started this marathon, so to speak, of attempting innovation with a dynamic that we named Q&amp;Angry Shotgun. This dynamic had a time of 15 minutes and basically, we asked people silly things, and made people animate their most subjective brain, the right side of their brain, where is everything that is silly, where is everything that is creativity, intuition, art, creation, let’s say so. And we started asking people things like “if you were a vegetable, what would you be?”, “if you were an item or a kitchen utensil, what would you do?”, “if you could be a specific time of day, what would you choose?”, “if you could be a chocolate brand, what brand would you be?”, “if you could change your name, what name would you choose?”. And all these questions made us, in a very quick way, stay in a much more subjective paradigm, much more creative, much more peaceful, which animates the parasympathetic much more than if we came to a room and asked, “give me 10 ideas to solve the problem of our economy”.<p>Because basically, we need to blur our minds to better focus, what we need to learn to swim is to gently almost drown. And then we start with this Q&amp;Angry Shotgun, which is already a dynamic that we do in our daily life. There is even a blog post on the Angry Ventures blog on this topic. Basically, it’s a weekly question we ask everyone, and it’s also usually a very silly question, where we ask everyone and then everyone answers as well. We are already on Q&amp;Angry 170&#x2F;180, we do one every week.\nSo, we started with this dynamic, which has to be done quickly, that is, when the facilitator asks something, the answer has to be given in 1 or 2 seconds, it’s the first thing that comes to mind. The facilitator always must exist in this project, in this case it was me, but it could be anyone else. Then, in 15 minutes and in groups of 2, we made a second dynamic, which we named How Might We?<p>Read full article here: https:&#x2F;&#x2F;www.fernandomoreira.me&#x2F;how-to-make-a-product-in-a-day&#x2F;",
      "time": 1626689552,
      "title": "How to Make a Product in a Day",
      "type": "story"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 27880788,
      "score": 1,
      "time": 1626688769,
      "title": "A bug's life: Millimeter-tall mountains on neutron stars",
      "type": "story",
      "url": "https://phys.org/news/2021-07-bug-life-millimeter-tall-mountains-neutron.html"
    },
    {
      "by": "dnetesn",
      "descendants": 0,
      "id": 27880779,
      "score": 1,
      "time": 1626688638,
      "title": "In Plain Sight: How waste might help us find the mysterious Velella",
      "type": "story",
      "url": "http://oceans.nautil.us/feature/715/hidden-in-plain-sight"
    },
    {
      "by": "andreacavagna",
      "descendants": 1,
      "id": 27880776,
      "kids": [
        27880789
      ],
      "score": 1,
      "time": 1626688576,
      "title": "Next Billion-Dollar Enterprise Software Companies Will Be Born Outside the US",
      "type": "story",
      "url": "https://www.forbes.com/sites/glennsolomon/2021/07/12/why-the-next-billion-dollar-enterprise-software-companies-will-be-born-outside-the-us/"
    },
    {
      "by": "errozero",
      "descendants": 1,
      "id": 27880749,
      "kids": [
        27880813
      ],
      "score": 3,
      "time": 1626688175,
      "title": "China’s Tencent agrees to buy UK video games firm Sumo for more than £900m",
      "type": "story",
      "url": "https://www.theguardian.com/business/2021/jul/19/china-tencent-uk-video-games-developer-sumo"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 27880741,
      "score": 1,
      "time": 1626688103,
      "title": "Precision-Guided Munition",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Precision-guided_munition"
    }
  ]
}