{
  "stories": [
    {
      "by": "MonkeyClub",
      "descendants": 0,
      "id": 30612019,
      "score": 1,
      "time": 1646812788,
      "title": "The toddler’s introduction to Heap exploitation (Part 1)",
      "type": "story",
      "url": "https://valsamaras.medium.com/the-toddlers-introduction-to-heap-exploitation-part-1-515b3621e0e8"
    },
    {
      "by": "revathskumar",
      "descendants": 0,
      "id": 30612018,
      "score": 1,
      "time": 1646812785,
      "title": "Truecaller’s success banks on India’s inadequate privacy laws",
      "type": "story",
      "url": "https://caravanmagazine.in/technology/truecaller-data-consent-india-privacy-laws"
    },
    {
      "by": "wdaareg",
      "descendants": 0,
      "id": 30612003,
      "score": 2,
      "text": "Good morning everyone! My co-founder and I recently moved to the UK after working at Robinhood for over 5 years. We were stunned at the fees it was costing us to move money across borders with existing fintech solutions, so we decided to start Atlantic Money - the world’s first fixed fee (with no FX markup) money transfer product. For £3 you can transfer up to £1M. Let us know if you have any questions!",
      "time": 1646812710,
      "title": "Show HN: World’s first £3 flat fee (0% FX markup) money transfer service",
      "type": "story",
      "url": "https://atlantic.money"
    },
    {
      "by": "CaptainZapp",
      "descendants": 0,
      "id": 30611993,
      "score": 1,
      "time": 1646812625,
      "title": "Stop Making Sense: Refusing the Algorithmic City",
      "type": "story",
      "url": "https://failedarchitecture.com/stop-making-sense-refusing-the-algorithmic-city/"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30611988,
      "score": 1,
      "time": 1646812606,
      "title": "Linux Lands Mitigations for Spectre-BHB / BHI on Intel and Arm, AMD Changes",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=Spectre-BHI-Linux-Mitigations"
    },
    {
      "by": "nav",
      "descendants": 0,
      "id": 30611982,
      "score": 1,
      "time": 1646812549,
      "title": "The History of Work in India",
      "type": "story",
      "url": "https://khoobgroup.medium.com/the-history-of-work-in-india-4a63e153525a"
    },
    {
      "by": "vanilla-almond",
      "descendants": 0,
      "id": 30611946,
      "score": 1,
      "time": 1646812179,
      "title": "How reliant is the world on Russia for oil and gas?",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/58888451"
    },
    {
      "by": "fredrb",
      "descendants": 2,
      "id": 30611900,
      "kids": [
        30611996,
        30611922
      ],
      "score": 1,
      "text": "I&#x27;m trying to figure out what are the classic books and authors on the topic. There seems to be a plethora of books on climate and energy out there and every blog recommends a completely different list. As I&#x27;m not that familiar with the topic, I&#x27;m ideally looking for a book that gives an overview of the different types of energy and their practicality.",
      "time": 1646811570,
      "title": "Ask HN: Book recommendations for renewable energy and climate change?",
      "type": "story"
    },
    {
      "by": "bugg3d",
      "descendants": 0,
      "id": 30611877,
      "score": 1,
      "text": "Hey everyone, \nI was wondering if anyone would be interested in trying out a project I have been working on for the past 2,5 years (www.mealsafari.com). I haven&#x27;t opened registration to the public just yet so if you want to try the logged in features, just send me a quick message through the contact form on the site with an emailaddress and a preferred username and I&#x27;ll set up an account for you.<p>Feel free to use a throwaway email, for now you just need access to it for the activation link and password resets.<p>Pain points I am trying to address:\n   - Not having to scroll through miles of life stories before getting to the recipe contents\n   - Easy alteration of recipes&#x2F;menus from other users to suit your own likes (say you don&#x27;t like an ingredient in a recipe, you can use that recipe as a base to create a variation)\n   - Easy creation of meal plans by using your own and others&#x27; recipes and menus as building blocks\n   - Minimal to none dark patterns and annoying popups&#x2F;surveys&#x2F;newsletters<p>Background: Initially I was going to make a small website (which quite frankly could have been an excel sheet) to store my moms collection of recipes. The idea was to be able to randomly select a recipe when we just couldn&#x27;t decide what to cook. I guess my curiosity got the better of me and it ended up being one of my bigger projects so far, learning tons about IT infrastructure, devops and web development (mainly Drupal).<p>I would be more than happy for any feedback!",
      "time": 1646811229,
      "title": "Feedback on yet another recipe and mealplanning website",
      "type": "story"
    },
    {
      "by": "0xedb",
      "descendants": 1,
      "id": 30611859,
      "kids": [
        30611998
      ],
      "score": 12,
      "time": 1646811056,
      "title": "Endurance: Shackleton's lost ship is found in Antarctic",
      "type": "story",
      "url": "https://www.bbc.com/news/science-environment-60662541"
    }
  ]
}