{
  "stories": [
    {
      "by": "notoriousarun",
      "descendants": 0,
      "id": 31683554,
      "score": 1,
      "time": 1654793335,
      "title": "Treat everyone like children, especially yourself",
      "type": "story",
      "url": "https://steli.substack.com/p/treat-everyone-like-children-especially"
    },
    {
      "by": "nguggia1",
      "descendants": 0,
      "id": 31683526,
      "score": 1,
      "text": "Startups — It’s difficult to attract talent when nobody knows who in the hell you are, what you do, who it’s for, and why those people care, to begin with.<p>Skilled workers need a reason to:<p>Raise their hand and ask you for something. \nAccept a conversation request.\nBe curious enough to read a job description. \nTake the few (or 20) steps to make it to your careers site.\nClick the apply button.<p>Before getting into this, let’s take a step back and look at how workers and companies meet:<p>Job descriptions aren’t marketing material. They aren’t attraction pieces. Something else happens first that peaks a person&#x27;s curiosity enough that they feel compelled to give a JD a look-see or agree to a conversation with a recruiter or hiring manager.<p>That something else could be (amongst many things):<p>A social post from someone at your company.\nA referral.\nA personal introduction.\nA product ad.\nA recommendation from a peer.\nAn article mentioning your company’s name.\nA podcast mention.\nA thoughtfully written message from someone at your company.<p>The list of micro influences goes on…<p>This means that within the context of marketing your company, your job, your product, and your ideas to workers, you need to spend more time thinking about creating the “something else&#x27;s” that happen first. Without them, we (your labor market) don’t know who you are, what you make, who it’s for, and why those people care.<p>And as a result, we don’t care either.<p>———<p>If you want to create an asset or set of assets that will help market your company to talent, I’ve included a link to a doc with a sample set of interview questions that we ask teams when creating video content for them at BYA.<p>Tactically – Questions like this can be used to create a simple FAQ in a Google doc or Notion page or applied more creatively as prompts for hosted video interviews or blog posts<p>Yes, we did a lot of research in order to come up with these questions. Yes, I’m giving them away in hopes that companies will start creating better recruiting content.<p>Hope this gets your wheels turning.<p>Note: Although some of these questions are specific to technical teams and leadership, they can easily be tweaked for sales, marketing, and other niche corners of the labor market. We’ve come up with several hundred questions across most functions. This is just scratching the surface.<p>Questions doc:<p>https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1xbb0EwzzR9OHItf0vdLj6VB_v724yFS29XUYE-ixOOc&#x2F;edit",
      "time": 1654793241,
      "title": "What Do You Make, Who Is It For, and Why Do They Care?: How Startups Win Talent",
      "type": "story"
    },
    {
      "by": "mu_mu",
      "descendants": 0,
      "id": 31683523,
      "score": 1,
      "text": "Hey folks. I&#x27;m in my early 30s and I&#x27;ve been working as a software engineer for a while. At this point, I have come to realize that I&#x27;m not bad at my job, but I&#x27;d like to do something else at least for a little bit.<p>Any software engineers who have pivoted into something else (non-tech or tech-adjacent) want to share?<p>I&#x27;m good at learning new things, curious about many things, and I&#x27;d like to try something different. Thanks for sharing!",
      "time": 1654793233,
      "title": "Ask HN: Ex-SWE, have you pivoted into doing something else?",
      "type": "story"
    },
    {
      "by": "JoshuaRedmond",
      "descendants": 0,
      "id": 31683513,
      "score": 1,
      "time": 1654793197,
      "title": "New release brings Mesh to MetaHuman",
      "type": "story",
      "url": "https://www.unrealengine.com/en-US/blog/new-release-brings-mesh-to-metahuman-to-unreal-engine-and-much-more"
    },
    {
      "by": "gavinray",
      "descendants": 0,
      "id": 31683485,
      "score": 2,
      "time": 1654793089,
      "title": "Kotlin 1.7 Released",
      "type": "story",
      "url": "https://blog.jetbrains.com/kotlin/2022/06/kotlin-1-7-0-released/"
    },
    {
      "by": "ZeljkoS",
      "descendants": 0,
      "id": 31683480,
      "score": 1,
      "time": 1654793068,
      "title": "Eurozone interest rates set to rise for first time in 11 years",
      "type": "story",
      "url": "https://www.bbc.com/news/business-61749090"
    },
    {
      "by": "Schiphol",
      "descendants": 0,
      "id": 31683468,
      "score": 1,
      "time": 1654793000,
      "title": "Fixing the Good Regulator Theorem (2019)",
      "type": "story",
      "url": "https://www.alignmentforum.org/posts/Dx9LoqsEh3gHNJMDk/fixing-the-good-regulator-theorem"
    },
    {
      "by": "plmpsu",
      "descendants": 0,
      "id": 31683426,
      "score": 2,
      "time": 1654792836,
      "title": "Tixati BitTorrent Client",
      "type": "story",
      "url": "https://www.tixati.com"
    },
    {
      "by": "JPLeRouzic",
      "descendants": 0,
      "id": 31683425,
      "score": 1,
      "time": 1654792835,
      "title": "Lilo, the Search Engine with Substance",
      "type": "story",
      "url": "https://www.lilo.org/qui-est-lilo/"
    },
    {
      "by": "mzs",
      "descendants": 0,
      "id": 31683414,
      "score": 1,
      "time": 1654792802,
      "title": "Axial Higgs mode detected by quantum pathway interference in RTe₃",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-022-04746-6"
    }
  ]
}