{
  "stories": [
    {
      "by": "pierrebeaucamp",
      "descendants": 0,
      "id": 28023446,
      "score": 1,
      "time": 1627786758,
      "title": "LinkBack: Editable objects across macOS apps",
      "type": "story",
      "url": "http://linkbackproject.org/about/"
    },
    {
      "by": "fortran77",
      "descendants": 1,
      "id": 28023368,
      "kids": [
        28023462
      ],
      "score": 2,
      "time": 1627785651,
      "title": "Engine-Powered Pogo Sticks, the Hop Rod",
      "type": "story",
      "url": "https://www.spaco.org/MachineShop/hoprod.htm"
    },
    {
      "by": "OmarShehata",
      "descendants": 0,
      "id": 28023362,
      "score": 2,
      "time": 1627785588,
      "title": "Creating a DOOM-inspired aesthetic with PlayCanvas – an interactive article",
      "type": "story",
      "url": "https://omarshehata.me/html/playcanvas-horror-aesthetic/"
    },
    {
      "by": "amitheonlyone",
      "descendants": 1,
      "id": 28023345,
      "kids": [
        28023448
      ],
      "score": 2,
      "text": "I was looking for a multi-purpose laptop for some light gaming and also Android and Web development. I have been searching for a while, but with a tight budget, I finally found a gaming laptop with specs:\n- Ryzen 5 4600H\n- 16GB RAM\n- 512 GB SSD\n- NVIDIA GTX 1650 (4GB)\n- 120Hz Display\n- Windows 10<p>Now two things I didn&#x27;t like was the weight at 2.2kg and screen size 15&quot;.\nI&#x27;d have like to have a 14&quot; screen and weight around 1.5kg. There&#x27;s a kind of business variant of this laptop which has an Intel i5 11th gen chip without the NVIDIA graphics and costs around the same. The advantage is that is it is 1.7kg.<p>I have been primarily using Linux for around 2 years now, so I do plan to dual boot Linux at the minimum. So I am worried about Ryzen compatibility. Can the HN crowd please give your opinion on whether the specs is ok for my use or I should look at something else?<p>I&#x27;ve posted about buying a laptop before but my budget didn&#x27;t let me purchase it before.<p>The laptop I was looking at: https:&#x2F;&#x2F;www.amazon.in&#x2F;dp&#x2F;B096SKGTCG&#x2F;ref=cm_sw_r_cp_apa_glt_fabc_55E34DY0PP1WZ0NFG277",
      "time": 1627785341,
      "title": "Ask HN: Ryzen 5 Gaming laptop for development",
      "type": "story"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 28023336,
      "score": 1,
      "time": 1627785279,
      "title": "New evidence: Gus Grissom didn't accidentally sink his own spacecraft in 1961",
      "type": "story",
      "url": "https://www.airspacemag.com/daily-planet/new-evidence-shows-gus-grissom-did-not-accidentally-sink-his-own-spacecraft-sixty-years-ago-180978240/"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 28023316,
      "score": 1,
      "time": 1627785095,
      "title": "What every compiler writer should know about programmers [pdf]",
      "type": "story",
      "url": "http://c9x.me/compile/bib/ubc.pdf"
    },
    {
      "by": "oftenwrong",
      "descendants": 0,
      "id": 28023291,
      "score": 1,
      "time": 1627784896,
      "title": "RFC 3339 vs. ISO 8601",
      "type": "story",
      "url": "https://ijmacd.github.io/rfc3339-iso8601/"
    },
    {
      "by": "9woc",
      "descendants": 1,
      "id": 28023288,
      "kids": [
        28023293
      ],
      "score": 1,
      "time": 1627784886,
      "title": "Snyk Open Source Advisor – Snyk",
      "type": "story",
      "url": "https://snyk.io/advisor/"
    },
    {
      "by": "fouc",
      "descendants": 1,
      "id": 28023279,
      "kids": [
        28023325,
        28023376
      ],
      "score": 4,
      "text": "* To be clear, I&#x27;m talking about forced auto-upgrades that give no option to downgrade.<p>The right to repair is mostly about hardware.  But it&#x27;s hard to ignore the software part of hardware.  And that means having the right to keep and run old versions of software.  Old software that work perfectly fine and do their job.<p>Forced auto-upgrades are fundamentally hostile to the user&#x27;s freedoms.   Ever since the browsers introduced forced auto-upgrades, we&#x27;ve been moving away from an open web to an internet of closed silos.<p>Forced auto-upgrades is often justified in the name of security.  It&#x27;s not worth it.  The &quot;good intention&quot; of improving security through forced auto-upgrades is pushing us down the road to hell.<p>In a way, we developers are responsible for all of this. We all jumped on the Chrome bandwagon, we all told our friends &amp; families to use Chrome, we all enjoyed the reduced browser market fragmentation after the forced auto-upgrades were introduced.  We loved not having to support old browsers anymore.  We loved being able to use the latest and greatest browser features.  We get angry because Safari is &quot;holding us back&quot;.<p>But at what cost?<p>Developing for work &amp; for money might&#x27;ve become easier, but what about developing for yourself? As a power user, in control over your own computer?  The internet has been getting more and more hostile to alternative ways of interaction, especially as browser market share turns into a monoculture.<p>We need to encourage more market fragmentation across software - including browser versions and OS versions.  We need to fight against the &quot;winner take all&quot; distribution that we seem to have a tendency to encourage.  We need to fight against everyone jumping onto the same bandwagons.  We need more smaller bandwagons, not a few huge ones.  We need to stop centralizing around the most popular choices.   The popular choice is the lazy choice, and we need to stop encouraging that kind of laziness.  It only hurts us all in the long run.<p>We need to make it easier to use old software.  This pressure to constantly upgrade all software is also leaving many good software behind.  Old software that worked great in their particular milieu.<p>One of the dreams of VMs was to be able run all sorts of old software any time, safely, securely, in their own perfect environment &amp; dependencies.  When is that going to become a common &amp; easy thing to do?",
      "time": 1627784831,
      "title": "Ask HN: Should forced auto-upgrades be made illegal in a right to repair world?",
      "type": "story"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28023277,
      "score": 1,
      "time": 1627784823,
      "title": "Researchers find gaps in clinical trial data sharing",
      "type": "story",
      "url": "https://medicalxpress.com/news/2021-07-gaps-clinical-trial.html"
    }
  ]
}