{
  "stories": [
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 28271349,
      "score": 1,
      "time": 1629681233,
      "title": "'ShotSpotter' employee deposition raises questions in Pittsburgh police shooting",
      "type": "story",
      "url": "https://apnews.com/article/technology-police-shootings-8eb8e7fcae21aa86637ccfe642e99b38"
    },
    {
      "by": "poletopole",
      "descendants": 0,
      "id": 28271293,
      "kids": [
        28271308
      ],
      "score": 1,
      "text": "I’m not sure Q&#x2F;A analyst is quite the correct term for the position I’m interested in, but I was technically a Q&#x2F;A dev for about three months at one place I worked, the first one actually. After 15 years in the industry I realized that I could care less about “making” things; all I care about is “fixing” things. In other words, I’m only interested in pure problem solving, such as fixing bugs—the harder the bug, the better. But I’m not sure this is all Q&#x2F;A roles do exactly in practice, so before I apply to a position, it makes sense to understand what I would actually be doing, day to day.<p>In a perfect world, I would be content and at home if all I did was clear out the bug backlog and nothing else. I don’t want to “maintain” software, I don’t want to “build” software, I certainly do not want to be “rockstar” messiah.<p>I’m really not the best judge of code quality to be honest, it’s way too political a subject in my opinion. Once the puzzle is solved, I could care less about the quality of software in general, and move on to the next mystery. As a typical engineer, I found myself at odds, on one hand developing software from end to end satisfied my creative side, but I always found myself over engineering things. Eventually I got fired for this reason, after eight years at a company I helped build, because I was only interested in getting to the root problem of software in general, not the task at hand. Furthermore, I became furious when I was asked to solve the same bug twice, and realized that I was working in a feature factory, yet I was always the person everyone turned to last, when all else failed, but always the first person to blame for not doing my job. There was never a bug I couldn’t and didn’t solve—my track record was flawless.<p>Now, I look back to that Q&#x2F;A position, and ask myself had that not literally been my first job as a developer, would my life be any different. I haven’t written a single line of code in a year and half. I’m not sure how I could justify the past year or so during during an interview other than that I learned that software is a losing battle and a cause that has lost its way. I may be better suited in another industry such as mathematics, but for the meantime, I don’t mind occupying a company’s underworld as satan, damned to blasphemy, doing thankless work the rockstar gurus are too important to do. Credit doesn’t matter to me anymore, I’m not even in it for the money, it’s simply a matter of principle. So long as I get paid to solve a problem and not code one, that’s all I ask.",
      "time": 1629680732,
      "title": "Ask HN: What is a day in the life of a Q/A role like?",
      "type": "story"
    },
    {
      "by": "zdw",
      "descendants": 0,
      "id": 28271288,
      "score": 1,
      "time": 1629680668,
      "title": "Conditionally Setting Your Gitconfig",
      "type": "story",
      "url": "https://utf9k.net/blog/conditional-gitconfig/"
    },
    {
      "by": "momentum_j",
      "descendants": 0,
      "id": 28271284,
      "score": 1,
      "time": 1629680649,
      "title": "Mental models to flex your mind",
      "type": "story",
      "url": "https://www.theschoolofmomentum.com/post/20-mental-models-to-flex-your-mind"
    },
    {
      "by": "omarfarooq",
      "descendants": 0,
      "id": 28271227,
      "score": 1,
      "time": 1629680076,
      "title": "The Trip Treatment",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2015/02/09/trip-treatment"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 28271199,
      "score": 1,
      "time": 1629679745,
      "title": "SEC vs. Ripple: Bombshells in deposition pave the way for win on Fair Notice",
      "type": "story",
      "url": "https://financefeeds.com/sec-v-ripple-bombshells-deposition-pave-way-win-fair-notice-says-expert/"
    },
    {
      "by": "nnx",
      "descendants": 0,
      "id": 28271174,
      "score": 1,
      "time": 1629679455,
      "title": "All the Biomass of Earth, in One Graphic",
      "type": "story",
      "url": "https://www.visualcapitalist.com/all-the-biomass-of-earth-in-one-graphic/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28271170,
      "score": 1,
      "time": 1629679428,
      "title": "Nvidia's takeover of Arm raises serious concerns, says watchdog",
      "type": "story",
      "url": "https://www.bbc.com/news/business-58284204.html"
    },
    {
      "by": "aktarus",
      "descendants": 1,
      "id": 28271160,
      "kids": [
        28271161
      ],
      "score": 1,
      "time": 1629679310,
      "title": "2021 Was the Year of Italy",
      "type": "story",
      "url": "https://www.ircwebnet.com/2021/08/23/2021-lanno-dellitalia-che-vince-tutto/"
    },
    {
      "by": "smackeyacky",
      "descendants": 0,
      "id": 28271144,
      "score": 2,
      "time": 1629679121,
      "title": "Cincom VisualWorks Smalltalk doing something useful",
      "type": "story",
      "url": "https://smackeyacky.blogspot.com/2021/08/cincom-visualworks-smalltalk-doing.html"
    }
  ]
}