{
  "stories": [
    {
      "by": "readonthegoapp",
      "descendants": 0,
      "id": 30597498,
      "score": 1,
      "text": "I know there were myriad people over the past 20 years who were calling all the NATO expansion decisions disastrous and very likely to lead to war and even world war, but I&#x27;m more interested in real and recent actual predictions of whether Russia was going to attack and&#x2F;or invade (a more serious commitment to your strategic goals).<p>Were there any analysts, historians, stock traders, redditors, HNers, conventional or AI systems, tarot card readers, shamans, etc. who correctly predicted that Russia would attack -- invade -- Ukraine &#x27;in the next three&#x27; months or similar?<p>There are plenty of sports analysts on ESPN, for example, who will say things like:<p>&gt; If Lebron plays like an MVP, they will likely win the chip. But if Lebron plays like less than an MVP, then they might not win it all. But maybe not either or both.<p>Highly qualified &#x27;nothing&#x27; statements like this are not interesting.<p>I&#x27;m talking about someone who publicly staked their reputation on their prediction -- someone who was so convinced of their correctness and the soundness of the facts of the case and the competing interests and dynamics -- that they were willing to actually say it out loud and&#x2F;or in print.<p>To me, now, looking back on it, it seems completely predictable -- and I feel like it only took me fifteen minutes to learn the relevant background and come to this conclusion -- which suggests to me that most serious analysts would have had to have been pretty confident (&gt;90%) that this invasion would happen. In other words, any serious analyst should have predicted this.<p>On a side note, I do think it&#x27;s funny how I, upon knowing about the Russian buildup on the Ukrainian border, and paid some attention to it, would not have immediately declared publicly and loudly, &quot;They&#x27;re going to invade you&#x2F;we **** idiots! We have to do something!&quot;<p>I think back to WWII and similar scenarios when you read about troop&#x2F;border buildups and think, &quot;Gosh -- how asleep&#x2F;gullible did the whole world have to be to _not_ understand what was happening? IDIOTS.&quot;<p>Well, now I&#x27;m one of those who was too asleep &#x2F; gullible &#x2F; IDIOTIC.<p>And I think if we&#x27;re being honest, that&#x27;s probably 99% of the world or more.",
      "time": 1646725661,
      "title": "Ask HN: Did any one or any thing predict the Russian invasion of Ukraine?",
      "type": "story"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 30597496,
      "score": 1,
      "time": 1646725654,
      "title": "Second Russian general killed in war, Ukraine says",
      "type": "story",
      "url": "https://www.reuters.com/world/europe/second-russian-general-killed-war-ukraine-says-2022-03-08/"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 30597470,
      "score": 1,
      "time": 1646725454,
      "title": "Erotetics",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Erotetics"
    },
    {
      "by": "heyhihello",
      "descendants": 0,
      "id": 30597462,
      "score": 1,
      "time": 1646725425,
      "title": "Understand Entropy in One Chart",
      "type": "story",
      "url": "https://observablehq.com/@jwilber/entropy-is-easy"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30597460,
      "score": 1,
      "time": 1646725415,
      "title": "Brent Crude",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Brent_Crude"
    },
    {
      "by": "yread",
      "descendants": 0,
      "id": 30597452,
      "score": 1,
      "time": 1646725347,
      "title": "China Construction Bank Unit Gets Extension on LME Metal Margin Calls",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-03-08/china-construction-bank-unit-gets-reprieve-on-metal-margin-calls"
    },
    {
      "by": "jka",
      "descendants": 0,
      "id": 30597440,
      "score": 1,
      "time": 1646725251,
      "title": "UN FAO: Oilseeds, Oils and Meals – Monthly Price Update (Feb 2022) [pdf]",
      "type": "story",
      "url": "https://www.fao.org/3/cb8614en/cb8614en.pdf"
    },
    {
      "by": "Manheim",
      "descendants": 0,
      "id": 30597428,
      "score": 1,
      "time": 1646725146,
      "title": "Winning with Data: Say No to Insights, Yes to Out-of-Sights",
      "type": "story",
      "url": "https://www.kaushik.net/avinash/winning-with-data-say-no-to-insights-yes-to-out-of-sights/"
    },
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 30597420,
      "score": 1,
      "time": 1646725082,
      "title": "A Study of Third-Party Resources Loading on Web [pdf]",
      "type": "story",
      "url": "https://arxiv.org/abs/2203.03077"
    },
    {
      "by": "perch56",
      "descendants": 0,
      "id": 30597413,
      "score": 1,
      "time": 1646725030,
      "title": "Zen and the Art of Reliability",
      "type": "story",
      "url": "https://zendesk.engineering/zen-and-the-art-of-reliability-f42fa7e64849"
    }
  ]
}