{
  "stories": [
    {
      "by": "noduerme",
      "descendants": 0,
      "id": 29275553,
      "score": 1,
      "text": "I&#x27;m making the transition from a 2015 mac to a new M1 as my dev environment. I&#x27;m simultaneously pulling a long-needed upgrade on all my production web apps from much earlier versions of Typescript (2.x &gt; 4), PHP (5.x &gt; 7.4), and MySQL (5.7 &gt; 8). All updates I had held back because my dev environment had gotten too mangled to attempt any upgrades on the old machine. (Try replacing homebrew under 10.11 without wrecking everything that&#x27;s working). So that&#x27;s a lot of code to manage. Mostly it&#x27;s okay. But the hardest thing for me is... changing my IDE.<p>I&#x27;ve been using Eclipse since at least Helios (2010)... that&#x27;s the oldest one on my last machine. Same project setups ported from version to version. But the AArch version of Eclipse is not stable, and doesn&#x27;t even launch on my machine. And I&#x27;ve admired (from a distance, next to colleagues) the lovely contours of VS Code for a lot of years. So I just spent the last two days building a VS Code environment (uh, a single multi-root workspace with a lot of tsconfig files and tasks) while fixing a bazillion typescript and PHP warnings. Okay. So I got all that done. Finally zero compiler problems.<p>Now my problem is, I can&#x27;t see code. I think I&#x27;ve gone code-blind. I can look at my old laptop showing a page of typescript in Eclipse, and I know exactly what I&#x27;m looking at. I can see through the code, see what it does. I look at the same thing in VS Code and all I see is colors. I tried light mode. I tried Github theme. I tried my old fonts. I tried <i>Courier New</i>. Everything burns my eyes. I literally can&#x27;t see the significance of the code; I feel like I&#x27;m looking at some ancient codex in a foreign language. Like the Rosetta Stone. Again, exact same code in my super basic light theme in Eclipse is entirely readable. Maybe it&#x27;s the tab lines in VS Code? Or the shaded syntax highlighting? Too much visual information?<p>I don&#x27;t know if anyone else has experienced this when changing editors. It&#x27;s disturbing. I actually feel like I&#x27;m losing my mind (or like someone who&#x27;s suffered a traumatic brain injury, I&#x27;ve lost the part of my brain that I rely on to infer meaning from symbols). Perhaps it&#x27;s just the fear of a major change, or a break with the past. I&#x27;m hoping that after a few days it&#x27;ll pass. I certainly never <i>loved</i> Eclipse...<p>I used to use f.lux a lot to change my screen to red-on-black only, at night. This was a fine way to code, but slightly more challenging. Maybe it&#x27;s all the colors that are screwing me up, I just need monochrome.<p>I&#x27;d love to hear anyone&#x27;s take on transitioning IDEs and whether it&#x27;s worth it to try to adjust your brain, theme-wise and color-wise. I never realized I&#x27;d gotten so attached to the visual part of moving through code. It shouldn&#x27;t be that way, but I guess it is.",
      "time": 1637316228,
      "title": "Ask HN: How do you handle transitioning to a new IDE?",
      "type": "story"
    },
    {
      "by": "mclightning",
      "descendants": 0,
      "id": 29275550,
      "score": 1,
      "text": "I just started at a new job around 3 weeks ago. Technically and culturally, I am not fit for the job at all from what I can tell.<p>The whole team speaks English for me, but it is noticeably uncomfortable for everyone. They skip inviting me for lunch because they don&#x27;t want to go through same act during lunch.<p>I am a frontender with AWS and GCP experience. This whole place runs and breaths Microsoft Azure.<p>They hired me as a Frontend Lead to manage 3 other devs and external provider&#x27;s deliverables. I had no time to takeover from previous guy, because I wanted to have a break between jobs, I was burnt out.<p>I feel at a loss, at their way of working. It is a real life &quot;the office&quot; environment. A meeting titled &quot;ProjectA Mobbing&quot;, with no agenda, none takes notes or action points. Person who calls the meeting just goes on fixing IT infra while 8 people in meeting watches. Then next day, DevOps team just deleted whole development IT infra with no notice, because it was costing too much apparently, and it does indeed.<p>How do I quit nicely here? Is it too early after 3 weeks?<p>Do I say, I am unfit for this company and environment? or lie and say I have another job offer?<p>I am getting paid a stupid amount of money. But honestly, I don&#x27;t care. I can find something else easily.",
      "time": 1637316202,
      "title": "Ask HN: Would you admit being unfit for role, or use a simpler excuse to quit?",
      "type": "story"
    },
    {
      "by": "spacechild1",
      "descendants": 0,
      "id": 29275523,
      "score": 1,
      "time": 1637315810,
      "title": "is-jonschlinkert v1.0.0",
      "type": "story",
      "url": "https://github.com/mitsuhiko/is-jonschlinkert"
    },
    {
      "by": "peter-winter",
      "descendants": 0,
      "id": 29275504,
      "score": 1,
      "time": 1637315598,
      "title": "Show HN: I made a C++ header only library for compile-time parser generation",
      "type": "story",
      "url": "https://github.com/peter-winter/ctpg"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29275499,
      "score": 1,
      "time": 1637315514,
      "title": "ConstitutionDAO fails to win bid to buy old US Constitution",
      "type": "story",
      "url": "https://techcrunch.com/2021/11/18/constitutiondaos-bold-crypto-bid-for-us-constitution-falls-short/"
    },
    {
      "by": "timilmer",
      "descendants": 0,
      "id": 29275497,
      "score": 1,
      "text": "As of recently, there are no territories of KetoAdvanced 1500 Adverse impacts! Which is an awesome sign that this uncommon ketogenic weight reduction recipe can help you get more fit without enormous issues occurring en route. Considering that the equation utilizes the best quality keto dynamic fixings, you can be sure that you are propelling your weight reduction without stresses. And furthermore, this unprecedented blend can even assistance in diminishing unfriendly impacts. During ketosis, it&#x27;s normal to encounter a couple of antagonistic impacts from the eating routine itself while becoming acclimated to it. Yet, by adding extra ketones, you can become acclimated to ketosis quicker and limit unfriendly impacts simultaneously.<p>https:&#x2F;&#x2F;buddysupplement.com&#x2F;keto-advanced-1500-canada&#x2F;<p>https:&#x2F;&#x2F;www.facebook.com&#x2F;supplementsworldofficial&#x2F;posts&#x2F;1065564597578274<p>https:&#x2F;&#x2F;www.provenexpert.com&#x2F;keto-advanced-1500-canada4&#x2F;<p>https:&#x2F;&#x2F;www.thingiverse.com&#x2F;ketoadvanced1500&#x2F;designs<p>https:&#x2F;&#x2F;keto-advanced-1500-canada.footeo.com&#x2F;actualite&#x2F;2021&#x2F;11&#x2F;19&#x2F;keto-advanced-1500-canada-updated-price-can-i-buy-in-canada.html<p>https:&#x2F;&#x2F;groups.google.com&#x2F;g&#x2F;keto-advanced-1500-canada-pills&#x2F;c&#x2F;y19jBend000<p>https:&#x2F;&#x2F;sites.google.com&#x2F;view&#x2F;keto-1500-pills-price&#x2F;<p>https:&#x2F;&#x2F;www.fuzia.com&#x2F;article_detail&#x2F;304194&#x2F;keto-advanced-1500-canada-updated-does-it-work-or-scam<p>https:&#x2F;&#x2F;promosimple.com&#x2F;giveaways&#x2F;keto-advanced-1500-canada-negative-side-effects-or-safe-diet-pills&#x2F;<p>https:&#x2F;&#x2F;www.bulbapp.com&#x2F;u&#x2F;keto-advanced-1500-canada<p>https:&#x2F;&#x2F;gowayn.com&#x2F;en&#x2F;keto-advanced-1500-canada-reviews<p>https:&#x2F;&#x2F;www.keywesthydrobikes.com&#x2F;forum&#x2F;general-discussions&#x2F;advanced-keto-1500-negative-reviews-and-side-effects-pills-price<p>https:&#x2F;&#x2F;www.folkspaper.com&#x2F;topic&#x2F;keto-advanced-1500-reviews--safe-diet-pills-or-alarming-side-effects-5737572733026304.html<p>https:&#x2F;&#x2F;twitter.com&#x2F;ketoadvanced6<p>https:&#x2F;&#x2F;ketoadvanced.footeo.com&#x2F;news&#x2F;2021&#x2F;11&#x2F;19&#x2F;keto-advanced-1500-canada<p>https:&#x2F;&#x2F;mice.easybranches.com&#x2F;contribute&#x2F;preview?id=6e0a15e3901bd526d4643c1ee8390123<p>https:&#x2F;&#x2F;livleanformulareviewsprice.blogspot.com&#x2F;2021&#x2F;11&#x2F;keto-advanced-1500-canada-reviews-2021.html<p>https:&#x2F;&#x2F;ketoadvanceds.tumblr.com&#x2F;<p>https:&#x2F;&#x2F;medium.com&#x2F;@ketoadvanced6&#x2F;keto-advanced-1500-canada-weight-loss-side-effect-bhb-reviews-e89b5b16ead6<p>https:&#x2F;&#x2F;www.protocols.io&#x2F;workspaces&#x2F;keto-advanced-1500-canada&#x2F;news&#x2F;keto-advanced-1500-canada<p>https:&#x2F;&#x2F;www.completefoods.co&#x2F;diy&#x2F;recipes&#x2F;keto-advanced-1500-canada-50-off<p>https:&#x2F;&#x2F;keto-advanced-1500-canada-48.webselfsite.net&#x2F;<p>https:&#x2F;&#x2F;kit.co&#x2F;ketoadvanced3&#x2F;keto-advanced-1500-canada<p>https:&#x2F;&#x2F;www.spreaker.com&#x2F;show&#x2F;keto-advanced-1500-canada_9<p>https:&#x2F;&#x2F;ketoadvanced1500canadas.splashthat.com&#x2F;",
      "time": 1637315494,
      "title": "Keto Advanced 1500 Canada – (Updated Price) Can I Buy in Canada?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29275489,
      "score": 1,
      "time": 1637315371,
      "title": "Greenland turducken from hell: the real bird-seal meal (2013)",
      "type": "story",
      "url": "https://thefourthcontinent.com/greenland-terducken-the-types/"
    },
    {
      "by": "KoftaBob",
      "descendants": 0,
      "id": 29275487,
      "score": 2,
      "time": 1637315360,
      "title": "DuckDuckGo App Tracking Protection: Block 3rd party trackers in your apps",
      "type": "story",
      "url": "https://spreadprivacy.com/introducing-app-tracking-protection/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29275486,
      "score": 1,
      "time": 1637315360,
      "title": "Axiomatic CSS and Lobotomized Owls (2014)",
      "type": "story",
      "url": "https://alistapart.com/article/axiomatic-css-and-lobotomized-owls/"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 29275479,
      "score": 1,
      "time": 1637315298,
      "title": "A fog blog: Understanding a challenge inherent to driving in San Francisco",
      "type": "story",
      "url": "https://blog.waymo.com/2021/11/a-fog-blog.html"
    }
  ]
}