{
  "stories": [
    {
      "by": "microo8",
      "descendants": 0,
      "id": 30082703,
      "score": 1,
      "time": 1643181194,
      "title": "Alacritty with Sixel",
      "type": "story",
      "url": "https://github.com/alacritty/alacritty/issues/910"
    },
    {
      "by": "laktak",
      "descendants": 0,
      "id": 30082694,
      "score": 1,
      "time": 1643181107,
      "title": "Booby-trapped sites delivered potent new backdoor trojan to macOS users",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2022/01/booby-trapped-sites-delivered-potent-new-backdoor-trojan-to-macos-users/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30082678,
      "score": 1,
      "time": 1643180879,
      "title": "The Curious Case of Dropbox and macOS 12.3",
      "type": "story",
      "url": "https://512pixels.net/2022/01/the-curious-case-of-dropbox-and-macos-12-3/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 30082661,
      "score": 1,
      "time": 1643180751,
      "title": "Open Sourcing the App Engine Standard Java Runtime",
      "type": "story",
      "url": "https://cloud.google.com/blog/topics/developers-practitioners/open-sourcing-app-engine-standard-java-runtime"
    },
    {
      "by": "barry-cotter",
      "descendants": 0,
      "id": 30082652,
      "score": 1,
      "time": 1643180670,
      "title": "Pre-K Lowers Academic Achievement. Effect Worsens from 3rd to 6th Grades",
      "type": "story",
      "url": "https://doi.apa.org/doiLanding?doi=10.1037%2Fdev0001301"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30082651,
      "score": 1,
      "time": 1643180654,
      "title": "When humans compete with television, the liveness of bodies wins out",
      "type": "story",
      "url": "https://theconversation.com/when-humans-compete-with-television-yung-lung-proves-the-liveness-of-bodies-wins-out-173986"
    },
    {
      "by": "monus",
      "descendants": 1,
      "id": 30082626,
      "kids": [
        30082627
      ],
      "score": 2,
      "time": 1643180449,
      "title": "Deep Dive: Terraform in Kubernetes – 1000s of CRDs",
      "type": "story",
      "url": "https://blog.crossplane.io/deep-dive-terrajet-part-i/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30082623,
      "score": 1,
      "time": 1643180394,
      "title": "Game Theory and Python Workshop",
      "type": "story",
      "url": "https://github.com/Nikoleta-v3/Game-Theory-and-Python"
    },
    {
      "by": "novelica",
      "descendants": 1,
      "id": 30082614,
      "kids": [
        30082655
      ],
      "score": 1,
      "text": "Hey HN, I want to keep this transparent. I’ve made a tool to help people with the problem of needing consistent results, despite not having a controllable schedule. The site is just a signup, but later this week it’ll be on the App Store. The first part of this post is essentially a TLDR. The second part is the story behind it, if you like lifehacking.<p>1. TLDR - What it is, why I made it, and what is solves:<p>The tool pairs you with an assistant who will help you tailor your routines and habits around whatever you’re throwing at your schedule each hour. (https:&#x2F;&#x2F;www.athios.co)<p>I made this because I’m a student at university and it’s incredibly hard to make progress using the well known habit-tracking and routine building approaches advocated by most lifehacker books and blogs. It’s just very difficult to have fun and do interesting new things when you have to make everything in your life routine-based to progress on your goals. I hope this is useful to you.<p>2. The story behind the tool, if you&#x27;re interested:<p>When I was a junior in high school my dad was diagnosed with Alzheimer’s, and as he lost his job, slowly but consistently many parts of my family’s life deteriorated since he was the only breadwinner of the family. By Senior year my mom was asking for donations on I-45 in Houston while I was at school. I had slept through most of high school, so community college was in my cards. I turned to lifehacking to get to the university of my dreams.<p>2 years later when I finally got to the university I wanted to go: Everything fell apart. I stopped showing up to class. I slept all day. I over ate. I gained 30 pounds. I failed all my classes, and had a 1.8 GPA. I ended up using an app called Fabulous, it was a little expensive, but it really got my crap together. In about 4 months I went from ~245 lbs to ~215. I had never once in my life considered implementing a morning or evening routine, and it worked. I was rocking all A’s, and then a month later, the pandemic hit. I was still keeping my routines, and losing weight because of the looming threat of being expelled from the university, but by January 2021… I was done with this crap.<p>I had heard of Future (a personal training app - it’s expensive) and I used it, while having my mother (reluctantly) look at my progress on my daily routines (from Fabulous) through a cheap little system I put together. Yes, because of Future, this was a very expensive experiment, but I wanted to lose a lot of weight and break into Software Engineering as a non-CS major. The results were pretty good. I went from ~215 lbs to 190 lbs in about 5-6 months, and got some internship offers, and kept progressing in my major at school. I think this worked because you always know someone is gonna see if you did it or not. From my findings, it certainly helps to use accountability in conjunction with routines and consistency, but the system for sure keeps you powering through changes, and since students are constantly moving apartments, cities, sleeping in, and procrastinating, this helped.<p>Last semester, some friends wanted help with routines, so I started making a tool (on TestFlight) where I was the “coach” and I would create mixtures of the many methods learned from books, and apps I’ve tried. My goal was to help keep their streak going as long as possible. And if they broke it, my main priority was making sure they could restart it ASAP. The main thing that helped them was not just that they knew I’d see their routines, but that they could also talk to me about their routines. The friends I helped ended up sticking with it daily for 4 months (the entire semester). We’ve paused briefly since I’m making this into an app that’ll get into the app store.",
      "time": 1643180288,
      "title": "Lifehacking: Maintaining routines throughout uncontrollable schedules",
      "type": "story"
    },
    {
      "by": "3np",
      "descendants": 0,
      "id": 30082609,
      "score": 1,
      "time": 1643180256,
      "title": "Name your desktop user `user` and now your logs will be less identifying",
      "type": "story",
      "url": "https://pleroma.remerge.net/notice/AFpAudGiiQs8parpGS"
    }
  ]
}