{
  "stories": [
    {
      "by": "striking",
      "descendants": 0,
      "id": 27938623,
      "score": 1,
      "time": 1627103945,
      "title": "Floating Point Expression Inspector",
      "type": "story",
      "url": "https://github.com/graphitemaster/fpinspect"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 27938585,
      "score": 1,
      "time": 1627103512,
      "title": "The Chatbot Problem",
      "type": "story",
      "url": "https://www.newyorker.com/culture/cultural-comment/the-chatbot-problem"
    },
    {
      "by": "anushreegoenka",
      "descendants": 0,
      "id": 27938576,
      "score": 5,
      "text": "Hi HN, we’re Spark Studio (www.sparkstudio.co) and we provide live, online extracurricular classes for children across the world, starting in India and the Middle East. Children can learn music, visual arts and communication skills through our live online classes in small groups with expert teachers.<p>We’re based in India. All the attention here tends to go to academic learning and grades, but a large part of development (brain and personality) actually happens outside it.  Parents have started to desire extracurricular and holistic learning for their children, but access, quality, and convenience remain big unsolved problems. Most people end up having to choose among neighbourhood options. There is no standard curriculum, and definitely none designed for kids, so these classes tend to end up just being a pastime and&#x2F;or kids become disinterested.<p>Kaustubh, Namita and Jyothika have built Product and Curriculum at India’s leading ed-tech companies (BYJU’S and Lead School) and have over 20 years of experience in education. Anushree has a consumer tech background and is an artist. We all felt the itch to work on extracurricular learning because it’s so poorly served.<p>We’re building a full-stack model. We design the learning experience end-to-end—the curriculum, lesson plans for each class, video content and tech. We train teachers (who are gig workers) to deliver this in small-group live classes. We ensure classes are interactive and each child gets personal attention. This sets it apart from the available online options such as YouTube for kids. We are also able to drive learning outcomes such as improved confidence, or understanding of the technical aspects of photography for example, beyond just engaging kids with something fun. Parents are happy when their child is having a good time, doesn’t need active involvement from parents (at least for a little while), and is learning at the same time!<p>One interesting challenge here is that the customer (parent) is different from the user (child), and managing the experience across both needs careful thinking. Nudges and engagement points have to be built differently for each. For example, parent communication is largely outside the live class, and we’re building “showcase” properties for them to see and feel pride in their child’s achievement. But for children, we need to build most things in the class experience itself, even taking their feedback. Another very interesting insight has been that Children do not want to be treated like children!  We&#x27;ve had children tell us that the teacher spoke to them as if they were children, and they didn&#x27;t like it. So our teachers are trained not to oversimplify or spoon feed the kids; something that is appreciated by both the children and their parents, and we’ve seen children grasp more complex concepts when they’re given a chance to.<p>We sell courses that are typically 12-15 sessions in duration. We are currently using Zoom to deliver these. We will soon have our own live class environment built on top of a third party video calling solution. And we&#x27;re building our own Learning Management System.<p>We’d love for the HN community to give us their thoughts or feedback on teaching extracurriculars or insights into our TG. We’re live in India and the Middle East right now, so if you’re a parent to a child between the ages of 5 and 15, do come by www.sparkstudio.co and enroll for any of our 15 fabulous courses. We also do a Free Trial Class.",
      "time": 1627103387,
      "title": "Launch HN: Spark Studio (YC S21) – Live online extracurricular courses for kids",
      "type": "story"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 27938575,
      "score": 1,
      "time": 1627103384,
      "title": "In 2040, You May Drive a Car That Looks Like This",
      "type": "story",
      "url": "https://www.architecturaldigest.com/story/2040-drive-car-that-looks-like-this"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 27938565,
      "score": 1,
      "time": 1627103283,
      "title": "Break Dancing Will Be an Olympic Sport in 2024",
      "type": "story",
      "url": "https://www.npr.org/2020/12/20/948315555/olympic-breakdancing"
    },
    {
      "by": "d_utkarsh",
      "descendants": 0,
      "id": 27938563,
      "score": 1,
      "time": 1627103280,
      "title": "Computer Vision Project: Fingerprint Minutiae Feature Extraction",
      "type": "story",
      "url": "https://github.com/Utkarsh-Deshmukh/Fingerprint-Feature-Extraction"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 27938555,
      "score": 1,
      "time": 1627103202,
      "title": "Snake-Venom 'Super Glue' Can Stop Wounds Bleeding Under a Minute",
      "type": "story",
      "url": "https://www.sciencealert.com/snake-venom-super-glue-can-stop-wounds-bleeding-in-seconds-with-a-flash-of-light"
    },
    {
      "by": "d_utkarsh",
      "descendants": 0,
      "id": 27938550,
      "score": 1,
      "time": 1627103173,
      "title": "Computer vision project: Fingerprint Image Enhancement",
      "type": "story",
      "url": "https://github.com/Utkarsh-Deshmukh/Fingerprint-Enhancement-Python"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 27938547,
      "score": 1,
      "time": 1627103164,
      "title": "The Boss Wants You Back in the Office. Like, Now",
      "type": "story",
      "url": "https://www.wsj.com/articles/return-to-work-the-boss-wants-you-back-in-the-office-11627079616"
    },
    {
      "by": "jonathanaird",
      "descendants": 0,
      "id": 27938534,
      "score": 1,
      "time": 1627102968,
      "title": "A Tour of the Fuchsia Operating System",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=gIT1ISCioDY"
    }
  ]
}