{
  "stories": [
    {
      "by": "carvem",
      "descendants": 0,
      "id": 28249398,
      "score": 1,
      "time": 1629482985,
      "title": "Vqgan and Clip: AI Generated Art",
      "type": "story",
      "url": "https://huggingface.co/spaces/akhaliq/VQGAN_CLIP"
    },
    {
      "by": "brunoluiz",
      "descendants": 0,
      "id": 28249386,
      "score": 1,
      "time": 1629482929,
      "title": "Modern web apps without JavaScript bundling or transpiling",
      "type": "story",
      "url": "https://world.hey.com/dhh/modern-web-apps-without-javascript-bundling-or-transpiling-a20f2755"
    },
    {
      "by": "drdee",
      "descendants": 0,
      "id": 28249363,
      "score": 1,
      "time": 1629482805,
      "title": "Wayne Woolley’s Marvelously Equipped Mind: blind biochemist who worked with LSD",
      "type": "story",
      "url": "https://www.sciencehistory.org/distillations/wayne-woolleys-marvelously-equipped-mind"
    },
    {
      "by": "billippio",
      "descendants": 0,
      "id": 28249343,
      "score": 1,
      "text": "Learn from a predatory loan victim and just teach yourself to program. Hindsight is 20&#x2F;20.<p>I get it; I made a bad decision and signed a $30k contract for for 7 months of &quot;Education&quot; under the guided assumption I would immediately (or at least quickly) get a job after with my newly developed skills (Web Development(Node.React)&#x2F;Computer Science Track 2018). I was poor af at the time and $50k a year was way more than I could ever make doing what I was doing. \nThis did not happen. I did not get a job making over $50k.\nAfter several months, I took a crap PHP job making $12 an hour. A family member worked for the company and got me the job. I figured, at least I&#x27;d be learning a new skill and decided it was better than making considerably more money bartending.\nI worked there full-time for a year and then part-time for another year leveling up my PHP&#x2F;Laravel skills as well as devoppsy stuff (They had their own server. It was actually pretty cool). The reason I went part-time was to pursue a crypto venture with some friends, also written in PHP&#x2F;Laravel but included Vue as well. I got pretty proficient in Vue over the year and had that project as well as some others to show for it. Using these projects in my portfolio, I landed a much better job.\nI started doing some Vue contract work for an actual software company and, after a few months, they hired me full-time. \n2021, over two years after completing Lambda School, I got a over $50k paying job which I was qualified for due to my two years of programming experience. For, the icing on top, the past two years haven&#x27;t even been related to what the Lambda curriculum was. I haven&#x27;t even used those technologies since 2018. \nHere I am now, obligated to pay %17 percent of my pretax income for a course I did years ago that didn&#x27;t help me at all get to where I am now. How is that fair?\nThere has to be many people in this same boat; A lot can happen in 2 years, let alone 5! I&#x27;d long to hear some feedback on this.\nI&#x27;m pretty sure I have no legal basis as a contract is a contract, but this just seems wrong.",
      "time": 1629482728,
      "title": "Lambda School ISA terms have a 5 year enforcment term. How is that justifiable?",
      "type": "story"
    },
    {
      "by": "wittyfarzi",
      "descendants": 0,
      "id": 28249319,
      "score": 1,
      "text": "Hi HN, we&#x27;re Ahmad, Sashakt, and Harshit of Kalam Labs (https:&#x2F;&#x2F;www.kalamlabs.in&#x2F;). Kalam Labs lets 6 to 14 year old kids learn their favourite science topics by watching live game streams and playing science games. It&#x27;s like Twitch for science, except you also get to play :)<p>Watch a video of our live stream here:- https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QGMmUg0N0HE<p>High curiosity in kids is directly linked to better academic performance and better outcomes when they grow up. However, school leads to a drop in curiosity as they discourage asking questions and encourage “focussing on the blackboard.” Parents don’t have a solution, as internet resources are unstructured and unreliable and encyclopedias are static and boring for the kids.<p>We were batchmates at our undergraduate degrees and worked together at India&#x27;s largest educational body, NCERT. There we interacted with hundreds of kids, and they were really curious about science. Their heads were filled with questions like: Why is the sky blue? What is inside a black hole? etc. But the conventional teaching mediums were just too boring for them. So we started searching what do they want?<p>Turns out almost every kid was on Roblox and Minecraft. There were entire communities there hanging out, hosting live streams chatting with each other. Digging deeper, we saw that Roblox and Minecraft are being extensively used as educational media. Microsoft has launched Minecraft for Education and Roblox has launched Roblox Education, and this was prompting teachers to migrate from Zoom to these multiplayer games. So we got it: we will use live game streaming to help kids learn science. We launched our MVP and saw phenomenal results. Generating $1k USD revenue in just a couple of days, we saw a market potential of scaling it and hence decided to start a startup around it.<p>At Kalam Labs we host daily live game streams on kids&#x27; favourite science topics like space, black holes, and dinosaurs. During the live stream, an instructor takes the kids around a virtual world where they learn new topics by playing game-based exercises. The cool parts are: unlike a typical live game-stream on Twitch&#x2F;YT where only the video of instructor playing a game is shared, at Kalam Labs kids can play the game with the instructor. This helps the instructor to give short fun activities for kids to solve for explaining any topic. In addition, our Live Chat has a tag-feature, which is really loved by kids. Instead of typing the entire chat, kids can just tap on the different recommendations and convey their thoughts. This leads to very high-engagement with sometimes kids liking the tapping feature more than the game itself.<p>We are seeing cool metrics pop out due to this: Our average watch time of a live stream is 40 minutes - 5x higher than Youtube. Further, just launched in Mid-June our product has amassed thousands of paying customers growing 50% week-over-week.<p>Please share your thoughts and feedback!",
      "time": 1629482603,
      "title": "Launch HN: Kalam Labs (YC S21) - Stem Learning via Live Gaming",
      "type": "story"
    },
    {
      "by": "hiddencache",
      "descendants": 0,
      "id": 28249309,
      "score": 2,
      "time": 1629482559,
      "title": "SpaceX’s Starlink near-misses with other spacecraft are getting ‘out of control’",
      "type": "story",
      "url": "https://www.independent.co.uk/space/elon-musk-spacex-starlink-satellite-near-misses-b1905969.html"
    },
    {
      "by": "hiddencache",
      "descendants": 0,
      "id": 28249297,
      "score": 1,
      "time": 1629482499,
      "title": "The Science Inside Your Ice Cream",
      "type": "story",
      "url": "https://www.scientificamerican.com/video/the-science-inside-your-ice-cream/"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28249293,
      "score": 1,
      "time": 1629482475,
      "title": "SQL Snippets – Crowdsourcing SQL Queries",
      "type": "story",
      "url": "https://www.i-programmer.info/news/84-database/14798-sql-snippets-crowdsourcing-sql-queries.html"
    },
    {
      "by": "0xCMP",
      "descendants": 0,
      "id": 28249289,
      "score": 1,
      "time": 1629482467,
      "title": "Moonlander Tripod Kit",
      "type": "story",
      "url": "https://www.zsa.io/moonlander/tripod-kit/"
    },
    {
      "by": "jasonlew",
      "descendants": 0,
      "id": 28249252,
      "score": 1,
      "time": 1629482296,
      "title": "The 5 Most Common Software Debugging Mistakes Made by Junior Engineers",
      "type": "story",
      "url": "https://skillmagic.com/potion/5-most-common-software-debugging-mistakes-made-by-junior-engineers"
    }
  ]
}