{
  "stories": [
    {
      "by": "glitcher",
      "descendants": 0,
      "id": 28331246,
      "score": 1,
      "time": 1630088392,
      "title": "Facebook’s Secret War on Switching Costs",
      "type": "story",
      "url": "https://www.eff.org/deeplinks/2021/08/facebooks-secret-war-switching-costs"
    },
    {
      "by": "taxyovio",
      "descendants": 0,
      "id": 28331235,
      "score": 1,
      "time": 1630088311,
      "title": "LiquidText 5.0 launches sync service",
      "type": "story",
      "url": "https://www.liquidtext.net/pricing-features"
    },
    {
      "by": "anzhelikam",
      "descendants": 0,
      "id": 28331232,
      "score": 1,
      "text": "Hey all,\nI wanted to share with you this cool platform for developers that lets you build conversational AI apps in a matter of hours. Even a non-developer can build a demo app in less than 2 hours.<p>Why is Dasha unique?<p>* We have our own intuitive programming language - DashaScript. It&#x27;s an event-driven language intended to describe a conversation script.<p>* We created Dasha Studio, an extension to VSCode. You use the studio to create your conversational script, it gives you syntax analysis and highlight. There&#x27;s also a visual graph editor.<p>* Dasha CLI that lets you log in and get your API key that you can then use to execute conversational AI apps, and get diagnostic information about current usage, queues, and limits on Dasha Cloud Platform side.<p>* Dasha Cloud provides conversational AI as a service, which means that you don’t need to be a machine learning engineer to use machine learning when building Dasha conversational apps.<p>* We use GRPC for communication between SDK and the Dasha Cloud (more on that here https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F;blog&#x2F;conversational-application)<p>What apps can you build?<p>To illustrate how to build a conversational app and show its capabilities, here&#x27;s an audio demo + tutorial on how to create a conversational AI app that automates money transfers (and more): https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F;blog&#x2F;money-transfer-automation<p>You can create apps for free, so give it a try: https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F; (just click on &quot;API key&quot; button and we&#x27;ll provide you one so you can start building)<p>Also, we&#x27;re hiring a DevRel, so if you are one or know one, apply or reach out! https:&#x2F;&#x2F;www.notion.so&#x2F;dashaai&#x2F;Dasha-is-hiring-6f2156ae251e4e9b94c841fff4fcd976",
      "time": 1630088282,
      "title": "Show HN: Developer platform for creating human-like conversational AI apps",
      "type": "story"
    },
    {
      "by": "afry1",
      "descendants": 0,
      "id": 28331230,
      "score": 1,
      "time": 1630088260,
      "title": "Accessible Multistep Forms in React, Part Two – Accessibility",
      "type": "story",
      "url": "https://andyfry.co/multi-step-form-accessibility/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 28331224,
      "score": 1,
      "time": 1630088237,
      "title": "Rivian has confidentially filed for an IPO",
      "type": "story",
      "url": "https://techcrunch.com/2021/08/27/electric-vehicle-company-rivian-has-confidentially-filed-for-an-ipo/"
    },
    {
      "by": "lesbianbezos",
      "descendants": 0,
      "id": 28331222,
      "score": 1,
      "text": "My name is Maddie (ex-Stanford)! I&#x27;m the founder of Founders Cafe - a co-working space for founders from Stanford, Harvard, YC, and more.<p>One year ago, I was building Sesame, a co-working space for students. When I started building Sesame, I was really optimistic, getting a YC interview after a successful launch! Then I lost my co-founder, my best friend.<p>I sat alone in my parent&#x27;s basement the whole year, iterating on a failing Sesame. I bounced from co-founder to co-founder, hoping they would be the key to unlock my startup<p>At some point, I started co-working with a random Harvard founder named Robert. Each day, we’d grind together on call. We&#x27;d work all day, sharing our anxieties &amp; problems during the breaks   We became so close! And invited a few more founder friends from YC &#x2F; Berkeley to co-work. This eventually evolved into Founders Cafe. They were my first customers, early supporters, and I wouldn&#x27;t be there without them. We&#x27;re at 69 members and ~$2k MRR.<p>What helped me most:<p>1. Founder support. Being stuck is the worst feeling, and my founder friends helped me gain the conviction to pivot away from my dead child Sesame and start something new. You need founders in the same boat as you, willing to support you every day, and tell you it straight up!<p>2. Rigorous learning. I took 1 month to study better ways to build a startup. I read The Startup Owner&#x27;s Manual, The Mom Test, and Building Better Products. I developed my own framework on building startups, and executed. This allowed me to stop building stuff nobody wanted because I started doing things like interviewing 40 people first.<p>3. Trying it solo. I spent the year trying to find &quot;The Savior Co-Founder.&quot; As a lonely technical person who lacked business skills, I didn&#x27;t realize I could fill the void myself. I got business skills from books. I got support from my founder community. And ever since, I felt free! As a full time solo founder, I don&#x27;t have to rely on anyone anymore :D<p>Let me know if you have any questions!<p>Let me know if you&#x27;d like an invite to Founders Cafe as well -- Happy to support any HackerNews founders",
      "time": 1630088223,
      "title": "I got 69 paying customers after failing for one year",
      "type": "story"
    },
    {
      "by": "SkyMarshal",
      "descendants": 0,
      "id": 28331201,
      "score": 1,
      "time": 1630088097,
      "title": "Wall Street Is Looking to Reddit for Investment Advice",
      "type": "story",
      "url": "https://www.wsj.com/articles/wall-street-is-looking-to-reddit-for-investment-advice-11630056648"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 28331199,
      "score": 1,
      "time": 1630088085,
      "title": "Scientists Reveal World’s First 3D-Printed, Marbled Wagyu Beef",
      "type": "story",
      "url": "https://interestingengineering.com/scientists-reveal-worlds-first-3d-printed-marbled-wagyu-beef"
    },
    {
      "by": "nerdwords",
      "descendants": 0,
      "id": 28331149,
      "score": 2,
      "time": 1630087824,
      "title": "ThreatModel for Amazon S3 [pdf]",
      "type": "story",
      "url": "https://raw.githubusercontent.com/trustoncloud/threatmodel-for-aws-s3/main/Amazon%20Simple%20Storage%20Service%20(S3)%20-%20ThreatModel.pdf"
    },
    {
      "by": "Crash0v3rid3",
      "descendants": 0,
      "id": 28331144,
      "score": 2,
      "time": 1630087805,
      "title": "The Circle Comes Full Circle, with the New Google Pixel",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=oJZuSVl5wjM"
    }
  ]
}