{
  "stories": [
    {
      "by": "colewilson",
      "descendants": 0,
      "id": 29432767,
      "score": 1,
      "time": 1638553380,
      "title": "Show HN: You can't view MY javascript source code",
      "type": "story",
      "url": "https://nosource.cole.ws/"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 29432765,
      "score": 2,
      "time": 1638553372,
      "title": "Severe Covid infection doubles chances of dying in following year, study finds",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/dec/01/severe-covid-infection-doubles-chances-of-dying-in-following-year-study"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29432750,
      "score": 1,
      "time": 1638553308,
      "title": "DocuSign Q3 2021",
      "type": "story",
      "url": "https://investor.docusign.com/investors/events-and-presentations/event-details/2020/DocuSign-Q3-Fiscal-2021-Earnings-Call-and-Webcast/default.aspx"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29432748,
      "score": 1,
      "time": 1638553302,
      "title": "Light-powered soft robots could suck up oil spills",
      "type": "story",
      "url": "https://news.ucr.edu/articles/2021/12/02/light-powered-soft-robots-could-suck-oil-spills"
    },
    {
      "by": "Amorymeltzer",
      "descendants": 0,
      "id": 29432745,
      "score": 1,
      "time": 1638553293,
      "title": "We Built a Crypto Index",
      "type": "story",
      "url": "https://theirrelevantinvestor.com/2021/12/03/we-built-a-crypto-index/"
    },
    {
      "by": "grn",
      "descendants": 0,
      "id": 29432732,
      "score": 1,
      "time": 1638553191,
      "title": "Database Performance: Indexing Foreign Keys",
      "type": "story",
      "url": "https://www.gregnavis.com/articles/database-performance-indexing-foreign-keys.html"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29432727,
      "score": 1,
      "time": 1638553170,
      "title": "Scientists find a way to ‘catapult’ rockets into space like ‘slingshots’",
      "type": "story",
      "url": "https://theswaddle.com/scientists-find-a-way-to-catapult-rockets-into-space-like-slingshots/"
    },
    {
      "by": "linusb",
      "descendants": 0,
      "id": 29432720,
      "score": 1,
      "text": "I recently had a falling out with my best friend. I&#x27;ve known this girl for about 1 year and we only met once, usually through the internet. When we met it all worked out, in the comfortable feelings with each other and at that moment I felt that I would really like to have something serious with her. I would like to see her one more time this year, but unfortunately my job doesn&#x27;t give me much freedom to go often. We live about 7 hours away from each other&#x27;s homes (We live in different states).<p>So I mentioned to my best friend that I would like to spend Christmas with my girlfriend, but I had already arranged the New Year with him, so I asked beforehand if we had anything planned for Christmas and he said no. , and from that I decided to go visit my girlfriend and spend Christmas with her. However, he started to give several negative points about it, saying that I would not have nice things to do there (since it is inland and there are no trees or beautiful places at Christmas like in big cities) or that her family did not want me there. Besides also mentioning that it would be better to travel at the carnival because I would have more time to see it, but I won&#x27;t have a break at the carnival and I&#x27;ll only have about 3 days to see her, while at Christmas I get 4 days. So I said I would think about the case.<p>However, a few days later I mentioned that I would actually travel even with his warnings, which I think are valid, but my desire at the moment is to see my girlfriend, because lately she has been helping me to deal with a lot of stuff. But my best friend started to think that I had devalued our friendship and putting value points, mainly on the question of real value. For example, he mentioned that I spend a lot of money on the ticket just to see her, while I&#x27;ve known him for a long time, I didn&#x27;t spend anywhere near what I would spend on the trip (which is not a high value). He always says that Christmas is to be with the family, and he thinks I&#x27;m leaving him for my girlfriend, always putting values, that I value her more than he because of that value. But my girlfriend&#x27;s family even paid the ticket for me, they really want me to go, I don&#x27;t want to let them down either. I really want to go, but I also don&#x27;t want to leave my friend like this, we don&#x27;t have the tradition of spending Christmas together, most of the time we just spend New Year together, which I think is much more important. I never had Christmas traditions with my family, it was always nothing special. He said that he sees me as family, but i also do, but for me the new year is more special. Also this is impacting my work, because I&#x27;m always thinking about how both of them will feel.",
      "time": 1638553146,
      "title": "Ask HN: How to Deal with Jealous Friends",
      "type": "story"
    },
    {
      "by": "pypower",
      "descendants": 0,
      "id": 29432717,
      "score": 1,
      "time": 1638553140,
      "title": "Replicating GraphQL Using REST, Piccolo, and FastAPI",
      "type": "story",
      "url": "https://piccolo-orm.com/blog/replicating-graph-ql-using-rest-piccolo-and-fast-api/"
    },
    {
      "by": "Cyclical",
      "descendants": 0,
      "id": 29432685,
      "score": 2,
      "time": 1638552973,
      "title": "Gravitoelectromagnetism",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Gravitoelectromagnetism"
    }
  ]
}