{
  "stories": [
    {
      "by": "GeneralMaximus",
      "descendants": 0,
      "id": 28026463,
      "score": 1,
      "time": 1627828176,
      "title": "SerenityOS Update (July 2021)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=nUCpt6F5q-s"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28026459,
      "score": 1,
      "time": 1627828136,
      "title": "Sweden: Despite Variants, No Lockdowns, No Daily Covid Deaths – AIER",
      "type": "story",
      "url": "https://www.aier.org/article/sweden-despite-variants-no-lockdowns-no-daily-covid-deaths/"
    },
    {
      "by": "nanis",
      "descendants": 1,
      "id": 28026454,
      "kids": [
        28026455
      ],
      "score": 1,
      "time": 1627828099,
      "title": "On Vaccines, Lies, and Auschwitz",
      "type": "story",
      "url": "https://alexberenson.substack.com/p/on-vaccines-lies-and-auschwitz"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 28026445,
      "score": 1,
      "time": 1627827990,
      "title": "Hyperemployment, or the Exhausting Work of the Technology User",
      "type": "story",
      "url": "https://www.theatlantic.com/technology/archive/2013/11/hyperemployment-or-the-exhausting-work-of-the-technology-user/281149/"
    },
    {
      "by": "sexy_year",
      "descendants": 0,
      "id": 28026443,
      "score": 3,
      "text": "Hey all,<p>Monthly update on the state of the best -and only one- Free Open-Source Terminal: Gamestonk Terminal.<p>Since last month, some of the features that have been added are:<p>* Insider Screener based on http:&#x2F;&#x2F;openinsider.com<p>* Market overview from https:&#x2F;&#x2F;www.wsj.com&#x2F;market-data<p>* A neat ETF screener to filter for ETFs that meet a certain criteria, like: price, assets held, net asset valuation, expense ratio, PE Ratio, dividend yield, and more.<p>* An initial version of a supply-chain analysis, that based on a company shows not only the suppliers but also customers.<p>* Literally 40 new crypto commands from a single contributor! It&#x27;s actually insane the amount of new functionalities this crypto menu already has...<p>* We incorporated also an Options screener from https:&#x2F;&#x2F;ops.syncretism.io. The author (https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;thetagang&#x2F;comments&#x2F;o6yx3e&#x2F;i_made_an_open_source_options_search_engine&#x2F;) has been extremely keen with incorporating his API.<p>* New partnership with Sentiment Investor!!! Which allows us to have an even better behavioural analysis, and we increase the list of our partners to 4.<p>* For more terminal updates, you can follow our twitter account https:&#x2F;&#x2F;twitter.com&#x2F;gamestonkt or check the #new-features channel on our discord.<p>Some of the next steps:<p>* We want to improve our unique feature of automatic report generation to help the community benefiting from real good DD. I personally benefit massively from the DD everyone puts here, and feel like there should be a tool to host all this information. And the way we automate it will make it much easier for content creators to add their notes and share their DD with everyone.<p>* We have been having regular weekly calls with contributors to agree on the structure of the data that will be used for our sick GUI.<p>If you are unsure about the terminal, let me tell you why I spend 99% of my spare time developing it:<p>1. The terminal is timeless. \nThe terminal is fully open-source, which means that it won&#x27;t die. It also means that there&#x27;s 100% transparency on everything we do. You can even see the very first commit of the project, and how fast we&#x27;ve grown since then.<p>2. The terminal is 100% free. \nThere isn&#x27;t a single command that requires money from the user. It also means equality between every user, i.e. all users are premium in our view.<p>3. Unlimited upside. \nWith the amount of data we are gathering, the possibilities of what we can do are unlimited. Even this week I was reached out by some DS guys where they want to improve our Residual Analysis menu to add explanations of what does that mean to people less familiar with this mathematical terms.<p>4. Driven by the community.\n Most of the features I mentioned above came from users on discord messaging us with &quot;what about a supply-chain analysis like bloomberg terminal&quot; or &quot;look this openinsider website looks legit, we could do something nice with it&quot;.<p>5. Amazing community. \nI can&#x27;t stress this enough. Some of the people we&#x27;re working with on this, are extremely smart and hard-working people. Personally, I&#x27;m learning a ton while having a lot of fun.<p>6. The opportunity to make a difference. \nDefinitely the most rewarding for me. Last year when COVID happened, I had no clue what a SPAC was, and had never invested in anything. Today I have the chance to make an impact in the financial world.You know when people say &quot;To the people&quot;. The community behind this project are actually that same people. We don&#x27;t come from Wall St, we all have 9-5 jobs and are trying to level the financial world, 1 commit at a time.Everyone can give their contribution on this project, I welcome every single one of you to join our discord. Even if you are not a developer, requesting features, finding bugs, is just as important.",
      "time": 1627827983,
      "title": "Show HN: Gamestonk Terminal Update. A FOSS Alternative to Bloomberg Terminal",
      "type": "story"
    },
    {
      "by": "goodcanadian",
      "descendants": 0,
      "id": 28026437,
      "score": 1,
      "time": 1627827952,
      "title": "Elon Musk: 'I don't want to be CEO of anything'",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/technology-58035124"
    },
    {
      "by": "stiray",
      "descendants": 0,
      "id": 28026426,
      "score": 1,
      "time": 1627827839,
      "title": "Amazon hit with record EU data privacy fine, 746 million euros",
      "type": "story",
      "url": "https://www.reuters.com/business/retail-consumer/amazon-hit-with-886-million-eu-data-privacy-fine-2021-07-30/"
    },
    {
      "by": "threadthread",
      "descendants": 0,
      "id": 28026416,
      "score": 1,
      "time": 1627827755,
      "title": "The Toaster Project",
      "type": "story",
      "url": "https://www.dezeen.com/2009/06/27/the-toaster-project-by-thomas-thwaites/"
    },
    {
      "by": "bingden",
      "descendants": 0,
      "id": 28026390,
      "score": 2,
      "time": 1627827539,
      "title": "Learnfun and playfun: a general technique for automating NES games (2013)",
      "type": "story",
      "url": "http://tom7.org/mario/"
    },
    {
      "by": "SecretJane",
      "descendants": 0,
      "id": 28026389,
      "score": 1,
      "time": 1627827537,
      "title": "How crypto uses open banking?",
      "type": "story",
      "url": "https://nordigen.com/en/blog/how-crypto-uses-open-banking/"
    }
  ]
}