{
  "stories": [
    {
      "by": "jstx1",
      "descendants": 0,
      "id": 31003912,
      "score": 1,
      "text": "I read about this in a kind of new-agey self-help book more than 10 years ago and I don&#x27;t remember the author or the book title. I&#x27;m looking for the source. It&#x27;s something like this:<p>1. Something happens to you - interaction with a person, some mundane or significant event, whatever it is.<p>2. You have your &quot;first response&quot; to it - that&#x27;s the first thought that comes to you after the event, maybe it&#x27;s your first reaction when you read a comment online, or when a colleague does something you don&#x27;t like etc.<p>3. You discard your first response and think &quot;if that&#x27;s not my response, then what is&quot;. A second possible response comes up in your head.<p>4. Repeat steps 2 and 3 for a while - possible ways to respond occur to you and you discard them.<p>The general idea was that the later responses are more mature, more compassionate, more useful etc.<p>Any idea where this is from?",
      "time": 1649777062,
      "title": "Ask HN: What is this mental technique called?",
      "type": "story"
    },
    {
      "by": "Abishek_Muthian",
      "descendants": 0,
      "id": 31003872,
      "score": 1,
      "time": 1649776861,
      "title": "Demand Evidence to Worry",
      "type": "story",
      "url": "https://abishekmuthian.com/demand-evidence-to-worry/"
    },
    {
      "by": "emacs28",
      "descendants": 0,
      "id": 31003868,
      "score": 1,
      "text": "I don&#x27;t have a whole lot of experience yet working for companies, and I&#x27;m trying to plan ahead for what my tool flow might be like when I do and what the approval process might be like for installing tools.<p>I&#x27;m sure the exact procedure varies from place to place, but let&#x27;s say for example that the work computer is Linux and I want to build &amp; run the latest emacs on it. But to do that I first need to install libsXYZ.deb&#x2F;rpm. Do I need approval first to install emacs, as well as for each lib that is installed (even if I can install them without using sudo)?<p>Do I need approval for every proceeding emacs minor mode, Linux lib, Python package, etc. that are installed? I currently tend to install many open source tools and libs to aid me and that would seem like a hassle getting approval for each one. That also seems like it would slow down debugging what packages are missing when resolving Linux dependency issues etc.",
      "time": 1649776843,
      "title": "Ask HN: What can you install on a work computer?",
      "type": "story"
    },
    {
      "by": "danifb",
      "descendants": 1,
      "id": 31003839,
      "kids": [
        31003856
      ],
      "score": 2,
      "time": 1649776706,
      "title": "A",
      "type": "story"
    },
    {
      "by": "wslh",
      "descendants": 0,
      "id": 31003822,
      "score": 1,
      "time": 1649776637,
      "title": "Class Action Alleges Uniswap Labs Has Done Nothing to Stop Fraud",
      "type": "story",
      "url": "https://www.classaction.org/news/scam-tokens-class-action-alleges-uniswap-labs-has-done-nothing-to-stop-rampant-fraud-on-crypto-exchange"
    },
    {
      "by": "SirLJ",
      "descendants": 0,
      "id": 31003807,
      "score": 1,
      "time": 1649776596,
      "title": "Space balloon company offers first look at luxury cabins",
      "type": "story",
      "url": "https://www.france24.com/en/live-news/20220412-space-balloon-company-offers-first-look-at-luxury-cabins"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31003798,
      "score": 1,
      "time": 1649776547,
      "title": "A Survey of Trust Use and Modeling in Real Online Systems (2007)",
      "type": "story",
      "url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.2049&rep=rep1&type=pdf"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31003796,
      "score": 1,
      "time": 1649776530,
      "title": "Who are the woke? If you don’t know, that is the point",
      "type": "story",
      "url": "https://greyenlightenment.com/2022/04/11/who-are-the-woke-if-you-dont-know-that-is-the-point/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31003788,
      "score": 1,
      "time": 1649776491,
      "title": "The Tech Backlash",
      "type": "story",
      "url": "https://compactmag.com/article/the-real-tech-backlash"
    },
    {
      "by": "sdcoffey",
      "descendants": 0,
      "id": 31003785,
      "score": 1,
      "text": "Hey HN,<p>I&#x27;m Steve, co-founder of Factor.fyi, a new data platform for querying and visualizing financial datasets using SQL. During the pandemic, I took much more of an active role in managing my portfolio. I wanted to be able to make informed decisions about the investments I was making, and explore financial data in new ways. Market and Econ data are some of the most talked-about and widely-available datasets out there, but I was frustrated by the lack of options to answer questions I had, like, &quot;What would have happened if I had started dollar-cost averaging VTI back in 2013?&quot;[1] Or, &quot;How many days did BTC and ETH move in the same direction as the S&amp;P500?&quot;[2]. We built Factor to answer these questions. You can use Factor to query disparate datasets in ways that are impossible on any other platform. We currently have 20 datasets [3] that you can use to answer questions you have about the markets and create beautiful visualizations around them. Factor is community-powered and free forever; you can browse our community-built charts here [4].<p>We&#x27;d love to get feedback from the HN community, hear your thoughts on what datasets we can add, and get advice on how we can make the querying experience even easier for those new to SQL.<p>[1]: <a href=\"https:&#x2F;&#x2F;factor.fyi&#x2F;questions&#x2F;dollar-cost-averaging-the-market-since-2013-a1ikcvysfi\" rel=\"nofollow\">https:&#x2F;&#x2F;factor.fyi&#x2F;questions&#x2F;dollar-cost-averaging-the-marke...</a>\n[2]: <a href=\"https:&#x2F;&#x2F;factor.fyi&#x2F;questions&#x2F;s-p-btc-dia-correlation-factor-by-week-since-2019-a57q11kzxw\" rel=\"nofollow\">https:&#x2F;&#x2F;factor.fyi&#x2F;questions&#x2F;s-p-btc-dia-correlation-factor-...</a>\n[3]: <a href=\"https:&#x2F;&#x2F;factor.fyi&#x2F;docs&#x2F;dataset-reference\" rel=\"nofollow\">https:&#x2F;&#x2F;factor.fyi&#x2F;docs&#x2F;dataset-reference</a>\n[4]: <a href=\"https:&#x2F;&#x2F;factor.fyi&#x2F;browse\" rel=\"nofollow\">https:&#x2F;&#x2F;factor.fyi&#x2F;browse</a>",
      "time": 1649776478,
      "title": "Show HN: Factor.fyi – use SQL to visualize financial, crypto and econ datasets",
      "type": "story",
      "url": "https://factor.fyi"
    }
  ]
}