{
  "stories": [
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28008257,
      "score": 1,
      "time": 1627654748,
      "title": "Tencent Is World’s Worst Stock Bet with $170B Wipeout",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-07-29/tencent-is-world-s-worst-stock-bet-after-170-billion-wipeout"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 28008253,
      "score": 1,
      "time": 1627654739,
      "title": "Breakthrough Covid infections show ‘unvaccinated putting the vaccinated at risk’",
      "type": "story",
      "url": "https://www.pbs.org/newshour/health/breakthrough-covid-infections-show-the-unvaccinated-are-now-putting-the-vaccinated-at-risk"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28008245,
      "score": 2,
      "time": 1627654708,
      "title": "Pandemic hurt low-wage workers the most, the recovery has helped them the least",
      "type": "story",
      "url": "https://www.brookings.edu/research/the-pandemic-hurt-low-wage-workers-the-most-and-so-far-the-recovery-has-helped-them-the-least/"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28008232,
      "score": 1,
      "time": 1627654674,
      "title": "Framework Laptop Teardown: 10/10, But is it Perfect?",
      "type": "story",
      "url": "https://www.ifixit.com/News/51614/framework-laptop-teardown-10-10-but-is-it-perfect"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 28008227,
      "score": 1,
      "time": 1627654631,
      "title": "How Many People Are at Risk of Losing Their Homes in Your Neighborhood?",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/28/opinion/covid-eviction-moratorium.html"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28008217,
      "score": 1,
      "time": 1627654574,
      "title": "Neurotransmitter Levels in the Brain Predict Math Ability",
      "type": "story",
      "url": "https://scitechdaily.com/neurotransmitter-levels-in-the-brain-predict-math-ability/"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 28008202,
      "score": 1,
      "time": 1627654499,
      "title": "Eternal Change for No Energy: A Time Crystal Finally Made Real",
      "type": "story",
      "url": "https://www.quantamagazine.org/first-time-crystal-built-using-googles-quantum-computer-20210730/"
    },
    {
      "by": "chmaynard",
      "descendants": 0,
      "id": 28008188,
      "score": 3,
      "time": 1627654406,
      "title": "The Future of Work at Cloudflare",
      "type": "story",
      "url": "https://blog.cloudflare.com/the-future-of-work-at-cloudflare/"
    },
    {
      "by": "ekianjo",
      "descendants": 0,
      "id": 28008175,
      "score": 1,
      "time": 1627654325,
      "title": "Steam Deck: EAC, Performance, Wayland, and More",
      "type": "story",
      "url": "https://boilingsteam.com/steam-deck-6-new-points-you-need-to-know/"
    },
    {
      "by": "vm",
      "descendants": 2,
      "id": 28008172,
      "kids": [
        28008250,
        28008246
      ],
      "score": 4,
      "text": "Hi HN, we’re Vineet and Chris, founders of HomeBreeze (<a href=\"https:&#x2F;&#x2F;www.homebreeze.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.homebreeze.com</a>). We make booking home services radically simpler for homeowners. We do this by using details about the home to provide upfront, guaranteed prices and instant scheduling, with work completed by a network of qualified professionals. We’re starting with hot water heater replacements and are live in Southern California so far.<p>Many homeowners struggle to find contractors who will provide quality work without gouging them on price. They burn hours of time contacting pros and hosting onsite scoping visits, just to get prices and availability—with little insight on quality. Lead generation platforms like Angi and Thumbtack only solve a narrow slice of the problem - finding pros - without helping to price, schedule, or guarantee work quality.<p>For contractors, it’s hard to manage lead generation and sales, while spending most of the day in the field, doing work. To grow their business, contractors often buy expensive leads from Angi, HomeAdvisor, Thumbtack and more, but convert those leads poorly because of their unreliable communication. Because of the high stakes, they spend nights and weekends following up to sales calls. Great for the lead generation platforms, but bad for both service pros and homeowners.<p>Chris bought his first home and experienced this first-hand. Quotes to paint the outside of the house ranged from $7K to $25K and getting painters to show up for quotes took hours across dozens of phone calls and text messages. Digging into the problem, we found complex operations and a fragmented, old-school market. I had worked at Opendoor and Chris at UberEats for years, so we were no strangers to operational complexity. We decided to build the solution.<p>With just a little bit of information from homeowners, we give them upfront, honest prices for water heater installations (and soon other home services). They can schedule online if they’d like to move forward. Nearly all service pros we talk with insist on scheduling an on-site visit before providing prices. Our clients can avoid this time-consuming step and almost always get better prices.<p>On the backend, we’ve built a system that takes those inputs and prices jobs fairly, based on criteria we’ve gotten from our network of service professionals. We match the jobs with the plumbers who we know are available to do them. Importantly, we enforce strict quality standards by remotely auditing before&#x2F;after photos of the installation, aligning contractors to our quality principles before their first job with us, and verifying that every plumber in our network is licensed and insured.<p>I’m sure every homeowner in this community has had their own experiences with home services. We’ve love to hear about them - the good and the bad - and get feedback on our initial approach.",
      "time": 1627654285,
      "title": "Launch HN: HomeBreeze (YC W21) – Easy booking of home repairs",
      "type": "story"
    }
  ]
}