{
  "stories": [
    {
      "by": "__m",
      "descendants": 0,
      "id": 29850754,
      "score": 1,
      "time": 1641642310,
      "title": "Tesla FSD will rise to $12k Jan.17",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1479590995595517958"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 29850734,
      "score": 1,
      "time": 1641642124,
      "title": "Latency",
      "type": "story",
      "url": "https://xkcd.com/2565/"
    },
    {
      "by": "PozitivnaMirta",
      "descendants": 0,
      "id": 29850726,
      "score": 1,
      "text": "Inspired by Facebook&#x27;s whistleblower confession about how Facebook (among some other apps) cares more about negative content and doesn&#x27;t care about privacy, I decided to create an open-source chat app.<p>This chat app doesn&#x27;t save any history or messages in the database. Chat history is active as long as you are in the conversation screen, once you go back or close it, messages are not there. Some kind of &quot;live chat&quot;.<p>I made it open-source because I want people to be able to see how their data is being used and to see the truth behind the scene. By not open-sourcing the code it would by only my word &quot;I&#x27;m not saving history&quot;, in this way it&#x27;s tangible.<p>I published the backend part on GitHub, the app is coming soon. You can follow me on Twitter (https:&#x2F;&#x2F;twitter.com&#x2F;PozitivnaMirta) for more updates on my progress. Also you&#x27;ll find there Github repos.",
      "time": 1641642041,
      "title": "Show HN: Open-source chat app that saves NO messages, anywhere, ever",
      "type": "story"
    },
    {
      "by": "bikramgig",
      "descendants": 0,
      "id": 29850703,
      "score": 1,
      "time": 1641641697,
      "title": "Practical Common Lisp",
      "type": "story",
      "url": "https://gigamonkeys.com/book/"
    },
    {
      "by": "bikramgig",
      "descendants": 0,
      "id": 29850694,
      "score": 1,
      "text": "I have a new year resolution to learn lisp this year. This forum is the inspiration for this resolution. Thank you hn folks. I read some chapters of practical common lisp but it feels a little outdated. Is it still good book to learn lisp? Is there other book recommendation? Is Common lisp a good choice for modern time or is another Lisp recommended now a days? Thanks in advance.",
      "time": 1641641616,
      "title": "Ask HN: What is a good resource to learn Lisp in 2022?",
      "type": "story"
    },
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 29850688,
      "score": 1,
      "time": 1641641478,
      "title": "Sensing Gravity, the Quantum Way",
      "type": "story",
      "url": "https://physicsworld.com/a/sensing-gravity-the-quantum-way/"
    },
    {
      "by": "knrdl",
      "descendants": 0,
      "id": 29850678,
      "score": 1,
      "time": 1641641338,
      "title": "Show HN: CASA – Outsource service administration per Container",
      "type": "story",
      "url": "https://github.com/knrdl/casa"
    },
    {
      "by": "adabaed",
      "descendants": 0,
      "id": 29850665,
      "score": 1,
      "text": "Hello! Just wanted to share what just happened to me, maybe some Apple SWE here can take a look at this. I recently changed my macbook and created a new Apple ID for the new machine. For work, I like to have a unique ID and not reuse old ones. The problem is that, today, after 2 days of &quot;use&quot; (the first time the laptop is charged is to reinstall everything), Apple decided without notification that my account should be blocked for &quot;security reasons&quot;.<p>I tried to reset my password, but they blocked the whole account, it seems to me that they even deleted the account from the database as they could not locate the ID of other information (name, mail, etc.). Coming from another OS, one can imagine that you can swap two IDs and continue, but ... NO! Here you need to provide a password to log out, but since my account has been deleted, I don&#x27;t have any password. Also, one can imagine that a +2000$ machine designed for &quot;professional&quot; users can actually recover from these types of errors using magic links or text messages. They wanted me to wait for an appointment with the service. Just to reset an account!!<p>Why did I reinstall all? Every 30 seconds, a message appears asking me to check the ID.<p>TL;DR: Adult human crying.",
      "time": 1641641213,
      "title": "Tell HN: Full macOS reinstall because Apple ID",
      "type": "story"
    },
    {
      "by": "ahmadrosid",
      "descendants": 0,
      "id": 29850664,
      "score": 1,
      "time": 1641641193,
      "title": "Show HN: Set Wallpaper from Your Terminal",
      "type": "story",
      "url": "https://github.com/ahmadrosid/wlp"
    },
    {
      "by": "IAmEveryone",
      "descendants": 0,
      "id": 29850640,
      "score": 2,
      "time": 1641640915,
      "title": "Draft: Tencent Code of Conduct",
      "type": "story",
      "url": "https://github.com/TencentARC/GFPGAN/issues/110"
    }
  ]
}