{
  "stories": [
    {
      "by": "mellowside",
      "descendants": 0,
      "id": 32182544,
      "score": 1,
      "text": "Context: I&#x27;m 28yo manual QA Engineer in need to advance my skills. I don&#x27;t see automation testing as the next step, but as something complementary. I&#x27;ve been dabbling with tech since I was 13yo and creating phpBB forums and Wordpress Sites and whatnot. I&#x27;ve never learned to program properly, besides improvisations and code editing in front-end projects, because I always thought of myself as being too stupid to do so + growing up in an ex communist country where you were not encouraged to learn by yourself, and you were labelled from a young age as being bright, average or dumb. Thus I&#x27;ve developed inefficient learning processes, biases about myself and a habit to abandon every learning path I took besides Medical Engineering. I sticked to ME due to the support I had from my very bright colleagues who didn&#x27;t give up on me and taught me stuff without making me feel bad for not knowing it beforehand - an obvious thing which I didn&#x27;t realise, my therapist said I might be on the autism spectrum. That&#x27;s when my thirst for tech and learning went nuts, but I didn&#x27;t manage to overcome the aforementioned learning deficiencies. I&#x27;m capable of understanding stuff fast if I don&#x27;t feel that stuff as a burden or a test. I realised I have a phobia o tests. All my dev friends suggested me at one point or another that I would be a good fit for development, but they&#x27;ve also suggested I am also capable to find my own learning path and&#x2F;or gave ambiguous advice which my thick brain couldn&#x27;t discern.<p>Currently I need to learn Java&#x2F;Kotlin for my current job. Obviously I&#x27;m lacking basic CS knowledge but I&#x27;m comfortable with crappy tutorials or  terminals. And not afraid of any complex thing. I&#x27;m just incredibly confused; basically I don&#x27;t even know what I don&#x27;t know about where to start given my current condition.<p>I was thinking about pretending to forget everything I know, this strategy helped me pass 3 ISTQB certifications in 10 months from the first try, but it took a great amount of energy to not let personal experience influence the learning process or exam questions interpretations.<p>Where would I need to start? there are basic CS courses on Coursera for example, but the offer is too big and thus confusing. Does basic CS come with a trimmed down version of OOP or should that be done completely separately? should I start with a scripting language like Python and learn about OOP with it as well?<p>How would you do it if you were me + my current circumstances?<p>Any input, be it even negative, is better than no input. Sorry for this soup of ideas, I&#x27;m confused by it as well daily.",
      "time": 1658425991,
      "title": "Engineers, what path of learning CS would you take today?",
      "type": "story"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32182535,
      "score": 1,
      "time": 1658425952,
      "title": "Volcanic ash, victims, and tsunami debris from Late Bronze Age Thera eruption",
      "type": "story",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2114213118"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 32182510,
      "score": 1,
      "time": 1658425865,
      "title": "The outer limits: Future economic growth in the face of diminishing resources",
      "type": "story",
      "url": "https://phys.org/news/2022-07-outer-limits-future-economic-growth.html"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 32182506,
      "score": 1,
      "time": 1658425847,
      "title": "First Polio case in almost 10 years confirmed in New York state",
      "type": "story",
      "url": "https://spectrumlocalnews.com/nys/central-ny/ny-state-of-politics/2022/07/21/new-york-health-department--polio-case-confirmed-in-rockland-county"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 32182502,
      "score": 1,
      "time": 1658425787,
      "title": "What UK telecoms operators need to know about the UK/USA Data Access Agreement",
      "type": "story",
      "url": "https://decoded.legal/blog/2022/07/what-uk-telecoms-operators-need-to-know-about-the-ukusa-data-access-agreement-and-the-us-cloud-act"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 32182500,
      "score": 1,
      "time": 1658425775,
      "title": "The status and prospect of DUPIC fuel technology",
      "type": "story",
      "url": "https://www.researchgate.net/publication/264177252_The_status_and_prospect_of_DUPIC_fuel_technology"
    },
    {
      "by": "intrasight",
      "descendants": 0,
      "id": 32182489,
      "score": 2,
      "text": "I am increasing my rate. Haven&#x27;t done so in years. Client is going to be shocked. Project manager said &quot;as long as you can justify it&quot;. I could just say &quot;inflation&quot;, but I think he means that I link to some published rate metrics. I did some googling and only found an IEEE rate guide - which costs $45. Anyone have some resources to share?",
      "time": 1658425714,
      "title": "Ask HN: Budget season. How to justify rate?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32182473,
      "score": 1,
      "time": 1658425654,
      "title": "DHS, ICE Buying Up Troves of Cell Phone Location Data",
      "type": "story",
      "url": "https://www.rollingstone.com/politics/politics-news/ice-dhs-privacy-location-data-aclu-1384797/"
    },
    {
      "by": "vageli",
      "descendants": 0,
      "id": 32182469,
      "score": 1,
      "time": 1658425644,
      "title": "Statement from Press Secretary Karine Jean-Pierre",
      "type": "story",
      "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/21/statement-from-press-secretary-karine-jean-pierre/"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 32182454,
      "score": 1,
      "time": 1658425572,
      "title": "The Linear Frog",
      "type": "story",
      "url": "https://www.solipsys.co.uk/new/TheLinearFrog.html?vg21hn"
    }
  ]
}