{
  "stories": [
    {
      "by": "jiaaro",
      "descendants": 0,
      "id": 32015744,
      "score": 1,
      "time": 1657209835,
      "title": "Show HN: Dynamesa – A Simple DynamoDB Client",
      "type": "story",
      "url": "https://github.com/jiaaro/dynamesa"
    },
    {
      "by": "harscoat",
      "descendants": 0,
      "id": 32015728,
      "score": 2,
      "time": 1657209749,
      "title": "The simplest link between probability and information",
      "type": "story",
      "url": "https://twitter.com/johncarlosbaez/status/1545058735114006540"
    },
    {
      "by": "donutshop",
      "descendants": 1,
      "id": 32015704,
      "kids": [
        32015743,
        32015722
      ],
      "score": 1,
      "text": "Dear Supporters,<p>I need your help.<p>All the problems in the world that I&#x27;ve set out to try to solve with WikiTribune Social are as bad as ever. We&#x27;re all seeing the possibility that Elon Musk will buy twitter and turn it into a radical free speech troll zone. He’s notorious himself for bad behavior on twitter - he definitely won&#x27;t make twitter less toxic. He’s promised to allow Donald Trump back on the platform in the name of ‘free speech’, but let&#x27;s be clear what he really wants: Trump kept twitter on the front page of every newspaper in the world for half a decade and it&#x27;s very profitable for them to bring him back, no matter the cost.<p>WikiTribune has a different model. A strange model, to be sure, but it&#x27;s one that I believe in. We don’t want our platform to grow by focussing on having as many pageviews as possible by maximizing addiction and outrage. We want to build something that people like you care enough about to support voluntarily, financially. It&#x27;s a &quot;pay if you want&quot; model. I&#x27;ve joked many times - it may not be a great business model to give things away and hope people will voluntarily support them - but this is how I&#x27;ve built my career so far!\nWe are severely short on funds<p>There&#x27;s no simple way to avoid saying it. I&#x27;ve chosen not to raise venture capital money because I want to maintain full creative control to build the vision that I have in mind. Over the past two years, I&#x27;ve been personally the major funder of the project - but it&#x27;s straining my personal resources.<p>Over the past several months, we&#x27;ve gone back to the codebase and completely re-architected it from scratch pulling from everything that we&#x27;ve learned so far. We&#x27;ve got a great small community and the new software will have new ways to support and reward people for making quality posts (instead of how all other social networks reward people for making viral addictive fluff). Finishing this redesign will have a huge impact. I&#x27;m excited about it!<p>But to finish, I need your support. I have to pay for the development work to finish the new version of the site, and I need to do some PR and marketing to get the word out. I need to really start pushing this forward as a relaunch. If each of you can afford to give even a little, I think we have a real shot at making something revolutionary and new. We won&#x27;t know unless we keep trying.<p>This is our chance to break the back of toxic social media by offering a better alternative. With Musk’s impending Twitter purchase, and the US elections approaching, time is short to create a space for healthier discourse, so please donate today.<p>Jimmy Wales",
      "time": 1657209627,
      "title": "From Jimmy Wales – WT.Social Needs Your Help",
      "type": "story"
    },
    {
      "by": "otoburb",
      "descendants": 0,
      "id": 32015695,
      "score": 1,
      "time": 1657209577,
      "title": "CXL Enables Microsoft Azure to Cut Server CapEx by 100s of Millions of Dollars",
      "type": "story",
      "url": "https://semianalysis.substack.com/p/cxl-enables-microsoft-azure-to-cut"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 32015690,
      "score": 1,
      "time": 1657209562,
      "title": "Security Risks Widen with Commercial Chiplets",
      "type": "story",
      "url": "https://semiengineering.com/security-risks-widen-with-commercial-chiplets/"
    },
    {
      "by": "fairytalemtg",
      "descendants": 0,
      "id": 32015681,
      "score": 1,
      "text": "What are some jobs and roles that will be gone forever?<p>When recession and unemployment are influx, may jobs get an uplift or there is huge shift is roles and positions. Any jobs that might go away forever?",
      "time": 1657209501,
      "title": "Ask HN: Jobs Without Growth and Recognition",
      "type": "story"
    },
    {
      "by": "minimaxir",
      "descendants": 0,
      "id": 32015665,
      "score": 1,
      "time": 1657209409,
      "title": "Introducing Collectible Avatars",
      "type": "story",
      "url": "https://old.reddit.com/r/reddit/comments/vtkmni/introducing_collectible_avatars/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32015661,
      "score": 1,
      "time": 1657209393,
      "title": "Early Product Lessons (2016)",
      "type": "story",
      "url": "https://www.mooreds.com/wordpress/archives/2228"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32015655,
      "score": 1,
      "time": 1657209386,
      "title": "Same, Same but Different with Vanta and Zapier",
      "type": "story",
      "url": "https://www.ycombinator.com/blog/same-same-but-different-with-vanta-and-zapier/"
    },
    {
      "by": "RabbitUpRabbit",
      "descendants": 0,
      "id": 32015651,
      "score": 1,
      "time": 1657209341,
      "title": "Irish regulator moves closer to ban on Facebook EU-U.S. data flows",
      "type": "story",
      "url": "https://www.reuters.com/technology/irish-regulator-moves-closer-possible-ban-facebook-instagram-eu-us-data-flows-2022-07-07/"
    }
  ]
}