{
  "stories": [
    {
      "by": "LittleMoveBig",
      "descendants": 0,
      "id": 30558093,
      "score": 1,
      "time": 1646416810,
      "title": "California proposal would force unhoused people into treatment",
      "type": "story",
      "url": "https://static.guim.co.uk/images/favicon-32x32.ico"
    },
    {
      "by": "vaghetti",
      "descendants": 0,
      "id": 30558087,
      "score": 1,
      "time": 1646416794,
      "title": "Putin reportedly blocks Russians’ access to Facebook, Twitter, app stores",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/03/putin-reportedly-blocks-russians-access-to-facebook-twitter-app-stores/"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 30558067,
      "score": 1,
      "time": 1646416710,
      "title": "One secret tip for first-time OSS contributors",
      "type": "story",
      "url": "https://buttondown.email/bhupesh/archive/one-secret-tip-for-first-time-oss-contributors/"
    },
    {
      "by": "janj",
      "descendants": 0,
      "id": 30558062,
      "score": 1,
      "time": 1646416692,
      "title": "New California Compost Law Goes into Effect",
      "type": "story",
      "url": "https://www.jdsupra.com/legalnews/new-california-compost-law-goes-into-3245289/"
    },
    {
      "by": "lukastyrychtr",
      "descendants": 0,
      "id": 30558054,
      "score": 1,
      "time": 1646416665,
      "title": "Modern Telecom Network Tracing",
      "type": "story",
      "url": "https://oxio.com/blog/modern-telecom-network-tracing/"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30558052,
      "score": 1,
      "text": "Given that most countries have benefitted from war, how could one argue that the invasion of Ukraine is wrong in an absolute sense that most Russians would agree with?",
      "time": 1646416657,
      "title": "Ask HN: How to argue that the invasion of Ukraine is wrong in an absolute sense?",
      "type": "story"
    },
    {
      "by": "qwertyuiop_",
      "descendants": 0,
      "id": 30558049,
      "score": 1,
      "time": 1646416642,
      "title": "Intracellular Reverse Transcription of Pfizer mRNA Vaccine in Liver Cells",
      "type": "story",
      "url": "https://www.mdpi.com/1467-3045/44/3/73/htm#B39-cimb-44-00073"
    },
    {
      "by": "siersciu",
      "descendants": 0,
      "id": 30558020,
      "score": 1,
      "text": "Hi HN,\nI&#x27;m Marek Dopiera and I wanted to share the digital signature solution which I made with my software house. Your feedback would be much appreciated.<p>We&#x27;ve just launched it - it&#x27;s a service for signing documents over e-mail - <a href=\"https:&#x2F;&#x2F;mailwitness.com\" rel=\"nofollow\">https:&#x2F;&#x2F;mailwitness.com</a>. It still has some rough edges, but hopefully it is useful already.<p>To sign a PDF with somebody, you e-mail them the PDF and put sign@mailwitness.com in CC. If they agree, they need to forward it to sign@mailwitness.com. When they do, you all get your document signed. You can generate PDFs from e-mail, too for convenience.<p>We made this to raise the safety bar of agreements made via e-mail. Via anecdotal evidence, we know that if people do not use services like DocuSign or HelloSign, they consider an e-mail conversation as proof or they print, sign and scan documents. I think we&#x27;re offering more safety and convenience, because we&#x27;re preventing the documents from alteration, forging fakes and backdating (by using OpenTimestamp, which essentially constructs a Merkle tree and puts its root into a Bitcoin transaction).<p>I&#x27;m hoping that our service becomes useful also because it doesn&#x27;t require any sign-up (just one confirmation e-mail for Ts&amp;Cs), it&#x27;s free (in the basic model) and doesn&#x27;t require the extra cognitive load on learning a web app or a mobile app.<p>You may argue, that one can create a fake e-mail account and use that. That&#x27;s a valid point, but the reality proves that verification via e-mail is enough for lots of people (vide the agreements over e-mail or DocuSign or HelloSign). In the future we may create paid options, which would include extra identity verification. Even without that extra option, things are not as bad, though: if you use your work e-mail, it&#x27;s usually your employer who verified your identity.<p>Another question you might have is spoofing. If your e-mail has a valid DKIM signature (which is the case for most major e-mail providers), we&#x27;ll accept your message. If it doesn&#x27;t we&#x27;ll send you a message to verify that you can also receive e-mail.<p>For data safety, we have designed the service such that we discard the documents as soon as we process an e-mail (usually a low number of seconds).<p>Finally, there is legal safety. We operate under the EU law, which qualifies us as a &quot;Trust service provider&quot; and puts requirements on our service. What we do, qualifies as an &quot;Advanced Digital Signature&quot; and according to the EU law, cannot be denied legal effect based on the grounds that it is digital.<p>Monetization path is unclear yet - I want to see if this catches on and if yes, how people are going to use it. Some options include extra services like using your own certificate rather than ours or identity verification.<p>I would really love to hear your feedback - especially for what reasons you would not use it.<p>Thank you",
      "time": 1646416561,
      "title": "Show HN: Mailwitness – Digital Signatures over Email",
      "type": "story",
      "url": "https://mailwitness.com"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30557964,
      "score": 1,
      "time": 1646416307,
      "title": "Where Russia gets its chips",
      "type": "story",
      "url": "https://www.protocol.com/newsletters/protocol-enterprise/russia-ukraine-chips-shields-up"
    },
    {
      "by": "SamCritch",
      "descendants": 1,
      "id": 30557904,
      "kids": [
        30558034
      ],
      "score": 1,
      "time": 1646416005,
      "title": "Australian ‘Infinity Train’ uses gravity to recharge batteries",
      "type": "story",
      "url": "https://www.railtech.com/rolling-stock/2022/03/04/australian-mining-company-works-on-infinity-train-using-gravity-to-regenerating-batteries/"
    }
  ]
}