{
  "stories": [
    {
      "by": "banjo_milkman",
      "descendants": 0,
      "id": 31943277,
      "score": 1,
      "time": 1656658777,
      "title": "Returned astronauts struggle to recover bone density",
      "type": "story",
      "url": "https://www.theguardian.com/science/2022/jun/30/lost-in-space-returned-astronauts-struggle-to-recover-bone-density-study-finds"
    },
    {
      "by": "matthewsinclair",
      "descendants": 0,
      "id": 31943276,
      "score": 1,
      "time": 1656658776,
      "title": "Pentagon finds concerning vulnerabilities on blockchain",
      "type": "story",
      "url": "https://www.techrepublic.com/article/pentagon-finds-concerning-vulnerabilities-on-blockchain/"
    },
    {
      "by": "bumbledraven",
      "descendants": 0,
      "id": 31943268,
      "score": 2,
      "time": 1656658710,
      "title": "DeepMind: Mastering the Game of Stratego with Model-Free Multiagent RL",
      "type": "story",
      "url": "https://arxiv.org/abs/2206.15378a"
    },
    {
      "by": "summerlight",
      "descendants": 0,
      "id": 31943267,
      "score": 1,
      "time": 1656658705,
      "title": "Apple now allows third party IAP for South Korean apps",
      "type": "story",
      "url": "https://developer.apple.com/news/?id=q0feipe4"
    },
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 31943265,
      "score": 1,
      "time": 1656658684,
      "title": "New map of ancient trees an opportunity for conservation",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/science-environment-61980467"
    },
    {
      "by": "ldmail",
      "descendants": 0,
      "id": 31943263,
      "score": 2,
      "time": 1656658646,
      "title": "Analyzing 31M Real-World Logins to Improve Risk-Based Authentication",
      "type": "story",
      "url": "https://riskbasedauthentication.org/analysis/largescale/"
    },
    {
      "by": "alberto_ol",
      "descendants": 0,
      "id": 31943257,
      "score": 1,
      "time": 1656658621,
      "title": "Steven Pinker and I debate AI scaling",
      "type": "story",
      "url": "https://scottaaronson.blog/?p=6524"
    },
    {
      "by": "Probiotic6081",
      "descendants": 0,
      "id": 31943253,
      "score": 2,
      "text": "Dear HN, I&#x27;m pathologically terrible at making important decisions, and I can&#x27;t step away from them to the point it&#x27;s making me physically nauseous.<p>Right now, I&#x27;m deciding between a master&#x27;s in the biomedical field that I long dreamed of, and working as a SWE. I used to be certain I&#x27;d want to become a researcher, but in recent months I have either lost my idealism or became more pragmatic. I&#x27;m very close to receiving an offer as a SWE at a company that looks like a super nice company, remote options, interesting work, with a lot of opportunities to grow. The recruiter and developers I interviewed with seemed extremely nice and happy to talk about the company.\nThere are two offices in two European cities I like and that employees apparently can choose pretty flexibly to work in, which is cool.<p>The master&#x27;s program involves about a year of (unpaid) lab work, so I started to ask myself what&#x27;s the point of putting myself through this if I&#x27;m not planning on doing a PhD afterwards (it&#x27;s in Europe, tuition is cheap.) At the same time, I have always been a scientifically minded&#x2F;interested person, and getting more actual research experience and training in scientific working might be rewarding in itself, and except for the last months I was always more passionate about science than working in software development and chasing a big paycheck. Plus, I think I would prefer seeing myself as a scientist who ended up in SWE due to the better working conditions, and somehow prove to myself that I can do it by doing the masters.<p>Clearly this is a very emotionally loaded decision for me, so I&#x27;d like to ask for guidance and hear about how anyone who&#x27;s been in a similar situation came to make a decision.<p>Also, would doing a masters in an unrelated field make me a less attractive candidate when later applying for junior SWE roles and I already graduated 2 years ago?",
      "time": 1656658606,
      "title": "Ask HN: How do you make decisions with high opportunity costs?",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31943241,
      "score": 1,
      "time": 1656658513,
      "title": "Artists Get Paid from Streaming",
      "type": "story",
      "url": "https://pudding.cool/2022/06/streaming/"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31943219,
      "score": 1,
      "time": 1656658290,
      "title": "Tencent Cloud slaps googly eyes on a monitor, says it can care for oldies",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/01/tencent_cloud_slaps_two_eyes/"
    }
  ]
}