{
  "stories": [
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30401614,
      "score": 1,
      "time": 1645313850,
      "title": "Zero-Latency Enterprise (ZLE)",
      "type": "story",
      "url": "https://www.gartner.com/en/information-technology/glossary/zle-zero-latency-enterprise"
    },
    {
      "by": "xz18r",
      "descendants": 0,
      "id": 30401603,
      "score": 1,
      "time": 1645313767,
      "title": "Reporter infiltrates campaign of far-right presidential candidate Éric Zemmour",
      "type": "story",
      "url": "https://www.theguardian.com/world/2022/feb/17/french-reporter-infiltrates-campaign-of-far-right-presidential-candidate-eric-zemnour-france"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30401584,
      "score": 1,
      "text": "The idea is to make your dog talk by having it wear a computer that uses GPT-3 like technology that takes as input what you say and how your dog is currently behaving to make up relevant replies.<p>Imagine having a conversation with your dog about politics in a way that takes into account the current mood and behavior of your dog.<p>Would this idea be feasible?",
      "time": 1645313538,
      "title": "Ask HN: Use GPT-3 to make dogs talk while taking into account their mood?",
      "type": "story"
    },
    {
      "by": "apollinaire",
      "descendants": 0,
      "id": 30401570,
      "score": 1,
      "time": 1645313414,
      "title": "Arthur Wesley Dow’s Floating World: Composition (1905 Edition)",
      "type": "story",
      "url": "https://publicdomainreview.org/collection/dow-composition/"
    },
    {
      "by": "mrkramer",
      "descendants": 0,
      "id": 30401526,
      "score": 2,
      "text": "I use Google&#x27;s search products(Google Search, YouTube search etc.) on a daily basis and I see so many reasonable solutions that would significantly improve UX within Google Products but I don&#x27;t understand that designers and managers at Google are not seeing the same or similar solutions. Googles has decades of know-how and unbounded human, financial and computational resources but still they can not figure out things like:<p>My backlog: Google Search: 1. Crawl, index and rank audio content and add it next to Images and Videos in Google Search e.g. &quot;All Images Videos Audio Maps Books More&quot; so I can find and discover audio on the web.<p>2. Add tags in Google Search just like you added tags when searching in Google Images so I can find websites in specific category or in similar category or that I can find similar type of web content.<p>3. Just like GitHub has percentage of languages of source code within source code&#x27;s project page e.g. C++ 90% C 10% add percentage next to each web page or web page result in search results e.g. www.mybiologyblog.com Text 70%  Images 20% Videos 10% Audio 0%<p>YouTube: 1. Standardize both web version and mobile version; in web version on channel&#x27;s page I can search channel for videos on mobile I can not.<p>2. Add search option&#x2F;bar in comment section of videos so I can search for information that is relevant and useful to me.<p>3. Add search option&#x2F;bar to playlists so I can search for videos within my playlists.<p>4. Add Google Lens type search solution to YouTube so I can search &quot;within&quot; YouTube videos; frame by frame e.g. let&#x27;s say I watch Wild Animals documentary and I want to skip to lions part, machine learning(AI) can analyse frame by frame and point me to that part of the video(Google has similar solution but only for creators called &quot;Chapters&quot;). And use speech recognition so I have transcript and timestamps for YouTube videos or in anther words try to transcribe and timestamp audio of YouTube videos. Frame by frame and transcription solution are complementary.<p>I have other ideas for YouTube and Google Search in particular but this is my short list. For Google Search my focus is linguistic analysis of websites and I think greater focus should be put on analyzing websites&#x27; content(text, images, videos, audio, links etc.) not trying to guess what users want. Users will find good search results if your analysis and presentation of websites and their specifics&#x2F;qualities is good in Search Results page.<p>Also Google Chrome has some web search and web navigation problems that I would like to solve but that I can explain another time.",
      "time": 1645313020,
      "title": "Ask HN: Why are Google's search products bad if Google has decades of Know-how?",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30401522,
      "score": 2,
      "time": 1645312994,
      "title": "The Rise of NFT Fakefluencers",
      "type": "story",
      "url": "https://hackernoon.com/the-rise-of-nft-fakefluencers"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 30401516,
      "score": 2,
      "time": 1645312943,
      "title": "How the Philippines built 500km of bike lanes in less than a year",
      "type": "story",
      "url": "https://blogs.worldbank.org/transport/crisis-opportunity-how-philippines-built-500km-bike-lanes-less-year"
    },
    {
      "by": "jleightcap",
      "descendants": 1,
      "id": 30401508,
      "kids": [
        30401665,
        30401597
      ],
      "score": 2,
      "time": 1645312882,
      "title": "Obfuscated C Resume",
      "type": "story",
      "url": "https://jleightcap.srht.site/static/resume.c"
    },
    {
      "by": "balt1794",
      "descendants": 1,
      "id": 30401506,
      "kids": [
        30401507
      ],
      "score": 1,
      "time": 1645312881,
      "title": "Intelligence Prime Capital scam or real trading platform?",
      "type": "story",
      "url": "https://intelligenceprimecapital.com/"
    },
    {
      "by": "ksec",
      "descendants": 1,
      "id": 30401476,
      "kids": [
        30401505
      ],
      "score": 1,
      "time": 1645312670,
      "title": "Microsoft opened Activision acquisition talks three days after harassment report",
      "type": "story",
      "url": "https://www.engadget.com/microsoft-activision-blizzard-sec-filing-225923532.html"
    }
  ]
}