{
  "stories": [
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29880889,
      "score": 1,
      "time": 1641844147,
      "title": "From Greek to Latin: Visualizing the Evolution of the Alphabet",
      "type": "story",
      "url": "https://www.visualcapitalist.com/from-greek-to-latin-visualizing-the-evolution-of-the-alphabet/"
    },
    null,
    {
      "by": "paulcarroty",
      "descendants": 0,
      "id": 29880841,
      "score": 1,
      "time": 1641844037,
      "title": "Intel Mobileye EyeQ Ultra RISC-V processor targets Level 4 autonomous driving",
      "type": "story",
      "url": "https://www.cnx-software.com/2022/01/05/intel-mobileye-eyeq-ultra-risc-v-processor-targets-level-4-autonomous-driving/"
    },
    {
      "by": "forks",
      "descendants": 0,
      "id": 29880837,
      "score": 5,
      "time": 1641844023,
      "title": "We Built an LSP-Powered VS Code Extension with Rust, WASM, and TypeScript",
      "type": "story",
      "url": "https://www.osohq.com/post/building-vs-code-extension-with-rust-wasm-typescript"
    },
    {
      "by": "depressed",
      "descendants": 0,
      "id": 29880809,
      "score": 1,
      "text": "Once upon a time, I earned a degree in software engineering from a major university, and for the next seven years I worked a string of jobs in Silicon Valley. (Not really FAANG companies, but still names you would recognize.) During this time, I experienced episodes of brain fog, and near-constant depression and low energy. I struggled to hold down any developer position for more than a few months. I finally gave up, moved in with family, and started doing odd jobs, mostly IT-related.<p>Three years ago, I finally got my neurological disorder correctly diagnosed. It’s not cured, but I finally understand my triggers and can manage my symptoms. (I can discuss details in a comment below if people want, but this post is already too long.)<p>I’m trying to re-enter the software industry now, but I’m feeling a little lost. Providing work references is hard when you haven’t been in the field for five years, and everyone remembers you as the guy who was checked out all the time. I still have recruiters reaching out to me, but they always assume I have 10+ continuous years of experience, which I really do not, and none of those interviews have lead to job offers.<p>Where do I go from here? What places are likely to be open to a candidate that superficially looks overqualified, but comes with a dozen red flags?<p>Does it make sense to try to reset my career by going for a master’s degree? Should I double down on my (zero revenue so far) side projects until I have a respectable portfolio to share? Should I dive into open source contributions in hopes of getting references I can use for job applications? Or should I skip all that and aggressively apply to jobs now?<p>I still love programming. I believe that I’m good at it, when I’m not fighting other problems at the same time. If I’m going to work a 9-to-5 job, there really isn’t anything else I want to do.",
      "time": 1641843953,
      "title": "Ask HN: Re-entering the industry with a history of disability",
      "type": "story"
    },
    {
      "by": "MBCook",
      "descendants": 0,
      "id": 29880805,
      "score": 1,
      "time": 1641843935,
      "title": "Why Intel, AMD, and Nvidia will never beat an Apple Silicon Mac",
      "type": "story",
      "url": "https://www.macworld.com/article/563571/intel-amd-nvidia-processor-apple-silicon-mac.html"
    },
    {
      "by": "jedberg",
      "descendants": 1,
      "id": 29880772,
      "kids": [
        29880816
      ],
      "score": 2,
      "time": 1641843846,
      "title": "The case for a safe return to offices by mid-February",
      "type": "story",
      "url": "https://www.charterworks.com/omicron-offices-return/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29880757,
      "score": 1,
      "time": 1641843822,
      "title": "RRAM: A circuit that can function as a memory but also as a processor",
      "type": "story",
      "url": "https://www.lunduniversity.lu.se/article/nanowire-transistor-integrated-memory-enable-future-supercomputers"
    },
    {
      "by": "pehtis",
      "descendants": 0,
      "id": 29880749,
      "score": 4,
      "time": 1641843796,
      "title": "Moxie: “I've decided it's a good time to replace myself as the CEO of Signal”",
      "type": "story",
      "url": "https://twitter.com/moxie/status/1480619206240522240"
    },
    {
      "by": "chapulin",
      "descendants": 0,
      "id": 29880621,
      "score": 1,
      "time": 1641843444,
      "title": "One Chaste Marriage, Four Kids, and the Catholic Church",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/17/style/chaste-marriage-church.html"
    }
  ]
}