{
  "stories": [
    {
      "by": "syrk",
      "descendants": 0,
      "id": 30497654,
      "score": 1,
      "text": "https:&#x2F;&#x2F;helpgenie.org&#x2F;<p>tldr; A place for discovering and sharing ways to help each other.<p>I often feel unsure how to effectively help others during their times of trouble. This is particularly true for issues that are beyond my interpersonal relationships and are highly complex by nature. For example a war between two countries who&#x27;s histories, cultures, and politics I understand very little about. For the past few days I have been trying my best to understand the current conflict in Ukraine and found myself growing more and more inclined to help those suffering somehow. The thing is I&#x27;ve always been someone who prefers to contribute through action rather than donations. Just a personal preference. Yet most of the resources I have come across are suggestions to donate to one organization or another. Again this is great, and I highly commend those who donate their money, but I wanted to see if I couldn&#x27;t find a way to help in a way more natural to me. When a friend asked me today If I&#x27;d like to help contribute to an open source project archiving Russian radio communications channels I agreed and then realized this must not be the only project being worked on that can use assistance. There must be a whole world of issues being worked on in unique ways that people would gladly accept contribution towards. So I put together this quick prototype of what an index of that sort might look like.<p>While I hope to expand this too other issues as well, given the moment I&#x27;d appreciate any suggestion on how to help the people of Ukraine. The more diverse the suggestions the better. Additionally education material is great :)<p>Lastly, I put this together in a few hours so naturally I had to leave out much of what I&#x27;d ultimately like to see from a site like this. If you too find it promising give me a nudge and I&#x27;ll develop this further!",
      "time": 1646036977,
      "title": "Discover and share ways to help each other",
      "type": "story"
    },
    {
      "by": "devnull3",
      "descendants": 0,
      "id": 30497640,
      "score": 1,
      "time": 1646036814,
      "title": "Why Doctors Are Quitting Medicine",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=y4tNP5ms1q0"
    },
    {
      "by": "pizza",
      "descendants": 0,
      "id": 30497636,
      "score": 1,
      "time": 1646036789,
      "title": "Pregnancy risk tool cuts baby loss in black and Asian women",
      "type": "story",
      "url": "https://www.bbc.com/news/health-60524898"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30497632,
      "score": 1,
      "time": 1646036763,
      "title": "FAQ – solo-Masker,“one-way masking” – Optimal protection",
      "type": "story",
      "url": "https://text.npr.org/1083046757"
    },
    {
      "by": "indigodaddy",
      "descendants": 0,
      "id": 30497629,
      "score": 1,
      "time": 1646036725,
      "title": "Russia Sanctions over Ukraine Largely Spare Energy Sector, Vital to Europe",
      "type": "story",
      "url": "https://www.wsj.com/articles/russia-sanctions-over-ukraine-largely-spare-energy-sector-vital-to-europe-11645970890"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 30497628,
      "score": 1,
      "time": 1646036718,
      "title": "Practical Quantization in PyTorch",
      "type": "story",
      "url": "https://pytorch.org/blog/quantization-in-practice/"
    },
    {
      "by": "gripfx",
      "descendants": 0,
      "id": 30497616,
      "score": 1,
      "time": 1646036601,
      "title": "Lenovo announces the first Arm-based ThinkPad",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/02/lenovo-announces-the-first-arm-based-thinkpad/"
    },
    {
      "by": "jelliclesfarm",
      "descendants": 1,
      "id": 30497584,
      "kids": [
        30497609
      ],
      "score": 2,
      "time": 1646036204,
      "title": "How global media covered Russia's invasion of Ukraine",
      "type": "story",
      "url": "https://timesofindia.indiatimes.com/world/europe/how-global-media-covered-russias-invasion-of-ukraine/articleshow/89830743.cms"
    },
    {
      "by": "brtkdotse",
      "descendants": 0,
      "id": 30497574,
      "score": 1,
      "text": "After all brouhaha around GDPR over the past month or so, I&#x27;ve decided to port my sideproject from Azure, Netlify and DigitalOcean to a local provider.<p>I&#x27;ve found one that checks all the boxes, except they don&#x27;t offer any managed databases. Is it a fools errand to host my own Postgres database on a VPS? I&#x27;ve actually considered running everything off of (multliple instances of) SQLite so that I don&#x27;t have to manage Postgres.",
      "time": 1646036105,
      "title": "Ask HN: Tips on hosting your own Postgres instance",
      "type": "story"
    },
    {
      "by": "ramsrigouthamg",
      "descendants": 0,
      "id": 30497573,
      "score": 2,
      "text": "Hello HN readers,\nWe just launched Supermeme, an original AI meme generator that is very easy to use. You can pick a theme (Startup, Programming, etc) and pick a meme template and generate original memes in seconds using GPT-3 and other NLP techniques.<p>It is free to get started and try out.\nWould love to get feedback and iterate :)<p><a href=\"https:&#x2F;&#x2F;supermeme.ai&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;supermeme.ai&#x2F;</a><p>Regards,\nRamsri",
      "time": 1646036103,
      "title": "Show HN: Generate original memes with AI (GPT-3)",
      "type": "story",
      "url": "https://supermeme.ai/"
    }
  ]
}