{
  "stories": [
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 32121537,
      "score": 1,
      "time": 1658002480,
      "title": "Bulletproof safety pods for schools draw the internet's ire",
      "type": "story",
      "url": "https://text.npr.org/1111742285"
    },
    {
      "by": "syranwarner",
      "descendants": 1,
      "id": 32121534,
      "kids": [
        32121535
      ],
      "score": 2,
      "time": 1658002450,
      "title": "Cultish is Christian podcasts about cults exposed for being funded by a cult",
      "type": "story",
      "url": "https://thebodyintl.com/cults/cultish-is-culty"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32121520,
      "score": 1,
      "time": 1658002383,
      "title": "The Royal Treatment (2012)",
      "type": "story",
      "url": "https://www.cgw.com/Publications/CGW/2012/Volume-35-Issue-4-June-July-2012/The-Royal-Treatment.aspx"
    },
    {
      "by": "bookofjoe",
      "descendants": 1,
      "id": 32121512,
      "kids": [
        32121516
      ],
      "score": 1,
      "time": 1658002325,
      "title": "The never-ending quest to predict crime using AI",
      "type": "story",
      "url": "https://www.washingtonpost.com/technology/2022/07/15/predictive-policing-algorithms-fail/"
    },
    {
      "by": "dylandeheer",
      "descendants": 1,
      "id": 32121474,
      "kids": [
        32121475
      ],
      "score": 2,
      "time": 1658002135,
      "title": "Mordon, the email app we are building for those who want to get more done",
      "type": "story",
      "url": "https://www.mordon.app"
    },
    {
      "by": "adrianhoward",
      "descendants": 0,
      "id": 32121441,
      "score": 1,
      "time": 1658001859,
      "title": "When Demand Exceeds Capacity",
      "type": "story",
      "url": "https://www.leanessays.com/2022/06/when-demand-exceeds-capacity.html"
    },
    {
      "by": "taubek",
      "descendants": 0,
      "id": 32121386,
      "score": 2,
      "time": 1658001354,
      "title": "The poverty of privacy – supermarket loyalty cards",
      "type": "story",
      "url": "https://twitter.com/PrivacyMatters/status/1547914118480285696"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 32121382,
      "score": 2,
      "time": 1658001332,
      "title": "USB-C Port on iPhone",
      "type": "story",
      "url": "https://twitter.com/david3141593/status/1548314959943122945"
    },
    {
      "by": "wassimkha",
      "descendants": 0,
      "id": 32121370,
      "score": 2,
      "text": "Hey guys, just sharing this project that I&#x27;ve been working on. Let me know what you think.<p>This idea came primarily from my own experience in the software industry. After a while, I was feeling discouraged by my job, mostly because I felt expendable (like a code monkey), burned out, and had unchallenging work. It felt like the employers I was working for didn’t have an idea of what was going on or how their employees were feeling. They would talk a lot about the technical challenges, but never did we talk about any mental&#x2F;emotional challenges.<p>So I started thinking about what could be done to mitigate this problem and came up with this solution. An employee experience platform that tracks multiple psychological dimensions (specifically customized to track problems that can be faced in a software engineering environment) and gives the managers some insights into their teams&#x2F;employees.<p>I&#x27;m still currently working on the MVP but would love to hear what you guys think about the idea and landing page. The MVP should be out in 2-3 weeks from now.",
      "time": 1658001266,
      "title": "Show HN: Ex Platform for SWEs",
      "type": "story",
      "url": "https://smartteams.ca/"
    },
    {
      "by": "moomoo11",
      "descendants": 0,
      "id": 32121363,
      "score": 2,
      "text": "This might be a simple question to answer for some, but as someone without a substantial financial fallback it is a bit hard for me to decide. I could use some advice or anecdotes.<p>I live in a small city in California about 4 hours from San Francisco. I like living here, it is quiet and mostly farms and nice scenery. However, there&#x27;s no tech scene here.<p>I listen to some podcasts or watch youtube videos where successful venture capitalists tell people they need to move to Silicon Valley in order to build a company. These are mostly videos from the 2010s, prior to covid and shift to remote workplaces. My aspiration is to build a company, and I want to know if it is necessary to be physically in SV to do that.<p>Is their advice still valid in 2022? I have been to the bay area a few times, and while I enjoyed the time spent with my friends eating at nice restaurants or going for hikes, the quality of life there seemed really low between the tiny living spaces and the overall unsafe vibe. I&#x27;ve been to Los Angeles and San Diego, and while they were also chaotic they seemed way more livable and surprisingly safer. However, if there is really that much of an edge in SV, then I&#x27;m willing to deal with it.",
      "time": 1658001256,
      "title": "Ask HN: Should I move to Silicon Valley, remain in my small city, or elsewhere?",
      "type": "story"
    }
  ]
}