{
  "stories": [
    {
      "by": "poetically",
      "descendants": 0,
      "id": 29444088,
      "score": 1,
      "time": 1638650261,
      "title": "The Ethereum Virtual Machine – How does it work?",
      "type": "story",
      "url": "https://medium.com/mycrypto/the-ethereum-virtual-machine-how-does-it-work-9abac2b7c9e"
    },
    {
      "by": "Lwepz",
      "descendants": 0,
      "id": 29444070,
      "score": 1,
      "time": 1638650121,
      "title": "Forced to settle for a nonideal job? Here’s how to make the most of it",
      "type": "story",
      "url": "https://www.science.org/content/article/forced-settle-nonideal-job-here-s-how-make-most-it"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 29444061,
      "score": 1,
      "time": 1638650073,
      "title": "NIST Recommends Steps to Boost Resilience of U.S. Timekeeping",
      "type": "story",
      "url": "https://www.nist.gov/news-events/news/2021/11/nist-recommends-steps-boost-resilience-us-timekeeping"
    },
    {
      "by": "Vanzi",
      "descendants": 0,
      "id": 29444049,
      "score": 1,
      "text": "This article is highly subjective, so please read with caution.\nIt&#x27;s better to think you&#x27;re safe than to think you&#x27;re not.\n12&#x2F;4&#x2F;2021 Telegram officially discontinued the old client and required all third-party clients to receive ads (which was actually tolerable).\n9&#x2F;19&#x2F;2021 Telegram opened up the group&#x27;s read history down to the members (smaller groups).\nThese are signs.\nThese are signs that Telegram is opening up more resources to advertisers. Even though Pavel Durov said we don&#x27;t provide data to advertisers, it doesn&#x27;t mean that advertisers won&#x27;t collect it themselves?\nTelegram was scathing about Ghost Mode. Reported to the point that the app was just taken down from the Play Store, and even threatened developers with deactivating the API_ID operation.\nAll these signs are showing that Telegram does not actively provide information, but constantly guarantees that information can be captured in large quantities by advertisers in an easier way.\nWhat is the point of having read this when Telegram collects more and more bots and even users don&#x27;t know who is there to collect them? It&#x27;s not even listed in the read history if it&#x27;s captured in a small group. In that case, what is the use of this feature? How is it different from Anom, except that it is convenient for advertisers and stalkers?\nTelegram&#x27;s online time privacy is even more funny, when speaking will become online mode, this point is captured by the bot will not be able to get the user online time information?\nAnd yet the user&#x27;s idea, if I don&#x27;t disclose this information, won&#x27;t the bot not know about it? Pavel Durov: No!\nWhatsApp at least shows where the information is going, WeChat at least knows it&#x27;s a Chinese product and is wary of it.\nTelegram is doing something completely unprivate under the banner of privacy.\nWhatsApp and WeChat get the user&#x27;s device identification number, and Telegram does it too, and I don&#x27;t blame him for that, he can say it&#x27;s for user safety.\nWhatsApp and WeChat have asked to get the address book, Telegram also did, I do not blame him, he can say for the cell phone number is not for social?\nWhatsApp and WeChat have the ability to find friends according to their addresses, and Telegram does too, and I don&#x27;t blame him for that, he can say it&#x27;s convenient to find new friends.\nTo sum up: WhatsApp=WeChat=Telegram\nHowever.\nTelegram&#x27;s main focus is privacy chat. Online time privacy set to No User, it does show to everyone as Last seen recently, but once spoken again will become Online, for BOTs, get online information, however 1 BOT set to Everyone, but can see the online information of all users set to Everyone.\nSome groups can get read records, if the bot listens enough (Telegram has many index bots, half of which are commercially run), is not the same as being able to post a portrait of all members?\nTelegram&#x27;s security, on the other hand, is at the bottom of the list.\nThere may be mistakes or unclear logic in this article, feel free to tell me.",
      "time": 1638650021,
      "title": "I think Telegram is more dangerous than WhatsApp or even WeChat",
      "type": "story"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29444042,
      "score": 1,
      "time": 1638649954,
      "title": "Fraidycat",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zgA4GzRsldI"
    },
    {
      "by": "kvmxsh",
      "descendants": 0,
      "id": 29444005,
      "score": 1,
      "text": "I&#x27;m looking for a community where a bunch of people are working on their startups after work hours&#x2F;weekends, almost like a co-working space with a community feel - ideally people in their 20s&#x2F;30s. Does something like this exist in San Francisco?",
      "time": 1638649605,
      "title": "Ask HN:Does a startup community like this exist in SF?",
      "type": "story"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 29443979,
      "score": 1,
      "time": 1638649469,
      "title": "My Mid-Life Crisis M1 MacBook Pro",
      "type": "story",
      "url": "https://taoofmac.com/space/blog/2021/12/04/1950"
    },
    {
      "by": "gkop",
      "descendants": 0,
      "id": 29443977,
      "score": 1,
      "time": 1638649466,
      "title": "Better.com fired 900 workers after getting $750M from SoftBank",
      "type": "story",
      "url": "https://www.protocol.com/bulletins/better-com-layoffs"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29443976,
      "score": 1,
      "time": 1638649437,
      "title": "Sex Ratios at Birth Linked to Pollutants",
      "type": "story",
      "url": "https://www.the-scientist.com/news-opinion/sex-ratios-at-birth-linked-to-pollutants-69485"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 29443972,
      "score": 1,
      "time": 1638649393,
      "title": "Currency Converter: 1270–2017",
      "type": "story",
      "url": "https://www.nationalarchives.gov.uk/currency-converter/"
    }
  ]
}