{
  "stories": [
    {
      "by": "scopio918",
      "descendants": 0,
      "id": 28033947,
      "score": 1,
      "time": 1627890400,
      "title": "The Boeing 737 Max is back? Not everyone is convinced",
      "type": "story",
      "url": "https://www.zdnet.com/article/the-boeing-737-max-is-back-not-everyone-is-convinced/"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 28033944,
      "score": 1,
      "time": 1627890390,
      "title": "Writing Consistent Tools",
      "type": "story",
      "url": "https://www.netmeister.org/blog/consistent-tools.html"
    },
    {
      "by": "anonymous3889",
      "descendants": 0,
      "id": 28033930,
      "score": 1,
      "text": "TLDR; \nI am a product manager, but hate my job and want to go back to engineering. Should I do this, or loosing all I have achieved in this role is stupid, and I should just continue?<p>Full text: \nI am a software engineer by background, did some machine learning, but during my career I somehow switched to product management. In my first startup, I was in the CTO role, but effectively, I was doing a lot of product related things, so when the startup went bust I decided to proceed in that direction because somehow Product Management sounded more prestigious to me, and I felt like being able to make more high-level decisions will be a much better place for me to focus my time and effort on.<p>Now, almost a decade later, I have worked in many startups in product and product leadership roles, and I am currently in a product leadership position in a very successful company on a breakout trajectory.<p>At the same time, for the past year or so, I feel like I am in a fundamentally wrong role. I understand the value of product management, I can do a lot of product strategy, prioritization and user research activities pretty well, and I know how to coach product managers who work with me, but I feel like I am wasting my time, and I hate waking up for work. I am dreaming about coding, designing architectures, solving challenging tech problems, and spending less time on stakeholder meetings, planning meetings, strategy meetings and sync meetings.<p>Sometimes I am wondering if the problem is that I am just not doing product management right. Maybe in an ideal situation, in ideal company, with ideal product, the role can be much more engaging and satisfying.<p>But at the same time, I can&#x27;t stop thinking that product manager in general is a very artificial role. In a good, empowered and autonomous team I don&#x27;t see why team lead can&#x27;t carry some PMs responsibilities, with some people from marketing (i.e. product marketing manager) carrying the other side of product manager&#x27;s role.<p>Anyway, where I am right now is I am depressed, I don&#x27;t like my job, but I feel scared to lose the credibility and status I have achieved in my current  career direction, and go back to a lower level technical role. I know how to code, and I still code regularly for myself, but it is very different from what companies expect from tech leads or software architects who they hire, so probably I will need to start lower level. Or I just need to start a new startup and be the CTO again :)<p>There is another voice in my head that tells me that I am just lazy, trying to get into comfort zone as product management is not a comfort zone for me, and therefore I should continue fighting and suffering to get out of this stronger and successful on the other end. But I have seen too many people falling into the trap of suffering like this for no good reason, and I want to avoid this...",
      "time": 1627890232,
      "title": "Ask HN: Should I switch back from Product Management to engineering?",
      "type": "story"
    },
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 28033912,
      "score": 1,
      "time": 1627890046,
      "title": "Coherent Beam Combining or CBC metal 3D printing 1000 times faster",
      "type": "story",
      "url": "https://3dprintingindustry.com/news/fraunhofer-iws-trials-one-thousand-times-faster-cbc-3d-printing-technology-193543/"
    },
    {
      "by": "shetill",
      "descendants": 0,
      "id": 28033887,
      "score": 1,
      "text": "for me this is just a job that pays well enough to keep me doing it. If I compare it to let&#x27;s say arts&#x2F;music people are actually passionate about their careers. They go to exhibitions&#x2F;concerts, they go to conferences and passionately network with peers. They are fascinated by others&#x27; work and get inspired for their own and in general can proudly define themselves as artists or musicians. I mean you will never hear some programmer talk passionately about their daily work but you will always hear it with artists.<p>On the other hand I can&#x27;t think of anyone I know in our industry who is not depressed and&#x2F;or pissed off all the time and doesn&#x27;t do this job just because it pays well and is comfortable. The typical image of a software dev I have is a 30+ grumpy white dude who isn&#x27;t taking care of himself and is strongly opinionated about whatever he does while hiding how depressed and bored he is.<p>I&#x27;ve worked in quite a few places big and small and barely if anyone is going to conferences, admiring other programmers, is in communities that admire each others&#x27; work and is genuinely passionate about software. Maybe the AI&#x2F;ML guys seem to be more into what they do than the average dev but that&#x27;s as far as it goes.",
      "time": 1627889775,
      "title": "Ask HN: Are you passionate about your career in software",
      "type": "story"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 28033886,
      "score": 2,
      "time": 1627889763,
      "title": "A latent profile analysis of behaviours and attitudes during the Covid pandemic",
      "type": "story",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0255268"
    },
    {
      "by": "jslakro",
      "descendants": 0,
      "id": 28033881,
      "score": 3,
      "time": 1627889722,
      "title": "Reading Levels: Different Ways to Read Different Books",
      "type": "story",
      "url": "https://www.thecuriousreader.in/features/reading-levels/"
    },
    {
      "by": "DaraLadjev",
      "descendants": 1,
      "id": 28033857,
      "kids": [
        28033858
      ],
      "score": 2,
      "time": 1627889494,
      "title": "Helix – A Tool for Digital Immortality",
      "type": "story",
      "url": "https://twitter.com/daraladje/status/1422079654370836482"
    },
    {
      "by": "montalbano",
      "descendants": 0,
      "id": 28033851,
      "score": 1,
      "time": 1627889440,
      "title": "State of knowledge of soil biodiversity (2020)",
      "type": "story",
      "url": "http://www.fao.org/documents/card/en/c/cb1928en/"
    },
    {
      "by": "underseacables",
      "descendants": 0,
      "id": 28033844,
      "score": 1,
      "time": 1627889392,
      "title": "IOC ‘remains neutral’ re: US Commission’s call to postpone 2022 Beijing games",
      "type": "story",
      "url": "https://americanmilitarynews.com/2021/08/olympic-body-remains-neutral-concerning-us-commissions-call-to-postpone-2022-beijing-games/"
    }
  ]
}