{
  "stories": [
    {
      "by": "junon",
      "descendants": 0,
      "id": 30007039,
      "score": 1,
      "time": 1642674237,
      "title": "DevTerm Kit A06 Series",
      "type": "story",
      "url": "https://www.clockworkpi.com/product-page/devterm-kit-a06-series"
    },
    {
      "by": "daenney",
      "descendants": 0,
      "id": 30007027,
      "score": 1,
      "time": 1642674111,
      "title": "Europe’s Move Against Google Analytics Is Just the Beginning",
      "type": "story",
      "url": "https://www.wired.com/story/google-analytics-europe-austria-privacy-shield/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30007023,
      "score": 1,
      "time": 1642674062,
      "title": "Silicon-based qubits take a big leap forward",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/01/silicon-based-qubits-take-a-big-leap-forward/"
    },
    {
      "by": "solididiot",
      "descendants": 0,
      "id": 30007022,
      "score": 1,
      "text": "Sorry for the foul language but I had one too many of this.<p>Having worked with a good few Open Source tooling&#x2F;libraries&#x2F;frameworks etc and with a lot of similar internal ones I have come to the conclusion that almost invariably the quality of the later is far below the quality of the former. Being documentation, ergonomics, bugs, you name it.<p>Open source alternatives are much better than proprietary closed source ones. Mind you that I&#x27;m not talking about code quality, I&#x27;m talking about mere usability and dev experience.<p>This is consistent across quite a few medium, large and very large companies (enterprises) I&#x27;ve been. Worst case (and quite common) is when a company &quot;builds&quot; upon OS (e.g. a framework based on Flask). The end result is a painful to work with half-baked mess.<p>What I don&#x27;t get though is that OS is built (in many cases) by hobbyists for free. The internal messes are always being built by people on a steady payroll. I just don&#x27;t get it...",
      "time": 1642674045,
      "title": "Why internal SW is almost invariably sh_t?",
      "type": "story"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30007015,
      "score": 1,
      "time": 1642673963,
      "title": "Intel Expands 12th Gen Core to Ultraportable Laptops, from 5 to 14-cores",
      "type": "story",
      "url": "https://www.anandtech.com/show/17215/intel-expands-12th-gen-core-to-ultraportable-laptops-from-5cores-at-9-w-to-14cores-at-28-w"
    },
    {
      "by": "YXNjaGVyZWdlbgo",
      "descendants": 0,
      "id": 30007013,
      "score": 1,
      "time": 1642673940,
      "title": "German minister asks Google and Apple to remove Telegram from appstores",
      "type": "story",
      "url": "https://www.spiegel.de/netzwelt/netzpolitik/faeser-will-telegram-aus-den-app-stores-werfen-lassen-a-30f191c7-ecb6-4d2c-997d-cfceadd2eb60"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30007003,
      "score": 1,
      "time": 1642673765,
      "title": "Radian announces plans to build one of the holy grails of spaceflight",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/01/radian-announces-plans-to-build-one-of-the-holy-grails-of-spaceflight/"
    },
    {
      "by": "VioricaVanica",
      "descendants": 0,
      "id": 30006988,
      "score": 1,
      "text": "Here is a scientific explanation which I learned while listening to dr. Andrew D. Huberman podcast over how our beliefs are created and how we can change them. It all started with my negative self-talk about not being good enough. I hope you will get understanding and more control over your thoughts. Would love to find out how you deal with your negative self-talk!<p>Here&#x27;s the explanation!<p>We are born with billions of neurons which have very few connections between them.<p>As we grow up and experience the world (we have thoughts, emotions, activities), we create these connections between neurons - they are like roads where electrical signals transport information between different parts of the brain.<p>Because our brain is all about optimisation, the roads that are used more often become highways - and this why some thoughts might feel so natural to us and they come without effort.<p>*For example*, if you called yourself stupid every time you made a mistake - this road in your brain becomes a highway and this thought comes naturally to you because the electrical impulses travel always chooses the path with the least resistance - like a car driver that prefers to drive on a highway than on a forest road.<p>The building material of these roads is called *myelin*. Myelin is very abundant before age 8 and during puberty. But after the age of 25 myelin is as abundant and this is why learning new things or building new habits require more conscious effort.<p>But this is not impossible - we can still change old highways or build new ones because our brains have *neuroplasticity* - which is its capacity to change itself.<p>Changing old highways requires awareness firstly. This explanation gave me sense of control over my negative emotions and thoughts and helped me treat them as something that appears in head because of my limiting beliefs. So I started to record audios of how I want to see myself during the day on a certain subject, like for example my relationship with my body, then started to listen to it daily. It’s incredible how my thoughts about my body changed over a month.<p>That’s what I have been doing since then with my team - a place where people can get their own audios, based on their own inner conversations!<p>You can get your personalised audio by filling out this form https:&#x2F;&#x2F;www.selftalk.space and you will get your audio within 5 days!",
      "time": 1642673620,
      "title": "How negative self-talk is created and how to change it",
      "type": "story"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30006984,
      "score": 1,
      "time": 1642673594,
      "title": "Xpresso is an ASGI web framework built on top of Starlette, Pydantic and di",
      "type": "story",
      "url": "https://xpresso-api.dev/0.3.3/"
    },
    {
      "by": "reacweb",
      "descendants": 0,
      "id": 30006969,
      "score": 1,
      "text": "A long time ago, I have encountered (on HN, I think) a marvelous gallery of portraits of important figures of the building of internet, unix (Rob Pike, Tim, ...) I have already spend a lot of time googling. I have a presentation to give on saturday. Any help would be welcome.",
      "time": 1642673496,
      "title": "Most prominent people of internet history",
      "type": "story"
    }
  ]
}