{
  "stories": [
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 27965333,
      "score": 1,
      "time": 1627332861,
      "title": "Amos Mast, et al. vs. Fillmore County, Minnesota, et al. [pdf]",
      "type": "story",
      "url": "https://www.supremecourt.gov/opinions/20pdf/20-7028_o758.pdf"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 27965328,
      "score": 1,
      "time": 1627332845,
      "title": "Learnings from Rewriting 300 Websites",
      "type": "story",
      "url": "https://twitter.com/maiale/status/1419687196311752704"
    },
    {
      "by": "mjmaho19",
      "descendants": 0,
      "id": 27965319,
      "score": 1,
      "text": "Monolith Machines &#x2F; Co-Founder &#x2F; REMOTE- Boston Area (Shrewsbury) &#x2F; Hiring Software Developer<p>Monolith Machines is a Massachusetts based startup working on consumer-facing analytical testing of cannabis. We are looking for a skilled Python developer who is interested in building physical consumer facing products. The individual who fills this role will find themselves to be more like a co-founder than an employee. The right candidate will enjoy working in an exciting, fast paced, and challenging environment. You will have access to our team of expert advisors, engineers, finance, and laboratory personnel with whom you can consult.<p>Our mission is to provide high reliability analytical testing for cannabis home-growers using unattended cannabis testing kiosks located in cannabis-related retail establishments such as hydroponic stores and social consumption lounges. We have conducted multiple rounds of market research, multiple betas, and multiple rounds of successful test marketing. We have filed for a patent on our technology, we have a working prototype, and we are currently building a production ready unit. We have more than 10 locations in MA waiting for our kiosks.<p>At Monolith you will:\n• Design, build, and maintain software\n• Solve unique problems &amp; work with other team members to help solve their problems\n• Be part of a team that cares about who you are and your growth as a software engineer\n• Collaborate with management and customers to identify end-user requirements and specifications                                                                                                                                                                          \n• Design algorithms and flowcharts to create new software programs and systems\n• Produce efficient and elegant code based on requirements\n• Test and deploy programs and applications\n• Troubleshoot, debug, maintain and improve existing software \n• Compile and assess user feedback to improve software performance\n• Observe user feedback to recommend improvements to existing software\n• Manage a complex database consisting of many different data types\n• Work closely with our in-house chemometricians to implement and deploy their models\n• Develop technical documentation to guide future software development projects<p>A successful Software Developer candidate will have various prerequisite skills&#x2F;qualifications needed for success at the company. At a minimum, we are looking for someone who is strong in:\n• Python\n• SQL\n• Linux (knows their way around a terminal, sshing, etc)\n• Version control (git&#x2F;github preferred)\n• An understanding of API design and architecture\n• PostgreSQL\n• Unit testing with pytest\n• Multithreading&#x2F;Multiprocessing with Python\n• Database Management\nIt is recommended that you also have these skills, or experience with these tools:\n• Building python packages\n• PyQt5\n• AWS RDS\n• AWS lambda\n• AWS EC3\n• Raspberry Pi\n• GPIO&#x2F;Controlling hardware with a Raspberry Pi\n• Deep learning<p>The ideal candidate will be familiar with the software development life cycle including the planning, design, development and implementation, deployment and maintenance stages. They also require an in-depth knowledge of frameworks and tools.<p>In this role you will have a lot of autonomy and responsibility. You will be working directly on consumer facing applications and products that will be used by customers. This is a great learning opportunity, not only for your career but also your programming skills, as you will be working on a lot of advanced Python code. There is also a lot of upside potential - if you stay for longer there is a potential for you to be leading the software effort and managing a team of people.<p>Please send your resume and preferably links to other projects, we look forward to hearing from you!<p>mike@seaweed.tech\nMichael Mahoney, founder",
      "time": 1627332807,
      "title": "Monolith Machines; hiring software developer",
      "type": "story"
    },
    {
      "by": "Cieplak",
      "descendants": 0,
      "id": 27965316,
      "score": 2,
      "time": 1627332801,
      "title": "A Noob’s Guide to McMaster-Carr (2017)",
      "type": "story",
      "url": "https://hackaday.com/2017/09/13/noobs-guide-to-mcmaster-carr/"
    },
    {
      "by": "Hedgemaster",
      "descendants": 0,
      "id": 27965311,
      "score": 1,
      "text": "Hi HN community,<p>I would appreciate if you could share which trading brokerage (if any) you prefer the most and why (execution quality, UI, fees, user support, etc.)<p>Thank you!",
      "time": 1627332790,
      "title": "Ask HN: What is your favourite stocks/options trading platform?",
      "type": "story"
    },
    {
      "by": "onychomys",
      "descendants": 0,
      "id": 27965284,
      "score": 1,
      "time": 1627332662,
      "title": "How to Make Cyanotypes",
      "type": "story",
      "url": "https://parallaxphotographic.coop/how-to-make-cyanotypes/"
    },
    {
      "by": "zathan",
      "descendants": 1,
      "id": 27965275,
      "kids": [
        27965276
      ],
      "score": 1,
      "time": 1627332628,
      "title": "Meet the Microsoft Game Developer Kit (GDK)",
      "type": "story",
      "url": "https://developer.microsoft.com/en-us/games/blog/meet-the-microsoft-game-developer-kit-gdk/"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 27965259,
      "score": 1,
      "time": 1627332530,
      "title": "Evidence for a sublimated water atmosphere on Ganymede from Hubble observations",
      "type": "story",
      "url": "https://arxiv.org/abs/2106.03570"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27965255,
      "score": 1,
      "time": 1627332516,
      "title": "Big Solar: Where do large solar power plants pay off?",
      "type": "story",
      "url": "https://www.dw.com/en/desert-large-solar-plants-also-pay-off-in-countries-with-less-sun/a-58284114"
    },
    {
      "by": "boernard",
      "descendants": 0,
      "id": 27965231,
      "score": 1,
      "time": 1627332401,
      "title": "Digital Film Cartridge for Analog Cameras (Using Raspberry Pi)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=5DdQN0NVVT0"
    }
  ]
}