{
  "stories": [
    {
      "by": "joebaf",
      "dead": true,
      "id": 30675085,
      "score": 1,
      "time": 1647278088,
      "type": "story"
    },
    {
      "by": "Ferib",
      "descendants": 0,
      "id": 30675083,
      "score": 1,
      "time": 1647278076,
      "title": "Reversing obfuscation schemes to then build automated de-obfuscation tools",
      "type": "story",
      "url": "https://ferib.dev/blog.php?l=post/Reversing_Common_Obfuscation_Techniques"
    },
    {
      "by": "NAR8789",
      "descendants": 0,
      "id": 30675082,
      "score": 1,
      "time": 1647278064,
      "title": "Squarespace Escape Suppressor",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/squarespace-escape-suppre/ecbamndhnebdcfmidendannaficioean"
    },
    {
      "by": "lumenwrites",
      "descendants": 0,
      "id": 30675062,
      "score": 1,
      "text": "Hey guys! I&#x27;m looking into starting my own small webdev agency. My goal is to find small and simple projects I can quickly design and develop by myself, without hiring anyone. All I need is to start making $2k-$3k per month, and then grow from there. I&#x27;m looking for some advice from more experienced people - how would you go about doing that?<p>What I&#x27;d really love to do is to help non-technical startup founders to build MVP web apps (using my React&#x2F;Node&#x2F;Next skills), but there are a few problems with that:<p>- People who are just getting started don&#x27;t have any money.\n- People who are already successful have better options than myself.\n- Big and complex apps have a larger scope than I, as a solo designer&#x2F;developer, can handle. And I don&#x27;t know where to find people interested in smaller apps I can realistically build on my own.<p>So I&#x27;m trying to come up with a more realistic plan that I can use to get started. I&#x27;m thinking I could start with much simpler projects, build the agency-running skills and portfolio, which I can then leverage to land more interesting SaaS clients. Here&#x27;s the plan I currently have:<p>- Find local &quot;boring&quot; niche businesses (gyms, cafes, restaurants, barbers, etc) on google maps and yelp. (Do you know if there are better ways to find your first clients?)\n- Make a list of the ones that don&#x27;t have a website.\n- Cold email them and offer my services (that seems like the most straightforward way to get my foot in the door, are there better approaches?)\n- Quickly design and develop simple landing-page style websites for them. Using WordPress, Squarespace, Ghost, or something similar (which tool would you use to make it easy for non-technical clients to manage the website?)\n- Charge $1000-$2000 per website (does that price range make sense?). Build 2-3 of those per month.\n- Potentially upsell them on setting up the google&#x2F;facebook ads, so that I&#x27;m offering them leads and clients, not just a website (is that a good idea?).\n- Build a portfolio of small projects and testimonials, and level up to more interesting projects after that.<p>This plan also has problems:<p>- I don&#x27;t know whether people need this kind of service.\n- I&#x27;ll probably be joining the race to the bottom, since anyone can do this.\n- It doesn&#x27;t sound too fun or technically interesting, I don&#x27;t know whether it&#x27;ll result in a good portfolio.\n- I don&#x27;t quite see how I&#x27;d grow from there into achieving my dream of building SaaS apps for people.<p>But that&#x27;s what I have so far.<p>Does this strategy sound reasonable, at least in terms of starting a small agency that makes money?<p>Do you have any tips or advice for me?",
      "time": 1647277949,
      "title": "How would you go about starting your own small webdev agency?",
      "type": "story"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 30675061,
      "score": 1,
      "time": 1647277948,
      "title": "Russia’s war: Why The BMJ opposes an academic boycott",
      "type": "story",
      "url": "https://www.bmj.com/content/376/bmj.o613"
    },
    {
      "by": "Someone",
      "descendants": 0,
      "id": 30675059,
      "score": 1,
      "time": 1647277933,
      "title": "Probing the genomic limits of de-extinction in the Christmas Island rat",
      "type": "story",
      "url": "https://www.cell.com/current-biology/fulltext/S0960-9822(22)00249-4"
    },
    {
      "by": "chrismore",
      "descendants": 0,
      "id": 30675046,
      "score": 1,
      "text": "I build a JavaScript code snippet that automatically tags all inbound links with UTM parameters if they are missing.",
      "time": 1647277878,
      "title": "Show HN: Streamline Funnel Analytics with Dynamic UTM Tags",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30675045,
      "score": 1,
      "time": 1647277875,
      "title": "A study guide for software engineering students",
      "type": "story",
      "url": "https://austinhenley.com/blog/sestudyguide.html"
    },
    {
      "by": "sizzle",
      "descendants": 0,
      "id": 30675037,
      "score": 2,
      "time": 1647277827,
      "title": "Virginia lawmakers OK lifting ban on facial technology use",
      "type": "story",
      "url": "https://apnews.com/article/technology-virginia-crime-legislature-f3f2af850745911014b950d951c3c464"
    },
    {
      "by": "probabletrain",
      "descendants": 0,
      "id": 30675035,
      "score": 1,
      "time": 1647277818,
      "title": "Map Compasses (Part 14): Lodestone Loader and First Compasses",
      "type": "story",
      "url": "https://heredragonsabound.blogspot.com/2022/03/map-compasses-part-14-lodestone-loader.html"
    }
  ]
}