{
  "stories": [
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 28147009,
      "score": 1,
      "time": 1628712196,
      "title": "Cosmic Legacy: Retired Space Telescope Reveals ‘Hot Jupiter' Secrets",
      "type": "story",
      "url": "https://exoplanets.nasa.gov/news/1686/cosmic-legacy-retired-space-telescope-reveals-hot-jupiter-secrets/"
    },
    {
      "by": "mrguyorama",
      "descendants": 0,
      "id": 28146993,
      "score": 1,
      "text": "I recently had my Facebook account hijacked. My password was compromised and they were able to log in. Facebook sent my email account a message that I logged in from somewhere new, and then an email to &quot;verify this browser&quot;, but the malicious actor was able to log in despite my email account not being compromised. They then changed the password on my account and then the email address. This all happened at 4am local time<p>Each email had a link that said &quot;if you did not do this, click here to secure your account&quot;, but that link requires you log in, which you cannot do if a 3rd party has changed your email or password. Also, contrary to what Facebook says in their help, they did not send my primary email account a message to revert the email change. As such, I was unable to maintain control of my account.<p>How the heck am I supposed to get it back? I eventually got to some process that asks me to submit a government ID for verification, and I was able to do that, but all they did was send me an email that they can&#x27;t give me back the account until they verify my ID and it&#x27;s been radio silent since. There&#x27;s no case number or anything else I can use to follow up or ask for help.<p>What the hell? Facebook, you can&#x27;t have strict rules around how people make and use accounts if you can&#x27;t guarantee them access to their accounts like this. \nIf I never get it back, what am I supposed to do? If I make a second account I will be in violation of Facebook&#x27;s rules.",
      "time": 1628712048,
      "title": "Facebook account hijacked, changed email and phone number",
      "type": "story"
    },
    {
      "by": "adrian_mrd",
      "descendants": 1,
      "id": 28146964,
      "kids": [
        28147026
      ],
      "score": 1,
      "time": 1628711969,
      "title": "‘Dead White Man’s Clothes’: the dirty secret behind the worlds fashion addiction",
      "type": "story",
      "url": "https://www.abc.net.au/news/2021-08-12/fast-fashion-turning-parts-ghana-into-toxic-landfill/100358702"
    },
    {
      "by": "okozzie",
      "descendants": 0,
      "id": 28146953,
      "score": 1,
      "time": 1628711909,
      "title": "Show HN: Straw.Page – Extremely simple website builder",
      "type": "story",
      "url": "https://straw.page"
    },
    {
      "by": "smartmic",
      "descendants": 0,
      "id": 28146951,
      "score": 1,
      "time": 1628711903,
      "title": "GTF's Green Coding White Paper [pdf]",
      "type": "story",
      "url": "https://landing.gft.com/wp-content/uploads/2021/04/gft-pov-greencoding-en.pdf"
    },
    {
      "by": "hir0protagonist",
      "descendants": 0,
      "id": 28146932,
      "score": 1,
      "time": 1628711808,
      "title": "LaunchDarkly Raises $200M, Hits $3B Valuation",
      "type": "story",
      "url": "https://www.forbes.com/sites/rashishrivastava/2021/08/10/launchdarkly-raises-200-million-at-3-billion-valuation/"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28146920,
      "score": 1,
      "time": 1628711724,
      "title": "Wendy’s to open 700 ghost kitchens by 2025 with startup Reef",
      "type": "story",
      "url": "https://www.cnbc.com/2021/08/11/wendys-to-open-700-ghost-kitchens-by-2025-with-start-up-reef.html"
    },
    {
      "by": "dgb23",
      "descendants": 0,
      "id": 28146918,
      "score": 1,
      "text": "I realized a weird feeling of mine that I sometimes misinterpret. It typically comes up when I’m designing a program at a high level, top down, in terms of wishful thinking.<p>The feeling can be described as my brain running in circles (sometimes it’s just walking or crawling though). Like a snake biting its own tail. I think it happens when I try to combine or unify things that don’t belong together in an attempt to simplify some model as in “everything is an X” or “this other thing is just an X with a Y”.<p>I’m not sure why I have that instinct in the first place, it certainly seems natural in some sense, like pattern matching? On one hand I feel like this is a strength of mine, I love seeing similarities in concepts and people have said that this is a bit of a defining characteristic of mine. I think it can have a lot of value. For example it is not unheard of that different fields have similar concepts, or shapes, but name them and maybe combine them differently, and recognizing this can lead to deeper understanding, because there might be solutions in some area that also apply to another but isn’t understood in their terminology or practice.<p>But the other side of the coin is well, the above. In the worst case it is hard to let go of running in circles because I’m driven by a motivation to find these valuable parallels or new ways of modelling something. In less severe cases it simply blocks me of understanding something that might seem trivial, because I already tried to make a connection that may not seem to exist.<p>I think this is very closely related to the type of job we’re doing. Mapping to and modelling processes and data in the small and large. Or at least it is part of it.\nThinking about this and discussing this issue with other people might help. Can you relate? Is there a name for it? What do you think are good activities or strategies to exploit the value of this type of thinking and to mitigate the cost?",
      "time": 1628711714,
      "title": "Ask HN: Are you sometimes running circles when designing software?",
      "type": "story"
    },
    {
      "by": "jonbaer",
      "descendants": 0,
      "id": 28146902,
      "score": 1,
      "time": 1628711646,
      "title": "Europe's all-time heat record set in Sicily at nearly 120 degrees",
      "type": "story",
      "url": "https://www.axios.com/europe-all-time-heat-record-set-sicily-065cef11-fdb7-4aaf-abd5-82b5b8d7a475.html"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 28146877,
      "score": 1,
      "time": 1628711559,
      "title": "Does anyone know what time it is? Facebook does",
      "type": "story",
      "url": "https://www.zdnet.com/article/does-anyone-really-know-what-time-it-is-facebook-does/"
    }
  ]
}