{
  "stories": [
    {
      "by": "car_analogy",
      "descendants": 0,
      "id": 30517263,
      "score": 1,
      "time": 1646156656,
      "title": "A Letter to the Western Left from Kyiv",
      "type": "story",
      "url": "https://commons.com.ua/uk/letter-western-left-kyiv/"
    },
    {
      "by": "hermitcrab",
      "descendants": 0,
      "id": 30517254,
      "score": 1,
      "time": 1646156609,
      "title": "A list of how countries are supporting Ukraine",
      "type": "story",
      "url": "https://www.aljazeera.com/news/2022/2/28/which-countries-are-sending-military-aid-to-ukraine"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 30517247,
      "score": 1,
      "time": 1646156589,
      "title": "Cargo ship carrying cars sinks in mid-Atlantic",
      "type": "story",
      "url": "https://apnews.com/article/technology-business-united-states-germany-portugal-2bb8dd53fa48ae066c3ae3f2bcfe999e"
    },
    {
      "by": "0x41534446",
      "descendants": 0,
      "id": 30517239,
      "score": 1,
      "time": 1646156542,
      "title": "Learning Linux kernel exploitation – Part 1 – Laying the groundwork",
      "type": "story",
      "url": "https://twitter.com/0xricksanchez/status/1498630855891247111"
    },
    {
      "by": "shea256",
      "descendants": 0,
      "id": 30517228,
      "score": 2,
      "time": 1646156493,
      "title": "Münchhausen Trilemma",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/M%C3%BCnchhausen_trilemma"
    },
    {
      "by": "s3arch",
      "descendants": 0,
      "id": 30517221,
      "score": 1,
      "text": "Personally I cannot express this better than what Frederick P. Brooks said.<p>From his own words:<p>Why is programming fun? What delights may its practitioner expect as his reward?<p>First is the sheer joy of making things. As the child delights in his mud pie, so the adult enjoys building things, especially things of his own design. I think this delight must be an image of God&#x27;s delight in making things, a delight shown in the distinctness and newness of each leaf and each snowflake.<p>Second is the pleasure of making things that are useful to other people. Deep within, we want others to use our work and to find it helpful. In this respect the programming system is not essentially different from the child&#x27;s first clay pencil holder &#x27;&#x27;for Daddy&#x27;s office.&quot; Third is the fascination of fashioning complex puzzle-like objects of interlocking oving parts and watching them work in subtle cycles, playing out the consequences of principles built in from the beginning. The programmed computer has all the fasci- nation of the pinball machine or the jukebox mechanism, carried to the ultimate.<p>Fourth is the joy of always learning, which springs from the nonrepeating nature of the task. In one way or another the problem is ever new, and its solver learns something: sometimes practical, sometimes theoretical, and sometimes both.<p>Finally, there is the delight of working in such a tractable medium. The programmer, like the poet, works only slightly re- moved from pure thought-stuff. He builds his castles in the air, from air, creating by exertion of the imagination. Few media of creation are so flexible, so easy to polish and rework, so readily capable of realizing grand conceptual structures. (As we shall see later, this very tractability has its own problems.) Yet the program construct, unlike the poet&#x27;s words, is real in the sense that it moves and works, producing visible outputs separate from the construct itself. It prints results, draws pictures, produces sounds, moves arms. The magic of myth and legend has come true in our time. One types the correct incantation on a keyboard, and a display screen comes to Hfe, showing things that never were nor could be. Programming then is fun because it gratifies creative longings built deep within us and delights sensibilities we have in commonwith all men.",
      "time": 1646156474,
      "title": "Ask HN: Why do you love programming?",
      "type": "story"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30517218,
      "score": 2,
      "time": 1646156465,
      "title": "Lukashenko plans Moldova invasion as Belarus President releases military plans",
      "type": "story",
      "url": "https://www.express.co.uk/news/world/1573902/Lukashenko-belarus-attack-map-russia-ukraine-war-latest-vn"
    },
    {
      "by": "janedoegrrr",
      "descendants": 0,
      "id": 30517211,
      "score": 1,
      "time": 1646156413,
      "title": "Demystifying the Great Resignation",
      "type": "story",
      "url": "https://www.protocol.com/newsletters/protocol-workplace/uncovering-the-great-resignation"
    },
    {
      "by": "isaacimagine",
      "descendants": 0,
      "id": 30517205,
      "score": 1,
      "time": 1646156391,
      "title": "TermKit: A Rich Graphical Terminal (2011)",
      "type": "story",
      "url": "https://acko.net/blog/on-termkit/"
    },
    {
      "by": "erehweb",
      "descendants": 0,
      "id": 30517197,
      "score": 1,
      "time": 1646156369,
      "title": "On Terrible Engineers (2015)",
      "type": "story",
      "url": "https://techcrunch.com/2015/03/08/on-secretly-terrible-engineers/"
    }
  ]
}