{
  "stories": [
    {
      "by": "csrar",
      "descendants": 0,
      "id": 31246984,
      "score": 1,
      "time": 1651577040,
      "title": "Why do WiFi speeds vary so much? – Computerphile [video] start .34s",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=vvKbMueRzrI"
    },
    {
      "by": "cogogo",
      "descendants": 0,
      "id": 31246950,
      "score": 2,
      "text": "I grew up in the US, lived in Spain for several years and now regularly visit my in-laws.<p>I&#x27;m currently staying in what I would call an average apartment block with ~40 units built in the late 70s or early 80s.<p>As far as I can tell there are no smoke detectors or sprinklers and there is definitely no alternative egress like a fire escape. And I don&#x27;t think I&#x27;ve been to any residence in Spain that has either (but I&#x27;m not always checking).<p>Fire deaths per capita are considerably lower in Spain than in the US[0] where my <i>impression</i> is there is a huge emphasis on fire safety equipment like smoke detectors and sprinklers.<p>I expect that smoke detectors and sprinklers save lives - or certainly hard to argue that they don&#x27;t at the margin regardless of the type of building they are installed in.<p>What&#x27;s going on? Why doesn&#x27;t my in-law&#x27;s apartment have smoke detectors and sprinklers? Is my family actually sleeping in a death trap?<p>Some possible explanations I can think of:\n* Different building materials and building codes - On average Spanish residences more fire resistant because of their construction<p>* Cost - smoke detectors and sprinklers drive up costs and getting adoption might be hard if they only save a small number of marginal lives. Even if I would argue that makes them worth it everywhere<p>* Business&#x2F;Politics - Fire safety manufacturers have had more success in the US getting their devices into building codes and legislation<p>* Rescue&#x2F;Fire Suppression - this seems very unlikely (figure firefighting and evacuation techniques are pretty universal in the developed world) but I guess Spanish firefighters could be better at getting fires out and people evacuated<p>I have been wondering about this for more than a decade and this seems like a good international community to find someone who might know or people interested in the topic. I&#x27;d love people&#x27;s thoughts.<p>[0] - https:&#x2F;&#x2F;www.worldlifeexpectancy.com&#x2F;cause-of-death&#x2F;fires&#x2F;by-country&#x2F;",
      "time": 1651576687,
      "title": "Ask HN: Why don't residences in Spain (Europe?) have smoke detectors?",
      "type": "story"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 31246946,
      "score": 1,
      "time": 1651576668,
      "title": "Vaxxinity shares spike after insider purchases",
      "type": "story",
      "url": "https://seekingalpha.com/news/3829532-vaxx-stock-spikes-after-insider-purchases"
    },
    {
      "by": "notmuffin",
      "descendants": 0,
      "id": 31246935,
      "score": 1,
      "time": 1651576581,
      "title": "India Orders VPN Companies to Collect and Hand over User Data",
      "type": "story",
      "url": "https://www.cnet.com/news/privacy/india-orders-vpn-companies-to-collect-and-hand-over-user-data/"
    },
    {
      "by": "dudelstrom",
      "descendants": 0,
      "id": 31246933,
      "score": 1,
      "text": "I&#x27;m having an argument with a colleague over whether we should eject from CRA or not. The issue started, because our PO and I discussed the fact that there are 40 known security vulnerabilities flagged in our dependency tree.<p>Fixing those in part requires upgrading from CRA 4 to 5 and hence from Webpack 4 to 5. Unfortunately, Webpack 5 disables polyfills per default and CRA does not allow you to configure that.<p>So far 5 options seem apparent to me:<p>1) Keep 20 known security vulnerabilites<p>2) Get rid of all dependencies requiring polyfills<p>3) Add react-app-rewired on top of CRA to configure polyfills<p>4) Stop using CRA and configure Webpack<p>5) Stop using CRA and configure Vite&#x2F;Rollup<p>Now, my colleague says we should stick with CRA, because Facebook&#x2F;React knows better than we do and it will be a pain in the long haul.<p>My take is that CRA did it&#x27;s job well up to this point as a jumpstarter build-tool, but that the time has come to configure it ourselves.<p>Can I ask you lot for some expertly advice?",
      "time": 1651576545,
      "title": "Keep relying on CRA post MVP?",
      "type": "story"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 31246919,
      "score": 1,
      "time": 1651576404,
      "title": "The Era of Cheap and Plenty May Be Ending",
      "type": "story",
      "url": "https://www.nytimes.com/2022/05/03/business/economy/pandemic-supply-chains-inflation.html"
    },
    {
      "by": "aydnina",
      "descendants": 0,
      "id": 31246918,
      "score": 2,
      "text": "I understand that low level or systems programming is a very broad concept and it is impossible for a single person to master everything under the sun. However, I am looking for a resource which explains the various aspects of low level or systems programming and hopefully points to some good books or websites on each subject. Even better would be links to online courses or some kind of &quot;syllabus&quot; for each topic. Some topics I would expect such a resource to cover are<p>- CPU, ISAs and assembly languages for different architectures<p>- operating systems<p>- audio programming (DSPs, harmonic analysis, etc.)<p>- graphics programming<p>- compilers and programming language implementation<p>- media codecs (audio, video, images)<p>- media processing (e.g. text to speech or speech recognition)<p>- networking (IP, TCP, etc.)<p>- embedded systems<p>- cryptography (or implementation of cryptocurrencies like Monero)<p>- text rendering (creation of fonts and display on screen)<p>- signal processing (e.g. wireless or satellite signals)<p>- telecom systems (5G, 4G, etc.)<p>- positioning systems (GPS, GLONASS, etc.)<p>- any other topic the community thinks I have missed out",
      "time": 1651576399,
      "title": "Ask HN: Resources to understand various branches of low level programming?",
      "type": "story"
    },
    {
      "by": "nigerian1981",
      "descendants": 0,
      "id": 31246915,
      "score": 1,
      "time": 1651576381,
      "title": "Wearing shoes inside the house is gross – and there’s science to back that up",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2022/may/03/wearing-shoes-indoors-bad-science"
    },
    {
      "by": "nanankcornering",
      "descendants": 0,
      "id": 31246914,
      "score": 1,
      "text": "Threat actor was able to gain access to Hypixel&#x27;s main website (deface) &amp; their Minecraft game proxy&#x2F;loadbalancer.<p>How in the world they could gain access to both their web &amp; game infra, both are completely different worlds!?<p>https:&#x2F;&#x2F;twitter.com&#x2F;Runninq_&#x2F;status&#x2F;1521385366976147457&#x2F;photo&#x2F;1<p>https:&#x2F;&#x2F;twitter.com&#x2F;HypixelNetwork&#x2F;status&#x2F;1521353521597231104<p>https:&#x2F;&#x2F;twitter.com&#x2F;HypixelNetwork&#x2F;status&#x2F;1521379642665447424",
      "time": 1651576376,
      "title": "Hypixel, Minecraft's top multiplayer server, got its web and game proxy hijacked",
      "type": "story"
    },
    {
      "by": "capableweb",
      "descendants": 1,
      "id": 31246909,
      "kids": [
        31246921
      ],
      "score": 1,
      "time": 1651576317,
      "title": "Build-Once Run-Anywhere C lib that runs on Linux, Windows, macOS, BSDs and more",
      "type": "story",
      "url": "https://github.com/jart/cosmopolitan"
    }
  ]
}