{
  "stories": [
    {
      "by": "mch82",
      "descendants": 0,
      "id": 29847741,
      "score": 1,
      "time": 1641606880,
      "title": "Developing an App on the iPad in Swift Playgrounds from Start to Finish",
      "type": "story",
      "url": "https://www.cephalopod.studio/blog/lessons-from-developing-an-app-on-the-ipad-from-start-to-finish-on-the-app-store"
    },
    {
      "by": "vector_spaces",
      "descendants": 0,
      "id": 29847692,
      "score": 1,
      "text": "A friend of mine is trying to take more control of search engine results when you Google him. He doesn&#x27;t have much social media presence but still comes up in people search directories like peekyou, mylife, spokeo, and Whitepages.<p>1. Does anyone have experience removing themselves from such sites? Is it even possible?\n2. Are there other general best practices that can be followed, aside from not using or anonymizing social media, setting boundaries with friends and family about posting about you on social media, and reaching out directly to smaller sites that have content about you?<p>If it&#x27;s helpful, this friend is in California. He&#x27;s specifically worried about former employees of the company he works for, since he is involved in terminations sometimes.",
      "time": 1641606466,
      "title": "Ask HN: Degoogling and personal search engine results management best practices?",
      "type": "story"
    },
    {
      "by": "FinnKuhn",
      "descendants": 0,
      "id": 29847682,
      "score": 1,
      "time": 1641606409,
      "title": "Dutch government to pay million Euro fine over racist data discrimination",
      "type": "story",
      "url": "https://netzpolitik.org/2022/childcare-benefits-scandal-dutch-government-to-pay-million-euro-fine-over-racist-data-discrimination/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29847655,
      "score": 2,
      "time": 1641606240,
      "title": "On the Y Combinator Summer 2021 batch",
      "type": "story",
      "url": "https://jaredheyman.medium.com/on-the-y-combinator-summer-2021-batch-927cb556a373"
    },
    {
      "by": "leotravis10",
      "descendants": 0,
      "id": 29847651,
      "score": 1,
      "time": 1641606218,
      "title": "40 years ago today: the Commodore 64 debut at CES",
      "type": "story",
      "url": "https://blog.adafruit.com/2022/01/07/40-years-ago-today-the-commodore-64-debut-at-ces-vintagecomputing-retrocomputing-commodore/"
    },
    {
      "by": "stubish",
      "descendants": 0,
      "id": 29847629,
      "score": 1,
      "time": 1641606076,
      "title": "You Can Swap an EV Battery in China for $7",
      "type": "story",
      "url": "https://www.gizmodo.com.au/2022/01/you-can-swap-an-ev-battery-in-china-for-7/"
    },
    {
      "by": "mZ6uYffk",
      "descendants": 0,
      "id": 29847624,
      "score": 1,
      "text": "This takes the cake for the most damage any bug has ever caused me. You can find the full details here, https:&#x2F;&#x2F;letrosswrite.com&#x2F;, but that mostly focuses on the bureaucratic side of things. I thought it might be interesting to discuss the technical aspect of the problem.<p>For four months now, the UMN email system has sent most of my outgoing emails related to my honors thesis directly to spam, but somehow every email that I&#x27;ve sent to another student or to any of my instructors went through without a hitch. When I reported the lack of responses to the IT department, (I wasn&#x27;t sure if it was an email problem at the time), they told me that if my email was blocked as spam I would receive a bounce-back email notifying me of the issue. I had not. So far I&#x27;ve confirmed with three separate professors that me emails were being blocked the whole time.<p>That makes several layers of failure. The system failed to deliver my emails, it failed to notify me of the failed delivery, and it failed to notify anyone on the IT staff of the failed notification (which I would hope they have). Worse than that, students at the UMN are assigned emails which we are required to use, which means that the UMN email system knows that my email is attached to a specific student, and there are a limited number of emails in circulation. Google, Facebook, and and Twitter have to deal with open registration, but not UMN.<p>I&#x27;ve been a dedicated bug fixer for a large corp before, and I&#x27;ve never seen a bug this bad, but I might be too close to the situation to stay objective. What do ya&#x27;ll think?",
      "time": 1641606044,
      "title": "The University of Minnesota spam filter might have just cost me Summa Cum Laude",
      "type": "story"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29847587,
      "score": 2,
      "time": 1641605744,
      "title": "Ztype",
      "type": "story",
      "url": "https://zty.pe/"
    },
    {
      "by": "jarbus",
      "descendants": 0,
      "id": 29847579,
      "score": 1,
      "time": 1641605665,
      "title": "The Hacker's Diet",
      "type": "story",
      "url": "https://www.fourmilab.ch/hackdiet/"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 29847571,
      "score": 1,
      "text": "So what is service manager in any Linux on Android as in<p>https:&#x2F;&#x2F;www.makeuseof.com&#x2F;tag&#x2F;how-to-linux-on-android&#x2F;<p>Our hunch would immediately say it&#x27;d be not systemd anymore whatsoever<p>But real quest is the useful insight&#x2F;explanation in anything of the service manager in this configuration",
      "time": 1641605567,
      "title": "Ask HN: What actually is service manager in Linux on Android?",
      "type": "story"
    }
  ]
}