{
  "stories": [
    {
      "by": "civilized",
      "descendants": 0,
      "id": 29725034,
      "score": 1,
      "time": 1640787883,
      "title": "US foreign policy is driven mostly by politics, not grand strategy",
      "type": "story",
      "url": "https://richardhanania.substack.com/p/new-book-public-choice-theory-and"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 29725018,
      "score": 1,
      "text": "What do you use to host emails on a custom domain for your family? Not necessarily a DIY hosting but something simpler, economical, and privacy preserved.",
      "time": 1640787770,
      "title": "Ask HN: Any better alternatives to Google Workspace for a family of five",
      "type": "story"
    },
    {
      "by": "thatsamonad",
      "descendants": 0,
      "id": 29725009,
      "score": 1,
      "time": 1640787743,
      "title": "Your DNA Test Could Send a Relative to Jail",
      "type": "story",
      "url": "https://www.nytimes.com/2021/12/27/magazine/dna-test-crime-identification-genome.html"
    },
    {
      "by": "samglover97",
      "descendants": 0,
      "id": 29725002,
      "score": 1,
      "time": 1640787685,
      "title": "Marijuana: Much more than you wanted to know",
      "type": "story",
      "url": "https://slatestarcodex.com/2014/01/05/marijuana-much-more-than-you-wanted-to-know/"
    },
    {
      "by": "throw0101a",
      "descendants": 0,
      "id": 29724989,
      "score": 1,
      "time": 1640787612,
      "title": "BlackBerry device and services end of life January 4, 2022",
      "type": "story",
      "url": "http://rcom-brw.browse-prod1.svc.cluster.local/support/mobility/blackberry-phones-discontinue?icid=ba-supotcon-strcsup-12032060"
    },
    {
      "by": "plaur782",
      "descendants": 0,
      "id": 29724974,
      "score": 2,
      "time": 1640787496,
      "title": "Five Tips for a Healthier Postgres Database in the New Year",
      "type": "story",
      "url": "https://blog.crunchydata.com/blog/five-tips-for-a-healthier-postgres-database-in-the-new-year"
    },
    {
      "by": "rylandking",
      "descendants": 0,
      "id": 29724948,
      "score": 1,
      "time": 1640787306,
      "title": "How Meituan is redefining food delivery in China with drones",
      "type": "story",
      "url": "https://techcrunch.com/2021/12/29/meituan-food-drone-delivery-china/"
    },
    {
      "by": "Wonnk13",
      "descendants": 0,
      "id": 29724944,
      "score": 2,
      "text": "I&#x27;m tired of playing second fiddle to slimy sales folks and being talked down to. I also enjoy the implementation details of a project more so than just high-level talking points and a scripted demo. Everything is always a firedrill, no sprint planning, or the ability to do deep focused work, I&#x27;m constantly context switching to answer some question from an account exec.<p>I have some experience building data pipelines and APIs with Python and Go, but lack algorithm fundamentals. I do get along really well with our internal SWEs and enjoy chatting with them much more than my own team and manager.<p>I know the grass is always greener and moving to SWE would bring constant pressure to ship working code which is something I haven&#x27;t experienced with my own hobby coding. At my current company I can&#x27;t interview internally for another year, and I&#x27;m not sure my manager it would support it anyway.<p>I&#x27;m curious if any SEs have made the transition to backend development fulltime and how they did it? Alternatively, are there any companies that have a culture where SEs and pro-serve is treated with respect and not looked down on by sales execs?",
      "time": 1640787274,
      "title": "Ask HN: Sales Engineers, how did you move into software engineering?",
      "type": "story"
    },
    {
      "by": "momothereal",
      "descendants": 1,
      "id": 29724943,
      "kids": [
        29725036
      ],
      "score": 1,
      "text": "My university now requires the use of a school-managed VPN on personal devices to access most student services outside campus.<p>It makes me super uncomfortable to have to install something so intrusive on a personal device, since it can capture any internet traffic without my knowledge and outside class hours. Somehow I find this worse than protractor software like Respondus privacy-wise...<p>According to the school, the only other alternative is to use campus Wifi (even though my uni is still doing all classes remote since Omicron). They do not and have never offered school-supplied laptops like companies usually do for secure connections.<p>I&#x27;ve never heard of another school doing this before. Have you?",
      "time": 1640787271,
      "title": "University Requiring Use of VPN",
      "type": "story"
    },
    {
      "by": "LinuxBender",
      "descendants": 0,
      "id": 29724914,
      "score": 1,
      "time": 1640787030,
      "title": "Nginx 1.21.5 Released: Changelog",
      "type": "story",
      "url": "https://nginx.org/en/CHANGES"
    }
  ]
}