{
  "stories": [
    {
      "by": "aritraghosh007",
      "descendants": 0,
      "id": 29145725,
      "score": 1,
      "time": 1636339551,
      "title": "Pulling 20k Lbs of Plastic from the Great Pacific Garbage Patch",
      "type": "story",
      "url": "https://www.smithsonianmag.com/smart-news/this-new-installation-just-pulled-20000-pounds-of-plastic-from-the-great-pacific-garbage-patch-180978895/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29145712,
      "score": 1,
      "time": 1636339373,
      "title": "A Tech Millionaire’s Guide to Philanthropy",
      "type": "story",
      "url": "https://hunterwalk.com/2021/11/07/a-tech-millionaires-guide-to-philanthropy%ef%bf%bc/"
    },
    {
      "by": "aquark",
      "descendants": 0,
      "id": 29145710,
      "score": 1,
      "text": "We provide a platform SaaS so generate emails on behalf of our customers to their customers.<p>While our spam rate is very low, at least 2&#x2F;3&#x27;s of the spam reports we do get are for what appear to be totally legitimate transactional emails (eg. purchase receipts).  Some could be typo&#x27;s in an email address but I suspect the majority are misclicks on the end users part.<p>Currently we unsubscribe all spam reporting addresses from all emails which causes some problems with support questions as to why people aren&#x27;t getting emails they then expect as follow ups.<p>How do people handle this: treat all spam reports as a hard &#x27;never-going-to-email-you-again&#x27; to protect your email reputation or continue to send high priority transactional emails regardless, or ???",
      "time": 1636339357,
      "title": "Ask HN: How do you handle spam reports against transactional email",
      "type": "story"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 29145703,
      "score": 1,
      "time": 1636339272,
      "title": "Xi Wangmu – The great shamanic goddess of China [pdf]",
      "type": "story",
      "url": "https://palaceofwisdom.org/wp-content/uploads/2021/01/Xi-Wangmu-the-shamanic-great-goddess-of-China.pdf"
    },
    {
      "by": "mattnigh",
      "descendants": 0,
      "id": 29145687,
      "score": 1,
      "time": 1636339090,
      "title": "How to Create User Personas for Data Engineering",
      "type": "story",
      "url": "https://medium.com/leading-literally/data-and-product-how-to-create-user-personas-for-data-engineering-ec71902235e5"
    },
    {
      "by": "gigalord",
      "descendants": 0,
      "id": 29145673,
      "score": 2,
      "time": 1636338924,
      "title": "Improving a Machine Learning System Is Hard",
      "type": "story",
      "url": "https://danshiebler.com/2021-11-06-ml-systems-1/"
    },
    {
      "by": "guiambros",
      "descendants": 0,
      "id": 29145656,
      "score": 1,
      "time": 1636338692,
      "title": "Generators in Python [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=gMompY5MyPg"
    },
    {
      "by": "tuatoru",
      "descendants": 0,
      "id": 29145647,
      "score": 1,
      "time": 1636338612,
      "title": "In a Captured State [Why nothing gets done]",
      "type": "story",
      "url": "https://thespinoff.co.nz/politics/06-11-2021/in-a-captured-state/"
    },
    {
      "by": "stygiansonic",
      "descendants": 0,
      "id": 29145642,
      "score": 2,
      "time": 1636338553,
      "title": "Great Flood of 1862",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Great_Flood_of_1862"
    },
    {
      "by": "codingcall",
      "descendants": 1,
      "id": 29145641,
      "kids": [
        29145679
      ],
      "score": 4,
      "text": "At the age of 40 I decided to go back to school and launch a new career in tech. In 2019 I graduated from a good university with a master degree in Computer Science but I could not be less disappointed and frustrated. I have paid more than USD 45,000 in tuition and accommodation just to realize the knowledge I acquired was not worth it at all.<p>My goal was to start my own programming career and try to make money online like everyone else.<p>The subjects we took sounded very impressive: Software Engineering, Distributed Systems, OOP, Semantic Web, Web Development, Digital Imaging and Computer Vision…etc. In reality students don&#x27;t have time to learn anything valuable and you graduate with weak skills at all these areas.<p>I have been reflecting on all that wasted time, money and efforts during my school. As students we were really busy, but in reality we were learning nothing serious related to the real world problems or emerging technologies. I don’t throw the blame on the classes I took, but when the professor who is teaching you web development does not know what Bootstrap is, then that is a big problem.<p>I respect and value education, but some fields can be realized outside of the classroom. Honestly, I don&#x27;t even know where I placed my diploma. Maybe somewhere in a box in my basement.<p>Recently, I have been teaching myself programming and web development using free resources on YouTube and other free platforms. I was determined to become a programmer and to launch a career in Web Development. To some extent, I can say I am advancing pretty well, and the things I learned so far could not have been acquired otherwise.<p>I am now able to develop complex systems that are used by thousands of people on daily bases; thinking about this, nothing I learned in college contributed to my ability to build and launch these products. Everything I learned was from YouTube and other FREE resources like Udacity, Coursera, and Edx…etc<p>I do not want to generalize, but it was a complete waste for my time and money. I understand and respect other opinions, but -leaving the college credential out of this- I cannot see the value of learning computer science or software engineering for loads of money, while you can get much better education on the same subjects for free.<p>I can say with complete confidence that if you are interested in learning Computer Science, or at least the field of Web Development you can do this without the need to go for a paid CS Degree or even an expensive bootcamp. If I can do it, anyone else in the world can do it…even better than I did.<p>Start from the free resources on the Internet and use your inner grit and persistence; that’s all its going to take. No matter how old you are, you still can get into tech; that’s the beauty of the internet; everyone can launch a career and work online.<p>You will hate it at the beginning, but I promise, the more you learn the easier and more fun it becomes. Start with the simple stuff and enjoy whatever you think is easy to understand. Ignore the hard parts as they will become easier down the road when you revisit them.<p>At the moment I am challenging myself to build 100 websites and applications to continue my journey and stay motivated. I am learning new stuff everyday. I started with Wordpress and built many things with it, then moved to Paython, Django, Bootstrap and Vanilla JS, and now shifted to PHP, Laravel, Vue, Tailwind and many other technologies. It is a world of fun and great opportunities. Already finished 9 websites in this current challenge. The idea is not to just build useless systems and apps for practice purposes, but to find what kind of a programmer I will become at the end of this journey.<p>If you’re interested in following my progress you can follow me on Twitter at: @ameensanad or https:&#x2F;&#x2F;twitter.com&#x2F;AmeenSanad",
      "time": 1636338531,
      "title": "Wasted $45,000 on a CS Degree to end up learning from YouTube",
      "type": "story"
    }
  ]
}