{
  "stories": [
    {
      "by": "Austin_Conlon",
      "descendants": 0,
      "id": 31843675,
      "score": 1,
      "time": 1655944182,
      "title": "How to file great bug reports",
      "type": "story",
      "url": "https://developer.apple.com/news/?id=vvrgkboh"
    },
    {
      "by": "dginev",
      "descendants": 0,
      "id": 31843666,
      "score": 1,
      "time": 1655944132,
      "title": "Intent to Ship: MathML in Chromium",
      "type": "story",
      "url": "https://www.igalia.com/2022/06/22/Intent-to-Ship-MathML.html"
    },
    {
      "by": "planethumanguy",
      "descendants": 1,
      "id": 31843654,
      "kids": [
        31843678
      ],
      "score": 1,
      "text": "So here is some background information for some context:\n- Am 25 yrs of age\n- I live in a developing country(if that matters)\n- I finished my studies in 2020 but graduated with a degree in computer technology in 2021 due to Covid\n- But I started developing real world applications in 2018, due to financial issues. The freelance contracts\n I got around that time, helped alleviate my financial woes including paying for my fees.\n- Got my first permanent software job at a remote startup in a developed country in 2019 and \nbeen working there ever since as one of the founding developers.<p>But now I have been interested in getting another job for some time due to a some issues affecting me in \nthe current company:\n- Working on some weekends, frequency increased in the past 8 months\n- The boss claims he will give me a weekday replacing the weekends worked but most of them are not\n replaced(giving an impression am working for free)\n- Occasionally, there is always a deadline leading to working 12 hours+ to meet it\n- The long working hours and weekends got so bad that I got burnt out and tried to quit a few months ago,\nbut boss told me he will replace them but the bad patterns have already emerged again \n- Changes in some of the clauses in the contract or per what we agreed without letting me before hand.\n- I suggest we follow best practices but the boss is more focused on how many features we can develop, \ntasks we can do.<p>I have applied to a couple of jobs(on and off) in that span of time and although I was able to get \nthem to have a call with me or get tested for my skills, I often failed the technical \nassessments due to lack of enough preparation(since most of the time am working and rest when I am free)\nAlso I see most jobs either requires to have experience in distributed systems(which I have no professional experience)\nand use industry standards to write software(which we never followed). This makes me feel like I need to learn\neven more things in order for those companies to see I am experienced and its not just fluff.<p>The current job limits my time but I want to grind hard on various technical questions so\nthat I can be considered for any role and at least reach the offer stages. I also have 4 months reserves\nto sustain my current lifestyle. I also heard you are more likely to get a job while you are on a job.\nNow comes my question, should I quit my current job then I practice for interviews to increase my chances of\nfind a better job?<p>Also any help on how to prepare for interviews and crafting a very attractive resume would be appreciated. Thanks!",
      "time": 1655943994,
      "title": "Ask HN: Quitting a job to get time to prepare for interviews",
      "type": "story"
    },
    {
      "by": "TurkishPoptart",
      "descendants": 0,
      "id": 31843639,
      "score": 1,
      "time": 1655943933,
      "title": "Chicago police will no longer be allowed to chase people on foot",
      "type": "story",
      "url": "https://text.npr.org/1106654201"
    },
    {
      "by": "saltypal",
      "descendants": 0,
      "id": 31843614,
      "score": 2,
      "time": 1655943723,
      "title": "Heroku apps unreachable (follow-up)",
      "type": "story",
      "url": "https://status.heroku.com/incidents/2442"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31843612,
      "score": 1,
      "time": 1655943722,
      "title": "Choose your own adventure game takes users into the lives of Indigenous youth",
      "type": "story",
      "url": "https://www.torontomu.ca/news-events/news/2022/06/in-their-moccasins/"
    },
    {
      "by": "echen",
      "descendants": 0,
      "id": 31843609,
      "score": 1,
      "time": 1655943709,
      "title": "Humans vs. Gary Marcus: The Complexity of Measuring Machine Intelligence",
      "type": "story",
      "url": "https://www.surgehq.ai//blog/humans-vs-gary-marcus"
    },
    {
      "by": "nateb2022",
      "descendants": 0,
      "id": 31843587,
      "score": 1,
      "time": 1655943489,
      "title": "Five Planets Align for the First Time in 18 Years: When and How to See It",
      "type": "story",
      "url": "https://www.newsweek.com/five-planets-align-first-time-18-years-when-how-see-1718171"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31843579,
      "score": 1,
      "time": 1655943431,
      "title": "Is NextJS a Better Choice Than React in 2022?",
      "type": "story",
      "url": "https://hackernoon.com/is-nextjs-a-better-choice-than-react-in-2022"
    },
    {
      "by": "simpleintheory",
      "descendants": 0,
      "id": 31843522,
      "score": 2,
      "time": 1655942982,
      "title": "Britain Declares National Incident After Poliovirus Found in London",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/22/health/uk-polio-london-poliovirus.html"
    }
  ]
}