{
  "stories": [
    {
      "by": "edogrider",
      "descendants": 0,
      "id": 31495306,
      "score": 1,
      "time": 1653414760,
      "title": "Using MSFT SQL Server 2022 to Query Data Stored on MinIO via External Tables",
      "type": "story",
      "url": "https://blog.min.io/sqlserver2022/"
    },
    {
      "by": "Mobil1",
      "descendants": 0,
      "id": 31495303,
      "score": 1,
      "text": "So here&#x27;s the REAL story:<p>Ambassador Stevens was sent to Benghazi to secretly retrieve US made Stinger Missiles that the State Dept had supplied to Ansar al Sharia in Libya WITHOUT Congressional oversight or permission.<p>Sec State Hillary Clinton had brokered the Libya deal through Ambassador Stevens and a Private Arms Dealer named Marc Turi, but some of the shoulder fired Stinger Missiles ended up in Afghanistan where they were used against our own military. On July 25th, 2012, a US Chinook helicopter was downed by one of them. Not destroyed only because the idiot Taliban didn&#x27;t arm the missile. The helicopter didn&#x27;t explode, but it had to land and an ordnance team recovered the missile’s serial number which led back to a cache of Stinger Missiles kept in Qatar by the CIA.<p>Obama and Hillary were in full panic mode, so Ambassador Stevens was sent to Benghazi to retrieve the rest of the Stinger Missiles. This was a &quot;do-or-die&quot; mission, which explains the Stand Down Orders given to multiple rescue teams during the siege of the US Embassy.<p>It was the State Dept, NOT the CIA, that supplied the Stinger Missiles to our sworn enemies because Gen. Petraeus at CIA would not approve supplying the deadly missiles due to their potential use against commercial aircraft. So then, Obama threw Gen. Petraeus under the bus when he refused to testify in support of Obama’s phony claim of a “spontaneous uprising caused by a YouTube video that insulted Muslims.”\nObama and Hillary committed TREASON!<p>THIS is what the investigation is all about, WHY she had a Private Server, (in order to delete the digital evidence), and WHY Obama, two weeks after the attack, told the UN that the attack was the result of the YouTube video, even though everyone KNEW it was not.<p>Furthermore, the Taliban knew that the administration had aided and abetted the enemy WITHOUT Congressional oversight or permission, so they began pressuring (blackmailing) the Obama Administration to release five Taliban generals being held at Guantanamo.<p>Bowe Bergdahl was just a useful pawn used to cover the release of the Taliban generals. Everyone knew Bergdahl was a traitor but Obama used Bergdahl’s exchange for the five Taliban generals to cover that Obama was being coerced by the Taliban about the unauthorized Stinger Missile deal.<p>So we have a traitor as POTUS that is not only corrupt, but compromised, as well and a Sec of State that is a serial liar, who perjured herself multiple times at the Congressional Hearings on Benghazi. Perhaps this is why no military aircraft were called upon for help in Benghazi: because the administration knew that our enemies had Stinger Missiles, that if used to down those planes, would likely be traced back to the CIA cache in Qatar and then to the State Dept’s illegitimate arms deal in Libya.",
      "time": 1653414744,
      "title": "The Benghazi Fiasco",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 31495288,
      "score": 1,
      "time": 1653414668,
      "title": "GeoGuessr – Let's Explore the World",
      "type": "story",
      "url": "https://www.geoguessr.com/"
    },
    {
      "by": "mwcampbell",
      "descendants": 0,
      "id": 31495287,
      "score": 2,
      "time": 1653414661,
      "title": "Recession Engineering (2008)",
      "type": "story",
      "url": "https://www.al3x.net/blog/2008/12/04/recession-engineering"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 31495271,
      "score": 1,
      "time": 1653414586,
      "title": "Forest Farming: Ginseng",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=otRBbTnhpQs"
    },
    {
      "by": "englishm",
      "descendants": 0,
      "id": 31495237,
      "score": 2,
      "time": 1653414392,
      "title": "Introducing Real-Time Video",
      "type": "story",
      "url": "https://www.mux.com/blog/introducing-real-time-video"
    },
    {
      "by": "davidkircos",
      "descendants": 0,
      "id": 31495232,
      "score": 2,
      "time": 1653414371,
      "title": "Open Source Programming Spreadsheet",
      "type": "story",
      "url": "https://www.quadratic.to/"
    },
    {
      "by": "kylegalbraith",
      "descendants": 1,
      "id": 31495222,
      "kids": [
        31495332
      ],
      "score": 2,
      "time": 1653414332,
      "title": "Not My Job",
      "type": "story",
      "url": "https://blog.dbsmasher.com/2022/05/24/not-my-job.html"
    },
    {
      "by": "vl",
      "descendants": 0,
      "id": 31495197,
      "score": 1,
      "text": "If you are interested in crypto, what sites are you reading daily?<p>(Please refrain from &quot;crypto is bad&quot; off-topic comments)",
      "time": 1653414180,
      "title": "Ask HN: What is your source of crypto news?",
      "type": "story"
    },
    {
      "by": "jshchnz",
      "descendants": 0,
      "id": 31495189,
      "score": 2,
      "time": 1653414127,
      "title": "Code Injection with Dyld Interposing",
      "type": "story",
      "url": "https://www.emergetools.com/blog/posts/DyldInterposing"
    }
  ]
}