{
  "stories": [
    {
      "by": "zeristor",
      "descendants": 0,
      "id": 30743698,
      "score": 1,
      "time": 1647791603,
      "title": "In Our Time: The Gold Standard",
      "type": "story",
      "url": "https://www.bbc.co.uk/programmes/m0013hh7"
    },
    {
      "by": "vkdelta",
      "descendants": 0,
      "id": 30743695,
      "score": 1,
      "time": 1647791593,
      "title": "How I Finally Got into Journaling After Failing 5 Times",
      "type": "story",
      "url": "https://hulry.com/journaling-ideas/"
    },
    {
      "by": "rohanrhu",
      "descendants": 0,
      "id": 30743665,
      "score": 1,
      "time": 1647791388,
      "title": "Online C IDE/Debugger with Collabration (Open Source)",
      "type": "story",
      "url": "https://debugme.online/"
    },
    {
      "by": "lienhoangduy",
      "descendants": 0,
      "id": 30743660,
      "score": 1,
      "text": "What is the best way to focus? I&#x27;m often being distracted by everything around me while working. At the office, I heard what my colleague discuss and always want to jump in.\nWhen wfh, noise from cars, tv, fam members talk...also borders me a lot. I&#x27;ve tried using headphone but I don&#x27;t think it work. Can you guys give me some recommendation on how you apply to stay focus?",
      "time": 1647791352,
      "title": "Ask HN: How to Stay Focus?",
      "type": "story"
    },
    {
      "by": "smlckz",
      "descendants": 0,
      "id": 30743641,
      "score": 1,
      "time": 1647791256,
      "title": "Explaining Web 2.0 (2008)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=7BAXvFdMBWw"
    },
    {
      "by": "vpanyam",
      "descendants": 0,
      "id": 30743639,
      "score": 1,
      "text": "I’m building a robot that can track nerf darts and shoot them out of the air.<p>I’ve worked on other projects in robotics and object tracking (perception for self driving cars), but this has a whole different set of challenges.<p>Nerf rival rounds travel at over 100 feet per second and shooting them out of the air requires aiming systems that are precise to less than half the width of a human hair and timing precision of 600 times faster than the blink of an eye.<p>This is the first part of the series of me building the project (and my first video!) so I’d love to hear what you think!",
      "time": 1647791251,
      "title": "Show HN: I’m Building a Nerf Dart Missile Defense System",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=wF-f_AdCxl0"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 30743638,
      "score": 1,
      "time": 1647791247,
      "title": "Memoirs of Picasso: four characters in search of an artist",
      "type": "story",
      "url": "https://www.thearticle.com/memoirs-of-picasso-four-characters-in-search-of-an-artist"
    },
    {
      "by": "muxamilian",
      "descendants": 0,
      "id": 30743612,
      "score": 1,
      "text": "WYSIWHY is a neural network that transforms an input video into an audio sequence in real time. It does so by compressing each image using an autoencoder and interpreting the resulting code as a frequency range.<p>This could potentially be useful for the visually impaired, helping with indoor navigation. It could also be used to transform an infrared or ultraviolet video to sound and thus enable one to perceive otherwise invisible colors.<p>In a usual autoencoder, the elements of the code vector are independent of each other. This makes subtle differences between adjacent elements of the code vector hard to perceive for humans. The resulting audio sequence would sound like indistinguishable white noise. For WYSIWYH thus an encoder is used which hierarchically structures the code, meaning that large differences in the input image result in large differences in the output code. This also results in adjacent elements of the code vector being correlated. This makes the autoencoder’s code more friendly to human perception.",
      "time": 1647791052,
      "title": "Show HN: Hear what you see: Neural net to convert video to audio",
      "type": "story",
      "url": "https://github.com/muxamilian/wysiwyh"
    },
    {
      "by": "smoldesu",
      "descendants": 0,
      "id": 30743605,
      "score": 1,
      "time": 1647791028,
      "title": "Typatone: Typing to Music Compositions",
      "type": "story",
      "url": "https://typatone.com/"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 30743577,
      "score": 2,
      "time": 1647790885,
      "title": "How much Rust in Firefox? March 2022",
      "type": "story",
      "url": "https://4e6.github.io/firefox-lang-stats/"
    }
  ]
}