{
  "stories": [
    {
      "by": "offsky",
      "descendants": 0,
      "id": 32194482,
      "score": 1,
      "text": "Im finally ready to share a fun side project that I&#x27;ve been working on.<p>For 20 years, Ive been fascinated with Mandelbrot fractals. Back in the day, I made a MacOS9 app that rendered them, and I missed it. So, I decided to bring it up to the modern age and build a website to explore this and other similar fractals.<p>In the process, I discovered some other types of generative art that looked fun, so I made those too.  One is a spirograph, another is similar to an old AfterDark screensaver called Satori (anyone remember that?). Others draw paint splatters and random squiggly lines.  The user is given a bunch of interactive settings to control how the artwork is generated.<p>Im hoping to continue adding different styles of generative art to the website over time. Its a fun, relaxing project to work on and I hope other people enjoy using it to create pleasing images.",
      "time": 1658510050,
      "title": "Show HN: Zazow – Generative Art Toy (fractals, spirograph, satori, etc.)",
      "type": "story",
      "url": "https://www.zazow.com"
    },
    {
      "by": "u8",
      "descendants": 0,
      "id": 32194472,
      "score": 1,
      "time": 1658509999,
      "title": "Go Errors Are a Pain",
      "type": "story",
      "url": "https://twitter.com/tristanisham/status/1550529261781516289"
    },
    {
      "by": "gruberjl",
      "descendants": 1,
      "id": 32194453,
      "kids": [
        32194454
      ],
      "score": 1,
      "time": 1658509886,
      "title": "What's in This Course?",
      "type": "story",
      "url": "https://www.gitbit.org/course/ms-500/learn/Whats-in-this-course-cpchjBLkC"
    },
    {
      "by": "clay-dreidels",
      "descendants": 0,
      "id": 32194428,
      "score": 1,
      "time": 1658509785,
      "title": "Border Wallets – a new way to quickly and reliably memorize Bitcoin seed phrases",
      "type": "story",
      "url": "https://www.borderwallets.com/"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 32194426,
      "score": 1,
      "time": 1658509766,
      "title": "How Craig Barton wishes he’d taught maths (2018)",
      "type": "story",
      "url": "https://gowers.wordpress.com/2018/12/22/how-craig-barton-wishes-hed-taught-maths/"
    },
    {
      "by": "brobdingnagians",
      "descendants": 0,
      "id": 32194421,
      "score": 2,
      "time": 1658509748,
      "title": "China’s Top Chipmaker Achieves Breakthrough Despite US Curbs",
      "type": "story",
      "url": "https://www.msn.com/en-us/money/markets/chinas-top-chipmaker-achieves-breakthrough-despite-us-curbs/ar-AAZObY1?li=BBnbfcL"
    },
    {
      "by": "fer",
      "descendants": 2,
      "id": 32194373,
      "kids": [
        32194422
      ],
      "score": 3,
      "text": "Hi.<p>I apologize in advance, but it looks like it&#x27;s my turn for social media big tech support.<p>I had a situation where OVH abused a PayPal authorization to charge me 1200€ for a &quot;private cloud&quot; credit I never asked. OVH refuses to refund me changing the reason for it every time, but well, that&#x27;s another topic.<p>I filed a PayPal dispute, I added exchanges with OVH as evidence, where they constantly insist on me having this &quot;credit&quot; still available for me to use, and my insisting on not wanting it for any purpose (the 12€ I added were enough for my test) and not having ordered it.<p>Finally, PayPal ruled in favor of OVH claiming that I &quot;never provided documentation to prove this credit&quot;.<p>Not only I did (OVH messages), but nobody asked me for evidence at any point: I could have provided extra information&#x2F;screenshots where it is shown. I am positive OVH was requested multiple times for documentation to support their claims, but that was never the case for me, not sure if that&#x27;s normal.<p>Now I&#x27;m stuck with an absurd amount of credit on a cloud service I have no use for (and worse, it expires in a year), and apparently there&#x27;s no UI option for me to contest this PayPal ruling. Phoning them I found no option to talk to a person.<p>Other than lawyering up and contacting consumer protection organisations, what else is there to do? Anyone at PayPal can give me a hint?<p>Thanks in advance.",
      "time": 1658509560,
      "title": "Ask HN: PayPal dismissed my claim, saying I didn't provide evidence (yet I did)",
      "type": "story"
    },
    {
      "by": "downboots",
      "descendants": 0,
      "id": 32194368,
      "score": 1,
      "time": 1658509528,
      "title": "The Toll of Fireworks",
      "type": "story",
      "url": "https://www.nationalgeographic.com/environment/article/the-hidden-toll-of-july-fourth-fireworks"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 32194356,
      "score": 2,
      "time": 1658509460,
      "title": "Countries with Declining Population 2022",
      "type": "story",
      "url": "https://worldpopulationreview.com/country-rankings/countries-with-declining-population"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 32194353,
      "score": 1,
      "time": 1658509448,
      "title": "Garnet Programming Language",
      "type": "story",
      "url": "https://hg.sr.ht/~icefox/garnet"
    }
  ]
}