{
  "stories": [
    {
      "by": "toomuchtodo",
      "descendants": 0,
      "id": 28031734,
      "score": 1,
      "time": 1627865145,
      "title": "The most intense heatwave of the year is underway across southeastern Europe",
      "type": "story",
      "url": "https://www.severe-weather.eu/europe-weather/extreme-record-heatwave-greece-mk/"
    },
    {
      "by": "lonnydonovan",
      "descendants": 1,
      "id": 28031725,
      "kids": [
        28031754
      ],
      "score": 1,
      "text": "Hello hackers, I am Arsen. We are a team of two, and I would like to introduce you to our tool called PrivateAnalytix https:&#x2F;&#x2F;privateanalytix.com<p>What is PA: PrivateAnalyltix is a privacy-first alternative to Google Analytics and Microsoft Clarity.<p>What problem does PA solve: I don&#x27;t want to sound like a marketer, so I&#x27;ll tell you how it is. The problem we aim to solve is for a price of 2 coffees, to allow web site owners see visitor analytics, quickly find out why do their web site users not convert, save a ton of time troubleshooting (replicating) and improving design issues, A&#x2F;B test without compromising their user&#x27;s privacy. We also aim to help improve web site SEO and conversions.<p>But there are other tools: &quot;But there are many other tools, like Plausibe.io that do the same&quot;, you&#x27;d say. We know and love our colleague&#x27;s work at Fanthom, Plausible and many others. PrivateAnalytics is different in that it adds Session Replays and Heatmaps, giving you the best of both (GA and Clarity) in one privacy-focused package.<p>What does PA solve: With PrivateAnalytix your data never leaves the server. We never access it, we never sell it or share it with any 2nd or 3rd party. Even with Session Replays and Heatmaps you have 100% control of the data we collect. If you delete something, it&#x27;s gone forever. We keep a 7 day data image backup, in case if our site goes down. These are deleted on rolling basis.<p>My backstory: I am a molecular biologist and a PharmD by education, but a B2B specialist by training.  Due to COVID, I had to take a 1-year leave from my PharmD program. After I came back, I&#x27;ve got COVID, failed one of my exams and got kicked out of the program. With a $300K student loan repayment looming in September, I spent all of my savings (~$20K) and went all out to create PrivateAnalytix, hoping to reinvent my life. I&#x27;ve gotten into another PharmD program, but quit, because I&#x27;ve realized that I can work 18 hour days as a software company founder and feel joy. Not a single minute of what I do for PA feels like work, despite that others would consider this as a grueling job. Perhaps I was wrong, but I give PA my all. Excellent customer service and the highest level of integrity is what I have practiced in my B2B job. I do the same for PA.<p>My programmer partner Fabian has brilliant programming skills and I have experience in B2B marketing from my 12-year job as a store manager at T-Mobile. I came across what Marco has done at Plausible and wanted to create a solution for those who love Plausible and Fathom, but were frustrated not having Session Replays and Heatmaps.<p>Technical details: PrivateAnalytix is very light (&lt;3KB) and does not use cookies to track users. It has two modes (Lightweight and Advanced). The lightweight mode is completely GDPR, CCPA and PECR compliant (no cookie consent required). The Advances mode turns on user tracking, Session Replays and Heatmaps. Depending on what you track on your site, you can choose to either include a privacy note or not. We take the responsibility or keeping all data on our server and not share it.<p>What&#x27;s different between PA and Google Analytics&#x2F;Clarity: With both, Google Analytics and MC, the end user becomes the product. Data sharing policy in both of those solutions allow for sharing and sale of the collected analytics data.<p>How much is PrivateAnalytics: I believe in creating a sustainable and a reasonably priced product that will serve our customers for years to come. This is why our introductory price starts at $6 per month and includes analytics, session replays and heatmaps.<p>Did we stress test PA: Yes, we have launched and quickly partnered with about 100 businesses. This allowed us stress test it and put together a highly scalable product.<p>Your feedback: With so many professionals here on HN, it is nerve-wracking to introduce my tool to you and I would love to hear your feedback, ideas and experiences. Any response would be greatly appreciated!",
      "time": 1627865091,
      "title": "Show HN: PrivateAnalytix – Private Google Analytics and MS Clarity Alternative",
      "type": "story"
    },
    {
      "by": "caser",
      "descendants": 0,
      "id": 28031722,
      "score": 1,
      "time": 1627865066,
      "title": "The importance of stupidity in scientific research (2008)",
      "type": "story",
      "url": "https://journals.biologists.com/jcs/article/121/11/1771/30038/The-importance-of-stupidity-in-scientific-research"
    },
    {
      "by": "prismatic",
      "descendants": 0,
      "id": 28031698,
      "score": 1,
      "time": 1627864873,
      "title": "The Stealthy Politics of Urban Advertising",
      "type": "story",
      "url": "https://placesjournal.org/article/the-stealthy-politics-of-urban-advertising/"
    },
    {
      "by": "Khaine",
      "descendants": 0,
      "id": 28031539,
      "score": 3,
      "time": 1627863268,
      "title": "Square to acquire Afterpay in $39b deal",
      "type": "story",
      "url": "https://www.smh.com.au/business/entrepreneurship/twitter-founder-jack-dorsey-s-square-to-buy-afterpay-for-39-billion-20210802-p58eyn.html"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 28031510,
      "kids": [
        28031511
      ],
      "score": 1,
      "time": 1627862948,
      "title": "A ‘Hello World’ GitOps Example Walkthrough",
      "type": "story",
      "url": "https://zwischenzugs.com/2021/07/31/a-hello-world-gitops-example-walkthrough/"
    },
    {
      "by": "brundolf",
      "descendants": 0,
      "id": 28031507,
      "score": 1,
      "text": "Seems like more and more, progress in software translates to concentration of power and wealth. At best it allows corporations to replace humans with machines, or it makes their systems larger and more homogenous and less nuanced to the realities of individual lives. At worst, it directly enables oppression from authoritarian entities.<p>I often find myself wondering, how can I help tip the scales back the other way a little bit?<p>Some would probably chime in with &quot;free software&quot; initiatives like GPL, distributed protocols, and the like. Those sound nice on paper, but with a few exceptions I haven&#x27;t seen much evidence that they actually translate to a real liberating effect. This is partly (not completely) due to the fact that you usually have to be technically savvy to even take advantage of them.<p>What are some technology projects that would put some agency back in the hands of normal people?",
      "time": 1627862928,
      "title": "Ask HN: Software projects that empower regular people?",
      "type": "story"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28031502,
      "score": 1,
      "time": 1627862867,
      "title": "Houston, We Erased the Apollo 11 Tapes (2009)",
      "type": "story",
      "url": "https://www.npr.org/2009/07/16/106637066/houston-we-erased-the-apollo-11-tapes"
    },
    {
      "by": "motohagiography",
      "descendants": 0,
      "id": 28031499,
      "score": 1,
      "time": 1627862791,
      "title": "Operation Sundevil (1990)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Operation_Sundevil"
    },
    {
      "by": "sonograph",
      "descendants": 0,
      "id": 28031495,
      "score": 1,
      "time": 1627862766,
      "title": "Xanadu Quantum Cloud",
      "type": "story",
      "url": "https://www.xanadu.ai/"
    }
  ]
}