{
  "stories": [
    {
      "by": "arkj",
      "descendants": 0,
      "id": 29692035,
      "score": 1,
      "time": 1640523457,
      "title": "Whoever invented USB-C deserves a Nobel Prize",
      "type": "story",
      "url": "https://thenextweb.com/news/whoever-invented-usb-c-deserves-a-nobel-prize"
    },
    {
      "by": "sonabinu",
      "descendants": 0,
      "id": 29692029,
      "score": 2,
      "time": 1640523385,
      "title": "Practicing Programming",
      "type": "story",
      "url": "https://sites.google.com/site/steveyegge2/practicing-programming"
    },
    {
      "by": "edent",
      "descendants": 0,
      "id": 29692013,
      "score": 1,
      "time": 1640523060,
      "title": "Energy Efficiency of Modern Codecs",
      "type": "story",
      "url": "https://shkspr.mobi/blog/2021/12/energy-efficiency-of-modern-codecs/"
    },
    {
      "by": "staccatomeasure",
      "descendants": 0,
      "id": 29691995,
      "score": 1,
      "time": 1640522815,
      "title": "Engineering Career Ladder Archive",
      "type": "story",
      "url": "https://staysaasy.com/management/2020/04/26/Engineering-Ladder-Archive.html"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 29691988,
      "score": 1,
      "time": 1640522718,
      "title": "The Importance of Price Signals",
      "type": "story",
      "url": "https://www.lynalden.com/price-signals/"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 29691928,
      "score": 1,
      "time": 1640522094,
      "title": "The Open Technology Fund",
      "type": "story",
      "url": "https://www.opentech.fund/"
    },
    {
      "by": "wombatmobile",
      "descendants": 0,
      "id": 29691901,
      "score": 1,
      "time": 1640521835,
      "title": "Keeping a Grocery Store Lobster as a Pet",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9sI7WveN7vk"
    },
    {
      "by": "KoftaBob",
      "descendants": 0,
      "id": 29691893,
      "score": 1,
      "time": 1640521758,
      "title": "New Electric Vehicle Battery Plants Planned in the U.S. in the Next 5 Years",
      "type": "story",
      "url": "https://www.energy.gov/eere/vehicles/articles/fotw-1217-december-20-2021-thirteen-new-electric-vehicle-battery-plants-are"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 29691858,
      "score": 2,
      "text": "I just came across this shark tank pitch: https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QLUyzXhoBik<p>He is super confident and leads this pitch in every second.<p>He uses storytelling to describe the problem and the need by referring to a situation that everyone knows and can identify with.<p>- He connects on an emotional basis<p>- He entertains his audience<p>- He did a great closing with a sticky closing and a clear CTA.<p>Any other examples of great pitches?",
      "time": 1640521445,
      "title": "Ask HN: What is the best pitch you've ever seen?",
      "type": "story"
    },
    {
      "by": "philonoist",
      "descendants": 0,
      "id": 29691814,
      "score": 1,
      "text": "I will go first. We are talking &quot;speed of thought&quot; here. I tried finding the underdogs.<p>Listary - A tool that scolds you for being lazy by fingers. Search+launcher<p>FluentSearch - Highly configurable OSS version of Listary. Patched at daily rate by author<p>Win-Vind- Oh, you got a i3wm or Sway? This can do more in Win10<p>WezTerm - Terminal that throttles to Rust speed.<p>Newsit- Ever wondered what Hacker news and Reddit thought about a page you are on? Then have a pop up at a corner.<p>Powershell Gallery - saved my day with many scripts. Bash way of doing things is now breeze.<p>PANTHERBAR- One click popup to copy, translate, search, daily utilities (windows only)<p>Lightkey - Autocomplete by learning slangs as well.<p>LaunchyQT&#x2F;EverythingToolbar - The world is moving forward with forks. Default, UELI and Wox are overrrated.<p>Picotorrent - Comes with a scripting language.How cool man!<p>Swift selection search -highglight a group of words and multiple customizable search engines popup for your to click.<p>Vis&#x2F;Micro - when you talk about Neovide,Kakoune,Spacemacs(&#x2F;vim), you will be talking about them. Different ways of using them.<p>Smartup Gestures - Spoil yourself with speed.<p>Qualys Browsercheck - Maybe your browser and OS are spying and conspiring against you?<p>Vivaldi&#x2F;Naver Whale - innovative features but closed source web browsers.<p>PotPlayer - highly customizable and competitor for VLC. Likewise Foobar for WinAmp<p>Qtpass,Gopass- for windows in the lines of pass for UNIX. Different ways of using. passFF integrates pass into firefox.<p>QTtabbar - windows explorer on steroids.<p>TwoBird - Gives Thunderbird a run.<p>Peertube - Federated Youtube.<p>Privacy redirect - takes you to privacy-enabled front ends of big wigs - seddit, nitter, startpage,Pipe etc.<p>ublacklist - The search page won&#x27;t show you dubious websites like medical information, stackoverflow dupes or do-nothing pinterest links.<p>Sponserblock - skip sponser clips on Youtube.<p>Sidebery - Forget tree style tabs<p>Fsearch -GUI equivalent of what fzf does.<p>Neomutt - Neo generation of mutt<p>Translation comparision Firefox addon - userful for learning language with context.<p>tldr++ - A great man once said &quot;software should come to you, you shouldn&#x27;t go to it&quot;. Yeah,We will try that with man pages.<p>Zero Install - No files will be installed, but you can run locally.<p>BruteShark&#x2F;Brim - Wireshark&#x27;s minicon with Zeek added.<p>Adnauseam&#x2F;Windscribe firefox extension - Yeah uBO is uncontested king, so why not add obfuscation to it?<p>WSLg- Wayland support as well. What more can we ask for.<p>Mega - Cloud drive superior to GDrive<p>Conan - package manager for C and C++ with Cmake wrapping.<p>oschmod -chmod but for windows.<p>Notcurses- superset of ncurses and cross platform.<p>Combofix - I might as well pour acid on my laptop if I am not careful using Combofix. An anti-malware&#x2F;rootkit tool<p>BleachBit - We don&#x27;t need it, but I get fresh laptop.<p>Lastly, Voice finger - A special mention to this 1.5MB app because not a single program could leverage Windows Speech recognition like Voice finger except for Nuance Dragon (GBs). A feature like &quot;Show labels(or number), click G(or 22)&quot; or &quot;show grid, go to 112&quot; will make me join my 4 year undergrad in CS again if possible. An android equivalent is Google Voice access, but since laptops are operated via costly ergonomic devices, daily nagging pain, RSI and carpel tunnel Syndrome are a consequence.<p>I wish there was a chrome&#x2F;Firefox extension for - \nan overlay in corner showing github&#x2F;author sites of apps whenever mentioned on HN News. After all, this is the last remaining quality site of critique for software testing, innovation and design.",
      "time": 1640521033,
      "title": "Ask HN: Programs on your laptop that saved you hundreds of hours?(2021)",
      "type": "story"
    }
  ]
}