{
  "stories": [
    {
      "by": "GordonS",
      "descendants": 0,
      "id": 32061387,
      "score": 1,
      "time": 1657571414,
      "title": "Acoustic levitation used to build complex structures in mid-air",
      "type": "story",
      "url": "https://www.newscientist.com/article/2326299-acoustic-levitation-used-to-build-complex-structures-in-mid-air/"
    },
    {
      "by": "ourmandave",
      "descendants": 0,
      "id": 32061361,
      "score": 1,
      "time": 1657571315,
      "title": "Nobody likes self-checkout. Here’s why it’s everywhere",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/09/business/self-checkout-retail/index.html"
    },
    {
      "by": "nerder92",
      "descendants": 0,
      "id": 32061360,
      "score": 1,
      "text": "I&#x27;ve noticed that in the market we are in there is still no clear winner and that competitors, even the big ones, are very easy to steal customers to. Also it&#x27;s clear to me that most of the big players in the market are running just by VC&#x27;s money trying to blitzscale or simply bruteforce product market fit, by hiring a huge sales team and spend money in a clear unsustainable growth. Is this a sign that there is still a big space for innovation I&#x27;m the market or that the problem with the current available production costs is not worth solving? Hopefully I&#x27;ve explained clearly the dilemma I have in my head, pls give feedback.<p>Adding some context: we&#x27;ve built a gym management system app. We have few clients and a modest MRR which is growing (slowly) overtime.",
      "time": 1657571311,
      "title": "Ask HN: Market Dilemma",
      "type": "story"
    },
    {
      "by": "jordanpg",
      "descendants": 0,
      "id": 32061345,
      "score": 1,
      "time": 1657571212,
      "title": "White House Briefing to Preview Imagery from the James Webb Space Telescope",
      "type": "story",
      "url": "https://www.nasa.gov/nasalive/"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32061332,
      "score": 1,
      "time": 1657571153,
      "title": "Great Lakes, St. Lawrence Regional Bbdy and Compact Council Science Strategy [pdf]",
      "type": "story",
      "url": "https://www.glslcompactcouncil.org/media/2gyle2b2/rb-cc-science-strategy-2019.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32061316,
      "score": 2,
      "time": 1657571080,
      "title": "Influence of arctive-noise-cancelling headphones on cognitive performance (2019) [pdf]",
      "type": "story",
      "url": "https://pub.dega-akustik.de/ICA2019/data/articles/000062.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32061311,
      "score": 2,
      "time": 1657571063,
      "title": "Daddy’s girl: Daughters, managerial decisions, and gender inequality (2021) [pdf]",
      "type": "story",
      "url": "https://maddalenaronchi.weebly.com/uploads/1/1/7/4/117435661/daddysgirl_ronchi_jmp.pdf"
    },
    {
      "by": "markus_zhang",
      "descendants": 1,
      "id": 32061300,
      "kids": [
        32061346
      ],
      "score": 1,
      "text": "Let&#x27;s say I wear multiple hats in work. In some hours I have to focus on on-call and support; In some I need to develop new features; And in others I need to manage infra.<p>Each hat contains a separate &quot;workspace&quot; consisting of a set of Chrome tabs _IN TWO SCREENS_ as well as maybe a set of PyCharm&#x2F;Datagrip projects.<p>I&#x27;d like to be able to switch between each workspace without much delay. For now I group different tabs in Chrome and use different windows but it&#x27;s already a chore to find the correct window when there are 4~6. The perfect solution looks like this: I press a pre-set key, and suddenly 2 Chrome windows show up, one in left screen and one if right, also the right projects are opened in PyCharm&#x2F;Datagrip - not only that, but the windows of other &quot;workspaces&quot; immediately hide themselves.<p>I think the minimum solution is for Chrome to display the name of a group instead of the activated tab when I right click the icon. I can live with opening different PyCharm&#x2F;Datagrip projects once in a while.<p>What tools can I achieve this?",
      "time": 1657571006,
      "title": "Ask HN: macOS – is there a multiple “workspace” solution?",
      "type": "story"
    },
    {
      "by": "ivanvas",
      "descendants": 0,
      "id": 32061294,
      "score": 1,
      "time": 1657570976,
      "title": "To Niche or Not to Niche: The Great Fear Holding You Back in Programming (2018)",
      "type": "story",
      "url": "https://simpleprogrammer.com/find-your-niche/"
    },
    {
      "by": "sixhobbits",
      "descendants": 0,
      "id": 32061293,
      "score": 1,
      "time": 1657570975,
      "title": "You will always have more Problems than Engineers",
      "type": "story",
      "url": "https://matt-schellhas.medium.com/you-will-always-have-more-problems-than-engineers-aafff94a4623"
    }
  ]
}