{
  "stories": [
    {
      "by": "triyambakam",
      "descendants": 0,
      "id": 31562750,
      "score": 1,
      "text": "I have a Gmail account from high school that has never used my legal name, and even if it had, my full legal name has since changed. I haven&#x27;t created any logins with this address in many, many years.<p>Every few years I check to see if there is anything important there. Just recently I noticed some recruiter messages addressed to my new legal name.<p>How is it possible that this address became linked in any way to my identity, let alone my new name?<p>I really want to reply to the messages with incredulity, and now it makes those companies seem scummy to use such recruitment practices.",
      "time": 1653939208,
      "title": "Ask HN: How did my old Gmail account ago get linked to my identity and new name?",
      "type": "story"
    },
    {
      "by": "mritzmann",
      "descendants": 0,
      "id": 31562728,
      "score": 1,
      "time": 1653939113,
      "title": "Why Don’t the Dutch Wear Helmets?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=NpVncWxyMJw"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31562711,
      "score": 1,
      "time": 1653939027,
      "title": "The Closest We Have to a Theory of Everything",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=A0da8TEeaeE"
    },
    {
      "by": "bcaulfield",
      "descendants": 0,
      "id": 31562670,
      "score": 1,
      "time": 1653938737,
      "title": "The Man with 100,000 Brains: AI’s Big Donation to Science",
      "type": "story",
      "url": "https://blogs.nvidia.com/blog/2022/05/30/ai-brain-images-kcl/"
    },
    {
      "by": "JasonFruit",
      "descendants": 0,
      "id": 31562641,
      "score": 2,
      "time": 1653938605,
      "title": "Bluebird Ultralight Motorfloater",
      "type": "story",
      "url": "http://m-sandlin.info/Bluebird/Bluebird%20Page.html"
    },
    {
      "by": "LionTamer",
      "descendants": 0,
      "id": 31562606,
      "score": 4,
      "time": 1653938391,
      "title": "Duke Medical prof. calls mandatory equity training “Maoist political propaganda”",
      "type": "story",
      "url": "https://www.dukechronicle.com/article/2022/05/duke-university-school-of-medicine-professor-describes-mandatory-equity-training-as-maoist-political-propaganda-refuses-to-attend"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 31562589,
      "score": 1,
      "time": 1653938302,
      "title": "The Radiating Circles of DX Architecture",
      "type": "story",
      "url": "https://dx.tips/circles"
    },
    {
      "by": "tectonic",
      "descendants": 0,
      "id": 31562578,
      "score": 2,
      "time": 1653938246,
      "title": "A philosophers case against death",
      "type": "story",
      "url": "https://thereader.mitpress.mit.edu/a-philosophers-case-against-death/"
    },
    {
      "by": "ruckfool",
      "descendants": 0,
      "id": 31562563,
      "score": 1,
      "time": 1653938144,
      "title": "Sidhu Moosewala Shot Dead",
      "type": "story",
      "url": "https://www.bbc.com/news/world-asia-india-61629133"
    },
    {
      "by": "aumakua",
      "descendants": 0,
      "id": 31562561,
      "score": 2,
      "text": "I know this is an oft-raised subject on HN but I find that none of the tools I&#x27;ve come across thus far have solved any of my problems. As someone with poor impulse control and decent digital literacy, I find that I ignore any tracker app that tells me I&#x27;m on my computer too often, and I will circumvent any blocker I set up to disallow me from accessing media that I had earlier decided I should consume less of.<p>I&#x27;m wondering if anyone knows of a tool that exists that will force my devices to shut off at a certain time and cannot be disabled with a few shell commands. I know this is a bit absurd but this is the reality of my situation (working from home, sleeping at 3-4AM for no particular reason) and I can&#x27;t think of any effective solution that doesn&#x27;t gimp my actual work routine in the day.<p>I also have an issue with constant alt-tabbing and ctrl-tabbing when I&#x27;m on the internet, even when I&#x27;m literally in the process of reading an article or watching a video (both in recreational and educational scenarios). Curious as to how many others do this as well, and if there&#x27;s some sort of tool that someone has written to disallow this kind of behavior (perhaps adding some sort of &quot;cooldown&quot; to an alt-tab or shift-tab).<p>Sorry for raising this topic once again but any suggestions would be greatly appreciated!",
      "time": 1653938121,
      "title": "Ask HN: Tools for mitigating digital addiction, any suggestions?",
      "type": "story"
    }
  ]
}