{
  "stories": [
    {
      "by": "harambae",
      "descendants": 0,
      "id": 30676065,
      "score": 1,
      "time": 1647282278,
      "title": "The Inflation Hits Just Keep Coming, Raising Stakes for the Fed",
      "type": "story",
      "url": "https://www.wsj.com/articles/ukraine-war-oil-gas-prices-inflation-federal-reserve-11647268257"
    },
    {
      "by": "ramoswriter",
      "descendants": 0,
      "id": 30675996,
      "score": 1,
      "time": 1647281993,
      "title": "The Case for Open Salaries",
      "type": "story",
      "url": "https://www.ramoswriter.com/open-salaries/"
    },
    {
      "by": "crackercrews",
      "descendants": 1,
      "id": 30675994,
      "kids": [
        30676036
      ],
      "score": 1,
      "time": 1647281990,
      "title": "San Francisco’s Mathematics Detracking Experiment",
      "type": "story",
      "url": "https://tomloveless.com/posts/san-franciscos-detracking-experiment/"
    },
    {
      "by": "synergy20",
      "descendants": 0,
      "id": 30675964,
      "score": 1,
      "time": 1647281888,
      "title": "Learning Standard C++ as a New Language [pdf]",
      "type": "story",
      "url": "https://www.stroustrup.com/new_learning.pdf"
    },
    {
      "by": "samstave",
      "descendants": 0,
      "id": 30675925,
      "score": 1,
      "text": "I have beenlooking into gas pricing (gasoline for cars)<p>Specifically in California.<p>I would like some help on how to eval, as this isn&#x27;t my area - but I am trying to learn.<p>I began with putting this together, and I would like contributors:<p>---<p>[0] https:&#x2F;&#x2F;docs.google.com&#x2F;spreadsheets&#x2F;d&#x2F;1YRHFbplboIIxinR3q-NYp1Lv9VEqryL2MCv60OOujuQ&#x2F;edit?usp=sharing<p>---<p>The premise is:<p>If you look at the current gas prices, with both state and federal taxes (for said programs of road quality and such) - and compare it with the fed&#x2F;state income taxes that come off gross income, coupled with sales taxes, property taxes, and then the reverse tax of subsidies to companies who receive them, as compared to the proofit margins said companies are getting, what is the TRUE buying power of a single dollar at the gas pump, vs how much &quot;free&quot; money is grifted frm &quot;taxes&quot; and laws that claim subsidies?<p>---<p>The premise is that through opaque tax&#x2F;financial support mechanisms, the buying power of the American dollar is artificially, but purposefully suppressed, in a way which compresses the lower&#x2F;middle classes based on the top being immune to inflation through manipulation of markets and specifically commodities, utilities and essentials.<p>I would request help on delving into this from people more capable with taxes&#x2F;maths than I am.<p>I think that 100% transparency in energy markets is the only hope we have to true discernment of whats going on in energy markets. Specifically from a bottoms-up approach to the problem.<p>What is the citizen EARNING, vs TAXED vs AFFORDABLE with REMAINDER of actual NET income.<p>I believe the number to be as low as 15%.<p>Anyone want to help prove this?<p>---<p>Some notes:<p>1 dollar is taxed on avg of ~35% in my experience, then I pay a sales tax of 9% on ever 65% of the dollars I take home, then there are mandated other services which are unregulated in price but regulated in the fact that I must pay them. Plus property taxes etc..<p>What I am looking to accomplish is that we truly know the value of the dollar WRT yur actual personal buying power, savings power and ability to plan.<p>If, for example we look at every transaction that is made by a dollar... how much in principle interest toward the actual thing we were buying was purchased, vs the actual amount on tax that was paid in order for that dollar to wind up paying for said desired thing?<p>That dollar you spend on thing went through a lot of tax layers before it ended up in wallet, but now as it exits wallet for thing desired, its subject to a new bevvy of taxes -- especially if it is something that is taxes at multiple stages upon purchase.<p>---<p>Just looking at simply taxing gas at the pump shows CRAZY tax loopholes to suppress the actual value of the dollar -- and not to mention inflation.",
      "time": 1647281739,
      "title": "Ask HN: May we please talk gas tax and subsidies? Napkin math help, please",
      "type": "story"
    },
    {
      "by": "gnicholas",
      "descendants": 0,
      "id": 30675919,
      "score": 1,
      "time": 1647281714,
      "title": "Researchers Could Lure Murder Hornets to Their Deaths with Sex",
      "type": "story",
      "url": "https://gizmodo.com/researchers-could-lure-murder-hornets-to-their-deaths-w-1848642113"
    },
    {
      "by": "DemiGuru",
      "descendants": 2,
      "id": 30675908,
      "kids": [
        30675934,
        30676049
      ],
      "score": 8,
      "time": 1647281655,
      "title": "Microsoft is testing ads in the Windows 11 File Explorer",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-testing-ads-in-the-windows-11-file-explorer/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30675907,
      "score": 1,
      "time": 1647281654,
      "title": "Upcoming Documentary Kart Kids Der Film Tracks Germany's Future Racers (2016)",
      "type": "story",
      "url": "https://www.theverge.com/2016/6/4/11859004/kart-kids-der-film-go-karting-documentary"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30675902,
      "score": 1,
      "time": 1647281643,
      "title": "Trevor Noah’s feud with France over race, identity, and Africa, explained (2018)",
      "type": "story",
      "url": "https://www.vox.com/policy-and-politics/2018/7/19/17590302/trevor-noah-france-french-ambassador-araud-world-cup"
    },
    {
      "by": "isaacaggrey",
      "descendants": 0,
      "id": 30675882,
      "score": 2,
      "time": 1647281539,
      "title": "U.S. drivers should think in gallons per mile: report (2008)",
      "type": "story",
      "url": "https://www.reuters.com/article/us-fuel-efficiency-idUSN1925607520080619"
    }
  ]
}