{
  "stories": [
    {
      "by": "sriteja",
      "descendants": 0,
      "id": 27855306,
      "score": 1,
      "text": "Hello HN, we’re Aditya &amp; Sri Teja, founders of Swipe(https:&#x2F;&#x2F;getswipe.in). Swipe makes it easy for local businesses in India to invoice their customers over WhatsApp. Instead of giving a paper invoice to a customer, Swipe users send a WhatsApp message with a link that allows the customer to pay instantly with a variety of payment methods.<p>Before we built Swipe, we used to manually make invoices on spreadsheets and store them locally on our computers. Initially, it was working fine but as we got more sales it started to get difficult for us to manage. On top of that, we need to file monthly tax returns where we would manually consolidate all our sales for the month on spreadsheets and send them to our accountant for filing. The whole process is tedious and the existing software available to do it is riddled with accounting jargon and primarily targeted towards professional accountants.<p>We quickly realized that these efforts in any way are not helping the company grow and this time and energy can be better spent on talking to our customers, focusing on our product and business. Interestingly, we also found out that most of the ~75M SMEs in India still rely on manual processes in tracking sales, purchasing inventory, cash management, tax filings, payments, which is highly inaccurate and inefficient and a huge opportunity for us to make an impact.<p>That&#x27;s why we built Swipe to make it easy for all the innovators and business owners out there to focus on your innovation and products and leave the rest to Swipe. Using Swipe business owners can create invoices, purchase orders and quotations in a few seconds without any accounting knowledge and based on their sales, purchases and expenses we automatically update inventory, payables &amp; receivables. They can share these bills with customers on WhatsApp or Email along with payment options to collect payments instantly. We also generate reports for instant tax filing every month.<p>We make money through annual SaaS fees of $15 and via commissions on the transactions made through the payment gateway. \nThanks for reading. Happy to answer any questions and hear your feedback in the comments! You can also reach us at aditya@getswipe.in<p>Best Regards Aditya, Sri Teja.",
      "time": 1626436241,
      "title": "Swipe (YC S21) – Simple Billing and Accounting App for SMEs in India",
      "type": "story"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 27855264,
      "score": 1,
      "time": 1626435802,
      "title": "How JavaScript Works: the evolution of graphics",
      "type": "story",
      "url": "https://blog.sessionstack.com/how-javascript-works-the-evolution-of-graphics-500e0eb764a0"
    },
    {
      "by": "williamsharris",
      "descendants": 0,
      "id": 27855257,
      "score": 1,
      "time": 1626435648,
      "title": "Shell and Scottish Power submit plans for floating offshore windfarms",
      "type": "story",
      "url": "https://www.theguardian.com/business/2021/jul/16/shell-scottish-power-floating-offshore-windfarms-energy-scotland"
    },
    {
      "by": "danso",
      "descendants": 0,
      "id": 27855254,
      "score": 1,
      "time": 1626435617,
      "title": "Full Throttle",
      "type": "story",
      "url": "https://www.filfre.net/2021/07/full-throttle/"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 27855249,
      "score": 2,
      "time": 1626435563,
      "title": "Contact the ISS",
      "type": "story",
      "url": "https://www.ariss.org/contact-the-iss.html"
    },
    {
      "by": "amozoss",
      "descendants": 0,
      "id": 27855242,
      "score": 1,
      "time": 1626435521,
      "title": "Servers are like babies – tips for being on call",
      "type": "story",
      "url": "https://tellspin.app/blog/servers-are-like-babies-tips-for-being-on-call/"
    },
    {
      "by": "zaiste",
      "descendants": 0,
      "id": 27855241,
      "score": 1,
      "time": 1626435520,
      "title": "In Chiapas the poorest Mexico state, people drink on avg 2L of Coca-Cola per day",
      "type": "story",
      "url": "https://mexiconewsdaily.com/news/with-average-daily-consumption-of-2-2-liters-of-coca-cola-chiapas-leads-the-world/"
    },
    {
      "by": "ekin",
      "descendants": 0,
      "id": 27855231,
      "score": 2,
      "time": 1626435433,
      "title": "Asking for Help - Why we suck at getting help and how to ask for it elegantly",
      "type": "story",
      "url": "https://ekin.substack.com/p/asking-for-help"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27855229,
      "score": 1,
      "time": 1626435409,
      "title": "3D-printed steel bridge loaded with sensors opens for pedestrians in Amsterdam",
      "type": "story",
      "url": "https://eandt.theiet.org/content/articles/2021/07/3d-printed-steel-bridge-loaded-with-sensors-opens-for-pedestrians-in-amsterdam/"
    },
    {
      "by": "lproven",
      "descendants": 0,
      "id": 27855184,
      "score": 1,
      "time": 1626435115,
      "title": "Halting problem: Dev vs. Ops – the Linux app distribution problem",
      "type": "story",
      "url": "https://www.bassi.io/articles/2017/08/10/dev-v-ops/"
    }
  ]
}