{
  "stories": [
    {
      "by": "__warlord__",
      "descendants": 0,
      "id": 31650535,
      "score": 1,
      "text": "That M2 Macbook Air looks spicy but I&#x27;m wondering if people have had any issues with the fanless M1 version as a developer?<p>I work on infrastructure and development work with my M1 Macbook Pro (python, go, terraform, ansible) and use the usual electron apps (slack, teams, vscode). So far, I haven&#x27;t had any issues with performance, nor I have never heard the fans kick in.<p>Also, I only need one external monitor.",
      "time": 1654583281,
      "title": "Ask HN: For devs, any regrets on getting the M1 MacBook Air?",
      "type": "story"
    },
    {
      "by": "rukshn",
      "descendants": 0,
      "id": 31650534,
      "score": 1,
      "time": 1654583276,
      "title": "Why do JavaScript frameworks get increasingly complex over time?",
      "type": "story",
      "url": "https://ruky.me/2022/06/07/why-do-javascript-frameworks-get-increasingly-difficult-over-time/"
    },
    {
      "by": "nemoniac",
      "descendants": 0,
      "id": 31650533,
      "score": 1,
      "time": 1654583267,
      "title": "Company halts plans for Taser drone after 9 members of its ethics board resign",
      "type": "story",
      "url": "https://www.pbs.org/newshour/economy/company-halts-plans-for-taser-drone-after-9-members-of-its-ethics-board-resign"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31650520,
      "score": 1,
      "time": 1654583134,
      "title": "Behind Big Tech's big privacy heist: Deliberate obfuscation",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/06/big_techs_big_privacy_heist/"
    },
    {
      "by": "kome",
      "descendants": 0,
      "id": 31650505,
      "score": 1,
      "time": 1654583013,
      "title": "Jo Engine is an open source 2D and 3D game engine for the Sega Saturn",
      "type": "story",
      "url": "https://jo-engine.org/home/"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31650472,
      "score": 1,
      "time": 1654582634,
      "title": "Being sued, in East Texas, for using the Google Play Store (2016) [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=eatfgXTMFf0"
    },
    {
      "by": "geekard",
      "descendants": 1,
      "id": 31650461,
      "kids": [
        31650462
      ],
      "score": 1,
      "time": 1654582498,
      "title": "Lsp-bridge: Fastest LSP client for Emacs",
      "type": "story",
      "url": "https://github.com/manateelazycat/lsp-bridge"
    },
    {
      "by": "newsoul",
      "descendants": 0,
      "id": 31650459,
      "score": 2,
      "text": "Calculus was developed by Newton and Leibniz as a way to tackle problems in physics. Later Real analysis was developed which gave a strong and mathematically rigorous foundation to the theory of Calculus. During its infancy Calculus was all about the &quot;how&quot;; after real analysis the &quot;why&quot; was added.<p>I believe learning only one side of the subject doesn&#x27;t open up the entire capacity of the subject to your mind. You need to learn both the how and the why.<p>Mathematicians often fight over pure vs applied. Due to that books are also written like that. The how books are aimed at &quot;engineers&quot; and the &quot;why&quot; books are abstract and seldom contain the &quot;hows&quot;.<p>Example: Strang&#x27;s Linear Algebra is all about &quot;how&quot;. Axler&#x27;s Linear Algebra Done Right is all about the abstract treatment of the subject.<p>I only talked about math books above. I am not much aware about how CS books fair in this aspect.<p>I want to know about books in both CS and Mathematics that teach both the how and the why of the subject. It shows how to practice the material in reality and why the material is true by showing a rigorous theory behind it, if there is a theory. Otherwise it says that this is yet to be proven.<p>If you know no such comprehensive book on a topic, you may suggest some online course (if that is available) or a set of books that seperately teach the how and why and complement each other very well.",
      "time": 1654582490,
      "title": "Ask HN: Math and CS books that teach both the how and the why of the subject?",
      "type": "story"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 31650452,
      "score": 1,
      "time": 1654582439,
      "title": "Python Is the Ultimate Matlab Toolbox",
      "type": "story",
      "url": "https://al.danial.org/posts/python_is_the_ultimate_matlab_toolbox/"
    },
    {
      "by": "ishanr",
      "descendants": 0,
      "id": 31650448,
      "score": 2,
      "time": 1654582366,
      "title": "Show HN: Notik – A new way of managing projects",
      "type": "story",
      "url": "https://notik.app/"
    }
  ]
}