{
  "stories": [
    {
      "by": "craftsquick",
      "descendants": 0,
      "id": 31263811,
      "score": 1,
      "text": "Hey everyone!<p>I&#x27;m a long-time reader, first-time poster. I built a tool to help you easily write SQL by building queries visually.<p>I did this because (a) I used to write a lot of SQL in an old job and (b) my girlfriend now needs to write SQL for her job and she&#x27;s very new to it. So if you write a lot of SQL for work (or help people that need to write their own SQL), check it out! I built this over a weekend, so there are some rough edges, but you can try it out without needing to sign up or integrate with any databases. There&#x27;s also a 3 minute demo on the home screen.<p>Link: <a href=\"https:&#x2F;&#x2F;craftsql.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;craftsql.com&#x2F;</a><p>Does this generate the most performance optimized queries? The built queries target correctness, not performance. In practice, when I compared generated queries to the ones I wrote by hand, the query planner yields the same plan anyway.<p>Is this a data security risk? No, it never integrates with your actual database, so your data is never exposed. All you need to do is tell it what your tables&#x27; names and columns are, and those are only stored in your browsers local storage.<p>Would love all your thoughts!",
      "time": 1651687455,
      "title": "Show HN: CraftSQL helps you write SQL easily",
      "type": "story",
      "url": "https://craftsql.com/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31263808,
      "score": 1,
      "time": 1651687431,
      "title": "Y Combinator’s (Virtual) Summer Career Expo – June 8th",
      "type": "story",
      "url": "https://www.ycombinator.com/blog/yc-tech-expo-s22/"
    },
    {
      "by": "manjana",
      "descendants": 0,
      "id": 31263804,
      "score": 1,
      "time": 1651687413,
      "title": "When Booleans Are Not Enough State Machines? [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=I1Mzx_tSpew"
    },
    {
      "by": "mydevlprplanet",
      "descendants": 0,
      "id": 31263792,
      "score": 1,
      "time": 1651687343,
      "title": "How to Setup an Ansible Test Environment",
      "type": "story",
      "url": "https://mydeveloperplanet.com/2022/05/04/how-to-setup-an-ansible-test-environment/"
    },
    {
      "by": "jluan",
      "descendants": 0,
      "id": 31263777,
      "score": 1,
      "time": 1651687261,
      "title": "First result from Adept: giant NNs that can query DBs, make plots, and use APIs",
      "type": "story",
      "url": "https://twitter.com/gstsdn/status/1521874089647886336"
    },
    {
      "by": "behnamoh",
      "descendants": 0,
      "id": 31263765,
      "score": 2,
      "time": 1651687186,
      "title": "Troubles of Using Mac with External Monitors",
      "type": "story",
      "url": "https://forums.macrumors.com/threads/scale-1680x1050-on-rmb-without-an-app.1873910/page-17"
    },
    {
      "by": "shepherdjerred",
      "descendants": 0,
      "id": 31263764,
      "score": 2,
      "time": 1651687172,
      "title": "How Electricity Works [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=oI_X2cMHNe0"
    },
    {
      "by": "shepherdjerred",
      "descendants": 0,
      "id": 31263759,
      "score": 1,
      "time": 1651687142,
      "title": "VimGolf – Real Vim ninjas count every keystroke",
      "type": "story",
      "url": "https://www.vimgolf.com/"
    },
    {
      "by": "krinchan",
      "descendants": 0,
      "id": 31263752,
      "score": 1,
      "text": "Received the following email today. My employer utilizes UserIQ in some of our websites and no one I&#x27;ve spoken to had any idea this was coming. That said, checking their website they haven&#x27;t had a release since November 2019 and their blog is offline.  Their website makes no mention of the shutdown.<p>https:&#x2F;&#x2F;www.useriq.com&#x2F;<p><pre><code>    From: user iq &lt;useriq@useriq.com&gt;\n    Date: Wednesday, May 4, 2022 at 10:18 AM\n    To: \n    Subject: UserIQ Shutdown Notice\n\n    Please see attached notice from UserIQ.\n\n    We regret to inform you that UserIQ (the &quot;Company&quot;) is discontinuing\n    its operations and closing its business. There are no employees or\n    agents of the Company remaining to deal with any Company business or\n    creditors. The Company has fully shut down and will be unable to\n    further address any matters with you. The Company&#x27;s application will\n    continue to be available to customers for a short amount of time. All\n    customer data will be deleted on May 10th. We recommend you remove the\n    UserIQ tracking code from your website as soon as possible.</code></pre>",
      "time": 1651687105,
      "title": "UserIQ is Shutting Down May 10th",
      "type": "story"
    },
    {
      "by": "hahnchen",
      "descendants": 1,
      "id": 31263746,
      "kids": [
        31263767
      ],
      "score": 1,
      "text": "I’m about to graduate and it seemed obvious to aim for google or one of the other faangs until my classmate asked me, do any of them really innovate anymore?<p>I want to work somewhere where they are doing something new and exciting. Which companies do you think still embody this?<p>Some that come to mind are SpaceX, Tesla, Waymo, Meta and Microsoft are trying hard, maybe Intel",
      "time": 1651687088,
      "title": "Ask HN: Does FAANG innovate anymore? If not, where to go?",
      "type": "story"
    }
  ]
}