{
  "stories": [
    {
      "by": "kotojo",
      "descendants": 0,
      "id": 27985652,
      "score": 1,
      "text": "My company is about to wrap up our mid year review&#x2F;promotion cycle, and I put in for promotion to senior engineer. I feel I&#x27;ve been doing good work with a big impact for the company and our customers, so believe there is a good chance I&#x27;ve gotten this promotion. So far in my career these types of promotions have been straight forward. I went from junior to mid, and then through various companies intermediate number schemes for their levels. The main thing though, is the work has pretty much been consistently the same, but just slightly larger each time. I believe this is really the last time in my career a promotion will be as straight forward as &quot;Here&#x27;s more money, and just slightly larger scope of issues we trust you with&quot;.<p>Now I&#x27;ve been thinking what comes after that? In the mainstream there seems to be two main paths. Either go towards the management track, or go towards the architect&#x2F;staff engineer track. Both of them are drastically different jobs from one another with multitudes of pros&#x2F;cons. A third, and less traveled option, seems to be to attempt to strike out on your own. The only one I can still have an idea from my current situation of what it would be like though is the architect track. It grows into managing larger, higher risk projects, but still is deeply technical in nature. The other two are so far off from what I actively do though it seems impossible to know that&#x27;s what I wanted without jumping in and asking questions later.<p>That&#x27;s the short summary of where my current crossroads are and advice on that would be great, but I think it would also be enlightening to hear how people handle their career goals in a more holistic sense. Do you have 10 year plans? 6 month plans? No plans? How do you tackle unknowns like above?",
      "time": 1627489439,
      "title": "Ask HN: How do you figure out your career goals?",
      "type": "story"
    },
    {
      "by": "aw1621107",
      "descendants": 0,
      "id": 27985618,
      "score": 1,
      "time": 1627489258,
      "title": "The poisoned NUL byte, 2014 edition",
      "type": "story",
      "url": "https://googleprojectzero.blogspot.com/2014/08/the-poisoned-nul-byte-2014-edition.html"
    },
    {
      "by": "yazhealth",
      "descendants": 1,
      "id": 27985615,
      "kids": [
        27985616
      ],
      "score": 1,
      "time": 1627489241,
      "title": "The parvo we must take care of our dogs from it",
      "type": "story",
      "url": "https://yazhealth.blogspot.com/2021/07/parvo_021063997.html"
    },
    {
      "by": "ZeljkoS",
      "descendants": 0,
      "id": 27985604,
      "score": 1,
      "time": 1627489182,
      "title": "Weird psychology: Social science researchers rely too much on Western students",
      "type": "story",
      "url": "https://slate.com/technology/2013/05/weird-psychology-social-science-researchers-rely-too-much-on-western-college-students.html"
    },
    {
      "by": "ag8",
      "descendants": 0,
      "id": 27985594,
      "score": 2,
      "time": 1627489099,
      "title": "Triton: Open-Source GPU Programming for Neural Networks",
      "type": "story",
      "url": "https://www.openai.com/blog/triton/"
    },
    {
      "by": "bri3d",
      "descendants": 0,
      "id": 27985589,
      "score": 1,
      "time": 1627489077,
      "title": "Exploit Chains in the Simos18 Engine Control Unit",
      "type": "story",
      "url": "https://github.com/bri3d/VW_Flash/blob/master/docs/docs.md"
    },
    {
      "by": "project_coding",
      "descendants": 0,
      "id": 27985573,
      "score": 3,
      "time": 1627489008,
      "title": "Top Python Developer Skill You Need to Know",
      "type": "story",
      "url": "https://www.codelivly.com/top-python-developer-skills-you-need-to-know/"
    },
    {
      "by": "doctorappliance",
      "descendants": 1,
      "id": 27985564,
      "kids": [
        27985565
      ],
      "score": 1,
      "time": 1627488958,
      "title": "Hire a Professional Team to Repair Your Home Appliances",
      "type": "story",
      "url": "https://doctorapplianceca.wordpress.com/"
    },
    {
      "by": "_andychung",
      "descendants": 1,
      "id": 27985561,
      "kids": [
        27985567
      ],
      "score": 3,
      "time": 1627488943,
      "title": "Show HN: We kept making an alternative platform for professional profiles",
      "type": "story",
      "url": "https://read.cv/cv/B3N1GcOjWapaIZy8pNkV"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27985545,
      "score": 2,
      "time": 1627488883,
      "title": "Severe Increase in Coronavirus Cases in Israeli Hospitals",
      "type": "story",
      "url": "https://www.jpost.com/breaking-news/compulsory-pcr-tests-for-all-hospitalized-patients-in-israel-675114"
    }
  ]
}