{
  "stories": [
    null,
    {
      "by": "gregoriol",
      "descendants": 0,
      "id": 29080757,
      "score": 1,
      "text": "Hi,<p>We are a SaaS business having customers all over the world and some of them in India. Recently, with the new Reserve Bank of India&#x27;s (RBI) regulations on online payments, which we use for recurring subscriptions on our SaaS products, we have lost all of our Indian customers. While it&#x27;s a &quot;small&quot; part of our revenue, it feels really weird and sad as we can&#x27;t do much to help them back: currently, Stripe doesn&#x27;t provide any update on their off-session (ie. automatic recurring) payments APIs and don&#x27;t even provide a clear plan so far as to when we could get it back (we are in contact with the support, which told us to wait for it).<p>We had dealt with the Strong Customer Authentication (SCA) regulation in Europe last year and it didn&#x27;t have such a big impact.<p>Have any of you dealt with that? Did you forced Indian users to manual payments each month?<p>I imagine it should be quite a hell for Indian users right now, not being able to use many SaaS products.<p>Have any of you, as a business providing service to Indian users, or as an Indian user, been impacted by this too?",
      "time": 1635859178,
      "title": "Ask HN: Have you been impacted by the new RBI regulations on online payments?",
      "type": "story"
    },
    {
      "by": "ochronus",
      "descendants": 0,
      "id": 29080700,
      "score": 1,
      "time": 1635858974,
      "title": "Key Ways We Fail as Engineering Managers",
      "type": "story",
      "url": "https://leadership.garden/engineering-manager-4-ways-of-failure/"
    },
    {
      "by": "workinman",
      "descendants": 0,
      "id": 29080690,
      "score": 2,
      "text": "I&#x27;m early in my software career(24y&#x2F;o) still and have a good amount of free time. I&#x27;m unsure where to start with bettering my career. I know the basics of programming(data structures) transfer to almost any job. So I&#x27;ll likely continue with that in Leetcode. But what else should I be doing? Focus on getting better at technologies I already know? Learning&#x2F;exploring new skills? Focus on current job skills and hope they transfer to the next job? I know there isn&#x27;t a definitive answer but wondering what some of you found success in early in your career. Thanks",
      "time": 1635858924,
      "title": "Ask HN: What to Learn?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29080641,
      "score": 1,
      "time": 1635858700,
      "title": "Lima: Linux virtual machines (on macOS, in most cases)",
      "type": "story",
      "url": "https://github.com/lima-vm/lima"
    },
    {
      "by": "based2",
      "descendants": 0,
      "id": 29080638,
      "score": 1,
      "time": 1635858682,
      "title": "CVE-2021-20706 NEC EXPRESSCLUSTER X RCE",
      "type": "story",
      "url": "https://blog.exodusintel.com/2021/10/31/nec-expresscluster-x-web-manager-command-execution/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29080632,
      "score": 1,
      "time": 1635858666,
      "title": "Dell spins off $64bn VMware as it battles debt hangover",
      "type": "story",
      "url": "https://www.ft.com/content/3ca808da-d0a7-4f42-98c4-b49745289616"
    },
    {
      "by": "decrypt",
      "descendants": 0,
      "id": 29080618,
      "score": 1,
      "time": 1635858489,
      "title": "Apple’s app tracking policy reportedly cost social media platforms nearly $10B",
      "type": "story",
      "url": "https://www.theverge.com/2021/10/31/22756135/apple-app-tracking-transparency-policy-snapchat-facebook-twitter-youtube-lose-10-billion"
    },
    {
      "by": "jasbirb",
      "descendants": 0,
      "id": 29080595,
      "score": 1,
      "text": "This Position can be based in either our NYC or Norwalk, CT office.\nThis role is also eligible for our hybrid work model: 2 days in-office &amp; 3 days remote.<p>https:&#x2F;&#x2F;careers.priceline.com&#x2F;jobs&#x2F;r2931<p>Why this job’s a big deal:\nBuild the next exciting new product or feature that will ultimately help millions of people experience the world.<p>Our team of engineers, at all levels, work with the business leaders in defining the product roadmap and come up with innovative solutions to grow the future of travel. We design and develop our back end systems and REST APIs that serve hundreds of millions of searches a day, collecting and parsing data across thousands of partners to get the best deals for our customers.<p>In this role you will get to:\n• Drive mission critical projects with direct impact on the evolution of Priceline&#x27;s business.\n• Innovate with a cross-functional agile team that continuously experiments, iterates and delivers on new product objectives.\n• Showcase fluency and development skills of Core Java or similar programming languages.\n• Apply your programming skills towards building low latency and high throughput transactional services with continuous integration and automation testing.\n• Implement SQL composition skills that collects and queries data for investigation and analysis in real time from our applications.\n• Influence and communicate team development efforts. Influence what the best solutions are and communicate your findings to key business stakeholders.<p>Who you are: \n• Bachelor’s degree or higher in Computer Science or related field\n• 7+ years of experience in software engineering and development\n• Exceptional coding experience with Core Java \n• An interest in being a mentor and influencing best practices with less experienced developers.\n• Confident with the utilization of Spring Frameworks,  Web Services and APIs\n• Established and proven expertise with server side Javascript\n• An Influencer of the use of Git and Gitflow\n• Experience with developing on Cloud, especially GCP and AWS\n• Experience in Microservices, Kubernetes (GKE preferable), and Dockers\n• Proven ability in Design and Architecture of complex, highly scalable and performance driven applications<p>Who We Are:<p>WE ARE PRICELINE.\nOur success as one of the biggest players in online travel is all thanks to our incredible, dedicated team of talented employees. Priceliners are focused on being the best travel deal makers in the world, fueled by our passion to help everyone experience the moments that matter most in their lives. Whether it’s a dream vacation, your cousin’s graduation, or your best friend’s wedding – we make travel affordable and accessible to our customers.<p>Priceline is part of the Booking Holdings, Inc. (Nasdaq: BKNG) family of companies, a highly profitable global online travel company with a market capitalization of over $80 billion. Our sister companies include Booking.com, BookingGo, Agoda, Kayak and OpenTable.<p>If you want to be part of something truly special, check us out!<p>Diversity, Equity and Inclusion – Our Commitment<p>Priceline ensures equal employment opportunity to all employees and applicants without discrimination or harassment based on race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions, or any other classification protected by governing law.",
      "time": 1635858329,
      "title": "Senior Java Engineer (Fulltime) @ Priceline.com",
      "type": "story"
    },
    {
      "by": "chennaiapp",
      "descendants": 0,
      "id": 29080589,
      "score": 1,
      "time": 1635858287,
      "title": "Marketing Video Maker App",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=marketing.video.maker.rey&amp;hl=en_US&amp;gl=US"
    }
  ]
}