{
  "stories": [
    {
      "by": "marc__1",
      "descendants": 0,
      "id": 30661596,
      "score": 1,
      "time": 1647182377,
      "title": "Store Data on DNA Microchips",
      "type": "story",
      "url": "https://rh.gatech.edu/news/653264/data-dna-0"
    },
    {
      "by": "shswkna",
      "descendants": 0,
      "id": 30661594,
      "score": 1,
      "time": 1647182368,
      "title": "We Need to Finally Break Free of the Engineering Mindset (2020)",
      "type": "story",
      "url": "https://digitaltonto.com/2020/we-need-to-finally-break-free-of-the-engineering-mindset/"
    },
    {
      "by": "phwd",
      "descendants": 0,
      "id": 30661585,
      "score": 1,
      "time": 1647182337,
      "title": "HackerOne takes $25,000 from Belarusian hacker in response to sanctions",
      "type": "story",
      "url": "https://twitter.com/xnwup/status/1502789820149608452"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 30661580,
      "score": 1,
      "time": 1647182323,
      "title": "Ants Can 'Sniff Out' Cancer, Scientists Discover",
      "type": "story",
      "url": "https://www.cnet.com/science/biology/ants-can-sniff-out-cancer-scientists-discover/"
    },
    {
      "by": "kkopanidis",
      "descendants": 0,
      "id": 30661577,
      "score": 2,
      "text": "Hello everyone! I want to introduce you to the project I&#x27;ve been working on for some time!<p>It&#x27;s called Conduit and it&#x27;s a new platform to build your next application on. I&#x27;ve been working with similar solutions since 2014, beginning with Parse (even after it was made open-source), moving to firebase and then mostly sticking to custom backends. On 2017 I founded a Software Development agency and quickly realised that if we were to improve quality and increase speeds we need a platform to help us do that.<p>Parse was kind of outdated for us at that point, and Firebase hasn&#x27;t (even after so many years) caught up to the flexibility the former provided. You can do MVPs yes, but you end up moving logic to the front-end or use the serverless functions that have many limitations and slow cold-start times. So for me and my dev team, it wasn&#x27;t a solution for anything further than authentication management and push notifications.<p>So, back in 2020 I begun working on Conduit, with 3 targets: Provide common functionality out of the box, do not limit devs and lastly it should work in the same philosophy a custom backend would. This meant effectively no runtime overheads (or at the very least only minor ones), a flexible API, micro-service based architecture with each service housing a particular set of features (ex. Authentication, Database, Email etc) and of course it uses gRPC for service-to-service communications so devs can create new modules from whatever language and&#x2F;or framework they want!<p>Fast-forward in 2022, we&#x27;ve already used in 5 production projects for clients. Our front-end teams love it, our backend teams have more free time than ever to work in more complex problems, and bugs in production have been reduced drastically. It even withstood a user surge in one project were we had more than 10.000 req&#x2F;min (we spun up more instances to account for the load).<p>I&#x27;d love to answer any and all questions you have about it! And I hope you like it enough to give us a star in GitHub :D<p>Links:\nwebsite: https:&#x2F;&#x2F;getconduit.dev&#x2F; GitHub: https:&#x2F;&#x2F;github.com&#x2F;ConduitPlatform&#x2F;Conduit",
      "time": 1647182293,
      "title": "Show HN: A Self-Hosted back end solution in Node.js",
      "type": "story"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30661531,
      "score": 1,
      "time": 1647182054,
      "title": "Russian Internet Users are learning how to beat Putin's Internet Crackdown",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_4b9845a414470e203399b50e3b48c74d"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30661524,
      "score": 1,
      "time": 1647181993,
      "title": "Why Starship is the holy grail for SpaceX",
      "type": "story",
      "url": "https://www.cnbc.com/2022/03/13/why-starship-is-the-holy-grail-for-spacex.html"
    },
    {
      "by": "room505",
      "descendants": 0,
      "id": 30661521,
      "score": 1,
      "time": 1647181966,
      "title": "Mechanisms for Criminal Prosecution of Russia’s Aggression Against Ukraine",
      "type": "story",
      "url": "https://www.justsecurity.org/80626/mechanisms-for-criminal-prosecution-of-russias-aggression-against-ukraine/"
    },
    {
      "by": "limoce",
      "descendants": 1,
      "id": 30661514,
      "kids": [
        30661515
      ],
      "score": 1,
      "time": 1647181937,
      "title": "Chinese Customs Office seizes 5840 mislabeled XFX graphics cards worth $3M",
      "type": "story",
      "url": "https://videocardz.com/newz/xfx-china-website-shuts-down-after-chinese-customs-office-seizes-5840-illegally-mislabeled-xfx-graphics-cards-worth-3m-usd"
    },
    {
      "by": "mahathu",
      "descendants": 0,
      "id": 30661510,
      "score": 1,
      "text": "In my professional and personal projects, I&#x27;ve been doing a lot of web scraping and data collection, and fell in love with it in the process. It&#x27;s challenging in many different ways (e.g. extracting data out of dodgy HTML, figuring out how internal APIs work) and has been immensely helpful for me in my daily life through some side projects.<p>I recently came across upwork and it seems like a perfect platform to find clients and work on similar projects. However, I read a lot of horror stories about it here and elsewhere, with the general opinion being it&#x27;s best to find clients directly. What are recommended methods to advertise your services to potential (local?) clients in an unobtrusive way?<p>I&#x27;m based in the EU.",
      "time": 1647181913,
      "title": "Ask HN: Canonical approach to finding clients for freelancing work?",
      "type": "story"
    }
  ]
}