{
  "stories": [
    {
      "by": "SumitVermaBlog",
      "descendants": 0,
      "id": 27770653,
      "score": 1,
      "text": "No matter how supportive guardians, friends, families, and relatives we have, we find ourselves as a person who stands alone with no one to help when we walk into a real world that has monetary activities involved.\nWhen we purchase a house, we struggle with an infinite range of complications involved, from understanding the terminology of real estate to legal formalities to arranging funds for fulfilling our home loan requirements. Since all these tasks involved in the journey of the home buyer cannot be carried out by a person alone, we seek assistance but have to deal with it alone, as described earlier.\nHowever, HomeCapital has come with several steps that will help a person in all aspects to make it convenient for them to purchase a house.\nSo let us delve into it and know about all the measures offered by the HomeCapital:\nThey provide up to half of the overall amount of down payment under this plan, which can be repaid progressively in the next twelve months, and the great thing about it is that you will not be paying interest for the same.\nHome Capital&#x27;s community is a Collection of posts, videos, and audio content that helps one to gain information about all the problems involved in buying a property journey. It offers guidance not only on challenges that come in the way of buying a home but also on various topics that are relevant to it as well as whenever we feel confused and have to choose from different choices available.\nMember Benefits<p>Let&#x27;s start with the data we&#x27;re going to get as a member benefit. By offering information on subjects such as financial planning and guidance, networking and experience, homebuyer education, news and alerts, and a lot of related content, we get personalized attention and advice on how best to begin our journey to buy a home.<p>Blogs<p>If we are left with anything to discover, after receiving extensive real estate details from the Member Benefits section, the blog section is always ready to accomplish this by presenting insights on numerous subjects such as How to Boost Your Credit Score, GST Streamlined for Home Buyer, Learn the Difference Between Carpet Area, Up Area, and Super Built-Up Area, and many other similar topics.<p>Podcast\nYou can listen in and find topics regarding homeownership and the latest from leading business professionals in home buying and acquire the awareness of different topics such as Contract Closing, Securing a Deal Effectively, Finding The Perfect Home, and much more.\nWeb Series \nFurthermore, the most exciting aspect that I want to apprise is about the community&#x27;s Web Series Section impart knowledge on crucial topics such as the benefits of Purchasing a Property, The Budget for Step-by-Step Home Buying, The Eligibility of Home Loans and The Importance of Credit Score and a lot more.\nReal estate codes are confusing to a lot of us who are not associated with them and are from different fields of expertise. However, all of us someday in our life plan to buy a property, but when it comes to dealings in the respective field, we all get baffled because of the unusual terms and fail to understand the same in their true and fair view. So, HomeCapital offers a real estate Glossary to understand the technical terms in their true and fair view.\nTo tie it up, Homecapital has endless numbers of aids and assistance that help a person in all aspects, from finance to clerical, so that with the least difficulty and the shortest possible time one can satisfy his wish of buying their dream house.",
      "time": 1625744333,
      "title": "HomeCapital Community, Home Buyer's Guide",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27770628,
      "score": 1,
      "time": 1625744108,
      "title": "Tech contractors are organizing and facing violent threats in the Philippines",
      "type": "story",
      "url": "https://restofworld.org/2021/tech-contractors-are-organizing-and-facing-violent-threats-in-the-philippines/"
    },
    {
      "by": "Fiveplus",
      "descendants": 0,
      "id": 27770615,
      "score": 3,
      "time": 1625743965,
      "title": "How to Use the Feynman Technique to Learn Faster?",
      "type": "story",
      "url": "https://collegeinfogeek.com/feynman-technique/"
    },
    {
      "by": "l33tbro",
      "descendants": 0,
      "id": 27770563,
      "score": 1,
      "time": 1625743493,
      "title": "A “Leap” Toward Humanity’s Destruction",
      "type": "story",
      "url": "https://unlimitedhangout.com/2021/06/investigative-reports/a-leap-toward-humanitys-destruction/"
    },
    {
      "by": "thejokersthief",
      "descendants": 0,
      "id": 27770546,
      "score": 1,
      "time": 1625743354,
      "title": "Kindness Is a Foundation: How to Build a Kind Culture",
      "type": "story",
      "url": "https://www.solvemate.com/blog/engineering-kindness-customer-service"
    },
    {
      "by": "goindeep",
      "descendants": 0,
      "id": 27770543,
      "score": 1,
      "time": 1625743328,
      "title": "Fitbits Detect Lasting Changes After Covid-19",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/07/health/covid-fitbit-wearables.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27770529,
      "score": 1,
      "time": 1625743205,
      "title": "Bizarre Story of the Girl with No Vagina Who Was Stabbed and Had a Baby (2013)",
      "type": "story",
      "url": "http://www.todayifoundout.com/index.php/2013/08/the-bizarre-story-of-the-girl-with-no-vagina-who-was-stabbed-and-had-a-baby/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27770528,
      "score": 1,
      "time": 1625743198,
      "title": "An Alternative-Medicine Believer’s Journey Back to Science (2015)",
      "type": "story",
      "url": "https://www.wired.com/2015/04/alternative-medicine-believers-journey-back-science/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 1,
      "id": 27770510,
      "kids": [
        27770522
      ],
      "score": 1,
      "time": 1625743020,
      "title": "The AirBnBs",
      "type": "story",
      "url": "http://www.paulgraham.com/airbnbs.html"
    },
    {
      "by": "mathchick",
      "descendants": 0,
      "id": 27770509,
      "score": 1,
      "time": 1625743006,
      "title": "I Recreated YouTube’s Homepage in Figma",
      "type": "story",
      "url": "https://cuzegbu.medium.com/how-i-recreated-youtubes-homepage-in-figma-90097a01ac9a"
    }
  ]
}