{
  "stories": [
    {
      "by": "memish",
      "descendants": 0,
      "id": 30824498,
      "score": 1,
      "time": 1648417782,
      "title": "What Quantum Mechanics Can Teach Us about Abortion",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/what-quantum-mechanics-can-teach-us-about-abortion/"
    },
    {
      "by": "barry-cotter",
      "descendants": 0,
      "id": 30824468,
      "score": 1,
      "time": 1648417609,
      "title": "Why Successful Children Don’t Innovate: An Evolutionary Perspective",
      "type": "story",
      "url": "http://christopherbuckley.org/blog/why-successful-children-dont-innovate-an-evolutionary-perspective"
    },
    {
      "by": "codr7",
      "descendants": 0,
      "id": 30824441,
      "score": 1,
      "time": 1648417427,
      "title": "The Truth",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=ZW5KlbHyFOY"
    },
    {
      "by": "dangle1",
      "descendants": 0,
      "id": 30824412,
      "score": 2,
      "time": 1648417177,
      "title": "A visa crisis is hitting the children of Silicon Valley tech workers",
      "type": "story",
      "url": "https://www.sfchronicle.com/bayarea/article/A-visa-crisis-is-hitting-the-children-of-Silicon-17029880.php"
    },
    {
      "by": "bartq",
      "descendants": 0,
      "id": 30824387,
      "score": 1,
      "text": "Let&#x27;s assume React&#x2F;Vue&#x2F;Angular&#x2F;Svelte and all the rest of all popular frameworks are going to be superseded by some next generation of library&#x2F;framework&#x2F;language&#x2F;system. What will it be and why? How to escape the hell of new JS framework popping up every hour?<p>Of course I have my own thoughts and I&#x27;m going to present them soon in some blog post, but I&#x27;d like to ask what you guys think too.",
      "time": 1648416962,
      "title": "Ask HN: What are your expectations for *next* web UI framework?",
      "type": "story"
    },
    {
      "by": "coolwulf",
      "descendants": 0,
      "id": 30824378,
      "score": 1,
      "text": "4 years ago, I posted here and reddit to introduce some work I did using AI for breast tumor detection and classification:\nhttps:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;MachineLearning&#x2F;comments&#x2F;8rdpwy&#x2F;pi_made_a_gpu_cluster_and_free_website_to_help&#x2F;<p>That post gain some traction on Reddit and I hope you would like the one I am gonna introduce here again.<p>In the recent years, I have been shifting my focus from cancer detection to the actual treatment.<p>One particular problem we really want to solve is to have more brain cancer patients to be accessible to stereotactic radiosurgery (SRS) which has a lot better treatment outcome and much better quality of life (QoL) for the patient than whole brain radiotherapy (WBRT) which is more common for patients with multiple brainiest (say more than 5 or 10).<p>The reason behind that is it takes a really lot of efforts for physician or neurosurgeon for the SRS procedures for multiple brain mets patients since each lesion needs to be correctly contoured &#x2F; labeled &#x2F; tracked and also a lot of efforts for medical physicists for treatment planning for these kinds of multiple lesion cases.\nTherefore starting from 2019, we collaborated with UTSW and Stanford trying to tackle this problem. We have since developed models for auto contouring &#x2F; labeling brain mets lesions, together with Organ-at-Risks (OAR), also we developed models for fast false positive reduction based on SVM-radiomics. In addition, we developed models for quickly splitting multiple mets into different treatment sessions based on optimized radiation dose maps.\nThis work will be presented tomorrow at 2022 AAPM spring clinical meeting by our collaborator at Stanford<p>https:&#x2F;&#x2F;w4.aapm.org&#x2F;meetings&#x2F;2022SCM&#x2F;programInfo&#x2F;programAbs.php?sid=9476&amp;aid=60551<p>And we are accelerating to trying to have this technology and platform available to the whole SRS community very soon.\nWe really hope this platform could bring more patients to SRS procedures instead of the brutal whole brain RT. And we have seem patients keep coming back every a few months for SRS to extend the quality of their life (comparing with WBRT which is a once-in-a-life treatment which has not other treatment methods after it when the patients have reoccurrence occurred after 3 months).\nHope you like this work.<p>Hao",
      "time": 1648416917,
      "title": "AI platform to advance stereotactic radiosurgery (SRS) for brain tumor patients",
      "type": "story"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 30824377,
      "score": 1,
      "time": 1648416913,
      "title": "Deepfakes are now trying to change the course of war",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/25/tech/deepfakes-disinformation-war/index.html"
    },
    {
      "by": "josefslerka",
      "descendants": 0,
      "id": 30824375,
      "score": 2,
      "time": 1648416874,
      "title": "Why are punch card readers no longer in use?",
      "type": "story",
      "url": "https://retrocomputing.stackexchange.com/questions/5652/why-are-punch-card-readers-no-longer-in-use"
    },
    {
      "by": "gscott",
      "descendants": 0,
      "id": 30824370,
      "score": 1,
      "time": 1648416833,
      "title": "Arizona is the first state to accept digital driver's licenses in Apple Wallet",
      "type": "story",
      "url": "https://www.cnn.com/2022/03/23/tech/apple-drivers-license/index.html"
    },
    {
      "by": "zimbabao",
      "descendants": 0,
      "id": 30824363,
      "score": 2,
      "time": 1648416764,
      "title": "Why collapsing the cost of trust and verification is profitable",
      "type": "story",
      "url": "https://www.decentralised.co/p/on-aggregation-theory-and-web3"
    }
  ]
}