{
  "stories": [
    {
      "by": "VHT_Talent",
      "descendants": 0,
      "id": 31235173,
      "score": 1,
      "text": "Mindful is a leader in the customer experience market, and we’re reinventing the customer experience with our SaaS based platform Mindful. Our products enable people to get the help they need, from brands they love, on terms they choose. We’re do this by providing contact centers solutions that optimize customer interactions across all their channels and we’re expanding fast.\nWe are looking for talented developers to join our Engineering team to help build a state-of-the-art SaaS platform.\nOn the backend we primarily use nodejs&#x2F;typescript on top of event driven serverless technologies with some services leveraging ruby on rails.  On the frontend, we use React&#x2F;Typescript&#x2F;GraphQL to create delightful and engaging user experience that help drive the adoption of our cx technologies. Our stacks are entirely based on AWS.\nOpen Roles: Sr. Full stack Developer - DevOps Engineer - Analytics Engineer – Senior Software Developer\nWe offer competitive pay and excellent benefits (health, vision, dental, 401k, etc) and a very straightforward application and interview process.\nIf interested, apply using the link below or email directly at talent@getmindful.com!\nSee all of our job postings at https:&#x2F;&#x2F;getmindful.com&#x2F;careers",
      "time": 1651499811,
      "title": "Mindful| Multiple Roles – US Remote – Full-Time – HTTPS://Www.getmindful.com",
      "type": "story"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 31235166,
      "score": 1,
      "time": 1651499751,
      "title": "World is closer to nuclear war than Cuban Missile Crisis",
      "type": "story",
      "url": "https://www.mirror.co.uk/news/world-news/world-closer-nuclear-war-cuban-26842081"
    },
    {
      "by": "firstSpeaker",
      "descendants": 0,
      "id": 31235152,
      "score": 1,
      "time": 1651499686,
      "title": "Google fires another AI researcher who reportedly challenged findings",
      "type": "story",
      "url": "https://www.engadget.com/google-fires-ai-researcher-over-paper-challenge-132640478.html"
    },
    {
      "by": "bananapear",
      "descendants": 0,
      "id": 31235146,
      "score": 1,
      "time": 1651499670,
      "title": "Law firm says staff can work from home for 20% less pay",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-61298394"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 31235142,
      "score": 1,
      "time": 1651499638,
      "title": "Mathematicians Coax Fluid Equations into Nonphysical Solutions",
      "type": "story",
      "url": "https://www.quantamagazine.org/mathematicians-coax-fluid-equations-into-nonphysical-solutions-20220502/"
    },
    {
      "by": "prvc",
      "descendants": 0,
      "id": 31235141,
      "score": 1,
      "time": 1651499637,
      "title": "N.Z. cannibalism multiplayer game unexpectedly garners a large userbase in China",
      "type": "story",
      "url": "https://www.stuff.co.nz/business/128356024/nz-cannibalism-adventure-game-a-terrifying-success-in-china"
    },
    {
      "by": "matt321",
      "descendants": 0,
      "id": 31235132,
      "score": 2,
      "text": "Hello HN,<p>I (firmware&#x2F;software) and a group of fellow mechanical (1x) electrical (1x) engineers often wax about starting a company.  None of us are interested in managing anything non engineering-related. Where do you usually find the manager types for your startup?  You know, the ones who can talk to investors, do the government paperwork, and other boring stuff.",
      "time": 1651499605,
      "title": "Ask HN: Engineers Running a Business?",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31235130,
      "score": 1,
      "time": 1651499604,
      "title": "Linux distributions are becoming irrelevant (2017)",
      "type": "story",
      "url": "https://flameeyes.blog/2017/06/27/distributions-becoming-irrelevant/"
    },
    {
      "by": "boramy_gau",
      "descendants": 0,
      "id": 31235110,
      "score": 1,
      "text": "Karambol is an AI-powered travel guide. It works like a search engine and aims to provide relevant travel itineraries while matching one&#x27;s travel preferences.<p>As a traveler, I&#x27;m quite frustrated by paper guides. Way too long to read! Plus, I feel the editors add new “must see” things every year just to justify the new edition (and the price). I&#x27;m also frustrated at travel blogs where storytelling is over-used.<p>I like having the “best of the best” places to visit and have help building my itinerary. I know many others do the same. This is why I started Karambol, which is a side project so far.<p>Any feedbacks are welcomed!",
      "time": 1651499495,
      "title": "Show HN: AI-Powered Travel Guide",
      "type": "story",
      "url": "https://www.karambol.io"
    },
    {
      "by": "memorable",
      "descendants": 1,
      "id": 31235109,
      "kids": [
        31235180
      ],
      "score": 9,
      "time": 1651499488,
      "title": "Fritzing is an open-source electronic design tool",
      "type": "story",
      "url": "https://fritzing.org/"
    }
  ]
}