{
  "stories": [
    {
      "by": "notoriousarun",
      "descendants": 0,
      "id": 27784055,
      "score": 1,
      "time": 1625841240,
      "title": "“Shipping beats perfection” explained",
      "type": "story",
      "url": "https://bjk5.com/post/60760280107/shipping-beats-perfection-explained"
    },
    {
      "by": "sonograph",
      "descendants": 0,
      "id": 27784051,
      "score": 1,
      "time": 1625841211,
      "title": "ELI5: Captum – Easily Interpret AI Models",
      "type": "story",
      "url": "https://developers.facebook.com/blog/post/2021/07/06/eli5-captum-easily-interpret-ai-models/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27784037,
      "score": 1,
      "time": 1625841099,
      "title": "Measuring cognitive complexity with elm-review",
      "type": "story",
      "url": "https://jfmengels.net/cognitive-complexity/"
    },
    {
      "by": "csomar",
      "descendants": 0,
      "id": 27784028,
      "score": 1,
      "time": 1625841077,
      "title": "Are we due for another ice age? (2016)",
      "type": "story",
      "url": "https://www.abc.net.au/news/science/2016-06-15/what-is-an-ice-age-explainer/7185002"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 27784023,
      "score": 1,
      "time": 1625841060,
      "title": "Landgrid – United States Parcel Data",
      "type": "story",
      "url": "https://landgrid.com/us/#b=admin"
    },
    {
      "by": "atelliotf",
      "descendants": 0,
      "id": 27784022,
      "score": 1,
      "time": 1625841048,
      "title": "Physics of Covid-19 Transmission",
      "type": "story",
      "url": "https://ocw.mit.edu/resources/res-10-s95-physics-of-covid-19-transmission-fall-2020/index.htm"
    },
    {
      "by": "andyjih_",
      "descendants": 0,
      "id": 27784001,
      "score": 1,
      "time": 1625840909,
      "title": "Stripe takes first step toward blockbuster listing",
      "type": "story",
      "url": "https://www.reuters.com/technology/exclusive-online-payments-firm-stripe-takes-first-step-toward-blockbuster-2021-07-08/"
    },
    {
      "by": "gok",
      "descendants": 0,
      "id": 27783980,
      "score": 1,
      "time": 1625840779,
      "title": "How the American South is paying the price for Europe's 'green' energy",
      "type": "story",
      "url": "https://www.cnn.com/interactive/2021/07/us/american-south-biomass-energy-invs/"
    },
    {
      "by": "thetwentyone",
      "descendants": 1,
      "id": 27783961,
      "kids": [
        27784019
      ],
      "score": 2,
      "time": 1625840663,
      "title": "Beautifulalgorithms.jl",
      "type": "story",
      "url": "https://github.com/mossr/BeautifulAlgorithms.jl"
    },
    {
      "by": "anandchowdhary",
      "descendants": 0,
      "id": 27783939,
      "score": 6,
      "text": "Hi HN! We’re Carlo and Anand, and for the past few months, we’ve been building Pabio (<a href=\"https:&#x2F;&#x2F;pabio.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pabio.com</a>). With Pabio, you can get your apartment fully furnished by a professional interior designer and rent high-quality furniture on a monthly subscription.<p>After exiting our previous startups, we got some time on our hands and started visiting many friends at their homes for a coffee to talk about anything and everything. One thing stood out: In most cases, their apartment interior was awful — it was almost always crammed with cheap furniture that didn’t match with each other or the apartment. So, we asked our friends why they wouldn’t hire an interior designer and purchase nicer furniture that fits better, and most of them gave us two reasons: first, interior design seems elitist and expensive; and second, buying full apartment interior is (a) too expensive, and (b) doesn’t make sense if you rent an apartment and don’t know who long you’re going to stay in it.<p>We figured that if we combine both things — interior design and furniture rental — we can create an affordable package for tenants that’s still very high-quality.<p>Here’s how it works:<p>The user uploads a floor plan of their apartment and takes some photos for our reference. Using these, we generate a 3D model of the apartment and one of our interior designers furnishes it. We send the user a fully rendered, photorealistic view of what their apartment will look like [1]. If they like it, they sign up, we deliver and install all furniture, and the user pays a monthly subscription fee. We also fully insure all items and offer optional add-on services like electricians and bi-weekly cleaning. Once they move out, we take all the furniture back, renovate it, and place it in a new apartment at a discounted price.<p>For the whole process to work smoothly, we developed a semi-automated rendering workflow. We built a web-based drawing tool that allows us to easily draw a floor plan, drag-and-drop furniture items on it, and convert it to structured data [2]. We send this JSON instruction file to a Blender instance where we run a Python script to generate renders using our custom Blender plugins. This process is not fully finalized yet, so we usually have to manually adjust some parameters like the camera placement or applying filters, but give it a few more months (or years... heh), and we’ll be able to end-to-end automate the floor plan-to-render process.<p>Although a lot of our core tech is internal tooling such as the rendering service [2], Pabio.com serves as the web app where users can plan their furniture deliveries, file insurance claims, manage billing, etc. You can test out Pabio at <a href=\"https:&#x2F;&#x2F;pabio.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pabio.com</a>, or check out a sample proposal that we send to customers [1].<p>We’re very excited (and a bit nervous) to hear what you think! Please leave us your feedback and share your ideas about how we can improve our offering.<p>Thank you so much!<p>Carlo &amp; Anand<p>[1] Sample proposal: <a href=\"https:&#x2F;&#x2F;pabio.com&#x2F;sample-interior-design-concept\" rel=\"nofollow\">https:&#x2F;&#x2F;pabio.com&#x2F;sample-interior-design-concept</a><p>[2] 30-second demo of our internal interior design tool that generates renders: <a href=\"https:&#x2F;&#x2F;pabiousercontent.com&#x2F;marketing-assets&#x2F;launch-hn&#x2F;designer-demo.mp4\" rel=\"nofollow\">https:&#x2F;&#x2F;pabiousercontent.com&#x2F;marketing-assets&#x2F;launch-hn&#x2F;desi...</a>",
      "time": 1625840524,
      "title": "Launch HN: Pabio (YC S21) – Interior design and furniture rental as a service",
      "type": "story"
    }
  ]
}