{
  "stories": [
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 32106455,
      "score": 1,
      "time": 1657878855,
      "title": "Mini Hollywood: The fake town in Spain used to create Western movies",
      "type": "story",
      "url": "https://faroutmagazine.co.uk/fake-town-spain-create-western-movies/"
    },
    {
      "by": "Igor_Wiwi",
      "descendants": 0,
      "id": 32106448,
      "score": 2,
      "time": 1657878785,
      "title": "Ode to My Headphones",
      "type": "story",
      "url": "http://amortizedcost.net/ode-to-my-headphones/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 32106442,
      "score": 1,
      "time": 1657878709,
      "title": "Integer Math in JavaScript",
      "type": "story",
      "url": "https://james.darpinian.com/blog/integer-math-in-javascript"
    },
    {
      "by": "dcminter",
      "descendants": 0,
      "id": 32106441,
      "score": 1,
      "time": 1657878691,
      "title": "Project Fear",
      "type": "story",
      "url": "https://paperstack.com/project_fear/"
    },
    {
      "by": "victormustar",
      "descendants": 0,
      "id": 32106433,
      "score": 1,
      "time": 1657878626,
      "title": "YOLOv6: Real-Time Object Detection Demo",
      "type": "story",
      "url": "https://huggingface.co/spaces/nateraw/yolov6"
    },
    {
      "by": "zimpenfish",
      "descendants": 1,
      "id": 32106426,
      "kids": [
        32106445
      ],
      "score": 2,
      "time": 1657878540,
      "title": "Crawley Town: The 'internet's football team' aiming for the Premier League",
      "type": "story",
      "url": "https://www.bbc.co.uk/sport/football/62136553"
    },
    {
      "by": "tanganian",
      "descendants": 0,
      "id": 32106419,
      "score": 1,
      "text": "I&#x27;m just a random dude from a poor African country. I&#x27;m currently living in France, working in management, and attempting to switch career, going into the tech world. Since then, my news feed is bloated with different offers of teachings and courses form everywhere, including my own country. The thing is, most of it sucks, just randoms thinking they can teach, bootcamp that gets nowhere and so on ... (they can market well though). There are also dev agencies that hire people for $200 a month while asking for $1000 to foreign employer and they get the difference, plainly exploitation. I don&#x27;t really mind dev agencies, but I think money should be split fairly.<p>The problem: free resources don&#x27;t have a marketing team behind them, so thousands of poor people get scammed everyday into buying a bad course that won&#x27;t get them anywhere.<p>The plan: rent a local, put in fiber internet, and open it to the public for free so people can come in and learn (I will block anything not related to learning through a firewall or something). Maybe buy some computers if money allows it. The only prerequisites being to be able to speak&#x2F;write English. There people can discuss, and more importantly, only use vetted resources to learn. I&#x27;m not a teacher and I won&#x27;t pretend to be one, I&#x27;ll just serve as a guide.<p>What lead me to this idea is that I personally use free resources online to learn as I try to become a data engineer. I&#x27;m following courses from UCB that are free to audit online, I will just compile or find a compilation of such courses into a curriculum and be done with it. I&#x27;m aware that this could be turned into a business, an outsourcing agency of sorts, but later maybe, if things goes well, for now its merely an idea. Any input would be appreciated. Thanks.",
      "time": 1657878470,
      "title": "Ask HN: How do I raise money for a nonprofit? Internationally on top of that?",
      "type": "story"
    },
    {
      "by": "alphalima",
      "descendants": 0,
      "id": 32106380,
      "score": 1,
      "text": "I&#x27;m thinking about introducing a low-code system to handle internal operational processes. I&#x27;m thinking things like viewing&#x2F;handling dead-letter messages, manual intervention decision points, short lived operational tasks that haven&#x27;t yet&#x2F;won&#x27;t be automated.<p>I&#x27;d expect the software engineering team to manage these apps, so the benefit I can see is the quick turnaround on the UI, rather than handing over to non-engineering users for development.<p>What are people&#x27;s experiences with these tools? More specifically:<p>Can you do an effective SDLC with them? e.g. code on a staging environment, push to version control, promote to prod, rollback to old version<p>Have you actually saved time with them?<p>Did you avoid introducing unworkable complexity?",
      "time": 1657878075,
      "title": "Ask HN: Experiences with low-code systems (Budibase,Appsmith etc.)?",
      "type": "story"
    },
    {
      "by": "capJavert",
      "descendants": 1,
      "id": 32106370,
      "kids": [
        32106371
      ],
      "score": 1,
      "time": 1657877979,
      "title": "Re-Hacking Wordle",
      "type": "story",
      "url": "https://medium.com/@capJavert/re-hacking-wordle-114ba75d1344"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 32106367,
      "score": 1,
      "time": 1657877896,
      "title": "The Secret Art of the Family Photo",
      "type": "story",
      "url": "https://www.newyorker.com/culture/annals-of-inquiry/family-photos"
    }
  ]
}