{
  "stories": [
    {
      "by": "jiaweicli",
      "descendants": 0,
      "id": 28269731,
      "score": 1,
      "text": "It’s our honour to be part of YC S21. During the YC batch, we transformed our original business model offering home-based healthcare services to a company that transforms UK community pharmacies into diagnostic centres. Instead of travelling a long distance and spending a long time to receive diagnostic tests, customers can now receive diagnostic tests from their local pharmacies, just around the corner to where they live.<p>We offer an easy-to-use software for the pharmacies to register and manage patients for diagnostic tests, starting with COVID tests today and other tests soon. The model was launched on 28th June, and in just one month, we have onboarded over 140 pharmacies. We helped these pharmacies generating $1.3 million in incremental revenue per month. In the process, our revenue 10Xed in one month.<p>How did this happen?\nWe worked extremely hard during the YC programme. We initially thought out-of-pocket home and workplace-based healthcare is our go-to-market, so we explored the option of corporate contracts. As we try to establish more distribution channels, I realised that local independent pharmacies may also be a potential distribution channel for out-of-pocket healthcare as they already have an established customer base.  So from the last week of June, I piloted offering COVID tests to independent pharmacies.<p>The initial interest from the pharmacies was low, with only 2 to 4 tests performed a day. As a consequence, we set a goal of achieving 100 tests in one week. The extra pressure worked that our test number increased from 4 a day to over 50 tests a day. Now, our partner pharmacies perform over 300 tests a day.<p>What’s the future?\nCOVID has led to unprecedented changes in our user behaviour. Many services have now become hyper-localised. Tuli Health is right at the centre of all these changes. Here, we’re revolutionising how diagnostic tests are delivered. COVID tests led to the pharmacies opening their doors to us, but this is just the beginning. In the future, other diagnostic tests will also be available: STI, allergy, biochemistry profile, gluten intolerance….<p>Imagine this: a future where healthcare becomes increasingly more decentralised; local pharmacies do more than dispensing medications. Pharmacies become centres for diagnostics, vaccinations, wellness and more.<p>Closing comment\nApplying to YC was one of the best decisions I have made. Not only have we received the financial backup. The (gentle) pressure from the group partners telling us to “grow, grow, grow” led us to take on more risk than when we were bootstrapping. We’re very grateful for our group partners’ guidance. Thank you.",
      "time": 1629667187,
      "title": "Tuli Health (YC S21) 10Xed in One Month",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28269713,
      "score": 1,
      "time": 1629667086,
      "title": "Construct Hub",
      "type": "story",
      "url": "https://constructs.dev/"
    },
    {
      "by": "DoreenMichele",
      "descendants": 0,
      "id": 28269708,
      "score": 1,
      "time": 1629667042,
      "title": "Fostering Meaningful Discussion in Low Trust Environments",
      "type": "story",
      "url": "http://www.eclogiselle.com/2021/08/fostering-meaningful-discussion-in-low.html"
    },
    {
      "by": "35_candelas",
      "descendants": 0,
      "id": 28269707,
      "score": 1,
      "time": 1629667041,
      "title": "Countering climate change with cool pavements",
      "type": "story",
      "url": "https://news.mit.edu/2021/countering-climate-change-cool-pavements-0822"
    },
    {
      "by": "hiddencache",
      "descendants": 0,
      "id": 28269665,
      "kids": [
        28269686
      ],
      "score": 2,
      "time": 1629666724,
      "title": "The Wuhan lab leak theory is more about politics than science",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/aug/22/the-wuhan-lab-leak-theory-is-more-about-politics-than-science"
    },
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 28269646,
      "score": 1,
      "time": 1629666633,
      "title": "Lcc.net: Targeting the .NET Common Intermediate Language from Standard C (2002)",
      "type": "story",
      "url": "https://www.microsoft.com/en-us/research/publication/lcc-net-targeting-the-net-common-intermediate-language-from-standard-c/"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28269614,
      "score": 1,
      "time": 1629666457,
      "title": "Readers' big infrastructure projects (2013)",
      "type": "story",
      "url": "https://www.bbc.com/news/magazine-23969607"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 28269611,
      "score": 1,
      "time": 1629666446,
      "title": "Keynote: Making Progress – Alan Kay",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9MqVfzxAp6A"
    },
    {
      "by": "krextin",
      "descendants": 0,
      "id": 28269606,
      "score": 1,
      "time": 1629666429,
      "title": "Atlassian and Freemium Framework",
      "type": "story",
      "url": "https://42.substack.com/p/atlassian-and-freemium-framework"
    },
    {
      "by": "DerWOK",
      "descendants": 0,
      "id": 28269581,
      "score": 1,
      "time": 1629666182,
      "title": "Motion Picture Production Code (1934-1968)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Motion_Picture_Production_Code"
    }
  ]
}