{
  "stories": [
    {
      "by": "tjalfi",
      "descendants": 0,
      "id": 28007326,
      "score": 1,
      "time": 1627648958,
      "title": "Current Stimulation of the Midbrain Nucleus in Pigeons for Avian Flight Control",
      "type": "story",
      "url": "https://www.mdpi.com/2072-666X/12/7/788"
    },
    {
      "by": "Ondrej72",
      "descendants": 0,
      "id": 28007321,
      "score": 1,
      "time": 1627648925,
      "title": "An aggregate of 610 pros and 153 cons points of Tesla Model 3 by owners",
      "type": "story",
      "url": "https://www.myevreview.com/pros-cons/tesla/model-3"
    },
    {
      "by": "tantalor",
      "descendants": 0,
      "id": 28007316,
      "score": 2,
      "time": 1627648898,
      "title": "Meet the Man Who Wants You to Give Up Google",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/29/opinion/sway-kara-swisher-sridhar-ramaswamy.html"
    },
    {
      "by": "sunilkumarc",
      "descendants": 0,
      "id": 28007312,
      "score": 1,
      "time": 1627648878,
      "title": "A Shy Kid from a Small Village in India to an Influencer on Twitter",
      "type": "story",
      "url": "https://sunilc.medium.com/my-story-so-far-a-shy-kid-from-a-small-village-in-india-to-an-influencer-on-twitter-98fa25719390"
    },
    {
      "by": "mattowen_uk",
      "descendants": 0,
      "id": 28007307,
      "score": 1,
      "time": 1627648861,
      "title": "Vivaldi Introduces Accordion Tabs and Command Chains",
      "type": "story",
      "url": "https://vivaldi.com/blog/vivaldi-introduces-accordion-tabs-and-command-chains/"
    },
    {
      "by": "backtoschool21",
      "descendants": 0,
      "id": 28007301,
      "score": 1,
      "text": "So, my situation is quite rare I think. I was doing a CS degree between ages 18 and 21, passed all the required courses, had a pretty decent grades, but then I dropped out right before the finish line because I picked the wrong bachelor thesis and couldn&#x27;t force myself to finish it at the time.<p>Right now I am 23 and working in my 3rd job as software developer (previous two were part time jobs during university, right now I am doing full time). I never had trouble getting a SWE job (always got multiple offers I could pick from) and keeping it, as I am passionate about programming and always had side projects etc. going on.<p>Given this circumstances, I am confident that I can have pretty solid software engineer career on my own, without getting the degree. However, recently there is a voice in my brain saying I should consider getting back to school, mostly for 3 reasons:<p><pre><code>    There might be a time in the future when I will hit glass ceiling and (CS) degree will be a hard requirement in order to advance my career further. Then it is better to do it now, while I am still relatively young without mortgage and children.\n\n    I enjoy reading books and articles about programming and self-improve in my spare time and I am interested in some theoretical CS concepts I didn&#x27;t pay much attention to, while I was studying for the first time.\n\n    University is great for getting new friends and general networking. I did a poor job in this area during my first run as I was the typical socially awkward, self-conscious kid. I believe I grew a lot as a person during the last 2-3 years and would have much easier time socialising with others this time.\n</code></pre>\nIs there anyone who did something similiar? How did it go? I know it will require dedication and discipline, but I am optimistic as my current job is very flexible and I can do it properly with just 3-4 hours of work (from home) every day. Also, the uni I would go to is decent, but it isn&#x27;t MIT or anything, so it shouldn&#x27;t be super stressful.<p>PS: I am located in Europe, so altough I would have to pay some fees for the second attempt at getting a degree, it is nowhere near what USA universities require and I won&#x27;t have to take any loans for it or anything. It&#x27;s like 60% of my one month salary per semester.",
      "time": 1627648832,
      "title": "Ask HN: Going back to school when I already have solid CS career going on?",
      "type": "story"
    },
    {
      "by": "theshrike79",
      "descendants": 0,
      "id": 28007292,
      "score": 1,
      "time": 1627648713,
      "title": "Google Cloud offers a model for fixing Google’s product-killing reputation",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/07/google-cloud-offers-a-model-for-fixing-googles-product-killing-reputation/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28007291,
      "score": 1,
      "time": 1627648711,
      "title": "Why Itanium Processors? Benefits of the New Processor Family",
      "type": "story",
      "url": "https://www.informit.com/articles/printerfriendly/31207"
    },
    {
      "by": "newswasboring",
      "descendants": 0,
      "id": 28007289,
      "score": 1,
      "time": 1627648682,
      "title": "Scroogled [pdf]",
      "type": "story",
      "url": "https://cmci.colorado.edu/~cafi5706/Scroogled.pdf"
    },
    {
      "by": "mhb",
      "descendants": 0,
      "id": 28007281,
      "score": 1,
      "time": 1627648620,
      "title": "Tesla Turned the Streets into a Lab. Guess What Happened Next",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/30/opinion/self-driving-cars-tesla-elon-musk.html"
    }
  ]
}