{
  "stories": [
    {
      "by": "svlasov",
      "descendants": 0,
      "id": 29379346,
      "score": 1,
      "time": 1638191089,
      "title": "Winamp Source Code Leak",
      "type": "story",
      "url": "https://web.archive.org/web/20210515031018/https://github.com/CONIGUERO/winamp"
    },
    {
      "by": "conanxin",
      "descendants": 1,
      "id": 29379340,
      "kids": [
        29379341
      ],
      "score": 1,
      "time": 1638191060,
      "title": "Complex information processing: a file structure for the complex, the changing",
      "type": "story",
      "url": "https://dl.acm.org/doi/10.1145/800197.806036"
    },
    {
      "by": "jbredeche",
      "descendants": 0,
      "id": 29379335,
      "score": 1,
      "time": 1638191035,
      "title": "The Secret Life of Seconds: The Minds Behind the World Chess Championship",
      "type": "story",
      "url": "https://www.wsj.com/articles/world-chess-championship-magnus-carlsen-ian-nepomniachtchi-seconds-11638167905"
    },
    {
      "by": "lionis",
      "descendants": 0,
      "id": 29379313,
      "score": 1,
      "time": 1638190902,
      "title": "WayRay Concept Brings 3D Augmented Reality to the Car",
      "type": "story",
      "url": "https://www.caranddriver.com/news/a38368383/wayray-holograktor-electric-concept-revealed/"
    },
    {
      "by": "m33k44",
      "descendants": 0,
      "id": 29379309,
      "score": 2,
      "time": 1638190873,
      "title": "What Happened: Dr. Jay Bhattacharya on 19 Months of Covid",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=zG7XZ2JXZqY"
    },
    {
      "by": "gbourne",
      "descendants": 1,
      "id": 29379261,
      "kids": [
        29379336,
        29379275
      ],
      "score": 1,
      "time": 1638190597,
      "title": "It’s Time to Get Rid of the IT Department",
      "type": "story",
      "url": "https://www.wsj.com/articles/get-rid-of-the-it-department-11637605133"
    },
    {
      "by": "oumua_don17",
      "descendants": 0,
      "id": 29379253,
      "score": 2,
      "time": 1638190555,
      "title": "Nvidia at risk of $1.25bn loss if Arm takeover falls through",
      "type": "story",
      "url": "https://www.telegraph.co.uk/business/2021/11/28/nvidia-risk-125bn-loss-arm-takeover-falls/"
    },
    {
      "by": "News-Dog",
      "descendants": 2,
      "id": 29379227,
      "kids": [
        29379279,
        29379236
      ],
      "score": 2,
      "text": "OK! I&#x27;m far too pissed (drunk), i&#x27;ve had four-glasses of Champagne, it is my birthday! and I&#x27;m a year older,<p><pre><code>  to be posting, four-glassing of Champagne (i do not Drink: )\n</code></pre>\nIf your ever have the chance, goto https:&#x2F;&#x2F;www.korbel.com - these are wondererful people!<p>I would like to thank Daniel and DANG for for their wonderful service, thank You Guys! You Are The Best!!!",
      "time": 1638190331,
      "title": "Tell: NH Thank YOU!",
      "type": "story"
    },
    {
      "by": "homarp",
      "descendants": 0,
      "id": 29379217,
      "score": 1,
      "time": 1638190294,
      "title": "Codecarbon: Pip package to Track and reduce CO2 emissions from your computing",
      "type": "story",
      "url": "http://codecarbon.io/"
    },
    {
      "by": "vladstudio",
      "descendants": 0,
      "id": 29379215,
      "score": 1,
      "text": "Hi all.<p>It&#x27;s Monday and I&#x27;m feeling sad. A perfect combination to sit down and write a long-read with a question. You are probably reading &quot;New&quot; section of HN out of boredom, let me try to entertain you and ask some questions along the way.<p>---<p>Some background first.<p>I&#x27;ve been working as UI&#x2F;UX&#x2F;product designer since ~2000, and I taught myself everything I needed to develop a personal website - https:&#x2F;&#x2F;vlad.studio - including html&#x2F;css&#x2F;js&#x2F;php&#x2F;mysql&#x2F;bash. Soon after, I started selling access to &quot;premium&quot; content of Vlad.studio (the definition of &quot;premium&quot; has changed multiple times, as well as business model - 4 different plans, then yearly subscription, etc - currently it&#x27;s simply one-time purchase).<p>In 2010s, I was &quot;freelancer&quot; (read - no &quot;real&quot; job) and there has been a couple of years when Vlad.studio accounts were my main source of income (2000-3000 USD&#x2F;month). Good old times! Then, one thing led to another, I got kind of depressed, then got swamped in a stressful job, then another one. Until maybe 2019, the website was almost abandoned.<p>Recently, with only some part-time projects, I&#x27;m feeling the need to breathe more life into the old friend of mine. Vlad.studio has always been special for me - a place to express myself, a place where I have no lack of positive feedback of my art. This is truly inspiring!<p>The profits, however, are less and less. Which leads me to my question:<p>---<p>Is it even possible to turn such personal hobby website into a stable business?<p>I&#x27;ve been reflecting about whan makes people send me real money. My main theory is - a user has been enjoying my art for quite some time, and at some point, they buy an account to show appreciation (similar to Patreon, Buymeacoffee, etc).<p>There is no real &quot;value&quot;, however. I&#x27;m not an app. I do not simplify your workflow or make you more productive on a daily basis.<p>---<p>Some ideas I am considering:<p>1) add more features. What features? I feel I already have plenty. You can send any picture as an e-card (almost not used), play a puzzle, set as facebook cover. I recently introduced a New Tab extension for Chrome, as another way to deliver my art to my users&#x27; screens. I use it myself and find it useful, but it&#x27;s not enough :-)<p>2) change business model (again). Bask to monthly&#x2F;yearly subscriptions? I&#x27;m not sure I can justify them. Unless I publish a picture a week, maybe.<p>3) start spending money on marketing. I have never spent a dollar on marketing before! Was it a mistake? Is it too late? Maybe. In 2010s, vlad.studio was #4-5 result on Google when you searched for &quot;desktop wallpapers&quot;. Those times are long gone.<p>---<p>Some stats if you&#x27;re curious: Vlad.studio receives ~1000 visitors daily, and the average income for 2021 is $360&#x2F;month.<p>P.S. Thanks for reading this. I guess I&#x27;m reaching out to HN community because that&#x27;s the one website I read daily, and I almost always skip the links and read the comments instead.",
      "time": 1638190288,
      "title": "Ask HN: How to breathe life into a personal project (desktop wallpapers)?",
      "type": "story"
    }
  ]
}