{
  "stories": [
    {
      "by": "cesarb",
      "descendants": 0,
      "id": 29106159,
      "score": 1,
      "time": 1636028180,
      "title": "Never Update Anything",
      "type": "story",
      "url": "https://blog.kronis.dev/articles/never-update-anything"
    },
    {
      "by": "transportheap",
      "descendants": 0,
      "id": 29106155,
      "score": 1,
      "time": 1636028143,
      "title": "LibreWolf browser: telemetry stripped Firefox fork",
      "type": "story",
      "url": "https://librewolf-community.gitlab.io/"
    },
    {
      "by": "tokai",
      "descendants": 0,
      "id": 29106150,
      "score": 1,
      "time": 1636028093,
      "title": "Examining interactions between narcissistic leaders and anxious followers",
      "type": "story",
      "url": "https://asistdl.onlinelibrary.wiley.com/doi/10.1002/asi.24490"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29106148,
      "score": 1,
      "time": 1636028086,
      "title": "Structure and Interpretation of Computer Programs: JavaScript Edition",
      "type": "story",
      "url": "https://mitpress.mit.edu/books/structure-and-interpretation-computer-programs-1"
    },
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 29106133,
      "score": 1,
      "time": 1636027988,
      "title": "Command-line Tools can be 235x Faster than your Hadoop Cluster",
      "type": "story",
      "url": "https://adamdrake.com/command-line-tools-can-be-235x-faster-than-your-hadoop-cluster.html"
    },
    {
      "by": "token6053",
      "descendants": 0,
      "id": 29106119,
      "score": 1,
      "time": 1636027930,
      "title": "I Quit My Job and Founded a Startup After Reading 1 HN Post",
      "type": "story",
      "url": "https://writeaswell.com/articles/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29106110,
      "score": 1,
      "time": 1636027877,
      "title": "GoGodotJam 2",
      "type": "story",
      "url": "https://godotengine.org/article/announcing-gogodotjam-2"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 29106109,
      "score": 1,
      "time": 1636027875,
      "title": "APL Since 1978 (Roger Hui and Morten Kromberg)",
      "type": "story",
      "url": "https://www.pldi21.org/prerecorded_hopl.2.html"
    },
    {
      "by": "vklmn",
      "descendants": 0,
      "id": 29106082,
      "score": 5,
      "text": "Hey HN! Vlad here with Sergey, Ildar, and Kirill. We are building Jitsu, an open-source Segment alternative (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;jitsucom&#x2F;jitsu\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;jitsucom&#x2F;jitsu</a>, <a href=\"https:&#x2F;&#x2F;jitsu.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jitsu.com&#x2F;</a>). We help companies collect events from their apps, websites, and APIs and send them to databases.<p>I&#x27;ve been doing data engineering for more than ten years (half of that time, I didn&#x27;t know that it&#x27;s called &quot;data engineering”). Before Jitsu, I was a co-founder and CTO of GetIntent, an ad-tech startup. Although it was ad-tech (I&#x27;m sorry for that!), we also built a quite fascinating technology platform. We processed up to 1 million events per second at peak, and all those events needed to be stored somewhere.<p>We churned through a few data warehouse platforms along the way. In 2013, we started with Hadoop&#x27;s HDFS and a bunch of map-reduce jobs on top of it. Then, when we decided to allow our customers to run ad-hoc reports, we switched to BigQuery. BigQuery was great, but expensive—especially with some customers obsessively clicking the refresh button. Finally, in 2017 we migrated to self-hosted ClickHouse which in my opinion is still the best analytics database in the world.<p>All that time, we spent a fair amount of effort to get data to the database. When you&#x27;re dealing with millions of events per minute, running an INSERT statement per event won&#x27;t work. What if the DB is down for maintenance? How can you be sure that all 50+ edge nodes are aware of recent DB schema changes? Also, did you know streaming data to BigQuery is costly while batching data is free?<p>We tried different approaches: first, we would write local log files, sync them to HDFS, and load data to BQ (or ClickHouse) with map-reduce jobs. To improve data freshness, we ditched HDFS and started to send data in batches to the DB directly from edge servers. We experimented with Kafka, but it felt too complex for that task at the time.<p>I always dreamed about a straightforward service, to which I&#x27;d throw JSON objects, and it would take care of the rest: queueing, retrying, updating database schema, etc.<p>Then I discovered Segment. I liked it at first. It seemed very developer-friendly with a nice API and excellent documentation. But the pricing model and data delays (the event gets to DB in 12 hours after it has been sent to Segment) killed the whole idea. And it was not open-sourced. In my opinion, being open-source and self-hostable is a must for such a fundamental part of the architecture as data collection.<p>I left GetIntent and got accepted to YC with a different idea for the Summer 2020 batch. The idea was to build a churn prevention and BI tool for online retailers. It didn&#x27;t take off, but in the process we made a component to collect customer&#x27;s app events and put it to DB. We tried to hack a solution on top of the ELK stack, but I was frustrated with ElasticSearch’s lack of SQL support.  Here I was back to square one: there&#x27;s no good open-source event collection service yet, and we needed to build one, once again.<p>So we decided to focus solely on that problem. We ditched all the previous code, which was in Java, rewrote the data collection server in Go and hacked together what we called EventNative [1]. It was received very well, and we started to get users.<p>Over the last 11 months, we&#x27;ve been busy building the UI, adding Connectors (to pull data from external APIs), polishing data warehouse support, adding javascript support to transform incoming data, and implementing dozens of other features.<p>Now we&#x27;re launching Jitsu, an open-source Segment alternative. With Jitsu, we make it easy to collect data and send it to databases (we support all major players: ClickHouse, Redshift, Snowflake, BigQuery and Postgres). We’re deployed in production, including into a large gaming publisher, eSignature service, and many other great companies.  We&#x27;re going for an open-core model. So far we don&#x27;t have paid features, but soon we&#x27;ll have some, presumably around things like authorization and data masking. Also we run Jitsu.Cloud[2] which you can buy if you don’t want to self-host<p>Give it a spin: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;jitsucom&#x2F;jitsu\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;jitsucom&#x2F;jitsu</a>.<p>Thank you for reading this story - I hope it was interesting. I would love to read your feedback on Jitsu and answer questions!<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24120325\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=24120325</a>\n[2] <a href=\"https:&#x2F;&#x2F;cloud.jitsu.com\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.jitsu.com</a>",
      "time": 1636027652,
      "title": "Launch HN: Jitsu (YC S20) – Open-Source Segment Alternative",
      "type": "story"
    },
    {
      "by": "finite_jest",
      "descendants": 0,
      "id": 29106064,
      "score": 1,
      "time": 1636027507,
      "title": "The Math of Hunting Lions",
      "type": "story",
      "url": "https://www.gwern.net/notes/Lions"
    }
  ]
}