{
  "stories": [
    {
      "by": "edward",
      "descendants": 0,
      "id": 31080130,
      "score": 1,
      "time": 1650348696,
      "title": "PineBuds are wireless earbuds with user-flashable firmware from Pine64",
      "type": "story",
      "url": "https://liliputing.com/2022/04/pinebuds-are-wireless-earbuds-with-user-flashable-firmware-from-open-hardware-maker-pine64-coming-eventually.html"
    },
    {
      "by": "narolainfotech",
      "descendants": 0,
      "id": 31080104,
      "score": 1,
      "time": 1650348270,
      "title": "Mobile App Development Company",
      "type": "story",
      "url": "https://www.narolainfotech.com/services/mobile-app-development-company/"
    },
    {
      "by": "narolainfotech",
      "descendants": 0,
      "id": 31080101,
      "score": 1,
      "time": 1650348239,
      "title": "How Mobile App Development Is Helping the Healthcare Industry?",
      "type": "story",
      "url": "https://www.narolainfotech.com/blogs/mobile-app-development-help-healthcare-industry/"
    },
    {
      "by": "tintinnabula",
      "descendants": 0,
      "id": 31080097,
      "score": 1,
      "time": 1650348203,
      "title": "Saving the Sounds of the Early 20th Century",
      "type": "story",
      "url": "https://www.atlasobscura.com/articles/library-wax-cylinder-digitize-machine"
    },
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 31080093,
      "score": 1,
      "time": 1650348162,
      "title": "Donbas: Why Russia is trying to encircle Ukraine's east",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-60938544"
    },
    {
      "by": "eimrine",
      "descendants": 0,
      "id": 31080090,
      "score": 1,
      "text": "My friend (not from HN crowd) has a baby less then 1yo and I help them both a little. My focus is introducing kid to Liberal Arts and English and one more thing: as we all know, that age is old enough to introduce a person to computers. My requirement is x86 with GNU&#x2F;Linux, hardware is not interesting part of problem but definitely it will be super cheap - so it easily may be not 64bit.<p>The goals the computer will perform:<p>1. Run some easy-peasy courses from Khan Academy or similar (if someone pays their Internet access)<p>2. Listen to some pre-downloaded videos from yt and censored music from pirate trackers.<p>3. Learn some CLI utilites. The first I think will be GNU Units, second must be some text editor.<p>4. First PL, it must be not my choice but the kid&#x27;s one.<p>Please help me to chose distro literally for babies. No bloatware, no autoupdater and if possible no GUI. Browser with mouse and maybe some typing courses requires GUI, but at least browser may be called from CLI.<p>No childish crap like cartoon pictures or whatever else considered to be enough childish. Nowadays all childish stuff like &quot;yt for kids&quot; obvious is as euphemism of &quot;yt for idiots&quot; and I am going to resist that malculture as long as possible.<p>No need of autoupdate because of absolutely no fear to catch malware, I think the computer will rather be destroyed physically than pwned. The only update needed is maybe some certs for https security theatre to let the Khan Academy work in future without changing much in OS.<p>Also I want the simplest file set possible, I mean as less files on &#x2F;dev&#x2F;sda as possible. Sorry if I ask something silly, I hope the goal is defined correctly.<p>If such distro does not exist please give me advices from what distro to start, what may be removed and how to remove that if complicated. I hope I have some time for tinkering with building a new distro, but I would prefer not to do a lot of that job. Of course I am going to spend at least 7h weekly for that teaching.<p>I am absolutely not a power-user of any UNIX utilites or Linux distros so I have some hesitations of which free and open source programs to install and what free and open-source software to avoid for making the system as learnable as possible and as not-gameable as possible also.",
      "time": 1650348107,
      "title": "Ask HN: GNU/Linux Distro for a Baby",
      "type": "story"
    },
    {
      "by": "itvision",
      "descendants": 0,
      "id": 31080088,
      "score": 1,
      "time": 1650348060,
      "title": "Linux Myths Series: Linux community is welcoming",
      "type": "story",
      "url": "https://itvision.altervista.org/linux-myths-series-linux-community.html"
    },
    {
      "by": "viburnum",
      "descendants": 0,
      "id": 31080068,
      "score": 1,
      "time": 1650347693,
      "title": "US Supreme Court cites computational literary studies",
      "type": "story",
      "url": "https://twitter.com/dexterauthor/status/1516237284080824323"
    },
    {
      "by": "skilled",
      "descendants": 0,
      "id": 31080040,
      "score": 1,
      "time": 1650347235,
      "title": "Taxonomy of In-the-Wild Exploitation",
      "type": "story",
      "url": "https://noncombatant.org/2022/04/22/itw-taxonomy/"
    },
    {
      "by": "jmercouris",
      "descendants": 0,
      "id": 31080037,
      "score": 1,
      "time": 1650347176,
      "title": "Why should I care about Gopher?",
      "type": "story",
      "url": "https://nyxt.atlas.engineer/article/gopher.org"
    }
  ]
}