{
  "stories": [
    {
      "by": "lawrenceyan",
      "descendants": 0,
      "id": 28397897,
      "score": 1,
      "time": 1630619853,
      "title": "Made for Work [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Jycdks836bY"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 28397893,
      "score": 1,
      "time": 1630619847,
      "title": "Joker",
      "type": "story",
      "url": "https://joker-lang.org/"
    },
    {
      "by": "avastmick",
      "descendants": 0,
      "id": 28397885,
      "kids": [
        28397904
      ],
      "score": 2,
      "time": 1630619801,
      "title": "The bias that makes innocent emails seem offensive",
      "type": "story",
      "url": "https://www.bbc.com/worklife/article/20210830-why-emails-often-read-more-negative-than-they-actually-are"
    },
    {
      "by": "johntb86",
      "descendants": 0,
      "id": 28397863,
      "score": 2,
      "time": 1630619653,
      "title": "Apod: 2013 August 1 – Moon over Andromeda",
      "type": "story",
      "url": "https://apod.nasa.gov/apod/ap130801.html"
    },
    {
      "by": "indiantinker",
      "descendants": 0,
      "id": 28397859,
      "score": 1,
      "time": 1630619639,
      "title": "How Indian edtech giant Byju’s fuels its meteoric rise",
      "type": "story",
      "url": "https://restofworld.org/2021/inside-india-edtech-byjus/"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 28397850,
      "score": 1,
      "time": 1630619587,
      "title": "FAA Investigates If It's Safer to Leave Cellphones On",
      "type": "story",
      "url": "https://spectrum.ieee.org/cellphones-turned-on-for-flight"
    },
    {
      "by": "codetrotter",
      "descendants": 1,
      "id": 28397841,
      "kids": [
        28397844
      ],
      "score": 1,
      "time": 1630619529,
      "title": "How to Get Cross Browser Compatibility Every Time (2008)",
      "type": "story",
      "url": "https://web.archive.org/web/20091228175610/http://anthonyshort.com.au/blog/comments/how-to-get-cross-browser-compatibility-everytime/"
    },
    {
      "by": "winter__mute",
      "descendants": 0,
      "id": 28397823,
      "score": 1,
      "time": 1630619426,
      "title": "How to Contribute to Ruby on Rails with Rafael França",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=qaQMQh1Ij5E"
    },
    {
      "by": "swiftle",
      "descendants": 0,
      "id": 28397822,
      "score": 1,
      "text": "My name is Igor Ozerov, and I&#x27;m a founder of Swiftle,   a service for selecting developers and designers. I would like to tell you about how we implement low-code projects, and how we turned from an ordinary studio into a service platform.<p>How we’re building an Uber for the low-code world\nOur platform provides the basis for initial interactions with potential clients: filling out a project brief and discussing its conditions with developers, paying for services and receiving documents.<p>Here’s how it works: after checking out our website and going through the ultra-simple registration process, a potential customer can fill out a description of their project and quickly receive a development offer in their personal account (which is just part of the platform). There’s also an interactive constructor for creating technical specifications which makes it even easier: the client can choose what type of project they want (website, mobile app, automation), their preferred tool (if they have an idea of   how they want to implement the project), describe the desired functionality and requirements in user story format, and share their vision (e.g., &quot;I want to make an Airbnb for digital nomads on Mars&quot;) and design concept. After that, a call is scheduled where the customer meets the contractor and discusses the project and terms in more detail. After agreeing on all the details, the client selects one of the service plans, makes a payment, and we begin development. After that, the project is discussed on the platform. Plus, we integrate the platform with Telegram so people can choose where it is more convenient to communicate.<p>https:&#x2F;&#x2F;app.swiftle.io&#x2F;<p>So far it’s an internal tool, but we see great prospects for scaling it and turning it into a kind of service that connects customers and developers from all over the world. Our goal for next year is to improve the interface for external developers and entire teams so they will be able to search for orders on the platform. It’ll be like an Uber service for the world of low-code development.\nCurrently, contractors are selected from our team based on experience, but soon the platform will become open (in the next 3-6 months) and we will introduce a rating system for developers based on portfolio, completed projects, and scope of competencies. Customers will be able to choose contractors themselves, and the system will make recommendations.<p>All our current clients submit their projects through our platform. We can say that it’s a great tool for introverts who don’t like long calls and negotiations, but still know exactly what they need and are looking for a reliable contractor, which can be found in the Swiftle team.",
      "time": 1630619422,
      "title": "We’re building an Uber for the Low-code world",
      "type": "story"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 28397814,
      "score": 2,
      "time": 1630619395,
      "title": "Lisp/Scheme Resources",
      "type": "story",
      "url": "https://taoofmac.com/space/dev/lisp"
    }
  ]
}