{
  "stories": [
    {
      "by": "anarbadalov",
      "descendants": 0,
      "id": 30352861,
      "score": 1,
      "time": 1644959891,
      "title": "Routine Maintenance: Embracing habit in an automated world",
      "type": "story",
      "url": "https://harpers.org/archive/2022/01/routine-maintenance-embracing-habit-in-an-automated-world-meghan-ogieblyn/"
    },
    {
      "by": "lukashed",
      "descendants": 0,
      "id": 30352820,
      "score": 2,
      "text": "I just received the following email:<p>Hi [username],<p>We&#x27;re writing to let you know that between January 2021 and September 2021, the following information about your repository was inadvertently made publicly viewable after being sent to a third-party vendor as part of metadata analysis of GitHub Pages sites; the name of the private repository and the GitHub username with ownership of the repository. No repository content or other private data was exposed as part of this incident.<p>User privacy and security are essential for maintaining trust, and we want to remain as transparent as possible about events like these. GitHub itself did not experience a compromise or data breach as a result of this event, nor did unauthorized users gain access to repositories. Read on for more information.<p>* What happened? *<p>GitHub learned from an internal discovery by a GitHub employee, that GitHub Pages sites published from private repositories on GitHub were being sent to urlscan.io for metadata analysis as part of an automated process. This internal process was implemented before the private GitHub Pages feature was released and provides metadata that is used during human review of potentially malicious or abusive GitHub Pages sites.<p>To view the name of the private repository on urlscan.io, you would need to have been looking at the front page of urlscan.io within approximately 30 seconds of the analysis being performed or have specifically searched using a query that would return the analysis in the search results.<p>* What information was involved? *<p>The following URLs, but no content, were made publicly viewable:<p>GitHub Pages URLs\n[link containing username and name of private GH repository]<p>* What GitHub is doing *<p>GitHub immediately began work on fixing the automated process that sends GitHub Pages sites for metadata analysis so that only public GitHub Pages sites are sent for analysis. Future analysis of public GitHub Pages sites will be unlisted from public view as an additional protection.<p>We also worked with the third-party vendor, urlscan.io, to delete all existing public records of private GitHub Pages sites generated from this situation.<p>* What you can do *<p>No action is required on your end; we have updated our systems and worked with our third-party vendor to ensure this data is no longer publicly viewable.<p>Please feel free to reach out to us with any additional questions or concerns through the following contact form:",
      "time": 1644959725,
      "title": "GitHub leaked names of private repositories",
      "type": "story"
    },
    {
      "by": "anonfounder747",
      "descendants": 1,
      "id": 30352798,
      "kids": [
        30352865
      ],
      "score": 1,
      "text": "I&#x27;m a solo developer with an identical product to a well-funded competitor ABC (has crazy momentum). The competitor is well-loved and widely recognized in the market.<p>When I describe my startup to anyone they ask &quot;how is this different from ABC?&quot;.<p>Being solo and the startup being my main occupation and ambitions to scale, it is very discouraging to hear time and again that what I&#x27;ve built is similar in most important aspects to ABC.<p>I have paying users, but operate at probably 1&#x2F;1000th the scale of ABC.<p>I would work on narrowing my target audience and building for them, but results are not guaranteed. At this point I would like some certainty that my efforts will pay off, but honestly, I don&#x27;t think I can expect that.<p>I&#x27;m pretty frustrated with the risk I&#x27;ve taken on so far and the years of effort I&#x27;ve put into it, only to end up a clone.<p>That said, I think this situation is probably familiar to those new calendar-booking apps, email apps, etc. They&#x27;ve found a way to stand out despite the presence of calendly, gmail, etc. I take inspiration from them and will carry on trying to find differentiation.<p>My question goes out to anyone familiar with this situation: how do you change your product strategy to be successful despite an 800-lb gorilla in your market?<p>Regardless of my question, if you have words of motivation or general advice, please share that too. I could use some positive energy from the universe today.",
      "time": 1644959613,
      "title": "Ask HN: How to differentiate my business from a competitor with crazy momentum?",
      "type": "story"
    },
    {
      "by": "marc__1",
      "descendants": 0,
      "id": 30352797,
      "score": 1,
      "time": 1644959605,
      "title": "Upstart Announces 4Q and FY 2021 Results, share repurchase program",
      "type": "story",
      "url": "https://ir.upstart.com/news-releases/news-release-details/upstart-announces-fourth-quarter-and-full-year-2021-results/"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 30352793,
      "score": 1,
      "time": 1644959593,
      "title": "Estimated computation used in large training runs of AI systems",
      "type": "story",
      "url": "https://ourworldindata.org/grapher/ai-training-computation"
    },
    {
      "by": "vmception",
      "descendants": 1,
      "id": 30352790,
      "kids": [
        30352814
      ],
      "score": 1,
      "time": 1644959589,
      "title": "ConocoPhillips Is Supplying a Bitcoin Miner with Gas from Bakken",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-02-15/conocophillips-says-it-s-sending-bakken-gas-to-bitcoin-processor"
    },
    {
      "by": "JordanTen",
      "descendants": 0,
      "id": 30352788,
      "score": 2,
      "time": 1644959572,
      "title": "SpiceDB – System for Managing Security-Critical Application Permissions",
      "type": "story",
      "url": "https://github.com/authzed/spicedb"
    },
    {
      "by": "nycdatasci",
      "descendants": 2,
      "id": 30352772,
      "kids": [
        30352870,
        30352827
      ],
      "score": 35,
      "time": 1644959456,
      "title": "Akamai to Acquire Linode",
      "type": "story",
      "url": "https://www.akamai.com/newsroom/press-release/akamai-to-acquire-linode"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30352755,
      "score": 1,
      "time": 1644959353,
      "title": "Playing as if dropping stories (2018)",
      "type": "story",
      "url": "https://www.yhousenyc.org/yhouse-blog/all-posts/2018-3-12/playing-as-if-dropping-stories"
    },
    {
      "by": "vlindos",
      "descendants": 0,
      "id": 30352747,
      "score": 1,
      "time": 1644959294,
      "title": "Married couple steals billion in Bitcoin",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=GR3rUlDiMxY"
    }
  ]
}