{
  "stories": [
    {
      "by": "fnordpiglet",
      "descendants": 0,
      "id": 31610831,
      "score": 1,
      "time": 1654275534,
      "title": "Seattle police stopped investigating new adult sexual assaults this year",
      "type": "story",
      "url": "https://www.seattletimes.com/seattle-news/times-watchdog/seattle-police-halted-investigating-adult-sexual-assaults-this-year-internal-memo-shows/"
    },
    {
      "by": "meanjean",
      "descendants": 0,
      "id": 31610823,
      "score": 1,
      "text": "Sandbox provides Banking as a Service (BaaS) infrastructure for fintechs and banks. We help institutions quickly and securely integrate new software. We are growing quickly, YC backed, and possess an enviable runway. Our team is looking to hire exceptional individuals for the following:<p>Solution Delivery Engineering Manager (https:&#x2F;&#x2F;sandboxbanking.com&#x2F;2021&#x2F;06&#x2F;11&#x2F;solution-delivery-engineering-manager&#x2F;) Will lead a team of seasoned and talented engineers that is focused on developing integrations between banking systems for client institutions<p>Solution Delivery Engineer (https:&#x2F;&#x2F;sandboxbanking.com&#x2F;2021&#x2F;04&#x2F;30&#x2F;solution-delivery-software-engineer&#x2F;) Will scope requirements, develop, test and deploy specific customer integrations using our Glyue platform<p>Project Manager \n(https:&#x2F;&#x2F;sandboxbanking.com&#x2F;2021&#x2F;07&#x2F;30&#x2F;project-manager-remote&#x2F;)  will handle a variety of tasks required to deliver a successful implementation of Sandbox that powers the integration between a fintech’s software and a FI’s systems",
      "time": 1654275503,
      "title": "Sandbox Banking (YC W17) | Is Hiring – Full-Time – Remote",
      "type": "story"
    },
    {
      "by": "nojito",
      "descendants": 0,
      "id": 31610779,
      "score": 1,
      "time": 1654275286,
      "title": "Fastverse High-Performance and Low-Dependency Package for Data Manipulation in R",
      "type": "story",
      "url": "https://github.com/fastverse/fastverse"
    },
    {
      "by": "cfreire",
      "descendants": 0,
      "id": 31610746,
      "score": 1,
      "time": 1654275066,
      "title": "Engineering onboarding matters, and it’s not working in a lot of places",
      "type": "story",
      "url": "https://medium.com/guidewire-engineering-blog/a-hackathon-a-new-office-and-engineering-onboarding-e6b13c3baedd"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 31610726,
      "score": 2,
      "time": 1654274956,
      "title": "Apple Silicon “Augury” DMP Vulnerability",
      "type": "story",
      "url": "https://mjtsai.com/blog/2022/06/03/apple-silicon-augury-dmp-vulnerability/"
    },
    {
      "by": "xoelop",
      "descendants": 1,
      "id": 31610709,
      "kids": [
        31610720
      ],
      "score": 1,
      "time": 1654274891,
      "title": "Free tool to monitor Scrapy spiders",
      "type": "story",
      "url": "https://scrapeops.io//"
    },
    {
      "by": "preordained",
      "descendants": 1,
      "id": 31610706,
      "kids": [
        31610765
      ],
      "score": 1,
      "text": "Dilemma I never expected to find myself in. As a dev, I&#x27;ve always prided myself on doing a good job on (or at least making a good dent in) whatever is put in front of me. In my current role, I initially got plenty of opportunities to do just that, which ended up with me being promoted and other boons to my career trajectory. Then, somehow or another, projects on my team just dried up. Only been here about two years and not sure if these sort of dry spells really happen naturally, but nothing substantial has come to (or been solicited by our team lead) in about 2-3 months. There has been the odd snack-sized project, and some trivial tickets to pick out of the backlog, but we seem to be twiddling our thumbs a lot. Other teams (appear at least) much busier, and what&#x27;s more we added a new team member in the midst of this!<p>I actually like my job and work (when it&#x27;s available), I&#x27;d like to try and get out of this &quot;jam&quot; without doing something drastic. My initial ideas are:<p>1. Talk to my team lead about getting more work.\n2. Talk to my manager (who oddly leads other teams) about the situation&#x2F;options<p>3. Scrounge and dig for any meaningful work I can, concocting some if I must (been doing this...sucks)<p>Admittedly, I&#x27;m not great with people and I&#x27;ve never been in a spell like this that didn&#x27;t resolve itself naturally (didn&#x27;t have to force some issue). I&#x27;d like to accomplish 1&#x2F;2 without making things weird if at all possible. Is there anything else I should know about these things to avoid stepping on a land mine? Are there options I haven&#x27;t considered?",
      "time": 1654274883,
      "title": "Ask HN: I Need more work, what to do?",
      "type": "story"
    },
    {
      "by": "awmarthur",
      "descendants": 0,
      "id": 31610701,
      "score": 1,
      "time": 1654274861,
      "title": "SQLite Diff vs. Dolt Diff",
      "type": "story",
      "url": "https://www.dolthub.com/blog/2022-06-03-dolt-diff-vs-sqlite-diff/"
    },
    {
      "by": "eaglehead",
      "descendants": 0,
      "id": 31610693,
      "score": 1,
      "text": "My startup got acquired last year and as part of acquisition the entire team got to join the new company.<p>The company that acquired us is a Fortune 10 company, and we were a very small team. So you can imagine that we just dissolved inside the large team.<p>Since acquisition, I have been personally struggling to stay productive. I feel like I am isolated from all the action and now working on extremely high-level discussions which is obviously a lot different than what I was doing for past decade or so.<p>I feel like an imposter sitting through these leadership calls as if I don&#x27;t belong here? It&#x27;s a bit hard to explain feeling. I am constantly questioning myself on &quot;is this how the large companies work?&quot;<p>As a founder, I was involved in every aspect of my business, dev, sales, customer support, HR, etc. And now I feel like I have a &quot;ceremonial&quot; title with no legs.<p>Anyone else who went through an acquisition felt this way?",
      "time": 1654274833,
      "title": "Ask HN: Adjustment After Startup Acquisition",
      "type": "story"
    },
    {
      "by": "nabla9",
      "descendants": 0,
      "id": 31610644,
      "score": 2,
      "time": 1654274580,
      "title": "GPT-4chan The most horrible model on the internet",
      "type": "story",
      "url": "https://gpt-4chan.com/home"
    }
  ]
}