{
  "stories": [
    {
      "by": "houqp",
      "descendants": 0,
      "id": 28249532,
      "score": 1,
      "time": 1629483594,
      "title": "Datafusion 5.0.0 release with major new features and performance improvements",
      "type": "story",
      "url": "https://arrow.apache.org/blog/2021/08/18/datafusion-5.0.0/"
    },
    {
      "by": "anzhelikam",
      "descendants": 0,
      "id": 28249482,
      "score": 1,
      "text": "Hey all,\nI wanted to share with you this cool platform for developers that lets you build conversational AI apps in a matter of hours. Even a non-developer can build a demo app in less than 2 hours.<p>Why is Dasha unique?<p>* We have our own intuitive programming language - DashaScript. It&#x27;s an event-driven language intended to describe a conversation script.<p>* We created Dasha Studio, an extension to VSCode. You use the studio to create your conversational script, it gives you syntax analysis and highlight. There&#x27;s also a visual graph editor.<p>* Dasha CLI that lets you log in and get your API key that you can then use to execute conversational AI apps, and get diagnostic information about current usage, queues, and limits on Dasha Cloud Platform side.<p>* Dasha Cloud provides conversational AI as a service, which means that you don’t need to be a machine learning engineer to use machine learning when building Dasha conversational apps.<p>* We use GRPC for communication between SDK and the Dasha Cloud (more on that here https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F;blog&#x2F;conversational-application)<p>What apps can you build?<p>To illustrate how to build a conversational app and show its capabilities, here&#x27;s an tutorial on how to get started developing your first conversational AI app: https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F;blog&#x2F;build-conversational-AI-app-1<p>You can create apps for free, so give it a try: https:&#x2F;&#x2F;dasha.ai&#x2F;en-us&#x2F; (just click on &quot;API key&quot; button and we&#x27;ll provide you one so you can start building)<p>Also, we&#x27;re hiring a DevRel, so if you are one or know one, apply or reach out! https:&#x2F;&#x2F;www.notion.so&#x2F;dashaai&#x2F;Dasha-is-hiring-6f2156ae251e4e9b94c841fff4fcd976",
      "time": 1629483347,
      "title": "Show HN: Developing conversational AI apps in less than 2 hours with Dasha",
      "type": "story"
    },
    {
      "by": "hiddencache",
      "descendants": 1,
      "id": 28249475,
      "kids": [
        28249502
      ],
      "score": 2,
      "time": 1629483328,
      "title": "What if our Universe is a sequel?",
      "type": "story",
      "url": "https://www.bbc.com/future/article/20200117-what-if-the-universe-has-no-end"
    },
    {
      "by": "flamecoals",
      "descendants": 1,
      "id": 28249468,
      "kids": [
        28249506
      ],
      "score": 2,
      "text": "Hello HN,<p>I have started FBG some years ago when I moved to the Bay Area and could not find a simple, cross-platform, no-registration way to play board games with my friends back in my home country. I also wanted to make it simple to create multiplayer board games online for developers in their free time.<p>Shortly after, I found out about boardgame.io with similar goals and decided to join forces with them. It became the engine of our board games, and we focused on publishing&#x2F;serving them. To be fair with everyone and inspired by Wikipedia, we made the project a non-profit with GPLv3 Affero license.<p>Since then, the project has gotten many amazing contributors that developed really cool board games, added translations, helped with infra, etc (see https:&#x2F;&#x2F;www.freeboardgames.org&#x2F;en&#x2F;about ...). My focus has been on the infrastructure (scaling, adding text chat, etc).<p>During the pandemic, we saw a large 30x increase in usage, and it also became more useful for me, as I started using it at work for (now virtual) fun team meeting events.<p>Please check it out and give any feedback! I&#x27;ve been postponing submitting on HN for a long time because I always felt it &quot;wasn&#x27;t ready enough&quot; as there are a ton of rough edges, but I came to the realization that this feeling might never go away.",
      "time": 1629483292,
      "title": "Show HN: FreeBoardGames.org – FOSS platform for publishing boardgame.io games",
      "type": "story"
    },
    {
      "by": "remvee",
      "descendants": 0,
      "id": 28249458,
      "score": 1,
      "time": 1629483246,
      "title": "Reuse: Make licensing easy for humans and machines alike",
      "type": "story",
      "url": "https://reuse.software/"
    },
    {
      "by": "pramsey",
      "descendants": 0,
      "id": 28249414,
      "score": 1,
      "time": 1629483040,
      "title": "Cloud Raster and Postgres / Postgis",
      "type": "story",
      "url": "https://blog.crunchydata.com/blog/waiting-for-postgis-3.2-secure-cloud-raster-access"
    },
    {
      "by": "carvem",
      "descendants": 0,
      "id": 28249398,
      "score": 1,
      "time": 1629482985,
      "title": "Vqgan and Clip: AI Generated Art",
      "type": "story",
      "url": "https://huggingface.co/spaces/akhaliq/VQGAN_CLIP"
    },
    {
      "by": "brunoluiz",
      "descendants": 0,
      "id": 28249386,
      "score": 1,
      "time": 1629482929,
      "title": "Modern web apps without JavaScript bundling or transpiling",
      "type": "story",
      "url": "https://world.hey.com/dhh/modern-web-apps-without-javascript-bundling-or-transpiling-a20f2755"
    },
    {
      "by": "drdee",
      "descendants": 0,
      "id": 28249363,
      "score": 1,
      "time": 1629482805,
      "title": "Wayne Woolley’s Marvelously Equipped Mind: blind biochemist who worked with LSD",
      "type": "story",
      "url": "https://www.sciencehistory.org/distillations/wayne-woolleys-marvelously-equipped-mind"
    },
    {
      "by": "billippio",
      "descendants": 0,
      "id": 28249343,
      "score": 1,
      "text": "Learn from a predatory loan victim and just teach yourself to program. Hindsight is 20&#x2F;20.<p>I get it; I made a bad decision and signed a $30k contract for for 7 months of &quot;Education&quot; under the guided assumption I would immediately (or at least quickly) get a job after with my newly developed skills (Web Development(Node.React)&#x2F;Computer Science Track 2018). I was poor af at the time and $50k a year was way more than I could ever make doing what I was doing. \nThis did not happen. I did not get a job making over $50k.\nAfter several months, I took a crap PHP job making $12 an hour. A family member worked for the company and got me the job. I figured, at least I&#x27;d be learning a new skill and decided it was better than making considerably more money bartending.<p>I worked there full-time for a year and then part-time for another year leveling up my PHP&#x2F;Laravel skills as well as devoppsy stuff (They had their own server. It was actually pretty cool). The reason I went part-time was to pursue a crypto venture with some friends, also written in PHP&#x2F;Laravel but included Vue as well. I got pretty proficient in Vue over the year and had that project as well as some others to show for it. Using these projects in my portfolio, I landed a much better job.\nI started doing some Vue contract work for an actual software company and, after a few months, they hired me full-time.<p>2021, over two years after completing Lambda School, I got a over $50k paying job which I was qualified for due to my two years of programming experience. For, the icing on top, the past two years haven&#x27;t even been related to what the Lambda curriculum was. I haven&#x27;t even used those technologies since 2018.<p>Here I am now, obligated to pay %17 percent of my pretax income for a course I did years ago that didn&#x27;t help me at all get to where I am now. How is that fair? I&#x27;m pretty sure I have no legal basis as a contract is a contract, but this is just wrong.<p>There has to be many people in this same boat; A lot can happen in 2 years, let alone 5! I&#x27;d like to hear some feedback on this.",
      "time": 1629482728,
      "title": "Lambda School ISA terms have a 5 year enforcment term. How is that justifiable?",
      "type": "story"
    }
  ]
}