{
  "stories": [
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 28591080,
      "score": 1,
      "time": 1632122419,
      "title": "Commodore 1541 Drive Talk: A Deep Dive into Disks Controllers and More",
      "type": "story",
      "url": "https://hackaday.com/2021/09/19/the-ultimate-commodore-1541-drive-talk-a-deep-dive-into-disks-controllers-and-much-more/"
    },
    {
      "by": "panabee",
      "descendants": 1,
      "id": 28591064,
      "kids": [
        28591072
      ],
      "score": 1,
      "time": 1632122242,
      "title": "Engineered mini CRISPR-Cas system for mammalian genome regulation and editing",
      "type": "story",
      "url": "https://secure.jbs.elsevierhealth.com/action/cookieAbsent"
    },
    {
      "by": "onderkalaci",
      "descendants": 0,
      "id": 28591058,
      "score": 1,
      "time": 1632122150,
      "title": "What’s new in the Citus 10.2 extension to Postgres",
      "type": "story",
      "url": "https://www.citusdata.com/blog/2021/09/17/citus-10-2-extension-to-postgres-whats-new/"
    },
    {
      "by": "fractalb",
      "descendants": 0,
      "id": 28591046,
      "score": 1,
      "time": 1632121994,
      "title": "GMP: The GNU Multiple Precision Arithmetic Library",
      "type": "story",
      "url": "https://gmplib.org/"
    },
    {
      "by": "humancentered",
      "descendants": 0,
      "id": 28591035,
      "score": 1,
      "time": 1632121808,
      "title": "Identifying Worm Holes and Asteroids in the Cryptoverse",
      "type": "story",
      "url": "https://futurecenter.substack.com/p/identifying-worm-holes-and-asteroids"
    },
    {
      "by": "yinso",
      "descendants": 0,
      "id": 28591031,
      "score": 1,
      "time": 1632121778,
      "title": "Rendezvous Hashing Explained",
      "type": "story",
      "url": "https://randorithms.com/2020/12/26/rendezvous-hashing.html"
    },
    {
      "by": "Jay1234",
      "descendants": 0,
      "id": 28591030,
      "score": 1,
      "text": "Coinbase has inked its second deal to develop software for the U.S. Immigration and Customs Enforcement agency since August.\nCoinbase signs new $1.36M contract with US Customs enforcement agency\nNEWS\nLeading U.S. cryptocurrency exchange Coinbase has secured a contract to develop tech for the Department of Homeland Security worth as much as $1.36 million.<p>Under the agreement, Coinbase has been contracted to deliver “application development software as a service” for the U.S. Immigration and Customs Enforcement division (ICE).<p>The contract took effect on Sept. 16 and will see Coinbase receive $455,000 from the department. However, the contract could be extended to last for up to three years in total, which would see Coinbase receive up to roughly $1.36 million.<p>The deal is the second partnership inked between Coinbase and ICE, with the exchange having secured a $30,000 contract to provide “computer forensics services” to the agency in August.<p>The news has received backlash from the crypto community, with Human Rights Foundation chief strategy officer Alex Gladstein asserting the compensation is relatively low given the scale of Coinbase’s operations and the reputation risk posed to the exchange by the partnership:<p>“This isn’t very much money for Coinbase in the grand scheme of things. Strange that they would risk much reputationally such a relatively small sum.”\nThe news has also resurrected criticisms concerning Coinbase’s 2019 acquisition of blockchain analytics startup, Neutrino.<p>During the year of the acquisition, it was reported that the people behind Neutrino had previously been part of Hacking Team — a company revealed to have helped authoritarian regimes to spy on journalists.<p>Neutrino CEO, Giancarlo Russo, was the ex-COO of Hacking Team while its CTO, Alberto Ornaghi, was at the company for more than 8 years. According to the Washington Post, the Italian company was implicated in the murder of a number of journalists in the Middle East between 2013 and 2018.<p>In March 2019, Coinbase CEO Brian Armstrong said that Neutrino staff with prior connections to controversial firm Hacking Team would transition out of their new roles at the exchange.<p>Responding to Coinbase’s new contract with ICE, Kraken CEO Jesse Powell, tweeted:<p>“Even more bizarre is the acquisition they made and reputational hit they took to be able to offer this service to the government.”\nRelated: Coinbase CEO Defends Licensing of Analytics Platform to Gov’t Agencies<p>Since its acquisition of Neutrino, Coinbase has also inked contracts with the U.S. Secret Service — which announced the creation of a Cyber Fraud Task Force in July 2020. The task force has been mandated to investigate the use of cryptocurrency for criminal purposes, stating later that year:<p>“Cryptocurrency presents a troubling new opportunity for individuals and rogue states to avoid international sanctions and to undermine traditional financial markets, thereby harming the interests of the United States and its allies.”\nCoinbase is currently embroiled in a regulatory tussle with the Securities Exchange Commission, with the regulator taking umbrage with its planned stablecoin lending product and threatening to take the company to court.",
      "time": 1632121766,
      "title": "Coinbase signs new $1.36M contract with US Customs enforcement agency",
      "type": "story"
    },
    {
      "by": "lewisflude",
      "descendants": 0,
      "id": 28590987,
      "score": 1,
      "time": 1632121281,
      "title": "The last days of Silicon Roundabout",
      "type": "story",
      "url": "https://www.newstatesman.com/science-tech/2021/09/the-last-days-of-silicon-roundabout"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28590986,
      "score": 1,
      "time": 1632121266,
      "title": "In which I misunderstood Objective-C",
      "type": "story",
      "url": "https://www.sicpers.info/2021/09/in-which-i-misunderstood-objective-c/"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 28590978,
      "score": 1,
      "time": 1632121166,
      "title": "Improving Python Dependency Management with Pipx and Poetry",
      "type": "story",
      "url": "https://cedaei.com/posts/python-poetry-pipx/"
    }
  ]
}