{
  "stories": [
    {
      "by": "kogman",
      "descendants": 0,
      "id": 30943261,
      "score": 1,
      "text": "Our team is developing the SFERA digital ecosystem with various functional services. The concept is that all content should be useful, and each service should be aimed at solving problems in real life.<p>As well we have taken another approach to implement many services on one platform which is to make all SFERA features available through a single icon on the desktop of your device. Our product is not an app store, but much more than a super app.<p>We invite you to evaluate our view on the new generation of social networks.<p>Since we took on the creation of a fundamentally new product, we did not have the opportunity to rely on the experience of others. I had to solve a lot of problems regarding the architecture of the application. In the six months since the release of the application’s first version, we have significantly improved app performance and its stable operation. In order to continue to improve the product, we need to expand the community of testers.<p>Currently, the SFERA digital ecosystem includes the ASAP messenger (the link between all services), the MeetNet dating service, the Choose Instant Questionnaire, the anonymous Black Box community, the VideoS service for short videos, Find Friends for finding friends, and the publications feed.<p>We are currently writing code for the job search service and Work and Business employees. At the first stage, we decided to release the Light Job app for job search service, which has only a part of the Work and Business functionality.<p>Now we need to test the application on the maximum number of devices in order to make the necessary changes to the code and consider all possible use cases.<p>At the time of this publication, there are about 30 thousand users in the global SFERA chat.<p>iOS and Android app versions are in early access with limited functionality. We plan to expand our app to desktop version in the future. We are currently looking for investors to accelerate app development, and as well we are approaching the release of the beta version of the application.<p>We are grateful for any assistance in the development of the SFERA digital ecosystem.<p>Download links:<p>android- https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=zone.sfera<p>iOS - https:&#x2F;&#x2F;apps.apple.com&#x2F;ru&#x2F;app&#x2F;sfera-project&#x2F;id1498046044<p>Or in the search field: SFERA Project",
      "time": 1649332370,
      "title": "Sfera project – a new generation ecosystem",
      "type": "story"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30943256,
      "score": 1,
      "time": 1649332327,
      "title": "How the Global Energy Crisis Ends",
      "type": "story",
      "url": "https://www.wired.co.uk/article/global-energy-crisis-price-rise-solution"
    },
    {
      "by": "int_10h",
      "descendants": 0,
      "id": 30943255,
      "score": 1,
      "time": 1649332319,
      "title": "Bel-T – Belorusian government-mandated encryption algorithm",
      "type": "story",
      "url": "https://github.com/bcrypto/belt"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 30943253,
      "score": 1,
      "time": 1649332299,
      "title": "Climate scientists are desperate: we’re crying, begging and getting arrested",
      "type": "story",
      "url": "https://www.theguardian.com/commentisfree/2022/apr/06/climate-scientists-are-desperate-were-crying-begging-and-getting-arrested"
    },
    {
      "by": "aaraujo002",
      "descendants": 0,
      "id": 30943238,
      "score": 1,
      "time": 1649332168,
      "title": "Welcome to 'Le Monde' in English",
      "type": "story",
      "url": "https://www.lemonde.fr/en/about-us/article/2022/04/07/welcome-to-le-monde-in-english_5979903_115.html"
    },
    {
      "by": "vinnyglennon",
      "descendants": 0,
      "id": 30943228,
      "score": 1,
      "time": 1649332094,
      "title": "Complete Fun to Imagine with Richard Feynman(1983)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=P1ww1IXRfTA"
    },
    {
      "by": "IdEntities",
      "descendants": 0,
      "id": 30943213,
      "score": 1,
      "time": 1649331966,
      "title": "Pelosi to Visit Taiwan in First Such Trip in 25 Years, FNN Says",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-04-07/pelosi-to-visit-taiwan-in-first-such-trip-for-25-years-fnn-says"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 30943211,
      "score": 1,
      "time": 1649331913,
      "title": "Understanding the Use of Bicycle Sharing Systems with Statistics",
      "type": "story",
      "url": "https://www.tus.ac.jp/en/mediarelations/archive/20220401_1062.html"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 30943208,
      "score": 1,
      "time": 1649331886,
      "title": "The physicist who built her career on clay",
      "type": "story",
      "url": "https://www.asiaresearchnews.com/content/physicist-who-built-her-career-clay"
    },
    {
      "by": "mistersquid",
      "descendants": 0,
      "id": 30943205,
      "score": 2,
      "time": 1649331872,
      "title": "Help Wanted: Adjunct Professor, Must Have Doctorate. Salary: $0",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/06/us/ucla-adjunct-professor-salary.html"
    }
  ]
}