{
  "stories": [
    {
      "by": "Jerry2",
      "descendants": 0,
      "id": 32079207,
      "score": 1,
      "time": 1657688875,
      "title": "UK lawmaker John Penrose proposes dystopian idea to give citizens a truth score",
      "type": "story",
      "url": "https://reclaimthenet.org/uk-lawmaker-truth-scores/"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 32079198,
      "score": 1,
      "time": 1657688702,
      "title": "John Kevin Woodward, the president and CEO of Readytech, arrested for murder",
      "type": "story",
      "url": "https://www.cbsnews.com/news/laurie-houts-killed-1992-readytech-ceo-john-kevin-woodward-charged-murder/"
    },
    {
      "by": "sexangel",
      "descendants": 0,
      "id": 32079188,
      "score": 1,
      "time": 1657688539,
      "title": "Neural Networks, Types, and FP",
      "type": "story",
      "url": "https://colah.github.io/posts/2015-09-NN-Types-FP/"
    },
    {
      "by": "sahin",
      "descendants": 0,
      "id": 32079181,
      "score": 1,
      "time": 1657688403,
      "title": "NYC releases PSA for residents in the event of a nuclear attack",
      "type": "story",
      "url": "https://nypost.com/2022/07/11/nyc-releases-psa-for-residents-in-the-event-of-a-nuclear-attack/"
    },
    {
      "by": "frxx",
      "descendants": 0,
      "id": 32079178,
      "score": 1,
      "time": 1657688322,
      "title": "Pomera DM250 - Compact Digital Memo",
      "type": "story",
      "url": "https://www.kingjim.co.jp/pomera/dm250/"
    },
    {
      "by": "robot_liker",
      "descendants": 0,
      "id": 32079157,
      "score": 1,
      "time": 1657687995,
      "title": "Dexterous Robotic In-Hand Manipulation Without Any Sensory Feedback",
      "type": "story",
      "url": "https://aditya.bhatts.org/sensorless-in-hand-manipulation.html"
    },
    {
      "by": "lermontov",
      "descendants": 0,
      "id": 32079148,
      "score": 1,
      "time": 1657687858,
      "title": "Beneath the glitter: Kinzan emaki, inside the gold mines of Sado",
      "type": "story",
      "url": "https://blogs.bl.uk/asian-and-african/2022/07/beneath-the-glitter-kinzan-emaki-inside-the-gold-mines-of-sado.html"
    },
    {
      "by": "stillblue",
      "descendants": 0,
      "id": 32079130,
      "score": 3,
      "text": "Question<p>I’m sorry if this is the wrong place to ask but I don’t know where else to go. There is no TLDR because the situation is fairly complicated in my opinion.<p>A few months back a family member (not immediate, let us call them X) and I got really close (non romantic), more of a sibling-y relationship from both sides and we had a falling out recently. The falling out was not just one thing but a series of minor things that finally blew up one day and ended in a huge argument and a fight.<p>After said event I told X “I’ve had enough I cannot deal with this the way things are, I don’t think things are gonna be the same as what they were before, the best we can do is let things go, let time heal and after a while see where it goes and let’s live with it.” X agreed.<p>After a few days, X comes back with “I’m not sure what I did wrong, even if I did, is it such a big deal that we can’t bring the old normal back?”<p>I explain her in excruciating detail about what happened, why I can’t be the same as before and whatnot. She nods along, agrees, and decides to leave me alone. Things are okay for a few days and then she again comes with the “Im not sure what I did wrong etc.” and then I explain my point of view again.<p>This cycle has repeated itself about 15 times in the last 40 days or so. And during all this she oscillates between “It’s my mistake” and “I did not do anything”. And I’ve been thoroughly exhausted with explaining the same things over and over again. I brought this up a couple weeks back and she said she regrets her behaviour she will try to forget all this and move on. But last week, she again comes back with “Why can’t we go back to what we had before etc.,” and I lost it.<p>I informed her sister about what happened and asked her to intervene and all she is getting from X is “we were really close how do i suddenly let this go when he was a lot of things to me” (we had a relationship where i taught her stuff, got her books, mentored her in an unofficial capacity, introduced her to nice bands, taught her financial literacy whatnot). The sister is extremely upset seeing X upset and crying a lot over this when X was asked about what was going on.  X’s sister is married to my brother. My brother is upset. X’s sister is upset. X is upset. X has been upset about this for a while now and is not moving on from this. She says she has never been this close to anyone for a long time and this is super hurtful for her. Talking to X about this is out of the question cos I’ve spoken so many times and she refuses to let go which was why this was taken to her sister for a resolution.<p>I feel guilty about all this cos I feel responsible I’ve caused X to be upset about everything while the logical part of my brain goes “this is how she is dealing with the consequences of her actions and you’ve tried all you can there’s nothing else you can do”<p>But the guilt is killing me. I don’t want X to get depressed over this and not move on. I’m also upset this has caused a lot of strain in relationships with my brother and his wife. I&#x27;m also worried X will get suicidal or go into a spell of depression. I’m not able to concentrate on anything and my work life is suffering. I’m not sure what I’m trying to ask here but how do i process this situation and get out of it? What would be the best way to get X to understand this and move on?<p>PS: This has been going on for about 45 to 60 days now and does not seem to go away. I’m 35 Male and X is 25 Female if that makes any difference.",
      "time": 1657687677,
      "title": "Ask HN: Going through a traumatic personal situation and HN is my last resort",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32079100,
      "score": 1,
      "time": 1657687262,
      "title": "The hand-cranked calculator invented by a concentration camp prisoner (2021)",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/12/the-remarkable-history-of-the-hand-cranked-curta-mechanical-calculator/"
    },
    {
      "by": "gjvc",
      "descendants": 0,
      "id": 32079070,
      "kids": [
        32079078
      ],
      "score": 1,
      "time": 1657686884,
      "title": "dateutils",
      "type": "story",
      "url": "http://www.fresse.org/dateutils/"
    }
  ]
}