{
  "stories": [
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 30117292,
      "score": 1,
      "time": 1643389164,
      "title": "How TypeScript Won over Developers and JavaScript Frameworks",
      "type": "story",
      "url": "https://thenewstack.io/how-typescript-won-over-developers-and-javascript-frameworks/"
    },
    {
      "by": "Obertr",
      "descendants": 1,
      "id": 30117289,
      "kids": [
        30117296
      ],
      "score": 1,
      "time": 1643389155,
      "title": "Ask HN: What are the best paid newsletters you are subscribed to?",
      "type": "story"
    },
    {
      "by": "MenesJo",
      "descendants": 0,
      "id": 30117288,
      "score": 1,
      "time": 1643389153,
      "title": "Using AI to automate operating systems",
      "type": "story",
      "url": "https://www.askui.com/"
    },
    {
      "by": "Ascodel",
      "descendants": 0,
      "id": 30117278,
      "score": 1,
      "text": "Hello , i just want to ask you a opinion.<p>I m not a native speaker .<p>Im trying to explain clear and short.<p>I  m 19 y old guy, my life was trash , my genetic was trash, mom and dad left me at birth. I never had a friend. Bullied and was beating to death at school 8 years everyday . Alcoholic grandpa and suicidal grandma which i lived with. Never had a girlfriend, not holding a hand, not a kiss. At the moment i have 0 empathy towards people and i want everybody to die. The only reason i m now alive and i didnt killed myself and anyone else is because it s the hope who keep me alive. The hope i cand find in this degenerate society a girl, a pure , loyal, lonely girl like me. To be clear, i don t need therapy and i don t need friends, i know what i need. I searched for that girlfriend for years. Im not ugly, i want a pure girl, a girl who can trully love me. And this is my last year, if this year i will not find that person i will QUIT. What i want can only be achieved young, the older people get the less they feel the emotions, especiall y the love. I  want to be the first for a girl, to be her world and she mine. I want  your opinion not about what i wrote down below here, but about that video. Here is the video i watch and cry everyday at, because i never had that, and this is the only thing i ever wanted and want. I wish u don t start calling me pedo or smthing because of the kids in video  . Can u watch this, and just tell me how realistic it is to find&#x2F;have that? I m losing my minds, i had to much. Thank you. Here is the video :<p>https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=HzmfkDv0Zys<p>Please if you watch, watch all and with background music.  I dont want your answer to be cliche and bullshits like ,, try to find a passion , friends, or anything,, please.. the only thing who can save me it s to get at least 50% of what this video show.. that pure.. inocent love. i dont care about sex, i m not a incel, i hate all human race, disgusting creatures. Thank you for your time.<p>But please, if your answer is something who is not based on my wish&#x2F;dream&#x2F;hope don t answer",
      "time": 1643389100,
      "title": "Urgent",
      "type": "story"
    },
    {
      "by": "mikewarot",
      "descendants": 0,
      "id": 30117264,
      "score": 1,
      "text": "We continually have stories of forced &quot;upgrades&quot; that break things, all in the name of &quot;security&quot; and &quot;best practices&quot; and a large range of other <i>absolutely important, how dare you question it</i> reasons.<p>The root cause of everything is the broken security model from Unix that underlies everything in our ecosystem.<p>How we managed to avoid reality and keep this co-dependent relationship going this long is a sad, sad tale.<p>We need an intervention.  It shouldn&#x27;t be unreasonable to want to be able to download some code, tell your system to run that code against a  set of capabilities, and be able to trust that those capabilities are the only things that will be affected.<p>We have a modern electric grid, which lets you take any random lamp from a thrift store, or curbside garbage can, and plug it in to your house, and know that doing so won&#x27;t burn your house down, no matter how poor the shape of the lamp. Why? Because of modern circuit breakers designed to protect the user and the wiring of the house.<p>Why can&#x27;t we have capability based security? It was invented 50 years ago!  It can protect the user, and the operating system, all in a usable, friendly manner.",
      "time": 1643389011,
      "title": "Ask HN: Can we stop blaming the wrong things, please?",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 30117246,
      "score": 1,
      "time": 1643388944,
      "title": "TLA+: The Best Debugger/ Optimizer You’ve Never Heard Of",
      "type": "story",
      "url": "https://thenewstack.io/tla-the-best-debugger-optimizer-youve-never-heard-of/"
    },
    {
      "by": "Frajedo",
      "descendants": 0,
      "id": 30117235,
      "score": 1,
      "text": "Hello HN,<p>What third party service would you recommend to have a smooth and visually attractive sign up process for users? The service should be able to submit the sign up elements to a webhook API (no sensitive info is shared at that point).<p>I am currently using Typeform for  GetMyMFA (https:&#x2F;&#x2F;get.mymfa.io) but unfortunately there is a maximum of 10 monthly questions and paying 20 bucks per month for « only » 100 sign ups is definitely excessive.<p>Thanks in advance!",
      "time": 1643388896,
      "title": "Ask HN: Any recommended third party sign-up service?",
      "type": "story"
    },
    {
      "by": "jgalvez",
      "descendants": 0,
      "id": 30117212,
      "score": 1,
      "time": 1643388804,
      "title": "Minimal TypeScript",
      "type": "story",
      "url": "https://hire.jonasgalvez.com.br/2022/jan/28/minimal-typescript/"
    },
    {
      "by": "yehz",
      "descendants": 0,
      "id": 30117158,
      "score": 1,
      "text": "I am a fan of serverless. I love how it voids the burden of building a server, which can be half of the work in a client-server architecture. However, serverless has a few blocking issues when I try to build an action-based multiplayer online games:<p>- The latency is unacceptably high. A typical round trip time is user noticable, because database accesses are slow. If a serverless function cold starts, the latency will be even higher. Google search shows me an interesting blog measurnig the exact latency numbers (<a href=\"https:&#x2F;&#x2F;serialized.net&#x2F;2021&#x2F;03&#x2F;serverless_gaming_limits&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;serialized.net&#x2F;2021&#x2F;03&#x2F;serverless_gaming_limits&#x2F;</a>), which aligns with my impression.<p>- The game can still use a server. Many in game actions required atomic updates to shared state, and many clients can request such updates simultaneously (e.g. increments to team scores on a scoreboard). At minimum, the clients need a serverless function to sequentialize simultaneous updates, such that they do not update based on stale state. However, one database access is already slow, let alone multiple, sequentialized ones. One solution is to add an in-memory cache (such as Redis) for shared state and update that instead. However, an in-memory cache is expensive and unnecessarily complex. The lowest tier of ElasticCache on AWS is $10&#x2F;month. For comparison, the lowest tier of EC2 server is $5&#x2F;month, which is sufficient for small games like what I am building. Why use an in-memory cache when I can use memory?<p>Hence, let me introduce the library.",
      "time": 1643388639,
      "title": "Show HN: Redux Remote – A high level networking library for realtime apps",
      "type": "story",
      "url": "https://github.com/yehzhang/redux-remote"
    },
    {
      "by": "EntICOnc",
      "descendants": 0,
      "id": 30117140,
      "score": 1,
      "time": 1643388579,
      "title": "Take Google's Machine Learning Crash Course",
      "type": "story",
      "url": "https://www.i-programmer.info/news/150-training-a-education/15175-take-googles-machine-learning-crash-course.html"
    }
  ]
}