{
  "stories": [
    {
      "by": "devbee",
      "descendants": 1,
      "id": 29711935,
      "kids": [
        29711936
      ],
      "score": 1,
      "time": 1640683257,
      "title": "Show HN: I made a Chrome extension to explain code in plain English",
      "type": "story",
      "url": "https://chrome.google.com/webstore/detail/codexplainer/mekadgeckpcgideipfhbcapmenbadejp"
    },
    {
      "by": "goe1zorbey",
      "descendants": 0,
      "id": 29711901,
      "score": 1,
      "time": 1640682862,
      "title": "Agile Product Ownership in a Nutshell – Video",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=502ILHjX9EE"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 29711836,
      "score": 2,
      "time": 1640682178,
      "title": "How much energy do countries consume when we take offshoring into account?",
      "type": "story",
      "url": "https://ourworldindata.org/energy-offshoring"
    },
    {
      "by": "rl1987",
      "descendants": 0,
      "id": 29711819,
      "score": 1,
      "time": 1640681943,
      "title": "Grayhat Twitch Chatbots",
      "type": "story",
      "url": "https://www.trickster.dev/post/grayhat-twitch-chatbots/"
    },
    {
      "by": "teleforce",
      "descendants": 1,
      "id": 29711800,
      "kids": [
        29711926
      ],
      "score": 1,
      "time": 1640681692,
      "title": "Teaching D from Scratch: Is it a viable first language?",
      "type": "story",
      "url": "https://dlang.org/blog/2021/12/23/teaching-d-from-scratch-is-it-a-viable-first-language/"
    },
    {
      "by": "Fudgel",
      "descendants": 0,
      "id": 29711777,
      "score": 1,
      "time": 1640681402,
      "title": "Typescripten: Generating Type-safe JavaScript Bindings for emscripten",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=CLuhogat6aY"
    },
    {
      "by": "isenhaard",
      "descendants": 1,
      "id": 29711750,
      "kids": [
        29711871
      ],
      "score": 6,
      "text": "I&#x27;m coding for a few years now, but today it was the first time I mistyped<p>$!&lt;number&gt;<p>to repeat a command from the bash history. Fortunately it only launched a Python server. But finally you could accidentally hit any command from your past. It&#x27;s like playing the lottery :-P",
      "time": 1640681158,
      "title": "$!134 can be a nice bash foot shooter if you accidentally mistype the number",
      "type": "story"
    },
    {
      "by": "martopix",
      "descendants": 0,
      "id": 29711742,
      "score": 2,
      "time": 1640681077,
      "title": "Stylish maps of sleeper train routes",
      "type": "story",
      "url": "http://www.night-trains.com/"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 29711738,
      "score": 2,
      "time": 1640681021,
      "title": "Tokens in the Attention Economy",
      "type": "story",
      "url": "https://cobie.substack.com/p/tokens-in-the-attention-economy"
    },
    {
      "by": "marcbermanblog",
      "descendants": 0,
      "id": 29711733,
      "score": 1,
      "text": "Construction supplies are important for all home and building projects. They can be classified into four categories: tools, hardware, hardwood, and hardware. &lt;a href=&quot;https:&#x2F;&#x2F;www.erniestools.com&#x2F;&quot;&gt;Construction Supply online shop&lt;&#x2F;a&gt;\n offers a variety of different products for sale. One of the most popular types of construction supply is tools. The types of tools include hammers, nails, screwdrivers, saws, and measuring equipment among others. Another type is hardware which includes window sashes, door hinges and door handles among other things. And lastly, there are hardwood supplies which include lumber, plywood, or wooden frames among other things that you will find on a construction site. Lastly, there is hardware that includes nails, screws, and hinges to name a few examples. Construction supplies are tools and hardware that are necessary for any construction project. Construction supplies can be classified into four categories: tools, hardware, hardwood, and hardware. Tools include hammers, screwdrivers, measuring tapes, and other items that are necessary for building a structure from scratch or repairing an existing one. Hardware includes nails, screws, brackets, and other items that are used to assemble the walls and roof of a structure. Hardwood includes lumber such as 2x4s and plywood sheets that can be used in place of reinforced concrete to support the weight of a building. Hardware includes nails, screws, brackets, and other items that are used to assemble the walls and roof of a structure.<p>Tools: These include hammers and nails, and they come in a variety of sizes and shapes. The most common hammer is the claw hammer, which is used to drive nails into wood. Nails come in various sizes and lengths depending on the type of nailer being used. From framing nails to finish nails, there are plenty of nail types to choose from.<p>Hardware: Hardware includes things such as doors, locks, window panes, or hinges that form a major part of any home or building. Tools such as saws, drills, and wrenches help with construction tasks like cutting through wood or drilling through metal to make holes for screws.<p>Construction supplies are items that are used by construction workers to create something. It can be classified into four categories: tools, hardware, hardwood, and hardware. Tools are needed for most of the tasks in this trade whereas hardware is needed for building. Hardwood is used to fix scaffolding and is generally expensive. For more info visit - Concrete Trowels",
      "time": 1640680973,
      "title": "Types and Tools of Construction Supplies",
      "type": "story"
    }
  ]
}