{
  "stories": [
    {
      "by": "oneiric",
      "descendants": 0,
      "id": 31565529,
      "score": 1,
      "time": 1653963682,
      "title": "Con Feratu",
      "type": "story",
      "url": "https://cf.me/"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31565527,
      "score": 1,
      "time": 1653963676,
      "title": "In the Cockpit of “Top Gun: Maverick” with Blue Angel Pilot, Frank Weisser",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=SOWw_ZFweAk"
    },
    {
      "by": "RoseBuckler",
      "descendants": 0,
      "id": 31565514,
      "score": 3,
      "text": "I&#x27;ve been programming on and off since the age of 16. Unfortunately, I have never been a rockstar programmer. I&#x27;ve always pieced code together from multiple sources to create programs but I&#x27;ve always failed to come up with a solution from scratch of my own and provide any value. I&#x27;ve always wondered how other smart people are able to come up with libraries, services and various solutions from scratch. I&#x27;ve devised countless ideas only to never execute them for various reasons or get started with them only to never fully complete them and see it all the way through.<p>I&#x27;ve already wasted my entire teens and 20s, current 28 years old, working as a software engineer (Full-Stack) at a startup for ~4 years. I&#x27;ve been feeling like a loser and not good enough for this career even though I am a sole developer for Mobile and Web platforms at this startup in a very small team. I&#x27;ve put in countless hours of work every day (70-90 hrs), being on-call almost 24&#x2F;7, sometimes for straight 7 days for months despite only getting paid on a salary basis on 40 hr work weeks; being a loner helps with working long hours. My salary also hasn&#x27;t increased much, and feel like I&#x27;m severely underpaid based on the # of years of experience but I struggle with evaluating my value in the market to determine my worth. I assumed working hard would pay off but that hasn&#x27;t been the case at all; I truly believe I&#x27;ve been doing the opposite of &quot;Work Smart, Not Hard&quot;. I&#x27;ve been trying to get back to learning DS and Algos so I can apply to places but I struggle with LeetCode, which is making me feel like even a bigger loser for not being able to solve problems.<p>I&#x27;m stuck in a rut, wanting to better my skills and earn a good amount of money but unable to concentrate, riddled with brain fog, and unsure of my future. My self-confidence and self-esteem are taking a hit. I am terrible at networking, so I don&#x27;t have others to reach out to for tips and advice, hence I&#x27;m turning to HN. I apologize if this isn&#x27;t the place for a post like this. How can I turn my directionless life around and find satisfaction with my career?",
      "time": 1653963528,
      "title": "I'm a loser, burnt-out, directionless but want to turn it around",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31565513,
      "score": 1,
      "time": 1653963498,
      "title": "China’s top court calls for blockchain to record vast number of transactions",
      "type": "story",
      "url": "https://www.theregister.com/2022/05/31/china_supreme_court_blockchain_opinion/"
    },
    {
      "by": "goindeep",
      "descendants": 1,
      "id": 31565443,
      "kids": [
        31565530
      ],
      "score": 4,
      "time": 1653962396,
      "title": "Satoshi Nakamoto Is the Deep State",
      "type": "story",
      "url": "https://cryptofireside.com/satoshi-nakamoto-is-the-deep-state-78cc2a38f90d?gi=183492c0ac68"
    },
    {
      "by": "raattgift",
      "descendants": 0,
      "id": 31565384,
      "score": 4,
      "time": 1653961662,
      "title": "Unusual neutron star spinning every 76 seconds discovered in stellar graveyard",
      "type": "story",
      "url": "https://phys.org/news/2022-05-unusual-neutron-star-seconds-stellar.html"
    },
    {
      "by": "monroewalker",
      "descendants": 1,
      "id": 31565383,
      "kids": [
        31565476
      ],
      "score": 2,
      "text": "I have a simple Spring Boot app using Postgres that I&#x27;d like to deploy but I&#x27;m finding it to be surprisingly difficult to figure out where exactly it should be deployed. This is still just a hobby project so my biggest priorities are (1) low and capped cost and (2) ease of setup and deploy.<p>AWS was the first place I looked, but the pricing is pretty confusing so I&#x27;m not sure how I would guarantee that costs would stay below a certain amount. It also seems like there are a number of similar options to look at and it&#x27;s not clear to me which is best - EC2, Fargate, Beanstalk, App Runner...<p>Google Cloud also has a few options, the main two I&#x27;m aware of are Cloud Run and App Engine. Main concern here is again the potential for unintended costs. I&#x27;ve seen horror stories like &quot;We Burnt $72K testing Firebase + Cloud Run and almost went Bankrupt&quot; [1]. Of course that&#x27;s a fairly novel outcome, but it shouldn&#x27;t even be in the cards that charges exceed my intended cap.<p>I&#x27;ve heard good things here and elsewhere about DigitalOcean droplets and Render.com but is it really $20+&#x2F;mo for just 2gb of RAM? Not sure how much RAM I actually need though and the 512MB for the starter &#x2F; free tiers might be fine.<p>I&#x27;ve also heard a lot of praise for Heroku, though also that it&#x27;s been slowly going cold since getting acquired by Salesforce.<p>I&#x27;ve also heard people suggest just renting a dedicated server from places like https:&#x2F;&#x2F;www.hetzner.com&#x2F;, https:&#x2F;&#x2F;www.kimsufi.com&#x2F;us&#x2F;en&#x2F;index.xml, or https:&#x2F;&#x2F;lowendbox.com&#x2F;, though that seems like a good deal more work that I&#x27;m looking for as someone with minimal devops experience.<p>Right now I&#x27;m planning on just starting with the free tier for Render.com since that also seems like a convenient way to setup a cheap&#x2F;simple Postgres instance. Would otherwise go the same route with Heroku or DigitalOcean.<p>Are there any options I didn&#x27;t consider here? Anyone else have hobby&#x2F;POC&#x2F;low-scale Spring Boot deployments and like their setup?<p>[1] https:&#x2F;&#x2F;blog.tomilkieway.com&#x2F;72k-1&#x2F;",
      "time": 1653961653,
      "title": "Ask HN: Where to deploy a Spring Boot app with a fixed spending cap?",
      "type": "story"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31565331,
      "score": 2,
      "time": 1653960950,
      "title": "Blowfish (Cipher)",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Blowfish_(cipher)"
    },
    {
      "by": "mrintellectual",
      "descendants": 0,
      "id": 31565328,
      "score": 1,
      "time": 1653960919,
      "title": "Terra Is Back from Bankruptcy",
      "type": "story",
      "url": "https://www.bloomberg.com/opinion/articles/2022-05-25/terra-is-back-from-bankruptcy"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31565325,
      "score": 1,
      "time": 1653960908,
      "title": "Fireflies (2017)",
      "type": "story",
      "url": "https://ncase.me/fireflies/"
    }
  ]
}