{
  "stories": [
    {
      "by": "sizzle",
      "descendants": 0,
      "id": 31044211,
      "score": 1,
      "time": 1650048818,
      "title": "Two-qubit silicon quantum processor with operation fidelity exceeding 99%",
      "type": "story",
      "url": "https://www.science.org/doi/10.1126/sciadv.abn5130"
    },
    {
      "by": "colinmcd",
      "descendants": 0,
      "id": 31044206,
      "score": 1,
      "time": 1650048801,
      "title": "Everyone is wrong about ORMs",
      "type": "story",
      "url": "https://www.edgedb.com/blog/everyone-is-wrong-about-orms"
    },
    {
      "by": "Barrera",
      "descendants": 0,
      "id": 31044198,
      "score": 1,
      "time": 1650048760,
      "title": "Data-Oriented Design",
      "type": "story",
      "url": "https://www.dataorienteddesign.com/dodbook/dodmain.html"
    },
    {
      "by": "sgt",
      "descendants": 0,
      "id": 31044195,
      "score": 1,
      "time": 1650048717,
      "title": "They Survived Operation Babylift",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=evg1Tm2E0_M"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31044130,
      "score": 1,
      "time": 1650048463,
      "title": "Why ‘Vision Zero’ Hit a Wall",
      "type": "story",
      "url": "https://www.bloomberg.com/news/features/2022-04-11/-vision-zero-at-a-crossroads-as-u-s-traffic-death-rise"
    },
    {
      "by": "gernb",
      "descendants": 0,
      "id": 31044127,
      "score": 1,
      "text": "I know the simple answer is &quot;because the developers want them to be&quot; close but, and maybe my thinking is just off here, this seems like a category of project for which there would be plenty of open source apps with a GUI.<p>Take decompressing .RAR files on MacOS. There&#x27;s The Unarchiver (proprietary) as well as Keka (proprietary). There&#x27;s MacPar (proprietary).  All are free (as in beer) but all are proprietary.<p>I get that WinZip and WinRar are proprietary because they are shareware and there&#x27;s a few other paid ones on Mac. I&#x27;m curious why The Unarchiver and Keka and MacPAR are not open source. Neither Keka nor MacPAR have any association I can tell with any other company or app so it&#x27;s not like they&#x27;re loss leaders to get people to look at some company&#x27;s other paid products. The Unarchiver is a loss leader so I guess that one makes a little more sense. Still, surprised this category of software has no open source GUI app.<p>I&#x27;m also not demanding they be open source. Still, I&#x27;d trust them more of they are. AFAIK they&#x27;re just trojans, especially Keka and MacPAR, as the fact that they&#x27;re proprietary seems to have no point which leads to trying to think of motivations for keeping them closed.<p>This is not a complaint. It&#x27;s just an observation. It seems out of the ordinary in 2022 for a free app to be proprietary unless it has some other way of making money and in particular, un-archive apps seem like a category that would have more open source alternatives and I&#x27;m surprised. That is all.<p>What other categories of software are similar? Similar that they it seems like they&#x27;re be plenty of open source alternatives but there aren&#x27;t but for some reason there&#x27;s lots of free but proprietary apps with no form of monetization?",
      "time": 1650048450,
      "title": "Ask HN: Why no GUI open source unarchive apps?",
      "type": "story"
    },
    {
      "by": "ducktective",
      "descendants": 0,
      "id": 31044118,
      "score": 1,
      "text": "I&#x27;m talking about 30-45minutes post-graduate level seminars in which PhD students or professors talk about their thesis or paper.<p>I&#x27;ve always tried to enthusiastically &quot;sit through&quot; such sessions but unless the field is really really close to my own, I don&#x27;t understand anything.<p>Like their whole literature or notations feels alien language to me.<p>In one of such cases, I wanted to know about &quot;differentiable programming languages&quot; which was posted here recently. I watched this seminar (https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=x1-YOWa0vJU) but I didn&#x27;t understand anything and lost all my confidence in what I knew.<p>(Note that I searched the presenter, he is very much respected in his field. I just provided that clip as an example. It&#x27;s not just this, as I said, I feel the same in  90% of similar topics)",
      "time": 1650048411,
      "title": "Ask HN: Does anyone understand anything from academic presentations?",
      "type": "story"
    },
    {
      "by": "arikr",
      "descendants": 0,
      "id": 31044102,
      "score": 1,
      "text": "I&#x27;d like to see a study on how alcohol on day 0 impacts mood on days 1, 2, 3, 4, and 5.",
      "time": 1650048346,
      "title": "Ask HN: Are there any studies on how alcohol impacts mood in the days after?",
      "type": "story"
    },
    {
      "by": "georgecmu",
      "descendants": 0,
      "id": 31044094,
      "score": 1,
      "time": 1650048311,
      "title": "Airline fined for shredding squirrels (2001)",
      "type": "story",
      "url": "http://news.bbc.co.uk/2/hi/europe/1232935.stm"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 31044083,
      "score": 1,
      "time": 1650048282,
      "title": "Screenshots of Return to Monkey Island",
      "type": "story",
      "url": "https://twitter.com/mixnmojo/status/1514632500894703616"
    }
  ]
}