{
  "stories": [
    {
      "by": "smaddock",
      "descendants": 0,
      "id": 30974564,
      "score": 1,
      "time": 1649566368,
      "title": "Fixing the entire Super Mario 64 source code",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=t_rzYnXEQlE"
    },
    {
      "by": "3a2d29",
      "descendants": 0,
      "id": 30974544,
      "score": 1,
      "text": "Hello all,<p>I got my first swe job this past August and it honestly has not gone well. I&#x27;ve enjoyed it, but it is clear that I am not seen as reliable and definitely not known for completing things fast.<p>I know this sounds like a normal junior dev, but I mean more than a normal beginner. Example: I have now been on this team for 8 months, and I made 2 costly mistake back-to-back that is pushing back the release of a production feature by a while month at this point.<p>Long story short, screwed up a step I had done before in the fall without realizing. Then when it was fixed I submitted a ticket for a prod systems account rather than a QA one not realizing there would be a difference. (Just so many mistakes all in a row).<p>The struggles came way before this though. When I first joined I struggled to even know how to start things. I was sometimes assigned stories no one else on the team had done anything like before, so at times I couldn&#x27;t even ask the senior devs for help.<p>This gets down to the issue. I don&#x27;t think my team is necessarily the most ideal to learn on (my manager has been gone since December). The senior engineers also seem to assume I know more than I do (like the credentials above, it seems obvious there would be an account for QA and one for Prod, but I didn&#x27;t know to assume that). But, the thing is though, this team isn&#x27;t a bad one. I can make excuses all I want, but an experienced engineer joined the same time I did and is doing great.<p>I have identified some issues. I certainly didn&#x27;t ask enough questions when I started and I definitely will wait around for people to get back to me sometimes rather then be proactive. I also tend to spend too long tackling an issue or trying to fix something I think I messed up rather than raise it to the team that I am having an issue. The problem is at this point I have been on the team too long to ask any basic questions, one of the senior engineers even pointed out they shouldn&#x27;t be helping me with certain processes at this point.<p>Honestly, I am a little deflated. I know imposter syndrome is a thing, but that doesn&#x27;t count when I am actively slowing the team down or causing problems. I take a really long time when finishing stories unless one of the seniors is giving input. It just sucks because I did well in my CS classes and worked hard, and I feel kinda like a disappointment. Its hard to imagine anyone who is good at engineering delaying a teams release and causing problems. I don&#x27;t know anything about performance (again cause manager is gone) but if I get put on PIP because of this, I feel like I can&#x27;t help but see it as a statement on my potential and ability.<p>I know I should just focus on improvement, but I am not sure how. Should I be writing reminders to myself to always double check everything? Should I write down the steps to every process? Its hard for me to know whats a junior engineer error and whats an error I shouldn&#x27;t be making at all.",
      "time": 1649565972,
      "title": "Ask HN: How to improve as a struggling junior swe?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30974500,
      "score": 1,
      "time": 1649565319,
      "title": "What Bias Lighting Is and Why You Should Be Using It (2017)",
      "type": "story",
      "url": "https://www.howtogeek.com/213464/how-to-decrease-eye-fatigue-while-watching-tv-and-gaming-with-bias-lighting/"
    },
    {
      "by": "vic_nyc",
      "descendants": 0,
      "id": 30974486,
      "score": 1,
      "time": 1649565034,
      "title": "NFTs Are a Privacy and Security Nightmare",
      "type": "story",
      "url": "https://www.wired.com/story/nfts-privacy-security-nightmare/"
    },
    {
      "by": "dhzhzjsbevs",
      "descendants": 0,
      "id": 30974484,
      "score": 2,
      "text": "I&#x27;m gearing up for a job change soon and wondering how best to write about past job experience.<p>Normally I leave my LinkedIn very short on details to avoid recruiter messages but now I&#x27;m thinking I should start puffing things up a bit.<p>How do I tell what&#x27;s worth sharing and what to leave out?<p>How long should each job description be?",
      "time": 1649564989,
      "title": "Ask HN: Does anyone have examples of great Resumes or LinkedIn profiles?",
      "type": "story"
    },
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 30974443,
      "kids": [
        30974502
      ],
      "score": 2,
      "time": 1649564352,
      "title": "As Climate Fears Mount, Some in U.S. Are Deciding to Relocate",
      "type": "story",
      "url": "https://e360.yale.edu/features/as-climate-fears-mount-some-in-u.s.-are-deciding-to-relocate"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 30974437,
      "score": 2,
      "time": 1649564191,
      "title": "Teach Your Kid the Ostrich Algorithm",
      "type": "story",
      "url": "https://twitter.com/seb_g/status/1513006904397676546"
    },
    {
      "by": "Anon84",
      "descendants": 0,
      "id": 30974436,
      "score": 1,
      "time": 1649564170,
      "title": "A ‘cautionary tale’ about location tracking: NewsCenter",
      "type": "story",
      "url": "https://www.rochester.edu/newscenter/a-cautionary-tale-about-location-tracking-517892/"
    },
    {
      "by": "minwuekim",
      "descendants": 0,
      "id": 30974427,
      "score": 2,
      "time": 1649564050,
      "title": "Instagram and Facebook: the next tech bubble? (2012)",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2012/apr/10/instagram-and-facebook-another-tech-bubble"
    },
    {
      "by": "_hypx",
      "descendants": 0,
      "id": 30974407,
      "score": 1,
      "time": 1649563810,
      "title": "Samsung, Seaborg partnership on floating nuclear reactors",
      "type": "story",
      "url": "https://www.world-nuclear-news.org/Articles/Samsung,-Seaborg-partnership-on-floating-nuclear-r"
    }
  ]
}