{
  "stories": [
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 29858905,
      "score": 1,
      "time": 1641692376,
      "title": "Drones used by farmers could be spying",
      "type": "story",
      "url": "https://taipeitimes.com/News/taiwan/archives/2022/01/09/2003771022"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 29858891,
      "score": 1,
      "time": 1641692298,
      "title": "The empty promises of Marie Kondo and the craze for minimalism",
      "type": "story",
      "url": "https://www.theguardian.com/lifeandstyle/2020/jan/03/empty-promises-marie-kondo-craze-for-minimalism"
    },
    {
      "by": "jamesdco",
      "descendants": 0,
      "id": 29858885,
      "score": 1,
      "text": "I wonder if I&#x27;m alone with this. I have been seeing plenty of developers create game and pour their heart and soul in development and marketing.<p>I heard about influencers who fail and get depressed, but since game development has become so accessible I wonder if this is happening to developers, too.<p>It&#x27;s clear to me what I need to do to promote my game (new trailer, contact the press, social media posts etc.), but it takes forever to get myself to do it because I&#x27;m afraid it won&#x27;t be good enough or it would fail for whatever reason.<p>I guess you get the initial rush when some people purchases the game in the beginning. Until you realise it wasn&#x27;t enough. Have you had similar experiences? Any thoughts?",
      "time": 1641692251,
      "title": "Ask HN: Is it worth developing independent games anymore?",
      "type": "story"
    },
    {
      "by": "roisn",
      "descendants": 0,
      "id": 29858872,
      "score": 1,
      "text": "They first didn’t signed any contract, I asked they didn’t bother , just email communication and they said it is legally bound by email<p>Now I invoiced them first for research work and then implementation \nWe did this for four invoices which were late but paid.\nIn ten NDA it says I can’t get a lawyer. \nI was offered a full time role but then I refused and continued consulting work.\nThe work I did was ongoing and like any software had bugs . After that I worked for two months, most of the last two months work was experimentation and none of it was completed. I in emails said yes I will complete task before any more payment but I did spend time on Those tasks. \nNow they are saying to pay them back the last invoice I had as all the previous work has bugs and they won’t pay for any new one as nothing is completed.\nThey are threatening to sue me if I don’t pay last invoice",
      "time": 1641692118,
      "title": "Consultant, startup sent notice I owe them money for dishonest, unfinished work",
      "type": "story"
    },
    {
      "by": "aniijbod",
      "descendants": 0,
      "id": 29858840,
      "score": 1,
      "time": 1641691877,
      "title": "Sony Launch EV: Will Other Techs? Apple, Meta, MS, Google, Amazon, Netflix?",
      "type": "story",
      "url": "https://www.autocar.co.uk/car-news/motor-shows-ces/sony-shows-radical-new-suv-it-confirms-plans-enter-ev-market"
    },
    {
      "by": "secg95",
      "descendants": 0,
      "id": 29858828,
      "score": 2,
      "text": "I would like to start playing around with NFTs, Can someone point me guides or tutorials please?",
      "time": 1641691805,
      "title": "Tutorial to make your own NFT",
      "type": "story"
    },
    {
      "by": "secg95",
      "descendants": 0,
      "id": 29858807,
      "score": 1,
      "text": "I really do not think that all good ideas can be cooked and published in under r6 months and in the window of time required to do a submission for a top conference.",
      "time": 1641691665,
      "title": "Is the CS publish system broken?",
      "type": "story"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 29858776,
      "score": 2,
      "time": 1641691394,
      "title": "The Strange Phenomenon of Mukbang",
      "type": "story",
      "url": "https://www.telegraphindia.com/my-kolkata/lifestyle/the-strange-phenomenon-of-mukbang/cid/1839965"
    },
    {
      "by": "egfx",
      "descendants": 0,
      "id": 29858759,
      "score": 1,
      "time": 1641691181,
      "title": "Why doesn’t Webb have deployment cameras",
      "type": "story",
      "url": "https://blogs.nasa.gov/webb/2022/01/06/why-doesnt-webb-have-deployment-cameras/"
    },
    {
      "by": "samglover97",
      "descendants": 0,
      "id": 29858747,
      "score": 1,
      "time": 1641691115,
      "title": "Is There a Gender Equality Paradox?",
      "type": "story",
      "url": "https://atis.substack.com/p/is-there-really-a-gender-equality"
    }
  ]
}