{
  "stories": [
    {
      "by": "maguay",
      "descendants": 0,
      "id": 31997945,
      "score": 1,
      "time": 1657093363,
      "title": "Log in is more popular than Sign in",
      "type": "story",
      "url": "https://reproof.app/blog/ux-copy-survey"
    },
    {
      "by": "Lior539",
      "descendants": 0,
      "id": 31997942,
      "score": 1,
      "time": 1657093342,
      "title": "I fucking hate slack dot com",
      "type": "story",
      "url": "https://ifuckinghateslack.com/"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 31997939,
      "score": 1,
      "time": 1657093314,
      "title": "Quebec Sovereignty Movement",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Quebec_sovereignty_movement"
    },
    {
      "by": "kvee",
      "descendants": 0,
      "id": 31997930,
      "score": 1,
      "time": 1657093178,
      "title": "Bioethics’ goal isn’t to ensure informed consent, but to veto informed consent",
      "type": "story",
      "url": "https://www.econlib.org/bioethics-tuskegee-vs-covid/"
    },
    {
      "by": "rdm_blackhole",
      "descendants": 0,
      "id": 31997910,
      "score": 1,
      "text": "Inspired by a comment related to another thread I saw yesterday https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=2184603\nI decided to take the plunge and try to do a bit of market validation for an idea that I had a while back.<p>TLDR; If I build a CRM for home buyers to help with the home buying process, would you pay to use it?<p>The idea would be to either automatically scrape Zillow&#x2F;Trulia for listings in a certain area then parse the data and do a bunch of validation on it and&#x2F;or allow the users to paste the url of a listing and import its data via web scraping as well.<p>--------<p>The details<p>During the pandemic, like many people, my wife and I toyed with the idea of buying a home. I found the process quite cumbersome and a time sink.<p>When we started to look at different homes, it quickly got out of hand.<p>For each property we had to:\n- remember when we went to the open houses\n- who the real estate agent was that we talked to\n- what we liked about each property\n- where it was located compared to other points of interest\n- how long it would take to commute from there to both our workplaces\n- how it compared to previous properties we saw earlier(number of bathrooms, bedrooms, land size, parking spaces…)\n- calculate the potential loan repayments for each property and see if we could actually afford them based on our down payment and so on…\n- keep track of potential renovations to do on each property\n- create stand alone folders of pictures of each property and label them properly<p>--------<p>First step: The free browser extension<p>To ease the burden a bit , I quickly created an extension that calculates your home loan repayments on the go while browsing real estate listings.<p>I don’t know about you but seeing on a listing that a particular property will cost approximately for example $650 per week helps me better understand  if I can afford it instead of simply seeing a number like $450000.<p>It works on https:&#x2F;&#x2F;realestate.com.au , https:&#x2F;&#x2F;domain.com.au, https:&#x2F;&#x2F;zillow.com and https:&#x2F;&#x2F;trulia.com<p>You can get it for Chrome here: https:&#x2F;&#x2F;chrome.google.com&#x2F;webstore&#x2F;detail&#x2F;real-estate-buddy&#x2F;idhhfoemdabklbkdabbodgbahfedfljp<p>Or for Firefox here: https:&#x2F;&#x2F;addons.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;addon&#x2F;real-estate-buddy&#x2F;?utm_source=addons.mozilla.org&amp;utm_medium=referral&amp;utm_content=search<p>This helped a lot as we could now browse listings and see how each property would affect our budget should we choose to buy it.<p>--------<p>The potential features of the CRM<p>(this is a non exclusive list, some already exist as part of the MVP I created for myself but others don’t)<p>- be able to quickly import data from the listings\n- be able to tag each property with custom tags\n- be able to add comments to properties\n- be able to calculate commute times from certain points of interest or workplaces\n- add pictures to listings and have the ability to label the pictures\n- be able to compare two properties’ features\n- apply custom validation rules to each property (for example, the property should cost no more than 5 times gross yearly salary)\n- keep track when the property was seen, who the agent was, if the price is negotiable and so forth<p>--------<p>The MVP<p>I have built most of the functionality as an MVP for myself and I use it to monitor certain suburbs back in Australia to see how the system performs. It&#x27;s very rough around the edges so it will probably take about two months(while working full time at my day job) to polish it enough to release it to users and fix up all the bugs and make the UI visually appealing.<p>--------<p>The team (me)<p>My website is at http:&#x2F;&#x2F;www.yannhulot.com. I am a French-Australian software developer currently living in Stockholm.<p>--------<p>I am looking for any feedback and comments. Please don’t hold anything back.\nAlso if this idea ends up being worth pursuing, I would be looking for a co-founder, so if you are interested, please let me know in the comments.",
      "time": 1657092948,
      "title": "Ask HN: If I build it, will you pay? (CRM for home buyers)",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 31997900,
      "score": 1,
      "time": 1657092820,
      "title": "Seven benefits of AIOps to transform your business operations",
      "type": "story",
      "url": "https://www.dynatrace.com/news/blog/seven-benefits-of-aiops/"
    },
    {
      "by": "HieronymusBosch",
      "descendants": 0,
      "id": 31997898,
      "score": 1,
      "time": 1657092808,
      "title": "Leaked Videos Show Disney Is the Biggest Ad Tech Giant You've Never Heard Of",
      "type": "story",
      "url": "https://www.vice.com/en/article/qjkp57/leaked-videos-show-disney-is-the-biggest-ad-tech-giant-youve-never-heard-of"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31997838,
      "score": 1,
      "time": 1657092226,
      "title": "Near-undetectable malware linked to Russia's Cozy Bear",
      "type": "story",
      "url": "https://www.theregister.com/2022/07/06/brc4_state_sponsored_apt29/"
    },
    {
      "by": "borisding1994",
      "descendants": 2,
      "id": 31997832,
      "kids": [
        31997885
      ],
      "score": 1,
      "time": 1657092125,
      "title": "Reimagining Desktop Operating System in the Era of Web 3.0",
      "type": "story",
      "url": "https://mirror.xyz/mashcard.eth/Ui8k6TW5lLN6EuDDhU5CHpIgZ6QJA4xjTXG8mm7xMKY"
    },
    {
      "by": "dexter816",
      "descendants": 0,
      "id": 31997816,
      "score": 1,
      "text": "I currently work in a good open source project, as a core developer in a medium\nsized organisation, I came across an early stage startup opportunity regarding\nproviding support and deployment of this, in this I would be working on a\ndev+support opportunity instead of working on core.<p>I work in Indian market, and the pay is more than twice my current pay, if I\nwork at this startup + I would be able to learn the pains and pleasures of\nworking at a startup.\nI am not sure am I making right decision moving from\ncore team to more support based role or not, I have 3 yrs work experience\nworking at tech and thought it might be good time to explore my risk appetite,\nbut am I taking risk on right project or not I have doubts regarding it.<p>I got this feedback from my mentor&#x2F;Team Lead and wanted to check with Industry\nfolks how will it impact my future employment, what other things should I check?",
      "time": 1657091968,
      "title": "Moving from dev- support+dev role (early stage startup)more than twice the pay",
      "type": "story"
    }
  ]
}