{
  "stories": [
    {
      "by": "jhatax",
      "descendants": 0,
      "id": 28297875,
      "score": 1,
      "time": 1629863553,
      "title": "Alaska Airlines evacuated a plane after a phone burst into flame",
      "type": "story",
      "url": "https://www.theverge.com/2021/8/24/22640314/phone-catches-fire-alaska-airlines-plane-seattle"
    },
    {
      "by": "trompetenaccoun",
      "descendants": 0,
      "id": 28297850,
      "score": 1,
      "text": "Many here might already know that the controversial new 802.11bf wifi standard, set to be introduced in 2024, will enable active &quot;remote monitoring&quot; of movements or objects through the microwaves the devices themselves emit. Microwave sensing works similar to the more well known radar or ultrasound.<p>I&#x27;m trying to find out if remote sensing&#x2F;monitoring is something that&#x27;s in practice possible with the 5G antennas that are installed everywhere now. I&#x27;ve searched for papers but might not know the exact terminology, so I didn&#x27;t find anything. I know it&#x27;s theoretically possible and what made me wonder is that with the new wifi standard they&#x27;re shortening the wavelength specifically to get higher resolution imagery. I&#x27;ve seen the argument brought up many times that 5G doesn&#x27;t bring much speed advantages and that many people don&#x27;t understand why they increased the frequency so much, which creates some problems (like shorter working distance, for example). Now maybe I&#x27;m going full conspiracy here, but it would make perfect sense to do this if one of the goals were monitoring the movement of EVERYTHING in the range of the mobile network antennas. Is this a thing that could practically be done? Feel free to tell me I&#x27;m crazy, but please do include an explanation with a source for why or why not.",
      "time": 1629863292,
      "title": "Is remote sensing through 5G antennas possible?",
      "type": "story"
    },
    {
      "by": "divbzero",
      "descendants": 0,
      "id": 28297849,
      "score": 1,
      "time": 1629863281,
      "title": "Apple’s Big Bet on Memoji",
      "type": "story",
      "url": "https://www.aboveavalon.com/notes/2021/8/23/apples-big-bet-on-memoji"
    },
    {
      "by": "woranl",
      "descendants": 0,
      "id": 28297824,
      "score": 2,
      "time": 1629862984,
      "title": "PayPal to add $20 inactivity fee in Canada",
      "type": "story",
      "url": "https://mobilesyrup.com/2021/08/24/paypal-20-dollar-inactivity-fee-canada/"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 28297794,
      "score": 1,
      "time": 1629862517,
      "title": "OpenTable teams with Clear to verify vaccination status at restaurants",
      "type": "story",
      "url": "https://fortune.com/2021/08/23/opentable-lear-vaccine-verification-vaccination-proof/"
    },
    {
      "by": "newonebig123",
      "descendants": 0,
      "id": 28297761,
      "score": 2,
      "time": 1629862087,
      "title": "Consultant Roast at Its Finest",
      "type": "story",
      "url": "https://medium.com/aha-moments/consultant-roast-at-its-finest-bd626f17fd07"
    },
    {
      "by": "sysadm1n",
      "descendants": 0,
      "id": 28297702,
      "score": 2,
      "time": 1629861415,
      "title": "Hedonism Resorts",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Hedonism_Resorts"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 28297684,
      "score": 2,
      "time": 1629861252,
      "title": "These Maps Tell the Story of Two Americas",
      "type": "story",
      "url": "https://www.nytimes.com/interactive/2021/08/24/climate/warmer-wetter-world.html"
    },
    {
      "by": "highwaymann",
      "descendants": 3,
      "id": 28297678,
      "kids": [
        28297800,
        28297853,
        28297808
      ],
      "score": 5,
      "text": "Hey everyone.<p>A little background: I’m a backend developer. I have around 7 years of experience working on various backend code bases in PHP, Python, Node, etc. I also have a masters in Software Engineering.<p>I got into web development because in my home country that’s your only choice as a software grad. You’re either a front-end&#x2F;backend dev or you’re unemployed.<p>I was completely fine with the job in the first few years because it was easy money. But lately I’ve been thinking about moving to different areas (game development, embedded, etc.) to explore a little especially since I moved to north america a while ago.<p>But honestly after all these years working on these start ups and “fast-paced enviroments”, i feel like i’m not in touch with the basics and fundamentals anymore to make this jump.<p>I’m not sure about the best way to go about this. Do I need to read books? Do I apply to specialized junior positions that interest me? Do I need to get the comp-sci notes out?<p>How would you do this? What’s your advice?<p>Also I’m 31 right now (not sure if it matters)",
      "time": 1629861186,
      "title": "Ask HN: I love coding, but I hate web development. How can I “jump ship”?",
      "type": "story"
    },
    {
      "by": "mindcrime",
      "descendants": 0,
      "id": 28297642,
      "score": 4,
      "time": 1629860933,
      "title": "The Principles Underlying Radio Communication",
      "type": "story",
      "url": "https://archive.org/details/principlesunderl00unitrich"
    }
  ]
}