{
  "stories": [
    {
      "by": "kabes",
      "descendants": 0,
      "id": 30916647,
      "score": 1,
      "time": 1649148001,
      "title": "Major Dutch webshop is selling cracked adobe software",
      "type": "story",
      "url": "https://www.ibood.com/be/nl/product-specs/00000/629514/adobe-allin-one-pakket-17-apps-2022/"
    },
    {
      "by": "olau",
      "descendants": 0,
      "id": 30916613,
      "score": 1,
      "time": 1649147744,
      "title": "Rebalancing Society",
      "type": "story",
      "url": "https://rebalancingsociety.org/"
    },
    {
      "by": "nameforuser",
      "descendants": 0,
      "id": 30916602,
      "score": 1,
      "text": "What do you like to read? What are you subscribed to?",
      "time": 1649147636,
      "title": "What are your faverite web blogs or newsletters?",
      "type": "story"
    },
    {
      "by": "bschne",
      "descendants": 0,
      "id": 30916565,
      "score": 1,
      "time": 1649147173,
      "title": "Somatic Evolution",
      "type": "story",
      "url": "https://www.ruxandratesloianu.com/blog/somatic-evolution"
    },
    {
      "by": "fer",
      "descendants": 0,
      "id": 30916558,
      "score": 3,
      "text": "Facebook&#x27;s enforcement of Community Standards is usually inconsistent, which is normal, given that there are different people evaluating reports behind, so controversial content can go both ways. Also, it&#x27;s an open secret is that Facebook tends to use the cheapest native speakers of a language at best, automatic translation at worst, for evaluating things like hate speech [0]. It isn&#x27;t too bad for English, as there&#x27;s way more effort in making it fair, but it breaks down pretty quickly into significant biases for anything else, especially if it&#x27;s a language spanning multiple countries and ethnic groups.<p>Speaking several languages and routinely reporting questionable content, I have my fair share of anecdotal evidence in terms of how this causes biases. For example, in French, hate speech is particularly sensitive in terms of racism and Islamophobia, since a significant part of the reviewers are francophone Muslims in Africa, and content can go down for anything slightly critical of immigration or Islam. Similar statements in English are fair game and not taken down. Other languages like Spanish have wildly different vernacular varieties, with differently loaded words and expressions, not always identified as what they are by reviewers from other areas, but on the other hand there are relatively few &quot;false positives&quot;.<p>With that context in mind: the war has made this bias so much worse.<p>What I&#x27;ve found is the increasingly common content in Russian implicitly (and even explicitly) treating Ukrainians as subhuman and advocating for killing them is seldom taken down as, I guess, most reviewers for Russian content are Russian speakers based in Russia (or other CIS countries). I won&#x27;t reproduce anything out of respect, but it&#x27;s stuff that could pass as from the 1930&#x2F;40s if you swap ethnicities, and would get you instantaneously suspended if you wrote it in English.<p>Given the current context where any information about the war in Russia is tightly controlled, and the state media straight up justifies violence and ethnic cleansing[1][2], so it&#x27;s not exactly surprising that reviewers review this way; it&#x27;s not hate speech when the reviewer agrees with it.<p>Personally I can&#x27;t come up with a solution but it&#x27;s extremely disturbing and concerning to see this every day.<p>[0] https:&#x2F;&#x2F;thewire.in&#x2F;tech&#x2F;facebook-content-moderation-language-gap-abusive-posts<p>[1] https:&#x2F;&#x2F;twitter.com&#x2F;TadeuszGiczan&#x2F;status&#x2F;1510908227202002947<p>[2] https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220404063038&#x2F;https:&#x2F;&#x2F;ria.ru&#x2F;20220403&#x2F;ukraina-1781469605.html",
      "time": 1649147096,
      "title": "Tell HN: Facebook content control in the context of the war in Ukraine",
      "type": "story"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30916536,
      "score": 2,
      "time": 1649146822,
      "title": "AsyncSSH: Asynchronous SSH for Python",
      "type": "story",
      "url": "https://asyncssh.readthedocs.io/en/latest/index.html"
    },
    {
      "by": "beny23",
      "descendants": 0,
      "id": 30916464,
      "score": 2,
      "time": 1649146170,
      "title": "How to Run a Digital Platform at Scale",
      "type": "story",
      "url": "https://beny23.github.io/posts/catalogue_deepdive/"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 30916453,
      "score": 2,
      "time": 1649146096,
      "title": "Sish: HTTP(s)/WS(S)/TCP Tunnels to localhost using only SSH",
      "type": "story",
      "url": "https://github.com/antoniomika/sish"
    },
    {
      "by": "Stratoscope",
      "descendants": 1,
      "id": 30916422,
      "kids": [
        30916577
      ],
      "score": 3,
      "time": 1649145800,
      "title": "Unicode will no longer accept proposals for new flag emoji",
      "type": "story",
      "url": "https://qz.com/2148267/the-reason-why-unicode-wont-add-new-flag-emoji/"
    },
    {
      "by": "forrest_blue",
      "descendants": 0,
      "id": 30916407,
      "score": 2,
      "time": 1649145588,
      "title": "Colossal-AI: A Unified Deep Learning System for Large-Scale Training",
      "type": "story",
      "url": "https://github.com/hpcaitech/ColossalAI"
    }
  ]
}