{
  "stories": [
    {
      "by": "pjmlp",
      "descendants": 0,
      "id": 28036971,
      "score": 1,
      "time": 1627914579,
      "title": "The Medley Interlisp Project: Status and Plans (2020)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=x6-b_hazcyk"
    },
    {
      "by": "smbv",
      "descendants": 0,
      "id": 28036969,
      "score": 1,
      "time": 1627914578,
      "title": "In selecting space leader, White House opts for policy chops over politics",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/08/white-house-names-space-policy-chief-sets-commercial-space-as-a-top-priority/"
    },
    {
      "by": "fybs",
      "descendants": 0,
      "id": 28036968,
      "score": 1,
      "time": 1627914577,
      "title": "How HTTPS and Tor Work Together",
      "type": "story",
      "url": "https://www.eff.org/pages/tor-and-https"
    },
    {
      "by": "erehweb",
      "descendants": 0,
      "id": 28036958,
      "score": 1,
      "time": 1627914521,
      "title": "Maryland gave away $2M in a lottery to boost vaccinations. Did it work?",
      "type": "story",
      "url": "https://www.washingtonpost.com/local/covid-vaccine-lottery-maryland/2021/07/30/0081d91e-eb0d-11eb-8950-d73b3e93ff7f_story.html"
    },
    {
      "by": "toomuchtodo",
      "descendants": 0,
      "id": 28036947,
      "score": 1,
      "time": 1627914477,
      "title": "Rep. Takano Introduces Legislation to Reduce the Standard Workweek to 32 Hours",
      "type": "story",
      "url": "https://takano.house.gov/newsroom/press-releases/rep-takano-introduces-legislation-to-reduce-the-standard-workweek-to-32-hours"
    },
    {
      "by": "adamnemecek",
      "descendants": 0,
      "id": 28036941,
      "score": 1,
      "time": 1627914448,
      "title": "Flowbetween: Tool for creating animations with a custom GUI in Rust",
      "type": "story",
      "url": "https://github.com/Logicalshift/flowbetween"
    },
    {
      "by": "marcuslima",
      "descendants": 0,
      "id": 28036927,
      "score": 1,
      "text": "Hi HN,<p>I’m Marcus, I’m the co-founder of Heimdal together with Erik (www.heimdalccu.com). We remove atmospheric carbon dioxide and trap it in materials that are used to make cement. More CO2 is trapped in our process than is re-emitted in cement production.<p>Concrete is responsible for 8% of global CO2 emissions. Cement is usually made from mined limestone, which is one of the largest natural stores of carbon dioxide. Using that to make cement is a bit like burning oil. The world is addicted to concrete, so this problem is not going away. We make synthetic limestone using atmospheric CO2, such that when it is used to make cement, the process is carbon neutral.<p>We were both master&#x27;s students in engineering at Oxford University in the UK. I decided to write my dissertation on direct air capture of CO2. While looking through existing solutions it struck me that none were sufficient. They all operated a circular process that left them with gaseous CO2 that needed to be stored somewhere. A circular process is one that uses a sorbent to trap atmospheric CO2 but then re-releases the trapped CO2 as a pure gas stream to regenerate the sorbent for re-use. We don&#x27;t have enough high-quality cheap stores of CO2 to justify such an approach. Storage must be permanent and safe. We realized that by taking a linear approach, we both make the process of capturing CO2 profitable and avoid the problem of where to store the CO2. We make sorbents for trapping CO2 in the form of mineral carbonates, these compounds are inert and trap CO2 for millions of years. They can also be commercialized as raw materials for making building materials including glass and concrete. In one step we solve three key problems of carbon capture: 1. How to trap CO2 energy efficiently 2. How to store the CO2 3. How to make money while doing all this.<p>Specifically, we use renewable electricity to extract dissolved oceanic CO2 as mineral carbonates of calcium and magnesium by contacting seawater with our proprietary alkaline sorbent. These mineral carbonates are important ingredients in cement as well as other building materials. The undersaturated ocean then re-absorbs an amount of atmospheric CO2 equivalent to the amount we removed when reacting with our sorbent. Effectively, the world’s oceans become our air contactor.<p>There are other companies addressing emissions from concrete production, but they don’t address the unavoidable process emission from the raw materials used in concrete. Start-ups in this space have so far focused on curing concrete with CO2 at the end of the production process. These are great solutions that can create low-carbon cement, however they’ll never get to carbon neutral cement that the world needs. The 70% of emissions from production are not being tackled by anyone on the market today. Until now concrete producers have favoured capturing emissions at the point where they’re released as their “2050-solution”, ie. in the distant future. Point source carbon capture can expensively capture 80-90% of emissions. This solution has the same problem as circular DAC solutions where a method of permanent CO2 storage is needed. There is a trial $3B (!) project in Norway to pump CO2 into empty gas fields at a cost of ~$1000&#x2F;tCO2. This is expensive and complicated engineering. On the other hand, all we need is renewable electricity and seawater.<p>We make money from selling synthetic limestone to cement producers and commercializing parallel byproducts including green hydrogen and desalinated water. We also generate carbon credits from our process. We are currently negotiating with concrete producers to decarbonize their limestone supply. Response has so far been very positive with multiple LOIs signed with producers across Europe. We are also working with a construction company to build the world’s first carbon neutral houses this decade. We are currently building a demo plant just outside Oxford. It has the capacity to remove and store 1 tonne of CO2 per year. We will use this plant to make enough product that we can deliver to our commercial partners to confirm compatibility with their manufacturing set-up. Following successful testing, we will scale this up to replace all of global limestone mining; currently &gt;2 billion tonnes of limestone per year.<p>We&#x27;re excited to hear any thoughts, insights, questions, encouragement and concerns in the comments below! Erik and I will be monitoring the thread over the course of today to answer any questions. Also feel free to reach out to me by email at Marcus.lima@heimdalccu.com.",
      "time": 1627914369,
      "title": "Launch HN: Heimdal (YC S21) – Carbon neutral cement",
      "type": "story"
    },
    {
      "by": "ltoshev",
      "descendants": 0,
      "id": 28036921,
      "score": 1,
      "text": "Share your information if you are looking for work. Please use this format:\n  Location:\n  Remote:\n  Willing to relocate:\n  Technologies:\n  Résumé&#x2F;CV:\n  Email:\nReaders: please only email these addresses to discuss work opportunities.\nSearchers: try https:&#x2F;&#x2F;seisvelas.github.io&#x2F;hn-candidates-search&#x2F;.",
      "time": 1627914347,
      "title": "Ask HN: Who wants to be hired? (August 2021)",
      "type": "story"
    },
    {
      "by": "herodotus",
      "descendants": 0,
      "id": 28036920,
      "score": 1,
      "time": 1627914341,
      "title": "Numbers Game and Immune Geography as Determinants of Coronavirus Pathogenicity",
      "type": "story",
      "url": "https://www.frontiersin.org/articles/10.3389/fcimb.2020.559209/full"
    },
    {
      "by": "nikatyet",
      "descendants": 0,
      "id": 28036890,
      "score": 1,
      "time": 1627914194,
      "title": "Show HN: Online catalog of Google Sheets integrations",
      "type": "story",
      "url": "https://to-sheets.com/"
    }
  ]
}