{
  "stories": [
    {
      "by": "niklasbuschmann",
      "descendants": 0,
      "id": 29503809,
      "score": 1,
      "time": 1639088643,
      "title": "Frankenstein Veto",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Frankenstein_veto"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 29503773,
      "score": 1,
      "time": 1639088423,
      "title": "FileCream 0.8.0: Standalone Apps",
      "type": "story",
      "url": "https://blog.filecream.com/posts/filecream-080-standalone-apps/"
    },
    {
      "by": "vichu",
      "descendants": 0,
      "id": 29503770,
      "score": 1,
      "time": 1639088404,
      "title": "2021 Global Health Security Index",
      "type": "story",
      "url": "https://www.ghsindex.org/#l-section--countryranksect"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29503742,
      "score": 1,
      "time": 1639088274,
      "title": "Dare Biden lecture while refusing to pardon Daniel Hale and Julian Assange",
      "type": "story",
      "url": "https://twitter.com/DanielEllsberg/status/1469011883462041603"
    },
    {
      "by": "alekq",
      "descendants": 0,
      "id": 29503729,
      "score": 1,
      "time": 1639088220,
      "title": "A New Software Category?",
      "type": "story",
      "url": "https://codecs.multimedia.cx/2021/12/a-new-software-category/"
    },
    {
      "by": "drekipus",
      "descendants": 0,
      "id": 29503709,
      "score": 1,
      "text": "TLDR: Has anyone paid others (solo or shop) to develop your ideas? was the process relatively easy? was the end-product good? Would you do it again?<p>I&#x27;m getting to the point in my life where I&#x27;m finding myself with less and less time. I have a job as a programmer, a child on the way, and I live in a community that demands a bit more of my time away from the computer, (not to mention the child).<p>I still think up fun ideas to do, and I don&#x27;t come up with 50 ideas a day like when I was younger, but I do come up with 1 - 2 ideas each month &#x2F; week &#x2F; quarter, that I am able to think about for longer, chew on, and think them through. I love it, and being able to create things is the sole reason I got into programming in the first place. Being able to say &quot;Wouldn&#x27;t it be nice to have X&quot; and then go off and create X is immensely attractive to me, and I think I&#x27;ve matured to the point where I think these ideas through so that I don&#x27;t waste my time.<p>However, I just can&#x27;t write them anymore. I roughly save all my programming work for my employer around the hours of 9-5. The work is engaging and the employer is ethical. All the little gaps of time around the commitments aren&#x27;t enough for programming side work. I love my job, and I&#x27;m not proposing to just throw it away for my side fancies, but I also like the idea of my side fancies. Often I wish someone else would just make them, but I&#x27;ll be the only one who&#x27;s that interested in them to that point.<p>I do like learning technology and experimenting with new things (CL atm), but if I try to build my ideas in the new, I get stuck in the weeds very fast, and then frustrated that I can&#x27;t see my idea through to completion.<p>I was thinking about putting some money aside to pay for a developer, and I was wondering if anyone had any experience in that; how did it go? how long does it take? cost vs what you received? recommendations?<p>I came up with some general ideas on how it might work, so please feel free to correct my mistakes before I make them:<p>* I&#x27;d try and find developers for the technology that I know, so when I do take the project off their hands, I&#x27;m able to tweak and extend it.\n* I&#x27;d be able to come up with the idea of the program; general information it, some &quot;story&quot; cards to develop, and some layouts to show how I want it to look\n* Practically I&#x27;d just load them all up into some sort of asana board that I&#x27;d be able to use with the developer; along with the figma&#x2F;slides.\n* Weekly catch up, tick them off one-by-one until the work is complete.<p>I don&#x27;t know how pricing would work; would we just agree X amount up front? Y per card size?<p>I&#x27;m concerned a little bit that, when involving others, the projects might get a little wonky; ie: if I tell a developer that I want some sort of search function, they might bolt on this big elastisearch contraption when I really just wanted to use Postgresql FTS; I would have to architect the software a little bit before I let the developers go at it. I&#x27;m not sure how much other developers would like it.<p>My main goal is that I&#x27;d still be able to make and use the software and hack around it, but I just want to pay someone to do the bulk work that I can&#x27;t find the time to do.<p>What happened in your case? is this the right way to go about it? Am I being deranged?",
      "time": 1639088079,
      "title": "Ask HN: Has anyone paid someone else to develop your side projects?",
      "type": "story"
    },
    {
      "by": "Koenvh",
      "descendants": 0,
      "id": 29503670,
      "score": 1,
      "time": 1639087859,
      "title": "Improving the resiliency of RPKI Relying Party software",
      "type": "story",
      "url": "https://blog.apnic.net/2021/12/09/improving-the-resiliency-of-rpki-relying-party-software/"
    },
    {
      "by": "kevin_hu",
      "descendants": 0,
      "id": 29503666,
      "score": 1,
      "time": 1639087838,
      "title": "MLB’s Economics Set the Owners and Players on a Collision Course",
      "type": "story",
      "url": "https://fivethirtyeight.com/features/how-mlbs-economics-set-the-owners-and-players-on-a-collision-course/"
    },
    {
      "by": "LopRabbit",
      "descendants": 0,
      "id": 29503650,
      "score": 1,
      "time": 1639087755,
      "title": "Million-dollar Strads fall to modern violins in blind ‘sound check'",
      "type": "story",
      "url": "https://www.science.org/content/article/million-dollar-strads-fall-modern-violins-blind-sound-check"
    },
    {
      "by": "astlouis44",
      "descendants": 2,
      "id": 29503641,
      "kids": [
        29503680
      ],
      "score": 2,
      "time": 1639087709,
      "title": "Facebook takes first steps towards the metaverse with Horizon Worlds open beta",
      "type": "story",
      "url": "https://gizmodo.com/facebook-takes-a-first-step-toward-making-the-metaverse-1848188942"
    }
  ]
}