{
  "stories": [
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30345921,
      "score": 1,
      "time": 1644930585,
      "title": "Amazon Elastic File System Update – Sub-Millisecond Read Latency",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/amazon-elastic-file-system-update-sub-millisecond-read-latency/"
    },
    {
      "by": "Jimmc414",
      "descendants": 0,
      "id": 30345886,
      "score": 2,
      "time": 1644930280,
      "title": "Trudeau announces intention to freeze bank accounts of protestors",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-60383385"
    },
    {
      "by": "edent",
      "descendants": 0,
      "id": 30345880,
      "score": 1,
      "time": 1644930228,
      "title": "The Existential Terror of LinkedIn",
      "type": "story",
      "url": "https://shkspr.mobi/blog/2022/02/the-existential-terror-of-linkedin/"
    },
    {
      "by": "avianes",
      "descendants": 0,
      "id": 30345879,
      "score": 2,
      "time": 1644930226,
      "title": "Remote Memory-Deduplication Attacks [pdf]",
      "type": "story",
      "url": "https://arxiv.org/abs/2111.08553"
    },
    {
      "by": "taubek",
      "descendants": 1,
      "id": 30345859,
      "kids": [
        30345894
      ],
      "score": 2,
      "text": "I&#x27;ve never worked in open space office. I&#x27;ve had a home office, I&#x27;ve shared office with 2 to 5 other people but I&#x27;ve never worked at open space office.<p>Mostly I&#x27;ve listen about bad sides of open space. Are there any good sides? Did covid situation change the open space? Do they still exist?",
      "time": 1644930110,
      "title": "Ask HN: Does anyone like to work in open space?",
      "type": "story"
    },
    {
      "by": "mmaunder",
      "descendants": 0,
      "id": 30345842,
      "score": 1,
      "text": "https:&#x2F;&#x2F;techcrunch.com&#x2F;2020&#x2F;08&#x2F;11&#x2F;mozilla-lays-off-250&#x2F;<p>The official internal message started with: \nWe are making significant changes at Mozilla Corporation today. Pre-COVID, our plan for 2020 was a year of change: building a better internet by accelerating product value in Firefox, increasing innovation, and adjusting our finances to ensure financial stability over the long term. We started with immediate cost-saving measures such as pausing our hiring, reducing our wellness stipend and cancelling our All-Hands. But COVID-19 has accelerated the need and magnified the depth for these changes. Our pre-COVID plan is no longer workable. We have talked about the need for change — including the likelihood of layoffs — since the spring. Today these changes become real.\n—-snip—-<p>But every tech biz I know has benefited from Covid except rare cases like AirBnB that has direct exposure to the travel industry.<p>During Covid there has been a big move towards remote work and remote earning, and surely Mozilla would have benefited?<p>I’ve also noticed a trend over the past two years of using Covid as a justification when the real reason is something less comfortable. Covid has become the new “to spend time with their family”.<p>So did Covid really affect Mozilla that quickly and that badly that they had to ditch a quarter of their team? This happened in August 2020.",
      "time": 1644930038,
      "title": "Why did Mozilla lay of 250 after a previous round of layoffs?",
      "type": "story"
    },
    {
      "by": "theaeolist",
      "descendants": 0,
      "id": 30345833,
      "score": 1,
      "time": 1644929932,
      "title": "A library for effect handlers in C++",
      "type": "story",
      "url": "https://github.com/maciejpirog/cpp-effects"
    },
    {
      "by": "BKirkpatrick",
      "descendants": 0,
      "id": 30345821,
      "score": 1,
      "text": "Hi HN, long time reader but first time poster.<p>I&#x27;ve been working on frenemy.live since I first started wfh some time back and realized how isolating it could be. With some inspiration from podcasts, Discord, Omegle and a reality tv show I came up with the idea of matching people for voice calls based on their opinions. These opinions are based on custom statements that I have thought of but are definitely not set in stone and I am open to suggestions. My hope is that frenemy.live facilitates respectful conversation and maybe leads to lasting relationships.<p>So about the technical stuff, the app is written with Elixir and Phoenix with a little NodeJS. I chose this stack after looking into Elixir&#x27;s fault tolerance and capacity for concurrency, its pub-sub features (which really came in handy) and Phoenix LiveView.<p>Constructive feedback is more than welcome and I hope you like the app. (Please don&#x27;t give it the kiss of death)<p>Oh I have also created this discord in case any hiccups happen and people need to find each other. Or you want to report any bugs.\n<a href=\"https:&#x2F;&#x2F;discord.gg&#x2F;f3FJUv2J\" rel=\"nofollow\">https:&#x2F;&#x2F;discord.gg&#x2F;f3FJUv2J</a>",
      "time": 1644929825,
      "title": "Show HN: Frenemy.live, Matching People for Voice Calls",
      "type": "story",
      "url": "https://www.frenemy.live"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 30345806,
      "score": 1,
      "time": 1644929732,
      "title": "Delayed Job vs. Sidekiq: Which Is Better?",
      "type": "story",
      "url": "https://blog.appsignal.com/2022/02/15/delayed-job-vs-sidekiq-which-is-better.html"
    },
    {
      "by": "cosheaf",
      "descendants": 0,
      "id": 30345792,
      "score": 1,
      "time": 1644929655,
      "title": "Climate Change: Annual greenhouse gas index",
      "type": "story",
      "url": "https://www.climate.gov/news-features/understanding-climate/climate-change-annual-greenhouse-gas-index"
    }
  ]
}