{
  "stories": [
    {
      "by": "BazookaMusic",
      "descendants": 0,
      "id": 28206896,
      "score": 1,
      "text": "Hello HN,<p>Due to the pandemic and an influx of stress recently, I went into self contemplation and tried to find what I don&#x27;t like about my life. One of the things that stood out was that, regarding my career and my love for computing, my knowledge feels wide but shallow. I feel that this is limiting my creative capacity and my ability to create fun and interesting things. As an example, I see articles here about reasonably complex subjects and am mostly capable of following them, but lack the inspiration to create something of my own that would not be a copy or close derivative of the articles I read.<p>In contrast, I see that some people find their niche, be it creating a site with auto-generated fractal art or their own text editor or even entire operating systems. I admire them but at the same time, I struggle to understand how they get their motivation.<p>If I spend a sizeable amount of energy exploring a niche subject and I end up not finding it satisfying, the energy feels wasted as the knowledge does not always transfer to the rest of my activities. At the same time, since I cannot relate my current activities to something I&#x27;m not familiar with, it&#x27;s hard to judge before hand.<p>I&#x27;ve tried the approach of trying out everything I find interesting, but combined with full-time work and the amount of information online, most attempts have remained very shallow with little to show for it.<p>For people who feel that they have found their niche(s), what was your path towards them and how do you know if a project will be something worth pursuing for your personal enjoyment?",
      "time": 1629182693,
      "title": "Ask HN: How to find my niche (personal projects)",
      "type": "story"
    },
    {
      "by": "leancz",
      "descendants": 0,
      "id": 28206878,
      "score": 2,
      "time": 1629182501,
      "title": "Sony's Robot Dog, Aibo",
      "type": "story",
      "url": "https://www.theguardian.com/science/2021/aug/10/dogs-inner-life-what-robot-pet-taught-me-about-consciousness-artificial-intelligence"
    },
    {
      "by": "Pikkie",
      "descendants": 0,
      "id": 28206873,
      "score": 1,
      "time": 1629182455,
      "title": "Innovation, future growth, ecommerce: 5 interesting stats to start your week",
      "type": "story",
      "url": "https://www.marketingweek.com/innovation-future-growth-ecommerce-5-interesting-stats-to-start-your-week/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28206863,
      "score": 1,
      "time": 1629182372,
      "title": "Casual Parsing in JavaScript",
      "type": "story",
      "url": "https://www.brandons.me/blog/casual-parsing-javascript"
    },
    {
      "by": "app4soft",
      "descendants": 1,
      "id": 28206855,
      "kids": [
        28206868
      ],
      "score": 1,
      "time": 1629182292,
      "title": "Export to .blend – a free Blender add-on for customize saving into blend-files",
      "type": "story",
      "url": "https://orangeturbine.com/posts/export-to-blend-add-on"
    },
    {
      "by": "Santosh83",
      "descendants": 0,
      "id": 28206840,
      "score": 1,
      "time": 1629182142,
      "title": "SerenityOS: Graphical Unix-like operating system with classic 90s UI",
      "type": "story",
      "url": "http://serenityos.org/"
    },
    {
      "by": "mitchs86",
      "descendants": 0,
      "id": 28206766,
      "score": 1,
      "text": "So, we&#x27;re an early stage startup and I&#x27;m trying to manage our customer success process in a funnel tool our team of 4 can use...At present, the sales team uses closed.io , and it&#x27;s way too expensive and specific for our success team, and I feel similarly about other sales funnel tools. What is everyone using to manage a proper success funnel? Thanks everyone and best of luck!",
      "time": 1629181300,
      "title": "Funnel Tool for Customer Success?",
      "type": "story"
    },
    {
      "by": "x14km2d",
      "descendants": 0,
      "id": 28206759,
      "score": 1,
      "time": 1629181195,
      "title": "California beach dunes once teemed with plants and birds",
      "type": "story",
      "url": "https://www.latimes.com/projects/can-reviving-beach-dunes-help-california-with-sea-level-rise/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28206756,
      "score": 1,
      "time": 1629181185,
      "title": "Burning Mountain: coal fire that has burned for approximately 6k years",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Burning_Mountain"
    },
    {
      "by": "markrobin",
      "descendants": 0,
      "id": 28206751,
      "score": 1,
      "time": 1629181170,
      "title": "Blogs were started by only one person, now worth millions dollar",
      "type": "story",
      "url": "https://dailyflynn.com/blogs-were-started-by-only-one-man-now-worth-millions-dollar/"
    }
  ]
}