{
  "stories": [
    {
      "by": "jdthedisciple",
      "descendants": 0,
      "id": 31813308,
      "score": 1,
      "text": "So I tried to create an Instagram account yesterday. After registering, I was immediately told my account was disabled for suspicious activity, but that if I wished they would review it within 24 hours. Weird, I thought, but maybe it&#x27;s just some rare false positive that can be triggered and I&#x27;m just unlucky. So I waited, patiently.<p>After 24 hours I tried to log in again and to my surprise, my account wasn&#x27;t just temporarily disabled anymore but permanently deactivated and I was met with this message:<p>&gt; Your account has been disabled for violating our terms. Learn how you may be able to restore your account. https:&#x2F;&#x2F;help.instagram.com&#x2F;521372114683554<p>How can I allegedly have broken Instagram terms when I just created the account and even verified it by phone? So I visited that link and asked them to restore it. What I get is an email by facebook that demands I send them a picture of myself holding a paper that I wrote a specific code on. Verbatim the email is this:<p>&gt; Hello, thank you for contacting us. Before we can help you, you must confirm that you are the owner of the account. Please respond to this email and attach a photograph of yourself, where you hold a piece of paper with the following, handwritten code on it: *** Please make sure that the photo fulfills the following criteria: \n- shows the above mentioned, handwritten code on a clean piece of paper, followed by your full name and username\n- shows both of your hands holding the paper as well as your complete face\n- it is well-lit and not too small, dark or blurred\n- is attached as a JPEG-file to your response E-Mail\nNote: Even if this account does not contain and pictures of yourself or it represents somebody or something else, we can only help you when we receive a picture of you which fulfills these criteria.<p>Am I the only one who finds this incredibly intrusive? I know I might be partially beating a dead horse here, as everyone knows Meta is pure evil. But this email really &quot;gave me the rest&quot;. I wouldn&#x27;t use IG for posting pictures of myself anyway but now I won&#x27;t ever be using anything from Meta even for business reasons.<p>Are there really no less intrusive ways than the above to prove ones ownership of account?? Why is email and phone verification not enough anymore these days? Is this the type of &quot;progress&quot; happening at FAANG? LOL",
      "time": 1655747408,
      "title": "Instagram demands I send a picture of myself to prove I own my account",
      "type": "story"
    },
    {
      "by": "ahamedirshad123",
      "descendants": 0,
      "id": 31813289,
      "score": 1,
      "time": 1655747332,
      "title": "Packtpub Twitter Account Takeover",
      "type": "story",
      "url": "https://hub.packtpub.com/twitter-account-takeover/"
    },
    {
      "by": "launchiterate",
      "descendants": 0,
      "id": 31813285,
      "score": 1,
      "text": "Reposted on Ask HN for visibility. With the advent of M1 Max and fast internet speeds is running a scaled up service more common ?",
      "time": 1655747320,
      "title": "Ask HN: Anyone run a service with millions of users from one home computer?",
      "type": "story"
    },
    {
      "by": "NConline",
      "descendants": 0,
      "id": 31813279,
      "score": 1,
      "time": 1655747298,
      "title": "Was Bedeutet SEO?",
      "type": "story",
      "url": "https://up2one-seo-agentur.at/was-bedeutet-seo/"
    },
    {
      "by": "modinfo",
      "descendants": 0,
      "id": 31813255,
      "score": 1,
      "time": 1655747202,
      "title": "Tell HN: Since more the 10 hours is SDF Europa offline",
      "type": "story"
    },
    {
      "by": "nailer",
      "descendants": 0,
      "id": 31813242,
      "score": 1,
      "time": 1655747147,
      "title": "If the mug is gone, could there by some physical token of the 100K achievement?",
      "type": "story",
      "url": "https://meta.stackexchange.com/questions/379453/if-the-mug-is-gone-could-there-by-some-kind-of-hard-physical-token-of-the-100k"
    },
    {
      "by": "staccatomeasure",
      "descendants": 0,
      "id": 31813234,
      "score": 1,
      "time": 1655747086,
      "title": "Value Sell Recruiting",
      "type": "story",
      "url": "https://staysaasy.com/recruiting/2022/06/20/value-recruiting.html"
    },
    {
      "by": "gbrown_",
      "descendants": 0,
      "id": 31813233,
      "score": 1,
      "time": 1655747083,
      "title": "Fast Page Maps for JIT",
      "type": "story",
      "url": "https://kazlauskas.me/entries/fast-page-maps-for-jit"
    },
    {
      "by": "btdmaster",
      "descendants": 0,
      "id": 31813232,
      "score": 1,
      "time": 1655747080,
      "title": "Rimgo: An alternative front end for Imgur",
      "type": "story",
      "url": "https://codeberg.org/video-prize-ranch/rimgo"
    },
    {
      "by": "O__________O",
      "descendants": 0,
      "id": 31813223,
      "score": 1,
      "time": 1655747025,
      "title": "Kable: Usage-based billing for API products",
      "type": "story",
      "url": "https://www.kable.io/"
    }
  ]
}