{
  "stories": [
    {
      "by": "Edmond",
      "descendants": 0,
      "id": 28737887,
      "score": 1,
      "time": 1633274686,
      "title": "Violent Crime Spikes Among Arabs in Israel as Officials Admit Neglect",
      "type": "story",
      "url": "https://www.nytimes.com/2021/10/02/world/middleeast/israel-arab-crime-killings-police.html"
    },
    {
      "by": "homarp",
      "descendants": 0,
      "id": 28737865,
      "score": 1,
      "time": 1633274518,
      "title": "The Book of Veles: How Jonas Bendiksen Hoodwinked the Photography Industry",
      "type": "story",
      "url": "https://www.magnumphotos.com/newsroom/society/book-veles-jonas-bendiksen-hoodwinked-photography-industry/"
    },
    {
      "by": "rbinv",
      "descendants": 0,
      "id": 28737839,
      "score": 1,
      "time": 1633274338,
      "title": "Sovereign Default, the Debt Ceiling, and the $1T Coin",
      "type": "story",
      "url": "https://www.lynalden.com/sovereign-default/"
    },
    {
      "by": "chauchakching",
      "descendants": 0,
      "id": 28737832,
      "score": 1,
      "text": "I didn&#x27;t expect how hard it was to search it on google. All I got were &quot;top x crawler&quot;&#x2F;&quot;scrape with 1 click&quot;&#x2F;&quot;scrapy&quot;. Is it bad SEO or something?",
      "time": 1633274293,
      "title": "Can you search “Common Crawl” on Google with keywords only?",
      "type": "story"
    },
    {
      "by": "derekzhouzhen",
      "descendants": 0,
      "id": 28737829,
      "score": 1,
      "text": "I use quite a few bookmarklets on my desktop browsers. However, bookmarklets have serious usability issues on a mobile device, if work at all.<p>On Android, there is the nice little app called URL Forwarder by David Laurell: https:&#x2F;&#x2F;f-droid.org&#x2F;en&#x2F;packages&#x2F;net.daverix.urlforward&#x2F; that can save the day.<p>My question is: Is there an equivalent App on iOS that can do the same, which is to forward an URL and optionally the title, to another website with the proper encoding and formatting? A naive search on the Apple app store yield nothing.",
      "time": 1633274274,
      "title": "Ask HN: Bookmarklet App for iOS?",
      "type": "story"
    },
    {
      "by": "alexmojaki",
      "descendants": 1,
      "id": 28737779,
      "kids": [
        28737785
      ],
      "score": 1,
      "time": 1633273824,
      "title": "Show HN: Futurecoder – A free online interactive Python course",
      "type": "story",
      "url": "https://futurecoder.io/"
    },
    {
      "by": "maxconf",
      "descendants": 0,
      "id": 28737778,
      "score": 1,
      "time": 1633273815,
      "title": "Show HN: Sfizio-Homebrew Version Control Tool",
      "type": "story",
      "url": "https://github.com/sebastianv1/sfizio"
    },
    {
      "by": "bubblehack3r",
      "descendants": 0,
      "id": 28737777,
      "score": 1,
      "time": 1633273809,
      "title": "I made my own silicon chip: Project Silicon Rider",
      "type": "story",
      "url": "http://www.orancollins.com:8109/microchip/"
    },
    {
      "by": "yashg",
      "descendants": 0,
      "id": 28737768,
      "score": 1,
      "text": "Cryptocurrency was supposed to eliminate middlemen like banks and card networks and reduce transaction time and cost. At present, it is not doing any of that.\nThe middlemen (miners) are still required to authenticate and add the transactions to the blockchain. Since that operation is computationally expensive and there is limited processing capability, miners have to be incentivised to pick up your transaction for validating. It means huge transaction fees (gas fees) and if you want to pay less, your transaction can take anywhere from hours to days to process. It is a highly inefficient system.<p>When you move money from one account of a bank to another account of the same bank, all the bank has to do is change numbers against two accounts in its database. Since the bank owns and controls the database – there is no incremental cost involved. And often it is free and instant for the customers. Even when you move money across banks, banks have worked out authentication mechanisms and again, all they do is change numbers in their respective databases.<p>Things are different in the case of a blockchain. Since no central authority owns it, extensive computations are required before blocks of transactions can be added to the chain. That makes it expensive, slow and power-intensive. It is neither sustainable nor scalable.<p>Crypto-tokens are currently hot because people are buying them with the anticipation of selling them at a much higher price in the future. It&#x27;s just another speculative asset. If a government or a central bank issues crypto-tokens then it is no different than fiat currency. Ideologically, a centralised crypto is not what Satoshi Nakamoto had envisioned.<p>Blockchain is another buzzword. It is touted as a cure to everything from poverty to climate change to alien invasion. First it was cloud, then it was AI now it is Blockchain and Web3. Why does a start-up need blockchain? What does it intend to store in a blockchain which it cannot store in a more traditional relational database? Is it decentralisation? If there is really one entity controlling the blockchain and making all the entries, it is not decentralised. A private blockchain is really pointless.<p>Blockchain is a very socialistic concept. Which is why it looks good in principle, but when you try to use it in real world, it turns out to be inefficient. Capitalists are in it to make a quick buck rather than actual usage. Capitalism is all about making money from anything, be it Che Guevara t-shirts or blockchain.<p>So, what are you planning to solve with blockchain?",
      "time": 1633273741,
      "title": "Why do startups need blockchain?",
      "type": "story"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 28737766,
      "score": 1,
      "time": 1633273721,
      "title": "DARPA's hypersonic scramjet achieves successful flight",
      "type": "story",
      "url": "https://www.darpa.mil/news-events/2021-09-27"
    }
  ]
}