{
  "stories": [
    {
      "by": "ChrisSD",
      "descendants": 0,
      "id": 28747612,
      "score": 1,
      "time": 1633359736,
      "title": "1001 Ways of Implementing a System Call (2019)",
      "type": "story",
      "url": "https://x86.lol/generic/2019/07/04/kernel-entry.html"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28747584,
      "score": 1,
      "time": 1633359572,
      "title": "Practical Front End Philosophy",
      "type": "story",
      "url": "https://jaredgorski.org/writing/15-practical-frontend-philosophy/"
    },
    {
      "by": "danielvf",
      "descendants": 1,
      "id": 28747580,
      "kids": [
        28747616
      ],
      "score": 1,
      "text": "I have a large monitor. I want to see a ton of code at the same time - instead of a single vertical scroll of code, I want lots and lots of narrow vertical columns of the same file shown side by side.<p>A big use for this is code reviews, so even a non-editable view of text&#x2F;PDF would be okay. Editable would be even better.<p>I used to have some software back in the early 2000&#x27;s, when Mac OS X was new that did a read only view in this way, but I can&#x27;t remember the name.<p>Any suggestions for me?",
      "time": 1633359566,
      "title": "Ask HN: Software to edit code in many vertical strips?",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28747575,
      "score": 1,
      "time": 1633359556,
      "title": "Rubble reveals the chaotic birth of our solar system",
      "type": "story",
      "url": "https://www.nationalgeographic.com/magazine/graphics/tumbling-leftover-rubble-reveals-the-chaotic-birth-of-our-solar-system-feature"
    },
    {
      "by": "DhxLgt",
      "descendants": 0,
      "id": 28747573,
      "score": 1,
      "text": "I have been programming for 20 years. After the first 10 I burned out and had to switch to contracting for a couple of years before I could get another FT job.<p>10 years later it happened again. I believe i had covid early on in the pandemic but i was never tested. I was working from home and the company I was with didnt care at all about its employees well being. I had a plethora of health issues and my performance dipped so they fired me after 2 years.<p>The next job i took was for a start up as vp of eng. I had to quit after 8 months when<p>1. I could see the signs of burning out\n2. The owner fired all my engineers, crippled my hiring process, wouldnt give me a budget, and i had to pick up all the slack and work from 3am to 7pm seven days a week and recieved absolutely no recognition for it\n3. I found out the owner was plotting to replace me with a friend of his and demote me after i had saved them from losing a multi million dollar contract and sacrificing my health to do it<p>I took the last 7 months off and worked on personal non paying side projects. Now i need to get back to work so i dont run out of cash.<p>I had originally planned to do some contracting again, but i dont even know how to land contracts these days (10 years ago i was just getting them via referrals).<p>Any advice on what type of job to look for that wont drive me insane and rob me of my health? Im a very skilled programmer but cant stand the thought of re-entering the nightmarish world i have been away from. I have already applied to about 20 start ups but am absolutely terrified im going to find myself in the same situation i was in with my last two jobs.",
      "time": 1633359549,
      "title": "Ask HN: Programmer for 20 years, burned out twice, how do I keep working?",
      "type": "story"
    },
    {
      "by": "_ralf_",
      "descendants": 1,
      "id": 28747570,
      "kids": [
        28747571
      ],
      "score": 1,
      "time": 1633359538,
      "title": "The world’s first 100% Open Source test automation platform",
      "type": "story",
      "url": "https://teatimewithtesters.com/cometa-rocks-product-launch/"
    },
    {
      "by": "mattficke",
      "descendants": 0,
      "id": 28747553,
      "score": 1,
      "time": 1633359448,
      "title": "The Ship That Became a Bomb",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/10/11/the-ship-that-became-a-bomb"
    },
    {
      "by": "mfiguiere",
      "descendants": 0,
      "id": 28747544,
      "score": 1,
      "time": 1633359426,
      "title": "TikTok is too big for mobile advertisers to ignore",
      "type": "story",
      "url": "https://mobiledevmemo.com/tiktok-is-too-big-for-mobile-advertisers-to-ignore/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 28747537,
      "score": 1,
      "time": 1633359360,
      "title": "Please Don’t Pet the Wildlife",
      "type": "story",
      "url": "https://writersontherange.org/please-dont-pet-the-wildlife/"
    },
    {
      "by": "gcassie",
      "descendants": 0,
      "id": 28747532,
      "score": 3,
      "time": 1633359346,
      "title": "Putting Pants On: One Thing We Did Right After 5 Years with Django",
      "type": "story",
      "url": "https://g-cassie.github.io/2021/10/02/django-pants.html"
    }
  ]
}