{
  "stories": [
    {
      "by": "huksley",
      "descendants": 0,
      "id": 31907374,
      "score": 2,
      "text": "I am using awesome NextJS and serverless-nextjs and deploy my app to CloudFront and Lambda@Edge.<p>I made a mistake and accidentally created a serverless function that called itself. In a recursive loop, with a 30s timeout. I thought I fixed it and deployed the code to the dev environment.<p>I have had an AWS Billing alert (Budgets) set up to prompt me when my monthly budget goes over $300 (my usual bill is $200&#x2F;month).<p>Imagine the terror when I woke up the next day to see the AWS Billing alert email saying I already owed $1,484! I removed a function and deployed it again in 30 minutes, but it was too late. It has already run for 24 hours, using over 70 million Gb-Second!<p>Only after that I&#x27;ve learned that AWS Billing alerts do not work this way for CloudFront. You get delayed information on charges because they collect them from all regions.<p>On the following day, the bill settled at a shocking $4600. This is more than we have ever spent on AWS all time.<p>CloudFront includes the AWS Shield Standard feature, but somehow, it was not activated for this case (Lambda@Edge calling itself via CloudFront).<p>Now, I understand that I should have created CloudWatch alarms, which would alert me when the number of requests exceeds the limit. The problem is, that they need to be set up per region, and I got CloudFront charges from all points of presence.<p>I am a big proponent of the serverless approach. It makes it easy to scale and develop things (e.g., you get PR review version branches for free, both frontend and backend code like Vercel does). But now, I am unsure because such unexpected charges can ruin a side-project or emerging startup.<p>Now I am waiting on a response from AWS Support on these charges; maybe they can help me waive part of that.<p>What is your experience with it? Would you recommend to use to build a new product if you are bootstrapped, 3-person startup?",
      "time": 1656422624,
      "title": "Tell HN: I DDoSed myself using AWS CloudFront and Lambda Edge and got $4.5k bill",
      "type": "story"
    },
    {
      "by": "mazr",
      "descendants": 0,
      "id": 31907359,
      "score": 1,
      "time": 1656422573,
      "title": "French police is opening their data",
      "type": "story",
      "url": "https://www.gendarmerie.interieur.gouv.fr/barometre-numerique/"
    },
    {
      "by": "jka",
      "descendants": 0,
      "id": 31907344,
      "score": 1,
      "time": 1656422508,
      "title": "Starting Up in a Downturn: mini-guide for founders facing a troubled economy",
      "type": "story",
      "url": "https://ecorner.stanford.edu/articles/71448/"
    },
    {
      "by": "mgl",
      "descendants": 1,
      "id": 31907319,
      "kids": [
        31907334
      ],
      "score": 1,
      "time": 1656422395,
      "title": "Largest bacterium ever found is surprisingly complex",
      "type": "story",
      "url": "https://www.nature.com/articles/d41586-022-01757-1"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 31907303,
      "score": 1,
      "time": 1656422309,
      "title": "Monkeypox found to be evolving at a faster rate than expected",
      "type": "story",
      "url": "https://medicalxpress.com/news/2022-06-monkeypox-evolving-faster.html"
    },
    {
      "by": "kloch",
      "descendants": 0,
      "id": 31907297,
      "score": 1,
      "time": 1656422282,
      "title": "Misguided call for a 7-Zip boycott brings attention to FOSS archiving tools",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/27/7zip_compression_tool/"
    },
    {
      "by": "jtbayly",
      "descendants": 0,
      "id": 31907296,
      "score": 1,
      "time": 1656422281,
      "title": "M2 13 MBPro with 256GB SSD Slower Than Equivalent M1 in Real-World Speed Tests",
      "type": "story",
      "url": "https://www.macrumors.com/2022/06/27/m2-macbook-pro-256gb-ssd-real-world-tests/"
    },
    {
      "by": "tjdevries",
      "descendants": 0,
      "id": 31907286,
      "score": 2,
      "time": 1656422215,
      "title": "PDE: A different take on editing code",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=QMVIJhC9Veg"
    },
    {
      "by": "ezekg",
      "descendants": 0,
      "id": 31907276,
      "score": 1,
      "time": 1656422169,
      "title": "Breaking Things Without Breaking Things",
      "type": "story",
      "url": "https://keygen.sh/blog/breaking-things-without-breaking-things/"
    },
    {
      "by": "mikece",
      "descendants": 0,
      "id": 31907261,
      "score": 1,
      "time": 1656422095,
      "title": "OpenSSL 3.0.5 awaits release to fix potential worse-than-Heartbleed flaw",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/27/openssl_304_memory_corruption_bug/"
    }
  ]
}