{
  "stories": [
    {
      "by": "lawik",
      "descendants": 0,
      "id": 30719115,
      "score": 1,
      "time": 1647582875,
      "title": "Is Phoenix LiveView Overhyped?",
      "type": "story",
      "url": "https://underjord.io/is-liveview-overhyped.html"
    },
    {
      "by": "ifree",
      "descendants": 0,
      "id": 30719104,
      "score": 1,
      "time": 1647582510,
      "title": "The Only Unbreakable Law on software architecture",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=5IUj1EZwpJY"
    },
    {
      "by": "robomartin",
      "descendants": 0,
      "id": 30719093,
      "score": 1,
      "text": "https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30664767<p>Seriously.<p>Not sure what the flaw is in the HN algorithm that allows such things.  In this particular thread I went way out of my way to provide mathematical support and detailed analysis for the issue I suggested should be discussed.  And yet, as is often the case with certain subjects, the mob descends and cancels all possibility of a potentially eye-opening discussion.<p>Now, I know just how difficult it is to moderate a public forum.  I did it myself going back to the wild USENET days.  Not faulting you or anyone at HN on this at all.<p>I just want to raise the question because, well, it sometimes seems that a monoculture is the only thing that is acceptable here.  Not to draw a parallel, but the world is seeing just exactly how damaging it can be when people are not allowed to even mention anything that does not align with the approved culture (Putin&#x27;s Russia).  Not a fair comparison?  Why was my post flagged then?<p>I don&#x27;t have the right to be, well, right, on everything I say or think.  Of course I don&#x27;t.  Nobody does.  And yet, nobody should have the right to cancel what I have to say provided it isn&#x27;t an incitement to violence or utterly abusive to others.<p>In this particular example, what I put on the table is a perfectly reasonable engineering&#x2F;scientific discussion that can be quantified.  Math and physics.<p>Instead, what comes back is the equivalent of religious belief and ganging-on of like-minded people to effectively silence and cancel that with which they disagree.  It is, to use the term, deplorable at best and down-right dangerous at the extremes.  It is odd this happens today, when the history of science has so many examples of brilliant minds that were silenced for daring to not fall in line with what was deemed to be &quot;the truth&quot;.<p>Progress isn&#x27;t made this way.",
      "time": 1647582369,
      "title": "Why is this flagged dang?",
      "type": "story"
    },
    {
      "by": "gamechangr",
      "descendants": 0,
      "id": 30719034,
      "score": 3,
      "time": 1647581579,
      "title": "I Have a Message for My Russian Friends - Arnold Schwarzenegger",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2022/03/schwarzenegger-russia-ukraine-war-message/627100/"
    },
    {
      "by": "pelasaco",
      "descendants": 0,
      "id": 30719013,
      "score": 1,
      "time": 1647581276,
      "title": "Multiple Vulnerabilities in PfSense",
      "type": "story",
      "url": "https://www.cybersecurity-help.cz/vdb/SB2022031507"
    },
    {
      "by": "dane-pgp",
      "descendants": 0,
      "id": 30719000,
      "score": 2,
      "time": 1647581144,
      "title": "WhatsApp and Cloudflare launch Code Verify browser extension",
      "type": "story",
      "url": "https://inside.com/campaigns/inside-dev-2022-03-11-31674/sections/274213"
    },
    {
      "by": "perihelions",
      "descendants": 0,
      "id": 30718978,
      "score": 5,
      "time": 1647580739,
      "title": "Owning a ShortWave Radio Is Once Again a Subversive Activity",
      "type": "story",
      "url": "https://hackaday.com/2022/03/17/owning-a-shortwave-radio-is-once-again-a-subversive-activity/"
    },
    {
      "by": "raleighm",
      "descendants": 0,
      "id": 30718976,
      "score": 2,
      "time": 1647580730,
      "title": "Uchronia: The Alternate History List",
      "type": "story",
      "url": "http://www.uchronia.net/"
    },
    {
      "by": "csense",
      "descendants": 0,
      "id": 30718974,
      "score": 2,
      "text": "I was able to find a couple HN articles from a few small entrepreneurs about the effect of sanctions [1] [2].<p>Does anyone know how sanctions apply to large tech companies?<p>For example, is Microsoft legally required to block Russian users from being able to download Windows security updates from Microsoft?  Seems like black hats will soon have a free-for-all on any and all Russian Windows machines if that&#x27;s the case.<p>For that matter, what about the Internet itself?  Are companies in sanctioning countries legally required to firewall IP addresses that geolocate to Russia?  Are ISP&#x27;s in sanctioning countries legally required to blackhole IP traffic coming to or from Russia?  Are transatlantic or land-based fiber optics running from EU, Japan or the US to Russia legally required to be shut down or even physically severed?<p>How do the companies that own those fibers pay for the fibers&#x27; operational and capital costs, considering that money now can&#x27;t flow into or out of Russia?  Even if the fibers are <i>legally</i> allowed to operate, wouldn&#x27;t there be a <i>financial</i> incentive to shut them off, because nobody&#x27;s allowed to pay for them because of sanctions?  Are governments using tax dollars to replace the lost revenue, to keep those fibers open and allow some semblance of freedom of speech (and&#x2F;or Western propaganda) to reach Russia?<p>Do the sanctions destroy Russian users&#x27; ability to access DRM-protected products they&#x27;ve already bought?  For example if you&#x27;re in Russia and you bought X game on Steam pre-sanctions, is Steam legally required to say &quot;Sorry, because of sanctions I can&#x27;t let you connect to the DRM server&quot; and the game&#x27;s existing DRM checks then say &quot;Sorry, since you can&#x27;t connect to the DRM server you can&#x27;t play the game&quot;?<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30539958<p>[2] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30505819",
      "time": 1647580728,
      "title": "Ask HN: How do Russia sanctions affect large tech companies?",
      "type": "story"
    },
    {
      "by": "vsundar",
      "descendants": 1,
      "id": 30718927,
      "kids": [
        30718973
      ],
      "score": 2,
      "time": 1647580191,
      "title": "The Making of a Xenotext",
      "type": "story",
      "url": "https://www.americanscientist.org/blog/science-culture/the-making-of-a-xenotext"
    }
  ]
}