{
  "stories": [
    {
      "by": "sytse",
      "descendants": 0,
      "id": 28268418,
      "score": 1,
      "text": "I&#x27;m Sid Sijbrandij and I love reading Hacker News. I almost always read the comment section and when there is a summary of the article in there that is frequently helpful. But most articles don&#x27;t have a summary so I want to hire someone to create more summaries.<p>I hope that this will make Hacker News more enjoyable and efficient to use for its readers. Many times it takes a while to figure out what the article is about, a summary would allow people a quick way to see if they are interested in investing that time.<p>There are potential downsides:\n1. People only read the summary and not the full article.\n2. The summary might not be clear or correct.\n3. People who already read the article don&#x27;t want to see the summary.<p>With a one month experiment we should have a better idea if HNSS is worth it.<p>If it is here to stay we can also see if the summary can become an official part of HN.<p>The writer of the summaries should:\n1. Be able to do this for a month\n2. Have at least 20 comments on Hacker News\n3. Be able to invoice me as a contractor<p>Apply via https:&#x2F;&#x2F;docs.google.com&#x2F;forms&#x2F;d&#x2F;e&#x2F;1FAIpQLSdmM0gvAAmuEcHmFUzNx4DRd4JY93BfUMNZrdRQYinfmgc3bw&#x2F;viewform?usp=sf_link",
      "time": 1629658811,
      "title": "Show HN: Hacker News Summary Service (HNSS)",
      "type": "story"
    },
    {
      "by": "polyomino",
      "descendants": 0,
      "id": 28268382,
      "score": 1,
      "time": 1629658608,
      "title": "Apple Reversal Shows it's now Listening to Users (and still scanning iPhones)",
      "type": "story",
      "url": "https://www.bloomberg.com/news/newsletters/2021-08-22/apple-s-ios-15-reversal-shows-it-s-now-actually-listening-to-users"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 28268334,
      "score": 1,
      "time": 1629658372,
      "title": "Poor wages and lack of labour rights make food delivery a thankless gig",
      "type": "story",
      "url": "https://www.thehindu.com/society/poor-wages-punishing-hours-and-lack-of-labour-rights-make-food-delivery-a-thankless-gig/article36012013.ece"
    },
    {
      "by": "newbamboo",
      "descendants": 0,
      "id": 28268321,
      "score": 1,
      "time": 1629658298,
      "title": "Why are fires getting worse? These scientists explain",
      "type": "story",
      "url": "https://www.weforum.org/agenda/2021/08/wildfires-united-states-cause-science/"
    },
    {
      "by": "vectorboost",
      "descendants": 2,
      "id": 28268311,
      "kids": [
        28268360,
        28268395
      ],
      "score": 1,
      "text": "Please do not dismiss me as a bad person right away, here is the thing: Not sure if I am just old-fashioned or a boomer in the body of 30 year old, but I have trouble fitting in modern IT hipster working environment. I tried to solve this by working in the companies with less progressive approach to work, but it is inevitable that hipsters will start joining my present company too. Note that I do not hate them. I just feel I have problem to fit in, because my mindset is different. And it&#x27;s not just about the age, I&#x27;ve met many people that are older than me with the behavior described in the following points:<p>What I like:\n- Supportive mindset\n- Flexibility, willingness to use latest technologies\n- Easy to have small talk with<p>My struggles:\n- Massive amounts of soy lattes, excessive friendliness that seems almost fake.\n- MacBook obsession aka &quot;I think we should all use MacBooks, they are best and it creates nice unified vibe...&quot;\n- They want to change the world, engage in activism but are less willing to change their own toxic behavior and&#x2F;or character.\n- Seemingly random working time, daily alcohol or drug consumption that affects work performance =&gt; mood swings\n- Unable to use email, if someone (client ,colleague) refuses to use Slack it&#x27;s insurmountable problem.\n- Spending lot of money at Barber&#x27;s and for avocado toasts, complaining about no money for rent (I think here I have some common ground :) )<p>Note that I don&#x27;t judge someone for being like this, I understand that world is changing and so does the work culture. I am just honestly looking for a way to fit in and find a way to effectively cooperate with these people. Any suggestion are welcome!",
      "time": 1629658254,
      "title": "Help 30yo “boomer” fit into hipster working culture",
      "type": "story"
    },
    {
      "by": "newbamboo",
      "descendants": 0,
      "id": 28268295,
      "score": 1,
      "time": 1629658177,
      "title": "Fire scientists fight over what western forests should look like (2012)",
      "type": "story",
      "url": "https://www.hcn.org/issues/44.16/fire-scientists-fight-over-what-western-forests-should-look-like"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 28268293,
      "score": 2,
      "time": 1629658169,
      "title": "When playing video games becomes a full-time job",
      "type": "story",
      "url": "https://english.elpais.com/usa/2021-08-12/when-playing-video-games-becomes-a-full-time-job.html"
    },
    {
      "by": "martincmartin",
      "descendants": 0,
      "id": 28268275,
      "score": 1,
      "time": 1629658066,
      "title": "New, 800V, electric cars, will recharge in half the time",
      "type": "story",
      "url": "https://www.economist.com/science-and-technology/new-800v-electric-cars-will-recharge-in-half-the-time/21803666"
    },
    {
      "by": "sdeframond",
      "descendants": 1,
      "id": 28268260,
      "kids": [
        28268268
      ],
      "score": 2,
      "time": 1629657975,
      "title": "“Zombie Apocalypse” in AWS ToS 42.10",
      "type": "story",
      "url": "https://aws.amazon.com/fr/aispl/service-terms/"
    },
    {
      "by": "rwmj",
      "descendants": 0,
      "id": 28268250,
      "score": 1,
      "time": 1629657900,
      "title": "New fake chips scam: 74 CMOS rebadged as 74 TTL",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Knfv-Qp7Q2U"
    }
  ]
}