{
  "stories": [
    {
      "by": "spzx",
      "descendants": 0,
      "id": 29332485,
      "score": 1,
      "time": 1637774658,
      "title": "Farm laws: Sikhs being targeted by fake social media profiles",
      "type": "story",
      "url": "https://www.bbc.com/news/world-asia-india-59338245"
    },
    {
      "by": "mfiguiere",
      "descendants": 0,
      "id": 29332477,
      "score": 1,
      "time": 1637774633,
      "title": "Phil Schiller to Tim Cook: “moving iMessage to Android will hurt us”",
      "type": "story",
      "url": "https://twitter.com/TechEmails/status/1463558823109660677"
    },
    {
      "by": "aleksiloytynoja",
      "descendants": 0,
      "id": 29332471,
      "score": 1,
      "text": "I used to struggle to properly get involved with DAOs.<p>While most DAOs are supposed to be open organizations, actually getting involved in them can be hard. Flexible and &quot;decentralized&quot; structure means that there are no CEOs or HR Directors who would be in charge of recruitment (&quot;contributor acquisition&quot;) or help you to get started. Onboarding principles vary a lot, and in many organizations it may be up to the contributors themselves to find their place and start working.<p>It doesn&#x27;t mean that the orgs wouldn&#x27;t want new people to join – on the contrary, most DAOs are constantly looking new active contributors! Open structure unlocks access to many emerging DAOs, and the larger protocols start to have some processes in place.<p>I&#x27;ve found that the following steps often unlock doors to DAOs:<p>- Join Discord and be active. While many DAOs have plenty of members lurking in their Discords, active participants are of scarce supply. Being active is as easy as participating in discussions, actively making proposals, being open for many types of work, and happily helping out in anything that&#x27;s needed, whether it&#x27;s within your area of expertise and otherwise related to the org&#x27;s daily operations.<p>- Participate in governance proposals and voting. Most DAO members are often passive in governance proposals, making it hard to govern the organization effectively. Active participation in governance discussion (often happening in Discourse forums) and voting makes you a valuable &#x27;DAO citizen&#x27; and showcases your enthusiasm towards the organization. Want to take it to the next level? Create governance proposals by yourself!<p>- Find native ways to get involved. Most DAOs – especially larger ones – have created some structures for onboarding contributors. Whether it means an application, participating in bounties or grants, or something else, identifying and leveraging the existing paths is an effective way for gaining the first project. After that, it&#x27;s up to your performance and quality of your work to earn more of them :)<p>- Participate actively in the broader Web3 ecosystem. Web3 space is evolving rapidly, and new value-creating contributors are constantly needed everywhere. Crypto-native community is overall still relatively small, and while it may feel hard to get your voice heard in the beginning, people with unique insights and constructive participation in Reddit, Discord or Twitter are highly valued. It&#x27;s likely to find high-quality opportunities by posting and discussing persistently!<p>- Create a role for yourself. Many DAOs are in a constant need of new, engaged talent, even though they wouldn&#x27;t be offering too many open roles nor having structured onboarding yet in place. By pitching in your own idea and getting it approved either in a committee or a community vote, you can create yourself a paid job in the organization you like the most!<p>There are quite a few different ways of getting involved with DAOs – unfortunately, not too many of them are well structured. To solve this problem and make my own life easier, I recently co-founded Kleoverse (https:&#x2F;&#x2F;www.kleoverse.com). We make it frictionless to discover all relevant DAOs and offer step-by-step instructions on how to start working with any of them. The goal is to make it easy to understand which option to choose from the above-mentioned list, if any. Hope we could help some of you the same way we&#x27;ve been able to help ourselves :)",
      "time": 1637774613,
      "title": "How to Get Started with DAOs?",
      "type": "story"
    },
    {
      "by": "maltalex",
      "descendants": 0,
      "id": 29332463,
      "score": 1,
      "time": 1637774582,
      "title": "Moody's: NSO at growing risk of default",
      "type": "story",
      "url": "https://en.globes.co.il/en/article-moodys-nso-at-growing-risk-of-default-1001391882"
    },
    {
      "by": "efface",
      "descendants": 0,
      "id": 29332445,
      "score": 2,
      "time": 1637774485,
      "title": "Mad Dogs and Transcendentalists",
      "type": "story",
      "url": "https://theamericanscholar.org/mad-dogs-and-transcendentalists/"
    },
    {
      "by": "horseradish",
      "descendants": 0,
      "id": 29332441,
      "score": 2,
      "time": 1637774474,
      "title": "Raising a Stink",
      "type": "story",
      "url": "https://www.guernicamag.com/raising-a-stink/"
    },
    {
      "by": "Geekette",
      "descendants": 0,
      "id": 29332426,
      "score": 1,
      "time": 1637774378,
      "title": "Man Is Exonerated in Rape Case Described in Alice Sebold’s Memoir",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/23/nyregion/anthony-broadwater-alice-sebold.html"
    },
    {
      "by": "happy-go-lucky",
      "descendants": 0,
      "id": 29332420,
      "score": 1,
      "time": 1637774360,
      "title": "NASA Research Launches a New Generation of Indoor Farming",
      "type": "story",
      "url": "https://www.nasa.gov/directorates/spacetech/spinoff/NASA_Research_Launches_a_New_Generation_of_Indoor_Farming/"
    },
    {
      "by": "WaitWaitWha",
      "descendants": 0,
      "id": 29332379,
      "score": 2,
      "time": 1637774175,
      "title": "The Arduino Uno Mini Limited Edition",
      "type": "story",
      "url": "https://blog.arduino.cc/2021/11/24/introducing-the-arduino-uno-mini-limited-edition-pre-orders-now-open/"
    },
    {
      "by": "drummer",
      "descendants": 0,
      "id": 29332370,
      "score": 1,
      "time": 1637774090,
      "title": "Signal has enabled MobileCoin payments worldwide",
      "type": "story",
      "url": "https://twitter.com/wheatpond/status/1463555246966276098"
    }
  ]
}