{
  "stories": [
    null,
    null,
    {
      "by": "intull",
      "descendants": 0,
      "id": 30768704,
      "score": 1,
      "time": 1647968924,
      "title": "Nvidia Grace CPU",
      "type": "story",
      "url": "https://www.nvidia.com/en-us/data-center/grace-cpu/"
    },
    {
      "by": "hcmthrowaway",
      "descendants": 0,
      "id": 30768701,
      "score": 1,
      "text": "I have been diagnosed with pre-clinical hypertrophic cardiomyopathy (HCM), a form of genetic heart disease where the heart becomes abnormally thick. It affects 1 in 500 people (most asymptomatically) and is the leading cause of sudden death amongst otherwise healthy young athletes.<p>My father is currently suffering symptoms, and my uncle died before the age of 50 from sudden cardiac death caused by HCM. While modern technology such as implantable defibrillators greatly reduce the chances of sudden cardiac death, the degenerative consequences of the disease that probably await me are daunting and scary for a fit and sporty 25 year old.<p>HCM has only recently begun to emerge from a dark age of being viewed as a benign tumor that can be cut and hacked away at; in reality it is an interesting condition for which drugs and treatments can be specifically developed. Some of the first generation of HCM drugs, myosin inhibitors, are undergoing clinical trials and one, mavacamten, is awaiting FDA approval.<p>These drugs help reduce obstructive symptoms and benefit the structure of the heart, but the root cause, the faulty genes, are left unchanged and the heart continues to thicken. As the genes that cause HCM are known and can be identified by sequencing ones DNA my instinct is that HCM is particularly suited to gene therapy.<p>I am a recent graduate in computer science, with a bachelors and masters degree. It is hubris (and dangerous) to think that I could save or cure myself, but I have been toying with the idea of doing a PhD in Genetics or a related field and then further research on gene therapy applicable to the heart.<p>I don&#x27;t want to start suffering symptoms later in life and regret that I played it safe and did not try to contribute to fighting HCM. It helps that I have not yet found happiness in the working world and was most fulfilled when independently learning and solving problems at university.<p>---<p>My questions to you HNers:\nHow can I make the most impact against HCM? A genetics&#x2F;gene therapy PhD? Apply to AI-aided drug discovery start-ups? Would comp sci give me an edge or just leave me playing catch-up with the biologists?<p>Is it sensible or healthy to even try? The slow pace of medical advancement &amp; regulation (in comparison to software) and the very personal consequences of failure would be mentally difficult.<p>Would I be better off staying in software, earning as much money as possible to get the best healthcare and ensure any future children don&#x27;t carry the genes? Or should I try to maximise happiness while I am still healthy (which is easier said than done)?<p>Thanks!",
      "time": 1647968902,
      "title": "Ask HN: Diagnosed with genetic heart disease at 25 – how do I make an impact?",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 30768694,
      "score": 1,
      "time": 1647968867,
      "title": "Hunting the Invader: Ukraine’s Special Operations Troops",
      "type": "story",
      "url": "https://cepa.org/hunting-the-invader-ukraines-special-operations-troops/"
    },
    {
      "by": "ItsTotallyOn",
      "descendants": 0,
      "id": 30768692,
      "score": 1,
      "time": 1647968856,
      "title": "Nvidia Unveils 144-Core Grace CPU Superchip, Claims Arm Chip 1.5X Faster Amdepyc",
      "type": "story",
      "url": "https://www.tomshardware.com/news/nvidia-unveils-144-core-grace-cpu-superchip-claims-arm-chip-15x-faster-than-amds-epyc-rome"
    },
    {
      "by": "uribec",
      "descendants": 0,
      "id": 30768688,
      "score": 1,
      "time": 1647968828,
      "title": "Identifying Fonts: The Complete Guide",
      "type": "story",
      "url": "https://learnui.design/blog/identifying-fonts.html"
    },
    {
      "by": "ahmadrosid",
      "descendants": 0,
      "id": 30768682,
      "score": 1,
      "time": 1647968799,
      "title": "Web Socket for Productivity in Rust",
      "type": "story",
      "url": "https://www.ahmadrosid.com/blog/rust-websocket"
    },
    {
      "by": "JyotiSharma",
      "descendants": 0,
      "id": 30768667,
      "score": 1,
      "text": "Hello HN commmunity, happy to announce the launch of AutoFloApp\nIt is the simplest way to automate your Testing<p>Our aim is to 1. Enable manual testers to automate, 2. Shorten the journey of a testcase to be automated, 3. Accessible to everyone and 4. Easy to maintain and develop.<p>We are a web application which provides below functionalities:<p>1. Shorten your testing life cycle through automation 2. No Code platform to enable Manual testers to automate 3. Remove dependency on any specific coding skills 4. No infra required for script development and execution 5. Increase scope of testing in same timelines by enabling test automation<p>We are in our Beta Trial phase and are already being used by global companies such as InfraGuard.io, who have reduced their automation script development time by 80% and testing execution time Testing time by close to 90% after using AutoFloApp.<p>You can sign up on our website - https:&#x2F;&#x2F;www.autofloapp-login.com&#x2F;<p>Here is the short video to help you understand the tool - https:&#x2F;&#x2F;youtu.be&#x2F;vpJfDPuCDbE<p>We have a 1 month Free Trial for all our Beta Customers. Do contact us on contact@autofloapp.com, if this fits your requirements, and we will circle back to schedule a demo.",
      "time": 1647968711,
      "title": "Show HN: AutoFloApp – LowCode TestAutomation WebApp",
      "type": "story"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 30768664,
      "score": 1,
      "time": 1647968705,
      "title": "NSA on How to Harden Kubernetes",
      "type": "story",
      "url": "https://thenewstack.io/nsa-on-how-to-harden-kubernetes/"
    }
  ]
}