{
  "stories": [
    null,
    {
      "by": "keleftheriou",
      "descendants": 0,
      "id": 30334683,
      "score": 1,
      "time": 1644859125,
      "title": "Apple imposes unnecessary and unreasonable conditions on dating-app providers",
      "type": "story",
      "url": "https://www.acm.nl/en/publications/acm-developing-new-app-unnecessary-and-unreasonable-condition-apple-imposes-dating-app-providers"
    },
    {
      "by": "susam",
      "descendants": 0,
      "id": 30334667,
      "score": 1,
      "time": 1644859036,
      "title": "I wrote a 1980s-arcade-style invaders game to fulfill a childhood dream",
      "type": "story",
      "url": "https://github.com/susam/invaders"
    },
    {
      "by": "danielakang",
      "descendants": 0,
      "id": 30334665,
      "score": 1,
      "text": "Hey guys I&#x27;m Daniel and I created a website you can use to discover NFT projects called Fomo Fix. I&#x27;m sure most crypto-literate people already get the drift off the name alone. Open to suggestions for improvement.",
      "time": 1644859032,
      "title": "Show HN: A website for discovering NFT projects (upcoming and already launched)",
      "type": "story",
      "url": "https://www.fomofix.xyz/"
    },
    {
      "by": "aga_ml",
      "descendants": 0,
      "id": 30334634,
      "score": 1,
      "text": "In the future, I hope to be a startup founder or an executive at a company.  A key component seems to be able to recruit a strong team.  Things are generally going well for me professionally (and I’m happy at my current job for now), but I feel that I could be doing more to expand my network and my ability to recruit a strong team in the future.  So my question to you is:<p>What concrete steps can a person take now to improve their ability to attract and hire a strong team with a diverse set of skills in a couple years?<p>A few ideas off the top of my head:\n- Try to have more ambitious and visible professional accomplishments at my current job.<p>- Blog more about lessons I&#x27;ve learned at work.<p>- Attend more technically oriented meetups &#x2F; conferences (although that seems difficult lately due to COVID).<p>- Put more effort into keeping in touch with past colleagues (although one downside is that my past peers have a similar skillset to me and I would want to find people to help balance out my skillset).<p>- Put extra effort into trying to recruit people for my current company. \n- Work for a few years at a larger company where I get exposure to experts in a variety of technical roles. (I work at a small startup and get exposure to a limited number of people).<p>- Find and attend more startup-related meetups (how to find such meetups with strong people)?<p>No matter how I slice it, it seems like forming such connections is going to be difficult (but of course, very valuable). Especially gaining visibility in domains where I’m not an expert.   Any thoughts you have would be appreciated!  If this post takes off, I&#x27;ll put the results into a blog post :)",
      "time": 1644858936,
      "title": "Ask HN: What can one do now to be more effective in hiring in the future?",
      "type": "story"
    },
    {
      "by": "philk10",
      "descendants": 0,
      "id": 30334633,
      "score": 1,
      "time": 1644858932,
      "title": "Build Goodwill with Your Software Client",
      "type": "story",
      "url": "https://spin.atomicobject.com/2022/02/14/build-goodwill-software-client/"
    },
    {
      "by": "cpeterso",
      "descendants": 0,
      "id": 30334606,
      "score": 1,
      "time": 1644858822,
      "title": "First look at Android 13 “Tiramisu” and some of its upcoming features",
      "type": "story",
      "url": "https://www.xda-developers.com/android-13-tiramisu-exclusive-first-look/"
    },
    {
      "by": "hollowdene",
      "descendants": 0,
      "id": 30334602,
      "score": 2,
      "time": 1644858816,
      "title": "Solving the mystery of PostHog’s missing session recordings",
      "type": "story",
      "url": "https://posthog.com/blog/missing-recordings"
    },
    {
      "by": "favourable",
      "descendants": 0,
      "id": 30334597,
      "score": 2,
      "text": "I use the bookmarklet here:<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;bookmarklet.html<p>But when I submit, the page only has the URL of the page I&#x27;m submitting and NOT THE TITLE.<p>Anyone else experiencing this?",
      "time": 1644858798,
      "title": "Ask HN: Is the Hacker News bookmarklet broken?",
      "type": "story"
    },
    {
      "by": "favourable",
      "descendants": 0,
      "id": 30334561,
      "score": 1,
      "time": 1644858702,
      "title": "How to Think About SEO",
      "type": "story",
      "url": "https://neilpatel.com/blog/how-to-think-about-seo/"
    }
  ]
}