{
  "stories": [
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30167917,
      "score": 1,
      "time": 1643744080,
      "title": "Finland to end all Covid-19 restrictions",
      "type": "story",
      "url": "https://au.news.yahoo.com/finland-end-covid-19-restrictions-180245796.html"
    },
    {
      "by": "shahahmed",
      "descendants": 0,
      "id": 30167893,
      "score": 1,
      "time": 1643743999,
      "title": "Our World Works Because of a Game of “Bet You Can’t”",
      "type": "story",
      "url": "https://www.doubtiswelcome.com/posts/hashcollision"
    },
    {
      "by": "steelstraw",
      "descendants": 0,
      "id": 30167890,
      "score": 1,
      "time": 1643743995,
      "title": "Lines are overrated, and empty restaurants are underrated",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2013/10/lines-are-overrated.html"
    },
    {
      "by": "arm",
      "descendants": 0,
      "id": 30167884,
      "score": 1,
      "time": 1643743961,
      "title": "QArt Codes (2012)",
      "type": "story",
      "url": "https://research.swtch.com/qart"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 30167868,
      "score": 1,
      "time": 1643743896,
      "title": "Tens of Thousands of Outdated HPE iLO Interfaces Exposed to the Internet and Ro",
      "type": "story",
      "url": "https://www.servethehome.com/tens-of-thousands-of-outdated-hpe-ilo-interfaces-exposed-to-the-internet-and-rootkits/"
    },
    {
      "by": "bbarnett",
      "descendants": 0,
      "id": 30167865,
      "score": 2,
      "text": "I&#x27;ve been using Google Maps a long time, and during all of that time I have only used GPS for location tracking on Android.<p>Depending upon the version of Android, I&#x27;ve had different things disabled.  Wifi scanning.  Bluetooth.  Cell location data.  Etc.  Always with one single goal -- GPS only for location.<p>And further, this is always, especially with newer versions of Android, restricted in many ways.  For example, only allowing when an app is active, and so on.<p>Google has always played games with Maps, using dark patterns.  For example, with the versions prior to the current version, if I wanted Maps to zoom in on my location, I&#x27;d hit the tracking button.<p>It&#x27;d first say something like &quot;To continue, turn on device location&quot;.  Of course, device location <i>is</i> on, but it&#x27;s only for GPS, and google <i>so badly</i> wants that (apparently) vital, and sweet wifi + bluetooth + cell tracking data.<p>Yet you could cancel this before, and it would then zoom in on your present location.  Because, of course, GPS works <i>fine</i> for that.<p>I could also use only GPS, leaving wifi and bluetooth and so on scanning off to use navigation.  I&#x27;ve driven all over North America and Europe that way too, and yes with Maps.  Tricky dark patterns (ie, lying) about needing wifi scanning to find a route is just insulting, and absurd.<p>Now, enter a new update.  I can no longer navigate with Google Maps, unless full location tracking is on.  Comments in Play Store indicate others hit the same wall.  Yeah, right Google, driving in the middle of the country, with GPS, is helped by scanning wifi while I pass farmer&#x27;s fields?!<p>Google has now drawn a line in the sand.  Give us all your local SSIDs, local bluetooth connections, with likely even more detail, or they now refuse to allow you to use Maps to navigate.<p>I immediately installed Organic Maps, and I&#x27;m sure there are loads of others as an option.<p>Google wants that wifi data <i>so bad</i>, that the only thing I can equate it to, is a used car salesperson.  I get the impression that the Maps team is channeling Sméagol, and just <i>shudder</i>.",
      "time": 1643743891,
      "title": "Google Maps now requires WiFi scanning to use navigation",
      "type": "story"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30167853,
      "score": 1,
      "time": 1643743838,
      "title": "Super Mario 64 port for the RG351P runs at 60fps",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=w5PSw19_SEo"
    },
    {
      "by": "erikbledsoe",
      "descendants": 0,
      "id": 30167843,
      "score": 1,
      "time": 1643743813,
      "title": "A Guide to Writing Code on an iPad",
      "type": "story",
      "url": "https://coder.com/blog/a-guide-to-writing-code-on-an-ipad"
    },
    {
      "by": "cuteboy19",
      "descendants": 1,
      "id": 30167840,
      "kids": [
        30167856
      ],
      "score": 1,
      "time": 1643743804,
      "title": "The Mysterious Origins of the Smallpox Vaccine",
      "type": "story",
      "url": "https://www.smithsonianmag.com/science-nature/mysterious-origins-smallpox-vaccine-180970069/"
    },
    {
      "by": "zimmerfrei",
      "descendants": 0,
      "id": 30167821,
      "score": 1,
      "time": 1643743720,
      "title": "Academic Journal Claims It Fingerprints PDFs for 'Ransomware,' Not Surveillance",
      "type": "story",
      "url": "https://m.slashdot.org/story/395753"
    }
  ]
}