{
  "stories": [
    {
      "by": "stared",
      "descendants": 0,
      "id": 31593257,
      "score": 1,
      "time": 1654165392,
      "title": "Kermit the Frog in various movies, generated by DALLE2",
      "type": "story",
      "url": "https://threadreaderapp.com/thread/1531506455714492416.html"
    },
    {
      "by": "itsjloh",
      "descendants": 0,
      "id": 31593248,
      "score": 1,
      "time": 1654165225,
      "title": "Installing a Payphone in My House",
      "type": "story",
      "url": "https://bert.org/2022/06/02/payphone/"
    },
    {
      "by": "noufalibrahim",
      "descendants": 0,
      "id": 31593236,
      "score": 2,
      "time": 1654165080,
      "title": "Rejecting data demands, ExpressVPN removes VPN servers in India",
      "type": "story",
      "url": "https://www.expressvpn.com/blog/remove-india-vpn-servers/"
    },
    {
      "by": "wycliffb",
      "descendants": 1,
      "id": 31593229,
      "kids": [
        31593230
      ],
      "score": 1,
      "time": 1654165046,
      "title": "What's your take on Flashlight, Facebook's Machine Learning toolkit?",
      "type": "story",
      "url": "http://GitHub.com/facebook/flashlight"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 31593214,
      "score": 1,
      "time": 1654164800,
      "title": "Trained dogs sniff out Covid-19 as well as lab tests do",
      "type": "story",
      "url": "https://www.sciencenews.org/article/covid-dog-detection-pcr-test-screening-coronavirus"
    },
    {
      "by": "car_analogy",
      "descendants": 1,
      "id": 31593209,
      "kids": [
        31593233
      ],
      "score": 2,
      "time": 1654164766,
      "title": "BBC ‘altered gender in trans rape claim’",
      "type": "story",
      "url": "https://www.thetimes.co.uk/article/bbc-altered-gender-in-trans-rape-claim-3cqj73tq5"
    },
    {
      "by": "mogoman",
      "descendants": 0,
      "id": 31593183,
      "score": 1,
      "text": "I&#x27;m trying to think up ideas of what I could do with an intermittent &quot;excess&quot; of electricity - only at certain hours of the day up to a certain (fixed) amount. Let&#x27;s say around 10kW hours a day between 12pm and 3pm (I&#x27;ve described my case below, but other people would have different scenarios).<p>Ideally the extra energy would be used to help reduce environmental impact rather than making money, so crypto mining (for example) is not an option.<p>Here are some of my thoughts:<p>- heat water for home usage (heat pump); this solution is already deployed, but there is only so much hot water one needs\n- charge an EV; I don&#x27;t own one presently, but it an option for the future\n- fight the current 70% rule in Germany (this is the cause of my excess, see below)\n- generate H2 via electrolysis; not sure what to do with H2 then. What would be interesting would be to be able to &quot;charge&quot; fuel cells and store them for use in winter, or compress H2 into cylinders? Not sure what can fit into my garage &#x2F; would be affordable.\n- pumped water storage; I suspect the energies involved at home are insignificant vs industrial hydro solutions\n- convert to microwave and beam into space\n- run an industrial press to compress my lawn cuttings &#x2F; garden waste into pellets and dump them into a deep lake\n- a magical machine that extracts Co2 from the air and produces a fine black powder which I could compress and dump into a deep lake\n- ...<p>Some background:<p>In Germany, excess domestic solar panel production can be pushed into the grid for a small (cash) refund, but there is a strange rule : only 70% of the maximum panel output is allowed to be pushed. So if the panels could generate 10kW at midday, without anything turned on at home, a maximum of 7kW can be pushed. This effect is only for a few &quot;peak sun&quot; hours (say 12pm to 3pm), but means that roughly 10kW hours of electricity is &quot;lost&quot; (the system is throttled back via the charge controller, so the energy isn&#x27;t lost or wasted, it just isn&#x27;t produced)",
      "time": 1654164489,
      "title": "Ask HN: Ideas for useful uses of excess electricity?",
      "type": "story"
    },
    {
      "by": "LiquidNitrogen",
      "descendants": 0,
      "id": 31593173,
      "score": 1,
      "text": "In our company we are looking to integrate a chat system for our app -- preferably highly scalable.<p>Is everyone using SocketIO + Nodejs. Or would implementing this in FastAPI not be a complete blunder? Also curios what storage is preferred RDB&#x2F;Redis&#x2F;NoSQL&#x2F;etc..",
      "time": 1654164427,
      "title": "Modern chat/messaging backend stack?",
      "type": "story"
    },
    {
      "by": "harrylucas",
      "descendants": 0,
      "id": 31593160,
      "score": 2,
      "text": "I&#x27;m an engineering manager at a growing startup and looking for advice on how other EM&#x27;s increase the performance (measured in whatever way you measure it e.g. impact on company metrics, features shipped etc.)?<p>One of the common answers to this is &#x27;depends on the issues you&#x27;re currently facing&#x27;, which is 100% the right approach, however I&#x27;d love to hear advice on how you identify these issue root causes. E.g. if the issue we are facing is that &#x27;the performance of the engineering team has degraded over the last X months&#x27; - (not an actual issue just an example) how would you approach identifying and subsequently solving such a broad issue?",
      "time": 1654164262,
      "title": "Ask HN: How do you increase the performance / impact of an engineering team?",
      "type": "story"
    },
    {
      "by": "elephcastle",
      "descendants": 0,
      "id": 31593146,
      "score": 1,
      "time": 1654164064,
      "title": "Show HN: Time Series Terminal",
      "type": "story",
      "url": "https://tsterm.com"
    }
  ]
}