{
  "stories": [
    {
      "by": "thewarpaint",
      "descendants": 0,
      "id": 29445784,
      "score": 1,
      "time": 1638665648,
      "title": "Yiddish Words Used in English",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Yiddish_words_used_in_English"
    },
    {
      "by": "theklub",
      "descendants": 0,
      "id": 29445772,
      "score": 1,
      "time": 1638665505,
      "title": "Parag Agrawal: Why Indian-Born CEOs Dominate Silicon Valley",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-59536519"
    },
    {
      "by": "aristofun",
      "descendants": 1,
      "id": 29445763,
      "kids": [
        29445816
      ],
      "score": 1,
      "text": "In some of the companies I worked for (or know of) disclosing your salary was not allowed by contract.<p>But in most — there was no serious barriers, but still it was never talked about among colleagues except between very close friends.<p>Why is that, i wonder?<p>Why it is sometimes in the contract — what does employer gain from it?<p>Why people tend to avoid these discussions even when it is not forbidden?",
      "time": 1638665424,
      "title": "Ask HN: Why salaries are not openly discussed?",
      "type": "story"
    },
    {
      "by": "e9",
      "descendants": 0,
      "id": 29445744,
      "score": 1,
      "time": 1638665249,
      "title": "Spiral Dynamics: The Ultimate Theory of Human Development",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=633_RWYzam4"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 29445742,
      "score": 1,
      "time": 1638665221,
      "title": "Focus Stacking",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Focus_stacking"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 29445731,
      "score": 1,
      "time": 1638665116,
      "title": "How Leisure Time Became Work",
      "type": "story",
      "url": "https://www.theatlantic.com/culture/archive/2021/12/americans-tv-watching-job/620862/"
    },
    {
      "by": "barry-cotter",
      "descendants": 0,
      "id": 29445715,
      "score": 4,
      "time": 1638665028,
      "title": "Nothing of what makes science work is published as text on the web",
      "type": "story",
      "url": "https://markusstrasser.org/p/bcd8bded-7136-4bb4-8f97-e8a3a7b6d926/"
    },
    {
      "by": "neelc",
      "descendants": 1,
      "id": 29445708,
      "kids": [
        29445726
      ],
      "score": 2,
      "text": "Disclaimer: I work at Microsoft in the Exchange&#x2F;Outlook umbrella. Outside of work, I am a FreeBSD Ports committer and a Tor Core Contributor, and my personal email runs Postfix, Dovecot, and Roundcube.<p>I noticed that when it comes to FOSS projects, especially older ones (as opposed to say Kubernetes or Vue.js) using mailman, or ones from the &quot;ThinkPad running GNU&#x2F;Linux&quot; crowd as opposed to the &quot;MacBook at a startup&quot; or &quot;Windows and .NET at a megacorp&quot; crowd, the former is big on inline posting. Maybe a &quot;newbie&quot; will top post but not active members of the list.<p>Yet most people outside of the FOSS world are accustomed to top posting. Even a mailing list like NANOG and everyone top posts, but at say KDE or GNU everyone inline posts outside of newbies.<p>I noticed this on the FreeBSD, Tor, Linux Kernel, and GNOME mailing lists as well, and everyone experienced is an inline poster. But in Microsoft internal emails, or even personal emails outside of @freebsd.org or @torproject.org or experienced Unix folks, and everyone top posts.<p>How come?<p>If I were to guess, people on FOSS mailing lists are unlikely to use Outlook, the norms were set from the Usenet days and people on those lists usually do not use Outlook (for those lists) and instead use a FOSS mail client.<p>I feel Outlook is frowned upon at FOSS mailing lists, whereas a FOSS email client is frowned upon at a conservative IT department who only knows Microsoft tools and nothing else (the same people who kept many stuck at IE6 at work and make life hell for webdevs).<p>I admittedly do find top posting annoying when I am use Windows Mail (or Outlook) at work (I mainly use WinMail since I *hate* Outlook). I feel top posting makes email overwhelming when the problem was &quot;solved&quot; pre-Outlook, and no wonder why we &quot;need&quot; Slack and Teams and Mattermost when we could have avoided it (not definite). But sometimes I have to do it at home since the recipient has no idea about inline posting.<p>But even I admittedly was trained to top post before I got very involved in self-hosting email and later become active in the FOSS communities, being an early Gen Z member myself.<p>Yes, I know I avoided talking about Gmail, but I don&#x27;t usually use Gmail a lot (I had Gmail accounts in the past and college used it also). I feel Gmail top posts by default but it is easier to inline post on Gmail, maybe since some Googlers were Linux folks but also didn&#x27;t want to alienate people coming from Outlook.",
      "time": 1638664887,
      "title": "Why are FOSS mailing lists heavy on inline-posting when everyone else top-posts?",
      "type": "story"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29445671,
      "score": 1,
      "time": 1638664428,
      "title": "Clearview AI on track to win U.S. patent for facial recognition technology",
      "type": "story",
      "url": "https://www.politico.com/news/2021/12/04/clearview-ai-facial-recognition-523735"
    },
    {
      "by": "greenfella",
      "descendants": 1,
      "id": 29445665,
      "kids": [
        29445666
      ],
      "score": 1,
      "time": 1638664366,
      "title": "A caching wrapper script for /bin/sort",
      "type": "story",
      "url": "https://github.com/seanhly/cachesort"
    }
  ]
}