{
  "stories": [
    {
      "by": "singam96",
      "descendants": 0,
      "id": 31718603,
      "score": 1,
      "time": 1655070459,
      "title": "Watercolor AI",
      "type": "story",
      "url": "https://play.google.com/store/apps/details?id=ai.dur.watercolorai&hl=en_US&gl=US"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 31718583,
      "kids": [
        31718584
      ],
      "score": 1,
      "time": 1655070286,
      "title": "To see the Universe more clearly, think in terms of processes, not objects",
      "type": "story",
      "url": "https://aeon.co/videos/to-see-the-universe-more-clearly-think-in-terms-of-processes-not-objects"
    },
    {
      "by": "ethbr0",
      "descendants": 0,
      "id": 31718577,
      "score": 1,
      "time": 1655070278,
      "title": "The original double deck hamburger",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Big_Boy_Restaurants"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 31718569,
      "score": 1,
      "time": 1655070193,
      "title": "Ukraine war: Evidence shows widespread use of cluster munitions in Kharkiv",
      "type": "story",
      "url": "https://www.bbc.com/news/world-europe-61778433"
    },
    {
      "by": "transpute",
      "descendants": 0,
      "id": 31718541,
      "score": 1,
      "time": 1655069994,
      "title": "Using microarchitecture bugs to beat authenticated pointers",
      "type": "story",
      "url": "https://seclists.org/dailydave/2022/q2/2"
    },
    {
      "by": "cmrdporcupine",
      "descendants": 0,
      "id": 31718521,
      "score": 1,
      "text": "Background: VST3 is a crossplatform (Windows, OSX, Linux) API and SDK for developing audio effects and synthesizers to be run inside digital audio workstations etc.<p>Steinberg&#x27;s VST3 SDK includes their own bespoke cross platform GUI framework.<p>No offence to the super talented devs at Steinberg, but it&#x27;s kind of frustrating. It&#x27;s missing a lot of stuff, is badly documented, has no facilities for accessibility, etc. So I went looking for alternatives.<p>Embedding something like QT ends up with a bunch of issues involving the threading model and so on. Others have tried and failed.<p>There&#x27;s stuff like JUCE as well but it&#x27;s not just a UI framework but a whole toolkit with its own world view and licensing etc.<p>Then I got thinking about how -- as much as I kind of hate it -- the web is really the standard for cross platform UIs. These days it&#x27;s pretty fast even on fairly low end devices. Lots of toolkit options. Canvas support. Multiple languages. Decent security model. And both Windows and Mac come with embeddable webview components (Edge and Webkit).<p>So I threw together:<p>https:&#x2F;&#x2F;github.com&#x2F;rdaum&#x2F;vstwebview&#x2F;blob&#x2F;main&#x2F;README.md<p>Still a bit rough around the edges and somewhat untested, but would love contributions.",
      "time": 1655069850,
      "title": "Show HN: Vstwebview, write VST3 audio plugin UIs using webtech",
      "type": "story"
    },
    {
      "by": "maxxsh",
      "descendants": 0,
      "id": 31718503,
      "score": 1,
      "time": 1655069720,
      "title": "Audio Support for Grandiose Projects",
      "type": "story",
      "url": "https://www.codeproject.com/Articles/323922/Audio-support"
    },
    {
      "by": "batguano",
      "descendants": 0,
      "id": 31718495,
      "score": 2,
      "time": 1655069656,
      "title": "Google Sidelines Engineer Who Claims Its A.I. Is Sentient",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/12/technology/google-chatbot-ai-blake-lemoine.html"
    },
    {
      "by": "brooksdra",
      "descendants": 0,
      "id": 31718479,
      "score": 1,
      "text": "Many years ago, I heard a Tim Ferris podcast with Robert Rodriguez is an avid journaler and used a bunch of Word documents to organize his daily notes. Ever since then, I couldn&#x27;t get my mind off of a personal journaling system primarily organized by day; with a secondary topical organization by Label. After a few false starts of my own and wasting about $10K on an off-shore development company, I was still left with nothing. Recently, I decided to give it one more push and developed the first draft of my dream journaling tool.<p>I&#x27;m a developer, I want to also be a writer. Development comes much easier to me than writing.<p>This is an Angular app deployed into Firebase. This was my first time using Firebase. I never published an app in public before because I don&#x27;t feel like I know enough about security. Firebase took all of the thinking out of it (I hope).<p>Still ugly and have a ways to go, but wanted to share this to see what people think. (Note if document comes up blank, hit refresh :).",
      "time": 1655069519,
      "title": "Show HN: App for Daily Journaling",
      "type": "story",
      "url": "https://journal-ease.com/"
    },
    {
      "by": "fortran77",
      "descendants": 0,
      "id": 31718471,
      "score": 1,
      "time": 1655069442,
      "title": "She got an STD during car sex. Now, Geico could pay her $5.2M",
      "type": "story",
      "url": "https://www.washingtonpost.com/nation/2022/06/09/geico-std-car-sex-missouri-insurance/"
    }
  ]
}