{
  "stories": [
    {
      "by": "teekay",
      "descendants": 0,
      "id": 31810488,
      "score": 1,
      "text": "I plan to move to NYC later this year to grow my budding agency. I think having a pre-warmed network of friends by the time I land would be great, as opposed to pounding the pavement on day 1 or 2 with nobody to talk to.<p>I checked Meetup, and there seems to be a lot going on, although many events are still virtual - would a bummer if I was already there, but now I can actually join without being there yet.<p>Do you know any other online places I could go to make friends? Any Slack channels worth joining? Or, am I being silly?<p>To be clear I am simply looking for make friends, not to network for business purposes.<p>Thanks!",
      "time": 1655733895,
      "title": "Ask HN: Connecting with Fellow Hackers in NYC",
      "type": "story"
    },
    {
      "by": "RBBronson123",
      "descendants": 0,
      "id": 31810471,
      "score": 1,
      "text": "Two weeks ago, I announced that I was shutting down my companies, 70 Million Jobs and Commissary Club (companies that helped the formerly incarcerated get on with their lives). The overwhelming volume of support I received just through Bookface and Hacker News stunned me; my heart overflowed with pride and gratitude.<p>Now I am facing another challenge: I need a job. I’ve spoken with many recruiters and HR professionals, along with people who are interested in either acquiring my company(s), funding them or just want to make themselves available for a chat. I’ve received offers for leadership positions at nonprofits, but I haven’t yet discovered the right fit. Maybe I love the startup life too much. Maybe my criminal record hurts my chances. (Maybe!?!) Maybe my age is a deterrent.<p>Before I accept a position that doesn’t thrill me, I thought I’d get the word out to the YC community. Perhaps your company has—or has been considering—beginning a foundation or some other mission-based, social impact endeavor. Perhaps you need to hire lots of folks for your work force and want to seriously access the largely ignored 70 million Americans with records. I can help.<p>What else am I very good at? Business development, sales training and management.<p>Please note: I’m not very technical.<p>If you’ve got ideas, I’d love to hear them. Thanks for your time and consideration.",
      "time": 1655733771,
      "title": "I Shut Down My Company. Now I Need a Job",
      "type": "story"
    },
    {
      "by": "mister_goo",
      "descendants": 0,
      "id": 31810467,
      "score": 1,
      "time": 1655733744,
      "title": "The Eponymous Mr. Ponzi",
      "type": "story",
      "url": "https://www.damninteresting.com/the-eponymous-mr-ponzi/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 31810451,
      "score": 2,
      "time": 1655733652,
      "title": "Special Surfaces Remain Distinct in Four Dimensions",
      "type": "story",
      "url": "https://www.quantamagazine.org/special-surfaces-remain-distinct-in-four-dimensions-20220616/"
    },
    {
      "by": "jamesxaviers23",
      "descendants": 0,
      "id": 31810444,
      "score": 1,
      "time": 1655733632,
      "title": "How to Hire React JavaScript Developer and Know Its Costs?",
      "type": "story",
      "url": "https://brotechnologyx.com/react-js-developer/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31810430,
      "score": 2,
      "time": 1655733556,
      "title": "The Great Boreout: How Boredom Can Cause Burnout, Too",
      "type": "story",
      "url": "https://melmagazine.com/en-us/story/boreout-vs-burnout"
    },
    {
      "by": "rockbruno",
      "descendants": 0,
      "id": 31810425,
      "score": 1,
      "time": 1655733533,
      "title": "How necessary are the programming fundamentals?",
      "type": "story",
      "url": "https://swiftrocks.com/how-necessary-are-the-programming-fundamentals"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31810416,
      "score": 1,
      "time": 1655733475,
      "title": "What to Do When Your Feedback Doesn't Land",
      "type": "story",
      "url": "https://larahogan.me/blog/feedback-doesnt-land/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31810405,
      "score": 3,
      "time": 1655733405,
      "title": "A List of Developer Newsletters",
      "type": "story",
      "url": "https://draft.dev/learn/the-ultimate-list-of-developer-newsletters"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31810398,
      "score": 1,
      "time": 1655733366,
      "title": "This is A Weirder Moment Than You Think",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/19/opinion/its-not-the-future-we-cant-see.html"
    }
  ]
}