{
  "stories": [
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 27981626,
      "score": 1,
      "time": 1627461905,
      "title": "Carl Pei’s Nothing launches $99 ear (1) earbuds with ANC and Google Fast Pair",
      "type": "story",
      "url": "https://9to5google.com/2021/07/27/carl-peis-nothing-launches-99-ear-1-earbuds-with-anc-google-fast-pair-support/"
    },
    {
      "by": "chippy",
      "descendants": 0,
      "id": 27981621,
      "score": 1,
      "time": 1627461875,
      "title": "San Francisco considers spending $20K on smart trashcan prototypes",
      "type": "story",
      "url": "https://www.ktvu.com/news/san-francisco-considers-spending-20k-on-trash-can-prototypes"
    },
    {
      "by": "sriteja",
      "descendants": 0,
      "id": 27981607,
      "score": 1,
      "text": "Hi HN, we’re Aditya &amp; Sri Teja, founders of Swipe(https:&#x2F;&#x2F;getswipe.in). We make it easy for local businesses in India to invoice their customers over WhatsApp. Instead of giving a paper invoice to a customer, Swipe users send a WhatsApp message with a link that allows the customer to pay instantly with a variety of payment methods. We also generate instant reports for tax filing every month!<p>We were building software and IoT for industrial automation before we started working on this. We deal with a lot of invoices, purchase orders and estimates to different customers&#x2F;vendors on a daily basis. We used to manually make invoices on spreadsheets and store them locally on our computers. Initially, it was working fine but as we got more sales it started to get difficult for us to manage. On top of that, we had to file monthly tax returns where we would manually consolidate our sales on spreadsheets and send them to our accountant for filing. The whole process is tedious and the existing software available to do it is riddled with accounting jargon and primarily targeted towards professional accountants.<p>We quickly realized that these efforts were not helping the company and that the time and energy would be better spent on talking to our customers and focusing on our product. Interestingly, we also found out that most of the ~75M SMEs in India still rely on manual processes in tracking sales, purchasing inventory, cash management, tax filings, and payments—all highly inaccurate and inefficient and a huge opportunity for us to make an impact.<p>We launched with a simple MVP, with just the Sales module in January and recruited our first few customers. With continuous feedback from our initial customers, we quickly iterated and improved our MVP and started adding Purchases, Estimates, Expenses and Inventory modules. Now we have over 1000 businesses onboarded with us and growing.<p>Using Swipe, now business owners can create invoices, purchase orders and quotations in a few seconds without any accounting knowledge. Based on their sales, purchases and expenses, we automatically update inventory, payables &amp; receivables and make it easy for them to manage accounting and tax filing.<p>Thanks for reading. We would love to hear your thoughts, experiences and the time you spend on accounting and tax filing. We are live on https:&#x2F;&#x2F;getswipe.in. Please share your feedback with us.",
      "time": 1627461644,
      "title": "Show HN: Swipe (YC S21) – Simple Billing and Accounting for India",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27981595,
      "score": 1,
      "time": 1627461566,
      "title": "Malware increasingly targets Discord users by host, spread, and control malware",
      "type": "story",
      "url": "https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/"
    },
    {
      "by": "shankysingh",
      "descendants": 0,
      "id": 27981593,
      "score": 1,
      "time": 1627461557,
      "title": "DHL “Lost” My AirTag Parcel (but I knew where it was)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=W8SER24F0U8"
    },
    {
      "by": "h1x",
      "descendants": 0,
      "id": 27981555,
      "score": 1,
      "time": 1627461096,
      "title": "Linux (and other kernels) distro with no GNU components",
      "type": "story",
      "url": "https://github.com/iglunix/iglunix"
    },
    {
      "by": "rodrigo975",
      "descendants": 0,
      "id": 27981547,
      "score": 1,
      "time": 1627461012,
      "title": "PulseAudio 15.0 with FreeBSD Support",
      "type": "story",
      "url": "https://www.freedesktop.org/wiki/Software/PulseAudio/Notes/15.0/"
    },
    {
      "by": "pmoriarty",
      "descendants": 0,
      "id": 27981534,
      "score": 2,
      "time": 1627460859,
      "title": "Cannabis part of the future says tobacco giant",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/business-57995285"
    },
    {
      "by": "yusuf_giftworks",
      "descendants": 0,
      "id": 27981531,
      "score": 1,
      "time": 1627460818,
      "title": "Why Olympians Are Struggling to Get Sponsorships",
      "type": "story",
      "url": "https://thewalrus.ca/loveofthegame-why-olympians-are-struggling-to-get-sponsorships/"
    },
    {
      "by": "rullopat",
      "descendants": 1,
      "id": 27981529,
      "kids": [
        27981620
      ],
      "score": 2,
      "text": "Looking at the other posts on HN about the topic, I think I&#x27;ll really feeling burnout: I most probably need a change of career between different IT jobs (from automation tester to something else) or even a most drastic change, I still need to figure it out.\nThe problem is, as many do, I need an income, I cannot afford to just stop working and take a sabbatical.\nWhat&#x27;s your advice on how to cope with the situation? Thanks!",
      "time": 1627460795,
      "title": "Ask HN: I'm burnout but I cannot afford to stop working. What next?",
      "type": "story"
    }
  ]
}