{
  "stories": [
    {
      "by": "jesuswr",
      "descendants": 0,
      "id": 28589001,
      "score": 1,
      "text": "Hello!<p>I am working on a text classifier but at the moment im quite lost on what to do.<p>The classes form a tree with three levels, for example: class A (level 1), class A.1 (level 2, subclass of A) and class A.1.a (level 3, subclass of A.1).<p>I have a lot of texts but without labels, also its hard to create a set of labeled data because of the big number of classes.<p>I&#x27;ve looked at word embeddings, clustering algorithms, topic modeling, keyword extraction algorithms and other approaches but im not sure whats would be a good way to proceed.<p>Also im not sure how to evaluate the success of the classifier, maybe i could build a small dataset but i wanted to know if there was any other option<p>At the moment the idea that i like most is classifying by the level of the class, for example: given a text t, get the first level class of t, lets say B, then get the second level class of t (only taking the subclasses of B), lets say B.4, and finally get the third level class of t (only taking the subclasses of B.4), lets say B.4.c, and finally we could say that the class of t is B.4.c.<p>So i wanted to ask here for advices to continue on this classifier and evaluate its success, thanks! :)",
      "time": 1632095044,
      "title": "Question about text classification without labeled data",
      "type": "story"
    },
    {
      "by": "RyTheGuy",
      "descendants": 2,
      "id": 28588983,
      "kids": [
        28588984
      ],
      "score": 2,
      "time": 1632094922,
      "title": "Show HN: An extension to gather leads from anywhere",
      "type": "story",
      "url": "https://drive.google.com/file/d/1rTVUi9JFCnvNGzmw1JzQ97N1BpTWyOei/view"
    },
    {
      "by": "momentum_j",
      "descendants": 0,
      "id": 28588958,
      "score": 1,
      "time": 1632094653,
      "title": "Acting on Advice",
      "type": "story",
      "url": "https://www.julian.com/blog/starting-principles"
    },
    {
      "by": "barredo",
      "descendants": 0,
      "id": 28588952,
      "score": 1,
      "time": 1632094567,
      "title": "A new app helps Iranians hide messages in plain sight",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/09/a-new-app-helps-iranians-hide-messages-in-plain-sight/"
    },
    {
      "by": "mikkel125",
      "descendants": 0,
      "id": 28588949,
      "score": 1,
      "text": "I&#x27;m a dev myself, and also someone with a lot of ideas (mainly SaaS, online businesses etc). In the past couple of years I&#x27;ve built most of these ideas (or at least some kind of MVP) myself, and had fun doing so. However, as I get older, I don&#x27;t want to code that much anymore.<p>I&#x27;m looking for a long-term companion to code stuff for me. I just got an idea for a new search engine? I&#x27;ll ask them to hack a crawler for it. I want to extract some data from a dataset and build some visualization? Call them to write the SQL queries and make a graph.<p>I guess a freelancer is the closest to what I&#x27;m looking for. However, whereas freelancers are generally mission-based, I&#x27;d want someone 1&#x2F; for the longer term to reduce search effort per mission, and 2&#x2F; ideally with the following traits:\n- an early-stage startup CTO mindset,\n- jack of all trades,\n- expert writing dirty&#x2F;hacky code,\n- has fun doing hackathons or weekend side projects.<p>A &quot;dev concierge&quot; is the closest analogy I can think of.<p>Some more practical details that may help: Billed by the hour, remote, market rate. Each &quot;mission&quot; takes maybe 20-40 hours to complete, and I have 1-2 of those ideas per month, constantly.",
      "time": 1632094541,
      "title": "Ask HN: Where can I find a dev concierge?",
      "type": "story"
    },
    {
      "by": "zeristor",
      "descendants": 1,
      "id": 28588931,
      "kids": [
        28588970
      ],
      "score": 1,
      "time": 1632094370,
      "title": "Has Henrik Stiesdal nailed yet another market disruptor? [video]",
      "type": "story",
      "url": "https://youtube.com/watch?v=6tEkRRec3NE"
    },
    {
      "by": "codetrotter",
      "descendants": 0,
      "id": 28588903,
      "score": 1,
      "time": 1632094056,
      "title": "Integrating Notmuch with NeoMutt",
      "type": "story",
      "url": "https://wiki.archlinux.org/title/Notmuch#Integrating_with_NeoMutt"
    },
    {
      "by": "for_i_in_range",
      "descendants": 0,
      "id": 28588901,
      "score": 1,
      "time": 1632094035,
      "title": "The Fundamental Component Missing from Digital Zettelkastens",
      "type": "story",
      "url": "https://daily.scottscheper.com/num/243/"
    },
    {
      "by": "curiousgeorgio",
      "descendants": 4,
      "id": 28588896,
      "kids": [
        28589009,
        28589010,
        28588915,
        28588906
      ],
      "score": 9,
      "text": "I&#x27;ve noticed a ton of crypto scams on YouTube recently, many of which are using the names of legitimate channels (like SpaceX), re-posting content from those channels and promoting scams – usually in the form of &quot;send me [Elon Musk, Jeff Bezoz, etc] BTC, and I&#x27;ll send you 2x back&quot;.<p>It seems reasonable to expect one or two of these to slip through the cracks now and then, but over the past few months, I&#x27;ve had YouTube &quot;recommend&quot; these to me, again and again, multiple times per day. I&#x27;ve often reported them as spam, only to have YouTube <i>recommend the exact same video to me a few minutes later</i>. I don&#x27;t know anyone who would fall for the scams in the videos, but they&#x27;ve become so common now that it&#x27;s getting <i>really</i> annoying.<p>You can&#x27;t tell me that they&#x27;re too difficult to distinguish from legitimate content. Any human being or half-decent algorithm would be able to catch these with no trouble at all (heck, I could write a couple of regular expressions that would do the trick and have 0 false positives), which leads me to wonder: why is YouTube promoting these videos? At this point, it feels like they must have some incentive <i>not</i> to shut them down, because it would require deliberate effort to have <i>any</i> form of spam control while also somehow letting these through.<p>Am I the only one noticing this?",
      "time": 1632093992,
      "title": "YouTube has a spam problem, and it's getting worse",
      "type": "story"
    },
    {
      "by": "arnavbathla",
      "descendants": 1,
      "id": 28588893,
      "kids": [
        28588894
      ],
      "score": 2,
      "time": 1632093976,
      "title": "Show HN: CRM for Social Consumer Apps",
      "type": "story",
      "url": "https://drive.google.com/file/d/1rTVUi9JFCnvNGzmw1JzQ97N1BpTWyOei/view?usp=sharing"
    }
  ]
}