{
  "stories": [
    {
      "by": "Abishek_Muthian",
      "descendants": 0,
      "id": 30804893,
      "score": 1,
      "text": "I need to get up from my chair and take a walk at regular intervals for medical reasons, But I often forget to do that when I&#x27;m immersed with work, So I wanted a solution which reminds me to take a walk at regular intervals automatically.<p>Hence I created Butt Mover to solve that problem, It has two parts;<p>1. Butt Trigger: An ESP8266 based button switch which goes under a butt cushion on the chair and is connected to the computer.<p>2. Butt Mover: The game which starts the task timer (25 minute interval) when we sit on the chair and reminds to take a walk when the timer ends(with audio). When we get up from the chair the break timer (5minutes for 5 tasks and a long break for 30 minutes) starts and reminds to get back to the seat when the timer ends.<p>Those who cannot build the Butt Trigger, Can start the timers manually but that removes the major advantage of not having to focus explicitly on Butt Mover.<p>I&#x27;ve been using a crude version of this setup for past two years with good improvement in my productivity and health; So I finally created a version which is more accessible to others upon suggestion from many including some from HN.<p>I hope you can try Butt Mover, Especially with the Butt Trigger and if you liked what it does then you can also build and sell Butt Trigger for others who are interested.",
      "time": 1648229101,
      "title": "Show HN: Butt Mover, an IRL Productivity and Health Improvement Game",
      "type": "story",
      "url": "https://buttmover.com"
    },
    {
      "by": "tannerljohnson",
      "descendants": 0,
      "id": 30804886,
      "score": 1,
      "time": 1648229053,
      "title": "Show HN: Good Table is a no-code database for small businesses",
      "type": "story",
      "url": "https://verygoodtable.com/"
    },
    {
      "by": "DemiGuru",
      "descendants": 0,
      "id": 30804861,
      "score": 1,
      "time": 1648228971,
      "title": "Estonian Tied to 13 Ransomware Attacks Gets 66 Months in Prison",
      "type": "story",
      "url": "https://krebsonsecurity.com/2022/03/estonian-tied-to-13-ransomware-attacks-gets-66-months-in-prison/"
    },
    {
      "by": "simontheowl",
      "descendants": 0,
      "id": 30804853,
      "score": 2,
      "time": 1648228943,
      "title": "60% of Russian missiles fail in the field",
      "type": "story",
      "url": "https://www.reuters.com/business/aerospace-defense/exclusive-us-assesses-up-60-failure-rate-some-russian-missiles-officials-say-2022-03-24/"
    },
    {
      "by": "gxs",
      "descendants": 1,
      "id": 30804845,
      "kids": [
        30804876
      ],
      "score": 1,
      "time": 1648228913,
      "title": "Software Quality Metrics",
      "type": "story",
      "url": "https://www.developer.com/design/software-quality-metrics/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30804835,
      "score": 1,
      "time": 1648228852,
      "title": "Barbarians at the Gateways (2013)",
      "type": "story",
      "url": "https://queue.acm.org/detail.cfm?id=2536492"
    },
    {
      "by": "clankyclanker",
      "descendants": 1,
      "id": 30804824,
      "kids": [
        30804866
      ],
      "score": 2,
      "text": "Is there a name for the feeling like you&#x27;re about to trip and fall that you get, when a UI is inconsistent?<p>For example, if a New Document Wizard uses Alt+N (&quot;Next&quot;) to proceed through several screens of input, before switching to Alt+D (&quot;Done&quot;) at the last screen.  At that point, you need to get out of the habit of using &quot;Next&quot; to proceed and start using your new document, and must use &quot;Done&quot; instead.<p>Every time I hit one of those weird little UI inconsistencies, it makes me feel like I&#x27;m about to trip and fall like in music, when a drummer misses the beat.",
      "time": 1648228807,
      "title": "Ask HN: Name of when inconsistent UI makes you feel like youre about to stumble",
      "type": "story"
    },
    {
      "by": "jmmv",
      "descendants": 0,
      "id": 30804796,
      "score": 1,
      "time": 1648228632,
      "title": "From macOS to Windows – A one year review",
      "type": "story",
      "url": "https://jmmv.dev/2022/03/a-year-on-windows-intro.html"
    },
    {
      "by": "kashav",
      "descendants": 1,
      "id": 30804792,
      "kids": [
        30804829,
        30804822
      ],
      "score": 1,
      "text": "Was watching [this curl talk][talk] from Daniel Stenberg and he included a graph of the number of command line options that curl has accepted over the years (around the 6 minute mark).<p>Got curious if there&#x27;s any prior art&#x2F;research&#x2F;projects&#x2F;attempts&#x2F;thoughts on shipping command line software that rids the use of command line flags. Other than config files, I can&#x27;t imagine what they&#x27;d be replaced with.<p>[talk]: https:&#x2F;&#x2F;vimeo.com&#x2F;692145160",
      "time": 1648228605,
      "title": "Ask HN: Command line flags?",
      "type": "story"
    },
    {
      "by": "Jimmc414",
      "descendants": 1,
      "id": 30804777,
      "kids": [
        30804844
      ],
      "score": 1,
      "time": 1648228527,
      "title": "John Hopkins:Technologies to Address Global Catastrophic Biological Risks (2021) [pdf]",
      "type": "story",
      "url": "https://jhsphcenterforhealthsecurity.s3.amazonaws.com/181009-gcbr-tech-report.pdf"
    }
  ]
}