{
  "stories": [
    {
      "by": "ribx",
      "descendants": 0,
      "id": 28216840,
      "score": 1,
      "time": 1629250720,
      "title": "Show HN: Infinity Maps – first knowledge worker tool build on a gaming framework",
      "type": "story",
      "url": "https://app.infinitymaps.io/maps/HFD2jf2Rgb4/LmnTQ2bpTGq"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28216831,
      "score": 1,
      "time": 1629250622,
      "title": "Fierce Pharma",
      "type": "story",
      "url": "https://www.fiercepharma.com/"
    },
    {
      "by": "latchkey",
      "descendants": 0,
      "id": 28216820,
      "score": 1,
      "time": 1629250527,
      "title": "Muzzle sent to vaccine expert was bought on Amazon, credit card in her name",
      "type": "story",
      "url": "https://www.nbcnews.com/news/us-news/muzzle-sent-tenn-vaccine-expert-bought-amazon-account-credit-card-n1277017"
    },
    {
      "by": "hncurious",
      "descendants": 0,
      "id": 28216772,
      "score": 2,
      "time": 1629250081,
      "title": "CA drought: Past dry periods have lasted more than 200 years, scientists say",
      "type": "story",
      "url": "https://www.mercurynews.com/2014/01/25/california-drought-past-dry-periods-have-lasted-more-than-200-years-scientists-say/"
    },
    {
      "by": "tasdfqwer0897",
      "descendants": 0,
      "id": 28216741,
      "score": 2,
      "time": 1629249846,
      "title": "Program Synthesis with Large Language Models",
      "type": "story",
      "url": "https://twitter.com/gstsdn/status/1427794393373626368"
    },
    {
      "by": "vtriolet",
      "descendants": 0,
      "id": 28216736,
      "score": 2,
      "time": 1629249773,
      "title": "An Apple Affray",
      "type": "story",
      "url": "https://hackerfactor.com/blog/index.php?/archives/930-An-Apple-Affray.html"
    },
    {
      "by": "AndreaVass",
      "descendants": 0,
      "id": 28216733,
      "kids": [
        28216826
      ],
      "score": 6,
      "text": "Hi Hacker News,<p>I’m Andrea and I have a strange problem with Google that I’m wondering if any of you here can advise about. It’s affecting several people with the same name as me, whose lives are being impacted.<p>In January 2021, I published a non-fiction book about a difficult, traumatic topic: my victimization and sex crimes that I witnessed toward other women. Because I am a victim, I chose not to put a photo of myself online. In fact, I have never ever taken a selfie nor had a photo of myself online.<p>Four months after I published my book, Google created a knowledge panel for me and, because I didn’t have a photo online, they just grabbed a photo of another Andrea Vassell who lives in Canada and displayed it alongside my book and claimed this woman was the author. After spending weeks sending feedback and trying to get help from Google support, they finally deleted the woman’s photo, but then promptly replaced it with another Andrea Vassell who is a pastor in New York. She, the pastor in New York, wrote to me that she has been “attacked” because people believe she is me.<p>I contacted Google again and asked them to please delete the knowledge panel because I did not have a photo on the Internet; therefore, any photo that they displayed alongside my book would be of the wrong person. By this time, some of the characters in my book were also being negatively affected because now it seemed they had harmed a pastor of a church.<p>I kept contacting Google and finally at the end of May, the knowledge panel was deleted, only to return a week later with a photo of a man who had been fired for his threats toward me. That photo remained until July 2021, and was then replaced with the pastor in New York again, although this time it’s a different photo of her.<p>I know that I am not a celebrity or an important person, but I spent two years writing a very difficult and personal book and to have a large corporation come along and continuously and consistently misrepresent my work and cause distress to others is becoming exceedingly stressful for everyone involved.<p>I contacted the Federal Trade Commission and they told me to contact the BBB and IC3.gov. I received an automated response from BBB and I don’t understand the reasoning behind contacting IC3.gov. I am currently working on a second book which I assume will be added to this knowledge panel with the photo of the wrong woman.<p>I would greatly appreciate any input about how to get this corrected so that I and others can move on. I know this is probably just an algorithmic glitch, but it’s affecting not only me but several others, and at this point I have no idea how to get Google to take it seriously.",
      "time": 1629249759,
      "title": "Ask HN: Google is confusing me with others in a harmful way-what can I do?",
      "type": "story"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 28216732,
      "score": 1,
      "time": 1629249737,
      "title": "Integer Overflow to RCE – ManageEngine Asset Explorer Agent (CVE-2021–20082)",
      "type": "story",
      "url": "https://medium.com/tenable-techblog/integer-overflow-to-rce-manageengine-asset-explorer-agent-cve-2021-20082-7e54cb2caad5"
    },
    {
      "by": "eric-hu",
      "descendants": 0,
      "id": 28216713,
      "score": 1,
      "time": 1629249495,
      "title": "Blue Origin Sues NASA over Lunar Lander Contract Given to Rival SpaceX",
      "type": "story",
      "url": "https://text.npr.org/1028480777"
    },
    {
      "by": "testrun",
      "descendants": 0,
      "id": 28216699,
      "score": 7,
      "time": 1629249363,
      "title": "As murders surge, Democrats find a new message: Fund the police",
      "type": "story",
      "url": "https://www.reuters.com/world/us/murders-surge-democrats-find-new-message-fund-police-2021-08-17/"
    }
  ]
}