{
  "stories": [
    {
      "by": "pella",
      "descendants": 0,
      "id": 31689284,
      "score": 1,
      "time": 1654827763,
      "title": "The Beyond the Imitation Game Benchmark (Big-Bench)",
      "type": "story",
      "url": "https://github.com/google/BIG-bench"
    },
    {
      "by": "samclemens",
      "descendants": 0,
      "id": 31689279,
      "score": 1,
      "time": 1654827704,
      "title": "The Book of Record of the Time Capsule of Cupaloy (1939)",
      "type": "story",
      "url": "https://en.wikisource.org/wiki/Book_of_Record_of_the_Time_Capsule_of_Cupaloy"
    },
    {
      "by": "sorenjan",
      "descendants": 0,
      "id": 31689276,
      "score": 1,
      "time": 1654827640,
      "title": "Spotify Shares Our Vision to Become the World’s Creator Platform",
      "type": "story",
      "url": "https://newsroom.spotify.com/2022-06-08/spotify-shares-our-vision-to-become-the-worlds-creator-platform/"
    },
    {
      "by": "Leftium",
      "descendants": 0,
      "id": 31689274,
      "score": 1,
      "text": "&quot;Musical dyslexia&quot; isn&#x27;t quite the right term (what is a better term?) I have trouble anticipating&#x2F;&quot;feeling&quot; music when (swing) dancing. So I have trouble recognizing&#x2F;recalling musical patterns; not necessarily reading musical notation.<p>Dyslexics can learn how to read, but they need to be taught differently. Is there some type of musical training for people like me? I managed to learn how to feel&#x2F;anticipate 8-count beats, but can&#x27;t get beyond 8-counts (while dancing). I even tried building a beat-aware video player[1] to help me learn musicality.<p>I&#x27;ve heard the argument musicality is acquired, not learned. I think acquisition would be better, but does not rule out learning. For example, I never heard about &quot;uncountable nouns&quot; while learning English as a native speaker; only in the context of ESL. This is English grammar native speakers acquire, but ESL students tend to learn. But there doesn&#x27;t seem to be any &quot;ESL&quot; for music.<p>I can read sheet music and understand musical patterns at an intellectual level. However, despite taking piano lessons for more than two years, I didn&#x27;t understand some fundamental musical concepts (like the emphasis on the &quot;1&quot; beat) until over a decade later when learning how to dance.<p>During that whole time, I was listening to music all the time. Although vaguely aware of what a 3-count waltz beat was, my mind was blown when I learned you could waltz to a Bryan Adams song I had heard over and over before. So I think I have some type of music learning disability.<p>Often when music breaks dancers will stop with the music. I couldn&#x27;t figure how other dancers knew when to do this. Did they memorize the songs? Even armed with the knowledge that (big band&#x2F;pop) music often follows a very regular repeating 32-count pattern, it&#x27;s very hard for me to predict exactly when the music will break (especially while dancing at the same time).<p>Apparently another way to feel the music is by the relative intensity of major beats. The first beat in a bar is usually the strongest; the last beat the weakest. Likewise, in a set of 2, 4, 8 bars the first beat will be strongest and the last beat the weakest. I explained this in more detail here[2]. In addition, there&#x27;s often a &quot;ramp-up&quot; or &quot;ramp-down&quot; in the final bars of an 8-bar set leading to the big &quot;1&quot; beat of the next 8-bar set. So there is a spectrum of relative intensities correlated to position in the music.<p>Unfortunately, I either lack the ability to recall more than the most recent 8 beats and&#x2F;or sense the fine differences in the relative intensity of the beats. My mind seems to be better at processing visual information slowly and recalling summaries; not processing audio information in real-time and verbatim recall.<p>I would be happy just to be able to feel the basic 32-count beat patterns. But I know there are even more layers to musicality. Like picking out the melody or a specific instrument. Apparently songs have structure and &quot;tell&quot; a story (outside the lyrics) which just goes completely over my head.<p>[1]: https:&#x2F;&#x2F;phrasier.leftium.com&#x2F;\n[2]: https:&#x2F;&#x2F;cafe.naver.com&#x2F;hotcoolswing&#x2F;7922",
      "time": 1654827626,
      "title": "Ask HN: How to Overcome “Musical Dyslexia?”",
      "type": "story"
    },
    {
      "by": "wslh",
      "descendants": 0,
      "id": 31689272,
      "score": 1,
      "time": 1654827584,
      "title": "Beowulf: The Monsters and the Critics by Tolkien",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Beowulf:_The_Monsters_and_the_Critics"
    },
    {
      "by": "9woc",
      "descendants": 0,
      "id": 31689270,
      "score": 1,
      "time": 1654827554,
      "title": "OpenAttestation – OpenAttestation",
      "type": "story",
      "url": "https://www.openattestation.com/"
    },
    {
      "by": "uejfiweun",
      "descendants": 0,
      "id": 31689255,
      "score": 1,
      "time": 1654827509,
      "title": "An Open Letter on Georgetown's Speech and Expression Policy",
      "type": "story",
      "url": "https://sites.google.com/georgetown.edu/john-hasnas/links/open-letter"
    },
    {
      "by": "memorable",
      "descendants": 0,
      "id": 31689245,
      "score": 1,
      "time": 1654827408,
      "title": "Typer is a library for building CLI applications based on Python 3.6 type hints",
      "type": "story",
      "url": "https://typer.tiangolo.com/"
    },
    {
      "by": "ohiovr",
      "descendants": 0,
      "id": 31689219,
      "score": 2,
      "time": 1654827164,
      "title": "Savings and Loan Crisis of the 1980s",
      "type": "story",
      "url": "https://www.investopedia.com/terms/s/sl-crisis.asp"
    },
    {
      "by": "puglr",
      "descendants": 0,
      "id": 31689201,
      "score": 1,
      "text": "With respect to the arbitration terms found in any given Terms of Service, there are two competing ideas I&#x27;ve seen a lot on HN recently:<p>1) Those asserting arbitration is a scam or otherwise unfair. The company whose TOS you&#x27;ve signed is the one paying the arbitrator, after all. This system is designed for you to lose.<p>2) Those with personal anecdotes about going through arbitration, who had a decent-at-worst experience, and ended up winning.<p>If there&#x27;s one thing I&#x27;ve learned from the internet, it&#x27;s that positive outcomes generate a light breeze, but negative outcomes generate a storm. If arbitration was inherently unfair -- at least as often as we seem to tell ourselves -- I&#x27;d think I&#x27;d see more anecdotes about it. So far I&#x27;ve seen zero. Maybe that&#x27;s just &quot;luck&quot;, but I figured I&#x27;d ask, directly to the community whose discussions about it prompted to this question.<p>Disclaimer: I&#x27;m not a fan of the de-facto forced arbitration imposed on anyone who doesn&#x27;t want to (or can&#x27;t) run their own email server, etc. I&#x27;ve been deeply dismayed by the last few SCOTUS decisions on this subject. And yet I haven&#x27;t come across an anecdote of anyone getting boned. Indeed, in my own social circle I know 2 folks who have been through such arbitration. They both assumed the deck was stacked against them, and they both emerged victorious.",
      "time": 1654827020,
      "title": "Ask HN: Has anyone had the deck stacked against them in arbitration?",
      "type": "story"
    }
  ]
}