{
  "stories": [
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 29354220,
      "score": 1,
      "time": 1637961517,
      "title": "Émile-Antoine Bayard's Illustrations for Around the Moon by Jules Verne (1870)",
      "type": "story",
      "url": "https://publicdomainreview.org/collection/emile-antoine-bayard-s-illustrations-for-around-the-moon-by-jules-verne-1870/"
    },
    {
      "by": "FairDune",
      "descendants": 0,
      "id": 29354219,
      "score": 2,
      "time": 1637961508,
      "title": "New in C# 10: Easier Lambda Expressions",
      "type": "story",
      "url": "http://dontcodetired.com/blog/post/Whats-New-in-C-10-Easier-Lambda-Expressions"
    },
    {
      "by": "hasheddan",
      "descendants": 0,
      "id": 29354172,
      "score": 2,
      "time": 1637961253,
      "title": "SpinLaunch",
      "type": "story",
      "url": "https://www.spinlaunch.com/"
    },
    {
      "by": "whalabi",
      "descendants": 0,
      "id": 29354148,
      "score": 1,
      "time": 1637960996,
      "title": "B.1.1 decendant associated with South Africa with high number of Spike mutations",
      "type": "story",
      "url": "https://github.com/cov-lineages/pango-designation/issues/343"
    },
    {
      "by": "thibautg",
      "descendants": 0,
      "id": 29354122,
      "score": 2,
      "time": 1637960757,
      "title": "EU tech sector fights for a Level Playing Field with Microsoft",
      "type": "story",
      "url": "https://antitrust.nextcloud.com/"
    },
    {
      "by": "timmit",
      "descendants": 0,
      "id": 29354072,
      "score": 1,
      "time": 1637960446,
      "title": "AWS vs Azure",
      "type": "story",
      "url": "https://docs.microsoft.com/en-us/azure/architecture/aws-professional/services"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29354069,
      "score": 1,
      "time": 1637960436,
      "title": "Shopify Reflections: Learnings on My First Black Friday",
      "type": "story",
      "url": "https://blog.almaer.com/shopify-reflections-learnings-on-my-first-black-friday/"
    },
    {
      "by": "throwaway120398",
      "descendants": 10,
      "id": 29354049,
      "kids": [
        29354235,
        29354183,
        29354092,
        29354218,
        29354187,
        29354137,
        29354189
      ],
      "score": 49,
      "text": "I&#x27;m sorry that this is a controversial topic, but I&#x27;ve been feeling increasingly uncomfortable about things going on at my current and previous workplaces and I don&#x27;t know where to turn for thoughts and advice. It&#x27;s a subject that&#x27;s hard to discuss with anyone for fear of being labelled, but I&#x27;m feeling increasingly stressed out and concerned about how far things have gone at times.<p>I work in software, and in the last 10 years or so the businesses I have worked for have been very keen to have more women and people from ethnic minorities in their engineering team. Over the last couple of years I&#x27;ve sensed a real change, where any concern about the ethics of discriminating based on gender or ethnicity have gone completely out of the window. Candidates that are doing well are literally being ejected from the hiring process because they don&#x27;t help diversity stats. On more than one occasion I&#x27;ve seen a hiring manager with open roles tell a recruiter to not bother them with any applications from white males.<p>I really enjoy working with a diverse range of people. I&#x27;ve sensed a mono-culture sometimes in technical groups, often driven by a strict hiring process that only lets in people that think in a very specific way. I prefer to interact with all different kinds of people, although I admit that I&#x27;m not convinced that &#x27;different kinds&#x27; has to be about race and gender (but it is a part of the picture).<p>Over the last decade I think there has often been an unspoken preference towards candidates that improve diversity, and I don&#x27;t have a problem with this. It&#x27;s always hard to find the right balance, to recognise bias and encourage and allow those applications to prosper. The nuance has gone in recent years, and it has become common for interviewers to think nothing of directly and openly identifying &quot;white male&quot; as a negative trait when discussing a candidate after an interview. I feel like we need a bit of a cultural reset, to re-establish the basic principal that truly discriminating against any candidate on the basis of race or gender is wrong.<p>To those that say, &quot;Hey, it&#x27;s just time for white males to find out what it has been like for women and ethnic minorities&quot;, I&#x27;m afraid this line of reasoning, that two wrongs make a right, doesn&#x27;t hold water for me at all. It&#x27;s unjust to discriminate against a young graduate today, and have them pay the price for bygone injustice.<p>I&#x27;m concerned that at some point I will inevitably have to either challenge something, and be labelled a bigot or misogynist, or live an increasingly bizarre existence with things happening around me that I consider to be clearly wrong.<p>So what&#x27;s your experience? Are you comfortable with this phenomenon and is it a shift you remotely recognise? Should I just stop worrying and embrace this? Have folks that work in other industries seen a similar change?",
      "time": 1637960268,
      "title": "Ask HN: Is discrimination to promote diversity okay?",
      "type": "story"
    },
    {
      "by": "maddynator",
      "descendants": 0,
      "id": 29354040,
      "score": 1,
      "time": 1637960229,
      "title": "Introduction to Web 3.0: The road that led us here",
      "type": "story",
      "url": "https://www.getrevue.co/profile/mayankv_tweets/issues/introduction-to-web-3-0-the-road-that-led-us-here-899749"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 29354032,
      "score": 1,
      "time": 1637960174,
      "title": "Nelson Mandela, the prisoner’s power – and its meaning for us today (2014)",
      "type": "story",
      "url": "https://www.dailymaverick.co.za/article/2014-06-17-op-ed-nelson-mandela-the-prisoners-power-and-its-meaning-for-us-today/"
    }
  ]
}