{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30671391,
      "score": 2,
      "time": 1647259390,
      "title": "A brief tour of the PDP-11, the most influential minicomputer of all time",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2022/03/a-brief-tour-of-the-pdp-11-the-most-influential-minicomputer-of-all-time/"
    },
    {
      "by": "umitanuki",
      "descendants": 0,
      "id": 30671385,
      "score": 1,
      "text": "https:&#x2F;&#x2F;github.com&#x2F;mit-dci&#x2F;opencbdc-tx<p>While I love it discusses about linearizability&#x2F;serializability tradeoffs with different architecture, I&#x27;m a bit puzzled how come they chose 2PC for scalability. In my opinion, 2PC has been a bad idea for scalable distributed systems, and generally speaking the design decision that has turned to be good (whether or not this was intentional) by bitcoin was that optimistic locking with cryptographical validation was way better. Am I missing something?",
      "time": 1647259305,
      "title": "OpenCDBC: How come 2PC is scalable?",
      "type": "story"
    },
    {
      "by": "phrygian",
      "descendants": 0,
      "id": 30671372,
      "score": 1,
      "time": 1647259175,
      "title": "Ukraine has started using Clearview AI’s facial recognition during war",
      "type": "story",
      "url": "https://www.reuters.com/article/ukraine-crisis-facial-recognition-idUSKCN2LA0JS"
    },
    {
      "by": "nyellin",
      "descendants": 0,
      "id": 30671361,
      "score": 1,
      "time": 1647259111,
      "title": "Recursion Visualizer",
      "type": "story",
      "url": "https://www.recursionvisualizer.com/"
    },
    {
      "by": "leonry",
      "descendants": 0,
      "id": 30671354,
      "score": 1,
      "time": 1647259057,
      "title": "Make a Fair Coin from a Biased Coin (2018)",
      "type": "story",
      "url": "https://www.xarg.org/2018/01/make-a-fair-coin-from-a-biased-coin/"
    },
    {
      "by": "asyncscrum",
      "descendants": 0,
      "id": 30671345,
      "score": 1,
      "time": 1647259022,
      "title": "On Being Indispensable at Work",
      "type": "story",
      "url": "https://www.sofuckingagile.com/blog/on-being-indispensable"
    },
    {
      "by": "occudiz",
      "descendants": 1,
      "id": 30671344,
      "kids": [
        30671357
      ],
      "score": 1,
      "text": "Reactive vs Proactive Approach: Which One Should You Follow?\nWhen it comes to reactive and proactive lead generation, there are several schools of thought, each trying to prove why theirs is the best. However, when we delve deep into the matter, we’ll understand that both approaches are right and wrong at the same time.<p>What’s Reactive Lead Generation?\nReactive lead generation is when marketers lob a statement, an advert or a pitch to prospective clients and wait for them to react. The natural predisposition that marketers take after seeing a response from a prospect is referred to as reactive. For instance, if you call someone to confirm whether they received the catalogue of products you sent them and wait for their response, that’s reactive.<p>Although it’s considered a less effective approach than being proactive, reactive lead generation isn’t a bad tactic. At times, reacting to situations as they arise can help you save time and money. It’s easier to close a lead that has shown interest than chasing one that hasn’t shown any interest.<p>Here are a few tactics to reactively close leads:<p><pre><code>  Be vigilant: Be on the lookout for any responses or enquiries from prospects on your email, social media feeds and promotions. Once you see any queries, be sure to respond and ensure that you adapt your brand to these conversations. Try to offer appropriate solutions to any problems and ask for feedback.\n  Base your decisions on needs: With reactive lead generation, the course of action you take should be driven by the prospect’s needs. Rather than having a plan executed based on data, you react based on the matter at hand. \n  Be Flexible: If you want to close leads reactively, you need to be flexible and easy to adapt to emerging needs. You should be willing to evolve and respond to prospects needs and requests without hesitation.\n </code></pre>\nWhat’s Proactive Lead Generation?\nOn the flip side, proactive lead generation involves chasing down leads using all the tools at your disposal. It entails learning about a prospective client, setting expectations, and explaining why they need your brand or product using the right messages. Essentially, you’re not waiting for the prospects to take the lead role; you identify their needs and wants and explain how you can help them before they even know it.<p>However, for a marketer to be proactive when closing leads, they need to follow a few tactics:<p><pre><code>  Base your decision on analyzed data: Unless you collect and analyze the correct data, you won’t know the best leads to follow. Although it may seem like a great idea to chase all the leads, you might end up wasting a lot of time and resources on leads that will never pan out. \n  Ask open-ended but specific questions: Ask questions and solicit engagements when sharing or promoting your brand or products. Ensure that your questions have a value statement and are phrased to show you care that you care for the prospect’s needs. \n  Have a well thought out plan and conduct in-depth research: A significant part of proactive lead generation should involve making preparations, evaluating alternatives and strategizing. Before you pounce a prospect, you need to be conversant with the latest trends, use current promotional options and leverage creative marketing strategies. While being proactive is considered more guesswork, you should strive only to make educated and informed guesses. \n </code></pre>\nReactive or Proactive Lead Generation: Which one Wins? \nWell, there is no better method between the two. This is because different situations call for different approaches. But, indeed, every business needs to blend reactive and proactive strategies to close leads successfully.<p>Qualified leads are easy to chase proactively. On the other hand, unqualified leads are yet to be natured to make their first purchase, you can retain them in the pipeline and only react when they make their first move.<p>https:&#x2F;&#x2F;occudiz.com&#x2F;",
      "time": 1647259021,
      "title": "Chasing your leads, or waiting for miracles?",
      "type": "story"
    },
    {
      "by": "melzarei",
      "descendants": 0,
      "id": 30671338,
      "score": 1,
      "time": 1647258973,
      "title": "Std: Regex crashes when matching long lines",
      "type": "story",
      "url": "https://gcc.gnu.org/bugzilla/show_bug.cgi?id=86164"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30671332,
      "score": 1,
      "time": 1647258949,
      "title": "Ecstatica: The Weird MS-DOS Survival Horror That Time Forgot",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Tis160twYc4"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30671318,
      "score": 1,
      "time": 1647258895,
      "title": "Harriet Tubman Was Also a Naturalist",
      "type": "story",
      "url": "https://www.smithsonianmag.com/history/harriet-tubman-is-famous-for-being-an-abolitionist-and-political-activist-but-she-was-also-a-naturalist-180979689/"
    }
  ]
}