{
  "stories": [
    {
      "by": "cheerioty",
      "descendants": 0,
      "id": 32075239,
      "score": 1,
      "text": "It’s 2022 and many services still offer free accounts, despite the many negative effects they have. If you search HN or the web in general, you barely find success stories around having a freemium model. In fact, it really seems to hurt most products as it lowers the perceived value. And because of having an endless trial, users seem to try much less to explore and make things work for them.<p>Here’s just one recent article about a company that added a free account retrospectively and pretty much ruined their conversions&#x2F;sales for a while: https:&#x2F;&#x2F;recurly.com&#x2F;blog&#x2F;hard-lessons-learned-in-the-land-of-the-freemium&#x2F;<p>Full disclosure: My startup is offering a free account as well, and we’re actively considering to remove it.",
      "time": 1657657779,
      "title": "Ask HN: Freemium is doomed, why do many keep it anyway?",
      "type": "story"
    },
    {
      "by": "LivingGlitcher",
      "descendants": 0,
      "id": 32075223,
      "score": 2,
      "text": "I am hoping to work from my second country where I am a citizen of just as the USA. Any advice? Other than the timezone difference, what struggles can I expect?",
      "time": 1657657704,
      "title": "Ask HN: How are you working remotely in another country?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 32075218,
      "score": 1,
      "time": 1657657674,
      "title": "Singapore Ratifies the Kigali Amendment",
      "type": "story",
      "url": "https://www.coolingpost.com/world-news/singapore-ratifies-the-kigali-amendment/"
    },
    {
      "by": "gravitate",
      "descendants": 0,
      "id": 32075210,
      "score": 1,
      "time": 1657657646,
      "title": "Autostart in the Registry may not be what you think it is",
      "type": "story",
      "url": "http://windowsir.blogspot.com/2022/07/does-autostart-really-mean-autostart.html"
    },
    {
      "by": "manuelabeledo",
      "descendants": 0,
      "id": 32075207,
      "score": 1,
      "text": "After almost a couple decades dedicated to backend development, I happened to end up in a typescript&#x2F;node&#x2F;react shop. Job is great! But for the first time, I feel like I&#x27;m lacking the basics to perform adequately.<p>So far, it seems that most of the resources I have been consulting are very <i>opinionated</i>, i.e. in many areas, there seem to be too much <i>flexibility</i>, at least compared to other programming languages and&#x2F;or frameworks.<p>I have to take a quite long flight in a few hours, and I would love to dive in a book (books?) that could help me bridge the gap between what I now know, i.e. Java + Spring, Python + Flask, a bit of Rust + Rocket, etc., and what I need to know, this being modern Typescript, Node.js, and React programming.<p>Thanks in advance folks.",
      "time": 1657657630,
      "title": "Ask HN: Best React and TypeScript book for experienced programmers?",
      "type": "story"
    },
    {
      "by": "stoicanalyst",
      "descendants": 0,
      "id": 32075205,
      "score": 1,
      "time": 1657657619,
      "title": "Why don’t most foods cause allergies?",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/07/why-dont-most-foods-cause-allergies/"
    },
    {
      "by": "eternalban",
      "descendants": 0,
      "id": 32075201,
      "score": 1,
      "time": 1657657591,
      "title": "Dissident Iranian film-maker Jafar Panahi arrested",
      "type": "story",
      "url": "https://www.france24.com/en/asia-pacific/20220711-dissident-iranian-film-maker-jafar-panahi-arrested"
    },
    {
      "by": "lbrito",
      "descendants": 0,
      "id": 32075183,
      "score": 2,
      "text": "Coming from South America, I&#x27;m used to residential lots having well-defined property limits. In the larger, denser cities, this usually means huge walls. But even in gated communities in the outskirts of town, where neither density nor safety is an issue, lots - including the front yard - are well defined by small fences or hedges.<p>I live in a suburb in metro Vancouver (Canada), but the same goes for the US. I&#x27;m kind of surprised at how fuzzy the lot limits are. Some examples:<p>* Sidewalks typically merge with the front lawn; there is no visible property limit.<p>* Neighboring lots usually are not fenced; random shrubbery or just grass separates lots. What if I want to plant a different tree there? Or my neighbor wants to pave it?<p>* There&#x27;s a laundry pole in my neighbor&#x27;s lot. It connects both to his and my house. I find this weirdest of all. Who owns it? What if he doesn&#x27;t like the pole and wants to take it down?<p>Canadians and Americans probably won&#x27;t find anything unusual in the examples above, but its all a bit odd from a foreigner&#x27;s perspective.",
      "time": 1657657530,
      "title": "Ask HN: Why are property limits so fuzzy in North American suburbs?",
      "type": "story"
    },
    {
      "by": "timmccarty",
      "descendants": 0,
      "id": 32075151,
      "score": 4,
      "time": 1657657359,
      "title": "Show HN: React Native, Expo, Flutter push notifications made simple",
      "type": "story",
      "url": "https://nativenotify.com/"
    },
    {
      "by": "justchad",
      "descendants": 0,
      "id": 32075137,
      "score": 2,
      "time": 1657657284,
      "title": "Rails Security Release CVE-2022-32224",
      "type": "story",
      "url": "https://rubyonrails.org/2022/7/12/Rails-Versions-7-0-3-1-6-1-6-1-6-0-5-1-and-5-2-8-1-have-been-released"
    }
  ]
}