{
  "stories": [
    {
      "by": "triska",
      "descendants": 0,
      "id": 31779335,
      "score": 1,
      "time": 1655478581,
      "title": "Rules and Visual Syntax in Praxis",
      "type": "story",
      "url": "https://toblotron.com/blog/2022/06/17/rules-and-visual-syntax-in-praxis/"
    },
    {
      "by": "nassimsoftware",
      "descendants": 0,
      "id": 31779316,
      "score": 1,
      "text": "I&#x27;ve noticed the proliferation of visual scripting systems in game engines. It seems to work pretty well for building games. However, we all know that visual scripting has never took off for building other kinds of software.<p>I&#x27;m curious as to why. What in the nature of &quot;normal&quot; software makes visual scripting inconvenient compared to games.",
      "time": 1655478506,
      "title": "Ask HN: \"No code\" works well for making games but not general software. Why?",
      "type": "story"
    },
    {
      "by": "superdario",
      "descendants": 1,
      "id": 31779260,
      "kids": [
        31779336
      ],
      "score": 5,
      "text": " I&#x27;ve been developing my own algorithm for news shortening. Basically, it takes a news article from the site, does some calculations and spits out up to 5 the most important sentences. Demo can be seen here https:&#x2F;&#x2F;excerptdaily.com<p>I created it because I read news and I hate reading Bible-size articles full of unnecessary information just to find the main point<p>It has a purpose, it really does solve a problem:\n* Save people&#x27;s time\n* Inform you as fast as possible\n* Give you the main point of an article in 5 sentences\n* Save you from clickbait or half clickbait titles<p>Starting my own news website without any connections or audience doesn&#x27;t make sense, also I&#x27;m bad at marketing. I firmly believe this is a very good solution. I just don&#x27;t know yet how to utilize it?<p>Should I offer the power of algorithm to some podcast that have audience and their own news website, should I offer it to someone who wants to build a news website...",
      "time": 1655478282,
      "title": "I created a powerful news shortening algorithm. I'm not sure how to utilize it",
      "type": "story"
    },
    {
      "by": "ipmb",
      "descendants": 0,
      "id": 31779251,
      "score": 1,
      "time": 1655478255,
      "title": "Node.js PyPI Distribution",
      "type": "story",
      "url": "https://github.com/samwillis/nodejs-pypi"
    },
    {
      "by": "harscoat",
      "descendants": 0,
      "id": 31779243,
      "score": 1,
      "time": 1655478226,
      "title": "Vygotskian Autotelic AI",
      "type": "story",
      "url": "https://twitter.com/cedcolas/status/1537788959056465921"
    },
    {
      "by": "galaxyLogic",
      "descendants": 0,
      "id": 31779235,
      "score": 1,
      "time": 1655478191,
      "title": "The Black Hole Information Paradox Is Just About Solved",
      "type": "story",
      "url": "https://www.popularmechanics.com/science/a34656162/black-hole-information-paradox-solved/"
    },
    {
      "by": "feross",
      "descendants": 1,
      "id": 31779222,
      "kids": [
        31779338
      ],
      "score": 1,
      "time": 1655478128,
      "title": "Data and system visualization tools to boost your productivity",
      "type": "story",
      "url": "https://martinheinz.dev/blog/75"
    },
    {
      "by": "znpy",
      "descendants": 0,
      "id": 31779169,
      "score": 1,
      "text": "As per subject: what policies are in place for FAANG&#x2F;MANGA employees about personal websites, blogging etc ?<p>What are you, as an employee, not allowed to do?<p>Do you think it&#x27;s fair?<p>Do you think it&#x27;s hurting&#x2F;benefiting your public persona?<p>Thank you in advance!",
      "time": 1655477943,
      "title": "Ask HN: What are the policies for personal websites at FAANG/MANGA?",
      "type": "story"
    },
    {
      "by": "PhilipWee",
      "descendants": 0,
      "id": 31779160,
      "score": 1,
      "text": "Hi HN! Philip and Stephen here, we are the co-founders of FireJet (https:&#x2F;&#x2F;www.firejet.io), which allows you to export from Figma to Tailwind CSS.<p>We first met at university, where we did several project together, often first designing in Figma and then developing the Frontend manually. It’s not that it was extremely hard to code out our app Frontends - however, it felt pretty dumb to be doing twice the amount of work, once while designing and then once again to implement the design in code.<p>We tried several other tools which were similar to FireJet, but the main problem we always ran into was that the other tools had alot of features like automatic semantic tagging, implementing Material UI components, and so on, but none of them got the one fundamental thing we needed it to do - which was convert it to code. Some competitors were converting certain figma frames into images, which as you can imagine is about as useful as replacing your website with an &lt;img&gt; tag<p>We made a quick prototype in a week, and people who needed the specific tailwind functionality loved it. Fast forward about 3 months, we have 700 downloads and a small (but growing!) group of dedicated users who keep coming back to us and helping us improve the product.<p>Even now, our landing page and our plugin UI are themselves developed using FireJet itself, and because we ourselves are a startup we are not too worried about coding best practices, but rather iterating and developing as fast as possible, which is why FireJet is useful for us.<p>So we are launching FireJet here in the spirit of building in public, and we hope that FireJet reduce your time to market for your startup &#x2F; agency &#x2F; company!<p>You can see a portfolio website I made using FireJet here:<p>Sample Website: https:&#x2F;&#x2F;philipwee.github.io&#x2F;\nGithub Repository: https:&#x2F;&#x2F;github.com&#x2F;PhilipWee&#x2F;philipwee.github.io\nFigma File: https:&#x2F;&#x2F;www.figma.com&#x2F;community&#x2F;file&#x2F;1119632484827501100",
      "time": 1655477906,
      "title": "Show HN: FireJet – Export from Figma to Tailwind CSS – Hacker News",
      "type": "story"
    },
    {
      "by": "h4ck3d1t",
      "descendants": 0,
      "id": 31779124,
      "score": 1,
      "time": 1655477772,
      "title": "Securing OT Network Management Systems: Siemens Sinec",
      "type": "story",
      "url": "https://claroty.com/2022/06/16/blog-research-securing-network-management-systems-part-3-siemens-sinec-nms/"
    }
  ]
}