{
  "stories": [
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 27845706,
      "score": 1,
      "time": 1626362049,
      "title": "A Beginner's Guide to eBPF Programming with Go",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=uBqRv8bDroc"
    },
    {
      "by": "sebastianconcpt",
      "descendants": 0,
      "id": 27845697,
      "score": 1,
      "time": 1626362011,
      "title": "Pharo 9 Released",
      "type": "story",
      "url": "https://pharo.org/news/pharo9-released"
    },
    {
      "by": "azhenley",
      "descendants": 0,
      "id": 27845690,
      "score": 1,
      "time": 1626361996,
      "title": "Programmers’ Affinity to Languages [pdf]",
      "type": "story",
      "url": "https://drops.dagstuhl.de/opus/volltexte/2021/14219/pdf/OASIcs-ICPEC-2021-3.pdf"
    },
    {
      "by": "jennafowlerster",
      "descendants": 0,
      "id": 27845678,
      "score": 2,
      "time": 1626361921,
      "title": "Austin was 'the biggest winner' of Covid tech migration",
      "type": "story",
      "url": "https://www.sfchronicle.com/bayarea/article/Austin-COVID-tech-migration-silicon-valley-16315291.php"
    },
    {
      "by": "jackson1372",
      "descendants": 0,
      "id": 27845673,
      "score": 1,
      "time": 1626361895,
      "title": "I Blew the Whistle on John Searle",
      "type": "story",
      "url": "https://jacksonkernion.com/posts/I-Blew-The-Whistle-On-John-Searle.html"
    },
    {
      "by": "uhvardhan",
      "descendants": 0,
      "id": 27845666,
      "score": 2,
      "text": "Hi Hackernews,<p>Hope everyone is doing well and keeping safe.<p>I am writing this to put forward my story since I have been in US as an international student.<p>I came to US to do my masters in Systems Engineering in Fall 2016. Having always had an interest in Robotics, Machine Learning &amp; Computer Vision - I moved to M.E degree in Robotics at the end of Fall 2016. 1-1&#x2F;2 years later, I graduated with my M.E in Robotics. That is when, it seems my life took a turn to the worse. I did not have any work experience and most companies felt my profile did not suit their needs. I have struggled for 1 year during my OPT to find a permanent position before I ended up getting an opportunity to do my PhD in Robotics &amp; Machine Learning.<p>Joined PhD in Summer 2019. Another year of struggle again because of the differences in research interests which is perfectly understandable and as far as I read happens sometimes in PhD. So, I moved to another Professor who is working in BO, ML and RL. After 9 months of enjoying my work, loving what I did - my current advisor tells me he is moving to another University and he cannot take me along(because I lack rigorous mathematical background). We submitted 2 papers in this years time(1 rejected &amp; 1 in review) and now this happens. I finished all my coursework and also preliminary exam.<p>Now, I have another 45 days and these are my options:\n1. Find another advisor: Seems like the best option. Doesn’t it? Unfortunately, 2 professors did not want to work with me. What are the chances that another professor will take me? Next to none. I just want someone to trust me to do things right and get stuff working. Every year - I have had to struggle and constantly worry about these insecurities. \n2. Find an employer who is willing to sponsor me H1-B visa on cap-exempt. Not so easy considering the pandemic. \n3. Go back to India.<p>I certainly do not have any grudges on any advisors but makes you wonder if I am the bad person in this case. Everything happens for a reason. All I wanted was to work hard, do stuff right and most important, keep my family happy.<p>At this point of time, the only choice I can honestly see is going back to India(because advisors are getting most of their students back and do not intend to recruit at this time).<p>I am putting my story out on HackerNews because of 2 reasons:\n1. I wanted to just write it out and post the struggles of an international student. I completely understand mine is a unique situation and not everyone faces what I do.\n2. I was hoping someone notices me, hopefully extend a lending hand and actually believe in me.<p>I need some help guys.<p>Regards,\nHarshvardhan Uppaluru\nLink to my Resume: https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1t912aa6P8tWhMYLj7JO2AQcpzZZu7l4_&#x2F;view?usp=sharing<p>Any comments&#x2F;suggestions are helpful. Thank you.<p>Please wear a mask! :)",
      "time": 1626361861,
      "title": "Tell HN: Story of an International Student",
      "type": "story"
    },
    {
      "by": "AudreChad",
      "descendants": 0,
      "id": 27845600,
      "score": 1,
      "time": 1626361551,
      "title": "Mistakes People Make When Launching a Podcast",
      "type": "story",
      "url": "https://www.bcast.fm/blog/mistakes-when-launching-a-podcast"
    },
    {
      "by": "sbsp",
      "descendants": 0,
      "id": 27845597,
      "score": 1,
      "text": "I have built a follower count of about 860 in instagram with posts related to quantum computing and quantum physics. Any suggestions on techniques I can use to monetize my contents? I am not a social media savvy person; interested in hearing any thoughts or suggestion around it.",
      "time": 1626361542,
      "title": "Leverage My Instagram Followers",
      "type": "story"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27845591,
      "score": 1,
      "time": 1626361514,
      "title": "Feeding the machine: We give an AI some headlines and see what it does",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/07/feeding-the-machine-we-give-an-ai-some-headlines-and-see-what-it-does/"
    },
    {
      "by": "havermeyer",
      "descendants": 1,
      "id": 27845582,
      "kids": [
        27845594
      ],
      "score": 1,
      "time": 1626361474,
      "title": "Startup provides unified checking and investment account",
      "type": "story",
      "url": "https://financialchoice.com/"
    }
  ]
}