{
  "stories": [
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29997616,
      "score": 1,
      "time": 1642616053,
      "title": "Josh Thompson Presentation to Governmental Accounting Standards Board",
      "type": "story",
      "url": "https://josh.works/gasb"
    },
    {
      "by": "shekhardesigner",
      "descendants": 0,
      "id": 29997589,
      "score": 1,
      "time": 1642615957,
      "title": "HTML to JSX",
      "type": "story",
      "url": "https://magic.reactjs.net/htmltojsx.htm"
    },
    {
      "by": "janvdberg",
      "descendants": 0,
      "id": 29997581,
      "score": 1,
      "time": 1642615912,
      "title": "The Internet Changed My Life",
      "type": "story",
      "url": "https://pointersgonewild.com/2022/01/19/the-internet-changed-my-life/"
    },
    {
      "by": "sema4hacker",
      "descendants": 0,
      "id": 29997577,
      "score": 1,
      "text": "I&#x27;ve always felt that HTML&#x2F;CSS&#x2F;Javascript was a horrible programming system.  But what is better?  Comparing &quot;hello world&quot; examples never reveals the strengths of one language over another, and I&#x27;ve always wondered about finding a better way to compare languages.  It occurred to me that implementing Wordle would be a much better programmming exercise and language comparator than &quot;hello world&quot;.  I&#x27;d be willing to put up $5k as a prize to the best Wordle program.  The contest would be to implement Wordle, in the programmer&#x27;s choice of a browser or as a standalone program for a phone or desktop machine.  The &quot;best&quot; implementation would be judged as scoring the highest on a variety of metrics (correctness, completeness, clarity, etc).  Hopefully some master programmers would generate great examples of better alternatives to HTML&#x2F;CSS&#x2F;Javascript.<p>Unfortunately, such a contest would probably attract a huge number of entrants, and it would take forever to compare submittals, assuming enough official judges could even be found.  (Note that this is not a &quot;puzzle&quot; competition like typical coding contests with one correct &quot;answer&quot;, but more like a subjective &quot;beauty&quot; contest.)<p>Posting submittals to a public site and letting upvotes decide the winner might work, but there would be the danger of fraud voting or the copying&#x2F;modifying of previous submittals as new work.<p>One idea is having contest applicants post a public description of their past work and what language they plan to use, and letting upvotes decide which top ten programmers will compete (or maybe the top three programmers in each of the ten of the most popular languages so enough alternative languages end up compared), although fraud voting might still be an issue.<p>Is it even feasible to try and pull this off?",
      "time": 1642615908,
      "title": "Ask HN: How Best to Manage a $5k Wordle Implementation Contest?",
      "type": "story"
    },
    {
      "by": "pelagic_sky",
      "descendants": 0,
      "id": 29997554,
      "score": 1,
      "time": 1642615787,
      "title": "Audio Source Separation Using AI Tools",
      "type": "story",
      "url": "https://aavepyora.online/2022/01/17/easy-source-separation-using-ai-tools/"
    },
    {
      "by": "historienne",
      "descendants": 0,
      "id": 29997523,
      "score": 1,
      "text": "Hello,\nI&#x27;m a history PhD currently working as a professor and looking for advice on transitioning to a new career. I recently saw a job as a historian&#x2F;researcher for a video game company and was wondering if anyone has recommendations on finding similar jobs and ways of making myself marketable for these positions. Thanks!",
      "time": 1642615698,
      "title": "Professional Historian Looking for Advice",
      "type": "story"
    },
    {
      "by": "ilamont",
      "descendants": 0,
      "id": 29997503,
      "score": 1,
      "time": 1642615627,
      "title": "Russian cosmonauts toss empty container into space after connecting cables",
      "type": "story",
      "url": "https://twitter.com/Space_Station/status/1483858040264790018"
    },
    {
      "by": "miles",
      "descendants": 0,
      "id": 29997492,
      "score": 1,
      "time": 1642615594,
      "title": "Major Record Labels Sue YouTube-dl’s Hosting Provider",
      "type": "story",
      "url": "https://torrentfreak.com/major-record-labels-sue-youtube-dl-hosting-provider-220114/"
    },
    {
      "by": "onychomys",
      "descendants": 0,
      "id": 29997477,
      "score": 1,
      "time": 1642615551,
      "title": "The Nuclear Sleuths Shaking Up U.S. Spycraft",
      "type": "story",
      "url": "https://www.politico.com/news/magazine/2022/01/19/nuclear-sleuths-shaking-up-us-spycraft-527319"
    },
    {
      "by": "alok-g",
      "descendants": 0,
      "id": 29997451,
      "parts": [
        29997452,
        29997453
      ],
      "score": 1,
      "text": "There are sometimes excellent articles written as Twitter threads like this [1] recently.  I see debates frequently happening with some people preferring unrolled versions like [2] and some people preferring the original.  Hence this poll.  Which do you prefer and why?<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29977041<p>[2] https:&#x2F;&#x2F;threadreaderapp.com&#x2F;thread&#x2F;1482811504424542211.html",
      "time": 1642615479,
      "title": "Poll: Do you prefer Twitter threads or unrolled versions?",
      "type": "poll"
    }
  ]
}