{
  "stories": [
    {
      "by": "js2",
      "descendants": 0,
      "id": 30247210,
      "score": 1,
      "time": 1644251973,
      "title": "The Covid Policy That Mattered Wasn’t a Policy",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/06/opinion/covid-pandemic-policy-trust.html"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30247184,
      "score": 1,
      "time": 1644251869,
      "title": "Nodes of Yesod for the ZX Spectrum Next",
      "type": "story",
      "url": "https://blog.stevewetherill.com/2022/02/nodes-of-yesod-for-zx-spectrum-next.html"
    },
    {
      "by": "njiv",
      "descendants": 0,
      "id": 30247168,
      "score": 1,
      "time": 1644251811,
      "title": "Workflow Script on JavaScript – Kafka adds scalability, fault tolerance for free",
      "type": "story",
      "url": "https://github.com/awto/kafka-workflow"
    },
    {
      "by": "greatgib",
      "descendants": 0,
      "id": 30247165,
      "score": 1,
      "time": 1644251796,
      "title": "To Salt or Not To Salt? – Salting is not the only answer to securing passwords",
      "type": "story",
      "url": "https://www.linkedin.com/pulse/salt-salting-only-answer-securing-passwords-william-buchanan"
    },
    {
      "by": "lpage",
      "descendants": 0,
      "id": 30247159,
      "score": 2,
      "text": "Hi HN—we&#x27;re Kelly and Steve, co-founders of OneChronos (<a href=\"https:&#x2F;&#x2F;www.onechronos.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.onechronos.com</a>). OneChronos is a &quot;Smart Market&quot; for US equities—meaning we match counterparties using mathematical optimization instead of classical human auctioneer mechanics [1]. Our flavor of Smart Market—combinatorial auctions—lets users enter orders spanning multiple securities and specify matching preferences way beyond just price and quantity.<p>We didn&#x27;t invent Smart Markets or combinatorial auctions. Roughly $1T&#x2F;year flows through them in industries ranging from display advertising to telecommunications. The underlying theory was the subject of the 2020 Nobel Prize in Economic Sciences [2]. We&#x27;re bringing them to capital markets, and we have both the customers and the regulatory clearance to do so. Our initial user base contains the household names cumulatively responsible for ≈70% of US equities trading volume.<p>Today&#x27;s market structure costs institutional investors at least a trillion dollars annually. We&#x27;ll go into the details below, but the big thing to understand is that mutual&#x2F;pension&#x2F;sovereign funds, 401K plans, and ETF managers pay the price, and ultimately it gets passed on to households. Given diverse investment time horizons and risk preferences, capital markets are not a zero-sum game, but the existing market structure makes it one. Any form of market friction that prevents mutually beneficial trades from happening is an economic loss. Our goal is to make a lot more mutually beneficial trades happen.<p>We started working on OneChronos as experienced traders and auction theorists. Even so, getting here has taken five years of iterating with customers, tackling two deep tech problems, and working through an involved regulatory process. We&#x27;ll describe what&#x27;s causing existing market friction, the solution, and why that solution is a significant technical lift.<p>When people hear about market friction and hidden costs, they usually think about low latency technology, market data, exchange fees, and predatory HFT practices. Those are significant, and yet they are rounding errors compared to others. The principal sources of market friction that we&#x27;re attacking are bidders&#x27; inability to express economic complements (things that are worth more together than separately), substitutes (things with diminishing marginal utility that are replacements for each other) and non-price factors, and game-theoretic incentives against bidding &quot;truthfully&quot;—that is, against specifying how many units of a good you have and the highest price at which you&#x27;d buy or the lowest at which you&#x27;d sell them (your supply and demand curve). The most commonly proposed market structure &quot;fixes,&quot; like single good periodic batch auctions and the IEX speed bump, don&#x27;t address any of these.<p>Imagine that a buyer values two goods A and B at $10 for the package, but only $4 for each individually since they&#x27;re complements. Similarly, a seller might unload the package for $8 while demanding $5 for each good individually. Both agents have &quot;exposure risk&quot; if A and B are bought and sold separately—they might get stuck with an incomplete package. No trade happens if the risk is high enough (buy at $4, sell at $5, no cross). But if they can trade the package atomically, there&#x27;s a mutual win of $2 in gains from trade. Similar missed opportunities happen if agents only want A XOR B or have different prices for different counterparties (price discrimination). This game of imperfect information and missed opportunities plays out every day in capital markets globally.<p>The straightforward solution to these problems is called &quot;Expressive Bidding&quot;—the ability to communicate parametric bids to the auctioneer, e.g., buy at most one of {$10 for A and B, $4 for A, $4 for B} or sell at most two units of A, pricing it at $10 for counterparty C_1, $9 for C_2, or $8 for C_3. Given everyone&#x27;s Expressive Bid and a well-chosen objective function, the auctioneer uses constrained optimization to clear the market and unlock efficiencies. Awesome. So why didn&#x27;t this happen when markets first started going electronic?<p>General combinatorial auctions are isomorphic to weighted set packing. Clearing them is an NP-complete optimization problem. Finding feasible and near-optimal solutions at the speed and scale of capital markets is deep tech problem #1. Furthermore, bidding in combinatorial auctions can be challenging in both a computational and UX sense. Making it easy is deep tech problem #2.<p>We tackle problem #1 similarly to how game AI like AlphaZero and optimizers like AlphaFold work. The combination of deep learning, heuristics, and classical AI search techniques is powerful, and applying them to combinatorial auctions in novel ways is a core part of our IP. Problem #2 involves the magic of formal methods. Expressive Bidding users submit snippets of code (a functionally pure subset of OCaml&#x2F;ReasonML) called a Proxy Bidder. These proxies are essentially functions mapping &quot;proposals&quot; (allocations of goods) to prices, e.g., f({2A, -B}) → -5, meaning that the bidder wants $5 for buying two units of A and selling one unit of B. Using formal methods, we turn Proxy Bidders into Expressive Bids that our optimizers can understand. You can see what that looks like here [3]. This approach is dead simple for end users, but it took years of collaborative R&amp;D with our friends and formal methods legends at Imandra [4] to enable.<p>Not everyone needs to write or use Expressive Bids. For common use cases, we&#x27;re offering pre-canned&#x2F;forkable Expressive Bids for things like pairs trades and factor neutral portfolios. That aside, users who don&#x27;t use Expressive Bidding still benefit from those who use it and create unique liquidity that doesn&#x27;t exist on other trading venues. Our economic mechanism prevents &quot;dark forest&quot; scenarios in which Expressive Bidding has adversarial uses that detract from overall match quality. &quot;Power users&quot; can only benefit those who treat us like a vanilla trading venue—and each other.<p>We make money by charging a small commission in line with other venues ($0.0009) on each share traded. Longer-term, we&#x27;re excited about a pricing model that balances computational resources used against liquidity contributed and compensates OneChronos based on how much value we add. Specifically, we&#x27;ll measure how much notional dollar price improvement we generate for the market beyond what&#x27;s generated by a &quot;vanilla&quot; double auction that we run in parallel (a neat trick enabled by Expressive Bidding–we can run an arbitrary number of auctions with different rulesets in parallel to measure relative performance). This approach aligns our incentives with our customers and eliminates fixed costs (which cause market friction) from trading.<p>Only FINRA registered broker-dealers connect to OneChronos directly. If you work at one, and you&#x27;re not yet a subscriber, please get in touch. We love talking to both subscribers and their customers, and we&#x27;d love to hear from institutional investors looking to leverage OneChronos through their existing broker algo and DMA workflows. Retail customers will eventually access us through brokers that choose to allow it (PFOF is its own thing). In the meantime, stay tuned for other more decentralized asset classes :) You can reach us at info (at) onechronos.com.<p>And we&#x27;re hiring! If you&#x27;re passionate about deeply technical problems ranging from mechanism design to applying ML to combinatorial optimization to writing compilers and engineering sophisticated distributed systems to HFT tolerances, get in touch — careers (at) onechronos.com.<p>Steve and I will be online today and would love to talk about our technical challenges, auctions&#x2F;mechanism design, market structure, and the future of OneChronos.<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Smart_market\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Smart_market</a><p>[2] <a href=\"https:&#x2F;&#x2F;news.stanford.edu&#x2F;2020&#x2F;11&#x2F;19&#x2F;bid-picture-nobel-prize-winners-explain-auction-theory-collaboration&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;news.stanford.edu&#x2F;2020&#x2F;11&#x2F;19&#x2F;bid-picture-nobel-prize...</a> - Paul Milgrom, one of the laureates, is the Chair of OneChronos Labs, our research arm.<p>[3] <a href=\"https:&#x2F;&#x2F;www.onechronos.com&#x2F;docs&#x2F;expressive&#x2F;bidding-guide&#x2F;#intro-to-bidder-logic\" rel=\"nofollow\">https:&#x2F;&#x2F;www.onechronos.com&#x2F;docs&#x2F;expressive&#x2F;bidding-guide&#x2F;#in...</a><p>[4] <a href=\"https:&#x2F;&#x2F;www.imandra.ai&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.imandra.ai&#x2F;</a>",
      "time": 1644251769,
      "title": "Launch HN: OneChronos (YC S16) – Combinatorial auctions market for US equities",
      "type": "story"
    },
    {
      "by": "jenthoven",
      "descendants": 0,
      "id": 30247150,
      "score": 1,
      "time": 1644251750,
      "title": "Employee Leave Benchmarks in a Hybrid World",
      "type": "story",
      "url": "https://www.meetcocoon.com/blog/how-our-peers-are-managing-leave"
    },
    {
      "by": "niko25",
      "descendants": 0,
      "id": 30247131,
      "score": 2,
      "time": 1644251680,
      "title": "Why is site search so important?",
      "type": "story",
      "url": "https://www.omnisearch.ai/blog/the-importance-of-site-search"
    },
    {
      "by": "smasher164",
      "descendants": 0,
      "id": 30247125,
      "score": 2,
      "time": 1644251665,
      "title": "Calcium: Exact real and complex numbers in C",
      "type": "story",
      "url": "https://fredrikj.net/calcium/"
    },
    {
      "by": "benkuhn",
      "descendants": 0,
      "id": 30247108,
      "score": 1,
      "time": 1644251608,
      "title": "High-impact career review: Software engineering",
      "type": "story",
      "url": "https://80000hours.org/career-reviews/software-engineering/"
    },
    {
      "by": "softwarebeware",
      "descendants": 0,
      "id": 30247106,
      "score": 1,
      "time": 1644251600,
      "title": "How Phishers Are Slinking Their Links into LinkedIn",
      "type": "story",
      "url": "https://krebsonsecurity.com/2022/02/how-phishers-are-slinking-their-links-into-linkedin/"
    }
  ]
}