{
  "stories": [
    {
      "by": "elsadek",
      "descendants": 0,
      "id": 30191256,
      "score": 1,
      "time": 1643888677,
      "title": "How can I ask for a temporary exemption to new policy?",
      "type": "story",
      "url": "https://workplace.stackexchange.com/questions/182521/how-can-i-ask-for-a-temporary-exemption-to-new-policy"
    },
    {
      "by": "edward",
      "descendants": 0,
      "id": 30191231,
      "score": 1,
      "time": 1643888470,
      "title": "Jeff Bezos' superyacht will see historic bridge dismantled",
      "type": "story",
      "url": "https://www.bbc.co.uk/news/world-europe-60241145"
    },
    {
      "by": "sreekars",
      "descendants": 0,
      "id": 30191223,
      "score": 1,
      "time": 1643888412,
      "title": "All the world’s Bitcoin can only pay 2.43% of $30T US national debt",
      "type": "story",
      "url": "https://cointelegraph.com/news/all-the-world-s-bitcoin-can-only-pay-2-43-of-30t-us-national-debt"
    },
    {
      "by": "ContrarianBrit",
      "descendants": 0,
      "id": 30191212,
      "score": 1,
      "time": 1643888298,
      "title": "Welcome to the Burner Phone Olympics",
      "type": "story",
      "url": "https://www.wired.com/story/winter-olympics-2022-phones-security/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30191208,
      "score": 1,
      "time": 1643888233,
      "title": "Java's Streams Feature",
      "type": "story",
      "url": "https://thedailywtf.com/articles/a-tern-in-the-stream"
    },
    {
      "by": "Cr0s",
      "descendants": 0,
      "id": 30191204,
      "score": 1,
      "text": "I&#x27;m honestly not sure if facebook is a sort of unique case here.<p>Did they just make some mistake&#x2F;mistakes that led to this, or is it more of a natural decline, with users going to other platforms or quiting social media platforms altogether?<p>Do you think other social media platforms will experience this decline as well soon or is it more of a facebook only privilege?",
      "time": 1643888180,
      "title": "Ask HN: Any other social media platform you think will lose users like Facebook?",
      "type": "story"
    },
    {
      "by": "kelthuzad",
      "descendants": 0,
      "id": 30191203,
      "score": 1,
      "time": 1643888151,
      "title": "FBI Confirms It Bought Spyware from Israel's NSO Group",
      "type": "story",
      "url": "https://www.securityweek.com/fbi-confirms-it-bought-spyware-israels-nso-group"
    },
    {
      "by": "donohoe",
      "descendants": 0,
      "id": 30191161,
      "score": 1,
      "time": 1643887806,
      "title": "Australia’s latest export is bad media policy, and it’s spreading fast",
      "type": "story",
      "url": "https://www.niemanlab.org/2022/02/australias-latest-export-is-bad-media-policy-and-its-spreading-fast/"
    },
    {
      "by": "CapitalistCartr",
      "descendants": 0,
      "id": 30191154,
      "score": 1,
      "time": 1643887749,
      "title": "The great Amazon land grab",
      "type": "story",
      "url": "https://theconversation.com/the-great-amazon-land-grab-how-brazils-government-is-turning-public-land-private-clearing-the-way-for-deforestation-173416"
    },
    {
      "by": "encryptluks2",
      "descendants": 0,
      "id": 30191153,
      "score": 2,
      "text": "I finally started automating some or my bash functions and scripts with Ansible. I have found chezmoi to be an incredible tool to manage your dot files, but it isn&#x27;t made to really manage files outside your home directory and run scripts. While you can still do it their FAQ recommends against it, and it becomes semi-obvious why.<p>I&#x27;ve worked with Ansible in the past both professionally and in my free time. I found it to be incredibly useful, but I have been burned many times by poor playbooks, documentation, etc.<p>Running a bunch of plays in Ansible can feel like you&#x27;re submitting a job to a CI server. If you&#x27;re used to running them in scripts, you&#x27;ll notice that what used to take a second or two may now take 15 or 20 seconds.<p>The thing that also baffled me is how slow it can be, especially running modules on localhost. File operations where you may want to delete some temporary paths is insane how much slower it is then a simple shell script.<p>chezmoi is different though. It is pretty much instantaneous. What is even more incredible is that with templates, includes and more, there is no noticeable slow down.<p>Having used Hugo as a SSG and creating Helm charts, I got used to using Go Templates. While I am not a huge fan of Go templating, the functions seem equally as powerful as Ansible, even more so because it is fast.<p>Which brings me to the point of all this, why has no one replaced Ansible with a Go-based tool? Sort of like a hybrid between Ansible and chezmoi.<p>Are people just using CI now for automation and if so what can you recommend that is lightweight?",
      "time": 1643887739,
      "title": "Why are there no descent Go or Rust alternatives to Ansible?",
      "type": "story"
    }
  ]
}