{
  "stories": [
    {
      "by": "feross",
      "descendants": 0,
      "id": 28618585,
      "score": 1,
      "time": 1632329287,
      "title": "Device ‘breakage’ concerns surface days before Let’s Encrypt root cert expiry",
      "type": "story",
      "url": "https://portswigger.net/daily-swig/device-breakage-concerns-surface-days-before-lets-encrypt-root-cert-expiry"
    },
    {
      "by": "technologyvault",
      "descendants": 0,
      "id": 28618532,
      "score": 3,
      "time": 1632329003,
      "title": "Tsunami Impact on US East Coast from Collapse of Cumbre Vieja Volcano [pdf]",
      "type": "story",
      "url": "https://nws.weather.gov/nthmp/documents/grilli-grilli-cacr-13-03.pdf"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28618528,
      "score": 2,
      "time": 1632328986,
      "title": "Inside the Drug Use That Fueled Nazi Germany (2016)",
      "type": "story",
      "url": "https://www.history.com/news/inside-the-drug-use-that-fueled-nazi-germany"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28618522,
      "score": 1,
      "time": 1632328963,
      "title": "Why Hasn’t Elon Musk Been to Space Yet?",
      "type": "story",
      "url": "https://www.theatlantic.com/science/archive/2021/09/elon-musk-spacex-branson-bezos/620152/"
    },
    {
      "by": "apress",
      "descendants": 0,
      "id": 28618519,
      "score": 1,
      "time": 1632328955,
      "title": "With public debuts of Toast and Ginkgo, Boston is remaking its startup scene",
      "type": "story",
      "url": "https://www.bostonglobe.com/2021/09/22/business/watershed-moment-with-public-debuts-toast-ginkgo-boston-is-remaking-its-startup-scene/"
    },
    {
      "by": "misterbingbong",
      "descendants": 0,
      "id": 28618489,
      "score": 1,
      "text": "I&#x27;m curious if anyone out there has worked with or founded a company that had an alternative comp structure for equity and salary that discouraged rest n&#x27; vest culture?",
      "time": 1632328807,
      "title": "Alternative compensation models to kill rest n' vest culture",
      "type": "story"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 28618480,
      "score": 1,
      "time": 1632328783,
      "title": "Gnome 41 Released",
      "type": "story",
      "url": "https://mail.gnome.org/archives/devel-announce-list/2021-September/msg00002.html"
    },
    {
      "by": "moistly",
      "descendants": 0,
      "id": 28618477,
      "score": 1,
      "text": "Seeking the opinion of experienced contract programmers:<p>I&#x27;ve been offered a contract with the following language. Is there anything in this to be wary of, or is it standard boilerplate?<p>&gt; The Contractor agrees that the Company will have exclusive ownership in all ideas, discoveries, inventions (patentable or not), concepts, methods, copyrightable works of authorship, formulae, algorithms, techniques, processes, know how, trade secrets and other intellectual property and work product, including all expressions of such intellectual property and work product in any and all forms, which result from the Contractor’s engagement with the Company or which result from the use of the premises or property (including equipment, supplies or Confidential Information) owned, leased or licensed by the Company or which reasonably relate to the Company’s business (together, “Developments”) and that the Contractor will promptly disclose the Developments to the Company in writing.  This will be the case, whether or not a Development is: (i) capable of being protected by copyright, patent, industrial design, trade mark or other similar legal protection, (ii) conceived or made by the Contractor during or outside the Contractor’s regular working hours, or (iii) conceived or made by the Contractor alone or jointly with others.<p>&gt; The Contractor hereby irrevocably assigns to the Company all rights, title and interest, including intellectual property rights, that the Contractor may now or in the future have in and to the Developments and hereby irrevocably waives the Contractor’s moral rights and all other similar rights to any and all copyrights subsisting in the Developments.  If required by the Company, the Contractor also agrees to sign any applications or other documents the Company may reasonably request: (i) to obtain or maintain patent, copyright, industrial design, trade mark or other similar protection for the Developments, (ii) to transfer ownership of the Developments to the Company, and (iii) to assist the Company in any proceeding necessary to protect and preserve the Developments.  The Company will pay for all expenses associated with preparing and filing such documents.<p>Of course, if you have any advice on &quot;gotchas&quot; or other parts of a contract that I should pay extra attention to, please do share!<p>Thanks in advance for your feedback and help.",
      "time": 1632328773,
      "title": "Ask HN: Contract Language and IP Rights",
      "type": "story"
    },
    {
      "by": "arj_vandelay",
      "descendants": 2,
      "id": 28618475,
      "kids": [
        28618534
      ],
      "score": 1,
      "time": 1632328758,
      "title": "Ask HN: Name a SaaS company with a technology moat",
      "type": "story"
    },
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 28618474,
      "score": 1,
      "time": 1632328755,
      "title": "Request for Mozilla Position on an Emerging Web Specification",
      "type": "story",
      "url": "https://github.com/mozilla/standards-positions/issues/453"
    }
  ]
}