{
  "stories": [
    {
      "by": "axiolite",
      "descendants": 0,
      "id": 27945688,
      "score": 1,
      "time": 1627174319,
      "title": "To H-E-Double-Hockey-Sticks with Facebook",
      "type": "story",
      "url": "https://www.damninteresting.com/to-h-e-double-hockey-sticks-with-facebook/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 27945678,
      "score": 1,
      "time": 1627174202,
      "title": "The Truth Behind the Amazon Mystery Seeds A still life of bags, dirt, and plants",
      "type": "story",
      "url": "https://www.theatlantic.com/science/archive/2021/07/unsolicited-seeds-china-brushing/619417/"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 27945668,
      "score": 1,
      "time": 1627174141,
      "title": "What Proust Knew About Identity",
      "type": "story",
      "url": "https://www.wsj.com/articles/what-proust-knew-about-identity-11626364558"
    },
    {
      "by": "mgh2",
      "descendants": 1,
      "id": 27945616,
      "kids": [
        27945683
      ],
      "score": 2,
      "time": 1627173497,
      "title": "Half of the pandemic's unemployment money may have been stolen",
      "type": "story",
      "url": "https://www.axios.com/pandemic-unemployment-fraud-benefits-stolen-a937ad9d-0973-4aad-814f-4ca47b72f67f.html"
    },
    {
      "by": "Martin_Johnson",
      "descendants": 1,
      "id": 27945573,
      "kids": [
        27945655
      ],
      "score": 4,
      "text": "A friend and I are starting a company that helps people optimize their tv subscriptions, so they are paying the least amount possible for the shows that they want to watch. The problem we are having however is that we can&#x27;t find a reliable source of data. I know big companies like google have web crawlers, but Netflix will not let smaller companies scrape their sites as far as we can tell. Do you guys have any ideas as to how to gather information about what online tv services have which shows, and then compile that into a database?",
      "time": 1627172939,
      "title": "Ask HN: How do big companies get all their information?",
      "type": "story"
    },
    {
      "by": "Hedgemaster",
      "descendants": 2,
      "id": 27945567,
      "kids": [
        27945649
      ],
      "score": 2,
      "text": "Here&#x27;s my brief take on the crypto-trading &amp; options trading, their similarities, differences and why I believe the latter will prevail over the former.<p>Unlike stock trading and mutual funds investing, both crypto-trading and options trading are novelties to the majority of US public. And it comes as no surprise that for many they still evoke a healthy dose of suspicion and cautious distrust.<p>Speaking of options trading, in the early 2000-s there was a number of attempts to democratize it (Zecco, TradeKing, etc.) by introducing zero options commissions and creating options-focused knowledge groups. However, those attempts were hindered by the financial crisis of 2008. First of all, people were spooked away from the markets and lost trust in the financial system in general. As such retail trading activity dropped sharply. And second, to revive the economy the Fed decided to cut its key interest rates that severely damaged the revenue stream of low-cost brokerages. After a prolonged “retail brokerage winter” the second wave of retail options trading started in 2015 when Robinhood’s trading app went live.<p>Crypto in turn was born out of the economic crisis: the famous paper &quot;Bitcoin: A Peer-to-Peer Electronic Cash System&quot; was published in October 2008. Many more crypto currencies have emerged since then. Initially crypto trading had been a realm of techies and tech-savvy hobbyists given its limited user-friendliness. There were a few crypto “exchanges” that more often than not employed shady practices at the expense of their customers.<p>So both activities are relatively new, have already gained significant number of supporters&#x2F;practitioners as well as skeptics that outright label them as “gambling”.<p>And although participation in both activities is primarily driven by a potential monetary benefit, here the similarities end. Options trading in my view is superior to crypto-trading for the following 3 reasons:<p>1) MUCH more investment freedom\n2) Limited counterparty risk\n3) Less susceptible to quantum computer attack.<p>So first of all, in crypto trading ppl bet that their coin would go only one direction: upwards. With options (on stocks, index, commodities or even Bitcoin futures itself) everyday traders gain a possibility to speculate on the downside of the price, like protecting themselves from a potential market crash. In fact, if someone believes that the underlying prices would stay EXACTLY SAME they can still benefit with options. It’s worth mentioning that currently options available only for the 2 major cryptos: BTC and ETH although things might have already evolved.<p>Second, there is a potential counterparty risk for crypto trading. The cases are numerous when investors were duped by the rogue crypto exchanges. Such risk does not exist in options trading thanks to the OCC.<p>Lastly, functional quantum computing might arrive in a distant future or might even not materialize at all. But if it does most cryptos (as well as their owners) would be in trouble. Quantum computing might also profoundly disrupt options market but even in that case there will be not only losers but also some big winners.<p>P.S. Spending my career in options trading I realize that I’m pretty likely to be biased in my judgment, so I would love to hear any counter-arguments.",
      "time": 1627172894,
      "title": "Crypto-Trading vs. Options Trading",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 27945551,
      "score": 1,
      "time": 1627172590,
      "title": "Intel Hardware P-State (HWP) / Intel Speed Shift",
      "type": "story",
      "url": "https://smackerelofopinion.blogspot.com/2021/07/intel-hardware-p-state-hwp-intel-speed.html"
    },
    {
      "by": "MilnerRoute",
      "descendants": 0,
      "id": 27945543,
      "score": 4,
      "time": 1627172548,
      "title": "A new bill would hold Facebook responsible for Covid-19 vaccine misinformation",
      "type": "story",
      "url": "https://www.vox.com/recode/2021/7/22/22588829/amy-klobuchar-health-misinformation-act-section-230-covid-19-facebook-twitter-youtube-social-media"
    },
    {
      "by": "SquibblesRedux",
      "descendants": 0,
      "id": 27945527,
      "score": 2,
      "time": 1627172265,
      "title": "CIOs Scouting for Tech Talent Keep Eye on Wage Inflation",
      "type": "story",
      "url": "http://www.wsj.com/articles/cios-scouting-for-tech-talent-keep-eye-on-wage-inflation-11626892424"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 27945485,
      "score": 1,
      "time": 1627171648,
      "title": "Mondex Memories and 1990s CBDC",
      "type": "story",
      "url": "https://chyp.com/2021/07/13/mondex-memories-and-cbdc/"
    }
  ]
}