{
  "stories": [
    {
      "by": "sakopov",
      "descendants": 0,
      "id": 29627203,
      "score": 1,
      "time": 1640020409,
      "title": "Oracle to buy Cerner for $28 billion, its largest-ever acquisition",
      "type": "story",
      "url": "https://www.axios.com/oracle-to-buy-cerner-for-28-billion-its-largest-ever-acquisition-2e3b7c38-6d04-4ff4-8199-4f55eb9b0130.html"
    },
    {
      "by": "bryanmikaelian",
      "descendants": 0,
      "id": 29627193,
      "score": 1,
      "time": 1640020342,
      "title": "Elementary OS 6.1",
      "type": "story",
      "url": "https://blog.elementary.io/elementary-os-6-1-available-now/"
    },
    {
      "by": "tra3",
      "descendants": 0,
      "id": 29627182,
      "score": 1,
      "text": "Hey folks. When I started running a small team, I thought late deliveries and slipped deadlines were my personal fault; a moral failure.<p>I fairly quickly realized that there&#x27;s not much I can do, by looking at case studies, learning how to estimate etc etc.<p>During this time, I discovered civil projects like Boston&#x27;s Big Dig [0]. Which was to be completed between between 1991 and 1998 and instead was delivered in 2007.<p>Subsequently, I also found &quot;Pentagon Wars&quot; [1] about the delivery of the Bradley Fighting Vehicle.<p>Finally looking for more contemporary examples, I came up upon the Joint Strike Fighter program. The goal was to build a new generation fighter. Last I checked only 250 were flying 2018, a far cry from 2000 that were originally ordered.<p>I also found something that I thought was unique to software engineering. Reprioritizing&#x2F;recategorizing bugs and issues to make the release look more palatable. Apparently in 2018 there was no way to confirm target data for smart bombs. Occasionally the tail hook on the carrier variant of F-35 would destroy the airframe [2]:<p>&gt; F-35 officials are recategorizing—rather than fixing—major design flaws to be able to claim they have completed the program’s development phase without having to pay overruns for badly needed fixes. Several of these flaws, like the lack of any means for a pilot to confirm a weapon’s target data before firing, and damage to the plane caused by the tailhook on the Air Force’s variant, have potentially serious implications for safety and combat effectiveness.<p>I stopped keeping track of this a few years back so I&#x27;d like to catch up:<p>- does anyone have a good overview of the latest F-35 status. I enjoy the tech but the project management aspect is more interesting.\n- does anyone know of similar (not necessarily military) projects with massive overruns in cost and time?<p>[0]: Boston&#x27;s Big Dig https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Big_Dig\n[1]: Pentagon Wars https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Pentagon_Wars\n[2]: F-35 Program Cutting Corners to “Complete” Development https:&#x2F;&#x2F;www.pogo.org&#x2F;investigation&#x2F;2018&#x2F;08&#x2F;f-35-program-cutting-corners-to-complete-development&#x2F;",
      "time": 1640020247,
      "title": "Ask HN: Military project management; F35 Lightning II",
      "type": "story"
    },
    {
      "by": "chiefofgxbxl",
      "descendants": 0,
      "id": 29627171,
      "score": 1,
      "text": "I recently received a promotional offer in the mail for a home security system. It boasts both a camera doorbell, but also cameras for the sole purpose of monitoring rooms inside your house. The ad shows an example of monitoring your living room on your phone [0].<p>In the past month I&#x27;ve been to a few homes of family and friends, and was disturbed to see some of them have cameras monitoring the kitchen, dining room, living room, etc. An extended family member even noticed one of the cameras in the corner, pointed to it, and exclaimed jovially, &quot;Don&#x27;t run around naked!&quot;, to which other people laughed.<p>I have so many questions...<p><pre><code>  - Are people really buying into this?\n  - How pervasive is this?\n  - How does the general public express outrage over privacy incidents (e.g. Facebook revelations) but not make the connection to installing 24&#x2F;7 monitoring in their own home opening them up to that risk?\n  - Do people not consider the ability for hackers or even state-agents to maliciously use this?\n  - What sort of chilling effects will our future hold where governments can shut down any sign of disagreement, without you even having to step out into a public forum?\n  - Is there a good way for me to discuss my concerns with family members without overstepping my bounds (*don&#x27;t come in my house and tell me how to live*)\n  - Is privacy dead beyond resuscitation?\n  - Is the future really leaving me behind, where people like myself must become digital hermits against their own will, because &quot;if you don&#x27;t want to be on camera, don&#x27;t come into my house&quot;\n</code></pre>\n[0] https:&#x2F;&#x2F;i.postimg.cc&#x2F;QxxHp9yC&#x2F;security-system.jpg",
      "time": 1640020214,
      "title": "Ask HN: Security Cameras Inside Houses?",
      "type": "story"
    },
    {
      "by": "samm_cz",
      "descendants": 0,
      "id": 29627159,
      "score": 2,
      "time": 1640020161,
      "title": "Adding web based remote control to the old Marantz amplifier (ESP32)",
      "type": "story",
      "url": "https://smallhacks.wordpress.com/2021/12/20/adding-web-based-remote-control-to-my-marantz-amplifier/"
    },
    {
      "by": "croutonwagon",
      "descendants": 0,
      "id": 29627154,
      "score": 1,
      "time": 1640020159,
      "title": "Earth Is Spinning Faster Now Than It Was 50 Years Ago",
      "type": "story",
      "url": "https://www.discovermagazine.com/the-sciences/earth-is-spinning-faster-now-than-it-was-50-years-ago"
    },
    {
      "by": "jger15",
      "descendants": 0,
      "id": 29627137,
      "score": 1,
      "time": 1640020077,
      "title": "Influences",
      "type": "story",
      "url": "https://georgesaunders.substack.com/p/influences"
    },
    {
      "by": "tmaly",
      "descendants": 0,
      "id": 29627124,
      "score": 2,
      "text": "If I wanted to keep my skill set sharp.  What top 3 tech skills should I learn in 2022 to keep providing the most value in your opinion?",
      "time": 1640020027,
      "title": "Ask HN: Top Skills to Learn for 2022?",
      "type": "story"
    },
    {
      "by": "edge17",
      "descendants": 1,
      "id": 29627105,
      "kids": [
        29627162
      ],
      "score": 3,
      "time": 1640019949,
      "title": "Stealth bomber in flight on Google Maps",
      "type": "story",
      "url": "https://www.google.com/maps/place/39%C2%B001%2718.5%22N+93%C2%B035%2740.5%22W/@39.0219215,-93.5946774,253m/data=!3m1!1e3!4m5!3m4!1s0x0:0xd87af7588b9c362e!8m2!3d39.0218056!4d-93.5945833"
    },
    {
      "by": "s_dev",
      "descendants": 0,
      "id": 29627097,
      "score": 1,
      "time": 1640019902,
      "title": "European Alternatives for Digital Products",
      "type": "story",
      "url": "https://european-alternatives.eu"
    }
  ]
}