{
  "stories": [
    {
      "by": "flyingbarron",
      "descendants": 1,
      "id": 32168181,
      "kids": [
        32168183
      ],
      "score": 1,
      "time": 1658334582,
      "title": "Apollo 11 Anniversary List of Lunar Landing Lessons",
      "type": "story",
      "url": "https://flyingbarron.medium.com/moon-landing-anniversary-c1ff67753546"
    },
    {
      "by": "dvdhsu",
      "descendants": 0,
      "id": 32168166,
      "score": 1,
      "time": 1658334511,
      "title": "Big Red Button: how Stripe scaled incident response",
      "type": "story",
      "url": "https://retool.com/blog/incident-response-tools-stripe/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 32168158,
      "score": 1,
      "time": 1658334477,
      "title": "EU asks member states to start rationing gas",
      "type": "story",
      "url": "https://www.axios.com/2022/07/20/eu-countries-ration-gas-russia-blackmail"
    },
    {
      "by": "rrishi",
      "descendants": 0,
      "id": 32168132,
      "score": 1,
      "text": "Hi HN,<p>I recently saw that this book was available on Audible. I prefer audio-reading books these days to prevent straining my eyes. But I was afraid if I would be missing out on any diagrams etc from the physical book if I opt for the audio version.<p>Has anyone gone through the audio version of the book? Would you recommend it?",
      "time": 1658334410,
      "title": "Ask HN: Is it worth it to audio-read Designing Data Intensive Applications?",
      "type": "story"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 1,
      "id": 32168112,
      "kids": [
        32168148
      ],
      "score": 3,
      "time": 1658334354,
      "title": "Cities and Towns Are Paying Tech Workers to Abandon Silicon Valley",
      "type": "story",
      "url": "https://www.wsj.com/articles/tech-workers-silicon-valley-move-out-11657918928"
    },
    {
      "by": "smn1234",
      "descendants": 0,
      "id": 32168105,
      "score": 2,
      "time": 1658334336,
      "title": "Condo owners in South Beach face millions of dollars in special assessments",
      "type": "story",
      "url": "https://therealdeal.com/miami/2022/07/19/mind-boggling-condo-owners-in-south-beach-face-millions-of-dollars-in-special-assessments/"
    },
    {
      "by": "upofadown",
      "descendants": 0,
      "id": 32168089,
      "score": 2,
      "text": "There is currently a committee associated with the IETF (Internet Engineering Task Force) diligently working to replace the block encryption mode used by OpenPGP with something else. The thing is, there is nothing actually wrong with the block encryption mode currently used by OpenPGP. It has been in active use for 20 years now with no issues found. Hence the weirdness. The rational, such as it is, seems to come down to the fact that famous cryptographers like other methods better. That would of been significant 20 years ago when the existing standard was being set but carries no weight now.<p>The current proposal is to replace the current mode with three different modes. Those proposed modes are the sort of thing normally used for online connection oriented media like the TLS system used to protect the web. So they only fit awkwardly for the sort of offline non-connection oriented media that OpenPGP is normally used for. The most significant issue relates to the sort of streaming that many OpenPGP applications are expected to do. The proposed modes can&#x27;t normally do that so the OpenPGP standard has been modified to break the data into blocks to allow the new modes to work. This adds complexity. Extra complexity is known to reduce security and reliability. This ugly hack is entirely unnecessary because, I can not emphasize this enough, there is nothing wrong with the presently used system.<p>Since this is so strange we might as well get some conspiracy theories out of the way... The Snowden leak provided a short list of things the NSA could not get access to. OpenPGP encrypted email was on that list. OpenPGP is used for communications on the dark net. So law enforcement would not mind the loss of interoperability caused by the introduction of a bunch of new encryption modes. The non-technical people that normally use OpenPGP on the dark net probably would not be able to overcome such issues and might have to switch to something else.<p>I seriously doubt there actually is any conspiracy here. My theory is that few understand how the existing system works and as a result automatically assume it doesn&#x27;t. So the story of Chesterton&#x27;s fence might apply.<p>I have attempted to produce an explanation of how the existing OpenPGP encryption mode works:<p>* https:&#x2F;&#x2F;articles.59.ca&#x2F;doku.php?id=pgpfan:mdc | The OpenPGP Modification Detection Code is Actually Good<p>This situation weirded me out enough that I collected my thoughts in the form of an editorial:<p>* https:&#x2F;&#x2F;articles.59.ca&#x2F;doku.php?id=pgpfan:no_new_ae | Replacing the OpenPGP Encryption Mode is Harmful and Pointless",
      "time": 1658334284,
      "title": "There's something odd going on with encryption in the OpenPGP standard",
      "type": "story"
    },
    {
      "by": "makerofspoons",
      "descendants": 0,
      "id": 32168079,
      "score": 1,
      "time": 1658334265,
      "title": "Global extinction threat may be much higher than previously thought",
      "type": "story",
      "url": "https://www.upi.com/Science_News/2022/07/19/global-extinction-threat-may-be-higher-previously-thought/7501658254724/"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 32168069,
      "score": 1,
      "time": 1658334231,
      "title": "750K Indians have given up Indian citizenship in the last 5 years",
      "type": "story",
      "url": "https://twitter.com/aviralbhat/status/1549773704535887872"
    },
    {
      "by": "2517AD",
      "descendants": 0,
      "id": 32168024,
      "score": 1,
      "time": 1658334065,
      "title": "Sounding Out the Acoustic Integrated Circuit",
      "type": "story",
      "url": "https://spectrum.ieee.org/acoustic-integrated-circuit"
    }
  ]
}