{
  "stories": [
    {
      "by": "rckrd",
      "descendants": 0,
      "id": 30655533,
      "score": 1,
      "time": 1647123800,
      "title": "Too Cheap to Meter",
      "type": "story",
      "url": "https://matt-rickard.com/too-cheap-to-meter/"
    },
    {
      "by": "faebi",
      "descendants": 0,
      "id": 30655516,
      "score": 1,
      "text": "I have some non-technical relatives in Russia, and they have started to feel the need to use a VPN for their average internet activities. Is there any recommended company to get a subscription from? I assume the sanctions will be a limiting factor in terms of variety and quality. Or is it better that I, as an outsider, pay the subscription and they just start using it from Russia? I hope we can keep the conversation non-political because I just want to help my relatives remain as free and informed as possible, despite the situation.<p>So, which VPN provider should one use from Russia?",
      "time": 1647123642,
      "title": "Ask HN: Which VPN provider should one use from Russia?",
      "type": "story"
    },
    {
      "by": "Claude_Shannon",
      "descendants": 0,
      "id": 30655485,
      "score": 1,
      "time": 1647123438,
      "title": "Robert Caro: Understanding Power",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=_MZInSqcksg"
    },
    {
      "by": "LeoPanthera",
      "descendants": 0,
      "id": 30655479,
      "score": 1,
      "time": 1647123414,
      "title": "Smart-TV Blocklist for Pi-Hole",
      "type": "story",
      "url": "https://perflyst.github.io/PiHoleBlocklist/SmartTV.txt"
    },
    {
      "by": "tiahura",
      "descendants": 0,
      "id": 30655455,
      "score": 2,
      "time": 1647123243,
      "title": "Walgreens replaced some fridge doors with screens. And some shoppers hate it",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_455b3197eb28a98a8912791bc1bbdbfd"
    },
    {
      "by": "morpheos137",
      "descendants": 0,
      "id": 30655448,
      "score": 3,
      "text": "Many official and semi-official Russian websites are blocked from viewing.<p>In last year or two north Korean official videos or channels have been removed from view.<p>Alternative perspectives are censored everywhere from the topics of gender identity to covid to international politics.<p>Now we are not even allowed to hear what the &quot;other&quot; side has to say.<p>Meanwhile our &quot;mainstream&quot; media promotes misinformation or unverified suppositions.<p>Examples: Hillary lost due to &quot;Russian&quot; info warfare.<p>Discussion Hunter Biden&#x27;s personal commercial activities in Ukraine while his father was Obama&#x27;s vice president is forbidden.<p>Discussion of alternative or prophylactic therapies for covid 19 (e.g. Ivermectin) is forbidden.<p>Meanwhile in January 2020 the same media was assuring us Covid was not &quot;airborn&quot; and was a China problem.<p>People are convicted in the court of public opinion without a trial of various offenses without sound evidence, so called cancel culture.<p>Mayor De Blasio of New York even encouraged people to eat out at Chinese restaurants.<p>Bottom line what the heck happened to our democratic society in the past several years where we have to be sheltered from open discussion like children?<p>Isn&#x27;t one of the fundamental premises of democracy that people sift through the market place of ideas to find a nearer optimal solution than autocrats?",
      "time": 1647123173,
      "title": "As a citzn of the free and democratic west I'm disgusted by the information war",
      "type": "story"
    },
    {
      "by": "miohtama",
      "descendants": 0,
      "id": 30655442,
      "score": 2,
      "time": 1647123149,
      "title": "Putin’s pre-war moves against U.S. tech giant staff",
      "type": "story",
      "url": "https://www.washingtonpost.com/world/2022/03/12/russia-putin-google-apple-navalny/"
    },
    {
      "by": "gzer0",
      "descendants": 1,
      "id": 30655436,
      "kids": [
        30655498
      ],
      "score": 3,
      "time": 1647123130,
      "title": "Russian Web Brigades",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Russian_web_brigades"
    },
    {
      "by": "jdmg94",
      "descendants": 0,
      "id": 30655422,
      "score": 1,
      "text": "Its common in our industry to get to tech interviews and expect to do white boarding exercises about binary tree and matrix operations. And while these can prove your academic proficiency, these are rarely the day to day skills that make a developer competent. I was told by a hiring manager once that their reasoning behind this is that &quot;if you know the CS fundamentals it would be easier to collaborate across teams&quot;. To me this doesn&#x27;t really translate into real life. I just wanted to rant about my dissatisfaction with white boarding interviews, but I also wanted to know what is the general sentiment at HN",
      "time": 1647123051,
      "title": "Are Whiteboard Interviews the Best Way to Measure Devs?",
      "type": "story"
    },
    {
      "by": "T-A",
      "descendants": 0,
      "id": 30655411,
      "score": 1,
      "time": 1647122964,
      "title": "Violinists Across 29 Countries Play to Support Ukraine",
      "type": "story",
      "url": "https://www.violinist.com/blog/laurie/20223/29139/"
    }
  ]
}