{
  "stories": [
    {
      "by": "dbrereton",
      "descendants": 0,
      "id": 32138698,
      "score": 1,
      "time": 1658153999,
      "title": "The Independent Researcher (2018)",
      "type": "story",
      "url": "https://nadia.xyz/independent-research"
    },
    {
      "by": "pcr910303",
      "descendants": 0,
      "id": 32138691,
      "score": 1,
      "time": 1658153958,
      "title": "Komet: A Cocoa editor for creating commit messages",
      "type": "story",
      "url": "https://github.com/zorgiepoo/Komet"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 32138636,
      "score": 1,
      "time": 1658153679,
      "title": "Taking the Magic Out of Magic Mushrooms",
      "type": "story",
      "url": "https://www.nytimes.com/2022/07/15/opinion/hallucinations-psychedelics-depression.html"
    },
    {
      "by": "bradley_taunt",
      "descendants": 0,
      "id": 32138631,
      "score": 1,
      "time": 1658153666,
      "title": "Two Years and over 700 Websites Later",
      "type": "story",
      "url": "https://1mb.club/blog/reflection/"
    },
    {
      "by": "marcomassaro",
      "descendants": 0,
      "id": 32138614,
      "score": 1,
      "text": "Hey HN!<p>I’ve been a DTC founder in the oral care space for several years and was looking to bring new innovation to the electric toothbrush aisle.<p>My biggest pain point with electric toothbrushes came from my own experiences using competing brands. The brushes took up a lot of bathroom counter space when charging, had an unsightly wire running from the wall and the dock often filled with water&#x2F;gunk. Not to mention I’d often knock over my brush when reaching for other bathroom tools.<p>I wanted to create a product that was always within reach, but out of the way. Something that lived in the bathroom and improved the aesthetic - not detracted from it.<p>The “aha” moment came when I got a new Dyson wall charging vacuum in my home. The product was incredible - it was easy to grab and go, accessible and made vacuuming a fun task, not a chore. The thought of lugging out a heavy vacuum from the closet and plugging a wire in was something of the past. Dyson brought incredible innovation to this small routine.<p>I applied this same thought process to Mode. I wanted to create a brush that lived on the wall like the Dyson vacuum and was easy to grab and go. Something that had no wires, was not intrusive and made the routine of brushing a better experience.<p>I embarked on a 2+ year journey with an amazing design and engineering team. Together, we created a compact charging dock that plugs directly into the bathroom wall and magnetically docks and charges the toothbrush.<p>The biggest challenge we faced was getting all of the components in such a compact wireless dock (magnets, charging coil, LED nightlight, etc) in addition to getting the charging to work without overheating.<p>The product is patent-pending and I’m incredibly excited for the future of brushing. Happy to answer any questions and would love feedback.",
      "time": 1658153566,
      "title": "Show HN: I created a toothbrush that docks and charges without wires",
      "type": "story",
      "url": "https://m0de.com/"
    },
    {
      "by": "wglb",
      "descendants": 0,
      "id": 32138613,
      "score": 1,
      "time": 1658153560,
      "title": "Helping Secure Amateur Radio’s Digital Future",
      "type": "story",
      "url": "https://hackaday.com/2022/07/15/helping-secure-amateur-radios-digital-future/"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 32138611,
      "score": 1,
      "time": 1658153560,
      "title": "Is differential privacy the right fit for your problem?",
      "type": "story",
      "url": "https://desfontain.es/privacy/litmus-test-differential-privacy.html"
    },
    {
      "by": "yamrzou",
      "descendants": 1,
      "id": 32138601,
      "kids": [
        32138634
      ],
      "score": 1,
      "time": 1658153504,
      "title": "Neuroticism",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Neuroticism"
    },
    {
      "by": "xmorse",
      "descendants": 0,
      "id": 32138597,
      "score": 1,
      "time": 1658153485,
      "title": "Build a full featured blog website from Notion",
      "type": "story",
      "url": "https://notaku.website/product/blog"
    },
    {
      "by": "dannyrosen",
      "descendants": 0,
      "id": 32138571,
      "score": 1,
      "time": 1658153370,
      "title": "Hidden Interfaces for Ambient Computing",
      "type": "story",
      "url": "https://olwal.com/hidden"
    }
  ]
}