{
  "stories": [
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 31272613,
      "score": 1,
      "time": 1651754645,
      "title": "BigBrotherAwards Germany 2022",
      "type": "story",
      "url": "https://bigbrotherawards.de/en/2022"
    },
    {
      "by": "MattJ100",
      "descendants": 0,
      "id": 31272609,
      "score": 1,
      "time": 1651754626,
      "title": "Togethr: Own Mastodon-compatible decentralized social network instance",
      "type": "story",
      "url": "https://togethr.party/"
    },
    {
      "by": "lucapiccinelli",
      "descendants": 1,
      "id": 31272607,
      "kids": [
        31272608
      ],
      "score": 1,
      "time": 1651754621,
      "title": "What Is Legacy Code? An Opinionated and Analytic Definition",
      "type": "story",
      "url": "https://studiofarma.github.io/CGM-Innovation-Hub-Tech-Blog/What-is-legacy-code/"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 31272602,
      "score": 1,
      "time": 1651754568,
      "title": "Automatic Tax Filing?",
      "type": "story",
      "url": "https://marginalrevolution.com/marginalrevolution/2022/05/automatic-tax-filing.html"
    },
    {
      "by": "0uobatchy",
      "descendants": 0,
      "id": 31272582,
      "score": 1,
      "time": 1651754441,
      "title": "I Spent $1000 Making an NFT Project and Unfortunately Learned Some Things",
      "type": "story",
      "url": "https://hatingonoats.com/blog/I%20Spent%20$1000%20Making%20an%20NFT%20Project%20And%20Unfortunately%20Learned%20Some%20Things"
    },
    {
      "by": "khadgar25",
      "descendants": 0,
      "id": 31272576,
      "score": 2,
      "text": "I have had a bit of a non-standard career trajectory. I started out with an undergrad in engineering (aerospace), with a masters in applied physics, then a PhD in theoretical physics. Then not wanting to bounce between post-docs, I decided to try out industry and someone was kind enough to give me a chance at a full-stack role which was interesting but got a little boring after a year so I tried quantitative research at a bank for a couple years which ended up being mostly writing code and not much modeling. I craved more research so I looked elsewhere and found a role doing High Performance Computing for an Oil and Gas company&#x27;s research center for a few years which was fun and I learned a lot but there wasn&#x27;t much career growth in that role and due to some other family&#x2F;financial constraints, I ended up leaving that to come back to NY to work at a bank as a quant developer.<p>At this point in my life, I really do enjoy being a developer (primarily C++ but I enjoy more theoretical&#x2F;drier aspects as well and I often dabble in Haskell and functional programming and incorporate that in my work and personal projects). I have about 7 years of work experience after 6 years of grad school.<p>Lately, I have been battling with anxiety and depression and some of that has to do with me being not completely satisfied with my job. Although I enjoy programming, I was never the hacker teenager and didn&#x27;t grow up with friends or family of coders. I have primarily seen myself as a problem solver throughout my life and I enjoy that. The main thing that I am lacking at this point and have missed throughout my life is a purpose. I would like to have a job where I can solve problems while making an impact of some kind, whether it be through writing code or something else. But I don&#x27;t know how to go about finding what that might be. I am also feeling a little burnt out but I feel that it&#x27;s a bit silly to be burnt out so early in my career.<p>Any advice is appreciated.",
      "time": 1651754397,
      "title": "Ask HN: Advice for finding purpose and early career burn out",
      "type": "story"
    },
    {
      "by": "nsoonhui",
      "descendants": 0,
      "id": 31272565,
      "score": 1,
      "time": 1651754346,
      "title": "Russia Just Lost Its Most Advanced Operational Tank in Ukraine",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/russia-just-lots-its-most-advanced-operational-tank-in-ukraine"
    },
    {
      "by": "georgehill",
      "descendants": 0,
      "id": 31272525,
      "score": 1,
      "time": 1651754056,
      "title": "Bing index spike – Feb/2022",
      "type": "story",
      "url": "https://www.worldwidewebsize.com"
    },
    {
      "by": "kennethologist",
      "descendants": 1,
      "id": 31272498,
      "kids": [
        31272515
      ],
      "score": 2,
      "time": 1651753916,
      "title": "Starlink adds $25/month to let users move their internet around",
      "type": "story",
      "url": "https://techcrunch.com/2022/05/05/starlink-adds-25-month-portability-add-on-that-lets-users-move-their-internet-around/"
    },
    {
      "by": "mirrowing",
      "descendants": 0,
      "id": 31272493,
      "score": 3,
      "time": 1651753885,
      "title": "“Black widow” neutron star takes an hour to orbit the star it’s roasting",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/05/black-widow-neutron-star-takes-an-hour-to-orbit-the-star-its-roasting/"
    }
  ]
}