{
  "stories": [
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 29639573,
      "score": 1,
      "time": 1640107211,
      "title": "Tesla pulled down prices for the Roadster and took down the Founder's Edition",
      "type": "story",
      "url": "https://twitter.com/RyanDavisIND/status/1472650777214791682"
    },
    {
      "by": "Travis-Turner",
      "descendants": 1,
      "id": 29639561,
      "kids": [
        29639562
      ],
      "score": 1,
      "time": 1640107169,
      "title": "AI and the auteur: using neural networks as artistic tools",
      "type": "story",
      "url": "https://evilmartians.com/chronicles/ai-and-the-auteur-using-neural-networks-as-artistic-tools"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29639558,
      "score": 1,
      "time": 1640107164,
      "title": "Terraform Labs: SEC lacks jurisdiction to compel cooperation in investigation",
      "type": "story",
      "url": "https://www.theblockcrypto.com/linked/128187/terraform-labs-argues-sec-lacks-jurisdiction-to-compel-cooperation-in-its-investigation"
    },
    {
      "by": "gajananpp",
      "descendants": 0,
      "id": 29639541,
      "score": 1,
      "time": 1640107102,
      "title": "Show HN: Automate web pages from browser's developer tools",
      "type": "story",
      "url": "https://github.com/gajananpp/puppeteer-ide-extension"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 29639534,
      "score": 1,
      "time": 1640107061,
      "title": "Stop Closing Apps on Your iPhone",
      "type": "story",
      "url": "https://www.howtogeek.com/773871/stop-closing-apps-on-your-iphone/"
    },
    {
      "by": "dgul2tor",
      "descendants": 1,
      "id": 29639503,
      "kids": [
        29639504
      ],
      "score": 2,
      "time": 1640106907,
      "title": "Thoughts on data privacy infrastructure for the future",
      "type": "story",
      "url": "https://cipherflow.co"
    },
    {
      "by": "lopkeny12ko",
      "descendants": 0,
      "id": 29639486,
      "score": 2,
      "text": "I work at a startup with ~50 employees (and have always worked at startups). Love the work and the people. Recently we were acquired by $LARGE_CORPORATION and the experience has been a living hell for all of us. Things that should take a few days take a few weeks. Things that should take a few weeks take a few quarters. It&#x27;s slowly driving me insane.<p>The experience is best shared as a story.<p>I&#x27;m working on migrating our apps to the parent company&#x27;s VM launching and deploy platform. Should be fairly straightforward, I think. Unfortunately, the deploy tooling isn&#x27;t entirely compatible with our app so I ask the team if they can implement $X feature to support our app.<p>The first engineer I talk to doesn&#x27;t even attempt to answer my question but redirects me to their manager. Ok, that&#x27;s odd, I think, but whatever.<p>Manager says sure, just fill out this feature request doc. It&#x27;s a Google Docs template with 4 (!) pages of required documentation to just explain why I want this feature implemented. It asks for my team name, the motivation, why I can&#x27;t solve the problem some other way, yada yada...ok, I guess it&#x27;s good to document your work, so sure. I fill it out and submit it.<p>No response after two days. Then I get an automated email that their <i>skip</i> level manager has approved the work. Huh? This is followed by an email that the team&#x27;s eng manager approved the work. Why do two layers of management need to approve work on something they have no knowledge about?<p>Finally, after many rounds of arguing about why this needs to be done in the first place (ahem: you told us to migrate to your platform, and it literally does not work for our app), they quote us a delivery timeline of <i>end of Q1 in 2022</i>.<p>At this point I am in absolute shock. This should take no more than a few days to implement.<p>So I reach out to the manager and ask what is going on. This is a simple task, I said. Why does it take an entire quarter for your team to deliver? He doesn&#x27;t have an answer.<p>I tell him I&#x27;m happy to fix the issue myself, if they link me to the relevant codebase. &quot;It shouldn&#x27;t be too hard to dig in and submit a patch,&quot; I think to myself. He says he cannot give me access to the codebase for compliance reasons, and that only members of his team have R&#x2F;W on that repo. What???<p>This is insane. And this entire time I was only alllowed to interact with managers and have not spoken to a single engineer about the actual technical details. It is impossible to get anything <i>done</i> here now.<p>Is this how it&#x27;s like at all large companies? What should I do?",
      "time": 1640106813,
      "title": "Ask HN: Startup acquired by a large company and it sucks. What to do?",
      "type": "story"
    },
    {
      "by": "23pointsNorth",
      "descendants": 0,
      "id": 29639473,
      "score": 1,
      "time": 1640106737,
      "title": "From Amazon to Zoom: What Happens in an Internet Minute in 2021?",
      "type": "story",
      "url": "https://www.visualcapitalist.com/from-amazon-to-zoom-what-happens-in-an-internet-minute-in-2021/"
    },
    {
      "by": "CRConrad",
      "descendants": 0,
      "id": 29639469,
      "score": 1,
      "time": 1640106719,
      "title": "3D printed nanomagnets unveil a world of patterns in the magnetic field",
      "type": "story",
      "url": "https://phys.org/news/2021-12-3d-nanomagnets-unveil-world-patterns.html"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29639464,
      "score": 1,
      "time": 1640106695,
      "title": "What the EPA's new vehicle emissions requirements look like",
      "type": "story",
      "url": "https://www.autonews.com/regulation-safety/heres-what-epas-new-vehicle-emissions-requirements-look-under-biden"
    }
  ]
}