{
  "stories": [
    {
      "by": "gautamsomani",
      "descendants": 0,
      "id": 29217302,
      "score": 1,
      "text": "I can solve simple sudoku, well everyone can I guess. But when it comes to difficult levels, I fail. And I have never been able to solve a Rubik&#x27;s cube.<p>My question is - can people solve these without any training or knowlegde of tricks or actual methods to solve them? Am I banging my head at the wrong wall? Should I learn about the methodology or is an average person supposed to solve these without any training?",
      "time": 1636899642,
      "title": "Ask HN: Is it possible to solve Sudoku or Rubik's Cube without training",
      "type": "story"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 29217288,
      "score": 1,
      "time": 1636899497,
      "title": "The Longest Lunar Eclipse of the Century Is Coming Next Week",
      "type": "story",
      "url": "https://www.goodnewsnetwork.org/the-longest-lunar-eclipse-of-the-century-is-coming-nov-2021/"
    },
    {
      "by": "SQL2219",
      "descendants": 1,
      "id": 29217280,
      "kids": [
        29217307
      ],
      "score": 1,
      "time": 1636899424,
      "title": "Wild Bidding Wars Erupt at Used-Tractor Auctions Across the U.S.",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-11-13/deere-strike-ignites-bidding-wars-for-used-tractors"
    },
    {
      "by": "jitl",
      "descendants": 0,
      "id": 29217277,
      "score": 2,
      "time": 1636899397,
      "title": "Apple Buying Ads via Google for Subscription Apps to Capture App’s Revenue",
      "type": "story",
      "url": "https://www.forbes.com/sites/johnkoetsier/2021/11/12/apple-quietly-buying-ads-via-google-for-high-value-subscription-apps-to-capture-app-publisher-revenue/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29217267,
      "score": 1,
      "time": 1636899331,
      "title": "A leading arms expert imagines North Korean nuclear attack on the US (2018)",
      "type": "story",
      "url": "https://www.theverge.com/2018/8/8/17649588/north-korea-nuclear-attack-2020-commission-report-jeffrey-lewis-book-interview"
    },
    {
      "by": "OulaX",
      "descendants": 0,
      "id": 29217252,
      "score": 2,
      "text": "I want to learn Algorithms &amp; Data Structures from scratch then move on to doing LeetCode.<p>But I want a structured guide &#x2F; textbook that I can follow which also contains exercises.<p>I have checked the CLRS book, but, it&#x27;s more of a reference than a book that you can read from cover to cover. For example a basic Stack is explained in a page and a half or two, for me this is not enough, I want a book that can go into the details of each specific DS or Algorirhm.<p>*TL;DR:* Are there any books better than CLRS for DS &amp; Algos?",
      "time": 1636899177,
      "title": "Ask HN: Looking for a Book on Algorithms and Data Structures",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 29217250,
      "score": 1,
      "time": 1636899175,
      "title": "Can we use big batteries to power our trains?",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/11/can-we-run-our-trains-using-big-batteries/"
    },
    {
      "by": "vandermondd",
      "descendants": 0,
      "id": 29217243,
      "score": 2,
      "text": "Dear people of computer science (and related fields) who love their job. I&#x27;d appreciate if you can share your experience regarding the following:<p>How do you define your role?<p>What do you love about the work you do?<p>What part of your work are you surprised you love today?<p>Which part of work affects your passion?\nThings which are part of your responsibilities and&#x2F;or things which are enabled by certain properties of your work place?<p>What would you advise your past self towards the end of your studies and before&#x2F;at the beginning of your career?<p>Which role do you find interesting today and haven&#x27;t heard about during your studies?",
      "time": 1636899072,
      "title": "Ask HN: People of Comp-Sci and related who love their job. What do you do?",
      "type": "story"
    },
    {
      "by": "tropicware",
      "descendants": 0,
      "id": 29217241,
      "score": 1,
      "time": 1636899053,
      "title": "DJI Black Friday 2021",
      "type": "story",
      "url": "https://www.businesswire.com/news/home/20211113005120/en/DJI-Black-Friday-Deals-2021-Early-Osmo-Spark-FPV-Mavic-Savings-Monitored-by-Spending-Lab"
    },
    {
      "by": "SCLeo",
      "descendants": 0,
      "id": 29217206,
      "score": 1,
      "text": "I have been using my phone for about 3 years. It has become slower and slower. In the beginning, everything opens instantly. Now, it literally takes 10 seconds just to open Chrome. I quit all the applications after I am done with them. In that case, I don&#x27;t understand. What is making my phone less responsive?<p>(I tried to lookup, but all I got are some weird claims from some shady news websites about battery dying or system updates, which does not really make sense to me.)",
      "time": 1636898687,
      "title": "Ask HN: Why do Android phones become slower?",
      "type": "story"
    }
  ]
}