{
  "stories": [
    {
      "by": "kevcampb",
      "descendants": 0,
      "id": 29646949,
      "score": 1,
      "time": 1640162950,
      "title": "Log4j: China pulls support from Alibaba for not reporting to government first",
      "type": "story",
      "url": "https://www.scmp.com/tech/big-tech/article/3160670/apache-log4j-bug-chinas-industry-ministry-pulls-support-alibaba-cloud"
    },
    {
      "by": "vijaykodam",
      "descendants": 0,
      "id": 29646936,
      "score": 1,
      "time": 1640162858,
      "title": "How to open a door – Finnish instructional video from 1979",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Wof0xPUmW38"
    },
    {
      "by": "erwald",
      "descendants": 0,
      "id": 29646930,
      "score": 1,
      "time": 1640162797,
      "title": "How to Compare Incomes Across Countries",
      "type": "story",
      "url": "https://mattbruenig.com/2021/12/08/how-to-compare-incomes-across-countries/"
    },
    {
      "by": "bonnie76",
      "descendants": 1,
      "id": 29646917,
      "kids": [
        29646918
      ],
      "score": 1,
      "time": 1640162693,
      "title": "John C. Lilly ‘modified human agents’ human, dolphin neuropsychology experiments",
      "type": "story",
      "url": "https://journals.sagepub.com/doi/full/10.1177/0952695119872094"
    },
    {
      "by": "WolfOliver",
      "descendants": 0,
      "id": 29646911,
      "score": 1,
      "time": 1640162633,
      "title": "Jest, Enzyme vs. Cypress.js – Why writing only e2e tests might be smarter",
      "type": "story",
      "url": "https://wolfoliver.medium.com/jest-enzyme-vs-cypress-js-df5b741ee170"
    },
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 29646908,
      "score": 1,
      "time": 1640162618,
      "title": "The Biggest Lie in Open Source",
      "type": "story",
      "url": "https://betterprogramming.pub/the-biggest-lie-in-open-source-de38f71aa88c?gi=97faa16f2d0f"
    },
    {
      "by": "jishudashu",
      "descendants": 0,
      "id": 29646890,
      "score": 1,
      "text": "On May 18, 2021, the Starcoin main net was launched, and in just a few months, it has accumulated a group of loyal fans in the community. The Starcoin hackathon will be opened at the end of December 2021, and the theme of this event is All in Metaverse &amp; Defi on Starcoin, as a public chain using Move language, it will invest all resources in the direction of Metaverse and Defi, and strive for a breakthrough in the letter.<p>This year&#x27;s hackathon will invite representatives from Starcoin and Move communities, senior Defi developers, industry guests, and investment institutions to participate in the selection process so that excellent projects can be selected.<p>So what kind of advantages does Starcoin have over other public chains in the meta-universe and Defi track? In this article, we list the ten highlights and innovative designs of Starcoin for your reference.<p>Highlight 1: Clear ownership\nInside the public chain with Solidity as the smart contract language, taking ERC20 as an example, although the wallet shows that a certain ERC20 belongs to a certain account, however, there is no such data in the data storage of the account. Where is this data? The data is stored uniformly under the account of the contract implementation of that ERC20, distinguished by a Map-like data structure, marked by Address. This centralized way of storing data, on the one hand, does not give ownership of the data to the corresponding account, and on the other hand, there are security risks.<p>Highlight 2: State Charging\nState explosion is a problem faced by many public chains. A lot of data, which is written to the chain, even if it no longer has any value and meaning, has to be kept for a long time and synchronized by other nodes. This is a great waste of resources and a distributed system that only increases and decreases it difficult to maintain continuity in the long run, which is a problem to be faced sooner or later.<p>Highlight 3: Formal Verification: A cutting-edge technology to prove the security of programs through mathematical means\nEthereum-led public chains have been exploring formal verification to improve the security of smart contracts for many years, but have not found a good and implementable solution.<p>Highlight 4: A feature that other public chains do not have: Stdlib\nStarcoin enables the official ordering and publishing of some common contracts using Stdlib, which is convenient for other users to use out of the box.<p>Highlight 5: Complete on-chain governance DAO\nStarcoin has customized a very common on-chain governance DAO contract in Stdlib, which is ready to use out of the box. Anyone can use it, and any decision at the contract level can be done in an on-chain governance way. Also, anyone in the community can participate in the governance of the community by voting for or against it.<p>Highlight 6: Secure Smart Contract Upgrade Solution\nStarcoin believes in the law as code. In some very specific cases, Starcoin also wants to have a solution for securely upgrading smart contracts.<p>Highlight 7: Scalable second layer\nStarcoin is a layered smart contract and Defi network, which means that Starcoin will not only have a layer of the network but will also design and implement its second layer. Starcoin&#x27;s second layer is dedicated to securely connecting everyone, penetrating blockchain technology into daily life scenarios, and allowing users to enjoy the dividends and convenience of blockchain.<p>For the follow-up of the Starcoin Hackathon, you can keep following the official channels of the project for information\nTelegram: https:&#x2F;&#x2F;t.me&#x2F;Starcoin_STC\nTwitter: https:&#x2F;&#x2F;twitter.com&#x2F;starcoinstc\nDiscord: https:&#x2F;&#x2F;discord.com&#x2F;invite&#x2F;starcoin",
      "time": 1640162499,
      "title": "Starcoin will soon open a global hackathon competition",
      "type": "story"
    },
    {
      "by": "seamus-ethos",
      "descendants": 1,
      "id": 29646887,
      "kids": [
        29646889
      ],
      "score": 1,
      "text": "The comment box appears to be missing on this Ask HN post.  Is it possible that it was disabled?<p>https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29405056",
      "time": 1640162436,
      "title": "Can't comment on “Who's hiring” post",
      "type": "story"
    },
    {
      "by": "buro9",
      "descendants": 0,
      "id": 29646860,
      "score": 1,
      "time": 1640162196,
      "title": "Shock an aw: US teenager wrote slice of Scots Wikipedia",
      "type": "story",
      "url": "https://www.theguardian.com/uk-news/2020/aug/26/shock-an-aw-us-teenager-wrote-huge-slice-of-scots-wikipedia"
    },
    {
      "by": "okareaman",
      "descendants": 0,
      "id": 29646853,
      "score": 1,
      "time": 1640162158,
      "title": "The Pervert's Guide to Computer Programming Languages – SXSW",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=mZyvIHYn2zk"
    }
  ]
}