{
  "stories": [
    {
      "by": "SuDa2103",
      "descendants": 0,
      "id": 31754384,
      "score": 1,
      "time": 1655306694,
      "title": "Celsius – one of Web3's biggest lenders – freezes withdrawals",
      "type": "story",
      "url": "https://www.newbiescrypto.com/p/celsius-freezes-withdrawals"
    },
    {
      "by": "carpintech",
      "descendants": 0,
      "id": 31754364,
      "score": 1,
      "time": 1655306628,
      "title": "Internet Explorer, the love-to-hate-it web browser, has died at 26",
      "type": "story",
      "url": "https://www.npr.org/2021/05/22/999343673/internet-explorer-the-love-to-hate-it-web-browser-will-die-next-year"
    },
    {
      "by": "greg_lim",
      "descendants": 0,
      "id": 31754355,
      "score": 1,
      "time": 1655306610,
      "title": "Solomon’s Search for Meaning",
      "type": "story",
      "url": "https://greglim81.medium.com/solomons-search-for-meaning-9f93cca85b0"
    },
    {
      "by": "HarvardClassics",
      "descendants": 0,
      "id": 31754336,
      "score": 1,
      "text": "Jun 15: Froissart&#x27;s WAT TYLER&#x27;S REBELLION<p>Strikers Storm the Tower of London<p>Led by Wat Tyler in 1381, great troops of villagers and rustics marched on London—laid siege to the Tower—sacked the apartments of the King and murdered his ministers. Froissart gives first-hand information of this rebellion.<p>Read from Froissart&#x27;s WAT TYLER&#x27;S REBELLION<p>Vol. 35, pp. 60-72 (starts on page 39 of the .pdf)<p>Download Link Here: https:&#x2F;&#x2F;www.myharvardclassics.com&#x2F;categories&#x2F;20120212<p>Please comment below on your own thoughts and feeling towards today&#x27;s reading.<p>Here are some passages I found interesting:<p>There was never realm nor country in so great adventure as it was in that time, and all because of the ease and riches that the common people were of, which moved them to this rebellion, as sometime they did in France, the which did much hurt, for by such incidents the realm of France hath been greatly grieved.<p>And of this imagination was a foolish priest in the country of Kent called John Ball, for the which foolish words he had been three times in the bishop of Canterbury&#x27;s prison : for this priest used oftentimes on the Sundays after mass, when the people were going out of the minster, to go into the cloister and preach, and made the people to assemble about him, and would say thus: &#x27;Ah, ye good people, the matters goeth not well to pass in England, nor shall not do till every- thing be common, and that there be no villains nor gentlemen, but that we may be all unied together, and that the lords be no greater masters than we be. What have we deserved, or why should we be kept thus in servage? We be all come from one father and one mother, Adam and Eve : whereby can they say or shew that they be greater lords than we be, saving by that they cause us to win and labour for that they dispend<p>And when they were come to Rochester, they had there good cheer; for the people of that town tarried for them, for they were of the same sect, and then they went to the castle there and took the knight that had the rule thereof, he was called sir John Newton, and they said to him: &#x27;Sir, it behoveth you to go with us and you shall be our sovereign captain and to do that we will have you.&#x27; The knight excused himself honestly and shewed them divers considerations and excuses, but all availed him nothing. for they said unto him : &#x27;Sir John, if ye do not as we will have you, ye are but dead.&#x27;<p>for there were some that desired nothing but riches and the utter destruction of the noblemen and to have London robbed and pilled; that was the principal matter of their beginning, the which they well shewed; for as soon as the Tower gate opened and that the king was issued out with his two brethren and the earl of Salisbury, the earl of Warwick, the earl of Oxford, sir Robert of Namur, the lord of Vertaing, the lord Gommegnies and divers other, then Wat Tyler, Jack Straw and John Ball and more than four hundred entered into the Tower and brake up chamber after chamber, and at last found the archbishop of Canterbury, called Simon, a valiant man and a wise, and chief chancellor of England, and a little before he had said mass before the king. These gluttons took him and strake off his head, and also they beheaded the lord of Saint John&#x27;s and a friar minor, master in medicine, pertaining to the duke of Lancaster, they slew him in despite of his master, and a sergeant at arms called John Leg; and these four heads were set on four long spears and they made them to be borne before them through the streets of London and at last set them a-high on London bridge, as though they had been traitors to the king and to the realm.",
      "time": 1655306528,
      "title": "Harvard Classics Reading Club: Jun 15: Froissart's Wat Tyler's Rebellion",
      "type": "story"
    },
    {
      "by": "erulabs",
      "descendants": 0,
      "id": 31754332,
      "score": 1,
      "time": 1655306522,
      "title": "Why are industrial Pis so expensive?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=9MqJI_F-sz8"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 31754331,
      "kids": [
        31754335
      ],
      "score": 1,
      "time": 1655306511,
      "title": "The Rise of the Internet's Creative Middle Class",
      "type": "story",
      "url": "https://www.newyorker.com/culture/culture-desk/the-rise-of-the-internets-creative-middle-class"
    },
    {
      "by": "fairytalemtg",
      "descendants": 0,
      "id": 31754330,
      "score": 1,
      "time": 1655306508,
      "title": "Housing prices will have to soften if rates go higher",
      "type": "story",
      "url": "https://www.cnbc.com/video/2022/06/15/housing-prices-will-have-to-soften-if-rates-go-higher-says-douglas-elliman-ceo-scott-durkin.html"
    },
    {
      "by": "Katydid",
      "descendants": 0,
      "id": 31754318,
      "score": 1,
      "time": 1655306463,
      "title": "Disk drives later, Floppotron computer hardware orchestra hits v3.0",
      "type": "story",
      "url": "https://www.theregister.com/2022/06/15/floppotron/"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 31754296,
      "score": 1,
      "time": 1655306420,
      "title": "Interfaces, generics, methods, encapsulation, RAII, implemented in C with blocks",
      "type": "story",
      "url": "https://github.com/dev-gm/c-oop"
    },
    {
      "by": "wrycoder",
      "descendants": 0,
      "id": 31754284,
      "score": 1,
      "time": 1655306382,
      "title": "‘Sentient’ chatbot story shows why it’s time for A.I. to retire the Turing Test",
      "type": "story",
      "url": "https://fortune.com/2022/06/14/blake-lemoine-sentient-ai-chatbot-google-turing-test-eye-on-a-i/"
    }
  ]
}