{
  "stories": [
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 28387503,
      "score": 1,
      "time": 1630544429,
      "title": "SOFR risk now accounts for 30% of USD Rates markets",
      "type": "story",
      "url": "https://www.clarusft.com/august-2021-what-happened/"
    },
    {
      "by": "rustycobb",
      "descendants": 0,
      "id": 28387498,
      "score": 1,
      "text": "If you found this post odds are your probably going through some shit. You probably have tons of responsibilities but can barely muster up enough energy to make it through the day. Nothing is done and your wondering who the fuck you are, because this is not like you. What ever your situation is Kratom cause. If your trying to quit, you need to do it cold turkey. You cannot taper it’s a joke you will either cheat or find yourself in a constant state of withdrawal. Ya I know about the suicidal thoughts your poisoning your body it’s looking for a way out. It gets dark you think no one understands how dark it gets. Your not alone. You need to go 7 days!!! Fuck what they say about your time of use, body fat, type or strain. Go seven days!! When it’s at its worst and your ready to give in, understand it’s at its worst when you have almost escaped its grasp. When your puking, pacing around the house, can’t control your body jerking at night and feel like all hope is lost. If your feeling that it’s your body trying to rid itself of what you have done. Go seven days!!! If you can’t find the gumption to make it seven days your probably fucked, but if you can then you will reach a point that you tell yourself I will\nNever put it in my body again. Seven days is not easy it’s fucking hell!! I’m not promoting other drug use but find some Xanax or drink but what ever you do don’t put Kratom back into your system. Days 1-4 are the hardest you will feel defeated, but your body is resilient it doesn’t want to die!! Even if you feel like you have destroyed it with your use. Ya and the kidney&#x2F;liver back pain you think is kidney or liver failure it goes away. You have over worked them and they are screaming for you to stop. I don’t care how you get there go seven days!!!<p>PS: Fuck the Kratom community there is no place for it. If your in need go see a doctor and take suboxone and let them taper you off. By the way it’s just as bad and harder to quit then Kratom.<p>Dig deep go seven days!! It will change your life or what you are calling life. With Kratom you have no life. It steals your soul.<p>It will get better but your going to have to pay the piper. In ways you would have never imagined. Once you escape never look back RUN FOR YOUR LIFE!!!<p>GOD bless you and your fight. It’s a real one.<p>-Rusty",
      "time": 1630544345,
      "title": "Kratom Witdrawal/ the Truth",
      "type": "story"
    },
    {
      "by": "madars",
      "descendants": 0,
      "id": 28387496,
      "score": 1,
      "time": 1630544321,
      "title": "Japan launches Digital Agency to push ahead with long-overdue reforms",
      "type": "story",
      "url": "https://www.japantimes.co.jp/news/2021/09/01/national/politics-diplomacy/digital-agency-launch-japan/"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 28387492,
      "score": 1,
      "time": 1630544307,
      "title": "Streamers are boycotting Twitch today to protest inaction on ‘Hate Raids’",
      "type": "story",
      "url": "https://techcrunch.com/2021/09/01/streamers-are-boycotting-twitch-today-to-protest-the-platforms-lack-of-action-on-hate-raids/"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 28387490,
      "score": 1,
      "time": 1630544303,
      "title": "Deterrence Dispensed – Print Freedom",
      "type": "story",
      "url": "https://www.deterrencedispensed.com/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 28387485,
      "score": 1,
      "time": 1630544258,
      "title": "New Tool Shows Geology Behind Kidney Stone Crystallization",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/new-tool-shows-geology-behind-kidney-stone-crystallization/"
    },
    {
      "by": "starkd",
      "descendants": 0,
      "id": 28387465,
      "score": 1,
      "time": 1630544064,
      "title": "Old and photos of Bedouin nomads, 1898",
      "type": "story",
      "url": "https://rarehistoricalphotos.com/old-spectacular-photos-of-bedouin-nomads-1898/"
    },
    {
      "by": "furcyd",
      "descendants": 0,
      "id": 28387432,
      "score": 1,
      "time": 1630543768,
      "title": "Carolyn Shoemaker, Hunter of Comets and Asteroids, Dies at 92",
      "type": "story",
      "url": "https://www.nytimes.com/2021/09/01/science/space/carolyn-shoemaker-dead.html"
    },
    {
      "by": "f154hfds",
      "descendants": 0,
      "id": 28387431,
      "score": 1,
      "time": 1630543761,
      "title": "Cosmic Rays: The Universe Is Hostile to Computers (Veritasium)",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=AaZ_RSt0KP8"
    },
    {
      "by": "axiomdata316",
      "descendants": 0,
      "id": 28387430,
      "score": 1,
      "time": 1630543761,
      "title": "Microsoft / wslg:Support for Wayland and X server related scenarios",
      "type": "story",
      "url": "https://github.com/microsoft/wslg"
    }
  ]
}