{
  "stories": [
    {
      "by": "ericd",
      "descendants": 0,
      "id": 31576447,
      "score": 1,
      "time": 1654041998,
      "title": "48V Offgrid Solar Power System",
      "type": "story",
      "url": "https://www.mobile-solarpower.com/48v-complete-system-blueprint.html"
    },
    {
      "by": "p1esk",
      "descendants": 0,
      "id": 31576445,
      "score": 1,
      "time": 1654041985,
      "title": "Multi-Agent Reinforcement Learning Is a Sequence Modeling Problem",
      "type": "story",
      "url": "https://arxiv.org/abs/2205.14953"
    },
    {
      "by": "OrvalWintermute",
      "descendants": 0,
      "id": 31576401,
      "score": 1,
      "time": 1654041653,
      "title": "Rape Allegations Against Russian Troops in Ukraine Were Fake",
      "type": "story",
      "url": "https://www.moonofalabama.org/"
    },
    {
      "by": "1vuio0pswjnm7",
      "descendants": 0,
      "id": 31576399,
      "score": 1,
      "time": 1654041632,
      "title": "A. Bedoya “Tech” Industry Critic Confirmed as FTC Commissioner (May 12, 2022)",
      "type": "story",
      "url": "https://www.consumerfinancemonitor.com/2022/05/12/alvaro-bedoya-confirmed-as-ftc-commissioner/"
    },
    {
      "by": "ddtaylor",
      "descendants": 0,
      "id": 31576397,
      "score": 1,
      "time": 1654041624,
      "title": "Big Tech Using an Army of Lobbyists to Defang Privacy Laws, Claims New Report",
      "type": "story",
      "url": "https://www.toolbox.com/it-security/data-governance/news/big-tech-state-privacy-laws/"
    },
    {
      "by": "unknownaccount",
      "descendants": 0,
      "id": 31576353,
      "score": 2,
      "text": "A recent post that has grained traction this afternoon is about a user who’s account was wrongfully terminated by Cloudflare due to  false positives, and his inability to get in touch with support through normal channels. As per usual, the Cloudflare PR spin doctors(who monitor HN for any mention of the company name using a script) quickly turned up in the thread and had the users account restored before they got too much bad press for their mistake.<p>However, the worst part of this fiasco, was that this thread shed light on a far more terrifying issue regarding CloudFlare. The problem is that allegedly when they terminate your account you are unable to transfer-out your domain names. Allegedly, and perhaps far more insidiously, CloudFlare sets them to “pendingdelete” status. Meaning not only can you not transfer out your domain to another registrar, but the domain will expire after a short period of time and can therefore be sniped by an unscrupulous third party.<p>This post is a warning to the community: DO NOT transfer any domain name to CloudFlare that is valuable or important to you. Because at any time, your account can be terminated for no reason (“false positives”) and you will not be able to transfer your domain to another registrar. You will probably be unable to get them to reinstate your account so that you can transfer-out your domain through the normal support channels because they totally stonewall you(&quot;The suspension is permanent and we will not be making changes on our end.&quot;). You would either need take them to court to get your domain name(but by then your domain may already be permanently deleted&#x2F;expired or sniped by a 3rd party) -OR- make a big stink on HN in order to summon someone with actual authority in the company who can remedy the situation.<p>Relevant thread: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=31573854",
      "time": 1654041203,
      "title": "Tell HN: Cloudflare prevents transfer-out of domains, sets to 'pendingdelete'",
      "type": "story"
    },
    {
      "by": "papajams",
      "descendants": 0,
      "id": 31576350,
      "score": 1,
      "time": 1654041195,
      "title": "Does Dunbar's Number Still Compute?",
      "type": "story",
      "url": "https://songcamp.mirror.xyz/NQsYzaHBbEmVymKPl-N3Mo9yupycYC9aOvnbEcwLqg4"
    },
    {
      "by": "ohjeez",
      "descendants": 0,
      "id": 31576345,
      "score": 1,
      "time": 1654041130,
      "title": "'Ebola is defeated,' says Congolese professor who discovered the virus",
      "type": "story",
      "url": "https://www.france24.com/en/africa/20210917-ebola-is-defeated-says-congolese-professor-who-discovered-the-virus"
    },
    {
      "by": "mcargian",
      "descendants": 0,
      "id": 31576318,
      "score": 3,
      "time": 1654040938,
      "title": "Why Are American Potato Chips So Boring?",
      "type": "story",
      "url": "https://www.eater.com/23053238/potato-chip-flavors-america-international"
    },
    {
      "by": "RadixDLT",
      "descendants": 0,
      "id": 31576301,
      "score": 1,
      "time": 1654040765,
      "title": "Tension Inside Google over a Fired AI Researcher’s Conduct",
      "type": "story",
      "url": "https://www.wired.com/story/google-brain-ai-researcher-fired-tension/"
    }
  ]
}