{
  "stories": [
    {
      "by": "KronisLV",
      "descendants": 0,
      "id": 28401885,
      "score": 1,
      "text": "Back in the old days of SOAP being commonplace, it was pretty usual to run into services exposing descriptions of what functionality they provide in the form of WSDL (Web Service Definition Language) files: https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;wsdl.html<p>Even though SOAP itself was oftentimes unwieldy to work with, i&#x27;ve always found the fact that every API has a clear definition that can be fed into a tool of some sort to either generate client code in my language of choice, or to allow programmatically testing it to be a wonderful time saver.<p>For example, tools like SoapUI can import WSDL and allow you to be up and running with an external service in a matter of minutes, making testing and discovering such services really easy: https:&#x2F;&#x2F;www.soapui.org&#x2F;docs&#x2F;soap-and-wsdl&#x2F;<p>Now, when it comes to REST, it feels like for a while there was nothing like that, at least before Swagger became popular. In my eyes, it essentially attempted to do the same, but with JSON&#x2F;YAML definitions. Eventually we ended up with OpenAPI: https:&#x2F;&#x2F;spec.openapis.org&#x2F;oas&#x2F;latest.html<p>However, at the same time, it feels like the people behind Swagger and OpenAPI tried reinventing the wheel, since WADL already existed (published in 2009 vs Swagger 1.0 in 2011) and seemed to be the equivalent to WSDL: https:&#x2F;&#x2F;www.w3.org&#x2F;Submission&#x2F;wadl&#x2F;<p>So here&#x27;s my question: why didn&#x27;t WADL become popular and why is OpenAPI more popular instead?<p>To gauge OpenAPIs popularity, just look at: https:&#x2F;&#x2F;openapi.tools&#x2F;<p>WADL has nothing of the sort. Why?<p>As a counterpoint, some people might claim that REST in of itself is enough and that neither WADL, nor OpenAPI are strictly necessary: https:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;1312087&#x2F;what-is-the-reason-for-using-wadl<p>With that, however, i disagree. When i develop a web API or integrate with an existing one, i want the tooling to do a lot of the work for me - to pull the service definitions from the source, generate all of the code that i need to interface with it and also alert me of any breaking changes, should these auto generated pieces of code no longer fit with the rest of my solution after an update (say, a method has been removed&#x2F;deprecated). Feel free to share your views on this as well!",
      "time": 1630659345,
      "title": "Ask HN: Why did OpenAPI become more popular than WADL?",
      "type": "story"
    },
    null,
    {
      "by": "nandaja",
      "descendants": 0,
      "id": 28401835,
      "score": 1,
      "time": 1630658788,
      "title": "Onfim",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Onfim"
    },
    {
      "by": "hnarn",
      "descendants": 3,
      "id": 28401819,
      "kids": [
        28401826
      ],
      "score": 1,
      "time": 1630658649,
      "title": "Europe’s invisible divides: How Covid-19 is polarising European politics",
      "type": "story",
      "url": "https://ecfr.eu/publication/europes-invisible-divides-how-covid-19-is-polarising-european-politics/"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 28401812,
      "score": 1,
      "time": 1630658621,
      "title": "Authors are turning down lucrative deals in favour of Substack",
      "type": "story",
      "url": "https://www.theguardian.com/books/2021/sep/03/authors-lucrative-deals-substack-salman-rushdie-dc-marvel"
    },
    {
      "by": "doppioandante",
      "descendants": 0,
      "id": 28401810,
      "score": 1,
      "time": 1630658606,
      "title": "“AI” Demystified: A Decompiler",
      "type": "story",
      "url": "https://github.com/Shamar/ANN-decompiler"
    },
    {
      "by": "azalemeth",
      "descendants": 0,
      "id": 28401796,
      "score": 1,
      "time": 1630658465,
      "title": "Ben Collins answers: “Where did this ivermectin obsession come from?”",
      "type": "story",
      "url": "https://threadreaderapp.com/thread/1431040456364810242.html"
    },
    {
      "by": "Sebastian_09",
      "descendants": 0,
      "id": 28401750,
      "score": 1,
      "time": 1630657942,
      "title": "Damien Hirst melds art and NFT to mess with blockchain investors",
      "type": "story",
      "url": "https://thenextweb.com/news/damien-hirst-art-nft-blockchain-investors-syndication"
    },
    {
      "by": "kjeetgill",
      "descendants": 0,
      "id": 28401747,
      "score": 1,
      "time": 1630657911,
      "title": "Read Philosophy Backwards",
      "type": "story",
      "url": "https://slatestarcodex.com/2013/04/11/read-history-of-philosophy-backwards/"
    },
    {
      "by": "thibaut_barrere",
      "descendants": 0,
      "id": 28401742,
      "score": 1,
      "time": 1630657852,
      "title": "De-risking custom technology projects (18F)",
      "type": "story",
      "url": "https://github.com/18F/technology-budgeting/blob/master/handbook.md"
    }
  ]
}