{
  "stories": [
    {
      "by": "miohtama",
      "descendants": 0,
      "id": 27880076,
      "score": 1,
      "time": 1626679703,
      "title": "Spoofing Windows Hello biometric authentication",
      "type": "story",
      "url": "https://arstechnica.com/information-technology/2021/07/hackers-got-past-windows-hello-by-tricking-a-webcam/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 27880072,
      "score": 1,
      "time": 1626679606,
      "title": "Experimental entanglement generation for quantum key distribution beyond 1 Gbps",
      "type": "story",
      "url": "https://arxiv.org/abs/2107.07756"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 27880069,
      "score": 1,
      "time": 1626679587,
      "title": "What we know about investigations into Pegasus, spyware targeting journalists",
      "type": "story",
      "url": "https://thenextweb.com/news/what-we-know-about-new-investigations-into-pegasus-the-spyware-targeting-journalists"
    },
    {
      "by": "gargs",
      "descendants": 0,
      "id": 27880068,
      "score": 3,
      "time": 1626679566,
      "title": "Aging White Matter Retains Plasticity That Can Be Induced by Aerobic Exercise",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S1053811921005814"
    },
    {
      "by": "peter_retief",
      "descendants": 0,
      "id": 27880060,
      "score": 2,
      "time": 1626679478,
      "title": "Just 7% of our DNA is unique to modern humans, study shows",
      "type": "story",
      "url": "https://phys.org/news/2021-07-dna-unique-modern-humans.html"
    },
    {
      "by": "teameat",
      "descendants": 0,
      "id": 27880043,
      "score": 1,
      "time": 1626679087,
      "title": "Pollsters: 'Impossible' to say why 2020 polls were wrong",
      "type": "story",
      "url": "https://www.politico.com/news/2021/07/18/pollsters-2020-polls-all-wrong-500050"
    },
    {
      "by": "panoramas4good",
      "descendants": 0,
      "id": 27880038,
      "score": 1,
      "time": 1626679034,
      "title": "The median age of planes in Skytrax 100 fleets is just 9 years",
      "type": "story",
      "url": "https://www.travelstatsman.com/05072021/its-likely-the-plane-youre-flying-on-is-newer-than-your-car/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27880018,
      "score": 1,
      "time": 1626678694,
      "title": "Thoughts on “The Theory and Craft of Digital Preservation”",
      "type": "story",
      "url": "http://ajroach42.com/thoughts-on-digital-preservation/"
    },
    {
      "by": "lokedhs",
      "descendants": 0,
      "id": 27880013,
      "score": 1,
      "time": 1626678594,
      "title": "Live-coding hello world in PDP-10 assembler",
      "type": "story",
      "url": "https://live.toobnix.org/videos/watch/b1d536a8-4159-4218-8bab-92fef3850b04"
    },
    {
      "by": "autotutor",
      "descendants": 0,
      "id": 27880011,
      "score": 1,
      "text": "Hi. My name is Mike. My son Tom and I set up our site www.autotutor.com.au as our attempt to provide an answer to the above question.<p>My view is that the answer lies in graded internet practice tests and exams with a feedback loop provided by available solutions. Teacher or mentor supervision is preferable but not essential. Active learning beats passive. Watching video lessons and reading books can be very time consuming and may not lead to much progress in the ability to solve actual problems. On the other hand, attempting or succeeding to solve appropriate problems leads to quick learning through the mental exertion involved. Learning involves effort.<p>Learning maths is like learning to ride a bike. Videos and books are all very well but at some stage you need to actually get on the bike. Also, many students fail to get into tertiary education because they do not pass the required exams, or they do get to university but then spend the first year or more trying to catch up on secondary school maths. I think the best place to learn secondary school maths is at secondary school. Six or so years at high school is plenty of time to learn what is needed.<p>At our site we provide skills tests and practice exams for a wide range of year 7 to 12 (English language) maths and physics exams worldwide and have received rewarding feedback from many students. The majority of the thousands of students using our site so far have come from India, The Philippines and Bangladesh. We have over 5k questions in our database but this appears to be over 50k questions because of the mapping system we have developed. The system works on PCs, tablets and mobile phones.<p>We provide full free skills and quiz access to students. Teachers and schools need to pay. In my view a student who uses our system to gradually build their skills should do well in any high school maths or physics exam they choose.<p>The main problem we have relates to marketing. We find online paid marketing expensive and a large expenditure on this is not at present justified.<p>Any comments on the above would be appreciated.",
      "time": 1626678578,
      "title": "How can a student with limited resources excel at high school maths and physics?",
      "type": "story"
    }
  ]
}