{
  "stories": [
    {
      "by": "jseliger",
      "descendants": 0,
      "id": 30228327,
      "score": 1,
      "time": 1644110934,
      "title": "How Japan Saved Tokyo's Rail Network from Collapse (Part 1, 1945-1982)",
      "type": "story",
      "url": "https://seungylee14.substack.com/p/how-japan-saved-tokyos-rail-network"
    },
    {
      "by": "har1s",
      "descendants": 0,
      "id": 30228325,
      "score": 1,
      "time": 1644110879,
      "title": "Show HN: Create-rust-app: now supports poem-web back end",
      "type": "story",
      "url": "https://github.com/Wulf/create-rust-app"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30228279,
      "score": 1,
      "time": 1644110395,
      "title": "Will Trump’s mishandling of records leave a hole in history? (2021)",
      "type": "story",
      "url": "https://www.pbs.org/newshour/politics/will-trumps-mishandling-of-records-leave-a-hole-in-history"
    },
    {
      "by": "neuro_image2",
      "descendants": 0,
      "id": 30228264,
      "score": 1,
      "time": 1644110233,
      "title": "List of Brands and Products Confirmed to Be Made in the USA, Canada or Europe",
      "type": "story",
      "url": "https://chinanever.com"
    },
    {
      "by": "zenkat",
      "descendants": 1,
      "id": 30228261,
      "kids": [
        30228337
      ],
      "score": 1,
      "text": "What are the best books you&#x27;ve read on how to manage software complexity, both from an architectural as well as organizational perspective?",
      "time": 1644110207,
      "title": "Ask HN: Best books on managing software complexity?",
      "type": "story"
    },
    {
      "by": "ImprovedSilence",
      "descendants": 0,
      "id": 30228249,
      "score": 1,
      "time": 1644110139,
      "title": "What a perfect word le guessing strategy teaches us about English",
      "type": "story",
      "url": "https://slate.com/technology/2022/02/perfect-wordle-guessing-strategy.html"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30228235,
      "score": 1,
      "time": 1644109984,
      "title": "A collection of things I have made to make the Unifi Dream Machine more useful",
      "type": "story",
      "url": "https://github.com/boostchicken-dev/udm-utilities"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30228178,
      "score": 2,
      "time": 1644109463,
      "title": "Understanding the Global Chip Shortages",
      "type": "story",
      "url": "https://www.stiftung-nv.de/en/publication/understanding-global-chip-shortages"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30228171,
      "score": 1,
      "time": 1644109435,
      "title": "Lime is a leading player behind initiatives to democratise wireless innovation",
      "type": "story",
      "url": "https://limemicro.com/initiatives/"
    },
    {
      "by": "samstave",
      "descendants": 1,
      "id": 30228166,
      "kids": [
        30228299
      ],
      "score": 2,
      "text": "The current ep. of JRE is #1772 Randall Carlson.<p>I found it fantastic, and I think HN would be interested in it.. but I came to a theory I want to post, based on listening to every podcast this guy has been on.<p>I personally love to look at mountains and thing about how they were formed.<p>---<p>I think that water was on earth a lot earlier than has bee postulated.<p>I think the earth formed very smoothly and the source of water hit the planet (comet?) - but created a very thick ice shell around the water - and as the planet solidified and vulcanified the ice liquified and caused huge interactions with the landscape, on the scales that Carlson talks about -- and it seems that as the earths core heated, a very large meteor swam hit the earth (as well as the moon) and the many impacts caused volcanism plus exploding and melting the ice, and forming the major mountains and then the alluvial erosion..<p>Carlson estimates this type of event happened 3 times. But I think it happened earlier, MANY MANY Billions earlier - as these 3 huge cataclysms would have not allowed for the evolution of species, only disruption of species. - due to the fact the evolutionary track it obv billions of years, which required lots of water.<p>I believe the major impacts occurred billions ago, and the impacts helped crack-the-egg and create the tectonic plates.<p>TL;DR: Earth was a sphere that got impacted by tons of comets which created a shell of ice, then struck by asteroid swarms which created the oceans and panspermia asteroids (the asteroids that bring the elements that get pulverized into the constituants that when they spend billions of years in water with other elements - become life) planted some elements that allowed for life to kick-start.",
      "time": 1644109386,
      "title": "Ask HN: My theory on Earth age after listening to All Randall Carlson",
      "type": "story"
    }
  ]
}