{
  "stories": [
    {
      "by": "asasidh",
      "descendants": 0,
      "id": 31036542,
      "score": 1,
      "time": 1649995730,
      "title": "OM by Punk6529",
      "type": "story",
      "url": "https://twitter.com/punk6529/status/1514718020849000461"
    },
    {
      "by": "throwaway488933",
      "descendants": 0,
      "id": 31036540,
      "score": 1,
      "text": "Recently I was working with a colleague where we encountered a problem that required some troubleshooting. While trying different things we eventually reached an impasse, with multiple of the following:<p>A: &quot;I&#x27;m pretty sure this won&#x27;t work, I&#x27;ve tried it already. Here let me try it. See, it does&#x27;t work&quot;<p>B: &quot;Well, I was reading this article here and it said to try it this way. Maybe you&#x27;re missing something&quot;<p>-- Heated argument --<p>-- Apologies exchanged --<p>What are some methods&#x2F;strategies you&#x27;ve used to prevent the -- Heated argument -- phase before it happens?",
      "time": 1649995722,
      "title": "Ask HN: When both colleagues think the other is wrong, how to proceed?",
      "type": "story"
    },
    {
      "by": "mywaifuismeta",
      "descendants": 1,
      "id": 31036537,
      "kids": [
        31036547
      ],
      "score": 2,
      "text": "There has been a lot of talk around how Google search is becoming worse. Like many others, I am appending &quot;reddit&quot; to almost every search to get useful results instead of low-quality spam.<p>Over the last few years I feel the same has been happening to Amazon. There have always been FBA sellers that buy from Chinese suppliers and re-brand the same base product, result in tons of different-looking-but-actually-same products. But it has never been as bad as now. It&#x27;s has become nearly impossible to find quality products in all the spam, sponsored ads, fake reviews, and rebrandings.<p>I am now finding myself appending &quot;reddit&quot; to my Amazon searches as well because I don&#x27;t trust the results! Does anyone else do the same?",
      "time": 1649995681,
      "title": "Ask HN: What's Going on with Amazon Search?",
      "type": "story"
    },
    {
      "by": "ent101",
      "descendants": 0,
      "id": 31036519,
      "score": 1,
      "time": 1649995311,
      "title": "On Aug 21, 2018 Elon Musk Wrote",
      "type": "story",
      "url": "https://twitter.com/TechEmails/status/1514801677454381064"
    },
    {
      "by": "dajt",
      "descendants": 0,
      "id": 31036517,
      "score": 1,
      "time": 1649995291,
      "title": "Good Times with LMIC and an AdaFruit LoRaWAN Feather M0",
      "type": "story",
      "url": "http://oshed.blogspot.com/2022/04/goodtimes-with-lmic-and-adafruit.html"
    },
    {
      "by": "Diesel555",
      "descendants": 0,
      "id": 31036504,
      "score": 1,
      "text": "The problem is that the Touch Bar is not in my normal view when I&#x27;m inputting text or using applications where it is useful. So I never built the habit pattern of looking at the Touch Bar where it is most useful. It provides a lot of use, I just never noticed it.<p>Now I look at it a lot more and realize it&#x27;s useful if the application developers built it correctly. Unfortunately, Apple doesn&#x27;t promote how to use their software very well. It&#x27;s just supposed to work. But when a new innovation changes the way you look at your computer, where your eyes move to, you have to deliberately tell a seasoned user to look there, to change their workflow. I never looked at the Touch Bar and I hated not having function keys. But now that I do use it a lot, I&#x27;m going to miss it I think, especially the volume and brightness controls. Long story short, Apple failed to properly change user&#x27;s habit patterns by just hoping the change would work naturally, it doesn&#x27;t.<p>All that said, I know the Touch Bar is a contentious subject, and people are going to post how much they hate it. But I really hope they think about how much they actually look at it for most applications. I will state that for VSCode I&#x27;d rather have function keys.",
      "time": 1649995030,
      "title": "I like the Touch Bar. Apple failed to realize people don't look at it",
      "type": "story"
    },
    {
      "by": "potiuper",
      "descendants": 0,
      "id": 31036501,
      "score": 2,
      "time": 1649995008,
      "title": "Hegel's Philosophy Sunburst Map",
      "type": "story",
      "url": "https://observablehq.com/@mikaelau/complete-system-of-philosophy"
    },
    {
      "by": "ChadNauseam",
      "descendants": 0,
      "id": 31036500,
      "score": 1,
      "text": "It&#x27;s one of my all time favorite posts, but somehow I can&#x27;t find it. My memory is hazy but if I had to paraphrase I&#x27;m pretty sure it started off something like this:<p>Every time I see a game with a changelog like this, I cringe:<p><pre><code>    Peasants who become queens no longer continue to beg for bread\n    Horses no longer stay frozen after entering and exiting the pause menu\n    NPCs no longer attempt to open doors that have been removed\n    Fixed bug where NPCs were unable to see in dark rooms even after lighting a candle.\n</code></pre>\nWhat&#x27;s happening here is that the game has a huge state, and different parts of the state are being modified all over the place. This means that when extending the state in part A, you need to understand the entire codebase to know every state update that now needs to be changed. What you need to do is centralize all the code that modifies the state into one giant function, and this function should takes an enum describing the thing that triggered the change and modify the state accordingly.<p>... I think it went something like that, anyway. Any help?",
      "time": 1649994995,
      "title": "Ask HN: I'm looking for a specific blog post about game programming, any help?",
      "type": "story"
    },
    {
      "by": "mrintellectual",
      "descendants": 0,
      "id": 31036498,
      "score": 1,
      "time": 1649994977,
      "title": "TSMC Expects $44B in Capex Despite Slowdown Concerns",
      "type": "story",
      "url": "https://www.eetimes.com/tsmc-expects-44-billion-in-capex-despite-slowdown-concerns/"
    },
    {
      "by": "exdsq",
      "descendants": 0,
      "id": 31036432,
      "score": 1,
      "time": 1649994119,
      "title": "Show HN: AI Written Stories/Poetry/Raps about Love",
      "type": "story",
      "url": "https://saucystories.substack.com/p/a-tale-as-old-as-russia"
    }
  ]
}