{
  "stories": [
    {
      "by": "gumby",
      "descendants": 0,
      "id": 31868838,
      "score": 1,
      "time": 1656102288,
      "title": "Americans Die of an Overdose Every Hour. We Know How to Prevent That",
      "type": "story",
      "url": "https://www.nytimes.com/2022/06/24/opinion/addiction-overdose-mental-health.html"
    },
    {
      "by": "amrrs",
      "descendants": 0,
      "id": 31868837,
      "score": 1,
      "text": "Both DALL-E from OpenAI and Github CoPilot work on the same philosophy. While one receives a massive praise online the other is being criticised that it&#x27;s working with copied code and just pastes copied code.<p>Why is this difference in opinion?",
      "time": 1656102285,
      "title": "Ask HN: Why do devs feel CoPilot has stolen code but DALL-E is praised for ART?",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31868818,
      "score": 1,
      "time": 1656102192,
      "title": "Roles of a CTO",
      "type": "story",
      "url": "https://oded.substack.com/p/the-7-roles-of-a-cto"
    },
    {
      "by": "sarimabbas",
      "descendants": 0,
      "id": 31868780,
      "score": 1,
      "time": 1656102015,
      "title": "Show HN: Coldbrew – A Web GUI for Homebrew Cask",
      "type": "story",
      "url": "https://coldbrew.doom.sh/"
    },
    {
      "by": "Jason_Protell",
      "descendants": 0,
      "id": 31868775,
      "score": 1,
      "time": 1656101995,
      "title": "Confidence in U.S. Supreme Court Sinks to Historic Low",
      "type": "story",
      "url": "https://news.gallup.com/poll/394103/confidence-supreme-court-sinks-historic-low.aspx"
    },
    {
      "by": "cs137",
      "descendants": 0,
      "id": 31868770,
      "score": 1,
      "text": "I&#x27;ve been a programmer for about 20 years. I&#x27;ve long since outgrown business programming, but I also didn&#x27;t like being a manager very much. As I wrap up a couple other projects, I&#x27;m pursuing a master&#x27;s degree. So far, I enjoy it a lot and I&#x27;m doing well. I think I&#x27;d like to continue for a PhD, and see what lies beyond that.<p>My problems are twofold. One is age. I don&#x27;t think I&#x27;m too old to get into a PhD program, but by the time I would complete one, I&#x27;ll be, best-case scenario, in my mid-40s. I don&#x27;t think should matter at all, because what matters is how many productive years a person has left--a highly variable unknown, with a median low enough that my age is a complete non-issue--but, of course, I don&#x27;t control perceptions. There is a possibility that getting a PhD will only make me more overqualified and unemployable than I already am.<p>The second issue is that I&#x27;m a politically exposed person. The less said about that, the better, but I&#x27;ve publicly associated myself with the antifascism (&quot;antifa&quot;) movement, and I have exposed some truly bad actors in the tech industry. I have no regrets about this, but it turned out those bad actors had friends. Whoops. I&#x27;m sure my real name would mean absolutely nothing to the younger crowd, but I&#x27;ve made enemies in high places (and suffered death threats, rescinded job offers, rumor campaigns, you name it). At one point, I got a warning from a federal agency not to go to San Francisco for a talk I was going to give, because it would put my life in danger. I will never be able to get a job (or, in an academic context, a grant) from any of the FAANGs. (I&#x27;m mostly okay with, because I dislike those companies). I have no small number of permanent enemies who will never forgive me.<p>At some point, it became clear that the decent jobs in the tech industry were no longer (and would never be) available to me. Political exposure cools off over time; however, the issue of age goes the other way. My fear is that, research being more competitive, this political exposure might be a permanent blocker, or at least an issue for long enough that it would, say, complicate a job search five years from now in a competitive field.<p>Does anyone familiar with computer science research (inside or outside of academia) have enough experience to have an informed opinion on this? I have worked in (mostly private-sector) research before, so I know what I&#x27;m getting into in terms of the work itself. What I don&#x27;t know is whether age and political exposure, given the hypercompetitive nature of the research job market, are insurmountable obstacles. I may have to change countries, which is of course another thing I am looking into.<p>Thanks in advance for your help.",
      "time": 1656101964,
      "title": "Ask HN: Can a politically exposed person in middle age become a CS researcher?",
      "type": "story"
    },
    {
      "by": "cratermoon",
      "descendants": 0,
      "id": 31868633,
      "score": 1,
      "time": 1656101424,
      "title": "Netflix lays off several hundred more employees",
      "type": "story",
      "url": "https://www.npr.org/2022/06/24/1107360500/netflix-lays-off-several-hundred-more-employees"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31868605,
      "score": 1,
      "time": 1656101290,
      "title": "Twitter closed captions button now available to all in iOS and Android apps",
      "type": "story",
      "url": "https://9to5mac.com/2022/06/24/twitter-closed-captions/"
    },
    {
      "by": "thinkingemote",
      "descendants": 2,
      "id": 31868582,
      "kids": [
        31868689
      ],
      "score": 1,
      "time": 1656101160,
      "title": "Why the West still needs the Bible",
      "type": "story",
      "url": "https://www.spectator.co.uk/article/why-the-bible-still-matters"
    },
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 31868518,
      "score": 1,
      "time": 1656100815,
      "title": "Why Everyone Wants Arm",
      "type": "story",
      "url": "https://www.economist.com/business/2022/06/22/why-everyone-wants-arm"
    }
  ]
}