{
  "stories": [
    {
      "by": "raymondtusk",
      "descendants": 0,
      "id": 29601666,
      "score": 1,
      "time": 1639801836,
      "title": "Cantonese Is Far from Dead",
      "type": "story",
      "url": "https://www.scmp.com/lifestyle/article/3159953/cantonese-far-dead-it-lags-mandarin-chinese-language-league-table-numbers"
    },
    {
      "by": "wyrm",
      "descendants": 0,
      "id": 29601649,
      "score": 1,
      "time": 1639801645,
      "title": "The Second Worst CAD Package Ever",
      "type": "story",
      "url": "https://hackaday.com/2021/12/17/the-second-worst-cad-package-ever/"
    },
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 29601630,
      "kids": [
        29601631
      ],
      "score": 1,
      "time": 1639801477,
      "title": "The People’s Ledger: How to Democratize Money and Finance the Economy",
      "type": "story",
      "url": "https://vanderbiltlawreview.org/lawreview/2021/10/the-peoples-ledger-how-to-democratize-money-and-finance-the-economy/"
    },
    {
      "by": "xhfloz",
      "descendants": 0,
      "id": 29601575,
      "score": 1,
      "time": 1639800818,
      "title": "The War to Sell You a Mattress Is an Internet Nightmare (2017)",
      "type": "story",
      "url": "https://www.fastcompany.com/3065928/sleepopolis-casper-bloggers-lawsuits-underside-of-the-mattress-wars"
    },
    {
      "by": "shankarro",
      "descendants": 1,
      "id": 29601573,
      "kids": [
        29601690
      ],
      "score": 4,
      "time": 1639800804,
      "title": "Is internet addiction eradicating the habit of reading?",
      "type": "story",
      "url": "https://benwajdi.com/2021/12/18/is-internet-addiction-eradicating-the-habit-of-reading/"
    },
    {
      "by": "calderarrow",
      "descendants": 2,
      "id": 29601544,
      "kids": [
        29601605,
        29601576
      ],
      "score": 2,
      "text": "I was considering this question with some friends the other day, and while we agreed about a number of problems with an increasingly ad-driven web, we weren’t sure an ad-free web would be perfect either. What do you think?",
      "time": 1639800550,
      "title": "Ask HN: Would an ad-free internet be better?",
      "type": "story"
    },
    {
      "by": "ScouterRich",
      "descendants": 0,
      "id": 29601535,
      "score": 4,
      "time": 1639800387,
      "title": "In Search of Concentration Camps in Xinjiang",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=cI8bJO-to8I"
    },
    {
      "by": "wbespace",
      "descendants": 0,
      "id": 29601527,
      "score": 1,
      "text": "A virtual coworking space for entrepreneurs is a place where indie makers from all over the world can work together on their projects while supporting each other and feeling like part of a team.<p>I have been growing the WBE space (wannabe-entrepreneur.com) for the past 5 months to a community that has 40 members now and here is the setup that best works for us:<p>Slack Channel:\nThis channel is the center of communication and the place where most of the indie makers hang out.  I have tried out multiple channels but here are the ones that have the most engagement:<p>- what-i-am-doing-today: Every day members write down their daily goals and support each other with encouraging words or relevant tips. I am quite surprised with the fact that people not only share their business-related tasks but also more personal ones... Really cool!<p>- victories-and-frustrations: We celebrate each other victories and give support when needed. This channel is not used on a daily basis by every member but it&#x27;s still very popular<p>- introductions: This is a classic but a must for every community. I set up an automatic message that asks every new member to introduce themselves in the channel. It works as an ice breaker for the noobie and the members are very welcoming.<p>We have a couple of other popular channels like the looking-for-advice, feedback, and today-I-learned which are used multiple times a week.<p>Virtual Office Rooms:\nUsing jitsi and the slack API I created two virtual rooms that are available 24&#x2F;7:<p>- Work Room: Entrepreneurs turn on the camera and work together in their individual tasks. Is like being in an office. I also implemented a shared Pomodoro timer, so normally we work for 30min, have a 5min chat, and restart<p>- Break Room: Just a place to chill and drink a coffee or beer and chat about our projects and life in general. Once a month we also do a community event that gathers most of the members.\nEntrepreneurs<p>Wiki<p>I put it together using netlify cms and it works great! Is a place where members can document their favorite tools together with how they use them. I also use it to document all the community-only discounts that I have been able to get from SaaS founders.<p>Pricing<p>A member pays 4 euros per month to be part of the space. To be honest I haven&#x27;t played much around the pricing but from what I gathered the members seem quite happy with it. One cool thing I noticed is that the paying members are much more active and engaged than the guests...<p>And here is what I have learned so far and how our setup looks like. If you have a community I would love to hear about your setup and let me know if you have any questions.<p>Cheers",
      "time": 1639800262,
      "title": "Our entrepreneur virtual coworking space setup",
      "type": "story"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 29601507,
      "score": 1,
      "time": 1639800053,
      "title": "A Seemingly Small Change Can Cause Impacts in a System",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=lp5typwY3Zg"
    },
    {
      "by": "fagnerbrack",
      "descendants": 0,
      "id": 29601500,
      "score": 1,
      "time": 1639799998,
      "title": "I Love Great Britain",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=KZ-ArH19Kvs"
    }
  ]
}