{
  "stories": [
    {
      "by": "mpweiher",
      "descendants": 0,
      "id": 31189707,
      "score": 1,
      "time": 1651131121,
      "title": "Breakingviews: Elon Musk probably won’t buy Twitter",
      "type": "story",
      "url": "https://www.reuters.com/breakingviews/elon-musk-probably-wont-buy-twitter-2022-04-27/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31189689,
      "score": 2,
      "time": 1651130965,
      "title": "How to live longer – a programmer's guide",
      "type": "story",
      "url": "https://github.com/geekan/HowToLiveLonger"
    },
    {
      "by": "kbst",
      "descendants": 0,
      "id": 31189653,
      "score": 1,
      "text": "Hey HackerNews!  I&#x27;m really excited to introduce... Elon&#x27;s Shenanigans, the first-ever no-code metaverse NFT web3 app. Now available on your all devices here: https:&#x2F;&#x2F;install.page&#x2F;elonmusk<p><i>What does it do?</i><p>Elon&#x27;s Shenanigans is a real functional app you can install on your Homescreen&#x2F;Desktop&#x2F;Dock to get quick access to Elon Musk&#x27;s Twitter feed. You can install it on iOS, Android, Windows, macOS, and Chrome OS from the universal installation link above.<p><i>The problem we&#x27;re solving</i><p>None, really. But Elon Musk&#x27;s Tweet feed is so entertaining in and of itself that we reckoned it deserved its own app.<p><i>How much does it cost?</i>\nIt&#x27;s completely FREE, forever and ever, until the end of time! We want to focus on user growth right now and think about monetization later.<p>Our future plans include collecting as much data on you as possible and a $499&#x2F;month subscription for dark mode.<p><i>What&#x27;s the market for this?</i><p>Elon Musk has 80 million followers. We calculated we can acquire 10% of them. If half of those users need dark mode, that&#x27;s $328 billion ARR. Humongous TAM, SAM, SOM, TOM, and MOM.<p><i>Who are our competitors?</i><p>We don&#x27;t have any. But it wouldn&#x27;t really matter anyway since we have 5 pending patents.<p><i>What&#x27;s our ask?</i><p>We&#x27;re looking to raise a $50 million Pre-Seed. If interested, fill out the Google Form on our website and I&#x27;ll get back to you with my Calendly link whenever I have time (you&#x27;ll have to sign an NDA before the call).<p><i>Who is on the team?</i><p>I&#x27;m a Former Facebook CEO, Forbes 70 Under 70 Awardee, Two-Time Nobel Prize Runner-Up, Olympic Squash Bronze Medalist. Also an Internet Evangelist and Uppercase-Letter Enthusiast.<p>My 6-year-old daughter is in charge of design. You can see a sample of her work on my personal page (she did the graphic design, I wrote the code): https:&#x2F;&#x2F;kevin.tw<p>Thank you for your support, HackerNews, and see you all at the IPO ceremony!<p>PS: Use coupon code HACKERNEWS at checkout to get $5 credit right now + 3% off every other month for the first 4 months",
      "time": 1651130543,
      "title": "Show HN: Elon's Shenanigans – now on your Homescreen",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31189643,
      "score": 1,
      "time": 1651130453,
      "title": "Did We(B Development) Lose the Right Direction?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=3PmPkZJ22Cc"
    },
    {
      "by": "nabi_nafio",
      "descendants": 0,
      "id": 31189633,
      "score": 1,
      "time": 1651130398,
      "title": "The Process",
      "type": "story",
      "url": "https://www.ycombinator.com/assets/ycdc/gallery/15-c925e4232a5967e0b267323079054871bbc5800b6da4eab6850783af308d22fc.jpg"
    },
    {
      "by": "qiuyesuifeng",
      "descendants": 1,
      "id": 31189615,
      "kids": [
        31189616
      ],
      "score": 1,
      "time": 1651130227,
      "title": "Multi-DBMS SQL Benchmarking Framework via JDBC",
      "type": "story",
      "url": "https://github.com/cmu-db/benchbase"
    },
    {
      "by": "rajnathani",
      "descendants": 0,
      "id": 31189604,
      "score": 1,
      "time": 1651130072,
      "title": "PFAS Linked to Liver Damage",
      "type": "story",
      "url": "https://www.studyfinds.org/forever-chemicals-liver-damage/"
    },
    {
      "by": "weatherlite",
      "descendants": 0,
      "id": 31189600,
      "score": 1,
      "text": "As someone who owns a bit of Facebook stock (please don&#x27;t shoot me!) I am interested in the company&#x27;s future prospects.\nAs we all know Facebook&#x27;s main income comes from advertisers, and much of the information Facebook gathers on users comes from the infamous &quot;Facebook Pixel&quot; - a tiny iframe that websites around the internet plant that reports to Facebook (along with our data) whenever the page loads.\nThis has worked wonderfully (for Facebook) until Apple recently started blocking 3rd party cookies on iphones.\nGoogle has announced plans of doing the same on Chrome yet so far it&#x27;s been delayed.\nThis has caused a serious drop in Facebook&#x27;s share. While the IOS hit is big, Chrome doing the same can be disastrous as it has a huge market share.<p>Yet I ask - how hard is it for Facebook to gain this data (or similar?) with other means?. They already have a Conversion API - basically it&#x27;s like a Facebook Pixel for the backend. So every shop&#x2F;website that wants to use Facebook ads simply integrates this onto their backend (Afaik there are ready made integrations for Shopify shops etc, probably Wix&#x2F;Squarespace&#x2F;GoDaddy will have pre made integrations). Any serious advertiser that owns his own website infrastructure probably has someone technical enough to throw a few lines of code onto their server. Facebook can build integrations to the main web frameworks for example.<p>So in short - my theory is everything will be reported from the backend. The people who can&#x27;t make the integration due to lack of technical knowledge are probably not big ad spenders anyway. As an investor it makes me think the market is being irrational or simply not understanding the underlying tech and how Facebook can navigate its way well enough.<p>What&#x27;s your take?",
      "time": 1651129990,
      "title": "Ask HN: Facebook's Future and 3rd Party Cookies",
      "type": "story"
    },
    {
      "by": "_aavaa_",
      "descendants": 0,
      "id": 31189579,
      "score": 1,
      "time": 1651129712,
      "title": "A World Ordered Only by Search (2021)",
      "type": "story",
      "url": "https://theconvivialsociety.substack.com/p/a-world-ordered-only-by-search"
    },
    {
      "by": "marban",
      "descendants": 0,
      "id": 31189578,
      "score": 1,
      "time": 1651129692,
      "title": "The “Dark Yellow Problem” in Design System Color Palettes",
      "type": "story",
      "url": "https://medium.com/@lodestar-design/the-dark-yellow-problem-in-design-system-color-palettes-a0db1eedc99d"
    }
  ]
}