{
  "stories": [
    {
      "by": "fauria",
      "descendants": 0,
      "id": 30972089,
      "score": 1,
      "time": 1649538600,
      "title": "Congress keeps 231-year-old promise to honor hero (2014)",
      "type": "story",
      "url": "https://www.usatoday.com/story/news/world/2014/12/09/congress-honors-wishes-of-continental-congress-with-galvez-portrait/20149797/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30972078,
      "score": 1,
      "time": 1649538548,
      "title": "DMCA Notices Took Down 19,276 GitHub Projects Last Year",
      "type": "story",
      "url": "https://torrentfreak.com/dmca-notices-took-down-19276-github-projects-last-year-220408/"
    },
    {
      "by": "xojoc",
      "descendants": 0,
      "id": 30972073,
      "score": 1,
      "time": 1649538517,
      "title": "Quaise Energy – Unlocking the true power of clean geothermal energy",
      "type": "story",
      "url": "https://www.quaise.energy"
    },
    {
      "by": "ajafari",
      "descendants": 1,
      "id": 30972018,
      "kids": [
        30972019
      ],
      "score": 3,
      "time": 1649538073,
      "title": "AP Computer Science Done Right",
      "type": "story",
      "url": "https://www.amazon.com/AP-Computer-Science-Done-Right/dp/B09TY9ZYMV"
    },
    {
      "by": "genmaicha123",
      "descendants": 0,
      "id": 30972009,
      "score": 1,
      "text": " I&#x27;d like to hear some ideas on how to get myself unstuck.\nBefore I get into it, I want to recognize how privileged this whole story is, and that myself 15y ago would laugh at how much this reeks of 1st world problems.<p>I&#x27;m having a hard time deciding what to do, both personally and professionally.<p>Personally, I&#x27;m conflicted about lifestyles I want to obtain. One day I&#x27;m ambitious and want to devote my life to building generational wealth, only to dream of a humble house and spending my time cooking simple meals. It&#x27;s not that I think I wouldn&#x27;t find some happiness in any of those possibilities – what bothers me is that I cannot completely decide where on that spectrum I&#x27;d like to aim for. A good example of this is the question of living in the US (on H1b&#x2F;L1) vs. Europe, where I bounce between the two on a weekly basis, making it hard to either move or come to peace with where I am and move on.<p>Professionally it&#x27;s a similar story.\nI started coding in middle-school, and acquired generalist skills by working on many things throughout high school &#x2F; college. I was and still am ambitious, albeit I lately started understanding it&#x27;s a double-edged sword in a way.<p>Now I&#x27;m in late-twenties, came to FAANG straight from school, working on distributed systems at scale. My job is good, I get enough opportunities, get recognized very often, and there&#x27;s room for me to grow. The shipping velocity and lack of accountability is not great but I don&#x27;t think I can impact the culture enough for a meaningful change. Organizational overhead is frequently a mess and building trust with an ever-changing list of line managers and TLs takes away too much energy. Looking around, there aren&#x27;t too many people I like or am excited about working with, but that tends to change often. \nI used to think there were times where all I wanted to do was clear – learn more about databases, or build distributed systems, or coach and mentor peers, or get more money, or build effective teams, or start a self-bootstrapped side business to squeeze more money out of my skills, etc. I used to be more excited about tech as well, now it all seems less meaningful.<p>In the past year or so, I&#x27;ve struggled to define a meaningful &amp; fulfilling direction. My answer to &quot;what do you want to do?&quot; is rarely consistent for more than a few days in a row. I now realize I never really knew what I was after, and I was just lucky to be happy with whatever I had stumbled upon. Do I want to pursue being a depth IC, manager, founding engineer in startups, or even a founder myself? Hard to control scope in these decisions. Thinking this over day-to-day is a recipe for anxiety and endless analysis-paralysis.<p>Most of my life I have had to work hard to create opportunities for myself, and open as many doors as possible. I was lucky to open quite a few. I now understand that I need to deliberately close some of the doors to move forward, and it goes against what got me here, hence so much friction.<p>I&#x27;m looking for fresh perspectives on conceptualizing or thinking about situations like this. Frameworks that peers and mentors often provide assume that I know what I want to do, and are concerned more with how to do it.<p>How do I limit the scope of my decisions? How do I ensure I can backtrack in case of a bad decision? What is even a bad decision? How to find things (or thing) that I want to do and be sure to do it for longer than a week? How do I commit without looking back? How to think productively about dependencies between these decisions?<p>Curious to hear stories as well. Where were you stuck, and how did it play out?<p>Many thanks, HN.",
      "time": 1649538053,
      "title": "Ask HN: How to think about direction in life/career?",
      "type": "story"
    },
    {
      "by": "lostsoul8282",
      "descendants": 0,
      "id": 30972006,
      "score": 1,
      "text": "I’m working on a site(NextJS, FastAPI, Postgres is the stack). I’m facing a challenge where each user is asking for different reporting and we are shifting to doing more and more reports that are only slightly different.<p>I think it would be easier to just expose my API to some BI tool to let the users build their own dashboards(and perhaps share the main ones we made).<p>I realize this probably exists and have found a few(powerBI embedded, metabase, etc). I have no experience in this area so I’m interested in what you are using and your experience with it?",
      "time": 1649538037,
      "title": "Ask HN: What do you use as your embedded BI solution?",
      "type": "story"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 30971958,
      "score": 2,
      "time": 1649537695,
      "title": "New Technology, Old Problems: The Missing Voices in Natural Language Processing",
      "type": "story",
      "url": "https://thegradient.pub/nlp-new-old/"
    },
    {
      "by": "buttocks",
      "descendants": 1,
      "id": 30971950,
      "kids": [
        30971983
      ],
      "score": 4,
      "text": "The Great Resignation or the Great Reshuffling pretty much started in 2021 and is still going very strong today. It&#x27;s hard not to feel like you could be missing out if you don&#x27;t take the opportunity now to pursue a better job, especially one with better pay and work-from-home arrangements. That&#x27;s how I felt as my coworkers started moving on to better roles, and when the recruiters started hitting me on LinkedIn, I decided to pay attention. Now a month into my new job, I feel like a traitor and sell-out. I had a long tenure at my previous role and had life pretty easy. I can&#x27;t help but feel that the current wave of job changing is fueled by hype and greed, and honestly I do not think that companies deserve to be screwed by all this turnover. While I am confident I can do fine in my new role, I have a nagging disappointment about contributing to this current trend.",
      "time": 1649537640,
      "title": "Ask HN: Did you change jobs during the Great Reshuffling and regret it?",
      "type": "story"
    },
    {
      "by": "spywhere",
      "descendants": 0,
      "id": 30971946,
      "score": 2,
      "time": 1649537626,
      "title": "Show HN: tmux.nvim – turning Neovim into a terminal multiplexer",
      "type": "story",
      "url": "https://github.com/spywhere/tmux.nvim"
    },
    {
      "by": "davesailer",
      "descendants": 0,
      "id": 30971941,
      "score": 2,
      "time": 1649537590,
      "title": "Now scientists can manipulate dream content, advertisers want in (2021)",
      "type": "story",
      "url": "https://erikhoel.substack.com/p/now-that-scientists-can-manipulate"
    }
  ]
}