{
  "stories": [
    null,
    null,
    {
      "by": "durmonski",
      "descendants": 0,
      "id": 30173408,
      "score": 1,
      "time": 1643773428,
      "title": "The Two-Minute Rule to Stop Procrastinating",
      "type": "story",
      "url": "https://blog.doist.com/two-minute-rule/"
    },
    {
      "by": "jyundt",
      "descendants": 0,
      "id": 30173400,
      "score": 1,
      "text": "I was in a Central American country for a week in January. After returning to the US, Google products like Search and YouTube are flagging my IP address as from this Central American country. This is happening for every device in my home, across multiple Google Accounts regardless of owner&#x2F;account&#x2F;OS:<p>- Android (phones and an Nvidia Shield)<p>- iOS<p>- MacOS<p>- Linux<p>Unfortunately this is preventing my wife and I from accessing YouTube content that is geo-locked and we are getting search results in Spanish (plus a bunch of other unexpected behavior with Google services).<p>I&#x27;ve contacted YouTube Premium support and Google One support, neither could figure this out and suggested I &quot;ask the community&quot;.<p>My best guess: my US IP address was flagged as from this Central American county while I was abroad because I had to VPN back to this IP address while traveling. On mobile, if I disconnect from my wireless network and use 5G&#x2F;LTE, everything &quot;just works&quot;; I can access US YouTube content and search results are in English + the correct geo.<p>Based on the suggestion from Google support, I posted this information to the Community help site[0] hoping that someone will be able to help. Additionally I’ve used this Google form[1] to “Report IP Problems”, but this can supposedly take more than a month. Given how one way this form feels, my confidence with it is relatively low.<p>Has anyone ever encountered this before? Any suggestions? How can I get Google to mark my IP address as &quot;from the US&quot;? Unfortunately I feel like I’m in some weird Kafkaesque nightmare.<p>A few things to note: MaxMind &#x2F; GeoIP lookups have always correctly identified my IP address as &quot;from the US&quot;, this seems to be limited to just Google services. I have a static IP from my ISP and I would prefer to avoid getting a new IP from my ISP. I also don’t want to have some other unlucky customer get this cursed faux Central American IP address. However, if neither Google nor HN can figure this out, I’ll contact my ISP and request a new IP.<p>[0] https:&#x2F;&#x2F;support.google.com&#x2F;accounts&#x2F;thread&#x2F;148526373<p>[1] https:&#x2F;&#x2F;support.google.com&#x2F;websearch&#x2F;workflow&#x2F;9308722<p>edit: formatting",
      "time": 1643773326,
      "title": "Ask HN: How can I get Google to fix their reported geolocation of my IP address?",
      "type": "story"
    },
    {
      "by": "compiler-guy",
      "descendants": 0,
      "id": 30173379,
      "score": 2,
      "time": 1643773088,
      "title": "The Elves Leave Middle Earth – Sodas Are No Longer Free",
      "type": "story",
      "url": "https://steveblank.com/2009/12/21/the-elves-leave-middle-earth-%e2%80%93-soda%e2%80%99s-are-no-longer-free/"
    },
    {
      "by": "bpierre",
      "descendants": 0,
      "id": 30173375,
      "score": 1,
      "time": 1643773053,
      "title": "An introduction to type programming in TypeScript – zhenghao",
      "type": "story",
      "url": "https://www.zhenghao.io/posts/type-programming"
    },
    {
      "by": "conanxin",
      "descendants": 0,
      "id": 30173371,
      "score": 1,
      "time": 1643773047,
      "title": "Andy Warhol, Clay Christensen, and Vitalik Buterin Walk into a Bar",
      "type": "story",
      "url": "https://www.oreilly.com/radar/andy-warhol-clay-christensen-and-vitalik-buterin-walk-into-a-bar/"
    },
    {
      "by": "JeremyNT",
      "descendants": 0,
      "id": 30173368,
      "score": 1,
      "time": 1643773005,
      "title": "U.S. airline group warns 5G interference issues could linger for years",
      "type": "story",
      "url": "https://www.reuters.com/business/aerospace-defense/us-airline-group-warns-5g-interference-issues-could-linger-years-2022-02-01/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 30173366,
      "score": 1,
      "time": 1643772980,
      "title": "US threatens Russia with an unprecedented chip blockade",
      "type": "story",
      "url": "https://www.axios.com/chip-blockade-russia-sanctions-biden-314d7d9f-f1d7-4a72-b357-55d8756dc08d.html"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30173297,
      "score": 2,
      "time": 1643772339,
      "title": "India to impose 30% tax on crypto incomes and digital rupee",
      "type": "story",
      "url": "https://www.theregister.com/2022/02/02/india_budget_2022/"
    }
  ]
}