{
  "stories": [
    {
      "by": "eldridgea",
      "descendants": 0,
      "id": 31897940,
      "score": 1,
      "time": 1656351566,
      "title": "Sync Your LUKS Boot and User Passwords",
      "type": "story",
      "url": "https://blog.eldrid.ge/2022/06/22/synced-luks-boot-and-user-passwords/"
    },
    {
      "by": "infinite8s",
      "descendants": 0,
      "id": 31897908,
      "score": 1,
      "time": 1656351460,
      "title": "An Overview of the CAL Time-Sharing System [pdf]",
      "type": "story",
      "url": "https://www.microsoft.com/en-us/research/wp-content/uploads/2016/11/07-ReliableOS.pdf"
    },
    {
      "by": "dcposch",
      "descendants": 0,
      "id": 31897889,
      "score": 4,
      "time": 1656351372,
      "title": "Whist, a new cloud-hybrid browser",
      "type": "story",
      "url": "https://www.whist.com/"
    },
    {
      "by": "NithurM",
      "descendants": 0,
      "id": 31897881,
      "score": 1,
      "time": 1656351331,
      "title": "Show HN: I made a Chrome extension that explains code in plain English",
      "type": "story",
      "url": "https://codexplainer.co/"
    },
    {
      "by": "ohashi",
      "descendants": 0,
      "id": 31897878,
      "score": 2,
      "text": "I have (or had as it seems now) a spreadsheet in google docs tracking important business metrics. I was trying to look at it today and got the message:<p>&quot;We&#x27;re sorry. You can&#x27;t access this item because it is in violation of our Terms of Service. If you feel this is in error, please request a review. Find out more about this topic at the Google Drive Help Center.&quot;<p>If I click the request a review I get:<p>&quot;404. That&#x27;s an error. Sorry, this item cannot be found or is not available.&quot;<p>This spreadsheet simply had metrics and domains. I find it near impossible it was violating any terms of service unless there is a shadow blacklist of domain names which somehow trigger a file being removed. And I&#x27;m left with no recourse to even request a review or get my file back?<p>I turned on airplane mode on my phone and was able to get an old cached copy, export was only possible as a PDF. So at least I have a slightly stale version of raw data that way.<p>Even as a paying customer, this is pretty embarrassing and there seems no recourse is possible?",
      "time": 1656351318,
      "title": "Tell HN: Google deleted my spreadsheet, review request says file can't be found",
      "type": "story"
    },
    {
      "by": "mattevenson",
      "descendants": 0,
      "id": 31897862,
      "score": 1,
      "text": "We&#x27;re looking at APM tools and the default seems to be DataDog but frankly we&#x27;re experiencing a bit of sticker shock.",
      "time": 1656351230,
      "title": "Ask HN: How much should a startup expect to spend on DataDog?",
      "type": "story"
    },
    {
      "by": "l0b0",
      "descendants": 0,
      "id": 31897851,
      "score": 1,
      "text": "Camera manufacturers seem to be moving at speed from DSLRs to mirrorless. In case of Canon, that means a different lens mount. Since I&#x27;ll need to use an adapter for my current lenses anyway, it seems like a good time to re-evaluate brands. Some questions after using a Canon 7D:<p>- Is keeping my lenses and moving to a different brand of mirrorless a dumb idea in the first place?<p>- Can EF mount lenses be fully utilised with mirrorless cameras? That is, can I shoot pretty much the same pictures, or am I going to lose significant light&#x2F;zoom&#x2F;other?<p>- The raw image format is completely proprietary and only used by Canon. Are any of the other vendors better at making life easier for photo editing programs?<p>- The original firmware is not very flexible. For example, requiring an external device for continuous shooting seems crazy. Magic Lantern[1], as impressive as it is, seems to suck battery and the UI is less friendly than the original. And if I understand correctly Canon is making it harder, not easier, for third party firmware with newer models. Are there any particularly good brands for moddability (without having to be a firmware engineer myself)?<p>- The image quality is decent. Within similar price brackets it seems like most cameras are too similar to be a deal breaker. Is that a reasonable view?<p>- Light sensitivity is not great. I don&#x27;t like using flash, which means pretty much anything indoors needs to be fully open and slow. Do any brands&#x2F;cameras stand out in this category?<p>- It works decently as a webcam, except that it outputs a weird format which doesn&#x27;t include microphone audio. Is this still a problem with mirrorless cameras?<p>[1] https:&#x2F;&#x2F;magiclantern.fm&#x2F;",
      "time": 1656351194,
      "title": "DSLR to mirrorless migration – what to buy?",
      "type": "story"
    },
    {
      "by": "jahfer",
      "descendants": 0,
      "id": 31897848,
      "score": 1,
      "time": 1656351169,
      "title": "What does a healthy software development culture look like?",
      "type": "story",
      "url": "https://jahfer.com/posts/dev-culture/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 31897835,
      "score": 2,
      "time": 1656351100,
      "title": "Company behind Truth Social now under investigation by federal prosecutors",
      "type": "story",
      "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-truth-social-grand-jury-b2110300.html"
    },
    {
      "by": "troyastorino",
      "descendants": 0,
      "id": 31897809,
      "score": 4,
      "time": 1656350988,
      "title": "PicnicHealth (YC S14) raises $60m Series C to make medical data work better",
      "type": "story",
      "url": "https://picnichealth.com/blog/series-c"
    }
  ]
}