{
  "stories": [
    {
      "by": "skmurphy",
      "descendants": 0,
      "id": 30156776,
      "score": 1,
      "time": 1643674177,
      "title": "Roundup of Events for Bootstrappers in February 2022",
      "type": "story",
      "url": "https://bootstrappersbreakfast.com/2022/01/27/roundup-of-events-for-bootstrappers-in-february-2022/"
    },
    {
      "by": "noch",
      "descendants": 0,
      "id": 30156774,
      "score": 1,
      "time": 1643674148,
      "title": "Ethereum EVM Illustrated [pdf]",
      "type": "story",
      "url": "https://takenobu-hs.github.io/downloads/ethereum_evm_illustrated.pdf"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30156716,
      "score": 1,
      "text": "Why would people have children if they don&#x27;t have to worry about being lonely in their old age and they would have robots that can take care of them?",
      "time": 1643673810,
      "title": "Ask HN: Would curing loneliness via AI and/or medication end the human race?",
      "type": "story"
    },
    {
      "by": "maydemir",
      "descendants": 0,
      "id": 30156683,
      "score": 4,
      "time": 1643673624,
      "title": "Bottles – Run Windows software and games on Linux",
      "type": "story",
      "url": "https://github.com/bottlesdevs/Bottles"
    },
    {
      "by": "oumua_don17",
      "descendants": 1,
      "id": 30156661,
      "kids": [
        30156766,
        30156735
      ],
      "score": 2,
      "text": "If you could add why and pros and cons if you have used both setups?",
      "time": 1643673512,
      "title": "Ask HN: Do you use 1 ultra wide or 2 dual monitors?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 30156619,
      "score": 2,
      "time": 1643673257,
      "title": "PinePhone Community Poll Results",
      "type": "story",
      "url": "https://www.pine64.org/2022/01/31/pinephone-community-poll-results/"
    },
    {
      "by": "exolymph",
      "descendants": 0,
      "id": 30156618,
      "score": 1,
      "time": 1643673256,
      "title": "Maria Brito used Instagram to build a 7-figure art consulting business",
      "type": "story",
      "url": "https://simonowens.substack.com/p/how-maria-brito-used-instagram-to"
    },
    {
      "by": "bigbillheck",
      "descendants": 1,
      "id": 30156572,
      "kids": [
        30156587
      ],
      "score": 5,
      "time": 1643672984,
      "title": "A short introduction to the undeciphered Aegean writing systems",
      "type": "story",
      "url": "https://itsallgreektoanna.wordpress.com/2019/01/29/a-very-short-introduction-to-the-undeciphered-aegean-writing-systems/"
    },
    {
      "by": "movedx",
      "descendants": 1,
      "id": 30156564,
      "kids": [
        30156688
      ],
      "score": 5,
      "text": "EDIT: https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;pcmasterrace&#x2F;comments&#x2F;selc4v&#x2F;didnt_you_know_you_are_all_pirates_arrrrrrr&#x2F;<p>EDIT: LTT = Linus Tech Tips.<p>This is all I have to say about adblockers and adverts:<p>1. Piracy is a willful act just as blocking JavaScript to protect one&#x27;s self online is also a willful act, but it&#x27;s not piracy because it&#x27;s blocking adverts: that&#x27;s just a side effect.<p>The ad gets blocked as most are served via JavaScript that I&#x27;m not authorising the run on my computer. My intention to was simply block arbitrary code from executing on *my * CPU - that&#x27;s not piracy.<p>2. Code execution and 3rd party networks aren&#x27;t something I&#x27;m authorising you to execute or connect to.<p>It&#x27;s as simple as that. Those are the TOS of my system: present me with the minimal amounts of data needed to render the original promised content and nothing more.<p>If we&#x27;re not in alignment here, then I won&#x27;t use your website and you won&#x27;t get to use my computer.<p>But wait, how do I know what the TOS are for your website?<p>3. Your TOS might inform me that you&#x27;re going to run JS and allow that JS to connect to third party networks, but I have to visit the abusive website in the first place to read the TOS and therefore allow the abusive behaviour to occur before I can agree to it or not.<p>That&#x27;s a complete joke, frankly.<p>I cannot have you run some code on your server when I request a website from you because it&#x27;s (a) not technically possible given the current protocols (but the reverse is very much possible) and (b) how would you know those are my TOS before accepting my connection? Why are you allowed to execute additional, third party code on my computer, outside of what&#x27;s needed to render the original promise of content, without me first agreeing to it?<p>4. Adverts are often abusive in design and presentation.<p>They have to soak up as much personal information as they can to do their job: get a highly optimised, individual specific advert in front of the person visiting the site.<p>I have a right to feel safe when visiting a physical store. I shouldn&#x27;t have to worry I will be attacked, robbed or that my personal property is used in a way that I couldn&#x27;t agree to ahead of time (before entering.)<p>The same applies online: I should be able to visit a website without worrying about drive by malware, being tracked or getting more than I asked for.<p>Here&#x27;s an example based in the physical world that to me exemplifies online ads and my points above.<p>Imagine you order a pizza from me. The pizza is free. There&#x27;s no cost for the pizza. I turn up at your door. You open the door. My hand, and the pizza, pass over the threshold of your door, intro your private property.<p>Just as you&#x27;re taking the pizza another person, who came along with me, walks past you and into your property, uses a stencil and paint to put an advert on the inside of your property, on the wall.<p>But wait, it gets worse, because the paint is from your own garage. They didn&#x27;t even bring their own paint - they&#x27;re using yours. But I might make $10 from that advert when you see it and buy the product... cool!<p>Now imagine you block that from happening in the future and order another pizza. The process repeats but this time you got a person blocking my person from painting the advert... hang on, that&#x27;s piracy! You&#x27;re stealing this pizza!<p>Summary: this is really actually not a problem with blocking adverts because we don&#x27;t want to content creators to be paid, it&#x27;s about not allowing unknown code to run on our local systems without first being allowed to understand it AND opt out of it.<p>Running an adblocker is no more privacy in the &quot;Aaarr!&quot; sense than me than simply wanting to not allow anyone and their dog to run code on my machine... because of course it&#x27;s not like anyone would abuse that privilege right guys... guy? Right...?",
      "time": 1643672930,
      "title": "LTT's “AdBlockers are piracy” is a tone deaf remark",
      "type": "story"
    },
    {
      "by": "rickstanley",
      "descendants": 0,
      "id": 30156561,
      "score": 1,
      "time": 1643672923,
      "title": "Neovide – A GUI for Neovim written in Rust",
      "type": "story",
      "url": "https://github.com/neovide/neovide"
    }
  ]
}