{
  "stories": [
    {
      "by": "666b20753a29",
      "descendants": 0,
      "id": 28993832,
      "score": 1,
      "text": "I&#x27;m a 20 y&#x2F;o bootcamp grad with no college degree and 6 months of professional experience. I&#x27;ve been out of employment since May this year, and since mid-September I&#x27;ve been applying for software engineering positions across the US. Also I&#x27;m from Europe and I&#x27;m currently living in SF on a tourist visa, meaning I would need sponsorship for an H-1b work visa.<p>So far I&#x27;ve had zero responses, despite me having referrals to a bunch of large tech companies.<p>Let&#x27;s assume for a moment that I&#x27;m job searching correctly; I&#x27;m applying to places with a strong resume and cover letter, networking on Linkedin and setting up phone calls with engineers and recruiters, leveraging my existing network and reaching out to almost everyone I know, etc etc. Is there a limiting factor of my situation here? Why am I being ignored? After getting speedily rejected from FB, even with a relatively strong recommendation, I managed to get feedback from the engineer that it&#x27;s basically because companies aren&#x27;t willing to sponsor for entry-level positions, especially if the candidate doesn&#x27;t have a degree. Is this true?<p>My resolve is starting to break because I have zero visibility on _what_ exactly is going wrong. If it&#x27;s something about my situation that doubles the bar, then that&#x27;s fine– I&#x27;ll go work in Europe for a few years, and I&#x27;ll be back in the US soon. No hard feelings. But because I know that I&#x27;m more than competent enough to hold down the positions I&#x27;m applying for; overqualified even, I wonder if it&#x27;s something about my situation or something that I&#x27;m doing wrong.<p>What are the conditions that companies offer sponsorship on? Is there a hard limit on the # of times a company can sponsor? Am I not being taken seriously because I&#x27;m too young? Or because my only experience was a 6 months long? How can I optimize my self image&#x2F;personality to put myself in the best position here?<p>My single biggest fear is that I&#x27;m wasting my time. I don&#x27;t care about comp or prestige, I just want to work and build things. But I&#x27;ve had to instead spend the last few months writing fucking cover letters, using all the businessy buzzwords. It&#x27;s so cringe and debilitating to me.<p>Am I doomed? Or am I being too fragile? Should I keep calm and carry on? I can do that, but I have a vauge sense of angst that I could be wasting my time without knowing it.<p>What do?",
      "time": 1635200093,
      "title": "Is my job search situation doomed? I'm losing hope and getting desperate",
      "type": "story"
    },
    {
      "by": "threatofrain",
      "descendants": 0,
      "id": 28993818,
      "score": 2,
      "time": 1635199997,
      "title": "Tesla shares surpass $1T in value",
      "type": "story",
      "url": "https://www.nytimes.com/live/2021/10/25/business/news-business-stock-market"
    },
    {
      "by": "rrauenza",
      "descendants": 0,
      "id": 28993814,
      "score": 2,
      "time": 1635199988,
      "title": "Extreme couponers were sent to prison in $31.8M fraud scheme",
      "type": "story",
      "url": "https://www.cnn.com/2021/10/25/business/extreme-couponer-sentencing/index.html"
    },
    {
      "by": "telotortium",
      "descendants": 0,
      "id": 28993752,
      "score": 4,
      "time": 1635199719,
      "title": "Jury Hands Victory to Facebook and Oculus VR Founder in Rift Ownership Trial",
      "type": "story",
      "url": "https://lawstreetmedia.com/news/tech/jury-hands-victory-to-facebook-and-oculus-vr-founder-in-rift-ownership-trial/"
    },
    {
      "by": "arduinomancer",
      "descendants": 0,
      "id": 28993731,
      "score": 1,
      "time": 1635199602,
      "title": "Taxicab Geometry",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Taxicab_geometry"
    },
    {
      "by": "telotortium",
      "descendants": 1,
      "id": 28993722,
      "kids": [
        28993724
      ],
      "score": 2,
      "time": 1635199555,
      "title": "Jury Clears Oculus Founder, Facebook Unit of IP Theft",
      "type": "story",
      "url": "https://twitter.com/PalmerLuckey/status/1452753156895506433"
    },
    {
      "by": "devtailz",
      "descendants": 3,
      "id": 28993717,
      "kids": [
        28993733,
        28993732
      ],
      "score": 3,
      "time": 1635199521,
      "title": "Ask HN: Why does my camera turn on briefly when accessing google.com?",
      "type": "story"
    },
    {
      "by": "aml183",
      "descendants": 0,
      "id": 28993704,
      "score": 2,
      "time": 1635199435,
      "title": "Airbus Ventures Backs Ispace",
      "type": "story",
      "url": "https://payloadspace.com/airbus-ventures-backs-ispace/"
    },
    {
      "by": "version_five",
      "descendants": 0,
      "id": 28993688,
      "score": 3,
      "time": 1635199345,
      "title": "The Facebook papers are a “big fat nothingburger”",
      "type": "story",
      "url": "https://reason.com/2021/10/25/the-facebook-papers-mark-zuckerberg-frances-haugen-media/"
    },
    {
      "by": "gkaemmer",
      "descendants": 0,
      "id": 28993642,
      "score": 1,
      "time": 1635199062,
      "title": "Why do we keep rewriting our code?",
      "type": "story",
      "url": "https://thoughts.gkaemmer.com/why-do-we-keep-rewriting-code"
    }
  ]
}