{
  "stories": [
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 28290219,
      "score": 1,
      "time": 1629819238,
      "title": "Morocco’s Cabinet Approves Draft Decree Legalizing Cannabis",
      "type": "story",
      "url": "https://www.moroccoworldnews.com/2021/08/344046/moroccos-cabinet-approves-draft-decree-legalizing-cannabis"
    },
    {
      "by": "dochtman",
      "descendants": 0,
      "id": 28290210,
      "score": 2,
      "time": 1629819205,
      "title": "OpenSSL security advisory (2021-08-24)",
      "type": "story",
      "url": "https://www.openssl.org/news/secadv/20210824.txt"
    },
    {
      "by": "cf100clunk",
      "descendants": 0,
      "id": 28290206,
      "score": 1,
      "time": 1629819196,
      "title": "Clearwater Analytics founder in Idaho private airstrip fight",
      "type": "story",
      "url": "https://www.thedailybeast.com/multimillionaire-michael-boren-battles-idaho-neighbors-over-sawtooth-airstrip"
    },
    {
      "by": "akbarnama",
      "descendants": 0,
      "id": 28290197,
      "score": 2,
      "time": 1629819169,
      "title": "Reuters photographer was killed after being left behind in retreat",
      "type": "story",
      "url": "https://www.reuters.com/investigates/special-report/afghanistan-conflict-reuters-siddiqui/"
    },
    {
      "by": "Element_",
      "descendants": 0,
      "id": 28290192,
      "score": 1,
      "time": 1629819150,
      "title": "Possible case of 'Havana syndrome' in Vietnam delays Vice President Harris visit",
      "type": "story",
      "url": "https://abcnews.go.com/Politics/case-havana-syndrome-vietnam-delays-vice-president-harriss/story?id=79618335"
    },
    {
      "by": "ghostmatt",
      "descendants": 0,
      "id": 28290181,
      "score": 2,
      "text": "Hello!<p>So I am non technical founder. I am searching for dev shops to help me build a web app. I want to make sure I choose a dev shop that uses that right backend frame work, that is in line with my vision for the product.<p>1.) The Product (Generally) - An online discovery network. User profiles, ability to chat with users. Ability to live stream. Ability to create community groups where many people can interact and chat. Payment integration etc. Filter and search for different users by category. Very feature rich...<p>2.) I want to make sure it&#x27;s a backend framework that is very common and lots of programmers are familiar with. When I am recruiting I want to make sure this the right backend tech stack that is current and relevant and lots of people work with.<p>3.) Want to make sure it is right for scale and for lots of users.<p>Thanks in advance! Been tricky navigating developers since I am non technical, trying to make the right decisions before I go with someone :)",
      "time": 1629819119,
      "title": "(I'm non-technical) What is the best back end framework to use for my web app?",
      "type": "story"
    },
    {
      "by": "gabitoju",
      "descendants": 0,
      "id": 28290169,
      "score": 4,
      "time": 1629819077,
      "title": "404PageFound – Active Vintage Websites, Old Webpages, and Web 1.0",
      "type": "story",
      "url": "https://www.404pagefound.com/"
    },
    {
      "by": "ionwake",
      "descendants": 0,
      "id": 28290166,
      "score": 1,
      "text": "My last review on airbnb was a complete fabrication and completely ruined an otherwise excellent profile with a large number of positive reviews.<p>I appealed and support turned me down.<p>The reason I &quot;have a case&quot; is that the host was new and and compared to me only had 1 neutral review. compared to my 10+)<p>It is obviously a fabrication from a new host who I think got into trouble with her housing association.<p>My questions is please can someone on HN recommend a route &#x2F; email or path I can take to re-appeal the removal of her feedback?<p>Do I really have no option other than to delete the profile after years of use? has anyone successfully resolved an issue like this?<p>This is a shame because I am was considering putting my own valuable property onto the site in Oxford.<p>EDIT&gt; Please before recommending I ignore her false review - understand she really did her best to make me look very bad and I think it will affect all my future stays.",
      "time": 1629819065,
      "title": "Ask HN: Unsure how to appeal an untrue Airbnb review – considering legal action",
      "type": "story"
    },
    {
      "by": "gadders",
      "descendants": 0,
      "id": 28290128,
      "score": 2,
      "time": 1629818902,
      "title": "Caught in the Crossfire over Covid’s Origins",
      "type": "story",
      "url": "https://www.nytimes.com/2021/08/24/health/coronavirus-origins-alina-chan.html"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 28290107,
      "score": 2,
      "time": 1629818801,
      "title": "It’s coming home: law gives neighbours right to retrieve lost ball in Belgium",
      "type": "story",
      "url": "https://www.theguardian.com/world/2021/aug/24/footballs-coming-home-legal-right-to-retrieve-a-lost-ball-in-belgium"
    }
  ]
}