{
  "stories": [
    {
      "by": "OrderlyTiamat",
      "descendants": 0,
      "id": 28417263,
      "score": 1,
      "time": 1630777524,
      "title": "Bit History: The Flathead (2018)",
      "type": "story",
      "url": "https://www.ifixit.com/News/9899/bit-history-the-flathead"
    },
    {
      "by": "gamontserrat",
      "descendants": 0,
      "id": 28417257,
      "score": 1,
      "time": 1630777512,
      "title": "Global Gas Price Surge Threatens to Dent the Economic Recovery",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-09-04/global-gas-price-surge-threatens-to-dent-the-economic-recovery"
    },
    {
      "by": "java4all",
      "descendants": 0,
      "id": 28417240,
      "score": 2,
      "time": 1630777448,
      "title": "Calendar as a tool to get things done",
      "type": "story",
      "url": "https://medium.com/@yet-another-software-engineer/calendar-meeting-invites-as-a-tool-to-get-things-done-ad9c8f228d4d"
    },
    {
      "by": "anon4984",
      "descendants": 0,
      "id": 28417219,
      "score": 2,
      "text": "The hallmark of populism is &quot;bread and circuses&quot;. In case of Cesar both were literal - free allotments of grain coupled with games. Trump&#x27;s &quot;bread&quot; was the trade barriers and the resultant highest employment level (and growing wages) in decades, plus medication prescription prices, plus probably a few other things like the unemployment checks (not sure if that was <i>really</i> him). The &quot;circuses&quot; part was the mockery he made of the elites, especially the liberal elites, and more generally his flamboyant personality. No one was bored during the Trump years.<p>Cesar was hated by all the Roman elites and loved by <i>all</i> the Roman people. Where Trump differs is that he is hated by all the elites, but is only loved by <i>half</i> the people. This is not an accident - the elites have learned their &quot;Cesar&quot; lessons and have driven a wedge between the people, specifically between the blue collar and the white collar workers. If you are wondering why the culture wars are never followed by a culture peace that&#x27;s because they are not supposed to end - the point is to saw discord, not to make progress. Divide and rule, today as ever.<p>Today&#x27;s elites are corrupt as a class - specifically the neoliberal economic policy (Free Trade) enriches the rich and impoverishes the poor, both the blue collar and the white collar alike. Similarly, the patrician class of Rome used the influx of the slave labor (&quot;Free Trade&quot; of the day) to drive down the labor costs, impoverish the farmers, consolidate the land holdings, and permanently lock out the formerly middle class out of wealth. The wealth disparity and the loss of dignity that came with it has disconnected the people from the elites and the latter became an easy target for a populist. It is thus only a matter of time until one arises - Cesar, Trump, or even Putin. We&#x27;re lucky Trump wasn&#x27;t very good at it, but if the next populist turns out to be more charismatic and more competent then the republic is doomed. We might get a few decades of peace and prosperity under an enlightened &quot;Octavian-Augustus&quot;, but that will be followed by a Caligula when we&#x27;re lucky or a bunch of weaklings when we&#x27;re not. The weaklings, having usurped power yet not knowing how to wield it, will drive the country into the ground, thus ending the age of American supremacy, then the age of relative prosperity, then the age of stability. Not to mention the numerous civil wars on the subject of succession that will accompany every other transition of power. I shudder to think.<p>So, we&#x27;re doomed either way, aren&#x27;t we? On one hand the republic is corrupt and no longer serves the people, and a competent dictator <i>could</i> disembowel the sacks of money on which the elites made their beds. The money might even end up serving the people. On the other hand it&#x27;s still a republic - protected from the excesses of dictatorial rule, maintaining internal peace, assuring smooth succession of power, and providing meritocratic social mobility at least for some even if not for all. Y-Combinator being one example. So... Status quo or disruption? Woe is us!<p>Or is it? There is still one way to save the republic - should the blue collar and the white collar come together the people could then reign in Free Trade and redistribute the wealth back into the hands of the middle class and lift the poor out of their predicament. It&#x27;s only the culture wars that keeps us apart. So close, yet to so far.",
      "time": 1630777335,
      "title": "Trump and Cesar – The Roots of Populsim",
      "type": "story"
    },
    {
      "by": "achalkias",
      "descendants": 0,
      "id": 28417146,
      "score": 1,
      "time": 1630776943,
      "title": "Kubernetes 1.22 addresses industry needs",
      "type": "story",
      "url": "https://ubuntu.com/blog/how-kubernetes-1_22-addresses-industry-needs"
    },
    {
      "by": "rolph",
      "descendants": 0,
      "id": 28417078,
      "score": 1,
      "time": 1630776618,
      "title": "Rare Gas-Powered Circular Saw Rescue[YouTube]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=lxEX0qvQ4p8"
    },
    {
      "by": "Phithagoras",
      "descendants": 0,
      "id": 28417071,
      "score": 1,
      "time": 1630776581,
      "title": "Earth’s inner core is growing unevenly. Why isn’t the planet tipping?",
      "type": "story",
      "url": "https://www.independent.co.uk/news/science/earth-core-growing-planet-tipping-b1907810.html"
    },
    {
      "by": "ericb",
      "descendants": 1,
      "id": 28417027,
      "kids": [
        28417134
      ],
      "score": 1,
      "text": "I&#x27;ve recently gotten a number of unsolicited emails like:<p>Our client is looking to speak with multiple participants such as IT Operations Specialists (ITOPs) and Developers who have experience with and deep knowledge of a) Ubuntu Server and&#x2F;or Red Hat Enterprise Linux(RHEL), and the ability to discuss the benefits of Linux OS support contracts, b) Linux container strategies&#x2F;technologies in use in their organizations, and c) Linux workload development and&#x2F;or deployments on the public cloud. The goal of the focus group discussion is to gain insights about the Linux Operating System market and how its customers think about paid support from Linux Providers.<p>This is a paid 2-hr focus group discussion for $350. I found you on LinkedIn and I think your profile is a good fit for this project. This is a research study and not a sales solicitation.  Please note we are only interested in your point of view and are not seeking confidential information.<p>---------------------------<p>Anyone else get these emails? What happens if you do one? Is it a stealth sales call as I suspect? What is the process, and who is getting what out of it?",
      "time": 1630776360,
      "title": "Ask HN: Anyone attend “Paid Focus Group on [x technology]” what happened?",
      "type": "story"
    },
    {
      "by": "libertylocked",
      "descendants": 1,
      "id": 28417018,
      "kids": [
        28417153
      ],
      "score": 4,
      "time": 1630776327,
      "title": "Bitwarden is now in Arch Linux community repository",
      "type": "story",
      "url": "https://archlinux.org/packages/community/x86_64/bitwarden"
    },
    {
      "by": "andreyk",
      "descendants": 0,
      "id": 28416997,
      "score": 2,
      "time": 1630776200,
      "title": "OpenAI Sold its Soul for $1B",
      "type": "story",
      "url": "https://onezero.medium.com/openai-sold-its-soul-for-1-billion-cf35ff9e8cd4"
    }
  ]
}