{
  "stories": [
    {
      "by": "NicoJuicy",
      "descendants": 0,
      "id": 30225769,
      "score": 1,
      "time": 1644093869,
      "title": "Analog Tide Predictors Changed Human History",
      "type": "story",
      "url": "https://hackaday.com/2015/10/08/how-analog-tide-predictors-changed-human-history/"
    },
    {
      "by": "atlasunshrugged",
      "descendants": 0,
      "id": 30225749,
      "score": 1,
      "time": 1644093792,
      "title": "The rise of defense tech is bringing Silicon Valley back to its roots",
      "type": "story",
      "url": "https://techcrunch.com/2022/02/05/the-rise-of-defense-tech-is-bringing-silicon-valley-back-to-its-roots/"
    },
    {
      "by": "kome",
      "descendants": 0,
      "id": 30225736,
      "score": 1,
      "time": 1644093723,
      "title": "Michael Kay about XSLT, XML, and software business",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2Zt9oJtFKGw"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30225716,
      "score": 1,
      "time": 1644093562,
      "title": "Wagtail, the powerful CMS for modern websites",
      "type": "story",
      "url": "https://wagtail.org/"
    },
    {
      "by": "divyenduz",
      "descendants": 0,
      "id": 30225705,
      "score": 1,
      "time": 1644093470,
      "title": "TypeScript in Postgres with PLV8",
      "type": "story",
      "url": "https://trackfootball.app/blog/engineering/typescript-in-postgres-with-plv8"
    },
    {
      "by": "ggherbo",
      "descendants": 0,
      "id": 30225667,
      "score": 1,
      "text": "I will attempt to paint a whole picture of ecology concisely employing artistry as well as scientific reasoning. Hopefully, this resonates with individuals spurring debate.<p>In the midst of a pandemic with an entity very different than ones before it. On the one hand its unparalleled comparing the past with the present or future. On the other it&#x27;s possible to see this entity as the most transmittable, widely intuited disease ever before it. We must conclude that humans play a role in how things are&#x2F;will play out. \nWith banality, the more deadly an entity becomes the more difficult transmissibility becomes. This brings to mind zombies because this form of entity allows maximization of both poles. This current pandemic illustrates however something unique. An entity which is highly transmittable, deadly--yet can also have infected individuals completely unbeknownst to it. This can be called our step closer to zombies. Above the bottom line however, it is evident that humans in the name of curiosity exert an extrodinary evolutionary pressure. The forces of nature balance though, then we balance with by homeostasis. We can feel when we are losing our balance, it just might happen so gradually, naturally we are unbeknownst. \nWith banality, there&#x27;s always the looming apocalypse or Pandora&#x27;s debate. \nWith sincerity without certainty let&#x27;s look up into the stars for a glimpse of what&#x27;s to come. I am excited for all the possible new super-entities that come out of the world. These will give us a deeper understanding of ourselves as profoundly this pandemic has. Nothing says we must keep going so let&#x27;s keep going anyways. Let&#x27;s be fine, because we are the ones who get to choose the narrative.",
      "time": 1644093327,
      "title": "Fear Piece Concerning Ecology",
      "type": "story"
    },
    {
      "by": "amichail",
      "descendants": 0,
      "id": 30225644,
      "score": 1,
      "text": "For example, it could release a highly realistic space and city simulator game. Gamers would then build cities on Mars with various degrees of success.<p>By watching what the gamers do, SpaceX could get valuable insight into what might work better for building a city on Mars.",
      "time": 1644093249,
      "title": "Ask HN: Why doesn’t SpaceX make a simulator game to help build a city on Mars?",
      "type": "story"
    },
    {
      "by": "doener",
      "descendants": 0,
      "id": 30225639,
      "score": 1,
      "time": 1644093233,
      "title": "More Amiga Games Coming in 2022 – Part 2",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=2PGi_lqeURE"
    },
    {
      "by": "llamaleaf",
      "descendants": 0,
      "id": 30225621,
      "score": 1,
      "time": 1644093160,
      "title": "Creative marketplace Gumroad uses customer data in Twitter spat",
      "type": "story",
      "url": "https://twitter.com/RobDenBleyker/status/1490040426266570761"
    },
    {
      "by": "HiroProtagonist",
      "descendants": 0,
      "id": 30225588,
      "score": 2,
      "time": 1644093006,
      "title": "Lawmakers Press Amazon on Sales of Chemical Used in Suicides",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/04/technology/amazon-suicide-poison-preservative.html"
    }
  ]
}