{
  "stories": [
    {
      "by": "robomartin",
      "descendants": 0,
      "id": 30664767,
      "score": 1,
      "text": "Before you read my comment, please watch this.  Please.  I beg you.  Do it now.<p>https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=N-yALPEpV4w<p>I ask that you do not down-vote this purely on emotional or ideological grounds.  I know that for many people this is a first reaction.  This is too important and it deserves discussion.<p>Another request:  Please argue with the facts as presented by scientist who are speaking up.  Do not argue with me.  I am simply a messenger.  I am nobody.<p>It is hard to be told what you believe is wrong.  And, sometimes, it is even harder to accept it.  However, a true scientist or someone wishing to based beliefs in scientific fact must always be open to this.  This is how people like Galileo dared to suggest that the earth was not the center of the universe.  And he was right.<p>-----<p>If you look through my comments on HN you will find a fairly consistent message I have been pounding on for years (both on HN and elsewhere):<p>We need to start discussing the truth or we are doomed to fail, or worse, cause irreparable damage.<p>While climate change and our contribution to atmospheric CO2 accumulation are very real issues we must address to the extent possible, we are allowing ourselves to descend into a delusion.  This delusion is, from my perspective, mostly driven by politicians for whom the &quot;holier than thou&quot; position, when combined with uninformed masses, results in easy votes.  Who isn&#x27;t receptive to &quot;save the planet for your children&quot;?<p>I have written extensively about having developed models that indicate we need to more than double our power generation capacity and revamp our entire power distribution system in order to convert out entire ground transportation system to electric power.  For sense of scale, this would require a thousand nuclear power plants or thereabouts.<p>I developed these models many years ago.  It wasn&#x27;t until relatively recently that I was able to confirm my predictions were not far off at all when Elon Musk was asked the question at a conference:<p>https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=TcI6FaaDp8g&amp;t=3510s<p>I have also commented that solar and wind, at scale, will not solve this problem and that they are not at all the clean technologies our collective delusion makes them out to be.  A solar farm requires somewhere around 15 to 20 times the land in order to generate the output of a single nuclear power plant and massively more in the materials used to construct it.  We we need to cover unimaginable areas of land.  Building them would not be clean and green at all.  We will kill-off wild life like never before.  And the waste generated after the short service life these systems have will end-up polluting out planet even further.<p>These are not solutions intelligent people in command of the truth would choose.  In fact, these are not solutions at all.<p>I&#x27;ll repeat:  We need to stop the delusion and start to discuss matters based on facts, otherwise known as the truth.  We need to stop allowing politicians to drive this insane narrative.  All they care about is winning elections.  And they are never responsible for the carnage they produce through their actions (or inaction).  We need the truth.  ASAP.",
      "time": 1647199192,
      "title": "In the effort to try to save the climate, are we destroying the environment?",
      "type": "story"
    },
    {
      "by": "andai",
      "descendants": 0,
      "id": 30664758,
      "score": 1,
      "text": "Posting this just in case anyone as scatterbrained as me hasn&#x27;t caught on yet.<p>As previously mentioned here two months ago [0][1], Google recently discontinued the free tier of Workspace (formerly known as Google Apps, G Suite, whatever).<p>I used their free email integration with my webhost for the last ten years. Today my friend bought me a game bundle for charity and I never got the email. Turns out I haven&#x27;t been getting any mail for the last 10 days! My account was suspended due to &quot;inactivity&quot;, and was scheduled to be deleted by the end of the month!<p>I have it set up to forward to my main email, so I never need to login. They did send multiple warnings, so it&#x27;s my fault that I missed it.<p>Furthermore, I&#x27;d lose access to the account in June unless I upgrade to a paid membership. It&#x27;s $5 per month, and with a &gt;50% discount for the first year. $5 seems to be the standard basic tier pricing for paid email hosting, and frankly I&#x27;d pay more to avoid the hassle of migrating, so I just paid up.<p>That&#x27;s about all. Moderately pissed off, and hoping I can save someone a nasty surprise, if they had a setup similar to mine (and were similarly distracted).<p>[0] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29996432<p>[1] https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29997776",
      "time": 1647199114,
      "title": "Tell HN: Google suspended my custom email address for \"inactivity\"",
      "type": "story"
    },
    {
      "by": "mwattsun",
      "descendants": 1,
      "id": 30664752,
      "kids": [
        30664759
      ],
      "score": 2,
      "time": 1647199083,
      "title": "Biden Restores California’s Power to Set Stringent Tailpipe Rules",
      "type": "story",
      "url": "https://www.nytimes.com/2022/03/09/climate/biden-california-tailpipe-waiver.html"
    },
    {
      "by": "News-Dog",
      "descendants": 0,
      "id": 30664733,
      "score": 1,
      "time": 1647198971,
      "title": "Researchers uncover how the human-brain separates, stores and retrieves-memories",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2022/03/220307113145.htm"
    },
    {
      "by": "carom",
      "descendants": 0,
      "id": 30664717,
      "score": 1,
      "text": "I know there are a lot of datasets out there, some are restricted based on their license (non commercial). There are a lot of generic items but when you get to niche applications there are fewer.<p>I&#x27;d personally like to see a dataset for billiards. That would enable an AR app that helps you find shots. While a little morbid, I also think an active shooter dataset would be very valuable. Something from security camera angles to identify people with weapons.",
      "time": 1647198868,
      "title": "Ask HN: What computer vision datasets is the world missing?",
      "type": "story"
    },
    {
      "by": "m33k44",
      "descendants": 0,
      "id": 30664711,
      "score": 1,
      "time": 1647198813,
      "title": "A Contrarian View on Ukraine/Russia",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Mu19_rlwHgY"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 30664707,
      "kids": [
        30664714
      ],
      "score": 1,
      "time": 1647198775,
      "title": "Finnish University invites students fleeing Ukraine",
      "type": "story",
      "url": "https://www.helsinki.fi/en/news/war-ukraine"
    },
    {
      "by": "albingroen",
      "descendants": 0,
      "id": 30664689,
      "score": 1,
      "time": 1647198654,
      "title": "Coiner – A Mac app to keep up with Crypto Currencies",
      "type": "story",
      "url": "https://getcoiner.app"
    },
    {
      "by": "CTOSian",
      "descendants": 0,
      "id": 30664686,
      "score": 2,
      "time": 1647198646,
      "title": "ReactOS running in SMP reaching Desktop",
      "type": "story",
      "url": "https://twitter.com/reactos/status/1503007013785284617"
    },
    {
      "by": "trinsic2",
      "descendants": 1,
      "id": 30664681,
      "kids": [
        30664682
      ],
      "score": 2,
      "time": 1647198614,
      "title": "My transition from Windows to Linux in an anti-customer age",
      "type": "story",
      "url": "https://www.scottrlarson.com/publications/publication-transition-windows-to-linux/"
    }
  ]
}