{
  "stories": [
    {
      "by": "annagold",
      "descendants": 0,
      "id": 29638935,
      "score": 1,
      "time": 1640104113,
      "title": "Modern Film Photography Service",
      "type": "story",
      "url": "https://nicefilmclub.com/"
    },
    {
      "by": "jobvalley",
      "descendants": 0,
      "id": 29638920,
      "score": 1,
      "text": "We are looking for experienced Software Engineers who already worked or would like to work with Elixir&#x2F;Phoenix.<p>About us<p>Company name: jobvalley (former Studitemps)\nWebsite: https:&#x2F;&#x2F;tech.jobvalley.com&#x2F; \nCountry: Germany<p>jobvalley is the leading digital platform for flexible work in Germany. We help students find work while they study and provide them with their first post graduate job afterwards. Our product development team are working on revolutionizing the job market for academics and we have seven teams who use Elixir and Phoenix, Flutter, or Ruby on Rails to write applications such as automated employment contract creation, high-performance billing systems, an intelligent matching platform for optimal staffing, our job platform Jobmensa, a student app and a self-service platform for corporates.<p>About the job<p>Remote within Germany, 60000-85000 Euro&#x2F;year<p>As a software engineer at jobvalley it’s not just about writing good code. In your Scrum team, you can contribute your skills and ideas. This starts with the conception and exploration of central questions and leads to their architectural and technical implementation.\nThe work of our seven teams always focuses on the overarching goal of advancing our product by creating added value for students, companies and our internal employees alike.\nYour tasks will include designing and developing applications and microservices in Elixir and optimizing the existing code base.\nWe use domain-driven design to handle the complexity of our software landscape.<p>Qualifications or experience required: A couple of years as a software engineer working on products. Experiences with Elixir or other functional programming languages are helpful, but not necessary.<p>We have open positions in two of our teams. You would either work on a new product: a job platform for young professionals. Or you would work on the fully automated creation of employment contracts and accounting systems for punctual payment of wages for our students.<p>Please contact us if you have questions or if you are interested in that position:\njobs@jobvalley.tech\nhttps:&#x2F;&#x2F;tech.jobvalley.com&#x2F;jobs 3\n+49 151 14199020",
      "time": 1640104026,
      "title": "Jobvalley is hiring Software Engineers (Elixir)",
      "type": "story"
    },
    {
      "by": "cynthiabrewer",
      "descendants": 0,
      "id": 29638914,
      "score": 1,
      "time": 1640104007,
      "title": "Buy Verified Payoneer Account",
      "type": "story",
      "url": "https://buyusasmm.com/product/buy-google-5-star-reviews/"
    },
    {
      "by": "spw",
      "descendants": 1,
      "id": 29638903,
      "kids": [
        29638918
      ],
      "score": 1,
      "time": 1640103957,
      "title": "Show HN: NFTGifts – Give NFTs to Anyone",
      "type": "story",
      "url": "https://www.nftgifts.app/"
    },
    {
      "by": "camjohnson26",
      "descendants": 0,
      "id": 29638896,
      "score": 1,
      "time": 1640103913,
      "title": "Video of Tesla on Autopilot Crashing into Stopped Truck at 75mph",
      "type": "story",
      "url": "https://twitter.com/greentheonly/status/1473307236952940548"
    },
    {
      "by": "theredsix",
      "descendants": 0,
      "id": 29638874,
      "score": 1,
      "time": 1640103783,
      "title": "Show HN: Open-Source WebSocket Log4j Exploit Immunizer",
      "type": "story",
      "url": "https://github.com/paladincyber/log4jprotector"
    },
    {
      "by": "tobyjsullivan",
      "descendants": 0,
      "id": 29638868,
      "score": 1,
      "time": 1640103762,
      "title": "NASA's James Webb Space Telescope – Official Mission Trailer [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=69uT90tEJdE"
    },
    {
      "by": "tobltobs",
      "descendants": 0,
      "id": 29638861,
      "score": 2,
      "text": "I think I understand why inverted yield curves in the US or Eurodollar rates are supposed to be a sign for a coming recession. But I don&#x27;t get why a lot of pundits say that it also mean deflation is coming and totally rule out a longer time of inflation.<p>Also I am not sure I get why this signal is supposed to be nearly foolproof. Doesn&#x27;t it just rely on the wisdom of the crowd. If most traders think there will be a recession then the yield curves inverts, but the majority could still be wrong? Or is there another mechanism which inverts the yield curve?",
      "time": 1640103723,
      "title": "Ask HN: For finance nerds, why do inverted yield curves predict Deflation?",
      "type": "story"
    },
    {
      "by": "thedday",
      "descendants": 0,
      "id": 29638843,
      "score": 1,
      "time": 1640103620,
      "title": "Eagle-Eyed Redditor Spots a Flying Stealth Bomber on Google Maps – TechRadar",
      "type": "story",
      "url": "https://www.techradar.com/news/eagle-eyed-redditor-spots-a-flying-stealth-bomber-on-google-maps"
    },
    {
      "by": "niros_valtos",
      "descendants": 0,
      "id": 29638837,
      "score": 2,
      "time": 1640103588,
      "title": "Conti ransomware gang weaponized Log4j2, now with a full attack chain",
      "type": "story",
      "url": "https://threatpost.com/conti-ransomware-gang-has-full-log4shell-attack-chain/177173/"
    }
  ]
}