{
  "stories": [
    {
      "by": "plug_world",
      "descendants": 0,
      "id": 31599192,
      "score": 1,
      "time": 1654196618,
      "title": "The simplest static site generator (2018)",
      "type": "story",
      "url": "https://medium.com/hackernoon/the-simplest-static-site-generator-c775ed88d15a"
    },
    {
      "by": "hack4supper",
      "descendants": 0,
      "id": 31599184,
      "score": 1,
      "text": "I signed up for Copper CRM as I was thinking that I was getting a good deal for their 20% lifetime discount to sign up on May 01 2022. I signed up and realized that this was not the product for me. And I cancelled the service, but these people refused to stop charging and as I just saw my credit card statement, was charged for June as well.<p>I understand that it was my fault completely that I should have used their app for the trial version first before signing up, but having to penalize a client for 12 months and enforce their obligation, because of a 1 day use is in my opinion not a way to treat a customer.<p>In my opinion, what seemed fair and also as I requested them, was to charge me for a full month of May for not checking out the software first.<p>Buyer beware!",
      "time": 1654196571,
      "title": "Tell HN: Copper CRM will Charge for 12 months if you Cancel on first day",
      "type": "story"
    },
    {
      "by": "waspight",
      "descendants": 0,
      "id": 31599180,
      "score": 1,
      "text": "Group chats like Facebook messenger and community boards like Facebook groups and Reddit seems to almost converge towards the same thing, feature wise. For instance Facebook groups does add messages continuously as they are written. Is there any analysis of this phenomenon out there? Why are we still having both layouts?",
      "time": 1654196549,
      "title": "Why do we still have the layout of both group chats and community boards?",
      "type": "story"
    },
    {
      "by": "carlgreene",
      "descendants": 0,
      "id": 31599179,
      "score": 1,
      "time": 1654196536,
      "title": "What Are You Good At?",
      "type": "story",
      "url": "https://iamunknowing.com/what-are-you-good-at/"
    },
    {
      "by": "hereforphone",
      "descendants": 0,
      "id": 31599170,
      "score": 1,
      "text": "I&#x27;ve visited probably a dozen chiropractors.  Many of them have helped me a lot; only a couple seemed to be trying to scam me.<p>I had a discussion with my current chiropractor about &quot;out of place&quot; joints&#x2F;bones and whether or not they will heal without chiropractic intervention.  I&#x27;m concerned about this because I may be moving to a country without chiropractors.<p>He avoided answering, at most stating that chiropractic care &quot;accelerates the healing process&quot;.  He wouldn&#x27;t tell me straight out that my body will re-align on its own over time.<p>I know there are people out there who believe chiropractors are a scam in general, but I&#x27;ve experienced benefits from them first hand for a couple of decades now and I&#x27;m convinced a &quot;good&quot; one is helpful.  What I still don&#x27;t know after all this time is whether the body will realign itself (for lack of a better work, as I&#x27;m a layman) on its own.<p>Any expanded information about how chiropractic care works would be appreciated, especially related to my concern above.",
      "time": 1654196480,
      "title": "Ask HN: How Do Chiropractors Work?",
      "type": "story"
    },
    {
      "by": "yablak",
      "descendants": 1,
      "id": 31599153,
      "kids": [
        31599190
      ],
      "score": 1,
      "time": 1654196430,
      "title": "The journey towards caste equity in tech",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=USTm1CbmExc"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31599140,
      "score": 1,
      "time": 1654196366,
      "title": "The Strange and Too-Familiar Tale of Uncle Suitcase [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=x70EypnAH1Y"
    },
    {
      "by": "0des",
      "descendants": 0,
      "id": 31599139,
      "score": 1,
      "time": 1654196363,
      "title": "Initiative for the Prolongation of Earth Days to 30 Hours",
      "type": "story",
      "url": "http://www.30hd.org/"
    },
    {
      "by": "bokenator",
      "descendants": 0,
      "id": 31599136,
      "score": 2,
      "time": 1654196343,
      "title": "A Gentle Intro to Chaos Theory",
      "type": "story",
      "url": "https://www.cantorsparadise.com/a-gentle-introduction-to-chaos-theory-93b9c821903b"
    },
    {
      "by": "jamesofthedrum",
      "descendants": 1,
      "id": 31599120,
      "kids": [
        31599126
      ],
      "score": 1,
      "time": 1654196271,
      "title": "Largest plant: 112-mile-long seagrass found off Australian coast",
      "type": "story",
      "url": "https://newatlas.com/science/worlds-largest-plant-seagrass/"
    }
  ]
}