{
  "stories": [
    {
      "by": "CitrusFruits",
      "descendants": 0,
      "id": 31054029,
      "score": 1,
      "time": 1650128942,
      "title": "Show HN: Slow Social, a social network built for friends, not influencers",
      "type": "story",
      "url": "https://slowsocial.us/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 31054027,
      "score": 1,
      "time": 1650128932,
      "title": "Package for decoding and parsing barcodes according to UIC-918.3 specification",
      "type": "story",
      "url": "https://github.com/justusjonas74/uic-918-3"
    },
    {
      "by": "bo0tzz",
      "descendants": 0,
      "id": 31054008,
      "score": 1,
      "time": 1650128790,
      "title": "Live map of all public transport in The Netherlands",
      "type": "story",
      "url": "https://www.ovzoeker.nl/"
    },
    {
      "by": "probst",
      "descendants": 0,
      "id": 31054000,
      "score": 1,
      "text": "After having been a regular employee for years, I worked as a freelancer for a while. Going into my freelancing life I had no real mental model for how much of the money I earned was truly mine to spend, and how much of it I needed to set aside for taxes, vacations, retirement, and in case I got sick. I modelled this in Excel as best I could and was quite surprised both by how complicated it was to get right, and how much money I actually needed to set aside!<p>As my girlfriend also started freelancing last year, I decided to turn my Excel sheet into a little program she could use too, and in the spirit of sharing and helping others I would hereby like to make it available to you all too :)<p>My biggest take-away so far has been that most people dramatically underestimate how much they need to set aside, and forget to plan adequately for getting sick and for retirement.<p>You can find the tool here: https:&#x2F;&#x2F;howmuch.probsteide.com&#x2F;<p>Comments, questions, and suggestions are more than welcome!<p>I wish you all a happy Easter Weekend!<p>In case you skipped to the bottom: you can find the tool at https:&#x2F;&#x2F;howmuch.probsteide.com&#x2F;",
      "time": 1650128725,
      "title": "Show HN: Tool for freelancers to calculate how much money to set aside",
      "type": "story"
    },
    {
      "by": "ta3411",
      "descendants": 0,
      "id": 31053996,
      "score": 1,
      "text": "I am building out a vertical marketplace for people to trade merchandises on iOS and web (think Depop but in a different vertical). What are some engineering resources or blogs I should read to pick up best practices? I have many years of experiences building consumer products but this is my first time building e-commerce&#x2F;marketplace.<p>Especially I would love to explore topics that I may not know about: when to use headless e-commerce, when to build in house inventory management tracking vs using something off the shelf, how to think about compliance, design database for product variants, cart management, in house fulfillment vs offload",
      "time": 1650128709,
      "title": "Ask HN: Good engineering resources to learn about how to build a marketplace",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31053988,
      "score": 1,
      "time": 1650128665,
      "title": "The Rise of the 9 p.m. Work Hour",
      "type": "story",
      "url": "https://www.theatlantic.com/newsletters/archive/2022/04/triple-peak-day-work-from-home/629457/"
    },
    {
      "by": "bpiche",
      "descendants": 0,
      "id": 31053987,
      "score": 1,
      "text": "Mostly an ML&#x2F;NLP engineer, and been interviewing a lot lately, and therefore have been doing a lot of NLP take home tests lately, some more complex than others. Certainly prefer it over any LeetCode tests, though some of these take homes are so complex, they verge on pro bono work and I often feel I should be compensated.<p>One organization recently gave me a take home with the following demands:<p>--<p>Here are 150k long-form (6000+ words) documents, and a list of labels.<p>Please use a recent transformer model as the vectorization&#x2F;representation layer to train a multilabel classifier on this data set.<p>You can use CoLab and their free GPU tier, but we won&#x27;t pay for any GPU&#x2F;TPU time.<p>Also, please compare this solution to other algorithms (linearSVM, XGBoost) and write 1000 words about the performance tradeoffs.<p>---<p>I&#x27;m not a deep learning expert, and I assumed that transformer models are basically limited to short form text with the exception of the Longformer and Big Bird architecture, and I was under the impression that those solutions were pretty memory intense. Other solutions are limited to only looking at the first 512 characters or so. And I&#x27;m not even sure CoLab&#x27;s free tier can handle this.<p>Is this too much? Part of me is really excited to try this but another part of me is already imagining the compute time&#x2F;space required to run this thing.",
      "time": 1650128654,
      "title": "Ask HN: Is this normal? ML/NLP take home",
      "type": "story"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31053986,
      "score": 1,
      "time": 1650128653,
      "title": "An ingenious vintage German cycle map. (2014)",
      "type": "story",
      "url": "http://blog.systemed.net/post/10"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31053983,
      "score": 1,
      "time": 1650128641,
      "title": "An Introduction to Bon (1999)",
      "type": "story",
      "url": "http://www.cs.yorku.ca/~paige/Bon/bon.html"
    },
    {
      "by": "nitinagg",
      "descendants": 0,
      "id": 31053981,
      "score": 1,
      "time": 1650128635,
      "title": "Radiation Levels of Popular Smartphones",
      "type": "story",
      "url": "https://www.visualcapitalist.com/radiation-emissions-of-popular-smartphones/"
    }
  ]
}