{
  "stories": [
    null,
    {
      "by": "rme",
      "descendants": 0,
      "id": 27857909,
      "score": 1,
      "time": 1626452614,
      "title": "Show HN: Web server that executes Go scripts without compiling. Golang XAMPP",
      "type": "story",
      "url": "https://github.com/i-rme/GOP-Server/"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 27857903,
      "score": 1,
      "time": 1626452580,
      "title": "Dementia Cases Have Declined by 13% in US and Europe Every Decade Since 1988",
      "type": "story",
      "url": "https://www.goodnewsnetwork.org/dementia-cases-have-declined-by-13-in-us-and-europe-every-decade-1988/"
    },
    {
      "by": "retskrad",
      "descendants": 0,
      "id": 27857899,
      "score": 2,
      "time": 1626452538,
      "title": "Apple Watch and Health Exec Kevin Lynch Joining the Apple Car Team",
      "type": "story",
      "url": "https://9to5mac.com/2021/07/16/apple-car-kevin-lynch-report/"
    },
    {
      "by": "hker",
      "descendants": 0,
      "id": 27857894,
      "score": 1,
      "time": 1626452478,
      "title": "Inflation? Not in Japan. and That Could Hold a Warning for the U.S.",
      "type": "story",
      "url": "https://www.nytimes.com/2021/07/15/business/economy/inflation-us-japan.html"
    },
    {
      "by": "tylery",
      "descendants": 1,
      "id": 27857890,
      "kids": [
        27857891
      ],
      "score": 2,
      "time": 1626452463,
      "title": "Show HN: From zero to 100 deploys a day [pdf]",
      "type": "story",
      "url": "https://f.hubspotusercontent00.net/hubfs/9281501/Zero-to-One-Hundred-Deploys-a-Day-Book.pdf"
    },
    {
      "by": "newman8r",
      "descendants": 0,
      "id": 27857874,
      "score": 1,
      "text": "I&#x27;ve been holding on to an MVP that I created earlier this year but never even started marketing. The project is completely unvalidated, so that&#x27;s one mistake. It&#x27;s hard to tell if this is something anyone actually wants.<p>It&#x27;s https:&#x2F;&#x2F;www.sookiestack.com&#x2F; - basically a way of automating the process of assigning and keeping track of take-home coding and design challenges (automatically creates a github repo for each candidate). Ideally it will cut down on the amount of time spent on this process.<p>I&#x27;ve considered doing a lot of cold emailing to see if I can get anyone to try it, but it would be better to get someone in my network to test it out and give feedback - see if it&#x27;s useful for them. The problem is, my network kind of sucks.<p>Does anyone around here have any ideas of how I can get some beta users and start to validate the concept? Even better - if anyone is interested in beta testing (for free of course), it would help a lot.",
      "time": 1626452340,
      "title": "Ask HN: How should I validate my tech-hiring MVP?",
      "type": "story"
    },
    {
      "by": "lornajane",
      "descendants": 0,
      "id": 27857870,
      "score": 1,
      "time": 1626452305,
      "title": "Understanding data types: time series or event data?",
      "type": "story",
      "url": "https://aiven.io/blog/time-series-or-event-data-get-less-confused"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 27857837,
      "score": 1,
      "time": 1626452078,
      "title": "Visa’s embrace of crypto is starting to pay off",
      "type": "story",
      "url": "https://fortune.com/2021/07/15/visa-crypto-payments-fintech-cryptocurrency/"
    },
    {
      "by": "aj2",
      "descendants": 1,
      "id": 27857834,
      "kids": [
        27857847
      ],
      "score": 1,
      "text": "Hey HN, founder here. I announced InstaNote first on HN a few months ago that got a bunch of interest. It has grown a lot since then: I’ve made many improvements, added paid subscriptions, and the app hit 100k+ downloads on Android recently. There’s a growing list of subscribers supporting development.<p>This started as an app to build what I personally wanted for these reasons:<p><pre><code>  * There are many tools for complex note taking and project organization, but they don’t make it easy for quickly noting down thoughts. I wanted a fast way to write something down, and an interface like chat seemed most appropriate. Everyone is familiar with the chronology of chat messages. I’ve seen many people use chat apps to achieve these things in roundabout ways but they don’t support everything I wanted.\n  * Keeping track of things over time isn’t easy in other note-taking apps. InstaNote has threads and I personally use them to track my weight and pictures over time. Super easy to see trends. \n  * Most tools don’t have the flexibility of reminders that I wanted. InstaNote has one-time reminders + reminders repeating daily, weekly, monthly, with multiple snooze options. I have 10+ repeating reminders set for myself (this surprised me too! when it works, there are many use-cases for reminders). All reminders can be ported to a new device when you login with one click.\n  * Everyone tends to save a ton of links. Without link previews (like those shown in chat apps), saved links are really hard to browse and find. InstaNote shows link previews which make browsing and searching a lot easier. </code></pre>\nSharing notes also works great in a chat-like UI.\n  * CSV copy of notes: Subscribers get a CSV copy of their notes on email with one click in the app (available on Android, upcoming on iOS but emailing support@instanote.io will work in the meantime). I want users to use the product because they find it useful, not because their data is locked in.\n  * Basic web support is in the works.<p>Many app subscribers have given great feedback over the last couple of months and I am enjoying building for myself and these users. Would love to hear feedback from the community.",
      "time": 1626452058,
      "title": "Show HN: www.instanote.io – notes in a simple chat interface",
      "type": "story"
    }
  ]
}