{
  "stories": [
    {
      "by": "rjzzleep",
      "descendants": 0,
      "id": 30936943,
      "score": 1,
      "time": 1649275951,
      "title": "Foxconn adopts domestic lithography machine on a large scale",
      "type": "story",
      "url": "https://inf.news/en/tech/79b369a35ddd179ee094e63dfd2c8d84.html"
    },
    {
      "by": "abracadaniel",
      "descendants": 0,
      "id": 30936914,
      "score": 1,
      "time": 1649275766,
      "title": "Fabric conditioners reduce the release of microfibres in tumble dryers",
      "type": "story",
      "url": "https://www.newscientist.com/article/2315198-fabric-conditioners-reduce-the-release-of-microfibres-in-tumble-dryers/"
    },
    {
      "by": "petercooper",
      "descendants": 0,
      "id": 30936873,
      "score": 1,
      "time": 1649275488,
      "title": "Sierra Flashback with Ken and Roberta Williams [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=LAemLilaNjk"
    },
    {
      "by": "mordechai9000",
      "descendants": 0,
      "id": 30936862,
      "score": 1,
      "time": 1649275439,
      "title": "Conversations with a Killer",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/1994/04/18/conversations-with-a-killer"
    },
    {
      "by": "kelseyfrog",
      "descendants": 0,
      "id": 30936856,
      "score": 1,
      "time": 1649275404,
      "title": "Speech2Face: Learning the Face Behind a Voice(2019)",
      "type": "story",
      "url": "https://speech2face.github.io/"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 30936848,
      "score": 3,
      "time": 1649275363,
      "title": "Intel suspends all operations in Russia “effective immediately”",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/04/intel-suspends-business-operations-in-russia-over-ukraine-war/"
    },
    {
      "by": "tma",
      "descendants": 0,
      "id": 30936844,
      "score": 2,
      "text": "Hi HN!<p>Over the past year, we’ve been building Wealthly (<a href=\"https:&#x2F;&#x2F;wealthly.com\" rel=\"nofollow\">https:&#x2F;&#x2F;wealthly.com</a>), a tool to help you aggregate all your investments, and a community of investors who are sharing their portfolios and knowledge.<p>I started working on this idea because I had two personal frustrations:<p>1. I had a few different brokerage accounts, some retirement accounts, and a little crypto all in different places. It was hard to get a glance of everything I had. I tried all the products in the market, and they all had various issues (poor data quality, constant disconnect, didn’t support options, etc)\n2. I learned a great deal about investing from other people online, but I always wanted to see where people actually put their money. I needed the transparency because it gave me a sense of comfort and trust<p>We’ve slowly built up a small group of users who have connected close to $18M of live assets. We’re hoping that the HN community will find a tool and a community like this useful!<p>I think whenever a product like this shows up, the number one thing people get most concerned with is always security and are you scraping brokerages for data. Unfortunately we don’t have a magic bullet around this issue in the US. We use the brokerages’ official OAuth APIs whenever we can, and resort to scraping when we’re forced to with no other solutions.<p>To address the security and privacy concerns people have, we are also thinking about open sourcing our connectors, and creating a desktop app where all your data is stored locally instead of in the cloud.<p>We haven’t opened up sign ups yet, but you can join with this invite link: <a href=\"https:&#x2F;&#x2F;join.wealth.ly&#x2F;4WFYJ3\" rel=\"nofollow\">https:&#x2F;&#x2F;join.wealth.ly&#x2F;4WFYJ3</a>.<p>Would love to hear any feedback!<p>This is my personal portfolio: <a href=\"https:&#x2F;&#x2F;wealth.ly&#x2F;@sunny\" rel=\"nofollow\">https:&#x2F;&#x2F;wealth.ly&#x2F;@sunny</a>",
      "time": 1649275339,
      "title": "Show HN: I built a tool to aggregate your investments and follow other investors",
      "type": "story",
      "url": "https://www.wealthly.com:443/"
    },
    {
      "by": "leetthrowaway",
      "descendants": 0,
      "id": 30936833,
      "score": 1,
      "text": "This is all pretty new to me. Been at the same place for over a decade, but figured working on my chops would be good. So I made an account, picked a &quot;medium&quot; exercise at random, and started working on it.<p>It probably took me 2 full hours, and I only got it with a brute force approach and a butt-load of optimization to make it efficient later.<p>So, anyway, then I go to the discussion tab, and that&#x27;s where everyone is chatting about this really cool, elegant, O(n) solution. But it&#x27;s the kind of thing you would see in a CS textbook, not just come up with on your own. And I didn&#x27;t see any proofs, so I still don&#x27;t know that it _really_ works. But I do see lots of examples of exactly how to implement it.<p>My question is; what&#x27;s the point then? Are you supposed to not look at the discussion and beat your head against the wall trying to best Donal Knuth, or do you look at the discussion and then just copy it all over with your brain totally turned off? I don&#x27;t get it.<p>Oh, here it is, in case anyone is wondering:<p>https:&#x2F;&#x2F;leetcode.com&#x2F;problems&#x2F;container-with-most-water&#x2F;",
      "time": 1649275293,
      "title": "Ask HN: How are you supposed to use LeetCode?",
      "type": "story"
    },
    {
      "by": "vigilantangel",
      "descendants": 0,
      "id": 30936832,
      "score": 1,
      "time": 1649275293,
      "title": "What Is Quantum Computing",
      "type": "story",
      "url": "https://bytesanddollars.com/how-to/quantum-computing/what-is-quantum-computing/"
    },
    {
      "by": "Tevias",
      "descendants": 0,
      "id": 30936796,
      "score": 2,
      "time": 1649275106,
      "title": "40 Favorite Interview Questions from Some of the Sharpest Folks We Know",
      "type": "story",
      "url": "https://review.firstround.com/40-favorite-interview-questions-from-some-of-the-sharpest-folks-we-know"
    }
  ]
}