{
  "stories": [
    {
      "by": "joeyespo",
      "descendants": 0,
      "id": 29408587,
      "score": 1,
      "time": 1638389654,
      "title": "Using ChatOps to help Actions on-call engineers",
      "type": "story",
      "url": "https://github.blog/2021-12-01-using-chatops-to-help-actions-on-call-engineers/"
    },
    {
      "by": "infinity0",
      "descendants": 0,
      "id": 29408586,
      "score": 1,
      "time": 1638389642,
      "title": "Computer-Designed Organisms",
      "type": "story",
      "url": "https://cdorgs.github.io/"
    },
    {
      "by": "animalcule",
      "descendants": 0,
      "id": 29408567,
      "score": 2,
      "time": 1638389526,
      "title": "The Universal Structure of Storytelling",
      "type": "story",
      "url": "https://quillette.com/2021/11/29/the-universal-structure-of-storytelling/"
    },
    {
      "by": "julienkervizic",
      "descendants": 0,
      "id": 29408563,
      "score": 1,
      "time": 1638389519,
      "title": "Scaling with Pandas beyond the millions (of records)",
      "type": "story",
      "url": "https://medium.com/analytics-and-data/scaling-with-pandas-beyond-the-millions-of-records-192b6a9a7bef"
    },
    {
      "by": "upwardbound",
      "descendants": 0,
      "id": 29408559,
      "score": 1,
      "text": "I had an idea and wanted to post it here so some people will read it and maybe someday someone might build this or something similar!  As you probably know, a common sci-fi trope is the idea of using quantum entangled particle pairs to transmit information faster than light; however, in the real world, this is impossible, due to the No-Communication Theorem: https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;No-communication_theorem<p>Quantum entanglement &quot;synchronizes state&quot; faster than light, but cannot transmit information because that state is not able to be chosen, influenced, or controlled.  It is read-only.  The value is random, and read-only, but is guaranteed to be synchronized between both sides of the link, and that synchronization happens faster-than-light.  So it&#x27;s like a shared, random, read-only constant, whose state is the same everywhere despite lightspeed limits.<p>I realized that this could be utilized by people in multiple star systems to have a shared base of TV shows, movies, novels, video games, etc. that get distributed to everyone at the same time.  (By &quot;same time&quot; I mean in the reference frame of our galaxy.)  Here&#x27;s the idea:<p>Well before we&#x27;re able to send people to other stars, we&#x27;ll almost certainly be able to use systems like GPT-3 to auto-generate TV shows, movies, novels, video game levels, and other works of fiction.  My idea is to use quantum entangled particles to form a shared random seed that is the same at each star system.  Each month, every planetary civilization should &quot;open&quot; the random seed for that month.  At the same time, all the other planetary civilizations will open that month&#x27;s seed as well.  And they will all see the same value.  That value will be used as the seed to generate that month&#x27;s TV shows, movies, etc.<p>I fully understand that the quantum aspects here are superfluous.  It would be completely possible for each month&#x27;s random seed to just be hardcoded numbers specified in advance, and that would also be synchronized between all worlds.  But where&#x27;s the fun in that?  I figure that people will still want novelty, and they will still want each month&#x27;s TV shows and movies to feel new.  If the seeds were all hardcoded in advance, they wouldn&#x27;t have that novelty factor.  By using quantum entanglement in the manner I describe, the TV shows and movies are truly created anew that very same month that they are released - and due to the synchronization scheme, everyone in the galaxy can view the same TV and movies that same month without lightspeed delays.<p>The Milky Way Galaxy is about 100,000 light-years across!  At that size, it&#x27;s not realistic to have real-time conversations.  Even if we extend human lifespans to billions of years, communication will be more like email or snail mail than anything else.  Having a scheme like the one I propose would allow for the real-time sharing of certain aspects of culture without these delays.  If you have a buddy on the other side of the Galaxy, you can watch your favorite TV shows together on the same day, and you can picture their reactions when you see a joke you know they&#x27;re laughing at.  It&#x27;s a way of being together even across the limits of time.",
      "time": 1638389501,
      "title": "Tell HN: Idea for FTL Sharing of Film / TV / etc. in a Galactic Civilization",
      "type": "story"
    },
    {
      "by": "willk",
      "descendants": 0,
      "id": 29408556,
      "score": 1,
      "time": 1638389473,
      "title": "Advent of Cyber",
      "type": "story",
      "url": "https://tryhackme.com/room/adventofcyber3"
    },
    {
      "by": "exolymph",
      "descendants": 0,
      "id": 29408547,
      "score": 1,
      "time": 1638389427,
      "title": "Crypto-Savvy Gifts for the Holiday Season",
      "type": "story",
      "url": "https://blog.hedgehog.app/crypto-gift-guide/"
    },
    {
      "by": "michaelsbradley",
      "descendants": 1,
      "id": 29408542,
      "kids": [
        29408566
      ],
      "score": 1,
      "time": 1638389391,
      "title": "Dobbs vs. Jackson Women's Health Organization Oral Argument",
      "type": "story",
      "url": "https://www.c-span.org/video/?516168-1/dobbs-v-jackson-womens-health-organization-oral-argument"
    },
    {
      "by": "mitar",
      "descendants": 1,
      "id": 29408539,
      "kids": [
        29408540
      ],
      "score": 1,
      "time": 1638389385,
      "title": "Github.com/pkg/errors just got archived, I made a maintained v2 with many fixes",
      "type": "story",
      "url": "https://gitlab.com/tozd/go/errors"
    },
    {
      "by": "gbrown_",
      "descendants": 0,
      "id": 29408538,
      "score": 1,
      "time": 1638389372,
      "title": "RankNTypes via Lambda Calculus",
      "type": "story",
      "url": "https://www.parsonsmatt.org/2021/11/30/rank_n_types_via_lambda_calculus.html"
    }
  ]
}