{
  "stories": [
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31621900,
      "score": 1,
      "time": 1654358305,
      "title": "Heightened dream recall linked to increased creativity",
      "type": "story",
      "url": "https://www.psypost.org/2022/05/heightened-dream-recall-ability-linked-to-increased-creativity-and-functional-brain-connectivity-63139"
    },
    {
      "by": "dguo",
      "descendants": 0,
      "id": 31621893,
      "score": 1,
      "time": 1654358281,
      "title": "How to Use Tasker to Block Spam Phone Calls from a Certain Area Code on Android",
      "type": "story",
      "url": "https://www.dannyguo.com/blog/how-to-use-tasker-to-block-spam-phone-calls-from-a-certain-area-code-on-android/"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 31621891,
      "score": 1,
      "time": 1654358275,
      "title": "Elon Musk says Tesla’s fake robot might be ready by September 30th",
      "type": "story",
      "url": "https://www.theverge.com/2022/6/3/23153047/tesla-robot-prototype-elon-musk-ai-day-fake"
    },
    {
      "by": "jamesofthedrum",
      "descendants": 0,
      "id": 31621857,
      "score": 2,
      "text": "TL;DR: A previously unknown man-made cave from the Viking era has been excavated in Iceland. Man-made caves in the region were first found in 2018, but the latest discovery was a much larger cave connected to the wider cave system. The cave may have served as a stall for cattle and horses.<p>https:&#x2F;&#x2F;www.heritagedaily.com&#x2F;2022&#x2F;05&#x2F;man-made-viking-era-cave-discovered-in-iceland&#x2F;143731",
      "time": 1654358113,
      "title": "Man-made Viking-era cave discovered in Iceland",
      "type": "story"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31621856,
      "score": 1,
      "time": 1654358110,
      "title": "Gas station bathrooms weren't always gross. They used to be kept pristine",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_ca54e5b538dcf2781afcc2f0bd7180ec"
    },
    {
      "by": "saadalem",
      "descendants": 0,
      "id": 31621780,
      "score": 1,
      "text": "could be anything",
      "time": 1654357817,
      "title": "Ask HN: What are the changes you made in your life and never look back?",
      "type": "story"
    },
    {
      "by": "croes",
      "descendants": 0,
      "id": 31621769,
      "score": 1,
      "time": 1654357790,
      "title": "Reports show scammers cashing in on crypto craze",
      "type": "story",
      "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/06/reports-show-scammers-cashing-crypto-craze"
    },
    {
      "by": "hsnewman",
      "descendants": 0,
      "id": 31621717,
      "score": 2,
      "time": 1654357541,
      "title": "Doom Port Released as BIOS Payload",
      "type": "story",
      "url": "https://www.tomshardware.com/news/doom-port-released-as-bios-payload"
    },
    {
      "by": "rdpintqogeogsaa",
      "descendants": 0,
      "id": 31621702,
      "score": 1,
      "time": 1654357481,
      "title": "Boot drive encryption security on Windows",
      "type": "story",
      "url": "https://threedots.ovh/blog/2022/06/boot-drive-encryption-security-on-windows/"
    },
    {
      "by": "matthewtoast",
      "descendants": 0,
      "id": 31621689,
      "score": 1,
      "text": "Lorblets is a little puzzle game I made: https:&#x2F;&#x2F;www.lorblets.com&#x2F;<p>Lorblets is a variation on Lights Out. The goal of Lorblets is to turn ON all the lights. Unlike Lights Out (typically a grid of black and white squares), Lorblets puzzles have complex shapes (and bright colors!). The puzzles in Lorblets are generated at random from a seed, and they grow in size as you progress.<p>The code quality is...not great? The design leaves something to be desired. And the game itself is a bit derivative. So why am I sharing this? Because I want to celebrate having shipped a complete game - modest though it may be.<p>I&#x27;m a 39yo who has long dreamt of one day making a game. And yet I&#x27;ve tended to put my software engineering skills to work doing everything except that. I&#x27;ve devised complicated game mechanics on paper. I&#x27;ve written multiple overly complicated game &quot;engines&quot; in JavaScript. I&#x27;ve daydreamed for countless hours about my magnum opus: a 3D simulated open world with a natural language interface, narrative generation, character customization, scene building tools, a modding system... Long story short, that magnum opus has been fun to tinker on, but has not amounted to much beyond the spinning of wheels and the occupation of my free time.<p>So over the Memorial Day holiday I decided to force myself to complete one game before the weekend was over. I would conceive the simplest possible game mechanic and UI. I would not worry if it was unoriginal. I would resist the urge to add complexity. I would not get bogged down standing up a framework. I would not build an &quot;engine.&quot; I would not worry about clean code, or maintainability, or even performance. I would use the tech stack that I could work fastest in: web tech. And I would not worry that the astral projection of Jonathan Blow would visit me at night and chide me for having made a badly performing web browser game.<p>So, Lorblets is the result. Whatever one might say about it, it IS a game, and that&#x27;s something. Feedback is welcome of course - but I mostly just wanted to share my story with y&#x27;all.",
      "time": 1654357425,
      "title": "Show HN: Lorblets, a Little Puzzle Game",
      "type": "story"
    }
  ]
}