{
  "stories": [
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 32110250,
      "score": 1,
      "time": 1657904387,
      "title": "London braces for first-ever extreme heat red warning",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/15/world/uk-heat-red-warning-record-climate/index.html"
    },
    {
      "by": "unknownsky",
      "descendants": 0,
      "id": 32110248,
      "score": 1,
      "text": "As a junior, I had one job years ago where I had an opportunity to see a small business&#x27;s work process. I immediately saw things that could be automated and so-called &quot;pain points&quot; that could be improved with software. I opened up Balsamiq, sketched up a sample of software that would solve their problems and presented it to them. They loved my ideas and paid my employer to have me make them. They were thrilled with the result and I even heard through the grapevine how much it had helped them long after I had left that company.<p>Years later, I&#x27;m now a senior developer. Except for that one job, my whole career has been developing a carefully refined backlog of features that are handed to me. I get to use creativity and problem-solving for technical problems, but I keep thinking wistfully back to that one junior job where I got to come up with ideas for the software and features themselves.<p>I don&#x27;t know how to get an opportunity like that again. How would I convince a small business to let me come in and spy on their work processes so I can pitch them ideas to let me build something that would improve them? Has anyone successfully found their way in to do this?",
      "time": 1657904378,
      "title": "Ask HN: How can you convince companies to open up to you about pain points?",
      "type": "story"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 32110230,
      "score": 1,
      "time": 1657904297,
      "title": "The Correlation",
      "type": "story",
      "url": "https://seths.blog/2022/07/the-correlation/"
    },
    {
      "by": "LeoPanthera",
      "descendants": 0,
      "id": 32110216,
      "score": 1,
      "time": 1657904235,
      "title": "Ongoing issue with indexing in Google Search",
      "type": "story",
      "url": "https://twitter.com/googlesearchc/status/1547956833561694209"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 32110200,
      "score": 1,
      "time": 1657904152,
      "title": "Black Wealth Could Be on the Rise with Progressive Cryptocurrency Investors",
      "type": "story",
      "url": "https://www.nasdaq.com/articles/black-wealth-could-be-on-the-rise-with-progressive-cryptocurrency-investors"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 32110191,
      "score": 1,
      "time": 1657904095,
      "title": "The War Economy",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/the-war-economy"
    },
    {
      "by": "macbookaries",
      "descendants": 0,
      "id": 32110182,
      "score": 2,
      "time": 1657904043,
      "title": "The Festival Wristband That Monitors Your Drinking",
      "type": "story",
      "url": "https://www.globenewswire.com/news-release/2022/07/14/2480095/0/en/The-Festival-Wristband-That-Monitors-Your-Drinking-Karhu-Lickalyzer.html"
    },
    {
      "by": "tboyd47",
      "descendants": 0,
      "id": 32110172,
      "score": 2,
      "text": "HN crowd, have you ever sought to rent co-working space at an unconventional place of business, like a car dealership, restaurant, or hair salon?<p>I am relocating to a new area soon and I prefer not to work in typical co-working hubs like WeWork due to, let&#x27;s say, bad culture fit. Has anyone had success renting a desk or small office from a business that doesn&#x27;t normally host programmers? Whom did you rent from, and how did you pull it off?<p>I&#x27;m looking for ideas.<p>Thanks!",
      "time": 1657903984,
      "title": "Ask HN: Unconventional places of business to rent a desk?",
      "type": "story"
    },
    {
      "by": "StephanStS",
      "descendants": 0,
      "id": 32110141,
      "score": 2,
      "text": "About an article from “The Runner Newspaper”: Learn how DietPi easily solves your privacy issues.<p>https:&#x2F;&#x2F;dietpi.com&#x2F;blog&#x2F;?p=703",
      "time": 1657903846,
      "title": "Self-Hosting and reducing information to Google: Why should you use DietPi?",
      "type": "story"
    },
    {
      "by": "pzrsa",
      "descendants": 0,
      "id": 32110101,
      "score": 1,
      "time": 1657903635,
      "title": "MechKeebs",
      "type": "story",
      "url": "https://parsam.io/articles/mechkeebs"
    }
  ]
}