{
  "stories": [
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28247459,
      "score": 1,
      "time": 1629474887,
      "title": "From Father to Son, Last Words to Live by (2007)",
      "type": "story",
      "url": "https://www.nytimes.com/2007/01/01/us/01charles.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28247432,
      "score": 1,
      "time": 1629474767,
      "title": "The Ruin of War",
      "type": "story",
      "url": "https://acoup.blog/2021/08/20/collections-teaching-paradox-victoria-ii-part-ii-the-ruin-of-war/"
    },
    {
      "by": "guard0g",
      "descendants": 0,
      "id": 28247425,
      "score": 1,
      "time": 1629474747,
      "title": "Hero – HeathKit's Robot from the 1980's",
      "type": "story",
      "url": "https://www.robotworkshop.com/robotweb/?page_id=174"
    },
    {
      "by": "tosh",
      "descendants": 0,
      "id": 28247405,
      "score": 1,
      "time": 1629474646,
      "title": "ScaleFX: RetroArch upscaling shader beats even xBRZ",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=PdJXYA8Wmj4"
    },
    {
      "by": "mortenjorck",
      "descendants": 0,
      "id": 28247392,
      "score": 1,
      "time": 1629474577,
      "title": "Apple's Past Sideloading Plans",
      "type": "story",
      "url": "https://www.macrumors.com/2021/08/20/apple-sideloading-plans-ecosystem-lock-in-revealed/"
    },
    {
      "by": "davidajackson",
      "descendants": 0,
      "id": 28247388,
      "score": 1,
      "text": "It seems like nowadays from the candidate side there are questions repeatedly being asked at the beginning of the jobs process, like:<p>Is this position remote?\nWhat is the salary range?<p>Lots of recruiters try to avoid answering these up front. Even something like a simply Google form just to screen recruiters reaching out.",
      "time": 1629474547,
      "title": "Ask HN: Would you use a form that lets companies contact you?",
      "type": "story"
    },
    {
      "by": "rblack44",
      "descendants": 2,
      "id": 28247379,
      "kids": [
        28247466,
        28247436,
        28247440
      ],
      "score": 4,
      "text": "Hi, we&#x27;re Andres and Ryan, the founders of Ancana (<a href=\"https:&#x2F;&#x2F;en.ancana.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;en.ancana.co&#x2F;</a>). Ancana is a marketplace for buying fully managed vacation homes through fractional ownership.<p>Demand for vacation homes has driven up their price, putting these properties out of reach for most buyers, who only plan to use the home a few weeks a year. This pushes many people into timeshares, which are notorious for hidden fees, pushy sales tactics, and difficulty to sell. With Ancana, you can own a 1&#x2F;4 or 1&#x2F;8 share of the home and split expenses with the other co-owners. If you buy a 1&#x2F;4 share of a home, you have access to it for 3 months of the year. For each property we set up the investment trust, find qualified co-owners, and handle the entire real estate purchase transaction. Costs are split amongst the co-owners, and we take care of the furnishing and ongoing property management.<p>We accomplish this by creating an investment trust for each property and dividing it into individual, purchasable shares that represent ownership in the property. We furnish each home and find and vet the co-owners. Once all of the shares of the property are sold, we retain no ownership stake in the property and transition into the role of property manager, ensuring the home is well maintained and handling any issues that arise. Unlike a timeshare, Ancana owners own a real asset (the property) versus a block of time. If you decide you want to sell your share, you are free to do so at any time, either through us or on the open market, and capture any appreciation the property has accrued.<p>Once you own one of these homes, our goal is to make scheduling visits to the property as easy and equitable as possible. Our scheduling system breaks a 12-month booking window into &quot;high-demand&quot; dates&#x2F;seasons and &quot;general&quot; stays. Each co-owner selects 1 high-demand date before additional bookings are permitted. Priority order is determined by the owner&#x27;s purchase date (1st buyer gets 1st choice, 2nd buyer gets 2nd choice, etc), with the order rotating each year (2nd buyer gets 1st selection in year 2, 3rd buyer gets 1st selection in year 3, etc.). Outside of the initial high-demand selection process, co-owners are free to book the property anywhere from 2 days to 12-months in advance, up to their allotted days per year.<p>We&#x27;d love to speak to any of you that are curious about fractional ownership or have any ideas for where we should go next or how to improve our offering!",
      "time": 1629474503,
      "title": "Launch HN: Ancana (YC S21) – Fractional ownership of vacation homes",
      "type": "story"
    },
    {
      "by": "app4soft",
      "descendants": 0,
      "id": 28247359,
      "score": 2,
      "time": 1629474379,
      "title": "KnotEditor – a tool for drawing 2D diagrams, 3D knots and Seifert surfaces",
      "type": "story",
      "url": "https://github.com/geometer/KnotEditor"
    },
    {
      "by": "mrfusion",
      "descendants": 0,
      "id": 28247355,
      "score": 1,
      "time": 1629474378,
      "title": "SpaceX Starlink satellite internet new capabilities, Starship launch",
      "type": "story",
      "url": "https://www.cnbc.com/2021/08/19/spacex-starlink-satellite-internet-new-capabilities-starship-launch.html"
    },
    {
      "by": "jbrot",
      "descendants": 0,
      "id": 28247351,
      "score": 1,
      "time": 1629474369,
      "title": "Physicists Probe the Size Limits of the Quantum World",
      "type": "story",
      "url": "https://www.quantamagazine.org/how-big-can-the-quantum-world-be-physicists-probe-the-limits-20210818/"
    }
  ]
}