{
  "stories": [
    {
      "by": "agomez314",
      "descendants": 0,
      "id": 28197591,
      "score": 1,
      "text": "Highly enjoyed this previous post on empirical evidence available for dev practices (https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28178257)<p>This made me start thinking about my own practices, and what processes I could adopt to improve. What suggestions do you have where I can adopt the scientific method to my daily coding, research and software architecting work?",
      "time": 1629119420,
      "title": "Ask HN: How can I use the scientific method to write better code?",
      "type": "story"
    },
    {
      "by": "HiroProtagonist",
      "descendants": 0,
      "id": 28197573,
      "score": 1,
      "time": 1629119273,
      "title": "Fecal transplants reverse aging in brains of old mice",
      "type": "story",
      "url": "https://www.freethink.com/health/reverse-aging"
    },
    {
      "by": "saradhi",
      "descendants": 0,
      "id": 28197548,
      "score": 1,
      "text": "I am checking to see if the organizations would be interested in paying a premium for 100% accurate data extraction from an image or a PDF page? On average, the starting salary of a data entry operator in the US is 28,000 USD&#x2F;year or 15$&#x2F;hour or 0.23$&#x2F;minute. An error correction will take 140 seconds on average to verify an A4-sheet text data or 10-row x 5-column table data that accounts for 0.5$&#x2F;page. While tons of OCR services claim the best accuracy in character recognition, there is no 100% guarantee. For sensitive data systems, maybe in financial or medical data extraction companies, would you prefer to pay 0.5-1$ USD&#x2F;page for a guaranteed 100% accuracy?",
      "time": 1629119110,
      "title": "Ask HN: Do you pay a premium for 100% data extraction accuracy?",
      "type": "story"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 28197545,
      "score": 1,
      "time": 1629119091,
      "title": "Simon Wardley on Mapping Our Way to a Common Language",
      "type": "story",
      "url": "https://thenewstack.io/simon-wardley-on-mapping-our-way-to-a-common-language/"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 28197541,
      "score": 1,
      "time": 1629119062,
      "title": "Canada's rapid expansion of the cannabis retail market",
      "type": "story",
      "url": "https://pubmed.ncbi.nlm.nih.gov/34250645/"
    },
    {
      "by": "MahyadGhassemi",
      "descendants": 0,
      "id": 28197537,
      "score": 3,
      "text": "Hey everyone Mahyad from SigmaOS(<a href=\"https:&#x2F;&#x2F;sigmaos.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sigmaos.com</a>) here, a pleasure to meet all of you. SigmaOS is a new type of browser, designed to make you better and faster working on the web.<p>If you’re anything like us, you work hours a day on the web, buried in a sea of tabs and web apps, constantly losing context and always one click away from being distracted. We believe that a radically different UX can help with this and that’s what we’re making. Here’s a demo video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ae_XfTSsaAA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ae_XfTSsaAA</a>.<p>This project is the overlap of our obsessions. I have always been obsessed with organizing because of my ADHD, and became a power user of software that could organize and clean up my workflow, like Superhuman and Notion. I was frustrated by how cluttered my desktop was with irrelevant Safari windows and tabs that I didn&#x27;t need for my work right then. Also, I always felt overwhelmed by the constant switching of windows and apps to save information I was finding or send stuff to people I was working with. This led to the idea: what if there could be a much more organized browser, and you could easily access any app or tab or note directly from within the browser without needing to change to a different window?<p>Ali has always been into neo-browsers. Rockmelt (released when he was 11) was the first piece of software he deeply cared about and referred his friends to. Since Rockmelt&#x27;s shutdown, multiple different neo-browsers came out, but none were as mind-blowing to him. He is also a power user of Photoshop and loves their single-key keyboard shortcuts. Saurav rarely cares about software but is a massive Vim fan. He is obsessed with how fast and powerful Vim makes him at text-editing.  So, if you think Rockmelt crossed with Notion crossed with Vim, that’s basically what we’re working on :)<p>SigmaOS users create workspaces that hold apps and pages related to a project or task. We present those apps and pages in a list format. Users have 3 main actions to go through tasks quickly: they can mark a page as done, snooze a page when they don&#x27;t need it right away, and move a page once it is no longer required for that task but maybe for some other one.<p>We help solve the problem of information loss and overload with our search tool called Lazy Search. You can quickly find pages in your history and already-open pages across workspaces. This makes it easier to find anything you have opened or searched before and navigate to it quickly.<p>We have a split-screen feature to quickly open a second webpage, for example for a quick new search you want to do or multitask by working on two pages at a time. This cuts down on opening unnecessary tabs and navigating away from what you are focused on.<p>One of the most straightforward but also most powerful aspects of SigmaOS that we’ve put a ton of thought into, is an intuitive and easy-to-learn repertoire of keyboard shortcuts for all the most-used commands and actions. This makes you a lot faster at your work on the web and feels like the other tools (cf. Vim above) that you’re traditionally productive in.<p>SigmaOS connects your web apps and your browsing activity to understand the context around your actions and searches. Your information is organized by projects, your work is shareable and collaborative, and information retrieval feels effortless. We charge $15 per month, no ads, and no data monetization.<p>Thanks for taking the time to read our post. We appreciate any and all feedback on what you think is the best thing about SigmaOS and what might not be so great. Please download SigmaOS from our website and give it a try yourself and let us know what you think here :)",
      "time": 1629119031,
      "title": "Launch HN: SigmaOS (YC S21) – A web browser designed for faster work",
      "type": "story"
    },
    {
      "by": "fernand0moreira",
      "descendants": 1,
      "id": 28197531,
      "kids": [
        28197532
      ],
      "score": 1,
      "time": 1629118995,
      "title": "Crypto for Beginners",
      "type": "story",
      "url": "https://www.fernandomoreira.me/crypto-for-beginners/"
    },
    {
      "by": "chha",
      "descendants": 1,
      "id": 28197502,
      "kids": [
        28197504
      ],
      "score": 1,
      "time": 1629118805,
      "title": "Antigravity.py",
      "type": "story",
      "url": "https://github.com/python/cpython/blob/main/Lib/antigravity.py"
    },
    {
      "by": "ubuwaits",
      "descendants": 0,
      "id": 28197482,
      "score": 1,
      "time": 1629118672,
      "title": "Why Is It So Hard to Be Rational?",
      "type": "story",
      "url": "https://www.newyorker.com/magazine/2021/08/23/why-is-it-so-hard-to-be-rational"
    },
    {
      "by": "thunderbong",
      "descendants": 0,
      "id": 28197460,
      "score": 5,
      "time": 1629118528,
      "title": "Costs of the Afghanistan War, in Lives and Dollars",
      "type": "story",
      "url": "https://www.usnews.com/news/politics/articles/2021-08-14/costs-of-the-afghanistan-war-in-lives-and-dollars"
    }
  ]
}