{
  "stories": [
    {
      "by": "tinktank",
      "descendants": 0,
      "id": 29847344,
      "score": 1,
      "text": "The headline is a little click-bait, humor me.<p>I&#x27;m 39, have a PhD in CS from an older university in Cambridge, MA (not MIT).  When there, I never published much, a couple of top-tier publications with collaborators and a ton of mid-tier publications.<p>I spent 7 years as a Post Doc doing research in an area which I didn&#x27;t care about and where there wasn&#x27;t a lot of scope. In this time I graduated 7 students (who have gone on Facebook, Google, etc) and started two companies -- a direct one which I shut down because it was not successful and helped a friend to start his as co-owner but didn&#x27;t put in any intellectual development. I did a lot of contracting and consulting work for a company my PhD external supervisor started that makes a niche MIPS CPU but doing software work at the kernel&#x2F;application layer.<p>3 years ago I joined the company full-time.  I got the job because he knew me and we are friends (I am absolutely convinced I would have failed an interview). The agreement was I&#x27;d do system architecture for hardware.<p>I was in a world I knew very little about. CPUs are complex hardware devices.  While I had done Computer Architecture and am very comfortable with the hardware as seen from a software level, I started spending my time doing more hardware system architecture work.<p>I love this field.  The challenge means it&#x27;s satisfying.  I wish I&#x27;d done a degree in CE instead.<p>Three years on, I&#x27;m having a hard hard time.  The problems are:<p>* I don&#x27;t know enough -- every time we have a meeting or a new project comes up, it&#x27;s like drinking from a firehose.  PCIe, Memory technologies, the internals of ALUs, caching subsystems -- all of it is a field in and of itself. The complexity and runes and domain specific knowledge means I&#x27;m always running behind never able to quite keep up. Even where I have done things before things move fast so keeping up is hard.<p>* I can&#x27;t think fast enough -- I&#x27;m actually known as &quot;recorder&quot; in the organization -- I record all meetings and go back and listen to them, trying to understand, stopping, taking notes, researching so I can actually follow what&#x27;s going on.  This helps but is hard.<p>* I have a different style of working -- company style is to come into a meeting and freestyle, throw up ideas, brainstorm, etc.  I can&#x27;t do that.  I don&#x27;t know enough and can&#x27;t contribute because most times I only know about half of what is going on.  I am able to come up with solutions and designs alone but I am slower because I alone, learn, design and get feedback afterwards.<p>* My instincts are wrong --  My dimensioning, calculations, core design principles often overlook something or are just not right.  It&#x27;s to be so OBVIOUSLY wrong. At least when it&#x27;s pointed out most times I see it immediately.<p>* Don&#x27;t have the detail -- Not understanding the runes or not following through on all the possible side-effects that may happen mean things can never work. I just delayed tape-out because one return value was 2b offset between busses.<p>* Can&#x27;t seem to abstract and think clearly -- I can&#x27;t seem to reason about cause and effect clearly enough.  In software I felt I always had a good working model in my head.  Here it&#x27;s just gaps.<p>I desperately want to get good the art.  I stay because it&#x27;s a challenge but I feel thick.  I&#x27;m wondering whether I&#x27;ll actually become good enough to be comfortable and master this.<p>A part of me wants to quit and go join the platforms division of some company or the other but  I kind of feel I&#x27;m likely to see the same things in software even if I think I&#x27;m better at it.  Ultimately I&#x27;m not sure if I&#x27;m just not clever enough .  I just spent the holiday break reading a 1000 page architectural standard to come into the new year prepared, spent this week in a workshop where I just couldn&#x27;t keep up even with the prep and am deflated and disillusioned.<p>What advice would you give me?",
      "time": 1641603508,
      "title": "Ask HN: Am I thick? What advice would you give me?",
      "type": "story"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 29847342,
      "score": 1,
      "time": 1641603494,
      "title": "China's $1T 'artificial sun' fusion reactor is five times hotter than the sun",
      "type": "story",
      "url": "https://www.livescience.com/chinas-1-trillion-artificial-sun-fusion-reactor-just-got-five-times-hotter-than-the-sun"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 29847240,
      "score": 3,
      "time": 1641602877,
      "title": "Snap suing to trademark the word ‘spectacles’ for its smart glasses",
      "type": "story",
      "url": "https://www.theverge.com/2022/1/6/22870120/snap-suing-trademark-word-spectacles-smart-glasses-snapchat"
    },
    {
      "by": "blewboarwastake",
      "descendants": 0,
      "id": 29847237,
      "score": 1,
      "time": 1641602852,
      "title": "Nooscope: A Diagram of Machine Learning Errors, Biases and Limitations (2020)",
      "type": "story",
      "url": "https://nooscope.ai/"
    },
    {
      "by": "hirihoto",
      "descendants": 0,
      "id": 29847217,
      "score": 1,
      "time": 1641602659,
      "title": "Golang Macros – An Exploration",
      "type": "story",
      "url": "https://deathbykeystroke.com/articles/20220106-real-macros-in-go.html"
    },
    {
      "by": "type0",
      "descendants": 0,
      "id": 29847201,
      "score": 3,
      "time": 1641602570,
      "title": "Feds sue auto repair shop that paid former employee in pennies",
      "type": "story",
      "url": "https://www.nbcnews.com/news/feds-sue-auto-repair-shop-paid-former-employee-pennies-rcna11339"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 29847194,
      "score": 2,
      "time": 1641602524,
      "title": "Learn Curl",
      "type": "story",
      "url": "https://letterstoanewdeveloper.com/2021/06/21/learn-curl/"
    },
    {
      "by": "ajankelo",
      "descendants": 0,
      "id": 29847191,
      "score": 1,
      "text": "Wordle is a very cool game, though the solution to the puzzles is stored in local storage, under the key Game State",
      "time": 1641602511,
      "title": "Solution to Wordle Can Be Found in Local Storage – Game State",
      "type": "story"
    },
    {
      "by": "bkudria",
      "descendants": 0,
      "id": 29847167,
      "score": 1,
      "time": 1641602344,
      "title": "A potential escape from Roko’s basilisk",
      "type": "story",
      "url": "https://interconnected.org/home/2022/01/07/basilisk"
    },
    {
      "by": "enigmatic02",
      "descendants": 0,
      "id": 29847139,
      "score": 1,
      "time": 1641602192,
      "title": "Five Timeless Lessons",
      "type": "story",
      "url": "https://www.productlessons.xyz//article/timeless-lessons-amazon-unbound-book"
    }
  ]
}