{
  "stories": [
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29953842,
      "score": 1,
      "time": 1642313711,
      "title": "Python on z/OS – creating a C extension",
      "type": "story",
      "url": "https://colinpaice.blog/2022/01/15/python-on-z-os-creating-a-c-extension/"
    },
    {
      "by": "viebel",
      "descendants": 0,
      "id": 29953822,
      "score": 1,
      "time": 1642313378,
      "title": "Eloquent JavaScript",
      "type": "story",
      "url": "https://eloquentjavascript.net/"
    },
    {
      "by": "olegious",
      "descendants": 0,
      "id": 29953819,
      "score": 12,
      "time": 1642313335,
      "title": "I sent my boyfriend a picture of a storm. He got one of a woman and a dog",
      "type": "story",
      "url": "https://old.reddit.com/r/nonmurdermysteries/comments/s549b4/i_sent_my_boyfriend_a_picture_of_a_storm_he_got/"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29953799,
      "score": 1,
      "time": 1642312821,
      "title": "Commenda",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Commenda"
    },
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 29953782,
      "score": 1,
      "time": 1642312572,
      "title": "A Visual Approach to Leverage Points",
      "type": "story",
      "url": "https://donellameadows.org/a-visual-approach-to-leverage-points/"
    },
    {
      "by": "zenbob",
      "descendants": 0,
      "id": 29953778,
      "score": 1,
      "time": 1642312509,
      "title": "FedEx asks U.S. for permission to install anti-missile lasers in its cargo jets",
      "type": "story",
      "url": "https://www.nbcnews.com/business/travel/fedex-asks-us-permission-install-anti-missile-lasers-cargo-jets-rcna12298"
    },
    {
      "by": "mbbconsultant",
      "descendants": 0,
      "id": 29953751,
      "score": 2,
      "text": "Dear HN\nI’m a long time HN reader and contributor. I created an anonymous account for privacy reasons.<p>The urge for resignation has hit me, but I am deeply unsure of my next step in life. I know I want to do something in tech &#x2F; IT, but I am unsure about what field.<p>About me: I’m 37. I started my career out of high school as a programmer and uses this to fund my university\n(Masters degree in Comp Sci and finance). I installed my first Linux distribution at the age of 13 (Slackware 3.1) and have been an avid open source fan since then. During my Uni years I worked part time &#x2F; fulL time as a dev and became pretty good in back end development - Perl, Ruby, C#, Java, MSSQL, Oracle etc. I also developed very strong system admin skills, especially on FreeBSD, OpenBSD, and Debian.<p>When I graduated from Uni (masters degree) I felt it was about time to move on from programming so I joined a consulting firm (one of the large global ones). I gained experience in enterprise architecture, especially in mergers and acquisitions in banking and insurance. Because I was quite good I ended up joining one of the MBB firms (McKinsey, BCG, Bain) to lead their tech strategy practice in the country I live in. They offered me an attractive package to relocate to another country to help build their tech advisory business with all expenses paid, good pay etc. I am right now in the “partner window” which means I might get promoted to partner with profit share over the next 12-18 months or so.<p>My issue is I have lost passion with my work throughout the pandemic. I am not sure if I am depressed or having a mid-life crisis, but I have completely lost interest in the work. Consulting is quite stressful, long hours, highly demanding clients, constant churn. I feel like my job is to crank out nice-looking PowerPoint pages without any real impact. My superiors are very demanding and show little empathy for staff being tired or exhausted. My junior team members mostly complain. MBB cannot compete with the likes of FAANG or tech start ups any more simple because the work is more predictable and you are able to see real impact. So we don’t get the same calibre of people anymore. MBB also don’t typically hire a lot of technically minded people, mostly just ivy league MBAs, so it’s tough delivering technology projects and have to train people up on IT every time you need to deliver a new project.<p>Dear HN, I need some help to find inspiration for my next career move. I don’t think I’m cut out for the partner job, I’ve lost the passion and desire to work 80 hr weeks simply to deliver a good looking PowerPoint deck. But I don’t know what to do. Most people go into corporate jobs after consulting, but I genuinely don’t like the politics and elbows it requires to succeed. I’m quite introvert and not good at building coalitions. I could do my own consulting business, but it would just be “more of the same” (stress + long hours + PowerPoint). I could maybe go into working for a start up, but I’m not exactly spring chicken anymore (37).<p>I think I have a competitive edge in my combination of strategy consulting skills (structure, analytical rigour,  commercial acumen, client management skills) and deep understanding of tech (I spent close to 8 years as a dev all up and try to keep myself current). I just don’t know what I could possibly do. It seems everywhere I look there’s a downside (big corporate - politics; stay in consulting - more of the same; join a tech start up - be the old guy); it feels so depressing. Do you have any suggestions or perspectives on what I could do? Any examples from you own career change?<p>Thanks a lot.<p>Andy",
      "time": 1642311905,
      "title": "Ask HN: Life after (strategy and technology) consulting",
      "type": "story"
    },
    {
      "by": "charles_f",
      "descendants": 0,
      "id": 29953709,
      "score": 1,
      "time": 1642311378,
      "title": "Aaaaa- a Minimalist Keyboard (For Android)",
      "type": "story",
      "url": "https://github.com/dkter/aaaaa"
    },
    {
      "by": "akprasad",
      "descendants": 1,
      "id": 29953702,
      "kids": [
        29953714
      ],
      "score": 2,
      "time": 1642311311,
      "title": "“Ting the Cook” from the Zhuangzi",
      "type": "story",
      "url": "https://arunkprasad.com/log/ting-the-cook-from-the-zhuangzi/"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 29953700,
      "score": 1,
      "time": 1642311290,
      "title": "Grievance Studies Affair",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Grievance_studies_affair"
    }
  ]
}