{
  "stories": [
    {
      "by": "shivbhatt",
      "descendants": 0,
      "id": 28096300,
      "score": 1,
      "time": 1628318094,
      "title": "Families of 9/11 victims tell Biden not to attend memorial events",
      "type": "story",
      "url": "https://www.bbc.com/news/world-us-canada-58121267"
    },
    {
      "by": "willwinger",
      "descendants": 0,
      "id": 28096256,
      "score": 1,
      "text": "I raise this question to understand if open source is viable going forward.<p>1. Increasing Complexity: Open source software is now beyond core libraries and into full solutions&#x2F;products. The complexity and nature of the software inherently needs monetary support at a n enterprise scale. It is like running an art gallery or museum with no entry ticket.<p>2. Not Software Business: Running an open source company is not different from running a charity, you have to be very skilled in fund raising as there is no product sales. Selling services around open source don&#x27;t have many successful examples<p>3. Customer expectations: the fact that the value is being delivered for free is invisible to customers. Their expectations of quality, speed, feature, user experience will always be exactly the same as for big $ commercial software. Also OSS might even be subject to a greater sense of entitlement by its users.<p>4. Not a viable marketing route: the main rise for OSS popularity was driven by strategic use of open source by some companies to gain fast adoption and visibility. This strategy is not much valid anymore as OSS is now way beyond MVP or fremium level of complexity and Customer expectation.<p>5. SaaS world: As we move towards a SaaS world, it also means the market is moving towards closed package software days. The customer is happy and the marketing engine will drive that ever more. So OSS will be exploited by SaaS (most if not all enterprise software is moving towards SaaS) players. They have zero incentive to give back.<p>6. No one pays: As mentioned before it needs dedicated fund raising efforts akin to a charity. No one pays if you throw a donate button and expect people to be honorable. Enterprises that pay for OSS are as rare as enterprises which contribute to societal well being. It is in fact the natural tendency of any commercial enterprise to not spend where it is not legally necessary.<p>So what do you think, will OSS survive given this ecosystem? If yes, in what form will it emerge? What will be the driving motivation behind it?",
      "time": 1628317502,
      "title": "Ask HN: Will Open-Source Survive?",
      "type": "story"
    },
    {
      "by": "readonthegoapp",
      "descendants": 1,
      "id": 28096250,
      "kids": [
        28096264
      ],
      "score": 1,
      "time": 1628317446,
      "title": "Ask HN: Did a bunch of your accounts get hacked at the same time?",
      "type": "story"
    },
    {
      "by": "AndrewBissell",
      "descendants": 0,
      "id": 28096217,
      "score": 1,
      "time": 1628317047,
      "title": "On Pfizer's Sloppy Consent Form for Its Booster Clinical Trial",
      "type": "story",
      "url": "https://www.nakedcapitalism.com/2021/08/sloppy-pfizer-booster-clinical-trial-consent-form-provides-way-to-exclude-reactions-that-require-emergency-care.html"
    },
    {
      "by": "vijayr02",
      "descendants": 1,
      "id": 28096193,
      "kids": [
        28096208
      ],
      "score": 1,
      "time": 1628316832,
      "title": "WhatsApp attacks Apple’s child safety ‘surveillance’ despite government acclaim",
      "type": "story",
      "url": "https://on.ft.com/3Ajo1aR"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 28096180,
      "score": 1,
      "time": 1628316697,
      "title": "Sequoyah",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Sequoyah"
    },
    {
      "by": "NiceWayToDoIT",
      "descendants": 0,
      "id": 28096163,
      "score": 1,
      "time": 1628316504,
      "title": "Hacking Satellites with $300 Worth of TV Gear",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=8IGsQoL1AgQ"
    },
    {
      "by": "antonreshetov",
      "descendants": 0,
      "id": 28096128,
      "score": 1,
      "time": 1628316136,
      "title": "Free Post Cover and Background Generator Tool",
      "type": "story",
      "url": "https://figen.cc/"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28096122,
      "score": 1,
      "time": 1628316017,
      "title": "Major UK science funder require grantees to make papers immediately free to all",
      "type": "story",
      "url": "https://www.sciencemag.org/news/2021/08/major-uk-science-funder-require-grantees-make-papers-immediately-free-all"
    },
    {
      "by": "lnyan",
      "descendants": 0,
      "id": 28096110,
      "kids": [
        28096188
      ],
      "score": 1,
      "time": 1628315888,
      "title": "Covid-19 vaccinemaker Novavax faces manufacturing setback",
      "type": "story",
      "url": "https://www.sciencemag.org/news/2021/08/covid-19-vaccinemaker-novavax-faces-manufacturing-setback"
    }
  ]
}