{
  "stories": [
    {
      "by": "efojs",
      "descendants": 1,
      "id": 29708791,
      "kids": [
        29708813
      ],
      "score": 1,
      "time": 1640651745,
      "title": "Came across troll – at least we know that/when it sleeps",
      "type": "story",
      "url": "https://twitter.com/efojs/status/1475610692308897795"
    },
    {
      "by": "gralx",
      "descendants": 1,
      "id": 29708751,
      "kids": [
        29708752
      ],
      "score": 1,
      "time": 1640651465,
      "title": "Formal Verification of Multi-Paxos for Distributed Consensus, v4 (2016, 2019)",
      "type": "story",
      "url": "https://arxiv.org/abs/1606.01387"
    },
    {
      "by": "kristianpaul",
      "descendants": 1,
      "id": 29708748,
      "kids": [
        29708771
      ],
      "score": 1,
      "time": 1640651442,
      "title": "AWSSupportServiceRolePolicy – inadvertently included S3:GetObject permissions",
      "type": "story",
      "url": "https://aws.amazon.com/security/security-bulletins/AWS-2021-007/"
    },
    {
      "by": "mardiyah",
      "descendants": 0,
      "id": 29708724,
      "score": 1,
      "time": 1640651247,
      "title": "Get Used to Chip Shortages: They Are Not Going Away Anytime Soon",
      "type": "story",
      "url": "https://interestingengineering.com/get-used-to-chip-shortages-they-are-not-going-away-yet"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29708669,
      "score": 1,
      "time": 1640650877,
      "title": "I/O Is Faster Than the CPU – Partition Resources and Eliminate OS Abstractions [pdf]",
      "type": "story",
      "url": "https://penberg.org/parakernel-hotos19.pdf"
    },
    {
      "by": "noevilcorp",
      "descendants": 0,
      "id": 29708651,
      "score": 2,
      "text": "I’m not an idealist considering becoming a volunteer or take a significant pay cut to work on a specific cause, but I don’t want my OKRs to be tied to things that actively makes the world what I consider a worse place. I don’t want my salary to increase the more “whales” we catch, whether that’s an online casino, an addictive mobile game or a crypto currency.<p>I’m concerned about the environment but I don’t consider myself to have very radical political views in general. These are areas I’d want to avoid. What’s left? What areas could I pursue that are also potentially doing interesting things online?<p>- AdTech. Most obviously the known harm some social media can cause to democracy by fueling rage, but also systematic economic problems related to e-commerce below.\n- Most e-commerce. Trying to get people to buy material things they don’t need. Bad for the environment.\n- Crypto. Companies fall into one of 3 categories: terrible for the environment, a Ponzi scheme, or neutral but legitimizing or encouraging projects in the previous two categories.\n- FinTech&#x2F;e-commerce platforms. Trying to get people to buy stuff they can’t afford, on credit, and don’t need. Bad for the environment and society.\n- Gambling. Duh.\n- Gaming with in-app-purchasing. Exploiting people prone to addiction or with low impulse control. Immoral and bad for society.\n- Fossil-heavy industries. Air travel, booking and similar. We need to fly occasionally, but I now celebrate when flying is reduced. I don’t want a bonus to change that.<p>I’m not judging anyone, I’ve worked with several of the above myself. I just want to do things differently after 15 years.<p>This is not a discussion thread about my claims above, I respect if you consider them ridiculous, but we’re not very likely to have a fruitful discussion on this particular topic.",
      "time": 1640650740,
      "title": "Are there any good companies anymore?",
      "type": "story"
    },
    {
      "by": "Stevvo",
      "descendants": 0,
      "id": 29708622,
      "score": 1,
      "time": 1640650581,
      "title": "Video Game Sound Archiving – Part 2: Conker’s Bad Fur Day and the Mysterious MP3",
      "type": "story",
      "url": "https://blog.audiokinetic.com/video-game-sound-archiving-part-2/"
    },
    {
      "by": "veggiesync",
      "descendants": 0,
      "id": 29708607,
      "score": 1,
      "text": "Hi Everybody,<p>I made 4 mindmaps using the key takeaways from the book “The Epic Guide to Agile: More Business Value on a Predictable Schedule with Scrum”, and would love to share them with all of you.<p>Some of you may have read this book or heard about it. It was published in 2019 and it’s a modern guide on how to use Agile, specifically Scrum, in the most effective way. After reading this book I loved it so much that I decided to make a mindmap to help myself understand and internalize the key information better. There are 4 parts and 30 chapters in the book and the author Dave Todaro provided some key takeaways at the end of each chapter. I ended up making a huge mindmap with all that information so I broke it down into 4 smaller mindmaps, each containing the key takeaways from one part of the book.<p>Here is the book’s Table of Contents (my mindmaps are structured in the same way):<p>Part 1 (Mindmap 1): Understanding Scrum Fundamentals<p>Chapter 1 - Introduction to High-Performance Teamwork<p>Chapter 2 - Scrum&#x27;s 10 Guideposts<p>Chapter 3 - The Product Backlog<p>Chapter 4 - User Stories<p>Chapter 5 - The Sprint<p>Chapter 6 - Scrum Ceremonies<p>Chapter 7 - Scrum Roles<p>Chapter 8 - The Sprint Backlog<p>Chapter 9 - The Product<p>Part 2 (Mindmap 2): Understanding Agile Software Construction<p>Chapter 10 - Introduction to Agile Software Construction<p>Chapter 11 - Creating a Shippable Increment Requires Team Test Environment<p>Chapter 12 - Managing Source Code Properly Avoids Pain When &quot;Life Happens&quot;<p>Chapter 13 - Automated Unit Testing: The Foundation of Code Quality<p>Chapter 14 - Acceptance Testing: Making Sure Everything Works Together<p>Chapter 15 - Agile Architecture and Technical Design<p>Part 3 (Mindmap 3): Laying the Groundwork<p>Chapter 16 - Here Be Dragons: Preparing for the Challenges You&#x27;ll Face<p>Chapter 17 - Forming Your Pilot Scrum Team<p>Chapter 18 - Your Team&#x27;s Path to Excellence<p>Chapter 19 - Creating the Initial Product Backlog<p>Chapter 20 - Estimating the Size of the Product Backlog<p>Chapter 21 - Creating an Initial Schedule Projection<p>Chapter 22 - Splitting User Stories for Increased Momentum<p>Chapter 23 - Final Preparations Before Your First Sprint<p>Part 4 (Mindmap 4): Building the Product<p>Chapter 24 - Determining Sprint Logistics<p>Chapter 25 - Planning the Sprint<p>Chapter 26 - Orchestrating the Daily Work of the Sprint<p>Chapter 27 - A &quot;Zero-Defects&quot; Approach to Dealing with Bugs<p>Chapter 28 - Providing Transparency and Getting Feedback with the Sprint Review<p>Chapter 29 - Driving Continuous Improvement with the Sprint Retrospective<p>Chapter 30 - Confidently Releasing Your Product into Production<p>In this Dropbox folder you will find the 4 mindmaps (in PNG image format).<p>https:&#x2F;&#x2F;www.dropbox.com&#x2F;sh&#x2F;jxzxbnb0em8h1x5&#x2F;AAC-2U2D-bLBnqIv42gx9ztra?dl=0<p>I also included in the folder the original XMind files that I created (XMind is a desktop and mobile app for mind mapping). This way you will be able to edit the 4 mindmaps to suit your own learning. To be able to do that, I included the XMind desktop app installers for both macOS and Windows in the Dropbox folder as well.<p>Mind mapping helped me tremendously in absorbing the key information from the book, and I&#x27;m happy to share these mindmaps with you guys. Hope you find some value from them.<p>Finally, if anyone is hiring, I&#x27;m currently seeking a remote Scrum Master, QA Tester or Customer Support Representative job..<p>My LinkedIn profile is at: https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;qing-wang-sync&#x2F;<p>Thank you so much everyone for taking the time out of your busy schedule to read this and&#x2F;or check out my mindmaps, and please stay safe and healthy during these challenging times..<p>Gratefully yours,\nQing",
      "time": 1640650452,
      "title": "Sharing with everyone 4 mindmaps of key takeaways from “The Epic Guide to Agile”",
      "type": "story"
    },
    {
      "by": "mehaase",
      "descendants": 0,
      "id": 29708582,
      "score": 1,
      "time": 1640650301,
      "title": "Encoding.Tools (Alternative to CyberChef and Burp Suite Encoder)",
      "type": "story",
      "url": "https://encoding.tools/"
    },
    {
      "by": "ivanstegic",
      "descendants": 3,
      "id": 29708577,
      "kids": [
        29708825,
        29708744,
        29708758
      ],
      "score": 14,
      "time": 1640650284,
      "title": "Shared e-bikes and e-scooters are worse for the environment than owned ones",
      "type": "story",
      "url": "https://www.sciencedirect.com/science/article/pii/S1361920921004296"
    }
  ]
}