{
  "stories": [
    {
      "by": "JaimeThompson",
      "descendants": 0,
      "id": 30387900,
      "score": 1,
      "time": 1645202365,
      "title": "WinAPI-Fun: A collection of (relatively) harmless pranks using the Windows API",
      "type": "story",
      "url": "https://github.com/adeemm/WinAPI-Fun"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30387883,
      "score": 1,
      "time": 1645202290,
      "title": "Windows Projected File System (ProjFS)",
      "type": "story",
      "url": "https://docs.microsoft.com/en-us/windows/win32/projfs/projected-file-system"
    },
    {
      "by": "ChrisHardie",
      "descendants": 0,
      "id": 30387879,
      "score": 1,
      "time": 1645202253,
      "title": "If you build websites, begging you to include RSS feeds",
      "type": "story",
      "url": "https://tech.chrishardie.com/2022/rss-useful-important/"
    },
    {
      "by": "uaas",
      "descendants": 0,
      "id": 30387877,
      "score": 2,
      "time": 1645202240,
      "title": "The Challenge with Deploying eBPF into the Wild",
      "type": "story",
      "url": "https://blog.px.dev/ebpf-portability/"
    },
    {
      "by": "SoapSeller",
      "descendants": 0,
      "id": 30387866,
      "score": 3,
      "time": 1645202186,
      "title": "Windows 11 Pro will soon require a Microsoft Account",
      "type": "story",
      "url": "https://www.theverge.com/2022/2/18/22940517/windows-11-pro-require-microsoft-account-internet-connection"
    },
    {
      "by": "dev_tty01",
      "descendants": 0,
      "id": 30387865,
      "score": 1,
      "time": 1645202184,
      "title": "As BA.2 subvariant of Omicron rises, lab studies point to signs of severity",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_6a65a0526394c82f0863ff6d39d94758"
    },
    {
      "by": "kazanins",
      "descendants": 0,
      "id": 30387852,
      "score": 1,
      "time": 1645202125,
      "title": "Upstart Q4’21 Earnings:auto loans are great, but growth needs personal loans too",
      "type": "story",
      "url": "https://www.popularfintech.com/p/upstart-q4-2021-earnings-auto-loans"
    },
    {
      "by": "dskhatri",
      "descendants": 0,
      "id": 30387846,
      "score": 1,
      "text": "Hello HN,<p>Almost 15 years into being a (rather quiet) user of HN, I am thrilled to write my first Show HN post!<p>Early in the pandemic, we looked to devise a system that would drastically reduce the risk of spreading Covid-19 when people gathered in a room. The system would need to disinfect the air rapidly to keep the concentration of virions in the space low enough so the risk of cross infection would be drastically cut [1]. It became clear that an effective system would need to draw air away from the breathing space so that the exhaled air from an infected individual would not impinge upon an uninfected receptor via proximal exposure from breathing jets [2] or build up the virion concentration in the room. The air drawn away from the breathing space would then need to be fed into a disinfection stage to inactivate the SARS-CoV-2 virus.<p>The system would need to work at a high volumetric flow rate to draw as large a volume of air from the breathing space yet be quiet and unobtrusive. Next, the air drawn up and away would need to be sufficiently disinfected so that the air would be safe to inhale when returned to the breathing space. Fortunately, solutions for both problems existed – Large diameter overhead fans operating in upflow mode would achieve the first objective. If we could uniformly expose all the air drawn up by the fan with a high enough dose of UV-C [3] [4], we would achieve the second objective. \nThis is what we came up with (https:&#x2F;&#x2F;luvsystems.com&#x2F;assets&#x2F;hello_halo.jpg ) and a simplified exploded view of the halō (https:&#x2F;&#x2F;luvsystems.com&#x2F;assets&#x2F;halo_exploded_view.png). A video of it in operation is here:  https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=a4vHqU12deE<p>The halō draws 2000 cfm from the breathing space.  All that air is directed into a toroidal chamber containing a UV-C light ring with a total (UV-C) flux of over 100 W. The air speed and flux are calibrated to deliver a dose to the air that results in a continuous 99.8% inactivation (“2.7 log reduction”) of coronaviruses. The “log-reduction” for other airborne pathogens depends on the pathogens’ UV-C susceptibility factor [6].<p>Finally, for those in the Los Angeles area, we are happy to do an in-person Show HN. Send me an email!<p>[1] Research suggests between O(1)-O(3) virions need to be inhaled to trigger an infection. The number would vary depending on the pathogen and variant.<p>[2] Various researchers have analyzed respiratory jet dynamics with unmasked subjects such as  https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC3613375&#x2F; and https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-health-coronavirus-japan-supercompute-idUSKBN26Z0PI<p>[3] Ultraviolet Light C (UV-C) has long been known to be highly effective in inactivating airborne disease-causing pathogens like coronaviruses and mycobacterium tuberculosis: https:&#x2F;&#x2F;ghdcenter.hms.harvard.edu&#x2F;guv-lighting<p>[4] https:&#x2F;&#x2F;www.nationalacademies.org&#x2F;based-on-science&#x2F;covid-19-does-ultraviolet-light-kill-the-coronavirus",
      "time": 1645202108,
      "title": "Show HN: Mitigating the spread of respiratory infections in indoor spaces",
      "type": "story"
    },
    {
      "by": "angelobattaglia",
      "descendants": 0,
      "id": 30387842,
      "score": 1,
      "time": 1645202093,
      "title": "On Negotiating Salary, Interviews for Big Tech and the Internship World",
      "type": "story",
      "url": "https://ludoro.github.io/blog/career/2022/02/14/newgrad.html"
    },
    {
      "by": "Sonata",
      "descendants": 0,
      "id": 30387841,
      "score": 5,
      "time": 1645202091,
      "title": "Quine – Open-Source Streaming Graph for Event-Driven Applications",
      "type": "story",
      "url": "https://quine.io/"
    }
  ]
}