{
  "stories": [
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 30245977,
      "score": 1,
      "time": 1644247148,
      "title": "New Surgical Tape Could Replace Sutures for Repairing Leaks in GI Tract",
      "type": "story",
      "url": "https://www.hospimedica.com/surgical-techniques/articles/294791486/newly-designed-surgical-sticky-tape-could-replace-sutures-for-repairing-leaks-and-tears-in-gi-tract.html"
    },
    {
      "by": "legofr",
      "descendants": 0,
      "id": 30245976,
      "score": 1,
      "time": 1644247146,
      "title": "George Washington University’s President Condemns China Olympics Posters",
      "type": "story",
      "url": "https://twitter.com/badiucao/status/1489807097730846724"
    },
    {
      "by": "tsabat",
      "descendants": 0,
      "id": 30245946,
      "score": 1,
      "time": 1644246996,
      "title": "Show HN: TypeDB CTI – Cyber Threat Intelligence Knowledge Graph",
      "type": "story",
      "url": "https://github.com/typedb-osi/typedb-data-cti"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30245922,
      "score": 1,
      "time": 1644246921,
      "title": "A Design for Simple Interners",
      "type": "story",
      "url": "https://lcnr.de/blog/low-effort-interner/"
    },
    {
      "by": "rbanffy",
      "descendants": 0,
      "id": 30245917,
      "score": 1,
      "time": 1644246897,
      "title": "NASA and SpaceX studying parachute issue but don’t see major safety concern",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/02/nasa-and-spacex-studying-parachute-issue-but-dont-see-major-safety-concern/"
    },
    {
      "by": "hubraumhugo",
      "descendants": 1,
      "id": 30245894,
      "kids": [
        30245908
      ],
      "score": 1,
      "time": 1644246834,
      "title": "Show HN: A crowdsourced database for broken and worn-out products",
      "type": "story",
      "url": "https://www.failscout.co"
    },
    {
      "by": "mfrw",
      "descendants": 0,
      "id": 30245890,
      "score": 1,
      "time": 1644246822,
      "title": "Block Linux Fileless Payload “Malware” Execution with BPF LSM",
      "type": "story",
      "url": "https://djalal.opendz.org/post/ebpf-block-linux-fileless-payload-execution-with-bpf-lsm/"
    },
    {
      "by": "throwaway76312",
      "descendants": 0,
      "id": 30245888,
      "score": 2,
      "text": "I have been very lucky to achieve financial independence two years ago. I retired early with $10 MM+ at 32. It had been my goal for several years, I hated my job, and I expected to become very happy.<p>It didn&#x27;t turn out like that. I became really depressed and with professional help, I admitted that I might need a job. Probably part time as I am fairly lazy and hate working.<p>The problem is that all the type of work I am sort of interested in require some administrative work like a company setup or new bank accounts. I have declined all these things because I feel the risk of getting my identity stolen, and therefore my brokerage accounts emptied, is now the only thing I should rationally be concerned about. The extra money from the job would have a negligible effect on my lifestyle (I am actually fairly frugal, and don&#x27;t really buy much).<p>I have become very careful about not sharing my passport with anyone, including financial institutions.<p>I realize that my care to not get my identity stolen is on the extreme, compared to the average. However, everything I read everywhere tells me that not even big institutions are safe, so how could I trust my local accountant, or local financial institution to not get my data stolen?<p>Also, anytime I get on a plane, I have to share my passport, which I fully trust is entered on a poorly secured database, probably running windows XP servers SP 1, or something similarly cutting edge.<p>So should I actually start sharing my personal data more widely? All official advice is basically to not share personal data with untrusted sources, but from my perspective there are no trusted sources in our current age. The FBI, the government are all getting hacked. No institution can protect itself against hacking. So I do not even know what to make of this. Does anyone in the great HN community have a proper understanding of the risks of sharing one&#x27;s personal data, and could enlighten me?",
      "time": 1644246817,
      "title": "Ask HN: How much should I worry about identity theft",
      "type": "story"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30245872,
      "score": 2,
      "time": 1644246756,
      "title": "The Q-ish swamp in the middle of Colorado",
      "type": "story",
      "url": "https://coloradonewsline.com/2021/11/05/qanon-douglas-county-swamp-colorado/"
    },
    {
      "by": "Morgaknight",
      "descendants": 2,
      "id": 30245863,
      "kids": [
        30245915
      ],
      "score": 1,
      "text": "I ask because I run usehaste.io, which is an asynchronous video interview tool that helps SaaS startups with user feedback, and I’d love to hear more about how we can build it to serve startups like yours.",
      "time": 1644246717,
      "title": "Ask HN: Startups, what frustrates you about getting user feedback?",
      "type": "story"
    }
  ]
}