{
  "stories": [
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 30522151,
      "score": 1,
      "time": 1646182038,
      "title": "Wire Bonding Basics",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=mvZ1dJuvenw"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 30522141,
      "score": 1,
      "time": 1646181965,
      "title": "Human Power, Past and Future",
      "type": "story",
      "url": "https://hackaday.com/2022/03/01/human-power-past-and-future/"
    },
    {
      "by": "RafelMri",
      "descendants": 0,
      "id": 30522134,
      "score": 2,
      "time": 1646181932,
      "title": "An ‘Unhinged’ Putin Threatens Dangerous Escalation in Ukraine War",
      "type": "story",
      "url": "https://www.wired.com/story/putin-nuclear-threat-ukraine-war-escalation/"
    },
    {
      "by": "VieEnCode",
      "descendants": 0,
      "id": 30522119,
      "score": 2,
      "time": 1646181796,
      "title": "Apple to pause product sales in Russia as tech firms feel pressure over Ukraine",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2022/mar/01/apple-russia-ukraine-facebook"
    },
    {
      "by": "yutyut",
      "descendants": 0,
      "id": 30522111,
      "score": 1,
      "text": "A client reached out to me after seeing my online portfolio and wants me to build him a backend for a product he&#x27;s developing for his personal business. I&#x27;m less concerned with the technical requirements (I know I can handle those!) but am fairly clueless when it comes to pricing, a contract etc. I have an initial meeting coming up and want to appear as informed and professional as possible.<p>1. How do you decide how much to charge once you&#x27;ve determined all of the requirements for a given project? I&#x27;m staying away from hourly billing.<p>2. Does anyone have a good contract template they can provide for project-based billing? Is this worth pursuing on LegalZoom? Is there a boilerplate solution already floating around out there that you would recommend?<p>3. Is a ballpark price during the initial meeting something to stay away from? I don&#x27;t want to pull a number out of thin air based on an on-the-fly assessment.",
      "time": 1646181749,
      "title": "Ask HN: Business tips for my first freelance project",
      "type": "story"
    },
    {
      "by": "cft",
      "descendants": 0,
      "id": 30522097,
      "score": 2,
      "text": "I am locked out of my Russian ETFs. I received the following email from Robinhood:<p>An important update about securities you hold\nHi xxxx,\nWe wanted to let you know that our execution venues have informed us that they will stop supporting buy or sell orders on certain Russian securities that you hold, effective as of market close today, March 1, 2022 at 4:00 pm ET.\nWhy is this happening? \nIn response to Russia’s attack on Ukraine, the US Treasury has announced economic sanctions to disconnect Russia from global economic access, including restricting access to capital. Below is a list of securities that you will no longer be able to buy or sell:<p>GZPFY\nLUKOY\nNILSY\nOAOFY\nOGZPY\nROSYY\nRSHYY\nSBRCY\nSGTPY\nSGTZY\nPlease note that this list is not exhaustive and is subject to change based on government action, updates from stock exchanges, or changes at our execution venues.\nDo I need to take action?\nYour shares will continue to be held at Robinhood, but you won&#x27;t be able to buy or sell until further notice.\nThis is a rapidly evolving situation and we are here to support you.\n- The Robinhood Team",
      "time": 1646181678,
      "title": "Ask HN: As an American, why am I sanctioned by Robinhood?",
      "type": "story"
    },
    {
      "by": "throwaway888abc",
      "descendants": 0,
      "id": 30522093,
      "score": 2,
      "time": 1646181645,
      "title": "Ukraine Seafarer Charged in Partial Sinking of Russian Oligarch's Superyacht",
      "type": "story",
      "url": "https://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-03-01/card/ukraine-seafarer-charged-in-partial-sinking-of-russian-oligarch-s-superyacht-mrce8l6Kge6VEpbFAzCv"
    },
    {
      "by": "nickt",
      "descendants": 0,
      "id": 30522068,
      "score": 1,
      "time": 1646181473,
      "title": "HomeCorrupter – audio fidelity reduction plugin VST",
      "type": "story",
      "url": "https://www.igorski.nl/download/homecorrupter"
    },
    {
      "by": "nunogt",
      "descendants": 1,
      "id": 30522040,
      "kids": [
        30522158
      ],
      "score": 5,
      "time": 1646181282,
      "title": "Secure Messengers in War Time",
      "type": "story",
      "url": "https://nuno.sh/blog/secure-messengers-in-wartime/"
    },
    {
      "by": "m_km",
      "descendants": 2,
      "id": 30522035,
      "kids": [
        30522117,
        30522113
      ],
      "score": 2,
      "text": "You probably use a secondary browser to login to <i>work</i> and <i>personal</i> accounts at the same time or check stuff with&#x2F; without add-ons, etc. If you love Firefox, you don&#x27;t really have to put up with Chrome or Edge for this purpose.<p>You can use Firefox Developer Edition[1] as your secondary browser (while using Firefox at the same time).<p>Note - If you need a third or even a fourth browser, there is Firefox Beta and Firefox Nightly https:&#x2F;&#x2F;www.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;channel&#x2F;desktop&#x2F;<p>[1] &lt;https:&#x2F;&#x2F;www.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;developer&#x2F;&gt;",
      "time": 1646181229,
      "title": "Tell HN: Firefox users don't need another secondary browser",
      "type": "story"
    }
  ]
}