{
  "stories": [
    {
      "by": "O__________O",
      "descendants": 0,
      "id": 29867273,
      "score": 1,
      "time": 1641761954,
      "title": "Reasons People Get Lost in the Wild",
      "type": "story",
      "url": "https://www.outdoorlife.com/10-reasons-people-get-lost-in-wild/"
    },
    {
      "by": "xojoc",
      "descendants": 0,
      "id": 29867270,
      "score": 1,
      "time": 1641761941,
      "title": "I Program in Erlang (2012)",
      "type": "story",
      "url": "https://www.evanmiller.org/why-i-program-in-erlang.html"
    },
    {
      "by": "throwwouq",
      "descendants": 0,
      "id": 29867230,
      "score": 1,
      "text": "I live outside the US and am a programmer in a US company. Starting this job two years ago coincided with a cancer diagnosis in the family. Treatment has gone well in private hospitals, but insurance doesn&#x27;t cover oncology drugs, so we pay for them out-of-pocket.<p>We make around 110K USD a year combined, and have spent just under 200K on medical bills over these past 24 months. We have taken out loans to get by.<p>Public hospitals here are a mess and are almost always out of stock of oncology drugs, most radiation machines are out of service, etc. Combine that with sanitation malpractice and it&#x27;s not somewhere where you would want a loved-one treated (even if they had the oncology drug, which they don&#x27;t).<p>In hindsight, our family should have had private health insurance coverage that includes oncology drugs. None of the local insurance providers do this, so I&#x27;ve looked at international providers (Bupa, Allianz, BestDoctors, etc). My budget is so tight I can&#x27;t really afford to sign up for one of these now, even though it might help prevent a repeat situation. Also, they won&#x27;t provide much help for someone who already has cancer.<p>We&#x27;ve looking for ways to increase family income. I signed a non-compete with the company I work for, and I&#x27;d need to check in with them before starting anything extra. My partner is looking for a better paid job, but English is the big barrier to get a remote job like me.<p>I wish my current employer provided employee-sponsored health insurance for me and my partner. They do that for their US employees, but not for international contractors. In an ideal world they would also cover our dependents, which would include the family member who has cancer.<p>Countries like the one I live in have always had these problems. It&#x27;s just that now as the world opens up to remote work, the difference in circumstance between one employee and the next can be great. While you might have dental, vision, health insurance, 401K matching, your teammate working out of a developing country might be struggling to pay hospital bills and have enough for basic necessities.",
      "time": 1641761696,
      "title": "Tell HN: The disparity between employees and international contractors",
      "type": "story"
    },
    {
      "by": "wglb",
      "descendants": 0,
      "id": 29867218,
      "score": 3,
      "time": 1641761598,
      "title": "Fossils of a Prehistoric Rainforest Hide in Australia’s Rusted Rocks",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/07/science/fossils-australia-rainforest.html"
    },
    {
      "by": "mrspence",
      "descendants": 0,
      "id": 29867217,
      "score": 1,
      "time": 1641761596,
      "title": "Dev Genius: Have you head of Dura yet? 2022's upgrade for Git",
      "type": "story",
      "url": "https://blog.devgenius.io/what-git-professionals-will-use-in-2022-dura-73dfe4f17500?gi=b0d3f2f9fe74"
    },
    {
      "by": "guiambros",
      "descendants": 0,
      "id": 29867178,
      "score": 1,
      "time": 1641761320,
      "title": "Management à La Google (2006)",
      "type": "story",
      "url": "https://www.wsj.com/articles/SB114601763677436091"
    },
    {
      "by": "perlpimp",
      "descendants": 0,
      "id": 29867143,
      "score": 3,
      "time": 1641761047,
      "title": "A Hoodie with a Pouch for Cats to Snuggle Inside While Their Human Is Working",
      "type": "story",
      "url": "https://laughingsquid.com/hoodie-with-pouch-for-cats/"
    },
    {
      "by": "aaronsdevera",
      "descendants": 0,
      "id": 29867112,
      "kids": [
        29867144
      ],
      "score": 3,
      "time": 1641760786,
      "title": "Haroon Meer: Moxie’s post changed the tenor of discussions on Web3",
      "type": "story",
      "url": "https://twitter.com/haroonmeer/status/1480256734971285512"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 29867107,
      "kids": [
        29867168
      ],
      "score": 1,
      "time": 1641760752,
      "title": "End of free lateral flow tests as country told to live with Covid",
      "type": "story",
      "url": "https://www.thetimes.co.uk/article/end-of-free-lateral-flow-tests-as-country-told-to-live-with-covid-3bpz8lnqf"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29867095,
      "score": 3,
      "time": 1641760707,
      "title": "Scientists explore Thwaites, Antarctica's 'doomsday' glacier",
      "type": "story",
      "url": "https://apnews.com/article/science-glaciers-antarctica-e9687077d7295e8218ba7cbcb9246ca3"
    }
  ]
}