{
  "stories": [
    {
      "by": "znpy",
      "descendants": 0,
      "id": 31779169,
      "score": 1,
      "text": "As per subject: what policies are in place for FAANG&#x2F;MANGA employees about personal websites, blogging etc ?<p>What are you, as an employee, not allowed to do?<p>Do you think it&#x27;s fair?<p>Do you think it&#x27;s hurting&#x2F;benefiting your public persona?<p>Thank you in advance!",
      "time": 1655477943,
      "title": "Ask HN: What are the policies for personal websites at FAANG/MANGA?",
      "type": "story"
    },
    {
      "by": "PhilipWee",
      "descendants": 0,
      "id": 31779160,
      "score": 1,
      "text": "Hi HN! Philip and Stephen here, we are the co-founders of FireJet (https:&#x2F;&#x2F;www.firejet.io), which allows you to export from Figma to Tailwind CSS.<p>We first met at university, where we did several project together, often first designing in Figma and then developing the Frontend manually. It’s not that it was extremely hard to code out our app Frontends - however, it felt pretty dumb to be doing twice the amount of work, once while designing and then once again to implement the design in code.<p>We tried several other tools which were similar to FireJet, but the main problem we always ran into was that the other tools had alot of features like automatic semantic tagging, implementing Material UI components, and so on, but none of them got the one fundamental thing we needed it to do - which was convert it to code. Some competitors were converting certain figma frames into images, which as you can imagine is about as useful as replacing your website with an &lt;img&gt; tag<p>We made a quick prototype in a week, and people who needed the specific tailwind functionality loved it. Fast forward about 3 months, we have 700 downloads and a small (but growing!) group of dedicated users who keep coming back to us and helping us improve the product.<p>Even now, our landing page and our plugin UI are themselves developed using FireJet itself, and because we ourselves are a startup we are not too worried about coding best practices, but rather iterating and developing as fast as possible, which is why FireJet is useful for us.<p>So we are launching FireJet here in the spirit of building in public, and we hope that FireJet reduce your time to market for your startup &#x2F; agency &#x2F; company!<p>You can see a portfolio website I made using FireJet here:<p>Sample Website: https:&#x2F;&#x2F;philipwee.github.io&#x2F;\nGithub Repository: https:&#x2F;&#x2F;github.com&#x2F;PhilipWee&#x2F;philipwee.github.io\nFigma File: https:&#x2F;&#x2F;www.figma.com&#x2F;community&#x2F;file&#x2F;1119632484827501100",
      "time": 1655477906,
      "title": "Show HN: FireJet – Export from Figma to Tailwind CSS – Hacker News",
      "type": "story"
    },
    {
      "by": "h4ck3d1t",
      "descendants": 0,
      "id": 31779124,
      "score": 1,
      "time": 1655477772,
      "title": "Securing OT Network Management Systems: Siemens Sinec",
      "type": "story",
      "url": "https://claroty.com/2022/06/16/blog-research-securing-network-management-systems-part-3-siemens-sinec-nms/"
    },
    {
      "by": "digb",
      "descendants": 0,
      "id": 31779116,
      "score": 1,
      "time": 1655477743,
      "title": "Wikipedia",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Wikipedia"
    },
    {
      "by": "evo_9",
      "descendants": 0,
      "id": 31779108,
      "score": 1,
      "time": 1655477702,
      "title": "Ronald Wayne Forgotten Apple Co-Founder",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Ronald_Wayne"
    },
    {
      "by": "duxup",
      "descendants": 1,
      "id": 31779105,
      "kids": [
        31779140
      ],
      "score": 3,
      "time": 1655477672,
      "title": "SpaceX fires employees behind letter slamming Musk, tells staff: “Stay focused”",
      "type": "story",
      "url": "https://arstechnica.com/tech-policy/2022/06/spacex-fired-employees-who-wrote-letter-slamming-musks-embarrassing-behavior/"
    },
    {
      "by": "raygelogic",
      "descendants": 0,
      "id": 31779097,
      "score": 2,
      "text": "I lead a software dev team at a small startup. One of my direct reports is way smarter than me. They come up with clever, simple solutions to business needs. They&#x27;re also really driven, and will do things like find out what our stakeholders need and create the specs and do planning for those things. Generally we are a team and communicate pretty well on those things, but most of the time I&#x27;m left feeling like I&#x27;m not adding much value. Usually, they&#x27;re the one rejecting ideas and having better ones.<p>That said, they tend to get overwhelmed easily (a bit of overthinking at times), and I&#x27;m much more comfortable communicating with leadership&#x2F;presenting ideas to the company, etc. So I wouldn&#x27;t recommend they step into management just yet.<p>Really what I want is to continue leading the team as best I can, and not let my ego interfere. But I guess I&#x27;m wondering how to best manage this person. Do I just sit back and let them do their thing? Try harder to meet them at their level and challenge them? How would you all like to be managed if you were in their position?",
      "time": 1655477644,
      "title": "Ask HN: Managing people smarter than you",
      "type": "story"
    },
    {
      "by": "latchkey",
      "descendants": 1,
      "id": 31779084,
      "kids": [
        31779155
      ],
      "score": 1,
      "time": 1655477606,
      "title": "FBI says fraud on LinkedIn a ‘significant threat’ to platform and consumers",
      "type": "story",
      "url": "https://www.cnbc.com/2022/06/17/fbi-says-fraud-on-linkedin-a-significant-threat-to-platform-and-consumers.html"
    },
    {
      "by": "kordlessagain",
      "descendants": 0,
      "id": 31779057,
      "score": 1,
      "time": 1655477460,
      "title": "Field Theories of Consciousness",
      "type": "story",
      "url": "http://www.scholarpedia.org/article/Field_theories_of_consciousness"
    },
    {
      "by": "thematrixturtle",
      "descendants": 0,
      "id": 31779047,
      "score": 1,
      "time": 1655477404,
      "title": "Mamihlapinatapai",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Mamihlapinatapai"
    }
  ]
}