{
  "stories": [
    {
      "by": "samizdis",
      "descendants": 0,
      "id": 27956916,
      "score": 1,
      "time": 1627286996,
      "title": "Russia's Pirs ISS module scheduled to fall away ahead of Nauka arrival",
      "type": "story",
      "url": "https://www.theregister.com/2021/07/26/pirs_nauka_update/"
    },
    {
      "by": "pelasaco",
      "descendants": 0,
      "id": 27956912,
      "score": 1,
      "time": 1627286955,
      "title": "Microsoft Has Now Its Own Linux Distribution Builder, CBL-Mariner",
      "type": "story",
      "url": "https://www.infoq.com/news/2021/07/microsoft-linux-builder-mariner/"
    },
    {
      "by": "cinquemb",
      "descendants": 0,
      "id": 27956904,
      "score": 1,
      "time": 1627286867,
      "title": "Global Negative Yielding Debt Ticks Up to $15T",
      "type": "story",
      "url": "https://thesoundingline.com/global-negative-yielding-debt-ticks-up-to-15-trillion/"
    },
    {
      "by": "nabste",
      "descendants": 1,
      "id": 27956892,
      "kids": [
        27956893
      ],
      "score": 1,
      "time": 1627286766,
      "title": "KnowAssist – Good Knowledge Management: Now in Closed Beta",
      "type": "story",
      "url": "https://www.knowassist.com/"
    },
    {
      "by": "krumboy",
      "descendants": 0,
      "id": 27956890,
      "score": 1,
      "time": 1627286756,
      "title": "Leetcode Compensation report (India) Jan 2019 – Jul 2021",
      "type": "story",
      "url": "https://www.reddit.com/r/developersIndia/comments/ors1zd/leetcode_compensation_report_india_jan_2019_jul/"
    },
    {
      "by": "arsouyes",
      "descendants": 0,
      "id": 27956874,
      "score": 1,
      "time": 1627286644,
      "title": "Digitize MiniDV Tapes with Linux",
      "type": "story",
      "url": "https://www.arsouyes.org/en/blog/2021/2021-07-05_Numerisation_DV"
    },
    {
      "by": "PetNanny",
      "descendants": 0,
      "id": 27956851,
      "score": 1,
      "text": "PetNanny is the first device to combine all the functionalities necessary for cats. It is suitable for people who work or have a limited amount of time, as they can confidently leave their cats at home,  and with the assistance of PetNanny App be aware of the time their pet spends in the capsule, its passivity, body temperature, weight and nutrition: the artificial intelligence will help people detect if there is a need to visit a vet. Also, artificial intelligence will consult users on a diet selection, based on their pet&#x27;s age and weight. \nPetNanny can regulate the temperature inside and includes a smell-free carpet, which are the features providing comfort and convenience for your pet. Also, PetNanny allows cat owners to check on their pets and feed them whenever they&#x27;re at work or out for a short vacation. PetNanny includes water and food stored inside the capsule, containing food for 7 days. The capsule substance keeps the food fresh and crispy. The bowls slide out of the capsule and are designed for pets’ easy usage.Not only the fact that this product is the best one for inside uses, It’s also airline-approved. PetNanny is adapted to air transportation standards regarding baggage allowances. The opening wheels and handle from the front are designed for easy maneuverability. Besides, cats will be safe and in comfort, with the necessary amount of meal and water all the way. Also, the material is mainly fiberglass, which is recognized to be an eco-friendly material. When looking at the strength to weight ratio, it outperforms steel by a longshot offering the same strength as steel with greater flex. That means it&#x27;s more durable and impact- resistant.",
      "time": 1627286430,
      "title": "“The First device which combines all the functionalities necessary for cats”",
      "type": "story"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 27956841,
      "score": 1,
      "time": 1627286336,
      "title": "Edgar Allan Poe's engagement with American science",
      "type": "story",
      "url": "https://www.salon.com/2021/07/25/edgar-allan-poes-engagement-with-american-science_partner/"
    },
    {
      "by": "rbanffy",
      "descendants": 1,
      "id": 27956820,
      "kids": [
        27956877
      ],
      "score": 1,
      "time": 1627286090,
      "title": "Private jets will be taxed for the first time under the EU’s new climate plan",
      "type": "story",
      "url": "https://qz.com/2034454/how-much-is-fuel-for-a-private-jet-in-europe/"
    },
    {
      "by": "hidden-spyder",
      "descendants": 0,
      "id": 27956818,
      "score": 1,
      "time": 1627286082,
      "title": "JS13kGames - HTML5 and JavaScript Game Development Competition in just 13 kB",
      "type": "story",
      "url": "https://js13kgames.com/"
    }
  ]
}