{
  "stories": [
    {
      "by": "MobileVet",
      "descendants": 0,
      "id": 28506424,
      "score": 1,
      "time": 1631491841,
      "title": "Epic files appeal against ruling",
      "type": "story",
      "url": "https://www.documentcloud.org/documents/21061142-epic-games-appeal"
    },
    {
      "by": "mgh2",
      "descendants": 0,
      "id": 28506418,
      "score": 1,
      "time": 1631491792,
      "title": "OnlyFans Popularity Spreads as Performers Take to TikTok",
      "type": "story",
      "url": "https://www.rollingstone.com/culture/culture-news/onlyfans-tiktok-sex-work-1046916/"
    },
    {
      "by": "AGenie",
      "descendants": 1,
      "id": 28506385,
      "kids": [
        28506421
      ],
      "score": 1,
      "text": "I have just released a new concept to try and change the car buying experience for the better. Https:&#x2F;&#x2F;autogenie.co uk. I recently purchased 2 cars that took months to find and many wasted hours trying to find them. At Auto Genie i want users to easily list the car they require so that sellers can easily reach out to them and sell them their car. No more searching countless marketplaces daily trying to find your dream car just list what you want and wait. As this is a new online concept i would love some feedback on the UX so that it works okay and makes sense to be utilised easily. Thank you",
      "time": 1631491445,
      "title": "Ask HN: What Do You Think of New Car Buying Concept",
      "type": "story"
    },
    {
      "by": "gary_0",
      "descendants": 0,
      "id": 28506361,
      "score": 2,
      "time": 1631491292,
      "title": "The 9/11 Era is Over",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/the-911-era-is-over-good"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 28506333,
      "score": 1,
      "time": 1631491055,
      "title": "Humans Could Develop a Sixth Sense, Scientists Say",
      "type": "story",
      "url": "https://www.msn.com/en-us/news/technology/humans-could-develop-a-sixth-sense-scientists-say/ar-BB1gL5T9"
    },
    {
      "by": "CharlesW",
      "descendants": 2,
      "id": 28506259,
      "kids": [
        28506377,
        28506353
      ],
      "score": 8,
      "time": 1631490546,
      "title": "Unvaccinated are 5X more likely to catch Delta, 11X more likely to die",
      "type": "story",
      "url": "https://arstechnica.com/science/2021/09/unvaccinated-are-5x-more-likely-to-catch-delta-11x-more-likely-to-die/"
    },
    {
      "by": "elcritch",
      "descendants": 1,
      "id": 28506220,
      "kids": [
        28506401
      ],
      "score": 4,
      "time": 1631490195,
      "title": "Pixie – A full-featured 2D graphics library for Nim",
      "type": "story",
      "url": "https://github.com/treeform/pixie"
    },
    {
      "by": "bioudi",
      "descendants": 0,
      "id": 28506199,
      "score": 1,
      "text": "Recently i joined a new team working on an e-commerce website for a big company, we use Bitbucket Cloud for version control and Microsoft Teams for communication.<p>First thing i had to do is to fix some minor bugs so i fixed them after that i opened a pull request, what was surprising for me is the time it takes (2 days) to have my pull request validated and merged, so by curiosity i asked my tech lead about that he said sometimes when he receives email from Bitbucket to review some PRs he simply ignores it because maybe he didn’t have space at that time. And i was like it’s easy it should be some bitbucket and microsoft teams integration app that can helps us to solve this issue, indeed we found it and we gave it a try it was working fine every time someone open a PR we get notified to do the review but it didn’t solve the problem, why ? Because we receive the notifications and if we ignore it because of bad timing we don’t have any kind of reminders to do so. And really this was the real issue for us and we didn’t find a way to solve it til now.<p>This weekend i was thinking why not building it my self and maybe share it with other developers having same issue what do you think is it a great idea ? I need your feedbacks, And I built a simple landing page to collect some developers emails for the beta version if you think that it could solve your issue you could leave your email to get notified when the beta is released.<p>https:&#x2F;&#x2F;pullthunder.com",
      "time": 1631490037,
      "title": "Is this could be a great idea?",
      "type": "story"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 28506165,
      "score": 2,
      "time": 1631489727,
      "title": "The Top 40 Sounds Likely to Trigger Happy Memories",
      "type": "story",
      "url": "https://www.goodnewsnetwork.org/top-sounds-that-trigger-happy-memories/"
    },
    {
      "by": "RickJWagner",
      "descendants": 0,
      "id": 28506164,
      "score": 2,
      "time": 1631489693,
      "title": "What I miss about open source conferences",
      "type": "story",
      "url": "https://opensource.com/article/21/9/why-i-miss-conferences"
    }
  ]
}