{
  "stories": [
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32038291,
      "score": 1,
      "time": 1657393756,
      "title": "CIAM vs. IAM",
      "type": "story",
      "url": "https://fusionauth.io/blog/2022/05/10/ciam-vs-iam"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32038275,
      "score": 1,
      "time": 1657393632,
      "title": "Climatebase",
      "type": "story",
      "url": "https://climatebase.org"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 32038268,
      "score": 1,
      "time": 1657393580,
      "title": "What Is Serverless Enablement and Why Is It Important?",
      "type": "story",
      "url": "https://www.readysetcloud.io/blog/allen.helton/what-is-serverless-enablement/"
    },
    {
      "by": "ymherklotz",
      "descendants": 0,
      "id": 32038264,
      "score": 1,
      "time": 1657393548,
      "title": "Downloading Academic Papers Automatically",
      "type": "story",
      "url": "https://yannherklotz.com/ebib-papers/"
    },
    {
      "by": "akrai",
      "descendants": 1,
      "id": 32038262,
      "kids": [
        32038263
      ],
      "score": 1,
      "time": 1657393535,
      "title": "Feather – Bloomberg Terminal for Retail Traders (Re-Launch After Overhaul)",
      "type": "story",
      "url": "https://try-feather.com"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 32038240,
      "score": 1,
      "time": 1657393355,
      "title": "Reactivating Carmageddon’s Debug Output",
      "type": "story",
      "url": "http://1amstudios.com/articles/reactivating-carmageddon-debug-output/"
    },
    {
      "by": "Sami_Lehtinen",
      "descendants": 0,
      "id": 32038238,
      "score": 1,
      "time": 1657393339,
      "title": "Radvd adds pref64 support (RFC8781) for nat64",
      "type": "story",
      "url": "https://github.com/radvd-project/radvd/pull/179"
    },
    {
      "by": "assttoasstmgr",
      "descendants": 0,
      "id": 32038215,
      "score": 2,
      "text": "Wikipedia, the free encyclopedia anyone* can edit, blocks T-Mobile&#x27;s entire IPv6 address space of 2607:fb90&#x2F;32 from anonymous editing and account creation and has for years.[1] For reference, that is 79,228,162,514,264,337,593,543,950,336 or 2^96 IPv6 addresses. Most T-Mobile customers use native IPv6 without knowing it, so they have de facto blocked an entire nationwide ISP. Since they now sell home internet, this is not just limited to mobiles anymore. Wikipedia has published a sob story[2] where they justify these actions, claiming it&#x27;s so difficult to ban IPv6 users because the addresses dynamically change when the device is restarted and the address space is so large, and T-Mobile&#x27;s use of proxy acceleration, they are left with no choice but to ban the entire ISP&#x27;s customer base, all 110 million of them. Their &quot;advice&quot; is to have a friend on another ISP create an account for you on a desktop computer. Why even allow access over IPv6 at all at that point, if they can&#x27;t deal with the management of it? This is all especially hilarious and hypocritical given this quote:<p>&quot;The Wikimedia Foundation believes that the principle of net neutrality is critical to the future of the open Internet.&quot;<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;w&#x2F;index.php?title=Special:Log&amp;page=User%3A2607%3AFB90%3A0%3A0%3A0%3A0%3A0%3A0%2F32&amp;type=block<p>[2] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Wikipedia:Advice_to_T-Mobile_IPv6_users",
      "time": 1657393200,
      "title": "Tell HN: Wikipedia blocks T-Mobile's entire IPv6 address space",
      "type": "story"
    },
    {
      "by": "Someone",
      "descendants": 0,
      "id": 32038189,
      "score": 1,
      "time": 1657393010,
      "title": "Computer Lib/Dream Machines (1974) [pdf]",
      "type": "story",
      "url": "http://worrydream.com/refs/Nelson-ComputerLibDreamMachines1975.pdf"
    },
    {
      "by": "ramacastro",
      "descendants": 0,
      "id": 32038181,
      "score": 1,
      "text": "Hey everyone!<p>I created a startup with a friend to make it easier for anyone to create AIs without any prior experience or knowledge in the field. We started with computer vision, specifically object detection, but we plan to add all subfields of AI eventually, like natural language processing, speech and all the cool generative stuff.<p>You can do everything inside the platform: create datasets, train artificial neural networks and use them to give intelligence to your web apps, mobile apps, machines, security cameras, robots, drones, cars and everything else.<p>It is free to use forever without any credit card required. You can connect google colab notebooks to our platform and use their free GPUs for training. Forget about all the different labeling file formats and running complex code yourself, just connect colab to Theos, click the Start Training button and the metrics will stream directly to your browser, and we will automatically upload weights checkpoints every epoch so you don&#x27;t have to worry about colab shutting down and losing all your AI training progress. Also, we have an autolabeler feature to let your current AI&#x27;s version help you make a better version of itself 100 times faster than labeling manually. Finally, you can deploy your AI as a rest API and use it in your software with simple http requests.<p>Here&#x27;s the getting started guide for object detection:<p>https:&#x2F;&#x2F;docs.theos.ai&#x2F;get-started&#x2F;object-detection<p>Please let me know if you find it helpful and what subfield of AI you think we should tackle next.<p>(the landing page is not finished yet, soon we will release a way better version, but for now you can sign up and use the app for free)<p>Thanks!",
      "time": 1657392963,
      "title": "Train your own Object Detection AI in 1 day without any prior experience",
      "type": "story"
    }
  ]
}