{
  "stories": [
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 30936576,
      "score": 1,
      "time": 1649273958,
      "title": "Tabletop RPG Rule Books Can Be Beautiful and Accessible",
      "type": "story",
      "url": "https://www.wired.com/story/ttrpg-accessible-design/"
    },
    {
      "by": "mojoe",
      "descendants": 0,
      "id": 30936518,
      "score": 1,
      "text": "I&#x27;d like to help my daughter learn some reading&#x2F;math&#x2F;science concepts while also getting used to the keyboard&#x2F;mouse. I found &quot;Little Mouse&#x27;s Encyclopedia&quot; via the educational category on Steam, and she&#x27;s been enjoying exploring, but she doesn&#x27;t read well enough to use the encyclopedia entries. That&#x27;s about the level she&#x27;s at.<p>Any ideas would be appreciated!",
      "time": 1649273662,
      "title": "Ask HN: Do you know of any good educational computer games for 4 year olds?",
      "type": "story"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 30936515,
      "score": 1,
      "time": 1649273637,
      "title": "Teaching optics through conspiracy theories",
      "type": "story",
      "url": "https://bartoszmilewski.com/2022/04/05/teaching-optics-through-conspiracy-theories/"
    },
    {
      "by": "CKMo",
      "descendants": 0,
      "id": 30936496,
      "score": 1,
      "time": 1649273492,
      "title": "Attackers Spoof WhatsApp Voice-Message Alerts to Steal Info",
      "type": "story",
      "url": "https://threatpost.com/attackers-whatsapp-voice-message/179244/"
    },
    {
      "by": "b8",
      "descendants": 0,
      "id": 30936490,
      "score": 1,
      "time": 1649273471,
      "title": "Tinfoil Hat Linux",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Tinfoil_Hat_Linux"
    },
    {
      "by": "tayloradler",
      "descendants": 0,
      "id": 30936488,
      "score": 2,
      "text": "hey hey! I&#x27;m the co-founder of squads -- a product that makes it easy to see what your friends and top investors are doing in web3.<p>This product was developed out my own frustration trying to get more involved in web3. One of the greatest challenges in the crypto space is figuring out where to start. For some of us, we&#x27;re lucky to have a friend who can serve as a guide, and we wanted to build a product that would make introducing your friends to crypto a more inviting experience.<p>There is so much alpha and information living on Twitter + Discord, but the problem is finding the signal from the noise. With Squads, you don&#x27;t have to sift through all of the noise -- you can see what the best players in the space are doing the moment they do it.<p>In fact, we have pre-seeded the product with a squad of a16z investors, BAYC holders, and a group of well known twitter profiles so you can get a taste of what the squad structure is like.<p>With this product, you don&#x27;t have to sit in hundreds of discords and become inundated with notifications. Instead, you can follow who you think is interesting, and see a feed of their activity all in one place.<p>Some quick product highlights: \n- Social layer for web3 -- create a squad and share the invite link with your friends or anyone else. We took inspiration from discord for the invitation flow, try it out!<p>- Web3 Feed: see what activity is taking place in any of your squads, or from individual wallets that you follow<p>- Profile Page: Showcase all of your digital assets, and your performance, all in one place<p>- Social Graph: Follow your friends or favorite people on the blockchain<p>- Search: Search for any wallet address or ens domain<p>- Returns: See how profitable an individual is in flipping tokens or NFTs",
      "time": 1649273462,
      "title": "Show HN: Squads – Social Trading for Web3",
      "type": "story",
      "url": "https://beta.squads.xyz"
    },
    {
      "by": "louib",
      "descendants": 0,
      "id": 30936485,
      "score": 5,
      "time": 1649273454,
      "title": "KeePassXC 2.7.1 Released",
      "type": "story",
      "url": "https://keepassxc.org/blog/2022-04-06-2.7.1-released//"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30936471,
      "score": 1,
      "time": 1649273359,
      "title": "The philosophy of the prospect. Why they buy from you (2017)",
      "type": "story",
      "url": "https://www.adamtownsend.biz/philosophy-prospect-buy/"
    },
    {
      "by": "rg111",
      "descendants": 0,
      "id": 30936462,
      "score": 1,
      "time": 1649273324,
      "title": "Home sweet homepage, a comic about growing up online",
      "type": "story",
      "url": "https://sailorhg.com/home_sweet_homepage/"
    },
    {
      "by": "Tevias",
      "descendants": 0,
      "id": 30936458,
      "score": 1,
      "time": 1649273299,
      "title": "More trees mean better health outcomes, according to new research (2019)",
      "type": "story",
      "url": "https://psmag.com/news/more-trees-leads-to-better-health-outcomes-according-to-new-research"
    }
  ]
}