{
  "stories": [
    {
      "by": "JamesAdir",
      "descendants": 0,
      "id": 31189768,
      "score": 1,
      "time": 1651131590,
      "title": "PayPal shuttering its San Francisco office",
      "type": "story",
      "url": "https://techcrunch.com/2022/04/27/paypal-shuttering-its-san-francisco-office/"
    },
    {
      "by": "expansiveonenes",
      "descendants": 0,
      "id": 31189762,
      "score": 1,
      "text": "Soil is the one of the largest ecosystems on the planet. Each handful of soil has billions of microorganisms in it. These microorganisms are the very basis of our existence. Without them the soil will not have organic content. If soil doesn&#x27;t have organic content, then we can&#x27;t grow our food. If we can&#x27;t go our food, we will die of starvation. Soil extinction means that the soil has been stripped of all its organic content. The threat of soil extinction is not restricted to a small part of the world. It is estimated that 52% of the world&#x27;s agricultural land is already degraded. It is estimated that at the current pace of soil extinction we are heading for a sure apocalypse sort of situation in just 30, 40 years from now.<p>What is the cause of soil extinction?<p>Modern agricultural practices have become extremely unsustainable. A huge percentage of farmers across the world go in for mono-cropping. This means that tilled land is left open in the sun for weeks on end. This results in the death of the many microorganisms which call the soil home. This will lead to a direct decrease in the quality of the soil. The gradual degradation of soil quality will culminate in soil extinction.<p>How can we rejuvenate the soil?<p>Soil is rejuvenated when we cover it with plant and animal waste. The plant and animal waste is manure which rejuvenates the soil and enhances the organic content. It is said that soil across the world now has around 0.5% organic content. If we can increase it to around 5-6% we can rejuvenate the soil and reverse soil extinction. The general suggestion is that if a farmer has at least a small percentage of his&#x2F;her agricultural land under tree cover and then uses the plant waste that it generates to rejuvenate his entire farm, then we will surely be on track towards soil rejuvenation. But this needs to happen at a global scale, small scale solutions can&#x27;t reverse the damage we have done. That is why need everyone in the world to talk about soil and create awareness about it, so that we can have governments all across the world creating policies which encourage farmers to bring land under tree cover.<p>Carbon stored in soil is 3x that in living plants, and 2x that in the atmosphere, which means soil is crucial for carbon sequestration. Therefore, unsustainable farming practices are a huge contributor to the release of greenhouse gases and as a result a direct contributor towards climate change. If the world&#x27;s soils are not revitalized, they could release 850 billion tonnes of carbon dioxide into the atmosphere contributing to climate change. This is more than all of humanity&#x27;s emissions in the last 30 years combined.<p>Even though we are facing such a dire situation threatening our very existence, we hardly ever hear soil being discussed on mainstream media and social media.<p>It is extremely important that we all wake up before it is too late. We are indeed staring at a potential apocalypse. But the good news is that we have a 5-6 year window wherein we can come out of this dire situation through with the right policy change and worldwide awareness.<p>So, all that I humbly ask you to do is just this: please do your own research on this disaster-in-waiting and please talk to literally everyone you know about this. We need worldwide awareness of this potential apocalypse. Only then will governments across the world wake up and do the necessary policy change needed to ensure that humanity doesn&#x27;t die of starvation and global warming.<p>It is also important to know that what is a huge threat can also be turned into the biggest opportunity to reverse climate change. We can leverage the carbon holding capabilities of the soil to finally provide a solution for climate change.<p>So, we need to speak out and drive policy change to revitalize soil. Doing this will get us out of the mess we are in now and also make this earth a much better place to live 20 years from now.<p>Soil revitalization is all we need to do!",
      "time": 1651131555,
      "title": "Why isn't anyone talking about soil? The cause of a potential apocalypse by 2040",
      "type": "story"
    },
    {
      "by": "cp04",
      "descendants": 0,
      "id": 31189757,
      "score": 1,
      "time": 1651131518,
      "title": "Sass Tutorial – Complete Beginner's Guide for Sass with CSS",
      "type": "story",
      "url": "https://hashnode.developernoon.com/sass-tutorial"
    },
    {
      "by": "assttoasstmgr",
      "descendants": 0,
      "id": 31189752,
      "score": 1,
      "time": 1651131483,
      "title": "Getting GPLv2 compliance from a Chinese company in person",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=Vj04MKykmnQ"
    },
    {
      "by": "fullmamel",
      "descendants": 0,
      "id": 31189747,
      "score": 1,
      "time": 1651131405,
      "title": "Show HN: Learn everything about no-code without spending 200 hours",
      "type": "story",
      "url": "https://nocodebible.io/become-a-nocoder"
    },
    {
      "by": "vsupalov",
      "descendants": 0,
      "id": 31189745,
      "score": 1,
      "time": 1651131400,
      "title": "Show HN: Frequent Suffixes and Prefixes in HN Titles",
      "type": "story",
      "url": "https://vsupalov.com/frequent-hn-title-suffixes-prefixes/"
    },
    {
      "by": "mpweiher",
      "descendants": 0,
      "id": 31189707,
      "score": 1,
      "time": 1651131121,
      "title": "Breakingviews: Elon Musk probably won’t buy Twitter",
      "type": "story",
      "url": "https://www.reuters.com/breakingviews/elon-musk-probably-wont-buy-twitter-2022-04-27/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31189689,
      "score": 2,
      "time": 1651130965,
      "title": "How to live longer – a programmer's guide",
      "type": "story",
      "url": "https://github.com/geekan/HowToLiveLonger"
    },
    {
      "by": "kbst",
      "descendants": 0,
      "id": 31189653,
      "score": 1,
      "text": "Hey HackerNews!  I&#x27;m really excited to introduce... Elon&#x27;s Shenanigans, the first-ever no-code metaverse NFT web3 app. Now available on your all devices here: https:&#x2F;&#x2F;install.page&#x2F;elonmusk<p><i>What does it do?</i><p>Elon&#x27;s Shenanigans is a real functional app you can install on your Homescreen&#x2F;Desktop&#x2F;Dock to get quick access to Elon Musk&#x27;s Twitter feed. You can install it on iOS, Android, Windows, macOS, and Chrome OS from the universal installation link above.<p><i>The problem we&#x27;re solving</i><p>None, really. But Elon Musk&#x27;s Tweet feed is so entertaining in and of itself that we reckoned it deserved its own app.<p><i>How much does it cost?</i>\nIt&#x27;s completely FREE, forever and ever, until the end of time! We want to focus on user growth right now and think about monetization later.<p>Our future plans include collecting as much data on you as possible and a $499&#x2F;month subscription for dark mode.<p><i>What&#x27;s the market for this?</i><p>Elon Musk has 80 million followers. We calculated we can acquire 10% of them. If half of those users need dark mode, that&#x27;s $328 billion ARR. Humongous TAM, SAM, SOM, TOM, and MOM.<p><i>Who are our competitors?</i><p>We don&#x27;t have any. But it wouldn&#x27;t really matter anyway since we have 5 pending patents.<p><i>What&#x27;s our ask?</i><p>We&#x27;re looking to raise a $50 million Pre-Seed. If interested, fill out the Google Form on our website and I&#x27;ll get back to you with my Calendly link whenever I have time (you&#x27;ll have to sign an NDA before the call).<p><i>Who is on the team?</i><p>I&#x27;m a Former Facebook CEO, Forbes 70 Under 70 Awardee, Two-Time Nobel Prize Runner-Up, Olympic Squash Bronze Medalist. Also an Internet Evangelist and Uppercase-Letter Enthusiast.<p>My 6-year-old daughter is in charge of design. You can see a sample of her work on my personal page (she did the graphic design, I wrote the code): https:&#x2F;&#x2F;kevin.tw<p>Thank you for your support, HackerNews, and see you all at the IPO ceremony!<p>PS: Use coupon code HACKERNEWS at checkout to get $5 credit right now + 3% off every other month for the first 4 months",
      "time": 1651130543,
      "title": "Show HN: Elon's Shenanigans – now on your Homescreen",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 31189643,
      "score": 1,
      "time": 1651130453,
      "title": "Did We(B Development) Lose the Right Direction?",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=3PmPkZJ22Cc"
    }
  ]
}