{
  "stories": [
    {
      "by": "nrs26",
      "descendants": 0,
      "id": 29799551,
      "score": 1,
      "text": "Hi there.<p>I am a fairly experienced developer and technical managers who is currently working in a mid-sized software agency, and we&#x27;re seeing a lot of our incoming work start to relate to Web3. I have a cursory knowledge of Web3, particularly cryptocurrency, but I&#x27;d like to spend the next few months getting smart on this topic (for personal and professional reasons).<p>I am not interested in switching careers or learning how to trade cryptocurrency, which is what I tend to find when I Google around. I&#x27;m more looking for in-depth readings about what Web3 enthusiasts believe will happen with the internet, and what the short and medium-term implications of those beliefs are.<p>I tend to prefer long-form articles and books, but that may be unrealistic for a field that is changing so quickly. Every time I ask this question to friends and colleagues, the answer is &quot;Twitter&quot; but I am not a avid Twitter user, so advice on who to follow and what that looks like would be helpful too.<p>Outside of that - can HN recommend any resources for someone in my position? Happy to answer any more questions in the comments.",
      "time": 1641326669,
      "title": "Ask HN: Where can an experienced dev who knows little about Web3 start learning?",
      "type": "story"
    },
    {
      "by": "anarbadalov",
      "descendants": 0,
      "id": 29799545,
      "score": 1,
      "time": 1641326652,
      "title": "A Neuroscientist Prepares for Death",
      "type": "story",
      "url": "https://www.theatlantic.com/ideas/archive/2021/12/terminal-cancer-neuroscientist-prepares-death/621114/"
    },
    {
      "by": "neumll",
      "descendants": 0,
      "id": 29799502,
      "score": 1,
      "time": 1641326497,
      "title": "NeuML 2021 Year in Review",
      "type": "story",
      "url": "https://medium.com/@davidmezzetti/ef051fcdbbda"
    },
    {
      "by": "feross",
      "descendants": 0,
      "id": 29799489,
      "score": 1,
      "time": 1641326459,
      "title": "Movie Review: Don't Look Up",
      "type": "story",
      "url": "https://astralcodexten.substack.com/p/movie-review-dont-look-up"
    },
    {
      "by": "thazework",
      "descendants": 0,
      "id": 29799469,
      "score": 1,
      "time": 1641326399,
      "title": "Being-in-the-Room Privilege: Elite Capture and Epistemic Deference",
      "type": "story",
      "url": "https://www.thephilosopher1923.org/essay-taiwo"
    },
    {
      "by": "DrNuke",
      "descendants": 0,
      "id": 29799460,
      "score": 2,
      "time": 1641326368,
      "title": "AI’s 6 Worst-Case Scenarios Who needs Terminators when you have",
      "type": "story",
      "url": "https://spectrum.ieee.org/ai-worst-case-scenarios"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 29799429,
      "score": 1,
      "time": 1641326265,
      "title": "2021 NSF Cybersecurity Summit Report Is Now Available",
      "type": "story",
      "url": "https://blog.trustedci.org/2022/01/2021-nsf-cybersecurity-summit-report-is.html"
    },
    {
      "by": "basisword",
      "descendants": 0,
      "id": 29799423,
      "score": 1,
      "time": 1641326245,
      "title": "Twitter permanently bans news aggregation service Politics For All",
      "type": "story",
      "url": "https://www.theguardian.com/technology/2022/jan/04/twitter-permanently-bans-news-aggregation-service-politics-for-all"
    },
    {
      "by": "poppin3k",
      "descendants": 0,
      "id": 29799409,
      "score": 1,
      "text": "When googling my partner&#x27;s name, blockshopper returns a result linking our names to our home address on the first page of results.<p>I tried reaching out to Blockshopper to get this information removed. Here&#x27;s what I sent &#x2F; got:<p>--My Email--<p>As per the CCPA I am requesting that your website, Blockshopper.com remove both my and my wife&#x27;s personal information from your website:<p>https:&#x2F;&#x2F;blockshopper.com&#x2F;&lt;redacted&gt;<p>Your site prominently exposes our names and residence address in Google&#x27;s search results.<p>Please remove our information from your website per the CCPA law: https:&#x2F;&#x2F;leginfo.legislature.ca.gov&#x2F;faces&#x2F;codes_displaySection.xhtml?lawCode=CIV&amp;sectionNum=1798.105.<p>--Blockshopper response--<p>BlockShopper publishes public records. Property ownership, sales and property tax information is listed publicly in multiple places. Please refer to our FAQ page for more information.\nWe will, however, in certain circumstances where a security risk can be demonstrated, edit a homeowner&#x27;s name in our database so as to make it less searchable by Google, etc. Please send us a copy of the police report or restraining order and once we receive we will review your document and if valid we will amend your name on the listing.<p>Has anyone had success removing their info from these types of websites?",
      "time": 1641326201,
      "title": "Ask HN: Is there a way to get removed from blockshopper?",
      "type": "story"
    },
    {
      "by": "rustoo",
      "descendants": 0,
      "id": 29799397,
      "score": 1,
      "time": 1641326160,
      "title": "Overwork Culture Is Thriving",
      "type": "story",
      "url": "https://www.the-star.co.ke/business/kenya/2022-01-03-overwork-culture-is-thriving/"
    }
  ]
}