{
  "stories": [
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 31155305,
      "score": 1,
      "time": 1650896872,
      "title": "Avoiding the Power Trip",
      "type": "story",
      "url": "https://rushkoff.medium.com/avoiding-the-power-trip-9a53ed42e3e7"
    },
    {
      "by": "tropdrop",
      "descendants": 0,
      "id": 31155304,
      "score": 1,
      "time": 1650896869,
      "title": "The Irony of Canceling Everything Russian",
      "type": "story",
      "url": "https://www.nytimes.com/2022/04/22/opinion/russian-artists-culture-boycotts.html"
    },
    {
      "by": "buescher",
      "descendants": 0,
      "id": 31155290,
      "score": 1,
      "time": 1650896823,
      "title": "Pteromys: Interactive Design and Optimization of Model Airplanes (2014)",
      "type": "story",
      "url": "http://www.nobuyuki-umetani.com/publication/2014_sigg_pteromys/2014_siggraph_GliderDesign.html"
    },
    {
      "by": "samh748",
      "descendants": 0,
      "id": 31155282,
      "score": 2,
      "text": "Whether you do research as part of your job or for personal reasons, I&#x27;m curious to know whether you folks have a system or process for managing, organizing etc the research material?<p>How do you search and gather the initial material? Then systematically (or haphazardly) filter through to see what&#x27;s relevant for further examination?<p>How do you organize the material? Do you use a particular software? Do you have a preferred way of sorting and&#x2F;or naming it?<p>How do you process this material (eg taking notes)? Making it ready for the next steps, whether that&#x27;s some sort of synthesis, analysis, writing, etc.?",
      "time": 1650896790,
      "title": "Ask HN: What's Your Research Process?",
      "type": "story"
    },
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 31155272,
      "score": 1,
      "time": 1650896757,
      "title": "Vulnerability of avian populations to renewable energy production",
      "type": "story",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rsos.211558"
    },
    {
      "by": "ushakov",
      "descendants": 0,
      "id": 31155268,
      "score": 1,
      "text": "i&#x27;m sometimes wondering why we&#x27;re still using animals to conduct experiments?<p>can&#x27;t we use Machine Learning models to stop all the animal suffering?",
      "time": 1650896741,
      "title": "Ask HN: Will Machine Learning replace animal experiments?",
      "type": "story"
    },
    {
      "by": "jnxx",
      "descendants": 0,
      "id": 31155253,
      "score": 1,
      "text": "Just to be specific, I am asking about a good way to manage mail in the following situation:<p>I am using an open source email client and a mail hoster who and does the usual spam filtering in an excellent and privacy-friendly way.<p>For reading mail, I use my work computer, my laptop and my phone, the first two running claws-mail and the latter K9 Mail.<p>The issue I have is that I have some parties that I need to communicate with which do the following thing:<p>They are larger companies or associations (think in online shops, recruiting companies, professional organizations, organizators of recreational activities or sites such as LinkedIn or XING).<p>These can legitimately contact me for specific purposes (I gave consent to that, and gave them my email address), but what happens is that they then use my address to contact me for their own (non-consented) purposes, for their magazine, some event, some suggestion, an opportunity, something else, yet another thing, and so on.... The purpose is clear: They want to grab as much of my attention as possible in the hope that I might engage more with their offers or activities.<p>Blacklisting such addresses does not help in the long run, because senders and domains change all the time. Possibly, they have recognized that not all their messages are wanted and could become blocked, and they are now fast-switching sender domains to get around that. The messages and newsletters might have unsubscribe links, but as soon as I unsubscribe one, I have one or two new ones.<p>Traditional keyword-based spam filtering does not help either, because they use the same terms for their legitimate stuff and the things why I did initiate the subscription &#x2F; communication &#x2F; registration in the first place. This would not only block &#x2F;their&#x2F; site, but also mails from people that I am actually more interested in. Part of the problem is that I am actually interested in some of that stuff, but not in the actual deluge of messages.<p>What would help would be perhaps some form of whitelisting. But how to do that effectively?",
      "time": 1650896700,
      "title": "For people using FOSS email software, how do you filter organizational spam?",
      "type": "story"
    },
    {
      "by": "ColinWright",
      "descendants": 0,
      "id": 31155242,
      "score": 1,
      "time": 1650896654,
      "title": "Nukes, Nubs and Coners: The Unique Social Hierarchy Aboard a Nuclear Submarine",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/34104/nukes-nubs-and-coners-the-unique-social-hierarchy-aboard-a-nuclear-submarine"
    },
    {
      "by": "ashr_",
      "descendants": 1,
      "id": 31155190,
      "kids": [
        31155209
      ],
      "score": 1,
      "time": 1650896481,
      "title": "Show HN: Grape – Transform your code into a tutorial with one click",
      "type": "story",
      "url": "https://www.grape.codes/explore"
    },
    {
      "by": "Schiphol",
      "descendants": 0,
      "id": 31155186,
      "score": 1,
      "time": 1650896469,
      "title": "Small Technology",
      "type": "story",
      "url": "https://small-tech.org/research-and-development/"
    }
  ]
}