{
  "stories": [
    {
      "by": "prinxellc",
      "descendants": 1,
      "id": 30696149,
      "kids": [
        30696150
      ],
      "score": 1,
      "time": 1647415343,
      "title": "Create Free News Letters for Your Website",
      "type": "story",
      "url": "https://www.f1mail.tech"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 30696143,
      "score": 1,
      "time": 1647415292,
      "title": "War Music: A Short History of the Ukrainian Language",
      "type": "story",
      "url": "https://theswordandthesandwich.substack.com/p/war-music-a-short-history-of-the"
    },
    {
      "by": "fifticon",
      "descendants": 0,
      "id": 30696132,
      "score": 1,
      "text": "My kid can use a mobile phone for plenty of positive useful things, but can clearly not manage usage of youtube - it triggers plenty of addict-behaviour. I timebox her youtube access, and have blocked youtube in our firewall at home.\n  Is there any feasible way to block youtube-access on an android? I can manually temporarily disable some services, but videos can stil be played indirectly, and she finds those holes.\nIt might be video-playing as such that must be blocked, but youtube is the major problem.\nIt&#x27;s not the content subject that is the problem, it&#x27;s their weaponized addictiveness.",
      "time": 1647415136,
      "title": "Ask HN: Configure Android phone to block YouTube?",
      "type": "story"
    },
    {
      "by": "luisamodio",
      "descendants": 0,
      "id": 30696124,
      "score": 1,
      "text": "Hello HN community,<p>For the past year we’ve been working on this disruptive new thing. It’s about people, community, communication and truth.<p>Throw is the new space for asking and answering questions anonymously. We believe that in today’s world (both online and offline) content in communication exchanges is strongly influenced by the personas, profiles and façades people maintain&#x2F;upkeep&#x2F;safeguard socially, ideologically and on relationships.<p>From the way people post on Instagram the life they want others to believe they have, or the way people behave on thanksgiving with family, or at work, or with friends; on every social setting and interaction to some degree acting and behaving according to that setting and the people they interact with. These dynamics influence the content itself, as people don’t just respond to a question like computers do. What ends up happening is that the responder comes up with the answer by blending the possibly objective answer with feelings, setting, desires, commitments, ideologies, fears, insecurities, etc (social pressure or social agenda).<p>Something is missing between social media and the traditional Q&amp;A…<p>Throw addresses this by creating a space free from this social agenda. Thus focusing strictly on the content exchanged and providing a safe, comfortable and unbiased space where people can ask and answer anything freely with no bias, fears or strings attached.<p>Not only may Throw be used for personal and private questions and answers. But the power of crowdsourcing allows for a great variety of use cases like market research, validation of content and ideas, trivia, and much more. Serious matters and also just for fun…<p>It’s a query marketplace which means that “throwers” (people who ask questions) pay a fee proportional to the answers they need and in turn “catchers” (who catch them and respond) get compensated. This way we guarantee every user gets as many responses as he&#x2F;she needs.<p>As for dealing with anonymity, we have built a sophisticated moderation protocol to neutralize and quickly ban people that contribute negatively as it is a priority people feel safe and comfortable in this community.<p>We have worked very hard to create a delightful product and are currently very close to rolling out our app to the market.<p>If this is something that may be of your interest or you’d like to be one of the first to test it out, you may keep an eye for our launch and other news by subscribing to our waitlist. <a href=\"https:&#x2F;&#x2F;www.throwapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.throwapp.com</a><p>Also, if you have questions there is additional information in the FAQs section on our web page that could be of help.<p>If you still haven&#x27;t looked at our explainer video I encourage you to see it as it&#x27;s quite fun and describes pretty well what we are doing. <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;3f9RcVVpkNA\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;3f9RcVVpkNA</a><p>Finally, we really appreciate any feedback we can get (of any kind). So if there&#x27;s anything you like, don&#x27;t like, or any other thought about Throw, we&#x27;d love to hear about it! You may post a comment below or through the contact section on the web page.<p><i>Be curious and dare to know!</i><p>Thank you!",
      "time": 1647414971,
      "title": "Show HN: Throw – The new space for asking and answering questions anonymously",
      "type": "story",
      "url": "https://www.throwapp.com/"
    },
    {
      "by": "laktak",
      "descendants": 0,
      "id": 30696122,
      "score": 1,
      "time": 1647414958,
      "title": "Software upgrades help Mars helicopter keep flying",
      "type": "story",
      "url": "https://www.theregister.com/2022/03/16/mars_helicopter_mission_extended/"
    },
    {
      "by": "unripe_syntax",
      "descendants": 0,
      "id": 30696110,
      "score": 2,
      "time": 1647414783,
      "title": "Well Facebook has a TikTok now",
      "type": "story",
      "url": "https://techcrunch.com/2022/03/15/well-facebook-has-a-tiktok-now/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30696095,
      "score": 1,
      "time": 1647414630,
      "title": "Entropy Games",
      "type": "story",
      "url": "http://entropygames.net/"
    },
    {
      "by": "Uncle_Sam",
      "descendants": 0,
      "id": 30696093,
      "score": 1,
      "time": 1647414599,
      "title": "How I Made a Real Lightsaber – Guinness World Records",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=RSSAhmmiZjM"
    },
    {
      "by": "alefvanoon",
      "descendants": 2,
      "id": 30696077,
      "kids": [
        30696157,
        30696164
      ],
      "score": 13,
      "text": "https:&#x2F;&#x2F;twitter.com&#x2F;libretube&#x2F;status&#x2F;1503967212570394627<p>LibreTube main devs(@rimthekid\n) github account has been suspended by GitHub without any reasons.\nAll of his releases and comments are hidden by GitHub.",
      "time": 1647414328,
      "title": "LibreTube main devs account has been suspended by GitHub without any reasons",
      "type": "story"
    },
    {
      "by": "danny0z",
      "descendants": 0,
      "id": 30696061,
      "score": 1,
      "time": 1647414130,
      "title": "Xmake and C/C++ Package Management",
      "type": "story",
      "url": "https://github.com/xmake-io/xmake/wiki/Xmake-and-Cplusplus--Package-Management"
    }
  ]
}