{
  "stories": [
    {
      "by": "ErikVandeWater",
      "descendants": 0,
      "id": 29529494,
      "score": 1,
      "time": 1639316247,
      "title": "Environmentalists would buy the land they want to protect, if it were legal",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=NjKVC0ko8ZA"
    },
    {
      "by": "jrepinc",
      "descendants": 0,
      "id": 29529485,
      "score": 1,
      "time": 1639316160,
      "title": "TLP has unintended side effects on Mobile devices",
      "type": "story",
      "url": "https://blog.bshah.in/2021/12/12/tlp-unintended-side-effects/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29529463,
      "score": 1,
      "time": 1639315879,
      "title": "Apple Park: first look at the design team shaping the future of tech",
      "type": "story",
      "url": "https://www.wallpaper.com/design/apple-park-behind-the-scenes-design-team-interview"
    },
    {
      "by": "samwillis",
      "descendants": 0,
      "id": 29529451,
      "score": 1,
      "text": "With the Log4J vulnerability it got me thinking out how to secure my apps from similar problems in the future. I already use a WAF such as CloudFlare as an inbound firewall, but what I want is an outbound firewall, like Little Snitch.<p>Also, when building with un-curated package managers such as NPM and PyPi, it’s virtually impossible to audit all dependencies. We now regularly hear news of packages being replaced with backdoored versions makes me very nervous. These could make outbound connections to exfiltrate data with not outside input.<p>I would love it if PAASs (with I prefer) such as Heroku and Fly.io had configurable outbound firewalls. Being able to whitelist what outbound connections were aloud would help enormously, even though it would not solve all potential exploits.<p>Does anyone know of one? Why do PAAS (and to some extent IAAS) not have this functionality built in?<p>(Obviously with your own infrastructure this is possible with normal firewalls)",
      "time": 1639315773,
      "title": "Ask HN: Is there an outbound firewall for web apps, a bit like “Little Snitch”?",
      "type": "story"
    },
    {
      "by": "philonoist",
      "descendants": 0,
      "id": 29529391,
      "score": 1,
      "time": 1639315200,
      "title": "KeyNav – Rapid pointer movement with keyboard",
      "type": "story",
      "url": "https://www.semicomplete.com/projects/keynav/"
    },
    {
      "by": "arcturus17",
      "descendants": 1,
      "id": 29529375,
      "kids": [
        29529513
      ],
      "score": 1,
      "text": "I have noticed in the last couple of years that search results on Amazon have become horrendous.<p>Often I am looking for highly specific items, and Amazon will recommend many items that have nothing to do with them in the first ten results.<p>For example, I have just looked into &quot;weightlifting shoes&quot; and the THIRD result was a cycling shoe.<p>This is in the Spanish store. After checking the American store, results are slightly better (the Spanish store is truly atrocious), but there are many bad results within the first twenty or so results.<p>Does anyone know why this is happening?",
      "time": 1639315025,
      "title": "Ask HN: Why is search on Amazon so bad?",
      "type": "story"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29529351,
      "score": 2,
      "time": 1639314816,
      "title": "Workers Are Using ‘Mouse Movers’ So They Can Use the Bathroom in Peace",
      "type": "story",
      "url": "https://www.vice.com/en/article/88gqgp/mouse-mover-jiggler-app-keep-screen-on-active"
    },
    {
      "by": "vixalien",
      "descendants": 1,
      "id": 29529317,
      "kids": [
        29529456
      ],
      "score": 1,
      "time": 1639314528,
      "title": "Rabbet",
      "type": "story",
      "url": "https://dash.rabbet.me/account"
    },
    {
      "by": "dcanelhas",
      "descendants": 0,
      "id": 29529312,
      "kids": [
        29529321
      ],
      "score": 10,
      "text": "Post that got taken down for violating community guidelines was simply the following:<p>&quot;Det finns många bra alternativ förutom ubuntu. Kolla på distrowatch.com och titta runt lite, kolla på screenshots och besök hemsidorna se om det är något verkar passa dig. Många distros satsar just på att vara &quot;lightweight&quot; och vissa har ett &quot;live medium&quot; vilket innebär att installationsmediumet är så att du kan starta operativsystemet direkt från ett USB minne och testa det utan att ens installera det till en början.&quot;<p>in english:<p>&quot;There are many good options besides ubuntu. Check out distrowatch.com and look around a bit, look at the screenshots and visit the websites to see if there is something that seems to suit you. Many distros focus on being &quot;lightweight&quot; and some have a &quot;live medium&quot; which means that the installation medium is so that you can boot the operating system directly from a USB memory and test it without even installing it in the first place.&quot;",
      "time": 1639314469,
      "title": "Linking to distrowatch.com from Facebook is a community violation",
      "type": "story"
    },
    {
      "by": "mmiliauskas",
      "descendants": 0,
      "id": 29529288,
      "score": 2,
      "time": 1639314316,
      "title": "Metaverse might just solve climate change",
      "type": "story",
      "url": "https://marti-1.io/2021/12/09/metaverse-might-just-solve-climate-change.html"
    }
  ]
}