{
  "stories": [
    {
      "by": "teleforce",
      "descendants": 0,
      "id": 29914170,
      "score": 1,
      "time": 1642029436,
      "title": "Nvidia Announces AI-Powered Dynamic Super Resolution Image Scaling Technology",
      "type": "story",
      "url": "https://www.pcgamer.com/nvidia-announces-ai-powered-dynamic-super-resolution-image-scaling-technology/"
    },
    {
      "by": "fendy3002",
      "descendants": 0,
      "id": 29914167,
      "score": 1,
      "text": "I had an interview with a company based on US, for a position of senior full stack developer. He gave some questions related to my current role as senior developer. More or less here&#x27;s the topic:<p>- explaining my work experience\n- how I manage or assign tasks to my subordinate\n- what is a leader means to me\n- how do I handle my subordinate mistakes &#x2F; misdemeanor\n- how is the situation in my company and how can I do to change it<p>Then I had another interview with different company, they go with more technical questions here:<p>- asks to share some code I can show and explain to them\n- about how I manage css\n- about ci&#x2F;cd pipeline\n- about react hooks<p>Now I think there are some project management role in the first one and infra &#x2F; devops role in the second one (I&#x27;m more inclined towards this one). So what is the company really expect me to able to?",
      "time": 1642029429,
      "title": "Ask HN: What are companies expectation to a senior software developer?",
      "type": "story"
    },
    {
      "by": "jelliclesfarm",
      "descendants": 0,
      "id": 29914158,
      "score": 1,
      "text": "I was wondering today ..what with all the noise about social media and dopamine addiction ..why not use the dopamine hits from Insta or FB clicks as a therapeutic way for depression or other mild brain chemical imbalance issues.<p>Some behavioural or depressive states can be resolved with talk therapy. A trained therapist can help people navigate with social media as therapy and gently nudge the patient back into health so it doesn’t slip into negative territory.<p>Or is this already done&#x2F;implemented? If attention seeking is a way to get the dopamine hits, why not use it as a guided healing modality?<p>I am not sure I buy the theory that social media is all bad. Some people have come out of their shell and gain friends and have had a net positive experience. They used to say this with video gaming too back when…but surely all them kids didn’t turn out to be suicidal or anti social thugs?",
      "time": 1642029393,
      "title": "Using Social Media(with talk therapy) as cheap hack for dopamine therapy",
      "type": "story"
    },
    {
      "by": "dopu",
      "descendants": 0,
      "id": 29914151,
      "score": 1,
      "time": 1642029363,
      "title": "Toroidal topology of population activity in grid cells",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-021-04268-7"
    },
    {
      "by": "azalemeth",
      "descendants": 0,
      "id": 29914141,
      "score": 1,
      "time": 1642029321,
      "title": "Where Is Webb?",
      "type": "story",
      "url": "https://www.webb.nasa.gov/content/webbLaunch/whereIsWebb.html?units=metric"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29914137,
      "score": 1,
      "time": 1642029310,
      "title": "Simony",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Simony"
    },
    {
      "by": "hemloc_io",
      "descendants": 0,
      "id": 29914126,
      "score": 1,
      "text": "Currently work at a big FAANG and am kinda bored, but making good&#x2F;great money.<p>Recently got hit up with a request for some founders who just quit their jobs for their new venture.<p>They&#x27;re in the process of raising a seed within the next couple of weeks. I think the project is pretty viable and will almost certainly be funded. (it&#x27;s SAAS and Web3&#x2F;Crypto, and the founders worked for VCs prev as well as&#x2F;top tech companies ;)).<p>Generally speaking prev advice with seed startups is you can expect to live off ramen but has that changed in the current environment where everyone is flush with cash?<p>Would you leave if the product was both technically interesting and viable? I&#x27;m relatively early in my career, college grad during the beginning of the pandemic, and don&#x27;t want to get totally screwed if this doesn&#x27;t work out.<p>Anyone have experience, esp recent experience, with working for these super early stage startups? E.g. the founders just quit their jobs a matter of weeks ago.",
      "time": 1642029246,
      "title": "Ask HN: Jumping from FAANG into a seed round company?",
      "type": "story"
    },
    {
      "by": "mitchbob",
      "descendants": 1,
      "id": 29914123,
      "kids": [
        29914163
      ],
      "score": 1,
      "time": 1642029231,
      "title": "Voyager Golden Record",
      "type": "story",
      "url": "https://voyager.jpl.nasa.gov/golden-record/"
    },
    {
      "by": "dynm",
      "descendants": 0,
      "id": 29914122,
      "score": 1,
      "time": 1642029220,
      "title": "The Limits of Medicine – Small Molecules",
      "type": "story",
      "url": "https://www.epistem.ink/p/the-limits-of-medicine-part-1-small"
    },
    {
      "by": "gmays",
      "descendants": 0,
      "id": 29914077,
      "score": 1,
      "time": 1642029042,
      "title": "Researchers Switch Off Gene to Switch on Ultraviolet in Butterfly Wings",
      "type": "story",
      "url": "https://mediarelations.gwu.edu/researchers-switch-gene-switch-ultraviolet-butterfly-wings"
    }
  ]
}