{
  "stories": [
    {
      "by": "synsynack",
      "descendants": 0,
      "id": 27793792,
      "score": 1,
      "time": 1625929450,
      "title": "Feds indict “The Bull” for allegedly selling insider stock info on the dark web",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/07/feds-indict-the-bull-for-allegedly-selling-insider-stock-info-on-the-dark-web/"
    },
    {
      "by": "sharjeelsayed",
      "descendants": 0,
      "id": 27793780,
      "score": 1,
      "time": 1625929380,
      "title": "Kubernetes – Kubernetes",
      "type": "story",
      "url": "https://redhatspain.com/kubernetes/"
    },
    {
      "by": "lormayna",
      "descendants": 0,
      "id": 27793778,
      "score": 1,
      "text": "I am going to start studying for an huge certification and I would like to ask what are the best tool for taking notes and keep track of studying progression. My idea was to take note in Markdown and then upload to Github&#x2F;Bitbucket. The only missing point is the lack of a native diagram tool.\nDo you have any other suggestions or do you want to share with me your tools&#x2F;workflow&#x2F;experiences?",
      "time": 1625929374,
      "title": "Ask HN: Study Tracking and Notes Tool",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 0,
      "id": 27793776,
      "score": 1,
      "time": 1625929365,
      "title": "Rendezvous with Rama",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Rendezvous_with_Rama"
    },
    {
      "by": "pessimizer",
      "descendants": 0,
      "id": 27793733,
      "score": 1,
      "time": 1625928971,
      "title": "Is Amazon’s Stock Price Justified? What It Means If It Is",
      "type": "story",
      "url": "https://cepr.net/is-amazon-s-stock-price-justified-what-it-means-if-it-is/"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 27793732,
      "score": 1,
      "time": 1625928971,
      "title": "G20 ministers set to green light global tax reform",
      "type": "story",
      "url": "https://techxplore.com/news/2021-07-g20-ministers-green-global-tax.html"
    },
    {
      "by": "billyharris",
      "descendants": 0,
      "id": 27793723,
      "score": 2,
      "time": 1625928946,
      "title": "Pro-Kremlin bots are fuelling chaos and lies about the pandemic",
      "type": "story",
      "url": "https://metro.co.uk/2021/07/10/how-pro-kremlin-bots-are-fuelling-covid-19-conspiracy-theories-14867186/"
    },
    {
      "by": "sonograph",
      "descendants": 0,
      "id": 27793699,
      "score": 1,
      "time": 1625928768,
      "title": "DensityDesign Lab – A New Map of Europe",
      "type": "story",
      "url": "https://densitydesign.org/research/a-new-map-of-europe/"
    },
    {
      "by": "elsewhen",
      "descendants": 0,
      "id": 27793696,
      "score": 2,
      "time": 1625928758,
      "title": "NASA Is Quietly Funding a Hunt for Alien Megastructures",
      "type": "story",
      "url": "https://www.vice.com/en/article/pkbq7z/nasa-is-quietly-funding-a-hunt-for-alien-megastructures"
    },
    {
      "by": "joaquinolmedo",
      "descendants": 0,
      "id": 27793695,
      "score": 1,
      "text": "Hi HN! We are Nico, Agus, Guille, and Joaco and we’re building Filadd — online courses for university admissions exams in Latin America. Not long ago, when we were university students, we built a forum (https:&#x2F;&#x2F;filadd.com) so our college mates could share content, documents, and notes with each other for free. It got a lot of traction, but we couldn’t monetize it. So we looked carefully at our users’ behaviors and noticed a common need: 80% of the students using our forum attended private tutoring classes to prepare for university admissions exams. That is how we decided to build Filadd (https:&#x2F;&#x2F;courses.filadd.com) — a platform that offers online courses for university admissions exams. When we started, we had no money to pay teachers, so we partnered with teachers and shared revenue with them. This model was so good to us that we still maintain it. \nFor each course sale, teachers earn 40% and Filadd earns 60%. This model resulted in the most experienced teachers wanting to work with us and giving excellent service to their students. And it results in 85% of our students reaching their desired score. Now, we work with more than 150 teachers and we are 26 full-time people in the company helping students in Argentina, Chile, Colombia, and Brazil be admitted to the toughest universities. We would love to hear your thoughts and feedback.",
      "time": 1625928734,
      "title": "Show HN: Filadd (YC S21) – Online Courses for LatAm University Admissions",
      "type": "story"
    }
  ]
}