{
  "stories": [
    {
      "by": "Otternonsenz",
      "descendants": 0,
      "id": 30062437,
      "score": 1,
      "text": "In my day job, I work more with simple 2d sketching programs to make home layouts after I measure them (TOTAL Sketch, for those interested).<p>In my free time, I enjoy working with other sketching programs (Procreate for drawing&#x2F;freehand sketching and an old version of SketchUp for 3d work), and would like to not have to use my modified 2011 13” MBP anymore and retire the dang thing for 3d work.<p>But the issue I’m having is I can’t find any iPad software for 3d that isn’t a subscription or prohibitively expensive for a hobbyist. Is the expense of these programs and the subscriptions tied to some of them because of proprietary parametric software patents, or is this the only way to finance software as complicated as Fusion360 or Shapr3d?<p>I just want to be able to model stuff for 3d printing&#x2F; 3d ideation in the same way I can sketch in Procreate, and own the software outright (again, like Procreate), but it feels like there are not enough likeminded people to change the tide on such a piece of software.<p>Willing to pony up the money for something that works, but after getting burned by Adobe in not being able to own my creative software, wary of going with a subscription. Were I not minimally proficient in PHP and some front end languages,I’d love to tackle this problem myself, but I know when I’m out of my depth, haha",
      "time": 1643051593,
      "title": "Ask HN: What is stopping a tablet CAD app that isn’t a subscription?",
      "type": "story"
    },
    {
      "by": "rishikeshs",
      "descendants": 0,
      "id": 30062416,
      "score": 1,
      "text": "I&#x27;ve been trying to get a foundation (NFT Marketplace) for a while now as I&#x27;m planning to sell my art work.<p>Seems like getting an invite requires you to pay someone or be active on some Discord community, that I&#x27;m not a fan off!<p>Any other legit ways to grab one?",
      "time": 1643051519,
      "title": "Ask HN: How to get a Foundation NFT marketplace invite?",
      "type": "story"
    },
    {
      "by": "juristr",
      "descendants": 0,
      "id": 30062409,
      "score": 1,
      "time": 1643051483,
      "title": "Monorepo.tools",
      "type": "story",
      "url": "https://monorepo.tools"
    },
    {
      "by": "guerrilla",
      "descendants": 0,
      "id": 30062380,
      "score": 1,
      "time": 1643051368,
      "title": "Belarusian group claims hack on railway system after Russian troop moves",
      "type": "story",
      "url": "https://www.msn.com/en-us/news/world/belarusian-group-claims-hack-on-railway-system-after-russian-troop-moves/ar-AAT5KHo"
    },
    {
      "by": "ableal",
      "descendants": 0,
      "id": 30062365,
      "score": 1,
      "time": 1643051305,
      "title": "The Tomb and the Telephone Box: Soane's Mausoleum",
      "type": "story",
      "url": "https://publicdomainreview.org/collection/the-tomb-and-the-telephone-box-soane-s-mausoleum-1816/"
    },
    {
      "by": "steelstraw",
      "descendants": 1,
      "id": 30062362,
      "kids": [
        30062389
      ],
      "score": 1,
      "time": 1643051298,
      "title": "Rich Countries Lure Health Workers from Low-Income Nations to Fight Shortages",
      "type": "story",
      "url": "https://www.nytimes.com/2022/01/24/health/covid-health-worker-immigration.html"
    },
    {
      "by": "Shank",
      "descendants": 0,
      "id": 30062349,
      "score": 1,
      "time": 1643051252,
      "title": "Duplicacy: A lock-free deduplication cloud backup tool",
      "type": "story",
      "url": "https://github.com/gilbertchen/duplicacy"
    },
    {
      "by": "pkilgore",
      "descendants": 0,
      "id": 30062331,
      "score": 1,
      "time": 1643051173,
      "title": "JS_of_OCaml: A Bundle Size Study",
      "type": "story",
      "url": "https://www.javierchavarri.com/js_of_ocaml-bundle-size-study/https://www.javierchavarri.com/js_of_ocaml-bundle-size-study/"
    },
    {
      "by": "dorminar",
      "descendants": 0,
      "id": 30062255,
      "score": 6,
      "time": 1643050862,
      "title": "Microsofts' Superior Gaming Business",
      "type": "story",
      "url": "https://www.the-investing-desk.com/microsoft-is-serious-about-being-the-netflix-of-gaming/"
    },
    {
      "by": "backoncemore",
      "descendants": 4,
      "id": 30062247,
      "kids": [
        30062421,
        30062351
      ],
      "score": 6,
      "text": "I&#x27;m tired of everything being political.<p>I&#x27;m tired of constant political emails.<p>I&#x27;m tired of putting my pronouns everywhere.<p>I&#x27;m tired of diversity training.<p>I&#x27;m tired of being ostracized for not believing in wokeism.<p>I&#x27;m tired of social justice.<p>I&#x27;m tired of companies saying they want diversity of thought but disallowing employees to have diversity of thought.<p>The worst thing I ever did was waste my time to pursue a career in this industry. It is toxic from the top to the bottom.<p>So, I&#x27;m done. I will never work for big tech again. The money isn&#x27;t worth it. I&#x27;d rather be paid half the salary at a normal company that doesn&#x27;t feel like a neo-communist enclave.<p>Let the downvotes and societal sanctioned harassment begin.",
      "time": 1643050828,
      "title": "I will never work in big tech again",
      "type": "story"
    }
  ]
}