{
  "stories": [
    {
      "by": "jb1991",
      "descendants": 0,
      "id": 30189173,
      "score": 1,
      "time": 1643867609,
      "title": "Teen's Tesla hack shows how vulnerable third-party apps may make cars",
      "type": "story",
      "url": "https://www.cnn.com/2022/02/02/cars/tesla-teen-hack/index.html"
    },
    {
      "by": "deepmistry",
      "descendants": 1,
      "id": 30189162,
      "kids": [
        30189176
      ],
      "score": 1,
      "time": 1643867544,
      "title": "Meta shares plummet 20% after posting rare profit decline",
      "type": "story",
      "url": "https://www.cnn.com/2022/02/02/tech/facebook-earnings-q4-2021/index.html"
    },
    {
      "by": "oxplot",
      "descendants": 0,
      "id": 30189159,
      "score": 1,
      "time": 1643867527,
      "title": "Starlink Coverage Tracker",
      "type": "story",
      "url": "https://starlink.sx/"
    },
    {
      "by": "colinprince",
      "descendants": 0,
      "id": 30189158,
      "score": 2,
      "time": 1643867524,
      "title": "Self-description, based on an Xkcd comic",
      "type": "story",
      "url": "https://twitter.com/etiennejcb/status/1488935615697723393"
    },
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 30189154,
      "score": 1,
      "text": "New York (CNN Business)Robinhood is still losing money. The platform reported a drop in the number of monthly active users in its most recent quarter. Is it time for the struggling online broker to consider a sale?<p>Even though Robinhood&#x27;s stock has rebounded a bit in the past few days after reporting its latest financial results, it is still trading at only around $14 a share — more than 60% below the initial public offering price of $38 last year.\nAnalysts at Goldman Sachs and Citigroup slashed their price targets on Robinhood following the earnings report. The woeful post-IPO performance for the platform is a sign it may be better off as part of a larger firm, especially given the massive consolidation in the business.\nMorgan Stanley (MS) now owns E-Trade and Charles Schwab (SCHW) has gobbled up TD Ameritrade.\nAnd the deals keep coming. UBS (UBS) just bought roboadvisor Wealthfront (which is popular with millennials and Gen Z investors) last week for $1.4 billion.\nThere&#x27;s little reason for Robinhood investors to be merry\nThere&#x27;s little reason for Robinhood investors to be merry\nSo here&#x27;s a thought: Could Robinhood be a potentially good fit for a company like PayPal (PYPL), which also has a large base of younger customers and is looking to step up its game in investing?\n&quot;Where does Robinhood go from here? I can see them getting bought out or taken private,&quot; said Hugh Tallents, a partner with consulting firm cg42. &quot;But they wouldn&#x27;t be interesting to big banks, Schwab or Morgan Stanley. A wild card could be PayPal.&quot;\nThe case for a PayPal deal\nTallents notes that PayPal plans to introduce more investing features. The company hired an executive who formerly was president at Ally Invest (ALLY), Rich Hagen, to lead a new Invest at PayPal unit last summer.\nPayPal&#x27;s user base, especially the younger adopters of its Venmo service, could fit well with Robinhood, too.\n&quot;Robinhood has over 20 million accounts and the customers are young and active traders,&quot; noted John Wu, president of Ava Labs, a cryptocurrency trading platform. &quot;It&#x27;s an attractive demographic.&quot; Wu added that Robinhood&#x27;s near-term woes could make it a good deal at the right price.\nWall Street seems certain that PayPal is willing to spend to grow. There were rumors last year that the payment portal made a reported $45 billion takeover offer for social media firm Pinterest (PINS). With its current market value of about $12 billion, Robinhood would be a much smaller deal.\nRobinhood CEO: We&#x27;re relentlessly focused on the long-term<p>Robinhood CEO: We&#x27;re relentlessly focused on the long-term 03:41\nPayPal, which will report its latest earnings after the closing bell Tuesday, had no comment when asked by CNN Business if it has any interest in acquiring Robinhood.\nBut PayPal president and CEO Dan Schulman has acknowledged that the company is looking to diversify and add more investing products, such as stock trading, to go along with its crypto services.\n&quot;We expect to launch more features next year, including equity investing capabilities,&quot; Schulman said during a conference call with investors after PayPal reported earnings in November. &quot;It&#x27;s quite exciting to see the initial positive reaction to our app, and we will continue to refine and expand its functionality to help consumers navigate an increasingly digital and connected lifestyle.&quot;\nFor its part, Robinhood chief financial officer Jason Warnick has said that the company is not interested in selling itself.\n&quot;We&#x27;ve made massive investments in the last year around our infrastructure and our team. We&#x27;ve never been better positioned,&quot; Warnick told reporters on a call after last week&#x27;s earnings. &quot;We think the opportunity is big in front of us and we fully intend to pursue it as an independent company.&quot;",
      "time": 1643867494,
      "title": "Should PayPal Buy Robinhood?",
      "type": "story"
    },
    {
      "by": "deepmistry",
      "descendants": 0,
      "id": 30189143,
      "score": 1,
      "text": "Right now, there&#x27;s a shortage of truck drivers in the US and worldwide, exacerbated by the e-commerce boom brought on by the pandemic.<p>One solution to the problem is autonomous trucks, and several companies are in a race to be the first to launch one. Among them is San Diego-based TuSimple.\nFounded in 2015, TuSimple has completed about 2 million miles of road tests with its 70 prototype trucks across the US, China and Europe. Although these are simply commercially available trucks retrofitted with its technology, TuSimple has deals in place with two of the world&#x27;s largest truck manufacturers -- Navistar in the US and Traton, Volkswagen&#x27;s trucking business, in Europe -- to design and build fully autonomous models, which it hopes to launch by 2024.",
      "time": 1643867387,
      "title": "There's a shortage of truckers, but TuSimple thinks it has a solution",
      "type": "story"
    },
    {
      "by": "signa11",
      "descendants": 0,
      "id": 30189133,
      "score": 1,
      "time": 1643867258,
      "title": "Serenity OS with Andreas Kling – CoRecursive Podcast",
      "type": "story",
      "url": "https://corecursive.com/serenity-os-with-andreas-kling/"
    },
    {
      "by": "noduerme",
      "descendants": 1,
      "id": 30189132,
      "kids": [
        30189160
      ],
      "score": 2,
      "time": 1643867216,
      "title": "Did China benefit from Covid-19?",
      "type": "story",
      "url": "https://www.taipeitimes.com/News/editorials/archives/2021/06/15/2003759179"
    },
    {
      "by": "ravipatel1",
      "descendants": 0,
      "id": 30189082,
      "score": 1,
      "text": "A special task force in Brazil is conducting raids deep in the Amazon, in a new crack-down against what they call ‘blood gold’ mining.<p>Mining in territories that are supposed to be protected by law is destroying the lives of indigenous people, and wreaking havoc on the environment.<p>The UK is the third biggest buyer of Brazilian gold, and public prosecutors have alleged that 30% of Brazil’s exports may be illegally mined.<p>The BBC was given exclusive access to film a rare special forces operation. The identities of some of the operatives have been protected.",
      "time": 1643866717,
      "title": "The illegal Brazilian gold you may be wearing",
      "type": "story"
    },
    {
      "by": "ravipatel1",
      "descendants": 0,
      "id": 30189081,
      "score": 1,
      "text": "Russia has condemned a US decision to send extra troops to Europe to support its Nato allies amid continuing fears of a Russian invasion of Ukraine.<p>Moscow said it was a &quot;destructive&quot; step which heightened tension and reduced the scope for a political solution.<p>The Pentagon said 2,000 US troops would be sent from North Carolina to Poland and Germany, and a further 1,000 already in Germany would go to Romania.<p>Russia has some 100,000 troops near Ukraine. It denies planning to invade.<p>The tensions come eight years after Russia annexed Ukraine&#x27;s southern Crimea peninsula and backed a bloody rebellion in the eastern Donbas region.<p>Moscow accuses the Ukrainian government of failing to implement the Minsk agreement - an international deal to restore peace to the east, where Russian-backed rebels control swathes of territory and at least 14,000 people have been killed since 2014.",
      "time": 1643866668,
      "title": "Ukraine tensions: Russia condemns 'destructive' US troops boost in Europe",
      "type": "story"
    }
  ]
}