{
  "stories": [
    {
      "by": "kolbusa",
      "descendants": 0,
      "id": 29171406,
      "score": 1,
      "time": 1636522259,
      "title": "Apple backs off of breaking Face ID after DIY iPhone 13 screen replacements",
      "type": "story",
      "url": "https://www.theverge.com/2021/11/9/22772433/apple-iphone-13-screen-replacements-face-id-software-update"
    },
    {
      "by": "Who828",
      "descendants": 0,
      "id": 29171401,
      "score": 1,
      "time": 1636522198,
      "title": "Why Being Irrational Will Benefit You?",
      "type": "story",
      "url": "https://medium.com/counterarts/being-irrational-52ce07894fb1"
    },
    {
      "by": "rateofchange",
      "descendants": 0,
      "id": 29171399,
      "score": 1,
      "text": "Travelling internationally from the US after not having done so for about three years.  I was surprised to get hit with a request to upload all of our passports, a second form of ID, and other documents to the United Airlines portal before travelling in a few weeks.<p>My immediate thought was:  &quot;No way in hell!&quot;.<p>I used to travel internationally at least once a year.  Did so for probably twenty years.  I&#x27;d just show-up at the airport with my passport and flight documents and that was that.<p>My concern:  With all the data breaches and security&#x2F;privacy issues, how intelligent is it to scan and upload such important and detailed information into an airline&#x27;s website or mobile app?<p>Overthinking it?<p>Trust me, I&#x27;m an airline?",
      "time": 1636522192,
      "title": "Uploading passports, ID's and more to airlines?",
      "type": "story"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 29171385,
      "score": 1,
      "time": 1636522038,
      "title": "Transmission and viral load of SARS-CoV-2 Delta in vax and unvax UK individuals",
      "type": "story",
      "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00648-4/fulltext"
    },
    {
      "by": "catsarebetter",
      "descendants": 0,
      "id": 29171368,
      "score": 1,
      "time": 1636521852,
      "title": "Show HN: RemoteTechJob – Get jobs in your inbox as soon as they're posted",
      "type": "story",
      "url": "https://remotetechjob.co/"
    },
    {
      "by": "kscottz",
      "descendants": 0,
      "id": 29171361,
      "score": 2,
      "time": 1636521786,
      "title": "Grasp Lab Prof. Calls Legged Robots with Guns, “Weapons of Mass Destruction”",
      "type": "story",
      "url": "https://twitter.com/kodlab/status/1458152207921020933"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 29171359,
      "score": 1,
      "time": 1636521775,
      "title": "UK in serious discussions about Britcoin CBDC",
      "type": "story",
      "url": "https://www.theregister.com/2021/11/10/uk_cbdc_consultation/"
    },
    {
      "by": "efraim",
      "descendants": 0,
      "id": 29171348,
      "score": 1,
      "time": 1636521680,
      "title": "Linux Hates Me – Daily Driver Challenge Pt.1",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=0506yDSgU7M"
    },
    {
      "by": "heyzk",
      "descendants": 0,
      "id": 29171319,
      "score": 2,
      "text": "I&#x27;ve looked around a bit and can&#x27;t really find a satisfying answer to this question. There are posts on answer sites, but these often boil down to &quot;dynamic languages are good at glue&quot;, or &quot;Tensorflow &#x2F; Jupyter&quot;.<p>That can&#x27;t be the whole story, can it? Or if it is, why did these projects choose Python over other scripting lanuages?<p>I bet there&#x27;s some interesting history here.",
      "time": 1636521293,
      "title": "Ask HN: How did Python become the lingua franca of ML/AI?",
      "type": "story"
    },
    {
      "by": "mostertoaster",
      "descendants": 1,
      "id": 29171313,
      "kids": [
        29171336
      ],
      "score": 2,
      "text": "Or when someone asks “Do you believe in climate change?” is it saying do you believe climate change is something we should fear?<p>When the science says the icebergs are going to; melt, there will be more hurricanes, coastal and island towns will be flooded and the areas become uninhabitable at least if not underwater entirely, I, not being a climate scientist, will gladly assent that it is possible and I would submit on the appeal to authority that it is true.<p>However, does assenting to that being true, mean I “believe in climate change” if I completely disagree with the popular, political, and corporate ideas of what to do about it?",
      "time": 1636521269,
      "title": "Ask HN: Can I believe in climate change, but not fear it?",
      "type": "story"
    }
  ]
}