{
  "stories": [
    {
      "by": "PaulHoule",
      "descendants": 0,
      "id": 30806452,
      "score": 3,
      "time": 1648238268,
      "title": "Two 20-year-olds charged in alleged $1.1M NFT scam",
      "type": "story",
      "url": "https://nypost.com/2022/03/24/two-20-year-olds-charged-in-alleged-1-1m-nft-scam/"
    },
    {
      "by": "memish",
      "descendants": 0,
      "id": 30806443,
      "score": 1,
      "time": 1648238207,
      "title": "The Myth That Most Americans Hate Their Job",
      "type": "story",
      "url": "https://www.theatlantic.com/newsletters/archive/2022/03/american-great-resignation-hate-work/627761/"
    },
    {
      "by": "swyx",
      "descendants": 0,
      "id": 30806415,
      "score": 4,
      "time": 1648237966,
      "title": "Should I Open Source my Company?",
      "type": "story",
      "url": "https://supabase.com/blog/2022/03/25/should-i-open-source-my-company"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30806385,
      "score": 1,
      "time": 1648237770,
      "title": "WCAG Audit of DokuWiki (2021)",
      "type": "story",
      "url": "https://www.dokuwiki.org/wcag-audit"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30806382,
      "score": 1,
      "time": 1648237762,
      "title": "Bookbinding (2006)",
      "type": "story",
      "url": "https://briansawyer.net/craft/bookbinding/"
    },
    {
      "by": "kryptokommunist",
      "descendants": 0,
      "id": 30806381,
      "score": 1,
      "text": "Is there something like Algolia (e.g. https:&#x2F;&#x2F;hn.algolia.com ) for custom web search? Some solution where I can create a custom search engine that will only search whitelisted blogs&#x2F;twitter users&#x2F;Youtubers etc.?<p>Ideally a solution would let me enter my favorite blogs and let me connect my social media accounts and then automatically search only content of users I follow. I haven&#x27;t found anything like this.<p>Maybe someone here wants to build this if this does not already exist :) This would solve the problem of Google results getting less valuable due to SEO. Custom whitelisted search could be used to only search within a network of trust. And maybe you could extend this, e.g. by also trusting users that are trusted by users you trust directly.",
      "time": 1648237755,
      "title": "Startup Idea/Question: Custom web search (only blogs/media/users you trust)?",
      "type": "story"
    },
    {
      "by": "mikpanko",
      "descendants": 0,
      "id": 30806360,
      "score": 1,
      "text": "Many of us have been watching the horrifying developments in Ukraine over the past month and are wondering if and how we can help. Many are donating money to humanitarian causes but some are also wondering: can we help in a more scalable way through our tech skills?<p>There is a major problem with getting accurate information about what is happening on the ground in Ukraine. In the world of the internet and smartphones, there is an abundance of video, image and text accounts coming out but they are overwhelming, unstructured and contain a significant number of fakes. This leads to proliferation of misinformation, confusion and the ability of malicious actors to spread their own fake narratives, prolonging the conflict and causing additional damage.<p>Here is a prominent example (as of March 25). The city of Mariupol is surrounded by Russian forces with hundreds of thousands of civilians trapped inside. The city is heavily bombed and people live in basements for weeks. There are reports of hundreds or even thousands of civilian deaths and of a major humanitarian crisis with the lack of clean water, food and medicine. There is an account of the situation from two journalists, who have recently escaped the city: [1], [2]. They report Russian soldiers being responsible for the situation and provide videos and photos. There are also accounts from pro-government Russian media about Mariupol, for example: [3], [4]. They report Ukrainian soldiers not letting civilians leave the city and providing videos, photos and possibly witness accounts.<p>Can we apply skills in big data, analytics and machine learning to help?<p>We believe we can use the power of:\n- thousands of people to collect, label and connect pieces of evidence\n- dozens of ML groups to run their ML algorithms to establish truthfulness\n- data experts to systematize and make evidence widely available and searchable<p>This can help:\n- more people around the world to be better informed instead of only following sources from one information bubble they happen to be in\n- governments to better understand casualties and damage\n- volunteers on the ground to coordinate their efforts more effectively\n- people who lost touch with relatives and friends in the conflict zone to find more about them through image search\n- the world to document and preserve information about the big historic event\n… and in many more ways, which we can’t think of ourselves right now.<p>Here is the link with more details about the project: https:&#x2F;&#x2F;bit.ly&#x2F;ukraine-evidence.<p>We are looking for the project leader and 1st ring team members (see the last section of the document for details). Reach out to ukraine.evidence@gmail.com if you are interested and share the document with others who might be.<p>[1] https:&#x2F;&#x2F;apnews.com&#x2F;article&#x2F;russia-ukraine-europe-edf7240a9d990e7e3e32f82ca351dede<p>[2] https:&#x2F;&#x2F;meduza.global.ssl.fastly.net&#x2F;feature&#x2F;2022&#x2F;03&#x2F;21&#x2F;mstislav-chernov-i-evgeniy-maloletka-ostalis-edinstvennymi-zhurnalistami-v-mariupole-i-pokazali-miru-obstrelyannyy-roddom<p>[3] https:&#x2F;&#x2F;russian.rt.com&#x2F;russia&#x2F;article&#x2F;980673-bezhency-mariupol-yaroslavl-istorii<p>[4] https:&#x2F;&#x2F;t.me&#x2F;margaritasimonyan&#x2F;10764",
      "time": 1648237607,
      "title": "Ukraine Evidence: open data and information verification project for Ukraine",
      "type": "story"
    },
    {
      "by": "ramoswriter",
      "descendants": 0,
      "id": 30806352,
      "score": 2,
      "time": 1648237566,
      "title": "How to Reframe Imposter Syndrome",
      "type": "story",
      "url": "https://twitter.com/_shahedk/status/1458505536601681924"
    },
    {
      "by": "ancieque",
      "descendants": 0,
      "id": 30806326,
      "score": 1,
      "time": 1648237380,
      "title": "pg_auto_failover_health_monitor: Simple service to track Postgres service health",
      "type": "story",
      "url": "https://github.com/neuroforgede/pg_auto_failover_ansible/tree/master/tools/health_monitor"
    },
    {
      "by": "trifit",
      "descendants": 0,
      "id": 30806304,
      "score": 2,
      "time": 1648237250,
      "title": "‘The Vibe Plays a Big Part’",
      "type": "story",
      "url": "https://www.argonautnews.com/westsiders/the-vibe-plays-a-big-part/article_62bf4858-aadb-11ec-b221-0f00425017a6.html"
    }
  ]
}