{
  "stories": [
    {
      "by": "delgaudm",
      "descendants": 0,
      "id": 30491851,
      "score": 1,
      "time": 1645991395,
      "title": "Where Is Netflix Available?",
      "type": "story",
      "url": "https://help.netflix.com/en/node/14164"
    },
    {
      "by": "underscore_ku",
      "descendants": 0,
      "id": 30491843,
      "score": 1,
      "time": 1645991360,
      "title": "Norway's sovereign wealth fund to divest Russian assets",
      "type": "story",
      "url": "https://www.axios.com/norway-divest-russia-asset-ccfcdc53-2574-464a-90f4-14d0955ec7f0.html"
    },
    {
      "by": "_jae_",
      "descendants": 0,
      "id": 30491833,
      "score": 1,
      "text": "Obviously, whats happening in the Ukraine right now sucks - reading about civilians being killed just leaves me incredibly scared, angry, sad and most of all helpless. It feels hypocritical to me to continue my daily life as before while there is a war going on in Europe. But is there anything that we - &#x27;normal&#x27; people - can&#x2F;should do? Should I donate a part of my income? Any other ideas?<p>Sidenote: I don&#x27;t want to support Ukrainian government but ordinary civilians. Judging from all I know, Russia are the &#x27;bad guys&#x27; but all my information comes from western media so it is likely biased. Thus, I do not want to support any kind of war actions in itself, I rather want to help people that have to suffer from the consequences.",
      "time": 1645991314,
      "title": "Ask HN: Anything an ordinary person can do to support civilians in the Ukraine?",
      "type": "story"
    },
    {
      "by": "belter",
      "descendants": 1,
      "id": 30491806,
      "kids": [
        30491807
      ],
      "score": 1,
      "time": 1645991195,
      "title": "Sanctions spark Russia bank run fears",
      "type": "story",
      "url": "https://www.telegraph.co.uk/business/2022/02/27/russia-braced-free-fall-rouble-swift-payment-network/"
    },
    {
      "by": "uberf1sh",
      "descendants": 0,
      "id": 30491798,
      "score": 2,
      "text": "Hello, I&#x27;m uberf1sh, software engineer (I&#x27;ve previously worked for Amazon and Fortnite, though obviously none of the following as to do with my previous employers).<p>My cousin introduced me to online poker in 2008 and I loved it instantly, playing $2 cash games for fun and glory. Though I was initially pretty bad, I had a lot of fun playing. Indeed, in 2008 the game was really amazing because it was so chaotic and full of crazy plays, your blood was pumping before even sitting at the table. Fast forward I was able to make $1000 a day in Vegas, spending it all on sneakers, restaurants and some other unspeakable stuff (you know the drill, what happens in Vegas stays in Vegas).<p>5 years ago, things started to take a real bad turn for online poker. The game slowly but surely became incredibly boring. Most regular players started to all adopt a strategy called <i>tight-passive</i>. <i>Tight</i> means you play only the best starting hands and <i>passive</i> means you don&#x27;t bet or raise from your own initiative, you let your opponent bet and raise on your behalf. The <i>tight</i> part isn&#x27;t much of an issue for the fun because there is counter strategies (e.g. setting mines) that keeps thing sensational. However the <i>passive</i> component of that strategy is absolutely dreadful for the fun of the game.<p>Passive poker is simply an anti-game strategy. When it comes to games and sports in general, an anti-game strategy works as follows: you are not reaching for a win, but instead, you want to make the game so boring and frustrating, your opponents become crazy. Passive poker is definitely beatable, but while a passive player don&#x27;t win much, he doesn&#x27;t loose much as well. The player keeps its score close to zero and wait patiently that his opponents get crazy enough to make a mistake (while looting beginners).<p>In short, it kills the game entirely. Nowdays, online cash games (especially at lower stakes) are ridiculously passive. The biggest bluff you can expect to see on some tables will be for 3BB top (big blinds). You will never ever see a 3-barrel bluff with air anymore from a regular (unless you&#x27;re playing <i>nose-bleed</i> stakes). You can&#x27;t set mines either because they wont bet big enough to make it worth it and they will stop betting mostly after the flop. You can often see players literally not betting a dime on the flop, turn and river, even with monster hands. It hurts to see a player check on the river when he speaks last, only to discover they have the nuts - he wants to hurt you that&#x27;s the point.<p>It&#x27;s time for passive poker to go. So I&#x27;ve built Rebluff Poker. Rebluff Poker is the first gaming platform dedicated to loose-aggressive no limit hold&#x27;em. The game is in every bit the same, except, each and every player has to bet or raise to some extent on average, or gets to pay a significant penalty in the form of antes (up to 5BB per hand for a multi passive recidivist). For a decently aggressive player, it makes no difference.<p>The game is also much more fun for beginners. Playing loose-aggressive against beginners lead to a higher variance which means the beginners still win occasionally.<p>The game is not for real money yet. The plan is to raise money to get a gaming license from Kahnawake Gaming Commission (http:&#x2F;&#x2F;www.gamingcommission.ca&#x2F;). If you know someone with the money and a knack for administrative stuff, please email me.<p>Well now, time to grab a drink all. Dealers, let&#x27;s shuffle and deal.<p>https:&#x2F;&#x2F;rebluff.poker<p>https:&#x2F;&#x2F;discord.gg&#x2F;TQxqxEpxbS<p>uberf1sh)at(rebluff.poker",
      "time": 1645991097,
      "title": "Show HN: Rebluff Poker, no limit hold'em for loose-aggressive players",
      "type": "story"
    },
    {
      "by": "luu",
      "descendants": 0,
      "id": 30491797,
      "score": 1,
      "time": 1645991087,
      "title": "Our Android Framework (2019)",
      "type": "story",
      "url": "https://www.wave.com/en/blog/android/"
    },
    {
      "by": "based2",
      "descendants": 0,
      "id": 30491771,
      "score": 1,
      "time": 1645990905,
      "title": "Budapest Memorandum on Security Assurances",
      "type": "story",
      "url": "https://en.wikipedia.org/wiki/Budapest_Memorandum_on_Security_Assurances"
    },
    {
      "by": "hhs",
      "descendants": 0,
      "id": 30491766,
      "score": 1,
      "time": 1645990853,
      "title": "Lego robot with an organic ‘brain’ learns to navigate a maze",
      "type": "story",
      "url": "https://www.scientificamerican.com/article/lego-robot-with-an-organic-brain-learns-to-navigate-a-maze/"
    },
    {
      "by": "iapsngh",
      "descendants": 0,
      "id": 30491752,
      "score": 2,
      "time": 1645990761,
      "title": "Enjoy Reading and Writing Poems",
      "type": "story",
      "url": "https://polkasky.com/posts/reading-writing-poems"
    },
    {
      "by": "zqna",
      "descendants": 0,
      "id": 30491739,
      "score": 1,
      "time": 1645990685,
      "title": "Resources for Ukrainian Refugees and Supporters",
      "type": "story",
      "url": "https://docs.google.com/document/u/0/d/1OlZIz-72A2xI2uUOFE07L5ObQGP4JDcXZ2vdIs2P9BQ/mobilebasic"
    }
  ]
}