{
  "stories": [
    {
      "by": "Txoko",
      "descendants": 0,
      "id": 30502170,
      "score": 1,
      "text": "And they have good reason to believe that as the u.s. NIH fauci funded gain-of-function in Wuhan fauci, then c-19 got out and it ruined the world Russia and China asked the UN for the United States allies to be checked and limited in BIO capabilities for months ago. What do you all know what this means? China? And Russia, indirectly incorrectly blame the u.s. From the you. For the c-19 outbreak and are fearful that the US allies have more viruses, bio weapons to let out.<p>That&#x27;s wild. That was known that the u.s. Fauci was suspected of being behind covid-19 which we all knew. Hmm, and they&#x27;re trying to blame China with the Wu Han thing because they probably Let it Loose there somehow they probably, you know, well, they were funding that too. So they had a way to throw the you know, light over there. Meanwhile to doing all this shit in Ukraine because nobody&#x27;s looking at Ukraine. Nobody knows they have labs in Ukraine. He&#x27;s worried about China and Russia. Nobody&#x27;s worried about Ukraine. So they&#x27;re, they&#x27;re saying China and Russia indirectly and correctly, blamed the u.s. For the outbreak, and they&#x27;re fearful that there&#x27;s more bioweapons. They&#x27;re going in there to destroy the labs. To take that to just take that plan a way. That&#x27;s what&#x27;s going on. All the China. Not that they&#x27;re good or, you know, anything, we don&#x27;t know, but they&#x27;re being used as like a red herring, using the Wuhan thing. This way they can go in quietly, get Ukraine. Andrew weird the world that problem where they&#x27;re doing all this and they&#x27;re doing it all the fucking taxpayers money. Finally, get in there, Hunter, buying all this oils, you know, these energy coming all that&#x27;s bullshit. It&#x27;s all going into doing this stuff to kill people.<p>And they knew about the complaint. Was that in the news that the u.s. Was accused of this by China and Russia? No, this is massive. Yeah, I&#x27;m disturbed that I hadn&#x27;t. I didn&#x27;t know about this 3:56 months ago. Putin also continues to call it a special military. Operation says he wants to demilitarize and did not see find the country, but not occupy. It. What does he mean by that? Was he what he is. He really Paulson Zone says Russian President Vladimir Putin announced that they have special military operation, you know, about that here are all the current strike locations. Notice that the strike locations match the bio labs in the Ukraine. Look to your left. Look to your right. Looks like they&#x27;re all the same. Now compare this to the bio labs and Ukraine. I&#x27;m still not fake. And so anyway, you see how this seems to be adding up. Patel Patriot said, here&#x27;s my take on. What&#x27;s Happening Ukraine Russia. I&#x27;m not spitballing here like everybody else. I had more questions than I do answers member last video, but guys I said, are you confused me Ted this yesterday?<p>The epicenter of corruption for the political establishment, Victor bitch George Soros your clump color, musky, all funding deep State agendas worldwide all based out of Ukraine. We know their times the Clinton foundation and liberal politics in America. And if truck was going to truly drain the swamp, he would have to tackle corruption in Ukraine and all the guards have funded their own militia militaries. In previous color revolutions. Trump couldn&#x27;t wouldn&#x27;t be able to take them down without a fight. So of trump is going to clean up Ukraine, he would likely have boots on the ground to do it and to Putin. It&#x27;s no secret to put. Make sorrow, says, he banned him from the Russia long ago. He&#x27;s never here.",
      "time": 1646068036,
      "title": "Clandestine Ukraine Bio-Labs",
      "type": "story"
    },
    {
      "by": "spamizbad",
      "descendants": 0,
      "id": 30502169,
      "score": 1,
      "time": 1646068035,
      "title": "Larry Summers Shares the Blame for Inflation",
      "type": "story",
      "url": "https://archive.fo/CHNBw"
    },
    {
      "by": "wolverine876",
      "descendants": 0,
      "id": 30502152,
      "score": 1,
      "time": 1646067943,
      "title": "The Election for the Future of the Internet",
      "type": "story",
      "url": "https://www.lowyinstitute.org/the-interpreter/election-future-internet"
    },
    {
      "by": "maxicarlos08",
      "descendants": 0,
      "id": 30502147,
      "score": 1,
      "time": 1646067918,
      "title": "GitLens 12 – Visual Studio Code Online Support and Premium Features",
      "type": "story",
      "url": "https://www.gitkraken.com/blog/gitlens-12"
    },
    {
      "by": "borepop",
      "descendants": 1,
      "id": 30502117,
      "kids": [
        30502177
      ],
      "score": 27,
      "time": 1646067761,
      "title": "All private records breached on California Bar website",
      "type": "story",
      "url": "https://www.calbar.ca.gov/About-Us/News/News-Releases/state-bar-of-california-addresses-breach-of-confidential-data"
    },
    {
      "by": "0xedb",
      "descendants": 0,
      "id": 30502115,
      "score": 21,
      "time": 1646067755,
      "title": "Ukrainian president signs formal request to join the European Union",
      "type": "story",
      "url": "https://www.reuters.com/world/europe/ukrainian-president-signs-formal-request-join-european-union-2022-02-28/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30502107,
      "score": 1,
      "time": 1646067699,
      "title": "The influence of organizational structure on code quality (2008) [pdf]",
      "type": "story",
      "url": "https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/tr-2008-11.pdf"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 30502103,
      "score": 1,
      "time": 1646067677,
      "title": "The Underground Story of Slow Cooking",
      "type": "story",
      "url": "https://tastecooking.com/the-underground-story-of-slow-cooking/"
    },
    {
      "by": "NaOH",
      "descendants": 0,
      "id": 30502098,
      "score": 4,
      "time": 1646067662,
      "title": "I'm Common as Muck and Spent £150 to Try a Michelin Star Restaurant",
      "type": "story",
      "url": "https://www.birminghammail.co.uk/whats-on/food-drink-news/im-common-muck-spent-150-23194880"
    },
    {
      "by": "hunglee2",
      "descendants": 0,
      "id": 30502093,
      "score": 2,
      "time": 1646067612,
      "title": "How to Help the People in Ukraine",
      "type": "story",
      "url": "https://github.com/AndrewStetsenko/Support-Ukraine/blob/main/README.md"
    }
  ]
}