{
  "stories": [
    {
      "by": "tmaly",
      "descendants": 0,
      "id": 29655376,
      "score": 1,
      "text": "I have learned quite a bit from TikTok surprisingly.  Sometimes it is new recipe to cook. Other times it might be how to clean a microwave with lemon juice. I think there is a lot of potential for short form video.  I am just not sure if any methods or tips exist to create repeatable content that is great for learning.<p>What are some of your favorite examples short form videos ( less than 2 min ) on any platform that you think represent some of the best techniques to teaching something?",
      "time": 1640207973,
      "title": "Ask HN: Short Form Video for Education?",
      "type": "story"
    },
    {
      "by": "vo2maxer",
      "descendants": 0,
      "id": 29655371,
      "score": 1,
      "time": 1640207947,
      "title": "Factoring in the Chicken McNugget Monoid (2018) [pdf]",
      "type": "story",
      "url": "https://www.shsu.edu/stc008/chickennuggets.pdf"
    },
    {
      "by": "hemmert",
      "descendants": 1,
      "id": 29655340,
      "kids": [
        29655372
      ],
      "score": 1,
      "text": "I&#x27;m running a printable escape room app, Escape Team (www.escape-team.com, HN hugged it do death when I posted it. But it is great to see that you&#x27;re enjoying it!) – and it is scaling quickly.<p>I am at a point where I can&#x27;t go on holiday without checking my email daily for customer support requests. That&#x27;s great, but also I think I need to put in a system here that&#x27;s better than my current one-man-show thing.<p>It&#x27;s mainly people having trouble with a puzzle, with a voucher code they received as a gift, or other &#x27;FAQ&#x27; things. Right now, this is a great driver for positive App Store reviews, as people like the responsive and prompt customer service, even if it&#x27;s them forgetting to put the dashes into the voucher code. (I could even automate most of the things people askf or, but I&#x27;d lose the source for positive App Store reviews!)<p>So I&#x27;m totally fine with giving them a human person to talk to, and I&#x27;ll happily pay that person – but I&#x27;d like to hear your opinion on how to do that.<p>I&#x27;m thinking about<p>- hosting a ticket system on my servers\n- renting a hosted ticket system<p>and forwarding my support@ email to that system, and then<p>- hiring a freelance customer service person on UpWork or Fiverr to work on those tickets – and, of course, giving that person all the material they need.<p>I&#x27;d be very interested in your experiences with<p>- ticket systems (self-hosted or hosted, but these can easily get expensive?)\n- customer service outsourcing (which feels very very awkward, I&#x27;m having trouble letting go here).<p>Any thoughts are welcome! Do you outsource customer service on your projects? Or do you check your mail daily even while on holiday? As you might guess from the time of the year I&#x27;m posting this and from the nature of a &#x27;family activity&#x27; like Escape Team – it&#x27;s especially acute over Christmas and New Year&#x27;s...<p>Thank you!\n—Fabian",
      "time": 1640207836,
      "title": "Ask HN: How do you professionalize/outsource customer service?",
      "type": "story"
    },
    {
      "by": "ericmay",
      "descendants": 0,
      "id": 29655317,
      "score": 1,
      "time": 1640207748,
      "title": "Biden Extends Student Loan Moratorium Until May",
      "type": "story",
      "url": "https://twitter.com/potus/status/1473721877654867969"
    },
    {
      "by": "jokull",
      "descendants": 0,
      "id": 29655316,
      "score": 1,
      "time": 1640207747,
      "title": "Mypy 0.930 released with TypeAlias and better dict typing",
      "type": "story",
      "url": "http://mypy-lang.blogspot.com/2021/12/mypy-0930-released.html"
    },
    {
      "by": "riffic",
      "descendants": 1,
      "id": 29655281,
      "kids": [
        29655312
      ],
      "score": 1,
      "time": 1640207577,
      "title": "Jack Dorsey’s hot takes are apparently too much for Marc Andreessen to handle",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/22/22850558/jack-pmarca-a16z-web3-block-twitter"
    },
    {
      "by": "elorant",
      "descendants": 0,
      "id": 29655256,
      "score": 1,
      "time": 1640207456,
      "title": "BioNTech's mRNA Cancer Vaccine Has Started Phase 2 Clinical Trial",
      "type": "story",
      "url": "https://interestingengineering.com/biontechs-mrna-cancer-vaccine-has-started-phase-2-clinical-trial"
    },
    {
      "by": "vinu1",
      "descendants": 1,
      "id": 29655252,
      "kids": [
        29655347
      ],
      "score": 1,
      "text": "How do you make any document truly digital with verifiable security, permissions, authenticity, expiration, transmission and storage with full traceability and accountability using blockchain? Are there any existing tools&#x2F;solutions out there?",
      "time": 1640207434,
      "title": "Blockchain Document Management System",
      "type": "story"
    },
    {
      "by": "jkuria",
      "descendants": 0,
      "id": 29655206,
      "score": 1,
      "time": 1640207239,
      "title": "Which One Generated More Sales? With or Without Delivery Date?",
      "type": "story",
      "url": "https://capitalandgrowth.org/which-one-won-with-or-without-delivery-date/"
    },
    {
      "by": "gibolt",
      "descendants": 0,
      "id": 29655076,
      "score": 2,
      "time": 1640206642,
      "title": "NFTs Are Pointless [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=4-1psMHSpKs"
    }
  ]
}