{
  "stories": [
    {
      "by": "riccomini",
      "descendants": 0,
      "id": 29152061,
      "score": 1,
      "time": 1636394176,
      "title": "Work for Two Companies",
      "type": "story",
      "url": "https://cnr.sh/essays/work-for-two-companies"
    },
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29152058,
      "score": 1,
      "time": 1636394164,
      "title": "Engaging Black students in computing at UK schools",
      "type": "story",
      "url": "https://www.raspberrypi.org/blog/engaging-black-students-in-computing-uk-schools-joe-arday/"
    },
    {
      "by": "nfthrowaway",
      "descendants": 0,
      "id": 29152054,
      "score": 1,
      "text": "Basically overnight, my net worth went from ~$200k to ~$7m (potentially more) due to a crypto project I did with a friend. I genuinely think crypto is a scam and a bubble, so I&#x27;m looking for any advice on what to invest in <i>outside</i> of the crypto space. I&#x27;m early 30s, single, USA. Most of my $$$ unlocks in ~48 months, but I have ~$1m or so immediately liquid. A few things I&#x27;m worried about:<p><pre><code>    - Taxes and tax complications\n    - Actually pulling it out of crypto into fiat\n    - Using this wealth to generate more wealth in less speculative ways\n    - I haven&#x27;t quit my day job, but considering it\n</code></pre>\nAny other advice is appreciated.",
      "time": 1636394156,
      "title": "Ask HN: How to Best Invest Windfall?",
      "type": "story"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 29152034,
      "score": 1,
      "time": 1636394061,
      "title": "New Orleans Man Will Get His Life Savings Back from Feds",
      "type": "story",
      "url": "https://ij.org/press-release/new-orleans-man-will-get-his-life-savings-back-federal-government-agrees-to-dismiss-case-clearing-his-name/"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 29152029,
      "score": 1,
      "time": 1636394026,
      "title": "The Probability of Human Existence Is Infinitesimally Small",
      "type": "story",
      "url": "https://nav.al/existence"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29152024,
      "score": 1,
      "time": 1636394004,
      "title": "Salt Bae’s Next Great Act? Endless Content",
      "type": "story",
      "url": "https://www.wired.com/story/salt-bae-restaurant-viral-videos/"
    },
    {
      "by": "falcor84",
      "descendants": 0,
      "id": 29152021,
      "score": 1,
      "time": 1636393967,
      "title": "Padé Approximants",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=szMaPkJEMrw"
    },
    {
      "by": "yhoneycomb",
      "descendants": 0,
      "id": 29152018,
      "score": 1,
      "time": 1636393959,
      "title": "RocWiki, the Largest Local Wiki",
      "type": "story",
      "url": "https://rocwiki.org/"
    },
    {
      "by": "joey-twoface",
      "descendants": 0,
      "id": 29152016,
      "score": 1,
      "text": "I&#x27;m currently working at a startup along with two other cofounders, we&#x27;re three years in, and a few employees. I find the two other co-founders completely incompetent (our head of marketing&#x2F;cmo and our ceo). I&#x27;m the only woman and I feel like I&#x27;m being completely shut down by the CEO, a guy who not only happens to be incredibly intolerable to work with – nearly impossible – but also a massive narcissist. He&#x27;s the typical know-all guy, cannot&#x2F;won&#x27;t accept any advice or criticism. He&#x27;ll shut down whatever idea I might have, only to come around a few months later suggesting the exact same ideas I proposed and completely neglecting the fact that he got those ideas from me. When I call him out on it and tell him that I brought idea X up a few months ago, he sighs and tells me I focus too much on minor, irrelevant details which is incredibly infuriating. I try to be as professional as possible and brush off all the insults but it&#x27;s reaching a point of no return.<p>I am by no means flawless, I know what I&#x27;m good at and what I&#x27;m not good at, but he&#x27;s criticising me on my area of expertise and shutting my ideas down that I know could work for us. There&#x27;s a reason I have my CXO role and he&#x27;s the CEO - he&#x27;s great with investors and the face outwards which is just what the investors happen to see, but internally he&#x27;s a mess and completely incompetent from running our business.<p>We just received a round 3 funding from our investors and I sense that the investors aren&#x27;t happy with our performance. Things are going okay, but they&#x27;re obviously expecting more. Just this week one of investors asked me (and me alone) if we could grab lunch next week - I have a feeling they&#x27;ll ask me about our lack of progress and the synergy with the other co-founders and I&#x27;m not sure how honest I should be. I want to tell them that our ceo is completely incompetent and that we&#x27;re getting nowhere because he&#x27;s a giant asshole who refuses to collaborate, but I also don&#x27;t wanna throw him under the bus and completely ruin the ties with the investors because one day I want to jump ship and I wanna leave on a good note.<p>How honest should I be with the investor(s)?",
      "time": 1636393956,
      "title": "In a bit of pickle with the investors for a startup I work at – advice needed",
      "type": "story"
    },
    {
      "by": "vdemedes",
      "descendants": 0,
      "id": 29152008,
      "score": 1,
      "time": 1636393920,
      "title": "Show HN: Insomnia-like client for SQLite",
      "type": "story",
      "url": "https://rosefinchapp.com"
    }
  ]
}