{
  "stories": [
    {
      "by": "kipply",
      "descendants": 0,
      "id": 31601678,
      "score": 1,
      "time": 1654210950,
      "title": "Exploration of Escape Analysis in Language Implementations",
      "type": "story",
      "url": "https://kipp.ly/blog/escape-analysis/"
    },
    {
      "by": "samorozco",
      "descendants": 0,
      "id": 31601666,
      "score": 1,
      "time": 1654210896,
      "title": "Watch and Organize Directories with Go",
      "type": "story",
      "url": "https://github.com/SamOrozco/file_organizer"
    },
    {
      "by": "Figgy24",
      "descendants": 0,
      "id": 31601640,
      "score": 1,
      "time": 1654210733,
      "title": "Interview Prep Fireside Chat with Senior Meta Engineer",
      "type": "story",
      "url": "https://discord.com/invite/NKFGEzav5M"
    },
    {
      "by": "alexzeitler",
      "descendants": 0,
      "id": 31601638,
      "score": 1,
      "time": 1654210721,
      "title": "How I would start my next Startup in Germany without a GmbH",
      "type": "story",
      "url": "https://richventures.com/posts/how-i-would-start-my-next-startup-in-germany-without-a-gmbh"
    },
    {
      "by": "joealfaro",
      "descendants": 0,
      "id": 31601634,
      "score": 1,
      "text": "Heartex | Remote (EU, North America, South America) | https:&#x2F;&#x2F;heartex.com&#x2F;careers<p>The power of prediction starts with Heartex (https:&#x2F;&#x2F;heartex.com). We build software that helps people do what only they can do – give meaning (https:&#x2F;&#x2F;github.com&#x2F;heartexlabs&#x2F;label-studio)<p>We are currently hiring for Backend Engineers, Architects, and Engineering leaders. We are a fully distributed organization with people all over the world. With team members in North America, Europe, and South America across 6 countries.<p>Stack: React, Python, Django, Postgres, Kubernetes<p>As the VP of Engineering feel free to reach out to me directly (joe@hearex.com), contact our Head of Talent (brandi@heartex), or apply via our careers page (https:&#x2F;&#x2F;heartex.com&#x2F;career)<p>More about Heartex: \nData fills our modern world. It flows prolifically inside organizations, customer interactions, through product usage, environmental research, healthcare imaging, and beyond. What if we could use any of that historical data to predict the future? The fact is, in most cases we can make predictions through Machine Learning and AI, but to do so in a meaningful and impactful way, historical data needs to be accurate, comprehensive, and absent of bias.<p>In order to make the best predictions, we believe internal teams with domain expertise should be responsible for annotating and curating data. It&#x27;s called data labeling, and it’s a process of real people giving meaning to the information they see on the screen. Heartex was founded to take data labeling to the next level.<p>We believe that data labeling is a team sport. Data scientists, subject matter experts, engineers, operations, and annotators must work collaboratively to ensure quality results and an efficient process. That’s why we created Label Studio, which has quickly become the most popular open source data labeling platform with 100,000 users around the world, alongside a community of thousands of data scientists sharing knowledge and working to advance data-centric AI.<p>We are excited to announce that Heartex has recently raised $25 million in Series A funding, bringing our total funds raised to $30 million from notable investment partners Redpoint Ventures, Unusual Ventures, Bow Capital, Swift Ventures, as well as angel investors.",
      "time": 1654210708,
      "title": "Heartex – Remote (EU, North America, South America)",
      "type": "story"
    },
    {
      "by": "2pEXgD0fZ5cF",
      "descendants": 0,
      "id": 31601633,
      "score": 2,
      "time": 1654210703,
      "title": "The Odin Programming Language",
      "type": "story",
      "url": "https://github.com/odin-lang/Odin"
    },
    {
      "by": "carride",
      "descendants": 0,
      "id": 31601609,
      "score": 1,
      "time": 1654210524,
      "title": "Canon Printers Restarting Repeatedly After Connecting to WiFi",
      "type": "story",
      "url": "https://old.reddit.com/r/printers/comments/v1vmpe/canon_mx492_restarting_repeatedly_after/"
    },
    {
      "by": "sien",
      "descendants": 0,
      "id": 31601603,
      "score": 3,
      "time": 1654210475,
      "title": "Chinese Aircraft Carrier Seen with a Fleet of Drones on Its Deck",
      "type": "story",
      "url": "https://www.thedrive.com/the-war-zone/chinese-aircraft-carrier-seen-with-fleet-of-drones-onboard"
    },
    {
      "by": "hlove",
      "descendants": 1,
      "id": 31601601,
      "kids": [
        31601735
      ],
      "score": 3,
      "time": 1654210454,
      "title": "An on-chip photonic deep neural network for image classification",
      "type": "story",
      "url": "https://www.nature.com/articles/s41586-022-04714-0"
    },
    {
      "by": "sph",
      "descendants": 0,
      "id": 31601546,
      "score": 2,
      "time": 1654210133,
      "title": "Why OpenStreetMap is in Serious Trouble (2018)",
      "type": "story",
      "url": "https://blog.emacsen.net/blog/2018/02/16/osm-is-in-trouble/"
    }
  ]
}