{
  "stories": [
    {
      "by": "bulletinbuzz",
      "descendants": 0,
      "id": 29483196,
      "score": 1,
      "text": "It came like a shocker for 900 employees of Better.com when last week, the CEO Vishal Garg fired them on a Zoom Call. This heartbreak came just before the festival of Christmas. Most of the laid-off employees are based in US and India.",
      "time": 1638960080,
      "title": "Better.com CEO Vishal Garg Fired 900 Employees on Zoom Call",
      "type": "story"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 29483176,
      "score": 1,
      "time": 1638959898,
      "title": "Yamaha DX7 reverse-engineering, part III: Inside the log-sine ROM",
      "type": "story",
      "url": "http://www.righto.com/2021/12/yamaha-dx7-reverse-engineering-part-iii.html"
    },
    {
      "by": "rcarmo",
      "descendants": 0,
      "id": 29483166,
      "score": 1,
      "time": 1638959836,
      "title": "A Binary Musical Instrument",
      "type": "story",
      "url": "https://ianthehenry.com/posts/binary-instrument/"
    },
    {
      "by": "9dev",
      "descendants": 0,
      "id": 29483162,
      "score": 1,
      "time": 1638959804,
      "title": "Spotify silently disabled friend feed",
      "type": "story",
      "url": "https://community.spotify.com/t5/Desktop-Windows/Desktop-Friend-Feed-Bring-Back-quot-Friend-Activity-quot-quot/td-p/5305911"
    },
    {
      "by": "Geekette",
      "descendants": 0,
      "id": 29483141,
      "score": 1,
      "time": 1638959570,
      "title": "Researchers find NFT economy is just as unequal as the real one",
      "type": "story",
      "url": "https://www.vice.com/en/article/n7nzbx/researchers-the-nft-economy-is-just-as-unequal-as-the-real-one"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 29483131,
      "score": 1,
      "time": 1638959453,
      "title": "Year study of global wealth demolishes the myth of ‘trickle-down’",
      "type": "story",
      "url": "https://www.businessinsider.com/how-bad-is-inequality-trickle-down-economics-thomas-piketty-economists-2021-12"
    },
    {
      "by": "ratraceisreal",
      "descendants": 0,
      "id": 29483122,
      "score": 2,
      "time": 1638959364,
      "title": "You Are Not a Senior Developer Demote Yourself",
      "type": "story",
      "url": "https://nicosmusings.substack.com/p/clear-signs-that-you-are-not-a-senior"
    },
    {
      "by": "philonoist",
      "descendants": 0,
      "id": 29483120,
      "score": 1,
      "text": "I understand HN running away from Chromium based browsers but then they get disappointed with decisions taken by Mozilla. All of them say Firefox monetarily depends largely and is running on the mercy of Google; isn&#x27;t designed clean and modularly like Chrome; is behind Chrome in implementing web standards, protocols and security features; has a consistently shrinking from an already small user base since a decade; puts in telemetry and ads, so eroding the trust of fans; won&#x27;t listen to fans drawing  importance to old, common and important bugs or feature requests but dumps cosmetic fluff for almost every major release; restricts facilities it had to form forks like sibling browsers; offers nothing unique compared to any other browser out there except maybe some addons. \nEven websites recommend Chrome for running themselves &quot;smoothly&quot;.  The closest I hear from HN are Otter, LibreWolf and Qutebrowser but none of them are yet comparable alternative to Chrome. I don&#x27;t know if it is possible to build a new browser from scratch that stands firm against Google in these times.<p>I don&#x27;t mind a new browser with a stagnantly small and slow growing market share as long as the developer community is receptive. All I need is a browser without any hegemony and influence of any one over the decisions on the future of web. Android browsers or browser based apps will also follow suit once that happens. So will Desktop OS based web apps.<p>What should be the philosophy and approach to browsing internet? What should be the monetizing policy? How to ensure privacy and security?",
      "time": 1638959358,
      "title": "Ask HN: What does it take to build a browser from scratch?",
      "type": "story"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 29483116,
      "score": 1,
      "time": 1638959351,
      "title": "The World Inequality Report 2022",
      "type": "story",
      "url": "https://wir2022.wid.world/"
    },
    {
      "by": "gautamsomani",
      "descendants": 0,
      "id": 29483075,
      "score": 1,
      "time": 1638958994,
      "title": "Mastering Bash and Terminal",
      "type": "story",
      "url": "https://www.blockloop.io/mastering-bash-and-terminal/"
    }
  ]
}