{
  "stories": [
    {
      "by": "farnoud",
      "descendants": 0,
      "id": 31151777,
      "score": 1,
      "text": "We are building a product for scheduling meetings (kinda like Calendly at the moment but we have very interesting set of features planned). It can be used by freelancers, consultants, big companies (white label), and startups.<p>Our product is fun, simple and looks great. We want a cool name but anything we come up with is taken.<p>Help us by suggesting anything that comes to your mind. We plan to launch on product hunt and give everyone coming from PH a free for life account :)",
      "time": 1650874738,
      "title": "Ask HN: I need help picking a name for our product",
      "type": "story"
    },
    {
      "by": "ompluscator",
      "descendants": 0,
      "id": 31151759,
      "score": 1,
      "time": 1650874514,
      "title": "The Guide for Contract Testing with Pact and JavaScript",
      "type": "story",
      "url": "https://hindenbug.io/the-ultimate-guide-for-contract-testing-with-pact-and-javascript-e1cbb39ddbbd"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 31151756,
      "score": 1,
      "time": 1650874461,
      "title": "Sailfish Community News, 7th April, Vanha Rauma",
      "type": "story",
      "url": "https://forum.sailfishos.org/t/sailfish-community-news-7th-april-vanha-rauma/11017"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 31151741,
      "score": 1,
      "time": 1650874305,
      "title": "Apparently Google has been renaming Detroit neighborhoods",
      "type": "story",
      "url": "https://www.metrotimes.com/news/apparently-google-has-been-renaming-detroit-neighborhoods-14370993"
    },
    {
      "by": "gyulai",
      "descendants": 0,
      "id": 31151735,
      "score": 1,
      "text": "Say you&#x27;re a tech-savvy power user, but you&#x27;re also a pragmatist.  Will retrocomputing have a significant role to play in your &quot;daily driver&quot; desktop computing environment in the near future?<p>I feel like I have recently reached an inflection point where I have turned from being generally optimistic about the future of computing on the desktop to being generally pessimistic.<p>For example, I have Macs from about 10-15 years ago in a box somewhere, together with a few thousand dollars worth of professional-grade commercial software that I used to run (MS Office, Adobe Creative Suite, Sibelius, ...), all on DVD with license keys and everything.<p>I increasingly feel that dusting off that stuff and reintegrating it into my daily driver desktop computing environment might be a good use of my time and money.  I feel like it might, in fact, be better bang for the buck than subscribing to today&#x27;s software and keeping the hardware and my knowledge of the software updated as the software updates roll in.<p>On HN, one can frequently read about how the industry is forcing changes on everyone that not everyone wants to go along with.  The first reaction is usually &quot;Open source on the desktop, now more than ever&quot;.  But, looking at it from a pragmatist&#x27;s point of view, I don&#x27;t expect the Linux-on-the-desktop experience will, at any point in the next 10 years, match the commercial desktop experience that existed 10 years ago.<p>As an alternative to &quot;Open source on the desktop, now more than ever&quot;, how do you feel about &quot;Retrocomputing, now more than ever&quot;?",
      "time": 1650874214,
      "title": "Ask HN: Is retrocomputing the pragmatist power user's future of the desktop?",
      "type": "story"
    },
    {
      "by": "quyleanh",
      "descendants": 0,
      "id": 31151695,
      "score": 1,
      "time": 1650873682,
      "title": "Parsec – Connect to Work or Games from Anywhere",
      "type": "story",
      "url": "https://parsec.app/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 31151685,
      "score": 1,
      "time": 1650873552,
      "title": "BrowserBox – self-hosted alternative to KASM, Cloudflare and Menlo Browsers",
      "type": "story",
      "url": "https://github.com/crisdosyago/BrowserBox"
    },
    {
      "by": "FlyNestor",
      "descendants": 0,
      "id": 31151684,
      "score": 1,
      "text": "You can launch the video generation directly from the home page, or use the APIs for more automation. It&#x27;s good to avoid some of the repetitive tasks of video creation.<p>User feedback helps me to choose which new features have to be implemented.",
      "time": 1650873544,
      "title": "Show HN: API – video creation from an input text",
      "type": "story",
      "url": "https://rollideo.com/"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 31151680,
      "score": 2,
      "time": 1650873529,
      "title": "Noberus: Technical Analysis Shows Sophistication of New Rust-Based Ransomware",
      "type": "story",
      "url": "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/noberus-blackcat-alphv-rust-ransomware"
    },
    {
      "by": "nemoniac",
      "descendants": 0,
      "id": 31151675,
      "score": 1,
      "time": 1650873477,
      "title": "ArXiv is partnering with Scopus (Elsevier)",
      "type": "story",
      "url": "https://blog.arxiv.org/2022/04/21/librarians-gain-new-insights-into-their-researchers-arxiv-usage/"
    }
  ]
}