{
  "stories": [
    {
      "by": "DavidRelo",
      "descendants": 0,
      "id": 31736274,
      "score": 1,
      "time": 1655196288,
      "title": "Create a Truly Immersive Metaverse Experience Through Web3 Sound Effects",
      "type": "story",
      "url": "https://betterprogramming.pub/create-a-truly-immersive-metaverse-experience-through-web3-sound-effects-c6c3645e27fa"
    },
    {
      "by": "alangibson",
      "descendants": 0,
      "id": 31736255,
      "score": 1,
      "time": 1655196099,
      "title": "Collapsing a leading theory for the quantum origin of consciousness",
      "type": "story",
      "url": "https://phys.org/news/2022-06-collapsing-theory-quantum-consciousness.html"
    },
    {
      "by": "johntfella",
      "descendants": 0,
      "id": 31736231,
      "score": 1,
      "time": 1655195909,
      "title": "Shiga: Finding creative solutions to plant predicament",
      "type": "story",
      "url": "https://japannews.yomiuri.co.jp/features/japan-focus/20220128-10877/"
    },
    {
      "by": "addetz",
      "descendants": 0,
      "id": 31736216,
      "score": 1,
      "time": 1655195784,
      "title": "Prometheus Histograms. Run that past me again?",
      "type": "story",
      "url": "https://www.form3.tech/engineering/content/prometheus-histograms"
    },
    {
      "by": "addetz",
      "descendants": 0,
      "id": 31736198,
      "score": 1,
      "time": 1655195590,
      "title": "Bypassing eBPF-Based Security Enforcement Tools",
      "type": "story",
      "url": "https://www.form3.tech/engineering/content/bypassing-ebpf-tools"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31736165,
      "score": 1,
      "time": 1655195206,
      "title": "Why this Chinese artist is outselling Van Gogh",
      "type": "story",
      "url": "https://lite.cnn.com/en/article/h_a4f3f812e923b1e553dcef30db1f0b85"
    },
    {
      "by": "pplonski86",
      "descendants": 0,
      "id": 31736164,
      "score": 2,
      "time": 1655195192,
      "title": "How to create a dashboard in Python with Jupyter Notebook",
      "type": "story",
      "url": "https://mljar.com/blog/dashboard-python-jupyter-notebook/"
    },
    {
      "by": "dev_0",
      "descendants": 0,
      "id": 31736159,
      "score": 1,
      "text": "I am considering if my organization really need security champions programme. Would like to hear the opinions from developers....",
      "time": 1655195142,
      "title": "Ask HN: Does your organisation have a Security Champions program? Was it useful?",
      "type": "story"
    },
    {
      "by": "nevillain",
      "descendants": 0,
      "id": 31736094,
      "score": 2,
      "text": "I (m, 23) will be graduating from a university in Kenya with a CS degree at the end of the year. However, I feel like I barely know anything. I hardly attended classes in my first and second year. I upped my grades in my third year and was even among the top in the class (anecdotally). To be honest, I’ve always felt like our CS course was inferior. For example, I did a Computer Graphics course, but we didn’t even implement line drawing algorithms. My favorite courses were compiler construction (we actually built a compiler) and distributed systems.<p>I started checking the sources of web pages in high school, and even learnt rudimentary JavaScript and PHP. After high school, I was hoping to join a good uni in the US. I got a relatively decent 1490 in my SATs then bungled up the rest of the application process. I hesitantly joined my current uni. I’ve been coding on and off since then. For school, I wrote introductory assembly, C, and C++: most of which I can’t recall now. Outside of school I learnt Node.JS, Python and Go. I haven’t built any large project: my biggest code base is probably my FYP React Native app or the Vue&#x2F;Flask web app for my internship.<p>On paper, it appears I know quite a few technologies. But contrary to that, most of it has been surface level knowledge. To use a friend’s words, I’ve been turning buttons from red to green (doing CRUD). I don&#x27;t know how databases work, I don&#x27;t know what exactly ray tracing is, et al. I started applying for jobs last week. To my surprise (or not), I do not fit cleanly into the requirements of any of the junior listings. I can&#x27;t solve the &quot;easy&quot; problems on LeetCode and my score for the AngelList Fullstack assessment [1] was 18&#x2F;30. I rather objectively believe I have some gaps in my CS knowledge. I am even considering a boot camp—if one exists for people who already know what a variable is. My tentative plan is to get a part time job, and then spend 6 months reading books, learning tech I’ve always wanted to learn, and hacking on at least one build-your-own [2] type project.<p>So, how can one effectively fill gaps in their CS knowledge? It’s worth noting that I am overwhelmed, and even procrastinate when I don&#x27;t have an overarching framework (like school). So it’s not as simple as just sitting alone and studying&#x2F;coding. I am the &quot;smart&quot; kid who didn’t have to study throughout most of school, but who&#x27;s &quot;discovered&quot; you have to sit long hours now to be competitive. Is my situation more common than I suppose? Should I suck it up, get a technical support role and build up from there?<p>[1] https:&#x2F;&#x2F;angel.co&#x2F;assessments&#x2F;full-stack-web\n[2] https:&#x2F;&#x2F;github.com&#x2F;codecrafters-io&#x2F;build-your-own-x",
      "time": 1655194299,
      "title": "Ask HN: CS grad who barely knows any CS",
      "type": "story"
    },
    {
      "by": "aserdak",
      "descendants": 0,
      "id": 31736065,
      "score": 2,
      "time": 1655193969,
      "title": "OpenInfra Summit Berlin 2022: the highlights",
      "type": "story",
      "url": "https://ubuntu.com/blog/ois-2022-highlights"
    }
  ]
}