{
  "stories": [
    {
      "by": "tixocloud",
      "descendants": 0,
      "id": 29171169,
      "score": 1,
      "text": "Hi all<p>Wondering if anyone here has a good understanding of the differences working with the Big 3 cloud providers? Which one’s better for support, reliability, etc? What are some differences that set each other apart?",
      "time": 1636519494,
      "title": "Ask HN: Experiences with AWS, Azure, and GCP?",
      "type": "story"
    },
    {
      "by": "jdshaffer",
      "descendants": 0,
      "id": 29171168,
      "score": 1,
      "text": "Hello, everyone.<p>Like everyone else, I&#x27;ve been hearing the word &quot;metaverse&quot; being bandied about, and it makes me wonder just what it might actually be like, when it exists.<p>I&#x27;d love to hear everyone&#x27;s thoughts and ideas. Below are my own as a starting point (or you can ignore my ideas completely and just share your ideas!).<p>Eagerly awaiting everyone&#x27;s unique insights and perspectives,\nJds<p>------\nI guess I&#x27;m not quite sure what to expect the future to bring, to be honest. Of course there&#x27;s the &quot;metaverse&quot; that movies have been portraying for years and the metaverse as seen in shared VR experiences like Minecraft and Fortnite... But what will the REAL metaverse look like? Or will there even be some kind of massively shared VR experience that most people hook into?<p>I start to suspect that the real &quot;metaverse&quot; will look a lot like our modern internet with some virtual add-ons such as VR chat rooms, VR game rooms, VR vacations, and VR workspaces. I really cannot imagine people spending all day long in VR doing their normal all day stuff -- Having breakfast in VR? Going to the grocery store in VR? Looking up notes for a new research paper or school essay in VR? There are simply too many things that a flat 2D screen (or no screen) handles better. Want to check my email on the fly? I don&#x27;t need VR, just my smartwatch or a smartphone. Want to read a book? Paper or kindle work great, I don&#x27;t need or want goggles.<p>So, I highly suspect that the metaverse hype is just that -- hype. There will definitely be real uses for it. It&#x27;d be great if I could have a &quot;get together&quot; with friends and family from all over the globe at a shared virtual space... especially if we can chat, tell jokes, or play games together. It would also be nice to have a movie night with friends or family in a virtual theater. It would also be fun to watch nature documentaries and travel shows in VR where you can look around and maybe even explore the locations freely. But, most of these are &quot;created&quot; experiences (meaning pre-created, not live events). Yes, hanging with people and playing games can be live, but just about anything else will have to be created and served up experiences, shared or not.<p>Canned VR experiences (akin to pre-recorded VR movies) definitely reduce the barrier for participation (the cost of a headset being exponentially less than plane tickets, food, and hotels, and perhaps a time machine), and thus lies their attraction and benefit. But they&#x27;re still not the same as being able to visit said places in real-time, or with the same sensory quality of the human body.<p>Personally, I&#x27;m excited for a time when I can go on a BBC nature documentary in 360 &#x2F; 3D VR. I&#x27;m also looking forward to watching movies together with my kids in a &quot;Family Virtual Theater&quot; some day in the future (though it&#x27;d be even better to go to a real theater together!). I&#x27;m not so much a gamer, my self, but it might be fun to watch the kids or grandkids play games (together) in VR. Personally, I see some benefits of working in VR as some of my work-related projects are made all that much easier when I have multiple screens open before me.<p>But, to be honest, it all feels like a mere intellectual curiosity at this point. None of these things are necessary and my life quality might arguably be better without them. I&#x27;d rather visit with family and friends, physically, and I&#x27;d rather read a real book. Sure the occasional 360-3D nature show or tropical island tour might be fun, and my work might be a smidge faster with more virtual screens... but I don&#x27;t think my life will feel as quiet and as joyful and peaceful as it is now. I like the sun, the sound of leaves in the breeze, and they way the treetops dance in the spring. I like the dark rolling clouds that blow through, and I even like feeling fully alive in the midsts of a typhoon (highly worried and concerned, but fully alive!).",
      "time": 1636519485,
      "title": "Discussion – What do you think the “Metaverse” might be?",
      "type": "story"
    },
    {
      "by": "nradov",
      "descendants": 1,
      "id": 29171152,
      "kids": [
        29171181
      ],
      "score": 1,
      "time": 1636519245,
      "title": "Korea Is Airlifting Thousands of Gallons of Urea to Keep Diesel Engines Going",
      "type": "story",
      "url": "https://www.thedrive.com/news/43065/korea-is-airlifting-thousands-of-gallons-of-urea-to-keep-its-diesel-engines-going"
    },
    {
      "by": "bryan0",
      "descendants": 0,
      "id": 29171108,
      "score": 1,
      "time": 1636518593,
      "title": "Rivian prices IPO at $78 a share, valuing electric vehicle company at $66.5B",
      "type": "story",
      "url": "https://www.cnbc.com/2021/11/09/rivian-prices-ipo-at-78-a-share-valuing-company-at-66point5-billion.html"
    },
    {
      "by": "gigama",
      "descendants": 0,
      "id": 29171101,
      "score": 2,
      "time": 1636518507,
      "title": "How cyber surveillance is booming on a global scale",
      "type": "story",
      "url": "https://www.technologyreview.com/2021/11/08/1039395/grim-outlook-cyber-boom-atlantic-council-report/"
    },
    {
      "by": "graderjs",
      "descendants": 0,
      "id": 29171093,
      "score": 1,
      "time": 1636518421,
      "title": "Nuclear fusion recedes into the far future for the 57th time",
      "type": "story",
      "url": "https://cleantechnica.com/2021/11/09/breaking-news-fusion-recedes-into-far-future-for-the-57th-time/"
    },
    {
      "by": "jbegley",
      "descendants": 0,
      "id": 29170996,
      "score": 1,
      "time": 1636517457,
      "title": "The 1619 Project and the Long Battle over U.S. History",
      "type": "story",
      "url": "https://www.nytimes.com/2021/11/09/magazine/1619-project-us-history.html"
    },
    {
      "by": "pabs3",
      "descendants": 0,
      "id": 29170971,
      "score": 2,
      "time": 1636517222,
      "title": "The Costs of Requiring Accounts",
      "type": "story",
      "url": "https://mako.cc/copyrighteous/the-hidden-costs-of-requiring-accounts"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 29170967,
      "score": 3,
      "time": 1636517175,
      "title": "McCaughey: New vax science shows mandates unwise",
      "type": "story",
      "url": "https://www.bostonherald.com/2021/11/08/mccaughey-new-vax-sciences-shows-mandates-unwise/"
    },
    {
      "by": "timsneath",
      "descendants": 0,
      "id": 29170955,
      "score": 2,
      "time": 1636517105,
      "title": "Using Flutter to build a native-looking desktop app for macOS and Windows",
      "type": "story",
      "url": "https://blog.whidev.com/native-looking-desktop-app-with-flutter/"
    }
  ]
}