{
  "stories": [
    {
      "by": "crhulls",
      "descendants": 0,
      "id": 32083034,
      "score": 1,
      "time": 1657721670,
      "title": "Twitter unlikely to prevail against Elon Musk",
      "type": "story",
      "url": "https://www.wsj.com/articles/twitters-lawsuit-against-elon-musk-looks-like-a-loser-11657716142"
    },
    {
      "by": "Codezeros",
      "descendants": 0,
      "id": 32083031,
      "score": 1,
      "time": 1657721654,
      "title": "A Comprehensive Guide to Stablecoins: Finance of the Future",
      "type": "story",
      "url": "https://codezeros.medium.com/a-comprehensive-guide-to-stablecoins-finance-of-the-future-47db4331d33"
    },
    {
      "by": "bookofjoe",
      "descendants": 0,
      "id": 32083017,
      "score": 1,
      "time": 1657721590,
      "title": "Why does ancient Egypt's distinctive art style make everything look flat?",
      "type": "story",
      "url": "https://www.livescience.com/why-ancient-egyptian-art-2d"
    },
    {
      "by": "jqcoffey",
      "descendants": 0,
      "id": 32083013,
      "score": 1,
      "time": 1657721576,
      "title": "Bringing a database query planner inside a workflow management system",
      "type": "story",
      "url": "https://medium.com/criteo-engineering/scheduling-data-pipelines-at-criteo-part-2-8b0da38ff3a4"
    },
    {
      "by": "marzipanina",
      "descendants": 0,
      "id": 32082996,
      "score": 1,
      "time": 1657721499,
      "title": "A second part of our UX Research in Africa Podcast series is out",
      "type": "story",
      "url": "https://open.spotify.com/episode/1blALFuRllGMu64tDMQDZE"
    },
    {
      "by": "logankilpatrick",
      "descendants": 0,
      "id": 32082994,
      "score": 1,
      "time": 1657721490,
      "title": "PageRank on the Julia package dependency graph",
      "type": "story",
      "url": "https://forem.julialang.org/nassarhuda/pagerank-on-the-julia-package-dependency-graph-2gbo"
    },
    {
      "by": "andreynering",
      "descendants": 0,
      "id": 32082974,
      "score": 1,
      "time": 1657721407,
      "title": "CVE-2022-32224: Possible RCE escalation bug in SerializedColumns in ActiveRecord",
      "type": "story",
      "url": "https://discuss.rubyonrails.org/t/cve-2022-32224-possible-rce-escalation-bug-with-serialized-columns-in-active-record/81017"
    },
    {
      "by": "alerolp",
      "descendants": 0,
      "id": 32082935,
      "score": 2,
      "text": "Hi HN.\nI&#x27;m a 49 yo in an emergent economy country. I&#x27;ve been working for 26\nyears in the same company, a ~200 emp. regional leader in it&#x27;s core\nbusiness.<p>Since 2011 I&#x27;ve got a remuneration which is tied to the price of the\nbase main service the company provides, so my salary has been the same\nbut my income has increased as the price of this particular service\nvaried with the years. I&#x27;ve got no other benefits beyond the granted by\nworking law in this country (vacations, etc.). My salary is roughly\n10-12x the base salary of a non-professional employee, and 3x the median\nIT &amp; Telco salary in the country, although I live and work on a second\ntier city of ~1M people, so perhaps 3.5-4x the median here.<p>The company has grown and expanded it&#x27;s businesses since I&#x27;ve entered\nat an early stage and I was instrumental in every aspect of\nthe company development (modulo finances) implementing most of the\nprocesses and operations that are running the company to this day; for\nexample, but not limited to: implementation of core technical\nprocedures, develop of administrative and CRM software, main mission\ncritical service software, security, communication networks deployment and integration (from analog RF to mesh network), fleet tracking and location (AVL) with driver\nregistration, maps and dispatch, several\nmobile apps for internal use (tech&#x2F;support staff, sales team, etc.),\nmain app for customers, networking, communications and IT\ninstallations in several buildings, sysadmin, DB admin, a myriad of\nother tasks from key strategy and technology selection and deployment\nfor multi million dollar projects to problem resolution in every\ntechnical concern, while also providing support in a very demanding 24&#x2F;7\nenvironment. Much of this was made by myself up to 2013, since then I&#x27;ve\nlead a small team of developers and technical staff. I&#x27;m generally\nresponsible for the whole operation running smoothly 24&#x2F;7 (main business is 24&#x2F;7 service).<p>I think I&#x27;m not being payed adequately for my work and the value I&#x27;ve\nmade for the company through the years.  I have a very good and friendly relation with one of the owners (nominally my boss), and I&#x27;m about to open a negotiation with him about\nthis.<p>I think the company will offer me some money (not more than 10% increase\nover my base salary) and some promise for the future tied to some\ndiffuse and subjective metric of their own, which I will reject as a\nmatter of course.<p>What do you think will be my best strategy from that point on? It&#x27;s\npossible that my strongest point is that there are no one person that\ncan take over if I left, so they would need to get two to three\npeople. There are key security implications on this scenario too.<p>I need the work to support my family, and with my savings and my spouse\nincome I could live perhaps for one to two years educing\nour expenditure; there are some difficult decisions to be made in this\nregard too, like firing our domestic employee of 12 years, not going on\nvacations with the kids, no upgrading our cars or selling some property, etc.<p>I have a little side project but it&#x27;s not enough money and I&#x27;m not sure if it can success.\nThanks a lot.",
      "time": 1657721284,
      "title": "Salary Re-Negotiation Strategy",
      "type": "story"
    },
    {
      "by": "imartin2k",
      "descendants": 0,
      "id": 32082934,
      "score": 1,
      "time": 1657721283,
      "title": "Testing Candela's flying electric boat",
      "type": "story",
      "url": "https://electrek.co/2022/07/13/candela-c-8-first-flight-electric-boat/"
    },
    {
      "by": "thesecretceo",
      "descendants": 0,
      "id": 32082898,
      "score": 1,
      "time": 1657721164,
      "title": "You can now react to WhatsApp messages using any emoji",
      "type": "story",
      "url": "https://www.androidauthority.com/whatsapp-message-reactions-any-emoji-3141822/"
    }
  ]
}