{
  "stories": [
    {
      "by": "ajay-d",
      "descendants": 0,
      "id": 29356256,
      "score": 1,
      "time": 1637976581,
      "title": "Canada taps into strategic reserves to deal with shortage of maple syrup",
      "type": "story",
      "url": "https://www.npr.org/2021/11/25/1059236116/canada-taps-into-strategic-reserves-to-deal-with-massive-shortage-of-maple-syrup"
    },
    {
      "by": "elisaado",
      "descendants": 1,
      "id": 29356118,
      "kids": [
        29356202
      ],
      "score": 2,
      "time": 1637975338,
      "title": "LemonScript: A typed programming language inspired by TypeScript and Python",
      "type": "story",
      "url": "https://plebussupremus1234.github.io//LemonScript/"
    },
    {
      "by": "khaled_ismaeel",
      "descendants": 1,
      "id": 29356083,
      "kids": [
        29356195
      ],
      "score": 1,
      "text": "tldr: what is your best advice for a competitive programmer wanting to start freelancing (possibly taking it as a full time job even)?<p>I am a computer science student with a long history of programming and mathematics competitions. I believe I am proficient enough for real life projects and I would like to try my luck with freelancing (I also fancy the freelancing lifestyle, being free and all).<p>A quick search on Google lead me to platforms such as upwork, freelancer, fiverr, and others. They seem to be too full of spam, however (students asking for homework and tests and similar). I had the feeling that toptal could provide a more serious atmosphere, but my application was refused because I had less than two years of experience.<p>It seems to me that the freelancing platforms are very hard to penetrate for a student with no work experience. What advice can you give for a person in my situation?<p>Thanks everyone",
      "time": 1637975129,
      "title": "Ask HN: What is your recommended path for getting into freelancing?",
      "type": "story"
    },
    {
      "by": "smoyer",
      "descendants": 2,
      "id": 29356078,
      "kids": [
        29356178
      ],
      "score": 3,
      "time": 1637975086,
      "title": "The Weirdly Political Legacy of ‘Ghostbusters’",
      "type": "story",
      "url": "https://www.politico.com/news/magazine/2021/11/21/new-ghostbusters-afterlife-movie-politics-523082"
    },
    {
      "by": "DocFeind",
      "descendants": 0,
      "id": 29356069,
      "score": 1,
      "time": 1637974981,
      "title": "Hackers Are Breaking into Cloud Accounts to Mine Crypto",
      "type": "story",
      "url": "https://decrypt.co/86980/hackers-are-breaking-cloud-accounts-mine-crypto-google"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29356066,
      "score": 2,
      "time": 1637974966,
      "title": "Strike for Most People",
      "type": "story",
      "url": "https://nymag.com/intelligencer/2021/11/wirecutter-strike-new-york-times.html"
    },
    {
      "by": "1cvmask",
      "descendants": 0,
      "id": 29356059,
      "score": 1,
      "time": 1637974913,
      "title": "New York Times won’t ban fossil fuel advertisers",
      "type": "story",
      "url": "https://www.thedrum.com/news/2021/11/24/despite-80-journalists-covering-climate-new-york-times-won-t-ban-fossil-fuel"
    },
    {
      "by": "geox",
      "descendants": 0,
      "id": 29356058,
      "score": 2,
      "time": 1637974909,
      "title": "Canadians rocked by celebrity groundhog death coverup",
      "type": "story",
      "url": "https://www.vice.com/en/article/n7nnbm/wiarton-willie-canada-famous-groundhog-death-coverup"
    },
    {
      "by": "clouddrover",
      "descendants": 0,
      "id": 29356050,
      "score": 3,
      "time": 1637974874,
      "title": "Kstar Nuclear Fusion Reactor Further Improved",
      "type": "story",
      "url": "http://www.businesskorea.co.kr/news/articleView.html?idxno=81955"
    },
    {
      "by": "nobody9999",
      "descendants": 1,
      "id": 29356026,
      "kids": [
        29356174,
        29356037
      ],
      "score": 2,
      "text": "Note: Spoilers below.<p>As someone who has enjoyed the worlds of Isaac Asimov&#x27;s fiction for many years, I was excited to watch the TV adaptation[0] of his Foundation series.<p>I expected a good deal of re-imagining of the original novels, as Asimov&#x27;s story spans centuries and recasting the series every few episodes would be both challenging and wouldn&#x27;t allow viewers to invest in specific characters -- which is a big no no in television.<p>I also expected some story lines to be combined with others, and some to be excised, in order to maintain a reasonable (for TV) number of plot lines in the story being told.<p>However, I did <i>not</i> expect the show to veer so far from the novels as to completely change the narrative of the story.<p>That Salvor Hardin was gender-switched was perfectly fine, and even the reveal of the Second Foundation (and, even more, the reveal of its location) didn&#x27;t really bother me all that much.  Making Hardin an inexperienced teenager with gifts of perception and a penchant for violent outbursts rather than a talented and experienced bureaucrat most remembered for &quot;Violence is the last refuge of the incompetent&quot;, was rather lazy IMHO.<p>However, I found the complete redefinition of the history, origin and level of maturity of Gaal Dornick rather insulting and offensive to the character.<p>Making the &quot;emperor&quot; three in a line of clones dating back half a millenium was also unexpected, but not that surprising given the casting&#x2F;relateability issues mentioned above.<p>I suppose that it seemed necessary (from a TV perspective) to paint the Galactic Empire as evil, pernicious and grasping, in order to create the conditions for a hated regime that deserved to fail, rather than the more banal (and likely, but less evocative of immediate drama) scenario of an enormous, sessile entity drowning in its own bureaucracy.<p>And ignoring the (incredibly obvious) fact that the Foundation on Terminus was a source of technological and engineering expertise and treating it as a rag-tag group of semi-refugees without resources or the ability to interact politically (which, again was sabotaged by the need to make the empire evil) with its powerful, but technologically inferior neighbors, weakened one of the overarching premises of the novels: that the Foundation was a conservative force for knowledge retention and reducing the 10,000 years of chaos to just 1,000.<p>And ignoring the &quot;Three Laws of Robotics&quot; in having Demerzel assassinate those who might challenge the primacy of the emperor was quite disturbing as well.<p>As such, I find that, unlike Peter Jackson&#x27;s treatment of <i>The Lord of the Rings</i>, <i>Foundation</i> is more a new story loosely based in Asimov&#x27;s universe than a reasonably faithful adaptation of the novels.<p>All that said, the story line presented isn&#x27;t too terrible, and while it does seem to cater more to those with a lust for emotional angst and manufactured drama.  It&#x27;s not too bad.<p>Assuming the series gets picked up for a second season, I&#x27;ll watch it.<p>That said, Asimov&#x27;s <i>Foundation</i> series[1] is wonderful in its storytelling and scope.  Even the follow on novels by others are mostly pretty good too.  I <i>highly</i> recommend reading those.  Although perhaps not until after watching the TV &quot;adaptation.&quot;<p>[0] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Foundation_(TV_series)<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Foundation_series",
      "time": 1637974679,
      "title": "Tell HN: Why Foundation (TV series) sucks. And doesn't.",
      "type": "story"
    }
  ]
}