{
  "stories": [
    {
      "by": "drunkpotato",
      "descendants": 0,
      "id": 28267583,
      "score": 1,
      "time": 1629653660,
      "title": "Aubrey de Grey couldn’t leave well enough alone",
      "type": "story",
      "url": "https://freethoughtblogs.com/pharyngula/2021/08/22/aubrey-de-grey-couldnt-leave-well-enough-alone/"
    },
    {
      "by": "mmphosis",
      "descendants": 0,
      "id": 28267525,
      "score": 1,
      "time": 1629653263,
      "title": "An Apple II manual signed by Steve Jobs just sold for nearly $800k",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/22/us/steve-jobs-autograph-manual-trnd/"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 28267513,
      "score": 1,
      "time": 1629653168,
      "title": "Practical Foundations for Programming Languages",
      "type": "story",
      "url": "https://www.cs.cmu.edu/~rwh/pfpl/"
    },
    {
      "by": "tomohawk",
      "descendants": 0,
      "id": 28267451,
      "score": 2,
      "time": 1629652847,
      "title": "The More Masks Fail, the More We Need Them",
      "type": "story",
      "url": "https://ianmsc.substack.com/p/the-more-masks-fail-the-more-we-need"
    },
    {
      "by": "anomPM",
      "descendants": 0,
      "id": 28267447,
      "score": 1,
      "text": "I&#x27;ve been working as a project manager in the IT field in Europe in the last several years also leading development project as PM.  While it was&#x2F;is interesting, I&#x27;ve always wanted to be closer to the &quot;real&quot; work of planning &amp; implementing the IT solutions, like in the role of a solution architect&#x2F;developer.<p>I&#x27;m quite able to handle a lot of technical aspects (spinning up, configuring and provisioning server, installing and deploying server application like apache&#x2F;postfix). I&#x27;ve been for example running my own Jira servers on a own virtualized environment for several years now.<p>I also enjoy programming and have written some tools for own usage in Node.js&#x2F;Python. Nothing spectacular only some rudimentary web apps with simple Rest-APIs. There for example I&#x27;ve also written custom scripts for data migration from MongoDB to Azure Storage Tables.<p>Now I would like to make the switch in a more hands-on position but don&#x27;t see how. I&#x27;ve tried to apply for some technical positions (technical PM) but wasn&#x27;t able to break through. To be honest after some of these rejection I&#x27;ve not been brave enough to apply for a (junior) development position directly because I don&#x27;t think I would stand a chance.<p>One reason for this is that I haven&#x27;t any formal technical education (Science Master) and also I&#x27;m approaching my 40s. On the other hand I see all these retraining activities driven by big companies (even by Google an Microsoft, at least publicly) and all the whining about missing technical knowledge worker (at least here in Europe).<p>Any suggestion if &amp; how someone with my profile could make a switch form PM to SA&#x2F;Dev? Have you done something similar? Is this switch even realistic, considering that most developer are moving into opposite direction (more management positions) during their career and that ageism is a thing?",
      "time": 1629652825,
      "title": "Ask HN: Switching from project manager to solution architect/developer. How?",
      "type": "story"
    },
    {
      "by": "_Microft",
      "descendants": 0,
      "id": 28267436,
      "score": 1,
      "time": 1629652766,
      "title": "How Do New Organs Evolve? A Beetle Gland Shows the Way",
      "type": "story",
      "url": "https://www.quantamagazine.org/how-do-new-organs-evolve-a-beetle-gland-shows-the-way-20210816"
    },
    {
      "by": "whitepoplar",
      "descendants": 0,
      "id": 28267422,
      "score": 2,
      "time": 1629652704,
      "title": "Ask HN: What are the best books on relational database modeling in SQL?",
      "type": "story"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 28267419,
      "score": 1,
      "time": 1629652692,
      "title": "Service Reliability Math That Every Engineer Should Know",
      "type": "story",
      "url": "https://matt-rickard.com/service-reliability-math-that-every-engineer-should-know/"
    },
    {
      "by": "kiyanwang",
      "descendants": 0,
      "id": 28267386,
      "score": 1,
      "time": 1629652537,
      "title": "Periodic Table of Realtime: a compendium for all things event-driven",
      "type": "story",
      "url": "https://ably.com/blog/presenting-the-periodic-table-of-realtime"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28267377,
      "score": 1,
      "time": 1629652495,
      "title": "Virtual gaming machine with PCI passthrough on Ubuntu 20.04",
      "type": "story",
      "url": "https://mathiashueber.com/pci-passthrough-ubuntu-2004-virtual-machine/"
    }
  ]
}