{
  "stories": [
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 30368709,
      "score": 2,
      "time": 1645063533,
      "title": "Otter Browser aims to bring Chromium to OS/2",
      "type": "story",
      "url": "https://www.xda-developers.com/otter-browser-os2/"
    },
    {
      "by": "amanzi",
      "descendants": 0,
      "id": 30368690,
      "score": 1,
      "time": 1645063346,
      "title": "Valve is partnering with iFixit to sell Steam Deck replacement parts",
      "type": "story",
      "url": "https://www.pcgamer.com/valve-is-partnering-with-ifixit-to-sell-steam-deck-replacement-parts/"
    },
    {
      "by": "tambourine_man",
      "descendants": 0,
      "id": 30368639,
      "score": 1,
      "time": 1645062952,
      "title": "Where Mac Catalyst Falls Short",
      "type": "story",
      "url": "https://www.highcaffeinecontent.com/blog/20220216-Where-Mac-Catalyst-Falls-Short"
    },
    {
      "by": "how_big_is_sv",
      "descendants": 1,
      "id": 30368638,
      "kids": [
        30368694
      ],
      "score": 1,
      "text": "Key facts:<p>1. Company exited in 2020 and I stayed on until Q4&#x27;21 due to golden handcuffs<p>2. Those handcuffs made me Kentucky FIRE so I planned on taking H1&#x27;22 off and trying to find employment again in Q3&#x27;22 so I can become California FIRE<p>3. Word spread of my availability and I was convinced to join a Series A YC startup, and my first day was last Monday<p>4. I joined the same day as three other engineers, making the team the CEO, CTO, First Engineer, the New Hires<p>5. Today we had a &quot;design review&quot; to go over an upcoming design overhaul. Throughout, none of the three New Hires could get questions in because the Founding Engineer would condescendingly shoot them down. On several occasions the Founding Engineer would out right laugh at the question and make a dismissive remark. On _several_ occasions legitimate design concerns were shot down with inaccurate information by the Founding Engineer.<p>6. Throughout this, the CEO &amp; CTO would occasionally call out the Founding Engineer, but at large the behavior was tolerated<p>7. The Founding Engineer was on a roll and after the design review concluded, interrupted my conversation with another New Hire to make a snide remark about how they purchased the wrong type of Cherry keys.<p>8. I lack full context after only 1.5 weeks, but it seemed clear from the topics of the design review that this company is in dire need of technical &amp; product leadership.<p>9. I do not have financial motivation to work (for a while). Never in my professional career (10+ years) have I ever been dismissed so offhandedly and all around treated this poorly. I learned today that when salary is no longer a key motivator, the other aspects of work become way more important.<p>10. My industry is much smaller in the Bay than the general software industry and the CEO is very well connected within my network. I am very concerned about the impression leaving after only 2 weeks would look like. I know I cannot tolerate a year (first cliff on equity) of the behavior I was subjected to today.<p>11. The work is genuinely interesting<p>The Question: Is quitting after two weeks a high-risk career move and if so, what&#x27;s a generally &quot;safe&quot; amount of time to quit after joining a startup? The longer I stay the more my Bus Factor increases and I want to keep it as low as possible for their sake.",
      "time": 1645062943,
      "title": "Ask HN: Downsides of leaving startup after two weeks?",
      "type": "story"
    },
    {
      "by": "nathanyz",
      "descendants": 0,
      "id": 30368634,
      "score": 2,
      "time": 1645062844,
      "title": "PfSense 2.6.0 Released",
      "type": "story",
      "url": "https://docs.netgate.com/pfsense/en/latest/releases/22-01_2-6-0.html"
    },
    {
      "by": "mfilion",
      "descendants": 0,
      "id": 30368614,
      "score": 1,
      "time": 1645062642,
      "title": "WebRTC: Journey to make Wayland screen sharing enabled by default",
      "type": "story",
      "url": "https://jgrulich.cz/2022/02/16/webrtc-journey-to-make-wayland-screen-sharing-enabled-by-default/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 30368610,
      "score": 1,
      "time": 1645062620,
      "title": "Need to Separate AWS from Amazon.com consumer account (2012)",
      "type": "story",
      "url": "https://forums.aws.amazon.com/thread.jspa?threadID=85882"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 30368606,
      "score": 1,
      "time": 1645062539,
      "title": "Cargo Ship Full of Porsches and VWs Is on Fire and Adrift in The Atlantic",
      "type": "story",
      "url": "https://www.thedrive.com/news/44330/cargo-ship-full-of-porsches-and-vws-is-on-fire-and-adrift-in-the-atlantic"
    },
    {
      "by": "amkkma",
      "descendants": 0,
      "id": 30368600,
      "score": 2,
      "time": 1645062504,
      "title": "Dex: A new array oriented research language from Google",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=npDCCVIaSVQ"
    },
    {
      "by": "sebg",
      "descendants": 0,
      "id": 30368595,
      "score": 1,
      "time": 1645062459,
      "title": "Red Flags to Look Out for When Joining a Data Team",
      "type": "story",
      "url": "https://eugeneyan.com/writing/red-flags/"
    }
  ]
}