{
  "stories": [
    {
      "by": "boole1854",
      "descendants": 0,
      "id": 28327665,
      "score": 1,
      "time": 1630071584,
      "title": "Neuroimaging Analysis Replication Study – An Emerging fMRI “Crisis”?",
      "type": "story",
      "url": "https://medium.com/the-spike/seventy-teams-of-scientists-analysed-the-same-brain-data-and-it-went-badly-e0d96c23dbf4"
    },
    {
      "by": "psanford",
      "descendants": 0,
      "id": 28327661,
      "score": 1,
      "time": 1630071571,
      "title": "ChaosDB: Unauthorized Privileged Access to Microsoft Azure Cosmos DB",
      "type": "story",
      "url": "https://chaosdb.wiz.io/"
    },
    {
      "by": "memset",
      "descendants": 0,
      "id": 28327660,
      "score": 1,
      "text": "Hi! We&#x27;re Jay and Len from Hotswap (<a href=\"https:&#x2F;&#x2F;www.hotswap.app\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hotswap.app</a>). We automate the process of changing software vendors by helping you migrate user data during your onboarding process. In other words, we make it easy to steal customers from your competitors!<p>We&#x27;ve built a lot of enterprise software and done a lot of painful migrations over the years.\nI (Jay) have managed engineering teams at Frame.io, Squarespace, and Rent the Runway. Len was an early employee at Okta. At every single company we&#x27;ve worked at, we&#x27;ve spent a lot of time doing painful migrations. At Rent the Runway, we migrated our warehouse from UPS to FedEx. We changed credit card processors. We migrated ERP systems. It always took a ton of time, was not career-building work, and consultants charged $250&#x2F;hr or more. We also were often stuck using platforms that weren&#x27;t optimal because it was so hard to move.<p>So we decided to solve this problem: make it easy to change vendors, and make it easy for new companies to be able to bring on new users by automating the process.<p>We are essentially an ETL for SaaS products. We figure out how to extract data from the old system, even if there is not a clean API to do so, and automate it. We then help transform that data into a format that you can load into the new system. Our product is not self-serve. Instead, we work with you to understand how data maps to your system and integrate that logic into our migration engine. We then provide a Plaid-like widget for your users to connect their old systems and migrate data.<p>This is difficult, not in the &quot;computer science&quot; sense but in the &quot;data is messy&quot; sense.\nIf there isn&#x27;t an API to extract data, then we end up doing a lot of screen scraping, and many companies don&#x27;t want to take the risk of maintaining that kind of code because it can break.<p>Our two biggest competitors are internal development teams (who end up being stuck doing this kind of work) and consultants (who charge a ton of money.) We take the burden away by working with vendors directly to automate common migration flows. We don&#x27;t mind building and maintaining a lot of smaller one-off type projects for our users, as we benefit by building a repertoire of supported platforms.<p>The fact that modern applications have moved to SPAs has made this work easier than in the past. Every website essentially exposes an API, so it is not as difficult to extract data as it used to be. Our software tends to be more shelf-stable than people expect. Think about tech companies you&#x27;ve worked at: how often do you actually &quot;break&quot; the website by completely breaking the data or the UI?  Len has had experience managing these kinds of integrations at Okta, and by using continuous automated testing we&#x27;re able to quickly identify and fix breakages.<p>Currently we export data from Chartio, since it is shutting down next year, and Wix. If there is  a platform you want to steal customers from, please contact us! We&#x27;re openly eliciting suggestions and continually adding new platforms.<p>We&#x27;d love to hear your stories about painful migration experiences. And if you&#x27;re a business whose customers ask &quot;how do I move my data from the old platform?&quot; then we would be super interested to hear how you work with these folks today!",
      "time": 1630071569,
      "title": "Launch HN: Hotswap (YC S21) – Easily migrate customers away from competitors",
      "type": "story"
    },
    {
      "by": "Bostonian",
      "descendants": 0,
      "id": 28327657,
      "score": 2,
      "time": 1630071536,
      "title": "We’re told to ‘follow the science’ – yet some of it is just plain wrong",
      "type": "story",
      "url": "https://nypost.com/2021/08/26/were-told-to-follow-the-science-yet-some-of-it-is-just-plain-wrong/"
    },
    {
      "by": "AzzieElbab",
      "descendants": 0,
      "id": 28327654,
      "score": 1,
      "time": 1630071531,
      "title": "Twitter Down?",
      "type": "story",
      "url": "https://twitter.com/sessions"
    },
    {
      "by": "bupticybee",
      "descendants": 1,
      "id": 28327651,
      "kids": [
        28327656
      ],
      "score": 1,
      "time": 1630071522,
      "title": "Show HN: An open source solver faster than piosolver",
      "type": "story",
      "url": "https://github.com/bupticybee/TexasSolver"
    },
    {
      "by": "LordAtlas",
      "descendants": 0,
      "id": 28327625,
      "score": 2,
      "time": 1630071362,
      "title": "Microsoft warns thousands of cloud customers of exposed databases -emails",
      "type": "story",
      "url": "https://www.reuters.com/article/microsoft-security-idUSL1N2PX2W7"
    },
    {
      "by": "hk__2",
      "descendants": 1,
      "id": 28327608,
      "kids": [
        28327633
      ],
      "score": 2,
      "text": "When you’re interested by a new subject, how do you find interesting information on the Web amidst all the ad-filled websites that try to sell you stuff?<p>For example, say you want to improve the Wikipedia article &quot;Pickaxe&quot;. Excluding everything related to the tool in Minecraft and other games, all I get on Google are a bunch of websites selling pickaxes, some dictionnary entries, some companies named [a variation of] &quot;Pickaxe&quot;. There must be a couple non-commercial websites talking about pickaxes but none of them appear in the first 5 pages of Google results.",
      "time": 1630071274,
      "title": "Ask HN: How do you find non-commercial content on the Web nowadays?",
      "type": "story"
    },
    {
      "by": "rch",
      "descendants": 0,
      "id": 28327593,
      "score": 1,
      "time": 1630071205,
      "title": "Database Reasoning over Text",
      "type": "story",
      "url": "https://github.com/facebookresearch/NeuralDB"
    },
    {
      "by": "Existenceblinks",
      "descendants": 1,
      "id": 28327571,
      "kids": [
        28327572
      ],
      "score": 1,
      "time": 1630071090,
      "title": "Metadesk – an ergonomic parser for a simple–yet versatile–plaintext language",
      "type": "story",
      "url": "https://dion.systems/metadesk"
    }
  ]
}