{
  "stories": [
    {
      "by": "WillSmithPro",
      "descendants": 0,
      "id": 28609238,
      "score": 1,
      "time": 1632254443,
      "title": "HostBeat Free and simple service for devices/servers/websites monitoring",
      "type": "story",
      "url": "https://hostbeat.info/"
    },
    {
      "by": "kosei",
      "descendants": 1,
      "id": 28609223,
      "kids": [
        28609259
      ],
      "score": 1,
      "time": 1632254391,
      "title": "Roblox Introducing Age Verification System, Includes Government ID Scan",
      "type": "story",
      "url": "https://blog.roblox.com/2021/09/introducing-age-verification/"
    },
    {
      "by": "sandes",
      "descendants": 0,
      "id": 28609188,
      "score": 2,
      "time": 1632254209,
      "title": "Django 4.0 alpha 1 released",
      "type": "story",
      "url": "https://www.djangoproject.com/weblog/2021/sep/21/django-40-alpha-1-released/"
    },
    {
      "by": "sifenglin12",
      "descendants": 0,
      "id": 28609185,
      "score": 1,
      "time": 1632254204,
      "title": "Principles DoorDash Used to Increase Its Logistics Experiment Capacity by 1000%",
      "type": "story",
      "url": "https://doordash.engineering/2021/09/21/the-4-principles-doordash-used-to-increase-its-logistics-experiment-capacity-by-1000/"
    },
    {
      "by": "aluket",
      "descendants": 0,
      "id": 28609178,
      "score": 2,
      "time": 1632254172,
      "title": "Abba's Bjorn Ulvaeus launches campaign to fix £500m music royalty problem",
      "type": "story",
      "url": "https://www.bbc.com/news/entertainment-arts-58643787"
    },
    {
      "by": "amir-h",
      "descendants": 0,
      "id": 28609173,
      "score": 2,
      "text": "Let&#x27;s say CircleCi gets 100,000 companies paying their 30$&#x2F;month subscription (I think that&#x27;s a pretty ambitious number, or am I naive?) this puts them at 36 million $ yearly income, even today they have over 600 employees - assuming an average of 180k$&#x2F;y per employee this puts them paying 108 million $ just on salaries. Which part of the story am I missing? what makes investors believe they are going to see big returns?",
      "time": 1632254140,
      "title": "Will CircleCI make big $s?",
      "type": "story"
    },
    {
      "by": "neom",
      "descendants": 0,
      "id": 28609145,
      "score": 1,
      "text": "The elevator in my condo building has been acting weird for well over a month now, it randomly won&#x27;t go to some floors sometimes.<p>As you can imagine this is incredibly annoying and I&#x27;ve complained numerous times to the condo association and the management. The response is always the same, the elevator company are not able to fix it yet, for &quot;reasons&quot; but it will be fixed as soon as they can. After a painful 15 minute wait to get to my floor, I finally called the elevator company and asked them why they&#x27;re unable to service the elevator in a brand new 46 floor building for over a month.<p>The answer, the computer manufacturer is unable to get chips, nor do they know when they will, so the computer unit is backordered, indefinitely.<p>Wondering if anyone else has daily life chip shortage anecdotes?",
      "time": 1632254013,
      "title": "Ask HN: Have you experienced any real word examples of the chip shortage?",
      "type": "story"
    },
    {
      "by": "zx2c4",
      "descendants": 0,
      "id": 28609126,
      "score": 1,
      "time": 1632253878,
      "title": "The old speak: Wassenaar, Google, and why Spender is right",
      "type": "story",
      "url": "https://lists.immunityinc.com/pipermail/dailydave/2015-August/000976.html"
    },
    {
      "by": "angelinafmd",
      "descendants": 0,
      "id": 28609124,
      "score": 1,
      "text": "WebDataRocks finally presents new features with the 1.4 release. This pivot table is created by developers for developers, so it is an excellent choice as a software for data analysis. WebDataRocks pivot table is free and easy to integrate along with other useful features!<p>The main release improvement – framework wrappers for Vue, React and Angular. Just a few lines of code can elegantly and quickly embed WebDataRocks into your project. No extra time for integration with one of these JavaScript frameworks, just check the guides and here you are.<p>Along with improvements in the framework area WebDataRocks also cared for pivot customization: they added 3 new predefined themes. Now you can choose the most suitable theme for your design from the 8 offered.<p>Minor fixes were also done, read more at https:&#x2F;&#x2F;www.webdatarocks.com!",
      "time": 1632253874,
      "title": "New WebDataRocks pivot table release 2021",
      "type": "story"
    },
    {
      "by": "alexdlaird",
      "descendants": 1,
      "id": 28609105,
      "kids": [
        28609106
      ],
      "score": 1,
      "time": 1632253801,
      "title": "Java-ngrok – A Java wrapper for ngrok",
      "type": "story",
      "url": "https://github.com/alexdlaird/java-ngrok"
    }
  ]
}