{
  "stories": [
    {
      "by": "stevenjgarner",
      "descendants": 0,
      "id": 32130681,
      "score": 1,
      "text": "Entering into the sale of a business with a significant capital gain on both software and real estate.  Any suggestions on best practices that have worked?<p>In particular, has anyone used either a Delaware Statutory Trust or a Deferred Sales Trust (for both asset types)?  Or a Rule 1031 Exchange or Opportunity Zone with real estate?<p>I understand the whole Qualified Opportunity Fund (QOF) program is scheduled to sunset as of December 31, 2026, making any investment since December 31, 2021 unable to become fully realized with a 10-year tax-free sale.   Is that true?  Are there any work-arounds?",
      "time": 1658088288,
      "title": "Ask HN: Business sale suggestions on management of capital gain tax",
      "type": "story"
    },
    {
      "by": "CharlesW",
      "descendants": 0,
      "id": 32130637,
      "score": 1,
      "time": 1658088007,
      "title": "Google’s now relying on developers to provide app data collection information",
      "type": "story",
      "url": "https://www.theverge.com/2022/7/17/23259385/google-play-store-developers-accurate-app-data-collection-information-safety"
    },
    {
      "by": "zjor",
      "descendants": 0,
      "id": 32130636,
      "score": 1,
      "text": "Hi, I&#x27;d like to talk about my Telegram [@Mqtt2TelegramBot](https:&#x2F;&#x2F;t.me&#x2F;Mqtt2TelegramBot).<p>It gives you a flexible way to add notifications to your project (e.g. IoT-sensor readings, CI&#x2F;CD pipeline status, anything which is capable of making an HTTP request)<p>The bot allows you to generate a private API for sending messages and configure the types of notifications you are interested in.<p>Under the hood, it uses MQTT (HiveMQ) in order to decouple event producers and consumers.<p>When you subscribe to a `topic` of your choice the bot automatically generates an API key for you and returns a CLI command to send a message to the `topic`.<p>You can manage subscriptions directly from the bot with `&#x2F;sub`, `&#x2F;list`, `&#x2F;unsub` commands and review the CLI commands used to send messages with `&#x2F;httpie topic` command.<p>The bot also supports sending images.<p>Please check out the [repo](https:&#x2F;&#x2F;github.com&#x2F;zjor&#x2F;mqtt2telegram) and the [website](https:&#x2F;&#x2F;zjor.github.io&#x2F;mqtt2telegram&#x2F;) for the details and the integration snippets.<p>Let me know what you think of this!<p>Happy messaging!",
      "time": 1658087998,
      "title": "Welcome Mqtt2TelegramBot",
      "type": "story"
    },
    {
      "by": "yamrzou",
      "descendants": 0,
      "id": 32130626,
      "score": 2,
      "time": 1658087953,
      "title": "Sitting and Standing at Work",
      "type": "story",
      "url": "http://ergo.human.cornell.edu/CUESitStand.html"
    },
    {
      "by": "walterbell",
      "descendants": 0,
      "id": 32130600,
      "score": 2,
      "time": 1658087826,
      "title": "The European Commission’s disinformation fail",
      "type": "story",
      "url": "https://www.politico.eu/article/european-commission-disinformation-fail/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 32130599,
      "score": 1,
      "time": 1658087821,
      "title": "Filipinos are buying books to preserve the truth about the Marcos regime",
      "type": "story",
      "url": "https://www.cnn.com/2022/07/16/asia/philippines-marcos-books-truth-rewrite-history-intl-hnk-dst/index.html"
    },
    {
      "by": "hadikhan84",
      "descendants": 1,
      "id": 32130596,
      "kids": [
        32130597
      ],
      "score": 1,
      "time": 1658087811,
      "title": "A Weird Painting App?",
      "type": "story",
      "url": "https://github.com/hadikhan841/weird_paint"
    },
    {
      "by": "Iriien",
      "descendants": 1,
      "id": 32130578,
      "kids": [
        32130683
      ],
      "score": 2,
      "text": "For context, I&#x27;m a librarian purchasing tech books for my public library.  We have around 30 books just on Python alone, not counting any that are about using Python for things like machine learning or data science.<p>Other than clear version changes (like Python 2 to Python 3), are older programming books still useful? The majority of the books span from around 2014 to the present, and they&#x27;re all still circulating.<p>Thanks!  (And thank you for the book recommendations posted here as well, I have definitely purchased some of them for our collection.)",
      "time": 1658087713,
      "title": "Ask HN: Are older programming books useful?",
      "type": "story"
    },
    {
      "by": "zevir",
      "descendants": 0,
      "id": 32130558,
      "score": 1,
      "text": "Everyone knows that developers hate it with a passion when people try to sell stuff to them.<p>But many developers are also very generous in testing new products and offering candid feedback to the makers.<p>My question is - what is the cheat code for striking that balance? What gets developers to sign up and try your dev-oriented product in an authentic way?\n- Are there specific platforms or communities where developers are more receptive to these requests?\n- Maybe a specific type of pitch that is more effective?\n- Perhaps a specific medium that most developers prefer?<p>I&#x27;m very interested to hear what&#x27;s worked well for you.<p>Thank you!",
      "time": 1658087620,
      "title": "Ask HN: How to get developers to try your product (in a non-spammy way)?",
      "type": "story"
    },
    {
      "by": "behnamoh",
      "descendants": 1,
      "id": 32130535,
      "kids": [
        32130627
      ],
      "score": 1,
      "text": "Imagine a person who loves doing the following:<p>- Change keyboard layout to Dvorak<p>- Use Vim keybindings everywhere, including the browser<p>- Learn unpopular languages such as Racket, SmallTalk<p>- Create numerous aliases for zsh (or Bash, but zsh because it&#x27;s &quot;better&quot;)<p>- Make plenty of automation scripts e.g., by AppleScript, Ruby, JS<p>- Use automation apps (on macOS) e.g., Keyboard Maestro, Alfred, Karabiner-Elements, Hammerspoon, etc.<p>- Assign custom shortcuts to favorite commands in each app<p>- Read&#x2F;Write emails right in terminal<p>- Spend hours writing scripts that replace a boring task that would&#x27;ve taken minutes to finish<p>- Theme and rice the OS<p>- Spend hours fixing the OS&#x2F;application problems that shouldn&#x27;t have existed in the first place<p>- Finally, get to work, thinking that he&#x27;s now super productive...<p>Are you like this? Is there a way to fix this behavior? Why trying to be different (as much as possible) is enjoyable for some people (me included)?",
      "time": 1658087491,
      "title": "Ask HN: Does being different make you feel better?",
      "type": "story"
    }
  ]
}