{
  "stories": [
    {
      "by": "adrian_mrd",
      "descendants": 0,
      "id": 29427085,
      "score": 1,
      "time": 1638511263,
      "title": "Twenty percent of Xbox Cloud Gaming players only use touch controls",
      "type": "story",
      "url": "https://www.theverge.com/2021/12/2/22813749/microsoft-xbox-cloud-gaming-touch-controls-stats"
    },
    {
      "by": "Hard_Space",
      "descendants": 0,
      "id": 29427076,
      "score": 1,
      "time": 1638511216,
      "title": "Large Steps in Inverse Rendering of Geometry",
      "type": "story",
      "url": "https://rgl.epfl.ch/publications/Nicolet2021Large"
    },
    {
      "by": "rmason",
      "descendants": 0,
      "id": 29427073,
      "score": 1,
      "time": 1638511155,
      "title": "DAO FAQ",
      "type": "story",
      "url": "https://twitter.com/arjunmahadevan/status/1466515886685110274"
    },
    {
      "by": "danboarder",
      "descendants": 0,
      "id": 29427068,
      "score": 3,
      "time": 1638511102,
      "title": "Buried in Infrastructure Bill Is a Mandatory Backdoor Kill Switch for Your Car",
      "type": "story",
      "url": "https://hothardware.com/news/bidens-infrastructure-bill-mandatory-backdoor-car-kill-switch"
    },
    {
      "by": "hubraumhugo",
      "descendants": 0,
      "id": 29427065,
      "kids": [
        29427116
      ],
      "score": 3,
      "time": 1638511068,
      "title": "Pentagon: 7 in 10 Youths Would Fail to Qualify for Military Service",
      "type": "story",
      "url": "https://time.com/2938158/youth-fail-to-qualify-military-service/"
    },
    {
      "by": "draketucker",
      "descendants": 0,
      "id": 29427052,
      "score": 1,
      "time": 1638510915,
      "title": "We are your learning platform for such innovative technologies",
      "type": "story",
      "url": "https://tekslate.com/home"
    },
    {
      "by": "sanketpatrikar",
      "descendants": 0,
      "id": 29427050,
      "score": 1,
      "time": 1638510891,
      "title": "How to Revitalize the Internet (Thread)",
      "type": "story",
      "url": "https://forum.agoraroad.com/index.php?threads/how-to-revitalize-the-internet.3700/"
    },
    {
      "by": "jamboca",
      "descendants": 0,
      "id": 29427018,
      "score": 2,
      "text": "I write my concerns on HN because I cannot find anybody other than my parents who can help me to resolve this general disillusion with university. I am in my first year of STEM studies at an average state school in the USA, feeling extremely bored while still achieving top grades in the classroom and carrying seemingly important extracurriculars outside of it. I did the first year of CS curriculum while in high school, so I am scheduled to graduate in three years.<p>University is not shaping up to be what I expected. I expected to have the conversations that would shape my life here, but instead I have found empty people with little ambition and little interest in the world outside of a regional microcosm. Where is the inspirational exchange, the creation of friendships for life? (for reference, I felt like I had all of this in high school)<p>For high school I went to an international boarding school, and one week of conversations there was more interesting than anything of this semester. I am interested in almost every subject at school... I really love learning new things. With the expectation of university as more than just a technical education, I question why I am here. All I have learned this semester is equations from the math book, which I could realistically learn anywhere.<p>My current ideas are: (1) transfer to a liberal arts college to receive an education in a wide range of more interesting topics (philosophy, history, economics, other things I studied in HS) alongside more interesting and more passionate people, or (2) take a gap semester in Mexico City or Dar es Salaam to make life more interesting while self teaching myself everything that I can learn by being here already. That way, I might get more of the cultural education I had in high school which I now feel is lacking.<p>I am asking for general life advice. Life went from extremely interesting (surrounded by a global community of people from over 50 countries) to extremely boring and generally meh due to a lack of diversity in thoughts, ambitions, ways of life, etc. Does anybody relate?",
      "time": 1638510563,
      "title": "Ask HN: No diversity at university: how to make life more interesting?",
      "type": "story"
    },
    {
      "by": "sohkamyung",
      "descendants": 0,
      "id": 29427010,
      "score": 2,
      "time": 1638510395,
      "title": "David Attenborough’s Unending Mission to Save Our Planet",
      "type": "story",
      "url": "https://www.wired.com/story/david-attenborough-climate-crisis/"
    },
    {
      "by": "MayurJBhatt",
      "descendants": 0,
      "id": 29427007,
      "score": 1,
      "time": 1638510367,
      "title": "China app giant Didi plans US stock market exit in move to Hong Kong",
      "type": "story",
      "url": "https://www.bbc.com/news/business-59514800"
    }
  ]
}