{
  "stories": [
    {
      "by": "WallyFunk",
      "descendants": 0,
      "id": 31453273,
      "score": 1,
      "text": "We live in interesting times as hackers. The Internet has empowered us like never before and everything these days is unprecedented and very powerful if used correctly and wielded correctly. `With great power comes great responsibility`.<p>But I&#x27;ve been thinking lately, with everything so polarized, and all the different factions warring against each other, and the organized chaos we live in, and the caffeinated hyper connected world we live in: it can wear us down if you don&#x27;t disengage from it often, or try and tame our information diet we are all accustomed to.<p>Every day I chow down on so much documentation, security vulns, looking at code looking for defects (and there are plenty of defects to find!) and I realized everything is broken in some way. Hacking or more precisely infosec for me is the art of exploitation. `How can I use this to my advantage?`.<p>But at any given moment I could go full blackhat and pull off serious damage if I wanted to, but I&#x27;m an ethical hacker, so although the temptation is there, I don&#x27;t proceed further and either 1) report it or 2) sell my exploit legitimately to an 0day broker 3) write a huge blogpost embarrassing the vendors(s) when option 1 or 2 doesn&#x27;t work.<p>But all this is disheartening. Roughly ~90% of what I do is hobbyist projects I work on in my free time, and the rest is bug fixing, patching, reporting, etc It&#x27;s the extra 10% of &#x27;brokenness&#x27; that pisses me off. We like to think we can have nice things, but infosec is a dumpster fire, a raging mess we find ourselves in because people are getting away with it (look at the ransomware scene now, it&#x27;s booming).<p>All this takes a toll on mental health. I could choose to ignore it, but there it is, the elephant in the room. People, companies, vendors, core infrastructure like hospitals, fuel pipelines; all getting pwned left right and center. And that&#x27;s just ransomware. Cybercrime in general increases exponentially each year and it&#x27;s getting worse. I try to help, writing tutorials on how to do defense in depth, zero trust manuals, best practice tutorials etc but it&#x27;s still getting worse.<p>Are there any tips on good self-care tactics I can use to disengage from all this and not think about it too hard? Any mental health &#x27;hacks&#x27; to approach a broken world? Ways to approach the rising amount of cybercrime news and shit-storms I encounter everyday?",
      "time": 1653085493,
      "title": "Ask HN: Mental Health for Hackers?",
      "type": "story"
    },
    {
      "by": "diggernet",
      "descendants": 0,
      "id": 31453255,
      "score": 2,
      "time": 1653085393,
      "title": "Pike Programming Language",
      "type": "story",
      "url": "https://pike.lysator.liu.se/"
    },
    {
      "by": "avonmach",
      "descendants": 0,
      "id": 31453252,
      "score": 1,
      "time": 1653085368,
      "title": "Saudi Public Fund Takes 5% Stake in Nintendo",
      "type": "story",
      "url": "https://www.wsj.com/articles/saudi-public-fund-takes-5-stake-in-nintendo-11652873877"
    },
    {
      "by": "rntn",
      "descendants": 0,
      "id": 31453228,
      "score": 2,
      "time": 1653085203,
      "title": "Biden waters down Indo-Pacific Economic Framework to win more support",
      "type": "story",
      "url": "https://www.ft.com/content/91207c37-c9bd-4737-abf5-afc71200f8a1"
    },
    {
      "by": "Archelaos",
      "descendants": 0,
      "id": 31453224,
      "score": 1,
      "time": 1653085177,
      "title": "How long mined metals circulate before being lost",
      "type": "story",
      "url": "https://arstechnica.com/science/2022/05/new-study-estimates-how-long-mined-metals-circulate-before-being-lost/"
    },
    {
      "by": "okasaki",
      "descendants": 0,
      "id": 31453219,
      "score": 2,
      "time": 1653085131,
      "title": "HP Preparing an AMD-Powered Linux Laptop Powered by Pop _OS",
      "type": "story",
      "url": "https://www.phoronix.com/scan.php?page=news_item&px=HP-Dev-One"
    },
    {
      "by": "redbell",
      "descendants": 0,
      "id": 31453217,
      "score": 1,
      "time": 1653085119,
      "title": "macOS VMs on Apple Silicon to use in CI and other automations",
      "type": "story",
      "url": "https://github.com/cirruslabs/tart"
    },
    {
      "by": "karambir",
      "descendants": 0,
      "id": 31453216,
      "score": 1,
      "time": 1653085118,
      "title": "Tesla is building litigation department – Elon Musk",
      "type": "story",
      "url": "https://twitter.com/elonmusk/status/1527748229470646272"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31453188,
      "score": 1,
      "time": 1653084980,
      "title": "Computing industry at the end of 2020 as I see it. (2020)",
      "type": "story",
      "url": "https://easyperf.net/blog/2020/12/30/Computing-Industry-2020"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31453175,
      "score": 1,
      "time": 1653084916,
      "title": "Git Homepage",
      "type": "story",
      "url": "https://git-scm.com/"
    }
  ]
}