{
  "stories": [
    {
      "by": "shepherdjerred",
      "descendants": 0,
      "id": 31733262,
      "score": 1,
      "time": 1655165356,
      "title": "Shake Build System",
      "type": "story",
      "url": "https://shakebuild.com/"
    },
    {
      "by": "BendGravity",
      "descendants": 0,
      "id": 31733261,
      "score": 1,
      "text": "Has anyone invested with the DVC Syndicate on Angellist that is led by Sundeep Ahuja? I&#x27;ve had several deals with this syndicate that has been stuck in closing for over 6 months.<p>Sundeep is just refusing to respond despite requests from myself and his own syndicate partners. He&#x27;s still sending out deal invites, so it is apparent that he is just ignoring us.<p>I have a small amount invested ($7,000), but I have to imagine that there are others out there with funds committed to deals that have yet to close. My next course of action is to file an SEC complaint, so wanted to see who else  might be affected.",
      "time": 1655165352,
      "title": "Angellist Syndicators Not Responding",
      "type": "story"
    },
    {
      "by": "cwwc",
      "descendants": 0,
      "id": 31733234,
      "score": 3,
      "time": 1655165154,
      "title": "Elon to attend all hands meeting at Twitter, speaking to staff for first time",
      "type": "story",
      "url": "https://www.businessinsider.com/elon-musk-to-attend-all-hands-meeting-at-twitter-2022-6"
    },
    {
      "by": "cheinyeanlim",
      "descendants": 1,
      "id": 31733230,
      "kids": [
        31733231
      ],
      "score": 1,
      "time": 1655165107,
      "title": "Microsoft 365 Assessment tool for SharePoint 2013 workflows available now",
      "type": "story",
      "url": "https://pupuweb.com/mc391952-microsoft-365-assessment-tool-sharepoint-2013-workflows-available/"
    },
    {
      "by": "ngaut",
      "descendants": 0,
      "id": 31733182,
      "score": 1,
      "time": 1655164665,
      "title": "Home of Quamina, a fast pattern-matching library in Go",
      "type": "story",
      "url": "https://github.com/timbray/quamina"
    },
    {
      "by": "nkmnz",
      "descendants": 0,
      "id": 31733165,
      "score": 1,
      "text": "Is there an easy tool to sketch a business model as Markov Chains, estimate probabilities, uncertainties and starting values, and run Monte Carlo simulations to visualise the probability space of the outcomes given the input?<p>This could be immensely valuable to check your overall understanding of your market. Are your mental models in sync with your assumptions about the economy’s fundamentals and the underlying mechanisms of cause and effect? If your micro-models don’t add up to your macro-projections, you’re either having delusional dreams about the future OR your everyday decision making is impaired due to flawed models.<p>Such a simple model could give answers to highly complex questions, e.g.: how much additional money do we need to raise when inflation hits our input factors with 10%, while we limit our price hikes to 6.5%? What if our most important channel for leads gets 100% more expensive and 10% less effective? \nWhat I want is a mathematical model of cause and effect, written in the language of probabilities, translating micro-estimations into tangible long-term projections.<p>Financial planning via Excel sucks. This is what we need - or don’t we?",
      "time": 1655164522,
      "title": "Ask HN: Model Business as Markov Chains?",
      "type": "story"
    },
    {
      "by": "kklisura",
      "descendants": 0,
      "id": 31733145,
      "score": 1,
      "time": 1655164291,
      "title": "Meltdowns Have Brought Progressive Advocacy Groups to a Standstill",
      "type": "story",
      "url": "https://theintercept.com/2022/06/13/progressive-organizing-infighting-callout-culture/"
    },
    {
      "by": "chhhuang",
      "descendants": 0,
      "id": 31733144,
      "score": 1,
      "time": 1655164278,
      "title": "Microsoft's Simulation Framework Accelerates Federated Learning Algorithm Dev",
      "type": "story",
      "url": "https://www.infoq.com/news/2022/06/FLUTE-federated-learning/"
    },
    {
      "by": "Barrera",
      "descendants": 0,
      "id": 31733143,
      "score": 2,
      "time": 1655164254,
      "title": "Japan 10-year yields breach Bank of Japan's upper limit",
      "type": "story",
      "url": "https://financialpost.com/pmn/business-pmn/japan-10-year-jgb-yields-breach-bojs-upper-limit"
    },
    {
      "by": "maxproske",
      "descendants": 2,
      "id": 31733112,
      "kids": [
        31733121
      ],
      "score": 7,
      "time": 1655163941,
      "title": "DigitalOcean Was Down",
      "type": "story",
      "url": "https://status.digitalocean.com"
    }
  ]
}