{
  "stories": [
    {
      "by": "melling",
      "descendants": 0,
      "id": 30528573,
      "score": 1,
      "time": 1646235862,
      "title": "A.I. is on the front lines of the war in Ukraine",
      "type": "story",
      "url": "https://fortune.com/2022/03/01/russia-ukraine-invasion-war-a-i-artificial-intelligence/"
    },
    {
      "by": "spansoa",
      "descendants": 0,
      "id": 30528565,
      "score": 1,
      "time": 1646235815,
      "title": "Wiby – Search Engine for the Classic Web",
      "type": "story",
      "url": "https://wiby.me/"
    },
    {
      "by": "mjaques",
      "descendants": 0,
      "id": 30528553,
      "score": 1,
      "time": 1646235755,
      "title": "Deckmill: Language Learning Flashcards Without Gimmicks",
      "type": "story",
      "url": "https://deckmill.com"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30528536,
      "score": 1,
      "time": 1646235671,
      "title": "New technique unlocks ancient history of Earth from grains of sand",
      "type": "story",
      "url": "https://phys.org/news/2022-03-technique-ancient-history-earth-grains.html"
    },
    {
      "by": "edison_vf",
      "descendants": 0,
      "id": 30528530,
      "score": 2,
      "time": 1646235648,
      "title": "The Future of ETF's and Cryptocurrencies “Vision of ETF-Cripto”",
      "type": "story",
      "url": "https://etfcripto.com/overview/"
    },
    {
      "by": "awb",
      "descendants": 0,
      "id": 30528503,
      "score": 2,
      "time": 1646235507,
      "title": "Russia's top bank quits Europe due to sanctions",
      "type": "story",
      "url": "https://www.reuters.com/business/finance/russias-sberbank-leave-european-market-face-cash-outflows-2022-03-02/"
    },
    {
      "by": "jack_herer",
      "descendants": 0,
      "id": 30528475,
      "score": 1,
      "time": 1646235351,
      "title": "“Is Computer Science Science?” an Article from 2005",
      "type": "story",
      "url": "https://cacm.acm.org/magazines/2005/4/6255-is-computer-science-science/fulltext"
    },
    {
      "by": "andrei_says_",
      "descendants": 0,
      "id": 30528473,
      "score": 3,
      "time": 1646235337,
      "title": "SPAs Were a Mistake",
      "type": "story",
      "url": "https://gomakethings.com/spas-were-a-mistake/"
    },
    {
      "by": "aquaphile",
      "descendants": 0,
      "id": 30528463,
      "score": 5,
      "text": "Hello Hacker News! Mark, Jay and I are the cofounders of Evry Health (<a href=\"https:&#x2F;&#x2F;evryhealth.com\" rel=\"nofollow\">https:&#x2F;&#x2F;evryhealth.com</a>). We are a full-stack health insurance company that reduces premiums by up to 20% for companies while improving the health and wellness of their employees.<p>People and media constantly talk about the problems in our healthcare system: prices are too high; premiums are rising faster than household income; health outcomes are lower than the rest of the developed world; mental health coverage is inadequate; and the lack of transparency and accessibility creates confusion for us all. All these are real problems, but they’re symptoms rather than root causes.<p>We believe the root cause is that the U.S. system is rife with misaligned incentives. For example, the fee-for-service structure incentivizes overuse and volume-based billing, rather than health. Thirty-five cents of every dollar spent goes to clinical waste, unnecessary services, administrative bloat, or fraud. (We could give footnotes, but doubt anyone needs convincing.)<p>We’re building Evry to realign incentives for mutual benefit. Our primary plan is an EPO (Exclusive Provider Organization), which is like an HMO, except you don’t have to choose a primary care physician and you don’t need a referral to see a specialist. We have no deductibles, almost no copays, and benefits that exceed the best plans from legacy insurers.   \nWe pay most doctors and hospitals based on patient outcomes, not fee-for-service. Telehealth is available for free 24&#x2F;7. Members receive a customized care plan that provides additional resources and offers cash incentives on a debit card. All this is to remove barriers to care and improve the health of each member at no additional cost.<p>On top of that, we reduce premiums by up to 20% for employers. We can do this because we are a software company that owns an insurance carrier. We automate roughly half the tasks involved with claims, care coordination, underwriting and back-office operations.\nWe aggregate data from disparate sources (claims, clinical, pharma, lab, and wellness data) to make superior decisions and aid patients. Our technology helps members identify and treat conditions earlier and more effectively. We also have a much better user experience—a single portal to access telehealth, care concierge, claims data, wellness plan, doctor lookup, rewards card, etc.<p>The industry is still fundamentally basing prices on 1960s approaches to accounting (ChargeMaster pricing). 1980s tech and accounting &quot;advanced&quot; the dialog to Diagnostic Resource Group pricing. But insurers and hospitals alike are saddled with this decades old technology and pricing that obscures transparency, adds cost, and isn&#x27;t tied to patient outcomes. There are software businesses that focus on translating ChargeMaster to DRG to the more recent idea of Reference-based pricing. That is not the way to use technology to improve health care! We’re going much deeper.<p>The caveat is that so far, we only provide coverage to businesses with 100+ employees in  Texas. We launched in our first market of Dallas Fort-Worth. That’s our beachhead, and we’re working on expanding into new states and markets  (It takes a long time to get something like Evry off the ground—there are large barriers to entry). Since half of Americans get health coverage through their employer, we’re focused on companies to maximize impact.<p>We&#x27;ve built insurance, healthcare and fintech companies before.  I founded the insurer that invented per-mile auto insurance (&quot;Drive Less, Pay Less&quot;) and reduced premiums up to 50%.  Mark (CFO) is a healthcare actuary with 30 years’ experience ranging from Aetna to Managing Director in Big 4 consulting. Jay (COO) is a fintech veteran who started in healthcare working with large hospital systems.  What inspired us to start Evry was that we lost friends and family to the terrible dysfunction in the healthcare system. We felt we had the skill sets needed to do something about the problems, and ultimately decided we had to.<p>There is a lack of innovation in this space, and many things being tried—shifts to direct contracting, direct primary care, self-funded programs for individuals and SMBs—do not address the root problems. They are temporary price-oriented solutions. These are a form of moving the ball between cups—prices are better because coverage is impaired in hidden ways that the average person doesn’t discover until it’s too late.<p>There’s also a strong debate, of course, about governmental reforms to U.S. health care. Many support Medicare For All (MFA) for good reasons. However, MFA on its own may not be enough to address clinical variation and some of the other root problems in the system. In any case, in the absence of government action, we believe private sector innovation can address some of our shared problems. We’d be happy to discuss this, and the details of what we’re doing, in the comments below. We’d also like to hear about your own ideas!",
      "time": 1646235236,
      "title": "Launch HN: Evry Health (YC W18) – Better health insurance for companies",
      "type": "story",
      "url": "https://www.evryhealth.com/"
    },
    {
      "by": "Brajeshwar",
      "descendants": 0,
      "id": 30528460,
      "score": 2,
      "time": 1646235222,
      "title": "Satellite data show doubling of tropical forest carbon loss in past two decades",
      "type": "story",
      "url": "https://phys.org/news/2022-03-high-resolution-satellite-datasets-gross-tropical.html"
    }
  ]
}