{
  "stories": [
    {
      "by": "etiam",
      "descendants": 0,
      "id": 31557667,
      "score": 1,
      "time": 1653908203,
      "title": "Security and Human Behaviour 2022",
      "type": "story",
      "url": "https://www.lightbluetouchpaper.org/2022/05/30/security-and-human-behaviour-2022/"
    },
    {
      "by": "heshiming",
      "descendants": 0,
      "id": 31557655,
      "score": 1,
      "text": "I worked for years as a freelance contractor in NLP. Clients and agencies generally consider sentiment analysis a simple matter. But the reality is off-the-shelf packages, like TextBlob are rule-based. When you put together an app, like a chatbot for customer services, they rarely work well. The cost to improve is nothing short of reinventing a new system, which most wouldn&#x27;t accept. Plus, the consensus is that people prefer self-hosted in-house solutions they can improve. Reasons to avoid sending texts to an external API are 1, privacy, and 2, per-call pricing.<p>So I have this idea. I create an open-source toolkit for sentiment analysis. It will be data-driven, not rule-based. So it can fit most use cases well. It&#x27;ll be a full package with GUI, for labeling, training, and an API server to self-host the model.<p>I keep a private repo of data to generate a good-enough model for a niche: customer service chatbots. A part of which is curated (scraped), and a part is labeled by myself. I sell a subscription to the model, during which period, I try to gather and label more data to improve the model. I can design the system to support partial training. That is, the customer can improve based on my model, using just hundreds of lines of their own data.<p>I figured if I priced it the right way (10-20% of hiring someone to create one), I can sell it to dev shops and agencies. I can go to Linkedin or Upwork to approach my customers.<p>Does this sound like a viable idea for a one-man shop?",
      "time": 1653908105,
      "title": "Open-source sentiment analysis toolkit, a valid small business idea?",
      "type": "story"
    },
    {
      "by": "hassanahmad",
      "descendants": 0,
      "id": 31557631,
      "score": 1,
      "time": 1653907906,
      "title": "JBS Foods cyber attack highlights industry vulnerabilities to Russian hackers",
      "type": "story",
      "url": "https://www.abc.net.au/news/2022-05-30/food-industry-cyber-attack-russia-hacking-risk/101110386"
    },
    {
      "by": "Trouble_007",
      "descendants": 0,
      "id": 31557608,
      "score": 1,
      "time": 1653907693,
      "title": "Oracle Java Bug Database – Search the Bug Database",
      "type": "story",
      "url": "https://bugs.java.com/bugdatabase/"
    },
    {
      "by": "ArdelleF",
      "descendants": 0,
      "id": 31557604,
      "score": 1,
      "time": 1653907681,
      "title": "Automate your observability with New Relic",
      "type": "story",
      "url": "https://newrelic.com/blog/best-practices/automating-observability"
    },
    {
      "by": "cosmorocket",
      "descendants": 0,
      "id": 31557569,
      "score": 2,
      "text": "Assume I am creating a webapp which can receive money from the users to their &quot;accounts&quot; in my system and send them out, something like a super simplified  version of a bank.<p>Are there any guides, practices to make it safe and properly? I see multiple ways of doing the same thing. For example, when a user puts in $10, then $3 then $7, then moves out $4, I can use a table in the database called balances and add or subtract a single number in the column - 0 + 10 + 3 + 7 - 4 = 16.<p>So, I keep in the column value of 16.<p>Another way is to add rows into a table called &quot;transactions&quot; and calculate the current balance every time I need it. In this case, if there are thousands of transaction for the user, I would need to calculate thousands of numbers every time I need to know balance.<p>I don&#x27;t want to reinvent the wheel so I would be happy to just have some guide of how these things are usually implemented even though I understand there is no such scenario as &quot;standard&quot; one and there are always myriads of small differences between different implementations.<p>In what direction should I look to understand how to build such a system in a better way and avoid mistakes?<p>Thanks!",
      "time": 1653907384,
      "title": "Ask HN: How to better implement a deposit/withdrawal tracking system?",
      "type": "story"
    },
    {
      "by": "Skinney",
      "descendants": 0,
      "id": 31557565,
      "score": 1,
      "time": 1653907334,
      "title": "Gren 0.1.0, a new pure functional programming language, is released",
      "type": "story",
      "url": "https://gren-lang.org/news/220530_first_release/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31557551,
      "score": 1,
      "time": 1653907208,
      "title": "When It Comes to Human Extinction, We Could Be Our Worst Enemy and Best Hope",
      "type": "story",
      "url": "https://www.cnet.com/culture/features/human-extinction-could-be-in-our-future/"
    },
    {
      "by": "webmaven",
      "descendants": 0,
      "id": 31557529,
      "score": 3,
      "time": 1653907033,
      "title": "World Builders Put Happy Face on Superintelligent AI",
      "type": "story",
      "url": "https://spectrum.ieee.org/superintelligence-future-life-institute-contest"
    },
    {
      "by": "ArdelleF",
      "descendants": 0,
      "id": 31557516,
      "score": 1,
      "time": 1653906890,
      "title": "OSSInsight – Explore Deep in 4.6B GitHub Events",
      "type": "story",
      "url": "https://en.pingcap.com/blog/explore-deep-in-4-6-billion-github-events/"
    }
  ]
}