{
  "stories": [
    {
      "by": "jdhendrickson",
      "descendants": 0,
      "id": 30401241,
      "score": 1,
      "text": "I just wanted to share an experience as a warning to fellow users of hacker news and in the hope that somehow someway 7 years and countless hours can be recovered.<p>I&#x27;ve never posted anything like this, but this is the only place I have any hope of a human response after youtube deleted 700 videos created for internal training for our company. My wife started a company that helps people transition from colleges in their home country (for instance the IIT system in India) by translating their credit system into the American educational credit system.<p>She utilized a youtube channel with unlisted videos to explain to internal employees the nuances of difficult evaluation types, for instance how to determine for CEGEPs in Quebec the difference between upper secondary and post secondary. Another example would be how to award credits for MBBS programs from U.K modeled educational system (West Africa, India etc).<p>Youtube sent her 3 strikes in one week. On videos that were 4 years old, indicating cyber bullying. These videos were unlisted and literally contained only incredibly dense, rather boring videos covering the nooks and crannies of various educational systems and how they relate to each other. When she responded, she received an auto reply that stated you get a reply within 2 business days. No further response despite repeated requests within the system, then tweets, and finally submitting a new appeal form from scratch to which the reply was nothing can be done because too much time had passed.<p>This content was incredibly time intensive to create and was basically another job on top of her position as CEO. As a small company this was a devastating blow. Her work youtube account is now removed.<p>Personally the cynic in me speculates that google cleans out low hanging fruit, using metrics, and there was nothing in the content that triggered the bot at all, just a case of over 700 somewhat lengthy videos that were getting almost no traffic, and they get to delete them and hide behind the byzantine garbage fire that is their &quot;support&quot;.<p>If you work for the youtube division and can help, I&#x27;m begging you please send me a message or reply to this post, it seems this is the only way to rectify this kind of problem. If there is anyway to download the videos that is all we are asking for.<p>-jdh",
      "time": 1645310705,
      "title": "YouTube and how my wife lost 7 years of work",
      "type": "story"
    },
    {
      "by": "jka",
      "descendants": 0,
      "id": 30401228,
      "score": 1,
      "time": 1645310593,
      "title": "Henry George: Progress and Poverty",
      "type": "story",
      "url": "https://progressandpoverty.org/"
    },
    {
      "by": "pps",
      "descendants": 0,
      "id": 30401198,
      "score": 1,
      "time": 1645310306,
      "title": "Taiko – A Node.js library for testing modern web applications",
      "type": "story",
      "url": "https://taiko.dev/"
    },
    {
      "by": "smartmic",
      "descendants": 0,
      "id": 30401179,
      "score": 1,
      "time": 1645310112,
      "title": "Decremental Backups with DAR",
      "type": "story",
      "url": "http://dar.linux.free.fr/doc/usage_notes.html#Decremental_Backup"
    },
    {
      "by": "mad_ned",
      "descendants": 0,
      "id": 30401178,
      "score": 2,
      "time": 1645310111,
      "title": "My Nine-Bit Computer, part 000 000 010",
      "type": "story",
      "url": "https://madned.substack.com/p/holy-nonads-part-000-000-010"
    },
    {
      "by": "tagawa",
      "descendants": 0,
      "id": 30401176,
      "score": 1,
      "time": 1645310107,
      "title": "Row Jimmy",
      "type": "story",
      "url": "https://petermaguire.substack.com/p/row-jimmy"
    },
    {
      "by": "cheese_goddess",
      "descendants": 0,
      "id": 30401173,
      "score": 1,
      "time": 1645310074,
      "title": "The farmer who makes 'ethical' foie gras",
      "type": "story",
      "url": "https://www.theguardian.com/world/2015/jan/18/the-farmer-who-makes-ethical-foie-gras"
    },
    {
      "by": "RealAvatar",
      "descendants": 0,
      "id": 30401161,
      "score": 1,
      "text": "Realistic virtual humans will play a central role in mixed and augmented reality, forming a critical foundation for the Metaverse and supporting remote presence, collaboration, education, and entertainment.\nTo enable this, new tools are needed to easily create large-scale 3D virtual humans that can be readily animated. However, current methods need either posed 3D scans captured by expensive scanning equipment or 2D images with carefully controlled user poses. Both of them can&#x27;t scale up easily.<p>ICON (&quot;Implicit Clothed humans Obtained from Normals&quot;) takes a step towards robust 3D clothed human reconstruction from in-the-wild images. This also enables creating animatable avatars directly from video with personalized and natural pose-dependent cloth deformation.<p>Homepage: <a href=\"https:&#x2F;&#x2F;icon.is.tue.mpg.de&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;icon.is.tue.mpg.de&#x2F;</a><p>Github: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;YuliangXiu&#x2F;ICON\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;YuliangXiu&#x2F;ICON</a><p>Google Colab: <a href=\"https:&#x2F;&#x2F;colab.research.google.com&#x2F;drive&#x2F;1-AWeWhPvCTBX0KfMtgtMk10uPU05ihoA?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;colab.research.google.com&#x2F;drive&#x2F;1-AWeWhPvCTBX0KfMtgt...</a>",
      "time": 1645309972,
      "title": "Show HN: ICON-3D Avatar Creator from 2D Pixels",
      "type": "story",
      "url": "https://github.com/YuliangXiu/ICON"
    },
    {
      "by": "maverick74",
      "descendants": 0,
      "id": 30401136,
      "score": 1,
      "time": 1645309789,
      "title": "Firefox mobile always load sites in new tabs",
      "type": "story",
      "url": "https://support.mozilla.org/en-US/questions/1367916"
    },
    {
      "by": "sandreas",
      "descendants": 0,
      "id": 30401122,
      "score": 1,
      "text": "I asked this question on stackoverflow, but nobody seems to have an answer yet. Maybe you guys could help. Using the configBuilder with reloadOnChange=true leads to a HUGE slowdown in startup time (usually &gt;1000% - in bigger apps 10 seconds and more). It is dotnet 6 with release mode producing a single executable binary...<p>The line that matters is:<p><pre><code>  configBuilder.AddJsonFile(f, true, true); \n</code></pre>\nHere is the full code:<p><pre><code>  var configBuilder = new ConfigurationBuilder();\n  \n  var configFiles = new[]\n  {\n      Path.Combine(AppDomain.CurrentDomain.BaseDirectory, &quot;appsettings.json&quot;),\n      &#x2F;&#x2F; the files below do not exist, not even the directory - just a fallback\n      Path.Combine(Environment.GetFolderPath(UserProfile, DoNotVerify), &quot;.tester&#x2F;appsettings.json&quot;),\n      Path.Combine(Environment.GetFolderPath(ApplicationData, DoNotVerify), &quot;tester&#x2F;appsettings.json&quot;),\n  };\n  \n  foreach (var f in configFiles)\n  {\n      &#x2F;&#x2F; using the line below works fast like expected\n      &#x2F;&#x2F; configBuilder.AddJsonFile(f, true, false); \n      \n      &#x2F;&#x2F; HUGE slowdown of app startup with second parameter set to true. Why?\n      configBuilder.AddJsonFile(f, true, true); \n  }\n  \n  var config = configBuilder.Build();\n  Console.WriteLine(&quot;tester&quot;);\n\n</code></pre>\nMore details:\nhttps:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;71179452&#x2F;c-sharp-configurationbuilder-with-reloadonchange-true-slows-down-app-startup-on",
      "time": 1645309685,
      "title": "Ask HN: C# reloadOnChange=true slows down startup on Linux by 2.2 seconds. Why?",
      "type": "story"
    }
  ]
}