{
  "stories": [
    {
      "by": "dredmorbius",
      "descendants": 0,
      "id": 28332019,
      "score": 1,
      "time": 1630092608,
      "title": "Reddit turns down moderators who want action on Covid misinformation",
      "type": "story",
      "url": "https://www.cnn.com/2021/08/26/tech/reddit-misinformation-covid/index.html"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28332007,
      "score": 1,
      "time": 1630092539,
      "title": "Jupyter, Mathematica, and the Future of the Research Paper (2018)",
      "type": "story",
      "url": "https://paulromer.net/jupyter-mathematica-and-the-future-of-the-research-paper/"
    },
    {
      "by": "pmlnr",
      "descendants": 0,
      "id": 28332004,
      "score": 1,
      "time": 1630092530,
      "title": "LED Light Spectrum Enhancement with Transparent Pigmented Glazes (2016)",
      "type": "story",
      "url": "https://www.led-professional.com/resources-1/articles/led-light-spectrum-enhancement-with-transparent-pigmented-glazes-by-light-spectrum-glazes"
    },
    {
      "by": "AndrewDucker",
      "descendants": 0,
      "id": 28331948,
      "score": 1,
      "time": 1630092220,
      "title": "Why Windows 11 has such strict hardware requirements, according to Microsoft",
      "type": "story",
      "url": "https://arstechnica.com/gadgets/2021/08/why-windows-11-has-such-strict-hardware-requirements-according-to-microsoft/"
    },
    {
      "by": "shashkoff",
      "descendants": 0,
      "id": 28331943,
      "score": 2,
      "text": "We&#x27;re Alexey and Gleb, co-founders of getlanding.io (https:&#x2F;&#x2F;getlanding.io). We are building a product, where users can quickly generate CTA landing pages without designers, developers, and no-code website builders, just answering a few questions.<p>Story:<p>We started working together on this product 4 weeks ago when the «S21 YC Build Sprint» began. We actually got to know each other through the startup community on Facebook. I posted a topic saying I was looking for a technical co-founder. Gleb reached out. We started talking on the phone. Then we brainstormed in Zoom. Things clicked and we started working together. The rest is history as they say.<p>The reason why we started to work on this product was that we both were really frustrated at the experience in our last projects, because it was really hard just to create a conversion landing page in a few minutes.<p>We posted two topics on YC Startup School Forum, Indie Hackers, Product Hunt and Hacker News asking «What do you think about the AI landing page generator?» and «What&#x27;s the hardest part about creating a landing page for you?». 40+ people responded. We talked to some people and learned one thing.<p>The thing is, even with no-code website builders, most marketing people (marketers, product managers, some founders), still delegate it to developers and designers because they don&#x27;t want to waste their own time.<p>That&#x27;s why we built Getlanding.io, to allow marketing people to get their landing pages in a few minutes by answering a few questions. Without designers, developers, and no-code website building platforms.<p>MVP:<p>We almost built our MVP. We built a backend and generated our own landing page. But we didn&#x27;t get a frontend yet. We decided to pre-launch with a closed beta!<p>In the first version our MVP can do all of the grunt work and instantly generate multiple variants of CTA landing pages based on user answers.<p>We currently support only CTA landing pages, and maybe it can be expanded to full-blown landing pages and marketing websites later.<p>How it works (when MVP is ready):<p>1. You answer some questions about your CTA landing page and project.<p>2. Getlanding generates several variants of your CTA landing page. You can indefinitely click the «Generate» button to get new design variants.<p>3. When you decide on a design you can publish the final optimised version with just one click.<p>4. Want to connect your custom domain name? No problem, you can do it for free or use our free subdomain.<p>Applications:<p>The main applications of this product are:<p>1. Launching landing pages quickly, without the need for designers, developers, and landing page builders;<p>2. Creating landing pages at scale (tens and hundreds of landing pages).<p>Request for feedback:<p>We&#x27;re glad to announce the pre-launch of our product and get feedback.<p>Michael Seibel (Y Combinator CEO) said:\n– Launch something bad quickly (MVP). You can even start with a simple website that explains what you do.\n– Get some initial users.\n– Talk to your users after you&#x27;ve launched this MVP and get feedback.\n– Iterate. Continue improving on your solution until it actually solves a problem.<p>We think of this place as the friendliest place to launch.\nWe&#x27;d love to hear your feedback about our product. Feel free to leave a comment below. We will respond in the comments. (https:&#x2F;&#x2F;getlanding.io)",
      "time": 1630092205,
      "title": "Show HN: Getlanding.io – The easiest way to get a CTA landing page",
      "type": "story"
    },
    {
      "by": "lobo_tuerto",
      "descendants": 0,
      "id": 28331923,
      "score": 1,
      "time": 1630092117,
      "title": "Journey into a Schwarzschild Black Hole",
      "type": "story",
      "url": "https://jila.colorado.edu/~ajsh/insidebh/schw.html"
    },
    {
      "by": "rwmj",
      "descendants": 0,
      "id": 28331914,
      "score": 2,
      "time": 1630092020,
      "title": "Differentiating Communication Styles of Leaders on the Linux Kernel Mailing List [pdf]",
      "type": "story",
      "url": "https://flosshub.org/sites/flosshub.org/files/v3_0.pdf"
    },
    {
      "by": "EvgeniyZh",
      "descendants": 0,
      "id": 28331911,
      "score": 1,
      "time": 1630092003,
      "title": "Reconnaissance Blind Chess",
      "type": "story",
      "url": "https://rbc.jhuapl.edu/"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 28331910,
      "score": 1,
      "time": 1630091973,
      "title": "Pandemic’s labor reshuffle likely just starting",
      "type": "story",
      "url": "https://www.reuters.com/world/the-great-reboot/pandemics-labor-reshuffle-likely-just-starting-us-workers-2021-05-11/"
    },
    {
      "by": "lesbianbezos",
      "descendants": 0,
      "id": 28331876,
      "score": 3,
      "time": 1630091753,
      "title": "I didn't get in YC, so I made YC",
      "type": "story",
      "url": "https://founderscafe.io"
    }
  ]
}