{
  "stories": [
    {
      "by": "durub",
      "descendants": 0,
      "id": 29394698,
      "score": 1,
      "text": "When I think about it, the main difference between a native speaker and a fluent speaker is how much time they spent using it. A native speaker breathes the language, while the fluent one struggles because they use it rarely.<p>When I program, for instance, I&#x27;m not using English or Brazilian Portuguese (my native language). I&#x27;m using, in my head, a language my mind made up for me, with understanding of the abstract CS concepts. My mind translates the syntax I&#x27;m reading to this internal language, and translates this internal language to syntax I&#x27;m writing or reading. That&#x27;s why I feel people have a difficult time going from imperative programming &lt;-&gt; functional programming, because your internal language must evolve and change to get used to these new concepts, and that takes time. It&#x27;s not <i>just</i> syntax.<p>With this out of the way, I don&#x27;t know the current scientific view on it, but I think that the biggest challenge for adults learning a new language is not a technical one. It&#x27;s an emotional one.<p>Adults don&#x27;t think like children. They are afraid to explore and make mistakes, because they think will be judged by others. As we grow, we tend to shake off our child behaviors, and become closed in our bubble and &quot;the box&quot; we created for ourselves, which becomes our reality and our world. And this world says that no, you can&#x27;t become a native speaker in another language after you grow up. Then, you use your native language as a crutch instead of living this new language you are learning. You try to translate words, you try to map the concepts from your culture to this language (language and culture seems to be so intertwined -- what is &quot;idiomatic Rust&quot;, after all?). You want to communicate the way you communicate in your native language, and it frustrates us so much when we can&#x27;t. A child is not having any of it. He or she is just playing, enjoying the process, and learning day after day.<p>Right now, my co-founder and I are preparing for a YC interview and it&#x27;s funny trying to explain, in English, concepts that we have been explaining in Portuguese for years. We don&#x27;t throw away all our existing knowledge. We try to map our current vision, in Portuguese, to English. Sometimes it works ok, but sometimes the message doesn&#x27;t get across.<p>I studied Japanese for a few years using Anki and WaniKani, and the results were amazing. When I wrote Japanese, people didn&#x27;t believe I was studying for only months and could write what I wrote. However, I didn&#x27;t do anything special. What I did, or rather, what I didn&#x27;t do, was try to translate English or Portuguese into Japanese. I used Japanese. With the concepts the Japanese language gives us. We could say... idiomatic Japanese. But, when it came to speaking... oh boy, was I a mess. So afraid to say something wrong, that I couldn&#x27;t even speak at all! And as Portuguese has all the phonetic sounds the Japanese language uses, my pronunciation was very good. Sorry for the native English speakers out there learning Japanese, you got the short end of the stick, but hey -- at least your countries are rich!<p>When it comes to English, my reading and writing ability is very good, but when I try to speak, what trips me up sometimes is pronunciation. My mind wants to say something, but when I try to use the word I&#x27;m going for, I realize I have no idea on how to say it. And then, paralyzed by my inability to do what I wanted, I become a deer in the headlights. An emotional problem, not a technical one, because I could just use another word. To improve this, I&#x27;m thinking about practicing shadowing daily.<p>To sum it up:<p>1) Do you think we can become native in another language after we grow up? Do you not? Why?<p>2) Does someone have tips on how to improve pronunciation? It&#x27;s not that bad, it&#x27;s just a word here or there, but I do have a small accent which I&#x27;d like to shrink even more. Maybe even learn how to speak in a British accent... you folks like that, right? I reckon it&#x27;s rather charming. :)",
      "time": 1638293035,
      "title": "Ask HN: Do you think we, as adults, can become native in another language?",
      "type": "story"
    },
    {
      "by": "xrayarx",
      "descendants": 0,
      "id": 29394690,
      "score": 1,
      "time": 1638292987,
      "title": "Finland Battles Exceptional Malware Attack Spread by Phones",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2021-11-30/finland-battles-exceptional-malware-attack-spread-by-phones"
    },
    {
      "by": "simonebrunozzi",
      "descendants": 0,
      "id": 29394680,
      "score": 2,
      "time": 1638292953,
      "title": "Rechargeable Concrete Battery",
      "type": "story",
      "url": "https://www.mdpi.com/2075-5309/11/3/103"
    },
    {
      "by": "ingve",
      "descendants": 0,
      "id": 29394662,
      "score": 2,
      "time": 1638292905,
      "title": "A Case for Fast CI",
      "type": "story",
      "url": "https://pspdfkit.com/blog/2021/a-case-for-fast-ci/"
    },
    {
      "by": "tlhunter",
      "descendants": 1,
      "id": 29394617,
      "kids": [
        29394702
      ],
      "score": 1,
      "time": 1638292759,
      "title": "Show HN: Radar Chat – Leave Digital Messages in the Physical World",
      "type": "story",
      "url": "https://radar.chat/"
    },
    {
      "by": "Trisell",
      "descendants": 0,
      "id": 29394605,
      "score": 5,
      "time": 1638292710,
      "title": "AWS Private 5g - 5G As a Service",
      "type": "story",
      "url": "https://aws.amazon.com/private5g/"
    },
    {
      "by": "DyslexicAtheist",
      "descendants": 0,
      "id": 29394598,
      "score": 1,
      "time": 1638292698,
      "title": "How China Exports Repression Using a Network of Spies Hidden in Plain Sight",
      "type": "story",
      "url": "https://www.propublica.org/article/operation-fox-hunt-how-china-exports-repression-using-a-network-of-spies-hidden-in-plain-sight"
    },
    {
      "by": "Agspeaks",
      "descendants": 0,
      "id": 29394581,
      "score": 1,
      "time": 1638292619,
      "title": "JetBrains introduces interactive reporting into data science notebook platform",
      "type": "story",
      "url": "https://blog.jetbrains.com/datalore/2021/11/30/introducing-datalore-enterprise-2021-3-database-connections-sql-cells-interactive-reports-and-more/"
    },
    {
      "by": "Trisell",
      "descendants": 1,
      "id": 29394571,
      "kids": [
        29394718
      ],
      "score": 8,
      "time": 1638292583,
      "title": "AWS Graviton 3 Instances",
      "type": "story",
      "url": "https://aws.amazon.com/blogs/aws/join-the-preview-amazon-ec2-c7g-instances-powered-by-new-aws-graviton3-processors/"
    },
    {
      "by": "elevanation",
      "descendants": 0,
      "id": 29394570,
      "score": 2,
      "time": 1638292573,
      "title": "Relevanace of Personality Type in Career, Particularly the ESTP vs. ENTP",
      "type": "story",
      "url": "https://elevanation.com/estp-vs-entp/"
    }
  ]
}