{
  "stories": [
    {
      "by": "fullung",
      "descendants": 0,
      "id": 28523747,
      "score": 1,
      "time": 1631622801,
      "title": "Segmentio/asm – Go library of algorithms optimized to leverage modern CPUs",
      "type": "story",
      "url": "https://github.com/segmentio/asm"
    },
    {
      "by": "Crafty_Gurl",
      "descendants": 0,
      "id": 28523735,
      "score": 1,
      "time": 1631622709,
      "title": "AhoyConnect Lands $3M, Places Community Data at the Forefront of Growth",
      "type": "story",
      "url": "https://www.prnewswire.com/news-releases/ahoyconnect-lands-3m-in-seed-funding-places-community-data-at-the-forefront-of-growth-301375976.html"
    },
    {
      "by": "qwertyuiop_",
      "descendants": 0,
      "id": 28523711,
      "score": 1,
      "time": 1631622588,
      "title": "Science Denied: The Biden Vaccine Mandate ⋆ Brownstone Institute",
      "type": "story",
      "url": "https://brownstone.org/articles/science-denied-the-biden-vaccine-mandate/"
    },
    {
      "by": "jmsflknr",
      "descendants": 0,
      "id": 28523688,
      "score": 2,
      "time": 1631622446,
      "title": "Facebook Knows Instagram Is Toxic for Teen Girls, Company Documents Show",
      "type": "story",
      "url": "https://www.wsj.com/articles/facebook-knows-instagram-is-toxic-for-teen-girls-company-documents-show-11631620739"
    },
    {
      "by": "shoto_io",
      "descendants": 2,
      "id": 28523678,
      "kids": [
        28523737
      ],
      "score": 1,
      "text": "Hey there, we are a slowly growing startup and now are thinking about how to bring our currently fragmented productivity (personal gmail etc.) setup to the next level.<p>Some of my thinking revolves around:<p>- G Suite is great for docs, but I don&#x27;t want to trust Google with our email and calendars<p>- Dropbox is great, but has no calender&#x2F;mail functionality<p>- MS is ok, but G Docs is so much better for collaborating<p>What do you guys use? Is there any best practice we could follow?",
      "time": 1631622400,
      "title": "Ask HN: What's your early stage productivity stack?",
      "type": "story"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 28523659,
      "score": 1,
      "time": 1631622327,
      "title": "ITimed: Cache Attacks on the Apple A10 Fusion SoC [pdf]",
      "type": "story",
      "url": "https://eprint.iacr.org/2021/464.pdf"
    },
    {
      "by": "ibobev",
      "descendants": 0,
      "id": 28523641,
      "score": 1,
      "time": 1631622260,
      "title": "Scene Graph",
      "type": "story",
      "url": "https://learnopengl.com/Guest-Articles/2021/Scene/Scene-Graph"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 28523629,
      "score": 2,
      "time": 1631622213,
      "title": "Nikon’s Small World",
      "type": "story",
      "url": "https://www.nikonsmallworld.com/"
    },
    {
      "by": "digitcatphd",
      "descendants": 0,
      "id": 28523621,
      "score": 1,
      "text": "I&#x27;ve been researching a new payment system designed to compete with credit cards designed to do two things:<p>(1) Remove the &#x27;deadweight loss&#x27; in credit card fees\n(2) Outperform the incentive structure of all credit cards for their users<p>Venmo solves (1), but fails to address (2) because it doesn&#x27;t properly incentivize users like credit cards offering cash back, and isn&#x27;t perceived to be a legitimate form of payment for business.<p>My researched approach is to charge the same processing fee as credit card companies of around 3%, but rather offer an instant discount of the order at the merchant, rather than a points system. What this does is:<p>(1) Outperforms the reward system of any other payment system \n(2) Incentivizes consumers to spend more at SMB because they are getting a discount\n(3) Allows SMBs to pass on their fees to save the customer money\n(4) Creates instant gratification to the consumer<p>Because mobile pay is such a nominal percent of transactions, merchants would be given a small RFID sticker that could be appended to their existing POS or elsewhere and consumers would be given tap to pay embedded fabs synced to a mobile app to process transactions like credit cards. Fabs would not have numbers to avoid theft and would just have RFID embedded chips  like YubiKey.<p>The payment system works the same way as Venmo. (I.e. uses the fee-less transaction technology in the way that payments are processed)<p>If anyone has ideas, open to hearing them below, or anyone interested in pursuing this research.<p>--\nNotes\n--<p>There are of course other incentives with credit cards such as the chargeback capability and financing. However, it&#x27;s been cited 86% of chargebacks are &#x27;friendly fraud&#x27;, which further incentivizes SMBs and disincentivizes at-risk users. Financing may be outsourced and points charged for the rights to do so.",
      "time": 1631622171,
      "title": "Ask HN: Alternative Payment System for SMBs",
      "type": "story"
    },
    {
      "by": "rwestergren",
      "descendants": 0,
      "id": 28523608,
      "score": 2,
      "time": 1631622118,
      "title": "Unauthenticated Remote Code Execution in Motorola Baby Monitors",
      "type": "story",
      "url": "https://randywestergren.com/unauthenticated-remote-code-execution-in-motorola-baby-monitors/"
    }
  ]
}