{
  "stories": [
    {
      "by": "MuchoMaas",
      "descendants": 0,
      "id": 31830795,
      "score": 1,
      "time": 1655858883,
      "title": "Crypto Donors Poured Money into Politics in May Despite Downturn",
      "type": "story",
      "url": "https://www.bloomberg.com/news/articles/2022-06-21/crypto-donors-poured-money-into-politics-in-may-despite-downturn"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31830790,
      "score": 1,
      "time": 1655858814,
      "title": "Genes and family are biggest predictor of academic success",
      "type": "story",
      "url": "https://www.sciencedaily.com/releases/2019/12/191218153459.htm"
    },
    {
      "by": "prostoalex",
      "descendants": 0,
      "id": 31830788,
      "score": 1,
      "time": 1655858794,
      "title": "TerraUSD Crash Led to Vanished Savings, Shattered Dreams",
      "type": "story",
      "url": "https://www.wsj.com/articles/terrausd-crash-led-to-vanished-savings-shattered-dreams-11653649201"
    },
    {
      "by": "3Sophons",
      "descendants": 0,
      "id": 31830781,
      "score": 1,
      "time": 1655858708,
      "title": "WasmEdge 0.10.0 releases: NEW plug-in mechanism making native extensions easy",
      "type": "story",
      "url": "https://www.secondstate.io/articles/wasmedge-0.10.0-release/"
    },
    {
      "by": "mooreds",
      "descendants": 0,
      "id": 31830766,
      "score": 1,
      "time": 1655858550,
      "title": "Prestige Writing",
      "type": "story",
      "url": "https://randsinrepose.com/archives/prestige-writing/"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31830757,
      "score": 2,
      "time": 1655858414,
      "title": "So, how can we lower gas prices?",
      "type": "story",
      "url": "https://noahpinion.substack.com/p/so-how-can-we-lower-gas-prices"
    },
    {
      "by": "paulpauper",
      "descendants": 0,
      "id": 31830756,
      "score": 1,
      "time": 1655858382,
      "title": "I Caught Two Men Stealing from My Home. The Aftermath Was Absurd–and Too Typical",
      "type": "story",
      "url": "https://slate.com/news-and-politics/2022/06/oregon-property-crime-addiction-opioid-epidemic-home-invasion-theft.html"
    },
    {
      "by": "bluelightning2k",
      "descendants": 0,
      "id": 31830720,
      "score": 1,
      "text": "Today GitHub CoPilot revealed &amp; implemented its pricing.<p>There are other threads on that news (the headline is $10&#x2F;mo).<p>But I think this is <i>also</i> interesting as a case-study in Product Management.<p>Sure - Microsoft paid $1 billion IIRC to OpenAI, and this was an obvious product concept (albeit incredibly hard to implement, extremely well exected, etc.)<p>But it was really NOT obvious this would land as *GitHub* CoPilot.<p>Consider the alternatives:<p>- &quot;Microsoft CoPilot&quot;\nStill the biggest brand, but this was never likely.<p>- &quot;Azure CoPilot&quot;\nThis is what we would all have expected - and the fact they didn&#x27;t do this is very interesting indeed. More on this later!<p>- &quot;Visual Studio CoPilot&quot;\nA few years ago this would have certainly been where this landed. But this wouldn&#x27;t have worked well today:\n a) Visual Studio is eclipsed by its own younger brother\n b) This would have implied a coupling which doesn&#x27;t exist (CoPilot is also for JetBrains, etc.) Unless they decided to make this VS &amp; VSCode only - which they surely would have considered.\n c) Visual Studio&#x27;s online services are heavily associated with only the .NET and C ecosystems<p>Then there&#x27;s GitHub. Certainly a huge brand. But that&#x27;s table-stakes for this list.<p>Yes - GitHub is all about developers. But the brand (pre GitHub CoPilot) was really specific in scope. It&#x27;s about Git, and community. The technology association was pretty old (everyone knows git is pretty old &amp; with a famous inventor everyone knows it wasn&#x27;t their innovation).<p>Yes - GitHub is doing other things that are really impressive. But really only CodeSpaces can be described as direct developer tooling. And CodeSpaces is new, obscure, and has a clear fit with the repo-hosting (make the repo editable).<p>Azure on the other hand:\n - Could really have used the publicity&#x2F;millions of new Azure accounts. This alone could have been realistically worth $billions. Because it&#x27;s a significant association with a large number of developers &amp; decision-makers in such a lucrative market<p>- Could have made MORE by bundling: $10&#x2F;mo or free for Azure users.<p>- Has a go-to-market that&#x27;s better at monetizing. There&#x27;s salespeople &amp; consumption-credits &amp; vendor-approvals, etc.<p>- Azure is MUCH more associated with AI, offering a whole host of AI services (and being where most of the other OpenAI stuff landed).<p>- Azure is more associated with dev-tooling than GitHub. (Although Visual Studio is far more associated than both put together, many times over).<p>Here&#x27;s why I think they chose GitHub: it&#x27;s strongly associated with open-source.<p>Sure, many people have asked whether AI trained on open-source&#x2F;public repos with mixed licenses has licensing issues with the generated code.<p>But coming from GitHub, the well-loved champions of OSS? People asking this question are in the minority.\nIf Azure did it - those whispers would have been shouts. Or a riot.<p>When you go with a cloud vendor, in a lot of ways it&#x27;s all or nothing. People have strong opinions.<p>Then you have GitHub. Which feels neutral. GitHub&#x27;s monetization is low &amp; very fair. (SideNote: if this <i>had</i> ended up being Azure CoPilot I think it would be $30&#x2F;mo or more).<p>GitHub is a good launching pad for services designed to be universal; adopted equally by AWS&#x2F;GCP&#x2F;Azure&#x2F;Heroku&#x2F;whatever users. It has goodwill but not baggage. It uses its influence so softly &amp; so helpfully.<p>It seems Microsoft has chosen to be everywhere with CoPilot, and ultimately own more of the developer-experience - rather than take the MayFair &amp; Park Lane hotel which &quot;Azure CoPilot&quot; would have been.<p>If anyone has internal insight, or a product-manager&#x27;s take, please take over from here!",
      "time": 1655858082,
      "title": "GitHub Copilot is a brilliant piece of **product management",
      "type": "story"
    },
    {
      "by": "arkadiyt",
      "descendants": 0,
      "id": 31830709,
      "score": 3,
      "time": 1655858004,
      "title": "China’s Surveillance State Is Growing. These Documents Reveal How",
      "type": "story",
      "url": "https://www.nytimes.com/video/world/asia/100000008314175/china-government-surveillance-data.html"
    },
    {
      "by": "upofadown",
      "descendants": 0,
      "id": 31830698,
      "score": 1,
      "time": 1655857918,
      "title": "From Apples to Pears",
      "type": "story",
      "url": "https://flak.tedunangst.com/post/from-apples-to-pears"
    }
  ]
}