{
  "stories": [
    {
      "by": "ingve",
      "descendants": 0,
      "id": 27974111,
      "score": 1,
      "time": 1627402199,
      "title": "Data Science in Go: How Much to Tip",
      "type": "story",
      "url": "https://www.ardanlabs.com/blog/2021/07/go-data-science-how-much-tip.html"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27974108,
      "score": 1,
      "time": 1627402178,
      "title": "Decrease in Asian Monsoon Rainfall, Abrupt Climate Change Over Past 6,700 Years",
      "type": "story",
      "url": "https://www.pnas.org/content/118/30/e2102007118"
    },
    {
      "by": "pseudolus",
      "descendants": 0,
      "id": 27974106,
      "score": 2,
      "time": 1627402164,
      "title": "US population could shrink for first time on record",
      "type": "story",
      "url": "https://www.businessinsider.com/us-population-growth-stalls-experts-wsj-2021-7"
    },
    {
      "by": "jamieif",
      "descendants": 0,
      "id": 27974096,
      "score": 2,
      "time": 1627402130,
      "title": "Qvault Launches Python Fundamentals Course",
      "type": "story",
      "url": "https://qvault.io/news/python-fundamentals-course-announcement/"
    },
    {
      "by": "CrankyBear",
      "descendants": 0,
      "id": 27974088,
      "score": 1,
      "time": 1627402088,
      "title": "Pandemic redux: No, your workers aren’t coming back to the office",
      "type": "story",
      "url": "https://www.computerworld.com/article/3626361/pandemic-redux-no-your-workers-aren-t-coming-back-to-the-office.html"
    },
    {
      "by": "icey",
      "descendants": 0,
      "id": 27974077,
      "score": 6,
      "text": "Hi HN, we&#x27;re Phil and Paul and we make Abbot – a tool for building and running simple automation via chat (currently Slack, Discord, and MS Teams). It&#x27;s common to go from &quot;I have an idea&quot; to having a fully deployed chat command in under an hour.<p>The term &quot;ChatOps&quot; comes from GitHub, where the two of us worked together. GitHub was always a distributed company and early on developed a culture of doing most work via chat. Engineers automated the most repetitive processes (and some of their sense of humor, too), and that grew into a shared chat-based command line called Hubot. By typing terminal-style commands into chat, you can execute any sort of process that it makes sense for your team to automate. And because it’s in a shared chat room rather than hidden on your own machine, every time you run a task, you teach someone else how to do it.<p>Hubot has been wildly successful at GitHub and is amazing in action. We saw GitHub’s ops team fight off the biggest DDoS attack in history from chat using Hubot, while people were cheering along in another channel using Hubot to find appropriate hype gifs.  But the effect on day-to-day work was even more amazing. Anyone could easily find out what was recently deployed, how to deploy, monitor servers, page people, you name it. New employees could see how to do all those things as soon as they joined. Since there were fun commands inside of Hubot, it was great for team building, too.<p>We believe more companies would benefit from working this way. When Covid hit, many companies suddenly found themselves struggling to make distributed teams work better. It is challenging to understand what everyone is doing, or even how to do regular tasks, since it&#x27;s not easy to tap someone on the shoulder and ask. We decided to build Abbot to help teams adopt this style of work.<p>When we started, we built a list of what <i>wasn’t</i> fun about Hubot. Hubot required a lot of configuration, wasn’t reachable if chat was down, testing new scripts could be painful, there was no unified way to manage permissions, and so forth. We built Abbot as a hosted platform that handles all these things so developers don’t have to.<p>Because Abbot is a platform, we provide a unified interface for auditing, access control, data access and more. If users understand how to use a single Abbot command (or “skill” in Abbot parlance), they&#x27;ll know how to use any other Abbot command. Since we built Abbot to support multiple chat systems, we made it so that all Abbot commands are cross platform – commands written for Slack will work in Discord, and so forth. You can write commands in C#, Python, or JavaScript (we will support more languages in the future). We also do a lot of things Hubot does not, like allowing users to control access to the execution of their commands from inside of chat, or exposing an API endpoint for every command so that they can react to the outside world. There’s nothing to fork or configure – you can get started in two clicks from our website.<p>Abbot has a Package Directory where people can share the commands they’ve written. There are a few dozen packages in the directory today, with more being added every week. Packages are MIT licensed and installable in one click. Because it&#x27;s so easy to create new commands, teams tend to create a lot of small ones that accomplish a single task. For example, we have a `tweet` command that allows us to use chat as our communal Twitter client (available in the Package Directory at <a href=\"https:&#x2F;&#x2F;ab.bot&#x2F;packages&#x2F;aseriousbiz&#x2F;tweet\" rel=\"nofollow\">https:&#x2F;&#x2F;ab.bot&#x2F;packages&#x2F;aseriousbiz&#x2F;tweet</a>).<p>Today, people use Abbot to deploy Git branches to staging environments, track daily standups, figure out time zones for all their teammates, give each other internet high-fives (well, sparkle points), and even open their office door. We are focused on DevOps and customer support teams right now, but believe ChatOps can make a big impact on every team that has a channel in your chat.<p>We are open for business! You can add Abbot to your Slack, Discord, or MS Teams chat by clicking &quot;Try for free&quot; at <a href=\"https:&#x2F;&#x2F;ab.bot\" rel=\"nofollow\">https:&#x2F;&#x2F;ab.bot</a>. We have a free tier that allows people to try it out without any commitments. We don&#x27;t ask for any information to sign up, you just have to authorize Abbot into chat. For paying users, we charge based on the number of custom commands, number of actions taken, or access to paid features like access controls. Right now we are SaaS only, but will offer a hybrid-premises version in the future.<p>We are sure that many of you have built your own chatbots and ChatOps tools before. We’re especially interested in hearing about what worked well and what was challenging when building and operating them! And we hope you can give Abbot a try. Have at it, HN!",
      "time": 1627402067,
      "title": "Launch HN: Abbot (YC S21) – ChatOps as a Service, Inspired by GitHub's Hubot",
      "type": "story"
    },
    {
      "by": "mrry",
      "descendants": 0,
      "id": 27974072,
      "score": 1,
      "time": 1627402045,
      "title": "Jay Parikh joins Lacework as co-CEO",
      "type": "story",
      "url": "https://www.lacework.com/press-release/lacework-announces-new-co-ceo-jay-parikh/"
    },
    {
      "by": "Tomte",
      "descendants": 0,
      "id": 27974057,
      "score": 1,
      "time": 1627401993,
      "title": "Flush with innovation: 10 years of reinventing the toilet",
      "type": "story",
      "url": "https://www.gatesnotes.com/Development/10-years-of-reinventing-the-toilet"
    },
    {
      "by": "SirIsaac",
      "descendants": 0,
      "id": 27974055,
      "score": 1,
      "time": 1627401985,
      "title": "Textbook Kinetic Energy Equation (E = 1/2 mv²) is Wrong",
      "type": "story",
      "url": "https://medium.com/@RebelScience/einsteins-e-mc%C2%B2-can-be-instantly-derived-from-newtonian-physics-221add5dbfe2"
    },
    {
      "by": "philzook",
      "descendants": 0,
      "id": 27974050,
      "score": 1,
      "time": 1627401965,
      "title": "Egglog: A Prolog Syntax for the Egg Egraph Library (2021)",
      "type": "story",
      "url": "https://www.philipzucker.com/egglog-checkpoint/"
    }
  ]
}