{
  "stories": [
    {
      "by": "bryanrasmussen",
      "descendants": 0,
      "id": 27830985,
      "score": 1,
      "time": 1626252566,
      "title": "The Tangled Topology of Knots",
      "type": "story",
      "url": "https://www.wsj.com/articles/the-tangled-topology-of-knots-11625781814"
    },
    {
      "by": "imartin2k",
      "descendants": 0,
      "id": 27830983,
      "score": 1,
      "time": 1626252548,
      "title": "Dogs Understand Humans",
      "type": "story",
      "url": "https://theness.com/neurologicablog/index.php/about/"
    },
    {
      "by": "4thstreet",
      "descendants": 0,
      "id": 27830978,
      "score": 1,
      "text": "Hey, we’re Naz and Charlie! We’re a couple of engineers who discovered that payroll in the UK is pretty backward and that building good software can raise the bar a bunch. We built [Onfolk](<a href=\"https:&#x2F;&#x2F;onfolk.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;onfolk.com&#x2F;</a>).<p>You can check out some pics on our Product Hunt post [1] or see a quick vid [2].<p>To set the scene: we were software engineers at Monzo for 4 years. Joined at 400k customers, left at 5.5m. We took voluntary furlough in April 2020 (&quot;furlough&quot; is the UK government’s scheme for keeping workers paid for a bit so that companies don&#x27;t have to lay them off). During that time, Monzo changed payroll provider. The old one sucked and had errors. The new one sucked and had errors. It took a consultant a year to implement the new one.<p>We wondered how on earth a company with our funding, whose main asset was its people, couldn&#x27;t find a good way to pay them. We dug into what doing payroll actually means (shout out to payroll guru Duane Jackson [3] for the early pointers!). Turns out, payroll is: (1) gross-to-net calculations, (2) reporting that to the government, and (3) making payslips. It’s not conceptually hard but you have to be meticulous. Complicated, not complex.<p>Some of the payroll products in the UK have 0 automated tests in their software. A typical process is run on spreadsheets pulled out of HR softwares or emails to accountants. No validation, data keyed in on the other end. Payroll is unloved.<p>There are a huge amount of edge cases. Tax systems aren&#x27;t put in place all at once – they evolve over time.<p>So when you&#x27;re programming payroll you run into things like: gender is a mandatory field to report to the government and a binary male&#x2F;female. Until April 1977 married women could choose to pay a reduced rate of national insurance (our word for &quot;social security&quot; in the UK). Anyone who opted into that scheme before 1977 might still be on it.<p>Another one: Deep-sea fisherman have their own national insurance rates [4]. The government changes people&#x27;s tax codes periodically, and sometimes the reasons why can seem quite baffling. It&#x27;s not a very transparent system<p>Turns out the competition is listed on the government&#x27;s website [5]. There’s about 130 other payroll softwares. Desktop software still dominates the UK market (&quot;cloud&quot; is a feature in payroll land).<p>We discovered the certification process to get on the list, found the right person in the government to email when we had questions, and kinda just started building. We trundled on over our weekends until we got on the list (might still be under our old name, “Hyko”, at the time of writing. Hyko is a dog [6]).<p>Then, a friend who’s payroll provider had just got their numbers wrong decided to let us do theirs. I phoned up Charlie, who said “I guess I’d better put the kettle on” (yes, we’re British). There were less than 2 weeks to get it done and we worked like maniacs over Christmas to arrive at something that looked like a payrun.<p>The calculations were run from test files on our local machines, as was notifying the government via their XML API with random polling intervals. I made the payslips on Figma. It was artisanal.<p>Since then, here’s a few ways we’ve tried our best to raise the bar on the software side: Thorough automated unit tests on our calculation logic; integration tests for playing through multiple months of salaries (especially important as tax calculations in the UK care about the cumulative amount paid over a year vs. only concerning the current month); whenever anything changes, we recreate payments for the current month on the fly. So that the user always has a live view of what payroll will be (vs. finding out on the day); Reconciliation logic. So that if things that should add up don&#x27;t add up, we error loudly way before payday. This reduces the chances that we&#x27;ll ever run payroll with incorrect numbers (techniques learnt while interacting with banking ledgers); Wrote in a language with a strong compiler (Go); Generally validate the shit out of everything.<p>Since Christmas, the product has expanded from payroll into one tool for everything that touches employee data. We think that a ton of the manual admin work in UK companies results from no &#x27;single source of truth&#x27; for employee data (often spread across Xero, accountants, spreadsheets, time-tracking software, Google Drive).<p>The same data is duplicated in multiple tools, which means it has to be synced, which means spreadsheet exports and manual process. e.g. when an employee leaves, you usually want their remaining time-off allowance to be automatically added to their final salary, reported to the government as such, and to have them removed from payroll, time-off rotas etc. Typically, that means a bunch of faffy jobs where people get paid wrong if you mess up.<p>We’ve tried to kick off everything that needs to be done from key actions (new joiner, leaver, salary update, payrun). When a payrun is started, from our backend: the UK government is notified, payslips are created, journals are posted to accounting software, pension contributions are posted, and payments are scheduled.<p>As an employee you don’t have to log in to “myEPayslipPortal” to get your payslip. It’s there alongside your time-off and personal info.<p>This autumn we’ll be working on exposing our backend as a UK payroll API. So that anyone can have payroll in their product without having to care about unintuitive tax calculations and keeping up with changes in regulations.<p>I’d be interested if our findings ring true with anyone&#x27;s payroll experiences. Any ideas for applications for a payroll API? Or interesting implications come to mind with having a source of truth for all your employee data?<p>[1] <a href=\"https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;onfolk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.producthunt.com&#x2F;posts&#x2F;onfolk</a>\n[2] <a href=\"https:&#x2F;&#x2F;loom.com&#x2F;share&#x2F;3ac431db7c4e46e7a14921c5f98a3f68\" rel=\"nofollow\">https:&#x2F;&#x2F;loom.com&#x2F;share&#x2F;3ac431db7c4e46e7a14921c5f98a3f68</a>\n[3] <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;society&#x2F;2015&#x2F;aug&#x2F;16&#x2F;i-got-caught-drug-trafficking-duane-jackson\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;society&#x2F;2015&#x2F;aug&#x2F;16&#x2F;i-got-caught...</a>\n[4] <a href=\"https:&#x2F;&#x2F;www.gov.uk&#x2F;government&#x2F;publications&#x2F;ca42-foreign-going-mariners-and-deep-sea-fishermen\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gov.uk&#x2F;government&#x2F;publications&#x2F;ca42-foreign-goin...</a>\n[5] <a href=\"https:&#x2F;&#x2F;www.gov.uk&#x2F;payroll-software&#x2F;paid-for-software\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gov.uk&#x2F;payroll-software&#x2F;paid-for-software</a>\n[6] <a href=\"https:&#x2F;&#x2F;www.lukeleighfield.fyi&#x2F;blog&#x2F;hyko\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lukeleighfield.fyi&#x2F;blog&#x2F;hyko</a>",
      "time": 1626252475,
      "title": "Launch HN: Onfolk (YC S21) – Modern HR and Payroll in One Place (For the UK)",
      "type": "story"
    },
    {
      "by": "MrJagil",
      "descendants": 0,
      "id": 27830959,
      "score": 2,
      "time": 1626252251,
      "title": "Nanostructure design enables new possibilities for e-paper in color",
      "type": "story",
      "url": "https://pubs.acs.org/doi/10.1021/acs.nanolett.1c00904#"
    },
    {
      "by": "todsacerdoti",
      "descendants": 0,
      "id": 27830941,
      "score": 2,
      "time": 1626252108,
      "title": "PostgreSQL: Limit vs. Fetch First Rows with Ties",
      "type": "story",
      "url": "https://www.cybertec-postgresql.com/en/postgresql-limit-vs-fetch-first-rows-with-ties/"
    },
    {
      "by": "jeremy_stuart",
      "descendants": 1,
      "id": 27830940,
      "kids": [
        27830980
      ],
      "score": 4,
      "time": 1626252093,
      "title": "iOS app of Projectium appears in App Store before release",
      "type": "story",
      "url": "https://apps.apple.com/ua/app/projectium/id1543252843"
    },
    {
      "by": "PatrisciaJohn",
      "descendants": 0,
      "id": 27830934,
      "score": 1,
      "time": 1626251964,
      "title": "iPhone Screen Touch Not Working Properly-Fixed",
      "type": "story",
      "url": "https://www.reddit.com/user/PatrisciaJohn31/comments/ok05a7/iphone_screen_touch_not_working_properlyfixed/"
    },
    {
      "by": "svenfaw",
      "descendants": 0,
      "id": 27830927,
      "score": 1,
      "time": 1626251833,
      "title": "REvil ransomware gang's web sites mysteriously shut down",
      "type": "story",
      "url": "https://www.bleepingcomputer.com/news/security/revil-ransomware-gangs-web-sites-mysteriously-shut-down/"
    },
    {
      "by": "indiantinker",
      "descendants": 0,
      "id": 27830922,
      "score": 1,
      "time": 1626251792,
      "title": "Touchbar Keyboard",
      "type": "story",
      "url": "https://www.cnx-software.com/2021/07/02/ficihip-multifunctional-keyboard-12-6-inch-touchscreen-display/"
    },
    {
      "by": "krige",
      "descendants": 0,
      "id": 27830912,
      "score": 1,
      "time": 1626251652,
      "title": "Discord buys Sentropy for its AI powered moderation tools",
      "type": "story",
      "url": "https://techcrunch.com/2021/07/13/discord-buys-sentropy/"
    }
  ]
}