{
  "stories": [
    {
      "by": "gmcharlt",
      "descendants": 0,
      "id": 27847226,
      "score": 1,
      "time": 1626369855,
      "title": "A Modest Proposal About Ransomware",
      "type": "story",
      "url": "https://blog.dshr.org/2021/07/a-modest-proposal-about-ransomware.html"
    },
    {
      "by": "theafh",
      "descendants": 0,
      "id": 27847219,
      "score": 1,
      "time": 1626369828,
      "title": "Verifiable Design in Modern Systems",
      "type": "story",
      "url": "https://security.googleblog.com/2021/07/verifiable-design-in-modern-systems.html"
    },
    {
      "by": "eplanit",
      "descendants": 0,
      "id": 27847183,
      "score": 2,
      "time": 1626369670,
      "title": "Rapid increases and extreme months in projections of US high-tide flooding",
      "type": "story",
      "url": "https://www.nature.com/articles/s41558-021-01077-8"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27847138,
      "score": 1,
      "time": 1626369444,
      "title": "Artificial Intelligence at EU Borders [pdf]",
      "type": "story",
      "url": "https://www.europarl.europa.eu/RegData/etudes/IDAN/2021/690706/EPRS_IDA(2021)690706_EN.pdf"
    },
    {
      "by": "reach_Chris",
      "descendants": 0,
      "id": 27847103,
      "score": 1,
      "text": "How can it be that technology today is so sophisticated but I still have to remember where I saved my stuff, in which folder I put my document or what I have in my bookmarks, at the moment where I need it? The way we store and manage documents literally has not changed since our days of physical paper, folders and cabinets. It’s just not intuitive – when I try to remember something, I also don’t look through my brain trying to figure out where I stored it in there. I try to remember what it was about, and use as much contextual information about it as I can remember, until I have enough puzzle pieces together; “right – where did I hear about it, who told me this, when did I come across it, what other information is it related to, what was it about?” So I sat down with my talented developer friend and tried to reverse engineer the way human memory works, learning about neuroscience, speaking to knowledge management experts, going all in – and it led us to graph databases. In a graph database, items are connected to each other and carry meta descriptions, which essentially means information about the item – descriptors. And based on that, we built Reach, a completely novel way to store documents, websites, media, contacts, notes, absolutely anything. Now, finally, instead of having to remember a given folder path or certain keywords, there’s a multitude of angles from which I can get to the data I need, I can easily search for it by typing in anything I remember about it, or I can precisely navigate through my content if I’m not sure what exactly I’m searching for, I just need to know the general topic. It works like an interconnected library with copies of books in every place you could possibly need them – except they’re not copies but the same exact item appearing in all the relevant places, keeping it light. So whether you’re browsing or searching, you’re guaranteed to get to the data you need, no matter when you saved it or where you saved it. And doing it this way doesn’t only make the discovery of your content faster and more intuitive, also saving it is much quicker. You don’t need to choose or create folders and subfolders, you just throw it in there, select relationships and add any description that might be useful later on. With time, AI will automate this process. This way, we managed to build a Second Brain for all your digitally stored knowledge that works just the way you think. This also means that sharing an entire knowledge base becomes so much easier because you don’t need to tell anybody where you saved stuff, the easiest brain transplant ever. And we’re not stopping here. Next on our bucket list, we’re planning to go one step further and allow qualified users to publish their knowledge base – or ‘workspace’. This will make Reach a one-of-a-kind, curated search engine with content that’s hand-selected around a particular topic. Users who access a workspace will be able to suggest additions or modifications to the creator of the collection. This extends Reach to a powerful collaborative research and learning platform that enables anybody to develop expertise around certain subjects, with all the best selected resources in one place.\nWe just launched our Beta and we’re giving access to our first users. You can enter our waitlist too, we’ll give you free access asap - plus, there’s some hacks that can make you skip the queue. Check out our startup, the future of virtual memory: https:&#x2F;&#x2F;rea.ch",
      "time": 1626369268,
      "title": "Where the fuck did I save that? It drove me crazy, so I built a personal Google.",
      "type": "story"
    },
    {
      "by": "danso",
      "descendants": 0,
      "id": 27847096,
      "score": 2,
      "time": 1626369242,
      "title": "Soldiers Speak Out about Being Blocked from Repairing Equipment by Contractors",
      "type": "story",
      "url": "https://mattstoller.substack.com/p/a-real-s-show-soldiers-angrily-speak"
    },
    {
      "by": "ndewda",
      "descendants": 1,
      "id": 27847092,
      "kids": [
        27847115
      ],
      "score": 2,
      "time": 1626369224,
      "title": "Show HN: No-code publishing platform with the ease of Notion",
      "type": "story",
      "url": "https://edition.so/?ref=hackernews"
    },
    {
      "by": "alanfranz",
      "descendants": 0,
      "id": 27847090,
      "score": 2,
      "time": 1626369214,
      "title": "Object-Relational Mapping Is the Vietnam of Computer Science (2006)",
      "type": "story",
      "url": "http://blogs.tedneward.com/post/the-vietnam-of-computer-science/"
    },
    {
      "by": "infodocket",
      "descendants": 0,
      "id": 27847063,
      "score": 1,
      "time": 1626369068,
      "title": "Learning to Recommend Items to Wikidata Editors",
      "type": "story",
      "url": "https://arxiv.org/abs/2107.06423"
    },
    {
      "by": "kdig2412",
      "descendants": 0,
      "id": 27847015,
      "score": 1,
      "time": 1626368865,
      "title": "NASA’s Apollo program kicked off Silicon Valley’s tech revolution",
      "type": "story",
      "url": "https://www.cnn.com/2019/08/04/tech/nasa-management-apollo-silicon-valley-scn/index.html"
    }
  ]
}