{
  "stories": [
    {
      "by": "SwiftERM",
      "descendants": 0,
      "id": 30175885,
      "score": 1,
      "time": 1643798101,
      "title": "The value of getting personalisation right",
      "type": "story",
      "url": "https://www.swifterm.com/the-value-of-getting-personalisation-right/"
    },
    {
      "by": "ksec",
      "descendants": 0,
      "id": 30175871,
      "score": 1,
      "time": 1643798012,
      "title": "China to launch chipmaking platform as it targets Intel and AMD",
      "type": "story",
      "url": "https://asia.nikkei.com/Business/Electronics/China-to-launch-chipmaking-platform-as-it-targets-Intel-and-AMD"
    },
    {
      "by": "jstrafy",
      "descendants": 0,
      "id": 30175863,
      "score": 1,
      "text": "Hey there,<p>First time posting on Hacker News in about 2 years! The reason I’m posting is that I thought I’d write about the product I’ve been building, in hopes it resonates with people.<p>Why build yet another social app? Because I deleted almost all social media around 3&#x2F;4 years ago as it was just net negative on my life. There was very little that was truly interesting, I didn’t care about looking good to other people and because of the ‘media’ and ads, the apps were all designed to make me spend too much time for what I was getting. I hated it and what it meant for people’s behaviour, including mine and my friends.<p>I also noticed that the vast majority of my friends were pretty much passive on the services, even if they had an account. Turns out that most people felt uncomfortable sharing to people they didn’t know too well, which inevitably happens as you meet new people, add them, and often don’t develop the relationship much further. I had a sense that there could be a better way.<p>In that, I remembered the days of Path and Google+ which had the model of focusing on particular people in your network, both through the feed and in how you shared. Path in particular was a ‘real life’ social network, something that despite being brought to market in 2010 or whatever, seemed to be more relevant today.<p>So problem found, problem solved. I took the journey of learning how to code when COVID hit (I was working in Architecture and Design and was about to start my masters degree at Harvard GSD in Boston), then one thing led to another, my prototype garnered some investment interest, and Circles was born.<p>The idea is very much like the name suggests, it’s about adding your contacts (synced through your phonebook) into Circles that define what the relationship is. This means that you only see things from people you have tagged (rather than everyone) and when you share, you choose exactly who it goes to (rather than all your friends or followers).<p>It also takes cues from other privacy focused social products. Posts are encrypted, reactions and comments are only shown to people who are contacts with eachother, and user profiles only show that which has been explicitly shared to the user viewing the profile.<p>As they were mentioned briefly before, it’s essentially a crossover between Path and Google+ with a wrap around layer of privacy, so the potential revenue has to eventually come through paid features rather than ads.<p>We’re in the app store and google play store (yay, cross-platform JS frameworks), the invite code is ‘FULLCIRCLE’ and download links are below:<p>Landing: [https:&#x2F;&#x2F;oncircles.com](https:&#x2F;&#x2F;oncircles.com)<p>iOS: [https:&#x2F;&#x2F;apps.apple.com&#x2F;gb&#x2F;app&#x2F;circles-share-more-with-less&#x2F;id1532621483](https:&#x2F;&#x2F;apps.apple.com&#x2F;gb&#x2F;app&#x2F;circles-share-more-with-less&#x2F;id1532621483)<p>Android: [https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.oncircles](https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.oncircles)<p>I would love to hear your feedback and suggestions on the idea. Hit or miss?<p>PS: If you want to chat about the idea or are interested in working together I’d love to chat. Always interesting to meet people on HN and we have the funds, ideas and drive to continue making cool things that can solve big problems. Send me an email at james@oncircles.com<p>Thanks!",
      "time": 1643797955,
      "title": "Show HN: What do you think of my new social app?",
      "type": "story"
    },
    {
      "by": "xojoc",
      "descendants": 0,
      "id": 30175851,
      "score": 1,
      "time": 1643797816,
      "title": "Pathbird – Interactive Courses",
      "type": "story",
      "url": "https://pathbird.com/"
    },
    {
      "by": "giuliomagnifico",
      "descendants": 0,
      "id": 30175850,
      "kids": [
        30175855
      ],
      "score": 1,
      "time": 1643797811,
      "title": "Myanmar Junta's new law to jail anyone is using VPN, total control on users data",
      "type": "story",
      "url": "https://www.irrawaddy.com/news/burma/myanmar-juntas-new-cyber-law-to-jail-anyone-using-vpn.html"
    },
    {
      "by": "throwawaynay",
      "descendants": 0,
      "id": 30175830,
      "score": 1,
      "text": "I&#x27;m a beginner in AI&#x2F;ML and I&#x27;ve been wondering for a while if it&#x27;s possible to create software that would test your English level automatically.<p>For example a callbot that would have a conversation with you, and determine if what you say make sense and if your accent isn&#x27;t horrendous.<p>Do you think state of the art AI could be able to solve this problem? or is it way too early for that?<p>Have you heard of anyone attempting this?",
      "time": 1643797602,
      "title": "Ask HN: Is there any software capable of testing your spoken English?",
      "type": "story"
    },
    {
      "by": "saimiam",
      "descendants": 0,
      "id": 30175821,
      "score": 1,
      "time": 1643797479,
      "title": "Sorting Emails in PretzelBox",
      "type": "story",
      "url": "https://pretzelbox.notion.site/Sorting-emails-in-PretzelBox-8aa76a5ff9b847e29adf38f21a046e78"
    },
    {
      "by": "redbell",
      "descendants": 0,
      "id": 30175803,
      "score": 1,
      "time": 1643797303,
      "title": "Analyzing Every Reddit Submission with BigQuery (2015)",
      "type": "story",
      "url": "https://minimaxir.com/2015/10/reddit-bigquery/"
    },
    {
      "by": "sAbakumoff",
      "descendants": 0,
      "id": 30175795,
      "score": 2,
      "time": 1643797229,
      "title": "Rotterdam bridge taken apart to let through Jeff Bezos pleasure yacht",
      "type": "story",
      "url": "https://nltimes.nl/2022/02/02/rotterdam-bridge-taken-apart-let-jeff-bezos-pleasure-yacht"
    },
    {
      "by": "dusted",
      "descendants": 0,
      "id": 30175769,
      "score": 3,
      "time": 1643796984,
      "title": "Whoopi Goldberg banned for saying holocaust was not about race",
      "type": "story",
      "url": "https://www.nytimes.com/2022/02/01/us/whoopi-goldberg-holocaust.html"
    }
  ]
}