{
  "stories": [
    {
      "by": "Austin_Conlon",
      "descendants": 0,
      "id": 29457558,
      "score": 1,
      "time": 1638779822,
      "title": "Ask HN: What are your thoughts on web3?",
      "type": "story"
    },
    {
      "by": "imcarlos",
      "descendants": 0,
      "id": 29457555,
      "score": 1,
      "time": 1638779779,
      "title": "Forex Economic Calendar",
      "type": "story",
      "url": "https://kairibull.com/economic-calendar.php"
    },
    {
      "by": "mdp2021",
      "descendants": 0,
      "id": 29457548,
      "score": 1,
      "time": 1638779702,
      "title": "Germany plans to make Covid-19 vaccination compulsory for some jobs",
      "type": "story",
      "url": "https://www.channelnewsasia.com/world/germany-plans-make-covid-19-vaccination-compulsory-some-jobs-2360211"
    },
    {
      "by": "T-A",
      "descendants": 0,
      "id": 29457530,
      "score": 1,
      "time": 1638779586,
      "title": "Quickly create and run optimised Windows, macOS and Linux desktop VMs",
      "type": "story",
      "url": "https://github.com/quickemu-project/quickemu"
    },
    {
      "by": "deadalus",
      "descendants": 0,
      "id": 29457512,
      "score": 2,
      "time": 1638779450,
      "title": "Ameca Humanoid Robot AI Platform [video]",
      "type": "story",
      "url": "https://www.youtube.com/watch?v=IPukuYb9xWw"
    },
    {
      "by": "marcodiego",
      "descendants": 0,
      "id": 29457505,
      "score": 1,
      "time": 1638779396,
      "title": "Terminal.Gui – Cross Platform Terminal GUI Toolkit for .NET",
      "type": "story",
      "url": "https://github.com/migueldeicaza/gui.cs"
    },
    {
      "by": "question11",
      "descendants": 0,
      "id": 29457502,
      "score": 1,
      "text": "Back in the day Usenet had a wealth of interesting information. Then blogs for a while took over with RSS pings and google reader.<p>Now the noise seems to be higher than the signal for me in most forums. Where to go for the good intelligent discussion. HN? Twitter (too short)? Reddit subforums?",
      "time": 1638779377,
      "title": "Ask HN: Smart messaging forums other than HN?",
      "type": "story"
    },
    {
      "by": "cmsefton",
      "descendants": 0,
      "id": 29457485,
      "score": 1,
      "time": 1638779219,
      "title": "World’s vast networks of underground fungi to be mapped for first time",
      "type": "story",
      "url": "https://www.theguardian.com/science/2021/nov/30/worlds-vast-networks-of-underground-fungi-to-be-mapped-for-first-time"
    },
    {
      "by": "zwaps",
      "descendants": 0,
      "id": 29457470,
      "score": 1,
      "text": "I am looking for a comprehensive resource on data visualization. There are many individual resources that have been posted over the years (such as in blog posts). However, as a non-expert I am not sure which advice is good to follow (e.g., many blogs are published by companies trying to sell me a particular product or package).<p>Not sure if the book is the ideal format for this, but it seems to have the highest chance of being competent, unbiased and comprehensive. For the latter point, I think important topics are<p>- Colors and accessibility<p>- Concrete examples of color schemes<p>- Pros and Cons of different visualizations vis-à-vis data<p>- Print versus digital<p>- Fonts and layout considerations<p>- Perhaps short insights into the research on these points<p>But perhaps there are other things not on my radar that are current or interesting?",
      "time": 1638779027,
      "title": "Ask HN: What is the best book on data visualization in 2021?",
      "type": "story"
    },
    {
      "by": "usamaejaz",
      "descendants": 0,
      "id": 29457463,
      "score": 2,
      "text": "Hey everyone,<p>I struggle and find it hard and time-consuming to write content for my social media accounts and so I started building this. I know that AI models can help, but it&#x27;s taken me some time and research into them before creating something myself so other people might find this useful as well!<p>The tool takes care of all those pesky tasks like suggesting topics or writing original content - saving you hours every day in tedious work.<p>All you have to do is fill in some details about the content you want it to write about and voila, instant results.<p>Here is the demo: https:&#x2F;&#x2F;socialbu.com&#x2F;tools&#x2F;generate-posts<p>Here is an example: https:&#x2F;&#x2F;i.imgur.com&#x2F;ZYjfnAA.png<p>The reason for sharing this is I want to know if this is really useful to others or if I am just alone.",
      "time": 1638778944,
      "title": "Just built an AI writer for social media posts – useful?",
      "type": "story"
    }
  ]
}