{
  "stories": [
    null,
    {
      "by": "Deceptive",
      "descendants": 0,
      "id": 31668901,
      "score": 1,
      "text": "Last night my site received a sign-up from someone using a Proton email. The name in the email address didn&#x27;t match the name they used on my site, their phone number contained an area code that does not exist, and they accessed us via VPN.<p>I canceled the account without notice because from what I know about the internet this is clearly some form of intended illegal activity.<p>How do I protect against this with introducing no additional friction to my legit customers?",
      "time": 1654702470,
      "title": "Suspicious User Concerns",
      "type": "story"
    },
    {
      "by": "ivan_gammel",
      "descendants": 0,
      "id": 31668877,
      "score": 1,
      "time": 1654702392,
      "title": "Deutsche Bank launches Berlin tech hub, draws staff from Russia operations",
      "type": "story",
      "url": "https://www.reuters.com/business/finance/deutsche-bank-forms-berlin-tech-centre-largely-staffed-by-russians-2022-06-07/"
    },
    {
      "by": "gkop",
      "descendants": 0,
      "id": 31668828,
      "score": 2,
      "time": 1654702215,
      "title": "You’ll Always Miss Being in the Basement (2015)",
      "type": "story",
      "url": "https://zachholman.com/posts/the-basement/"
    },
    {
      "by": "adenta",
      "descendants": 0,
      "id": 31668817,
      "score": 1,
      "text": "Doing a quick one question survey for all the software engineers out there, who are tired of reinventing the wheel every 5 or so years.<p>https:&#x2F;&#x2F;forms.gle&#x2F;MFWS8KnszXkVfeR97",
      "time": 1654702195,
      "title": "What have you had to build and rebuild, everywhere you go?",
      "type": "story"
    },
    {
      "by": "blintz",
      "descendants": 0,
      "id": 31668814,
      "score": 1,
      "time": 1654702173,
      "title": "Show HN: Read Wikipedia privately using homomorphic encryption",
      "type": "story",
      "url": "https://spiralwiki.com/"
    },
    {
      "by": "weusedto",
      "descendants": 0,
      "id": 31668788,
      "score": 3,
      "text": "Hello, a co-founder and I started a company in December of 2021. We’ve built an MVP that runs well, and have created a lot of content and built a presence in the community we aim to solve a problem for. We do not have any paying customers or a meaningful non-paying user base.<p>My co-founder has written all of the code, I have been responsible for leading growth, marketing, content creation, and have been central to product development&#x2F;design&#x2F;mockups etc (while not writing code). We signed a founders agreement, we each have a seat on the board, and he holds a majority of shares. None of our shares have vested - my first vesting date is in 6 months when ¼ of my shares vest.<p>My co-founder has decided he wants to pivot to what I view as an entirely new business that has little to do with the problem or mission we set off to address. We set out to build a product that solves a problem, and he has decided to start a staffing agency. He is quite “failure-averse”, and while I can understand he believes a staffing agency may have a higher likelihood of success, it is uninteresting to me and I don’t believe it is a good use of my time.<p>As we have only been trying this for a short period, I am still interested in pursuing our initial idea and seeing if I can make it work.<p>My co-founder has said he would be fine with me pursuing the initial idea as an entirely separate venture. The code is not proprietary in nature, it supports a very simple workflow and presents basic data. As I am not technical enough to re-create the product myself, it would be time&#x2F;resource intensive to build something similar from scratch. When I asked my co-founder for rights to use the existing code in my new venture, he refused, citing concerns over sharing IP.<p>I have dedicated myself to this mission for the past 6 months (which I recognize is relatively short), and don’t love the idea of walking away with nothing to show for my time - but is that my only option?<p>Really appreciate any insights from anyone who has been through something like this or has any thoughts. Will answer any questions that might come up. Thank you very much for reading.",
      "time": 1654702063,
      "title": "Ask HN: Co-Founder pivoting, what are my options?",
      "type": "story"
    },
    {
      "by": "openplatypus",
      "descendants": 0,
      "id": 31668787,
      "score": 1,
      "time": 1654702063,
      "title": "FloC, FLEDGE and the Privacy of Yours",
      "type": "story",
      "url": "https://wideangle.co/blog/google-floc-flegde-privacy-risks"
    },
    {
      "by": "mik3y",
      "descendants": 0,
      "id": 31668760,
      "score": 1,
      "time": 1654701961,
      "title": "Our Mission Patches",
      "type": "story",
      "url": "https://medium.ethyca.com/our-mission-patches-d2dffd9b6d6d"
    },
    {
      "by": "Figgy24",
      "descendants": 0,
      "id": 31668755,
      "score": 2,
      "time": 1654701938,
      "title": "Supplementing Your Studying with Mock Interviews",
      "type": "story",
      "url": "https://www.hackpack.io/blog/mock-interviews/mock-coding-interviews-important"
    }
  ]
}